//QC225054 JOB (),'TEST VSMDATA',
//    NOTIFY=QC22505,
//    MSGLEVEL=(2,0),PRTY=0,CLASS=K,MSGCLASS=X
/*JOBPARM LINES=150
//*
//*   THIS JOB RUNS PROGRAM VSMDATA ON ITSELF IN BATCH AND
//*   GENERATES THE REPORT.
//*
//*   REPLACE QC22505.OUTPUT2.DATA WITH THE NAME OF THE NEW FILE
//*   YOU WANT TO PUT THE REPORT IN.
//*
//*   REPLACE QC22505.VSMDUMP.LOAD WITH THE NAME OF THE
//*   LOAD LIBRARY PROGRAM FIXDCB (COMPILED IN @COMPILE) IS IN.
//*
//*   SEE THE BEGINING OF MEMBER VSMDUMP FOR A DESCRIPTION OF
//*   THE FIELDS IN THE REPORT
//*
//KILL      EXEC PGM=IEFBR14
//DD2       DD DSN=QC22505.OUTPUT2.DATA,
//             DISP=(MOD,DELETE),UNIT=SYSDA,SPACE=(TRK,1)
//*
//VSMDATA EXEC PGM=VSMDATA
//STEPLIB   DD DSN=QC22505.VSMDUMP.LOAD,DISP=SHR
//PRINT     DD SYSOUT=*
//*
//OUTPUT    DD DSN=&&OUTPUT,
//             DISP=(NEW,CATLG),
//             UNIT=SYSDA,SPACE=(CYL,(5,1),RLSE)
//*
//SORT1  EXEC  PGM=SORT,REGION=5000K
//*
//SORTLIB   DD DSN=SYS1.SORTLIB,DISP=SHR
//*
//SORTIN    DD DSN=&&OUTPUT,DISP=(OLD,DELETE),
//             DCB=(LRECL=266,RECFM=FB,BLKSIZE=10640)
//*
//SORTOUT   DD DSN=QC22505.OUTPUT2.DATA,
//             DISP=(NEW,CATLG),
//             UNIT=SYSDA,SPACE=(CYL,(5,1),RLSE),
//             DCB=(LRECL=266,RECFM=FB,BLKSIZE=10640)
//*
//SYSOUT    DD SYSOUT=*
//*
//SORTWK01  DD UNIT=SYSDA,SPACE=(CYL,(65))
//*
//SORTWK02  DD UNIT=SYSDA,SPACE=(CYL,(65))
//*
//SORTWK03  DD UNIT=SYSDA,SPACE=(CYL,(65))
//*
//SYSIN     DD *
 SORT FIELDS=(2,8,AC,A),EQUALS
 RECORD TYPE=F,LENGTH=(266,266,266)
//*
//FIXDCB2 EXEC PGM=FIXDCB
//STEPLIB   DD DSN=QC22505.VSMDUMP.LOAD,DISP=SHR
//FILE     DD  DSN=QC22505.OUTPUT2.DATA,DISP=SHR,
//             DCB=(LRECL=133,RECFM=FB,BLKSIZE=10640)
