//NYKOLYNA JOB  (X),NYKOLYN,MSGCLASS=X,CLASS=A,
// NOTIFY=&SYSUID
//**Asm
//ASMCL    PROC M=
//A    EXEC PGM=ASMA90,PARM=(OBJECT,NODECK,NOESD,NORLD)
//SYSLIB   DD DISP=SHR,DSN=SYS1.MACLIB
//         DD DISP=SHR,DSN=SYS1.AMODGEN
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,1)
//SYSLIN   DD UNIT=VIO,SPACE=(CYL,1),DISP=(,PASS),DCB=BLKSIZE=3200
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=NYKOLYN.RXQUERY.CNTL(&M),DISP=SHR
//*
//L       EXEC PGM=IEWL,PARM='RENT,REFR,REUS',COND=(4,LT,A)
//SYSLIN   DD DSN=*.A.SYSLIN,DISP=(OLD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSLMOD  DD DSN=NYKOLYN.A.LOAD(&M),DISP=SHR
//        PEND
//SLEEP   EXEC ASMCL,M=RXSLEEP
//WTO     EXEC ASMCL,M=RXWTO
//V2DEV   EXEC ASMCL,M=RXV2DEV
//SIQUERY EXEC ASMCL,M=RXSIQRY
