{"INMR01": {"INMLRECL": 80, "INMFNODE": "N1", "INMFUID": "SBGOLOB", "INMTNODE": "A", "INMTUID": "A", "INMFTIME": "20201220013621000000", "INMNUMF": 1}, "INMR02": {"1": {"INMUTILN": "IEBCOPY", "INMSIZE": 7994896, "INMDSORG": "PO", "INMTYPE": "None", "INMLRECL": 80, "INMBLKSZ": 5600, "INMRECFM": "FB", "INMDIR": 10, "INMDSNAM": "CBT.V500.FILE969.PDS", "numfile": 1}, "2": {"INMUTILN": "INMCOPY", "INMSIZE": 7994896, "INMDSORG": "PS", "INMLRECL": 32756, "INMBLKSZ": 3120, "INMRECFM": "VS", "numfile": 1}}, "INMR03": {"1": {"INMSIZE": 7994896, "INMDSORG": "PS", "INMLRECL": 80, "INMRECFM": "?"}}, "file": {"CBT.V500.FILE969.PDS": {"COPYR1": {"type": "PDS", "DS1DSORG": 512, "DS1BLKL": 5600, "DS1LRECL": 80, "DS1RECFM": "FB", "DS1KEYL": 0, "DS1OPTCD": 0, "DS1SMSFG": 0, "file_tape_blocksize": 3120, "DVAOPTS": 12336, "DVACLASS": 32, "DVAUNIT": 15, "DVAMAXRC": 32760, "DVACYL": 3340, "DVATRK": 15, "DVATRKLN": 58786, "DVAOVHD": 0, "num_header_records": 2, "DS1REFD": "200354", "DS1SCEXT": "b'\\x00\\x00\\x00'", "DS1SCALO": "b'\\x80\\x00\\x00\\xbe'", "DS1LSTAR": "b'\\x00{\\t'", "DS1TRBAL": "b'w\"'"}, "COPYR2": {"deb": "b'\\x01\\x00\\x00\\x00\\xff\\x00\\x00\\x00\\x8f\\x03\\xc0\\x00\\x04\\x9a\\xc0\\xd8'", "extents": ["b'\\x01\\x00\\x00\\x00\\xff\\x00\\x00\\x00\\x8f\\x03\\xc0\\x00\\x04\\x9a\\xc0\\xd8'", "b'X\\xf4\\xfd\\xd0\\x00\\x00\\n\\x0f\\x00\\x0e\\n\\x18\\x00\\x02\\x00|'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'", "b'\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00'"]}, "members": {"$$$#DATE": {"ttr": 516, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x05\\x00\\x00G\\x01 5\\x1f\\x01 5\\x1f\\x16I\\x00\\x0c\\x00\\x0c\\x00\\x00\\xc3\\xc2\\xe3`\\xf5\\xf0\\xf0@@@'", "ispf": {"version": "05.00", "flags": 0, "createdate": "2020-12-16T00:00:00", "modifydate": "2020-12-16T16:49:47", "lines": 12, "newlines": 12, "modlines": 0, "user": "CBT-500"}, "text": "REGULAR CBT TAPE - VERSION 500    FILE:  969\n\n    ORIGINAL DSNAME:  SBGOLOB.CBT500.FILE969\n    ---------------\n                    --RECFM-LRECL-BLKSIZE-DSORG\n                      FB    80    12000   PO\n\n   PDS117I 29 MEMBERS COUNTED; CUMULATIVE SIZE IS 75,808 RECORDS\n\n\nTIME THIS PDS WAS SHIPPED:   12/16/20    16:49:47    UTC-5:00\n\n", "mimetype": "text/plain", "datatype": "iso-8859-1", "extension": ".txt"}, "$$$DOC": {"ttr": 518, "alias": false, "halfwords": 30, "notes": 0, "parms": "b\"\\x01'\\x00\\x08\\x01\\x16\\x16/\\x01 \\x03\\x1f\\x12\\x02\\x01\\xad\\x00\\xb1\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@\"", "ispf": {"version": "01.39", "flags": 0, "createdate": "2016-06-10T00:00:00", "modifydate": "2020-01-31T12:02:08", "lines": 429, "newlines": 177, "modlines": 0, "user": "PDSE"}, "text": "The PDSEGEN ISPF Dialog found in this package will present the user with\na list of all members of their PDSE, including all generations.  There\nare many commands including Copy and Compare, and many line selection\noptions available, including Browse, Edit, View, Compare, Delete, J\n(submit), Promote, Rename and Recover.  The list of members will be\nupdated appropriately as members are edited, added, deleted, recovered,\nor promoted. This application will also work with non generation enabled\nPDSE's and PDS's.\n\nIn addition the PDSEGBAK and PDSEGRST applications are packaged with\nPDSEGEN - see the doc in @BACKUP\n\n* -------------------------- REQUIREMENTS ------------------------------ *\n*  This application requires z/OS 2.1 or newer to support access via     *\n*  ISPF to generations and does NOT support load libraries or aliases    *\n*  at this time.                                                         *\n*                                                                        *\n*  APAR OA43951 and OA43952 are pre-reqs as it adds the system           *\n*  maximum generation limit to the data facilities area (DFA)            *\n*  control block which is used by this application. This closed          *\n*  in December 2013 so most shops should have this.                      *\n* ---------------------------------------------------------------------- *\n\nInstallation of this dialog is documented in the $INSTALL member. It\ndoes involve:\n\n   - Copy the ISPF Panels into your ISPF Panel library\n   - Copy the REXX Execs into your SYSEXEC library\n   - Copy the LOAD modules into your ISPLLIB library\n   - Optional assemble the source code provided\n     - see member ASMJCL\n\nFor testing and validation purposes you can use the PDSEGENX exec which\nwill Altlib the exec library and Libdef the panels and load library and\nthen invoke PDSEGEN. PDSEGENX will accept an optional pdse-library as\nthe only parameter but if omitted then the user will be prompted for the\nPDSE to work with.\n\nMVS/QuickRef - if you have MVS/QuickRef installed then consider installing\nmember PDSEGQW into a MVS/QuickRef database (see QWLOAD for sample JCL).\n\nUSAGE.\n\nEntry to the dialog is via the PDSEGEN exec. If called with no parameters\nthen a prompting panel is displayed.\n\n    Syntax is:  %PDSEGEN dsname filter set\n\n    Where dsname is the dataset name for a PDSE with generations.\n\n    If dsname is * then a display of the last 15 referenced datasets\n    will be presented to select from.\n\n    If dsname is ? then the ISPF tutorial will be presented.\n\n    The dsname may also contain a filter - 'sys1.parmlib(ieasys*)'\n\n    Where filter is any valid filter.\n\n       Filter are:  ABC*, ABC: ,ABC, ABC/, /ABC, or ABC\n                    TODAY, WEEK, MONTH, YEAR, SINCE YY/MM/DD, SINCE -nn\n\n       The date filters are toggles.\n\n    Where SET is SET=x where x is B, E, V, or / to define the\n    default select. This over-rides anything the user may have\n    set in the entry panel or using the SET command and is\n    saved in the ISPF profile.\n\nPDSEGEN may also be entered on a DSLIST or ISPF 3.4 dataset list in\nthe command field with a / to indicate to use the dataset on that row\nas the PDSE to work with.\n\nTo simplify entering PDSEGEN on DSLIST or 3.4 you can create this\nsimple exec that I call PG, but you can all it whatever is easy for you:\n\n        /* rexx */\n        arg options\n        '%pdsegen' options\n\n        *** This is provided in the EXEC PDS as member PG ***\n\nWithin the application there are commands available on the ISPF Command\nline and Line selection commands for each member. See the ISPF Tutorial\nfor all commands and options available.\n\nCommand line options are:\n\n       Backup                    to invoke the Backup dialog\n       Browse                    to browse a member or members from the\n                                 command line: B member or B *, or B A%\n       C                         to change to a previous dsn using *\n                                 to change to the copy target dsn using >\n                                 to display a selection list of previous\n                                 dsns using ?\n                                 to jump directly to a dsn use #\n       Compare member from to    to Compare the 2 generations\n                                 e.g. Compare ABC -4 -1\n                                 if no member specified then a\n                                 prompting panel will popup\n       Copy                      Copy from current PDSE to new or existing\n                                 PDSE - will allocate new PDSE based\n                                 on the current PDSE if create specified\n                                 With Copy the space and maxgen can\n                                 be changed.\n       Edit member               to edit an existing or new member\n                                 e.g. E abc or E *, or E A%\n       Filter member-pattern     to Filter by member mask\n                                 abc* for members starting with abc\n                                 *abc for members ending with abc\n                                 abc/ for members with abc anywhere\n                                 Today for updated today\n                                 Week for updated last 7 days\n                                 Month for updated last 30 days\n                                 Year for updated this year\n                                 Since yy/mm/dd\n                                 Since -nn\n                                 OFF to turn off filtering\n       Find string               to find a string in all members/gens\n       HIGen                     Display the High Generation members\n                                 - known as dummy members\n       ID xxx                    Display members with xxx in userid\n       Locate member or member*  to scroll to the member\n                                 e.g. L abc\n                                  or  L ab*\n       MINE                      Display members with active userid\n       MODel                     to allocate a new dataset based on the\n                                 attributes of the current dataset\n                                 - after Model the Change > command may\n                                   be used to change to the newly created\n                                   dataset\n       Options                   Display a Primary Command prompting panel\n       Output                    to create a report of the active member list\n       Prune                     to delete obsolete generations\n       Refresh <filter>          to rebuild the member list\n                                 with optional filter\n       Restore                   to invoke the Restore dialog\n       Set                       popup to change the line selection S\n                                 action (B, E, V)\n       SetMacro (SM)             Set an Initial Edit Macro by dataet suffix\n       Sort                      Sort by Name, Creation, Changed, or User\n                                 - point/shoot for these column headers\n                                 Sort Field-name Order where order is A or D\n       Submit                    Submit a member, member generation or *\n                                 e.g. SUB ABC, or SUB *, or SUB A%C\n       Validate                  Validate the PDSE using IEBPDSE\n                                 - if clean is enabled in PDSEGENS then the\n                                   validate will also force a clean for all\n                                   pending deletes.\n       View                      To View a member, or members, from the\n                                 command line:  V member or V * or V A%\n       Quit and Exit             Commands to end the dialog (F3 always works)\n\nLine selection options are (short and long forms):\n\n       A to change attributes (ver/mod/userid)\n         - Attrib\n       B to browse the member\n         - Browse\n    ** C or COPy to copy a member to a different dataset\n         - May only be used on base members but all generations\n           for the selected member will also be copied\n       D to delete the member, or a generation\n        - Delete\n    *  E to edit the member\n         - Edit\n    ** G Recover a generation to a new member based on the\n         name provided via a prompting popup panel\n         - RECover\n       H hide the member/generation from the table\n         to exclude the member/generation from command line\n         B *, E *, V *\n         - Hide\n       I display ISPF statistics for the member or generation\n         - Info\n       J to submit the member (JCL) to the internal reader\n         - Submit\n       K to clone a member (generation 0 only)\n         - no generations are cloned\n         - Klone or Clone\n       M to eMail the member (using XMITIP)\n         - Mail\n       O to display the tutorial for options\n    ** P Promote a generation to generation 0\n         Copies a non-0 generation into generation 0\n         and leaves the user in Edit.  If you save then\n         generation 0 is replaced.\n         - Promote\n     * Q to Rename and swap the member and all generations\n         - RENSwap\n     * R to Rename a member and all generations\n         - REName\n       S to use the default option as defined on the entry panel\n         - default is B\n         - Select\n       U to invoke a user command on the dataset(member)\n         - including generations\n         - User\n       V to view the member\n         - View\n       X to eXecute the member (REXX or CLIST)\n         - EXecute\n   **  Z to compare the base (gen 0) non-0 generation\n         - COMpare\n       / to display the tutorial for options\n\n       Placing the cursor on the row and hitting ENTER will also\n       select the row.\n\n    * - ONLY allowed for generation 0 members\n   ** - ONLY work with non-0 generation members\n\nNotes:\n   - All line selection options can be used in block form - BB/BB or B99\n   - Expanded commands may also be blocked by doubling the 1st character,\n     e.g. KKlone, but expanded commands may not have a count\n   - When using the expanded selection panel then any TSO command, clist,\n     or exec can be used along with any valid line selections. The User\n     command dialog will be presented to allow the user to enter other\n     parameters.\n\nWhy use, or consider, PDSEGEN:\n\n   1. To see the generations easily\n   2. To be able to compare current generation to prior generations to\n      see what changed (broke)\n   3. To easily recover a prior generation using recover to a new member\n      or promote to replace the current base member\n   4. To easily clean up obsolete, no longer needed, generations (prune)\n   5. To safely copy the base member and all generations\n   6. To easily backup and restore without loss of generations\n   7. Protection from accidentally editing a non-0 generation\n   8. Easily search members and generations\n   9. Easy access to up to 15 datasets\n   10. Info on which generation is being browsed/edited/viewed\n   11. All the above and more\n\nCustomization options are all found in the PDSEGENS exec:\n\n   1. Change the mail variable to 1 to enable e-mailing the selected\n      member or 0 to disable the e-mail option.\n   2. Enable or disable the elapsed time display after building the\n      member list - change etime variable to 0 to disable and 1 to\n      enable it.\n   3. Enable or disable processing of dummy members by changing the\n      higen variable. 0 = off and 1 = on.\n   4. Added base_color and sort_color for the columns that can be sorted\n      to allow changing those colors if desired. Default is blue for\n      unsorted and turq for sorted.\n   5. Enable or disable the IEBPDSE Clean option\n      - Requires IBM Apar OA47755 or OA50214 for this support\n   6. Update the help panels that document sample JCL for batch Backup\n      and Copy to conform to your installation standards and datasets,\n      PDSEGHBJ for Backup and PDSEGHC for Copy.\n   7. If your installation has a Edit Line Command Table defined in your\n      ISPF configuration *AND* it isn't in the ISPF Table dataset\n      defined in the sample batch JCL for Backup and Copy then those\n      samples need to be updated to concatenate that dataset.\n\nNotes:\n\n1.  Browse works as you would expect it to\n\n2.  Using Edit or View you can use all normal edit commands,\n    including edit macros. However commands that reference other\n    members can only reference the base, or generation 0, member.\n\n3.  Multiple members may be selected for Browse or View but Edit\n    will only work if the member IS NOT saved or updated.  If a\n    member is saved or updated then all rows for that member are\n    deleted and re-added to include the updated generation info.\n\n4.  It shouldn't have to be stated but generations are only\n    supported for PDSE Version 2 datasets where generations have\n    been enabled.\n\n5.  Edit will be converted to View for non-0 generation members.\n\n6.  The Compare command only accepts relative generation numbers.\n\n7.  The Compare line option will compare the base member to the\n    selected generation.\n\n8.  It is possible to allow Edit to edit a generation BUT when that\n    happens only the generation is updated and the base member is\n    NOT updated. Thus the generation with the update could be lost\n    and/or hidden since it is not possible to access a generation\n    using dynamic allocation or JCL.\n\n    This application has been configured to prevent editing non-0\n    generations.\n\n9.  The ISPF Edit compare command has been extended using an edit\n    macro. The new capabilities include the ability while in Edit to\n    compare to another generation of that member (e.g. compare -2)\n    or to compare to another member generation (e.g. compare xx -3).\n    When in view it is possible to compare to the base (e.g. compare 0)\n    or to another member or generation (e.g. compare xxx -1). If the\n    compare options do not include a generation then the normal ISPF\n    compare will be invoked.\n\n10. The e-mail option utilizes XMITIP using the XMITIPFE (front end)\n    exec. This option is only available if the mail variable is\n    customized to 1.\n\n11. Aliases are NOT supported by the PDSEGENI Rexx Function so this\n    application does not support aliases (at this time)\n\n12. Rename will rename the base member and all generations by doing a\n    copy of the generations so they are retained.\n\n13. Find can be faster if Filter is used prior to the find\n\n14. Prune operates on only the members in the display list so\n    using Filter before Prune is a good way to limit the members\n    that Prune will clean up.\n\n15. Before using Prune a Backup is recommended (CYA).\n\n16. PDSEGEN supports extended statistics. If a member has more than 64K\n    (65535) records then the only way to display the actual record count\n    is to turn on extended statistics using the ISPF Edit command STATS\n    EXT.\n\n17. When Hide is active, Delete, Prune, and Rename are not available.\n\n18. The Member list display defaults to a 2 digit year display. Using the\n    Left or Right keys (F10 or F11) will shift to use the 4 digit year\n    display by removing the Initial size field from the table. This view\n    is remembered across sessions.\n\n19. If you see a member with a -1 generation and there is no 0 generation\n    that indicates that the member was deleted outside of PDSEGEN. The\n    normal ISPF member delete will delete the base member but leave the\n    generations and the base member will become the -1 generation.\n\nAcknowledgements:  Thanks are due to Thomas Reed of IBM who presented at\n                   the 2015 SHARE in Seattle on PDSE V2 Member\n                   Generations and provided sample code for finding the\n                   generations which I've used as a starting place for\n                   my dialog.\n\n                   Thanks also to the following for testing, commenting,\n                   trouble shooting, and making suggestions to improve\n                   this tool:\n\n                   * Bill Smith        * Sam Golob\n                   * Bruce Koss        * Tom Conley\n                   * John Kalinich     * Greg Price\n                   * Salvador Carrasco\n\nMembers of this PDS are:\n\n    $CHANGES - summary of changes\n    $$$DOC   - what you are reading\n    $INSTALL - Short installation instructions\n    $MODULES - Info on the source/load modules\n    $RECV    - TSO Command to RECEIVE EXEC and PANELS into\n               usable datasets\n             - Updates PDSEGENX in the exec library with the\n               dataset names of the restored datasets\n             - Updates the ASMJCL member of this PDS with the\n               dataset name of the restored source and load\n               libraries\n    @BACKUP  - Doc on using PDSEGBAK to backup/restore a PDSE V2\n    @CLS     - Assembler source for a TSO clear screen command\n    ASM      - Assembler source for the PDSEGENI code\n    ASMJCL   - JCL to assemble and link PDSEGENI, PDSEGDEL and\n               PDSEGMAT if you want to reassemble for any reason\n    CLS      - Object Deck of the CLS assembler module to\n               clear the screen during the $RECV process\n    EXEC     - TSO Transmit of the REXX Library\n    FIXPDSEG - edit macro used by $RECV to update key members\n               during the receive process\n    LICENSE  - the GPL V3 License\n    LOAD     - Load module of PDSEGENI (put into ISPLLIB or STEPLIB)\n    PANELS   - TSO Transmit of the ISPF Panel Library\n    SAMPBR   - sample JCL to run PDSEGBAK in batch\n    SAMPCOPY - sample JCL to run PDSEGENC in batch\n    SAMPLE   - TSO transmit of sample PDSEGEN backup will be\n               restored to PDS by $RECV and can then be processed by\n               PDSEGEN RESTORE command to recreate a PDSE with\n               members and generations\n    SUPPORT  - information about the lack of official support or\n               warranty.\n    WISHLIST - Enhancement requests that are queued (maybe)\n\nDisclaimer: This software is provide for your use without any warranty or\nrecourse should it not perform or cause problems. The author and others\nwho have contributed are not responsible for issues that arise, nor are\ntheir employers. Use this software at your own risk. Test and test again\nbefore using in any productive capacity.\n\nRestrictions of PDSE V2 Generations:\n\n1. The MAXGENS option defines the number of generations plus 1 for the\n   base or generation 0 member.  Thus a MAXGENS of 10 yields 11 members.\n2. You can delete an individual generation and that will leave a gap\n   in the generations. This will result in this application stopping its\n   member search at the 1st gap.\n   * this option is not available with this application\n3. Use of TSO DELETE will delete the base member BUT will NOT Delete\n   any generations. The ISPF LMMDEL service will delete the base\n   member and ALL generations. This application uses the LMMDEL\n   service.\n   - If you delete a member and all generations and then create a new\n     member with the same name. All generations for the new member\n     will start with the previous members generation next high\n     generation number.\n   - Some ISPF applications do not use LMMDEL to delete members but\n     use the equivalent of the TSO DELETE, with the same results.\n4. The use of ISPF copy services, including 3.3, will NOT copy any\n   generations. Nor will IEBCOPY. The only tool to copy generations\n   is DFDSS (a full dataset dump/restore/copy). This application does\n   not support copying at this time.\n5. If you Edit a generation other than 0 and save it then no new generation\n   is generated. That only happens when editing generation 0.\n6. You CANNOT access any generations using JCL or dynamic allocation.\n7. You can force a new generation, when editing generation 0, by using\n   the Edit command SAVE NEWGEN.\n8. You can prevent the creation of a new generation by using the Edit\n   command SAVE NOGEN\n9. To find what PDSEGBAK member maps to what real name use Edit (or View)\n   on the backup member and use the ISPF Edit command GNAME\n10. See the Tutorial option U for a list of vendor products that have no\n    or partial support for member generations\n\nSee Thomas Reed's SHARE Presentation at:\n    https://share.confex.com/share/124/webprogram/Session16957.html\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}, "$CHANGES": {"ttr": 526, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x04@\\x00I\\x01\\x16\\x17o\\x01 4\\x9f\\x06%\\x06\\xaf\\x00 \\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "04.64", "flags": 0, "createdate": "2016-06-24T00:00:00", "modifydate": "2020-12-14T06:25:49", "lines": 1711, "newlines": 32, "modlines": 0, "user": "PDSE"}, "text": "Change History\n\n  Changed for every update:\n       PDSEGHAU   - Change for release update (Panel)\n       PDSEGHCG   - Change for release update (Panel)\n       PDSEGVER   - Change for release update (Exec)\n\n  Version 5.8.5  Dec 14, 2020\n     - Exec changes\n       PDSEGEN  - Correct return if RECFM=U on Entry\n\n  Version 5.8.4  Oct 27, 2020\n     - ASM changes\n       PDSEGENI - Increase DSERV buffer size for more members\n\n  Version 5.8.3  Sept 17, 2020\n     - Exec changes\n       PDSEGEN  - Support cursor retention setting\n     - Panel changes\n       PDSEGEDA - Update for cursor positioning\n       PDSEGEDB - Update for cursor positioning\n       PDSEGEDC - Update for cursor positioning\n       PDSEGEDD - Update for cursor positioning\n       PDSEGEDE - Update for cursor positioning\n       PDSEGEDF - Update for cursor positioning\n       PDSEGEDG - Update for cursor positioning\n       PDSEGEDH - Update for cursor positioning\n       PDSEGED1 - Update for cursor positioning\n       PDSEGED2 - Update for cursor positioning\n       PDSEGED3 - Update for cursor positioning\n       PDSEGED4 - Update for cursor positioning\n       PDSEGED5 - Update for cursor positioning\n       PDSEGED6 - Update for cursor positioning\n       PDSEGED7 - Update for cursor positioning\n       PDSEGED8 - Update for cursor positioning\n       PDSEGH8  - Update for cursor positioning\n       PDSEGSET - Update for cursor positioning\n\n  Version 5.8.2  August 11, 2020\n     - Exec changes\n       PDSEGEN  - Free Model dataset after allocation\n\n  Version 5.8.1  August 6, 2020\n     - Exec changes\n       PDSEGDSL - Enable access from display using alias\n                - Allow a member name in the dsname field\n     - Panel changes\n       PDSEGDSL - Expand dsname field to allow for member\n\n  Version 5.8.0  August 3, 2020\n     - Exec changes\n       PDSEGEN  - Fix crash on exit if entry with bad dsn\n       PDSEGDSL - Add max history to the panel\n     - Panel changes\n       PDSEGDSL - Add max history to the panel\n\n  Version 5.7.9  August 2, 2020\n     - Exec changes\n       PDSEGGEN - Add missing SETMSG if change to DSN in error\n       PDSEGDSL - Correct cursor location if insert dsn in error\n\n  Version 5.7.8  July 30, 2020\n     - Exec changes\n       PDSEGDSL - Allow multiple rows to be updated with one enter\n\n  Version 5.7.7  July 27, 2020\n     - Exec changes\n       PDSEGEN  - Add TPC command to invoke The PDS Command\n                - Change the ? dataset table to use new PDSEGDSL\n                  for a true table\n       PDSEGENS - Add Max History site default\n       PDSEGDSL - New exec for dataset history table\n     - Panel changes\n       PDSEGDSL - Updated for the new PDSEGDSL process\n       PDSEGHDT - New for the PDSEGDSL panel\n       PDSEGSET - Add override for Max History\n       PDSEGH8  - Update for PDSEGSET change\n       PDSEGH11 - Revised for the new PDSEGDSL process\n\n  Version 5.7.6  July 09, 2020\n     - Exec changes\n       PDSEGEN  - Correct error when command S/E new-member\n\n  Version 5.7.5  June 26, 2020\n     - Load Module\n       PDSEGENI - Resolve an issue if PDSGENI is in Linklist on some systems.\n\n  Version 5.7.4  June 3, 2020\n     - Exec changes\n       PDSEGEN  - Back out member cursor position and fix bugs introduced\n     - Panel changes\n       PDSEGEDA PDSEGEDB PDSEGEDC PDSEGEDD\n       PDSEGEDE PDSEGEDF PDSEGEDG PDSEGEDH\n       PDSEGED1 PDSEGED2 PDSEGED3 PDSEGED4\n       PDSEGED5 PDSEGED6 PDSEGED7 PDSEGED8\n       PDSEGHAU PDSEGHCG PDSEGH8 PDSEGSET\n\n  Version 5.7.3  June 2, 2020\n     - Exec changes\n       PDSEGEN  - Correct Scrolling bug introduced in 5.7.2\n\n  Version 5.7.2  June 1, 2020\n     - Exec changes\n       PDSEGEN  - Fix to leave cursor on last selected member (bug fix)\n\n  Version 5.7.1  May 28, 2020\n     - ASM/Load changes\n       PDSEGENI - Fix to support a PDS/PDSE residing on an EAV volume\n     - Exec changes\n       PDSEGEN  - Fix to leave cursor on last selected member\n     - Panel changes\n       PDSEGEDA - Remove .cursor statement\n       PDSEGEDB - Remove .cursor statement\n       PDSEGEDC - Remove .cursor statement\n       PDSEGEDD - Remove .cursor statement\n       PDSEGEDE - Remove .cursor statement\n       PDSEGEDF - Remove .cursor statement\n       PDSEGEDG - Remove .cursor statement\n       PDSEGEDH - Remove .cursor statement\n       PDSEGED1 - Remove .cursor statement\n       PDSEGED2 - Remove .cursor statement\n       PDSEGED3 - Remove .cursor statement\n       PDSEGED4 - Remove .cursor statement\n       PDSEGED5 - Remove .cursor statement\n       PDSEGED6 - Remove .cursor statement\n       PDSEGED7 - Remove .cursor statement\n       PDSEGED8 - Remove .cursor statement\n       PDSEGSET - Update for new cursor position option\n\n  Version 5.7.0  April 22, 2020\n     - Exec changes\n       PDSEGEN  - Support \\ Edit option to immediately edit a member\n                - Flag kloned members with *Kloned\n       PDSEGENM - One more fix for the Edit Compare to work wtih SAVELAB\n       PDSEGCPR - New option to disable the PDSEGEN Compare intercept with\n                  COMPARE RESET\n     - Panel changes\n       PDSEGHS  - Document \\ Edit option\n       PDSEGH2  - Updated prose\n       PDSEGH2E - New panel explains use of Compare Edit command\n       PDSEGEDA - Add Exit option to drop down menu\n       PDSEGEDB - Add Exit option to drop down menu\n       PDSEGEDC - Add Exit option to drop down menu\n       PDSEGEDD - Add Exit option to drop down menu\n       PDSEGEDE - Add Exit option to drop down menu\n       PDSEGEDF - Add Exit option to drop down menu\n       PDSEGEDG - Add Exit option to drop down menu\n       PDSEGEDH - Add Exit option to drop down menu\n\n  Version 5.6.9  April 06, 2020\n     - Exec changes\n       PDSEGENM - Fix issue with Edit COMPARE interception\n\n  Version 5.6.8  April 04, 2020\n     - Exec changes\n       PDSEGCPR - Fix typo to enable COMPARE -n to work\n\n  Version 5.6.7  March 09, 2020\n     - Exec changes\n       PDSEGEN  - Fix MODEL command\n\n  Version 5.6.6  March 02, 2020\n     - Exec changes\n       PDSEGEN  - Bug fix for 1st time user where panel wasn't set\n\n  Version 5.6.5  February 26, 2020\n     - Exec changes\n       PDSEGEN  - Add support action bar menus\n     - Panel changes\n       PDSEGEDA - Add Action Bar\n       PDSEGEDB - Add Action Bar\n       PDSEGEDC - Add Action Bar\n       PDSEGEDD - Add Action Bar\n       PDSEGEDE - Add Action Bar\n       PDSEGEDF - Add Action Bar\n       PDSEGEDG - Add Action Bar\n       PDSEGEDH - Add Action Bar\n       PDSEGABQ - Action Bar prompt (1 time)\n       PDSEGASK - Prompt popup for commands that need a value\n       PDSEGSET - Update for action bar choice\n\n  Version 5.6.4  January 31, 2020\n     - Exec changes\n       PDSEGEN  - Add support for dataset suffix specific initial edit macros.\n                  New commands: SETMACRO (SETM) or SM.\n     - Panel changes\n       PDSEGAT  - Cosmetic change to title\n       PDSEGHPS - Add Setmacro\n       PDSEGH0  - Add Setmacro\n       PDSEGH21 - Add Setmacro\n       PDSEGIMA - SetMacro support\n       PDSEGIMC - SetMacro support\n       PDSEGIMU - SetMacro support\n       PDSEGOPT - Add Setmacro\n\n  Version 5.6.3  January 18, 2020\n     - Exec changes\n       PDSEGEN  - Updated to prevent copying from and to the same dataset.\n                  Both COPY command and Copy row selection.\n\n  Version 5.6.2  January 8, 2020\n     - Exec changes\n       PDSEGEN  - Updated G (Recover) to recover orphan members that are the\n                  result of deleting a member outside of PDSEGEN.\n\n  Version 5.6.1  December 11, 2019\n     - Exec changes\n       PDSEGEN  - Add AGE command from John K.\n     - Panel changes\n       PDSEGAGE - New panel (popup) for the AGE command.\n       PDSEGHAG - Tutorial for AGE\n       PDSEGHPS - Update to add AGE\n\n  Version 5.6.0  November 19, 2019\n     - Exec changes\n       PDSEGEN  - Change from using message ISRZ002 to ISRZ003\n                - Fix error when using command line to edit a\n                  new member name\n\n  Version 5.5.9  October 10, 2019\n     - Exec changes\n       PDSEGBAK - Correct size of mod size field (jk)\n       PDSEGEN  - Correct size of mod size field (jk)\n                - Correction to mod size parse\n                - Improve PFSHOW routine\n                - Clean up Z compare process\n                - Allow C 'dsname and add close quote\n       PDSEGENC - Correct size of mod size field (jk)\n     - Panel changes\n       PDSEGCOM - Update to validate from/to generations\n       PDSEGCPR - removed as obsolete\n\n  Version 5.5.8  August 21, 2019\n     - Panel changes\n       PDSEGBAK - Change panel title\n       PDSEGHT  - Correct typo\n       PDSEGRST - Change panel title\n\n  Version 5.5.7  August 21, 2019\n     - Exec changes\n       PDSEGEN  - Support Find in non-MG PDS/PDSEs\n                - Support Filter x:y\n                - Improve messages after Browse/Edit/View\n                - Correct Sort ID error\n                - Support Filter (mem mem mem) with masking\n                - Correct SORT INIT\n       PDSEGENC - Support Filter x:y and Filter (mem mem mem)\n       PDSEGFND - Allow SuperC searches for non-MG data sets\n     - Panel changes\n       PDSEGED5 - Update column title from Rel Gen to Rel-Gen\n       PDSEGED6 - Update column title from Rel Gen to Rel-Gen\n       PDSEGED7 - Update column title from Rel Gen to Rel-Gen\n       PDSEGED8 - Update column title from Rel Gen to Rel-Gen\n       PDSEGFP  - Restored lost panel to the package\n       PDSEGHC  - typo correction\n       PDSEGHF  - Add filter x:y\n       PDSEGHFS - Update for new search capability\n       PDSEGHTR - Clarification\n       PDSEGSL0 - Add option Z (compare)\n       PDSEGHU  - Updated\n       PDSEGHV  - Updated\n\n  Version 5.5.6  July 22, 2019\n     - Exec changes\n       PDSEGEN  - Allow OPTIONS to be abbreviated as O\n     - Panel changes\n       PDSEGOPT - Add REFList to list of Primary Commands\n\n  Version 5.5.5  June 25, 2019\n     - Exec changes\n       PDSEGEN  - Check Backup return code\n                - Fix C * after using REFList\n                - Fix E XX if filter X/ and XX does not exist (yet)\n\n  Version 5.5.4  June 05, 2019\n     - Exec changes\n       PDSEGEN  - Support change to the PDSEGENS disp_change setting\n                - Update change option for SET command\n                - Add REFLSIT command\n       PDSEGENS - disp_change is changed\n                  - 0 is do not display the tutorial if the v.r.m changes\n                  - 1 is to display the tutorial if the v.r changes\n                  - 2 is to display the tutorial if the v.r.m changes\n     - Panel changes\n       PDSEGHPS - Updated to add REFLIST command\n       PDSEGHV  - Add reference to PGLITE\n       PDSEGH0  - Move the C (Changes) option higher on the tutorial panel\n       PDSEGH0  - Updated to add REFLIST command\n       PDSEGH20 - new Tutorial for REFLIST command\n       PDSEGSET - Update User Change option\n\n  Version 5.5.3  Apr 29, 2019\n     - Exec changes\n       PDSEGEN  - Correct Entry/Exit processing (Broke with 5.5.20\n\n  Version 5.5.2  Apr 27, 2019\n     - Exec changes\n       PDSEGEN  - Restore the ability to invoke with *\n\n  Version 5.5.1  Apr 23, 2019\n     - Exec changes\n       PDSEGEN  - Improved PROFILE NOPREFIX processing\n                - Add Tryit line command\n     - Panel changes\n       #TRYIT   - tutorial panel for Tryit\n       #TRYIT1  - tutorial panel for Tryit\n       PDSEGHTR - new tutorial panel for Tryit option\n       PDSEGH0  - update to add Tryit\n       PDSEGH6  - update to add Tryit\n       PDSEGSLN - update to add Tryit\n       PDSEGSL0 - update to add Tryit\n\n  Version 5.5.0  Mar 07, 2019\n     - Exec changes\n       PDSEGEN  - Add Row and Column to Addpops\n                - Add Addpop for panel PDSEGENI\n                - Improved Messages for Block Commands\n       PDSEGBAK - Add numeric digits for maxgen check\n       PDSEGRST - Add numeric digits for maxgen check\n     - Panel changes\n       Several panels to clean up the title for consistency and\n       reduce blank lines in popups.\n       PDSEGENI - Make a popup (member info)\n       PDSEGSLN - Clean up if email not enabled\n       PDSEGSL0 - Clean up if email not enabled\n\n  Version 5.4.9  Feb 22, 2019\n     - Exec changes\n       PDSEGEN  - add message options if not z/OS 2.1 or newer\n     - Panel changes\n       PDSEGXFR - add from dsn and member\n\n  Version 5.4.8  Dec 31, 2018\n     - Exec changes\n       PDSEGEN  - Improved error message if a data set is not supported\n                  RECFM is not F or V (thanks to JK for this).\n\n  Version 5.4.7  Dec 20, 2018\n     - Exec changes\n       PDSEGEN  - Fix to catch an error cleanly if Mail configured\n                  but isn't actually installed.\n\n  Version 5.4.6  Dec 19, 2018\n     - Exec changes\n       PDSEGEN  - Fix for browsing message if PDSE has MAXGEN of 0\n\n  Version 5.4.5  Nov 21, 2018\n     - Panel changes\n       PDSEGOPT - Enhanced prompting for commands that need parameters\n                - Add ID and MINE commands\n\n  Version 5.4.4  Oct 22, 2018\n     - Exec changes\n       PDSEGEN  - Fix for 8 character Userids\n                - Add ID and MINE commands\n     - Panel changes\n       PDSEGH0  - Add ID and MINE commands\n       PDSEGHID - New Tutorial for ID and MINE\n       PDSEGHPS - Add ID and MINE commands\n\n  Version 5.4.3  Aug 22, 2018\n     - Exec changes\n       PDSEGEN  - Change to bypass SETMSG after Edit if rc <= 4\n\n  Version 5.4.2  May 24, 2018\n     - Panel changes\n       PDSEGCOM - Changed title bar\n       PDSEGCPR - Changed title bar\n       PDSEGCPS - Changed title bar\n\n  Version 5.4.1  May 10, 2018\n     - Exec changes\n       PDSEGENC   - Correct bug copying members with no stats if no\n                    date filter is used.\n                  - Update messages is copy error\n     - Panel changes\n       PDSEGHPS   - Add more options to the list of primary commands\n\n  Version 5.4.0  April 30, 2018\n       This update is focused on providing a larger field for the\n       Relative generation number for those sites where the maxgen\n       could be greater than 99 (up to 2,000,000,000). This is done by\n       adding a new set of display panels without the Absolute\n       generation column. As part of this the member display panels\n       have been renamed and migration code is included to convert old\n       panel names from the profile to the new name.\n     - Exec changes\n       PDSEGEN    - Add Numeric Digits 10 to the check for the system\n                    gen limit to resolve an issue where one site had\n                    the limit at 2,000,000,000 (the max).\n                  - clean up the member info display\n                  - set the HIGEN value in the status column\n     - Panel changes\n       PDSEGCPY   - Update to resolve default values\n       PDSEGHLR   - Updated to document the 2 sets of panels one set\n                    with the Absolute generations and one without\n       PDSEGED1   - Added\n       PDSEGED2   - Added\n       PDSEGED3   - Added\n       PDSEGED4   - Added\n       PDSEGED5   - Added\n       PDSEGED6   - Added\n       PDSEGED7   - Added\n       PDSEGENA   - Removed\n       PDSEGENI   - Removed the hex fields\n       PDSEGENS   - Updated to document the additional panels for\n                    the def_panel setting\n       PDSEGENT   - Removed\n       PDSEGEXA   - Removed\n       PDSEGEXT   - Removed\n\n  Version 5.3.1  April 11, 2018\n     - Exec changes\n       PDSEGEN    - Fix broken EDIT CANCEL command\n                    - break introduced in 5.3.0\n\n  Version 5.3.0  April 10, 2018\n     - Exec changes\n       PDSEGEN    - Require REST instead of RES for Restore command\n                  - Allow F instead of FIN for Find\n                  - Find will now also find the string in the member name\n                  - Make RESet an alias of REFresh instead of Prune\n                  - Change SORT USER to SORT ID\n                  - Improve filter processing if the filter ends\n                    with an *\n                  - Improve filter processing if the filter starts\n                    with an *\n                  - Correct loop on the initial prompt panel if a filter\n                    is defined\n                  - Correct scrolling on z/OS 2.1 (Left/Right)\n                    (problem introduced with 5.1.8)\n     - Panel changes\n       PDSEGCPY   - Update for defaults\n       PDSEGHF    - Additional Filter information\n       PDSEGHFS   - Update for new Find abbreviation\n       PDSEGOPT   - Change REStore to RESTore\n                  - Change FINd to FInd\n       PDSEGMDL   - Correct bug in title\n       PDSEGRST   - Fix typo\n       PDSEGTIM   - Correct bug in title\n       PDSEGXFR   - Update for defaults\n       PDSEGENA   - updated header\n       PDSEGENT   - updated header\n       PDSEGEXA   - updated header\n       PDSEGEXT   - updated header\n       PDSEGHOU   - updated output sample\n       PDSEGHPS   - updated for SORT change (User became ID)\n       PDSEGH5    - updated for SORT change (User became ID)\n       PDSEGSRT   - updated for SORT change (User became ID)\n\n  Version 5.2.3  April 03, 2018\n     - Exec changes\n       PDSEGEN    - Check member name from status field for validity\n                    (G-Recover, K-Clone and R-Rename)\n                  - For G, K, and R make sure the target member does\n                    not currently exist\n                  - Clean up logging messages\n     - Panel changes\n       PDSEGHS    - Added prose that the PDSE must be in the catalog\n\n  Version 5.2.2  March 31, 2018\n     - Exec changes\n       PDSEGEN    - Add new line command Q (RENSWAP) for Rename Swap\n                    of a member and all generations\n                  - Correct lack of a last status after normal Rename\n                  - Correct bug in pdse dsn parse\n     - Panel changes\n       PDSEGHRN   - Add info on Rename Swap\n       PDSEGH0    - Update to add new Line command Q (RenSwap)\n       PDSEGRNS   - New to support Rename Swap\n       PDSEGRNM   - Correct reference to tutorial panels\n       PDSEGSL0   - Add option Q to the menu\n\n  Version 5.2.1  March 27, 2018\n     - Exec changes\n       PDSEGEN    - Fix TBSort typos\n                  - Add support for IBM FileManager EFIND/ECHG if installed\n\n  Version 5.2.0  March 26, 2018\n     - ASM/LOAD changes\n       PDSEGENI   - Add test for dummy generation and set flag\n     - Exec changes\n       PDSEGEN    - Remove ORDER from TBADD during table build\n                  - Replace TBMOD with TBPUT\n                  - Add Sort after table build\n                  - Eliminate table keys\n                  - Eliminate extra call to table rebuild on\n                    member changes\n                  - Correctly support B/E/V * relative-gen\n                  - Test for new dummy generation flag from pdsegeni\n                  - Test for member generations for HIGen request\n                  - Fix alignment for counters in OUTPUT report\n                  - Fix Sort Size, Init, Mod\n     - Misc changes\n       PDSEGQW    - Sample PDSEGEN entry for MVS/QuickRef\n       QWLOAD     - Added as an example to load PDSEGQW into an\n                    MVS/QuickRef user database\n     - Panel changes\n       PDSEGINF   - Correct panel title\n       PDSEGHBE   - Make scrollable\n       PDSEGHOV   - New Overview tutorial panel\n       PDSEGH0    - Correct reName to Rename\n       PDSEGTIM   - Changed Total Members to Total Entries as a PDSE\n                    V2 with Member Generations may have dummy entries\n                    that can not be accessed.\n\n  Version 5.1.8  March 9, 2018\n     - Exec changes\n       PDSEGEN    - Add logging of startup\n                  - minor code cleanup\n                  - Add more comments\n                  - Remove PDSECMDS table and use CONTROL LRSCROLL\n                    command\n                  - Remove HELP primary command as F1 works just fine\n\n  Version 5.1.7  February 27, 2018\n     - Exec changes\n       PDSEGEN    - Update to use new RANDSTR random string routine\n                    for DD and Table names\n                  - Convert from using TBEND to TBCLOSE\n       PDSEGFND   - Change from LINKMVS to ISPEXEC Select for SuperC\n\n  Version 5.1.6  February 22, 2018\n     - Exec changes\n       PDSEGEN    - Change to use Trk instead of Blk for new\n                    allocations\n                  - Change to use new random number routine\n                    for table and ddnames\n\n  Version 5.1.5  February 16, 2018\n     - Exec changes\n       PDSEGEN    - Fix to not update the member list for b/e/v if\n                    member not in the filter\n\n  Version 5.1.4  February 13, 2018\n     - Exec changes\n       PDSEGEN    - Correct bug with the OUTPUT command if user had\n                    No Prefix.\n\n  Version 5.1.3  February 2, 2018\n     - Exec changes\n       PDSEGEN    - Display an empty member table if the PDS/PDSE\n                    is empty\n                  - Allow C > to work after the Model command to\n                    change to the newly created dataset\n                  - Enable Compare/Z line selection on generation 0\n                    to display the compare prompt dialog\n                  - Add short messages for unknown primary commands\n                    and unknown line selections\n                  - Validate Rename target\n                  - Make the Rename process more intuitive\n     - Panel changes\n       PDSEGCPR   - Added for use when the Compare/Z line command\n                    is used to compare generations in a member\n       PDSEGHMD   - Update to document that the Copy-To dataset\n                    variable is set after the Model operation\n       PDSEGH11   - Add info on using C > after MODEL\n       PDSEGOPT   - Added Today, Week, Month, and Year to the Options\n\n  Version 5.1.2  January 25, 2018\n     - ASM/LOAD changes\n       PDSEGDEL   - Fix bug introduced in 5.1.1 (missing ddname)\n     - Exec changes\n       PDSEGEN    - Correct bug in table rebuilt from 5.1.1\n                  - Add short last selection variable for the\n                    short selection panels\n                  - Change TBAdd use of Mult for better perf\n     - Panel changes\n       PDSEGENA   - Change to use the short last selection variable\n       PDSEGENT   - Change to use the short last selection variable\n       PDSEGHN    - Add notes about PDSEGEN limitations\n\n  Version 5.1.1  January 24, 2018\n     - ASM/LOAD changes\n       PDSEGDEL   - Correction to properly delete from non-member generation\n                    PDS and PDSE's\n       PDSEGENI   - Increase DSERV buffer from 512*1024 to 512*10240 to\n                    support larger member counts - up to approx 42000 +/-\n     - Exec changes\n       PDSEGEN    - Fix one bad TBVClear usage\n                  - Change the location for the TBCreate\n                  - Change TBAdd use of Mult\n     - Misc changes\n       ASMJCL     - Make the Load library dataset name a symbolic\n     - Panel changes\n       PDSEGDLG   - Remove hilite attribute\n\n  Version 5.1.0  January 4, 2018\n     - Exec changes\n       PDSEGEN    - Support C > to change to the target dataset\n                    of the last Copy command or line selection\n                  - Check B/E/S/V commands for a member name/mask\n                  - Add new OPtions command to display a prompt panel\n                    for all available PDSEGEN commands\n                  - Change no generations message\n                  - Correctly add datasets to the dataset list if the\n                    user has noprefix\n                  - Display line selection popup on invalid selections\n                  - Add aliases for FIND for SRCh and SEArch\n                  - Correct issue with sort column colors on the member\n                    display panels\n     - Panels changes\n       All        - Changed the panel titles for consistency\n       PDSEGDSL   - Enable right/left scrolling for dsnames\n                    to allow for long dsnames with a member name\n       PDSEGENA   - Change title (shorter)\n       PDSEGENT   - Change title (shorter)\n       PDSEGEXA   - Change title (shorter)\n       PDSEGEXT   - Change title (shorter)\n       PDSEGHOP   - Help for PDSEGOPT\n       PDSEGHPS   - Document C >\n       PDSEGH0    - Added new OPtions command\n       PDSEGH11   - Document C >\n       PDSEGOPT   - Added to support OPtions command\n       PDSEGSRT   - Added skip from field to order\n\n  Version 5.0.2  December 14, 2017\n     - Exec changes\n       PDSEGEN    - Allow member/mask in dsname when called\n                    e.g. %pdsegen 'sys1.parmlib(ieasys*)'\n                  - Correct bug with dataset list\n                  - Support dsname(member-mask) in dataset list\n     - Panels changes\n       PDSEGDSL   - Remove dsname verification as that is not in code\n       PDSEGHMD   - Format update\n       PDSEGHS    - Added new calling option\n       PDSEGH6    - Typo correction on hide description\n       PDSEGMDL   - Correct tutorial panel reference\n\n  Version 5.0.1  December 03, 2017\n     - Exec changes\n       PDSEGEN    - Change to MODEL (JK) alloc\n                  - Allow opening empty PDSE or PDS\n                  - Log all Commands\n                  - Only check for the V.R and ignore the .M when\n                    displaying change tutorial at V.R change\n\n  Version 5.0.0  December 1, 2017\n     - ASM/Load changes\n       PDSEGDEL  - Update to correctly delete from non-member generation\n                   PDS/PDSE datasets\n     - Exec changes\n       PDSEGEN    - Support for ? to be used for single character filter\n                  - Change 1 char commands:\n                    C (Compare) becomes Z\n                    R (Recover) becomes G\n                    N (reName) becomes R\n                    C will now be COPy to new DS\n                    R will now be REName\n                  - Correct initial sort order\n                  - Add MODEL command to allocate a new dataset\n                    syntax:  MODel new-dataset-name\n                  - Change HIGEN relative gen to - a - instead of\n                    x'ff'\n                  - Speed up HIGen off process\n                  - Allow non-PDS/PDSE by calling ISPF 3.4 (DSLIST)\n                  - Support expanded line selection panels allowing\n                    9 character commands. Include support for optional\n                    info for some commands in the status field. Use\n                    left/right scrolling to change panels\n                  - Add expanded line commands\n                  - Allow any line selection to be a block command\n                    XX/XX or X99999\n                    - Expanded commands block by doubling the 1st\n                      character. No counts allowed however.\n                  - Increase DSList from 16 to 25\n                  - Add Sort Descending to the Dataset List process\n                  - Add Transfer line selection\n                  - Add option (see PDSEGENS) to display the Changes\n                    tutorial panel when the version changes\n       PDSEGBAK   - Update to support changed PDSEGENS return string\n       PDSEGCPR   - Update to support changed PDSEGENS return string\n       PDSEGENC   - Update to support changed PDSEGENS return string\n                  - Return return code 0 if copy successful\n                                       4 if not\n       PDSEGENS   - Update to support changed PDSEGENS return string\n       PDSEGRST   - Update to support changed PDSEGENS return string\n     - Panels changes\n       PDSEGDSL  - Add verification of entered dsname syntax\n                 - Add SORTD (Sort Descending) option\n       PDSEGEXA  - New 8 character selection - 4 digit year\n       PDSEGEXT  - New 8 character selection - 2 digit year\n       PDSEGHEC  - Clarify that COMPare can be abbreviated to COMP\n       PDSEGHLR  - Update for 8 character selection panels\n       PDSEGHMD  - Added for the new MODEL command\n       PDSEGH0   - Document block line commands\n                 - Added optional Primary Command Summary (PS)\n                 - Added Transfer (T) line selection command\n                 - Added MODEL command\n       PDSEGH15  - Add Transfer line selection command info\n       PDSEGH19  - Correction to REFresh short command from RE to REF\n       PDSEGH6   - Document block line commands\n                 - Added Transfer (T) line selection command\n       PDSEGHPS  - Added Primary Command Summary\n       PDSEGSL0  - Added Transfer selection\n       *         - many other panels to document the expanded line\n                   commands\n\n  Version 4.5.1  November 13, 2017\n     - ASM/Load changes\n       PDSEGMAT  - Update from Salvador Carrasco to resolve some\n                   pattern matching issues\n\n  Version 4.5.0  November 8, 2017\n     - Exec changes\n       PDSEGEN   - Allow E * with filter and if filter member doesn't\n                   exist.\n                 - Support using empty PDS/PDSE\n                 - Fix Time display if cpu=time\n                 - Increase DSList from 15 to 16\n                 - Enable DSList remove for last active dataset\n                 - Remove unexpected SORT with HIGEN command\n                 - Fix sort after table change\n       PDSEGVAL  - Enhanced the IEBPDSE report with more info\n                 - Use Browse instead of View for the IEBPDSE Report\n     - Panels changes\n       PDSEGH0   - Small text change to highlight point and shoot\n       PDSEGH11  - Updated DSlist from 15 to 16\n       PDSEGDSL  - Updated DSlist from 15 to 16\n       PDSEGHBE  - Updated with info on EDIT *\n\n  Version 4.4.9  October 20, 2017\n     - Exec changes\n       PDSEGEN   - Improve warning message text when attempts are made\n                   to process a dummy member (jk)\n                 - At close null the zcmd var\n                 - For eXec selection prompt for execution parms\n     - Panels changes\n       PDSEGXC   - Added for eXecute command prompt\n       PDSEGHRS  - Spelling correction\n       PDSEGH8C  - Spelling correction\n\n  Version 4.4.8  October 16, 2017\n     - Exec changes\n       all       - Change copyright year\n       PDSEGEN   - Minor tweaks to reduce some unneeded instructions\n                 - Small improvement to the Output command format\n                   and messages\n                 - Addition of a new HIGEN toggle command to display\n                   the 'dummy' members. These are members that IBM\n                   terms 'dummy' but which are effectively directory\n                   entries that hold the highest generation used by\n                   the members generations. This 'dummy' member only\n                   exists when all generations are deleted or when\n                   a member and all its generations are deleted.\n       PDSEGENS  - Change default setting for prune from 1 to 0\n                   to force a prompt for the Prune command\n     - Panels changes\n       all       - Added copyright to end of each panel\n       PDSEGTIM  - Correct variables used for timing\n                 - Added percentage for 4 of the metrics\n                 - Enable enter to go to PDSEGEN ISPF Tutorial Panel\n       PDSEGH0   - Updated to add Output\n       PDSEGHEC  - Improved the tutorial text\n       PDSEGHHW  - Added for tutorial for HIGen\n       PDSEGHOU  - Added for Output Tutorial\n       PDSEGHT   - Change Ghost to Dummy\n       PDSEGRMP  - Change Ghost to Dummy\n       PDSEGTIM  - Change Ghost to Dummy\n\n  Version 4.4.7  September 28, 2017\n     - Exec changes\n       PDSEGEN   - Improve the INFormation with generation metrics\n                 - Allow target DSN on COPY command\n                 - Changed RESTORE command to call PDSEGRST\n       PDSEGRST  - Improved restore application with member and generation\n                   selectivity\n     - Panels changes\n       PDSEGENI  - Update for new member info counts\n       PDSEGHBJ  - Update for new restore dialog\n       PDSEGHBR  - Update for new restore dialog\n       PDSEGHRS  - Added for new restore dialog\n       PDSEGH0   - Added new Restore tutorial\n       PDSEGH3   - Update for COPY to-pdse-dsn\n       PDSEGRST  - New Restore Prompting Panel\n\n  Version 4.4.6  September 19, 2017\n     - Exec changes\n       PDSEGEN   - Improve the INFormation with generation metrics\n     - Panels changes\n       PDSEGCPY  - Updated to allow changing the space units (blk, cyl, trk)\n       PDSEGINF  - Updated for new metric\n\n  Version 4.4.5  September 14, 2017\n     - Exec changes\n       PDSEGEN   - Additional performance updates\n                 - improved ghost member awareness\n                 - Performance tweak using tbscan instead of\n                   tbskip/compare in many places\n     - Panels changes\n       PDSEGTIM  - New panel\n\n  Version 4.4.4  September 5, 2017\n     - Exec changes\n       PDSEGEN   - Correction for B/E/Sub/V if no generation 0 exists\n                   for the requested member\n                   - this can happen if the member was deleted outside\n                     of PDSEGEN with the generations remaining but no\n                     generation 0 (still can't get to the generations)\n     - Panels changes\n       PDSEGINF  - Correct the tutorial panel reference\n\n  Version 4.4.3  September 1, 2017\n     - Exec changes\n       PDSEGEN   - Correction for B/E/Sub/V on non-generation dataset\n                 - Add DCB check before any SUBMIT and prevent if not valid\n\n  Version 4.4.2  September 1, 2017\n     - Exec changes\n       PDSEGEN   - Enable B/E/Sub/V on members not in the active\n                   member list\n                 - And make them work the way one expects\n                 - Use pdsegdel for all deletes\n     - Panels changes\n       PDSEGINF  - Remove bold for utilization\n\n  Version 4.4.1  August 29, 2017\n     - Exec changes\n       PDSEGEN   - Update to add new Browse/Edit/View commands\n                 - Add H(Hide) line selection\n                 - Update OUTPUT to use 4 digit year for dates in the\n                   report\n                 - Add SUBmit command\n     - Panels changes\n       PDSEGHBE  - New tutorial panel for Browse/Edit/View Command\n                 - Add H (hide) line selection\n       PDSEGH0   - Update to add new PDSEGHBE panel\n       PDSEGH1   - Clean up to move Edit command to new panel\n       PDSEGHLH  - Tutorial for line Hide selection\n       PDSEGHSS  - Tutorial for SUBmit command\n\n  Version 4.4.0  August 16, 2017\n     - ASM/Load changes\n       PDSEGMAT  - Updated/improved routine from Salvador Carrasco\n                   * now rent/reus\n     - Exec changes\n       PDSEGBAK  - Use PDSEGVER exec to get version of PDSEGEN package\n       PDSEGEN   - Use PDSEGVER exec to get version of PDSEGEN package\n                 - eliminate message if pds does not have member\n                   generations after the 1st time\n                 - Clean up message isrz002 after browse in a pds\n                   without gens\n       PDSEGENC  - Use PDSEGVER exec to get version of PDSEGEN package\n       PDSEGVER  - Added exec to provide version of PDSEGEN package\n     - Misc changes\n       ASMJCL    - Change PDSEGMAT ASM/Link to Rent,Reus\n     - Panels changes\n       PDSEGBAK  - Fix color of panel header\n       PDSEGCL   - Fix color of panel header\n       PDSEGPRC  - Fix color of panel header\n       PDSEGPRV  - Fix color of panel header\n       PDSEGRM   - Fix color of panel header\n       PDSEGRMP  - Fix color of panel header\n       PDSEGRNM  - Change input field from 9 to 8 characters\n                 - Fix color of panel header\n\n  Version 4.3.9  July 05, 2017\n     - Exec changes\n       PDSEGEN   - Back to using LMMDEL but with LMINIT ENQ(SHRW)\n\n  Version 4.3.8  July 03, 2017\n     - Exec changes\n       PDSEGEN   - Change from using LMMDEL to using TSO Delete for non\n                   generation enabled member deletes\n\n  Version 4.3.7  June 20, 2017\n     - ASM changes\n       PDSEGDEL  - Always use STOW DG for deletes\n     - Exec changes\n       PDSEGBAK  - version change only\n       PDSEGEN   - Add PFSHOW routine and use around addpop/rempop\n                 - If line selection unknown then issue msg and change\n                   to /\n                 - If PDS/PDSE not generation enabled use LMMDEL for\n                   deletes\n       PDSEGENC  - version change only\n     - Panel changes\n       PDSEG*    - Change panel header - clean up\n       PDSEGH0   - Update for Info line option\n       PDSEGHAT  - Add the Info option to the tutorial panels\n       PDSEGHN   - Typo fix and more notes\n       PDSEGH6   - Add info on Info\n       PDSEGSLN  - Add Info option\n       PDSEGSL0  - Add Info option\n\n  Version 4.3.6  June 12, 2017\n     - Exec changes\n       PDSEGEN   - Allow ? for DSN on the command to display tutorial\n     - Panel changes\n       PDSEGHT   - Fix text alignment\n\n  Version 4.3.5  June 8, 2017\n     - Exec changes\n       PDSEGEN   - Fix exit if entry with DSN of *\n       PDSEGENC  - Version change only\n       PDSEGBAK  - Version change only\n\n  Version 4.3.4  May 19, 2017\n     - Exec changes\n       PDSEGEN   - Change to set last option for mail\n     - Panel changes\n       PDSEGRNM  - Change cursor position for rename prompt\n\n  Version 4.3.3  May 19, 2017\n     - Exec changes\n       PDSEGBAK  - Change to use edit macro parm\n       PDSEGCPR  - Change to use edit macro parm\n       PDSEGEN   - Change to use edit macro parm\n                   instead of using a variable\n       PDSEGENC  - Change to use edit macro parm\n       PDSEGENM  - Change to use edit macro parm\n\n  Version 4.3.2  May 4, 2017\n     - Panel changes\n       PDSEGH8C  - Correction of typo\n       PDSEGPH   - Typo correction\n\n  Version 4.3.2  April 26, 2017\n     - Exec changes\n       PDSEGEN   - Fix bug detecting members after deletes\n     - Panel changes\n       PDSEGH16  - Update for Scrolling field\n       PDSEGUC   - Update to use Scrolling field\n\n  Version 4.3.1  April 24, 2017\n     - ASM changes\n       PDSEGDEL  - Updated to use STOW type D if generation is 0\n     - Exec changes\n       PDSEGEN   - Add error message if edit fails\n     - Panel changes\n       PDSEGUC   - Add vput for user command to save in profile\n\n  Version 4.3.0  April 12, 2017\n     - Exec changes\n       PDSEGEN   - Support Edit * and View * on command line\n                 - New Setting for table positioning\n                 - Support for User Color Settings\n                 - Add GENOnly (abbrev G) to hide all base members\n                 - Other minor tweaks\n       PDSEGBAK  - Make prompt panel a popup\n                 - Recurse into ISPF Applid PDSE\n       PDSEGENC  - Correct report in batch\n                 - Recurse into ISPF Applid PDSE\n     - Panel changes\n       ALL       - All panels were changes to adjust some colors and\n                   eliminate the reverse video in the panel title.\n\n  Version 4.2.2  March 22, 2017\n     - Exec changes\n       PDSEGEN   - Support progress indicator on panel PDSEGCPY\n                 - Issue error message if unknown line command\n                 - Improved test for Ghost members by only testing\n                   for TTR=000000\n                 - Change flag from any non-blank to TIME or CASPER\n                 - Add MULT to TBADD with total members returned by\n                   PDSEGENI\n                 - Support MEMList and ML as aliases of Filter\n                   - Both from PDS command\n       PDSEGENC  - If (batch is specified then browse messages instead\n                   of directing them to the terminal.\n       PDSEGENM  - Add eXclude to Compare\n     - Panel changes\n       PDSEGAT    - Support 8 character userid if z/OS 2.3 or newer\n       PDSEGCL    - Change color yellow to white\n       PDSEGCPS   - Change color yellow to white\n       PDSEGCPY   - Change color yellow to white\n                  - Update for progress indicator\n       PDSEGDEL   - Removed\n       PDSEGDLB   - Updated to allow a / instead of Y\n       PDSEGDLG   - Updated to allow a / instead of Y\n       PDSEGFND   - Change color yellow to white\n       PDSEGHAU   - Change color yellow to white\n       PDSEGHCG   - Change color yellow to white\n       PDSEGHD    - Change color yellow to white\n       PDSEGHF    - Add alias for Filter (MEMList or ML)\n       PDSEGHN    - Change color yellow to white\n       PDSEGHS    - Change color yellow to white\n       PDSEGH3    - Update tutorial for PDSEGCPY\n       PDSEGH6    - Change color yellow to white\n       PDSEGINF   - Color changes (thanks to JK)\n       PDSEGPRC   - Change color yellow to white\n       PDSEGRM    - Change color yellow to white\n       PDSEGRNM   - Change color yellow to white\n\n  Version 4.2.1  January 23, 2017\n     - Exec changes\n       PDSEGEN    - Add selection option of A for Attributes\n                  - Allow Exit and Quit on dataset selection panel\n                  - Clean up base delete process\n       PDSEGBAK   - Version change only\n       PDSEGENC   - Version change only\n     - Panel changes\n       PDSEGAT    - Attributes panel\n       PDSEGDLB   - Update delete base member panel\n       PDSEGDSL   - Add End, Exit or Quit to exit panel\n       PDSEGHAT   - Attributes Tutorial panel\n       PDSEGHN    - Notes Tutorial panel\n       PDSEGH0    - Primary tutorial panel\n       PDSEGH6    - Line selection command tutorial panel\n       PDSEGSL0   - Base (gen 0) selection prompt popup panel\n\n  Version 4.2.0  January 5, 2017\n     - ASM changes\n       PDSEGDEL   - Changed to AMODE 24 (cosmetic)\n     - Exec changes\n       PDSEGEN    - Enhance delete process to enable delete of base\n                    member and promote generations.\n       PDSEGBAK   - update for version change\n       PDSEGENC   - update for version change\n     - Panel changes\n       PDSEGDEL   - Obsolete panel\n       PDSEGDLB   - Base member delete panel\n       PDSEGDLG   - Generation member delete panel\n       PDSEGHRN   - Update for enhanced base delete\n\n  Version 4.1.9  December 13, 2016\n     - Exec changes\n       PDSEGEN    - Version change only\n       PDSEGENC   - Prevent copy of null member names\n\n  Version 4.1.8  December 12, 2016\n     - Exec changes\n       PDSEGEN    - Correct mail=0 to prevent use of M selection\n\n  Version 4.1.7  December 05, 2016\n     - Exec changes\n       PDSEGEN    - Correct sort with extended ISPF statistics\n\n  Version 4.1.6  November 29, 2016\n     - Exec changes\n       PDSEGEN    - Allow SET= anywhere in the parameters\n     - Panel changes\n       PDSEGFP    - Add hit counter to progress display\n\n  Version 4.1.5  October 25, 2016\n     - Exec changes\n       PDSEGEN    - Add 4 digit year variables\n                  - Add Left/Right table commands to change the\n                    table view from 2 digit year to 4 digit year\n                    - the INIT column is sacrificed for this\n                    - the last used panel is saved and used the next\n                      time PDSEGEN is called\n                  - Add PASSLIB to the HELP command\n     - Panel changes\n       PDSEGENA   - Added table display for 4 digit year\n       PDSEGENI   - Add fields for 4 digit years (create and mod)\n       PDSEGENT   - Align the Init column\n                  - ready for 8 char userid\n       PDSEGHEC   - enhanced info on compare command\n       PDSEGH0    - updated to add Left/Right info\n                  - Relabel 3rd column from Documentation to More Info\n       PDSEGHLR   - added to document Left/Right commands\n       PDSEGHU    - Update for CA-Disk status\n\n  Version 4.1.4  October 07, 2016\n     - Doc changes\n       $DOC       - updated to document changes needed for batch\n       $INSTALL   - updated to document changes needed for batch\n     - Exec changes\n       PDSEGEN    - Allow null default unit\n                  - Correction for ttr test\n                  - After using the dataset list always return\n                    to it to exit\n                  - If entry using the dataset prompt then return\n                    to it to exit\n       PDSEGBAK   - Allow null default unit\n                  - Correction for ttr test\n                  - Correction for backup messages (bmem)\n                  - Removed stats from $* members as that was\n                    failing in batch\n                  - Changed to use relative gen instead of\n                    absolute gen\n       PDSEGENC   - Allow null default unit\n                  - Correction for ttr test\n       PDSEGENM   - Add define for compare routine\n       PDSEGENS   - Allow null default unit\n       PDSEGCPR   - New ISPF Edit command to do compares\n     - Panel changes\n       PDSEGHAU   - Change for release update\n       PDSEGHCG   - Change for release update\n       PDSEGCPS   - Add counter to the copy status display\n       PDSEGH0    - Add new Edit/View Compare link\n       PDSEGHN    - Add comments about Edit/View Compare\n       PDSEGHEC   - New tutorial panel for Edit/View Compare\n       PDSEGHBJ   - Add comments about occasional Backup failure\n                    in Batch\n\n  Version 4.1.3  September 19, 2016\n     - Exec changes\n       PDSEGEN    - update to not generate messages in\n                    browse/edit/view with generation info if\n                    generations are not enabled in the dataset\n                  - if the dataset is not generation enable then\n                    generate error message for a Compare attempt\n                  - get default unit for allocation from PDSEGENS\n                  - additional test for null (x'00') member name\n                    to flag as ghost\n       PDSEGBAK   - get default unit for allocation from PDSEGENS\n                  - additional test for null (x'00') member name\n                    to ignore\n       PDSEGENC   - get default unit for allocation from PDSEGENS\n                  - additional test for null (x'00') member name\n                    to ignore\n       PDSEGENS   - add default unit for new allocations\n     - Panel changes\n       PDSEGSET   - Change default cursor position\n       PDSEGHAU   - Change for release update\n       PDSEGHCG   - Change for release update\n\n  Version 4.1.2  September 8, 2016\n     - Exec changes\n       PDSEGEN    - Add Sort Popup prompt\n     - Panel changes\n       PDSEGSRT   - Sort popup prompting panel\n\n  Version 4.1.1  September 8, 2016\n     - Exec changes\n       PDSEGEN    - Change Browse/Edit short message\n       PDSEGENS   - Change clean default to 0 with comments not to\n                    set it to 1 unless the PTF for APAR OA50214 is\n                    installed. If set to 1 without PTF then it could\n                    cause corruption to the PDSE.\n       PDSEGVAL   - Added parm of FLUSH\n                  - Change allocation for report to a true temp d/s\n     - Panel changes\n       PDSEGHAU   - Version change\n       PDSEGHCG   - Updated for changes\n       PDSEGHR    - Comment cleanup\n\n  Version 4.1.0  September 7, 2016\n     - ASM changes\n       PDSEGMAT   - new module, rexx function, from cbt file 386 by\n                    Salvador Carrasco. Used to do pattern matching\n                    for * and % in member name.  Originally called\n                    IRXF@MAT but was renamed to fit in with the\n                    PDSEGEN modules.\n     - Exec changes\n       PDSEGEN    - Promote display issue fixed\n                  - Allow dsname of * on the prompt panel\n                  - If called with a DSN of * then display change\n                    DSN list\n                  - Add message for browse showing generation info\n                  - Add message for edit of base gen showing gen info\n                  - Display panel PDSEGFIL popup for FILTER\n                    blank or ?\n                  - Issue error message for unknown Command\n                  - Add HIDE command to hide all generations\n                    - toggle and also reset by REFRESH\n                  - issue error message for unknown line selection\n                  - correction to handle strings\n                  - Make all datasets in the Change DS list fully\n                    qualified (to prevent dups)\n                  - Added date filters Today, Week, Month,\n                    Since yy/mm/dd, Since -nn, and Year\n                  - Allow both member filter and date filter on command\n                    line and as FILTER options\n                  - Call rexx function PDSEGMAT to match member filter\n                    pattern\n                  - If TTR is x'000000' then flag as ghost\n                  - Locate now works on any sortable column and operates\n                    on the last sorted column. The default column is the\n                    Name column.\n                  - Support CLEAR and SORT on the change dataset list\n                  - Support SET=x on the start command\n                  - Allow S or E member gen\n                  - Add popup if Find blank entered\n                  - Add filter on REFRESH command\n                  - New PDSEGENS option for prune prompting\n       PDSEGENC   - If the target PDS/PDSE has MAXGEN of 0 then\n                    don't copy generations\n                  - if TTR is x'000000' then ignore as ghost\n                  - support all member filter patterns and date filters\n                  - add parm options of New and Batch\n       PDSEGENM   - Improve the Compare edit message\n       PDSEGENS   - New PDSEGENS option for prune prompting and temp member\n       PDSEGENX   - Update to add filter\n       PDSEGBAK   - Correct progress meter to account for generations\n                  - Add preparing message\n                  - Change test for deleted members to improve\n                    performance\n                  - if TTR is x'000000' then ignore as ghost\n       PDSEGVAL   - Add SYSIN DD DUMMY allocation to make sure it is\n                    a dummy allocation for IEBPDSE\n     - Misc changes\n       $APARS     - added to distribution PDS and $RECV browsing\n       $DOC       - updated for changes\n       $RECV      - Added in a compress if receiving into existing\n                    datasets\n                  - Add a LoadGo of member CLS to clear the screen\n                    before the prompts for the receive HLQ\n       @ASMCLS    - BAL (assembler) source for the CLS TSO command\n                    which is a command to clear the TSO screen.\n       ASMJCL     - update to add PDSEGMAT\n       CLS        - Object deck of @ASMCLS used in $RECV\n       SAMPCOPY   - updated for new copy options\n     - Panel changes\n       PDSEGCPY   - Expand filter to allow for pattern and\n                    date filters\n       PDSEGH0    - Add Hide\n                  - Add startup syntax\n                  - Add vendor support page\n                  - Add Date filter tutorial page\n                  - Make point and shoot capable\n       PDSEGH     - Updated for dsn of *\n                  - Update to mention compare is only old to new\n       PDSEGHN    - remove comments on pdsegenc\n                  - Update to mention compare is only old to new\n       PDSEGHT    - Update to mention compare is only old to new\n       PDSEGH2    - Update to mention compare is only old to new\n       PDSEGH4    - Update to split Locate and Refresh\n       PDSEGENP   - Updated for dsn of *\n       PDSEGFND   - Added for Find popup\n       PDSEGHS    - Added for Startup Syntax\n       PDSEGHV    - Added for list of vendors who support member\n                    generations\n       PDSEGH17   - Hide tutorial\n       PDSEGH18   - Date filter tutorial\n       PDSEGH19   - Added for Refresh\n       PDSEGFIL   - update to remove uscore for zcmd\n       PDSEGHAU   - update for current version\n       PDSEGHCG   - update for current updates\n       PDSEGHF    - update for new filter option\n       PDSEGINF   - changed the color from turq to blue\n       PDSEGCOM   - Update to mention compare is only old to new\n\n  Version 4.0  August 19, 2016\n     - Exec changes\n       PDSEGEN    - Change Version to 4.0 due to the number of\n                    enhancements\n                  - If Filter in place use for Copy\n                  - Add QUIT and EXIT as commands\n                  - Add C ? option for a list of 15 previous\n                    datasets or C # to get directly to entry #\n                  - Improve test of invalid dsn\n                  - Allow a filter on the C (change) command\n                  - Reset Delete Prompt after each group of deletes\n                  - Change default Selection opt to /\n                  - Allow option to be passed on PRUNE command\n                  - Message if Filter with blank\n                  - Added U for user command\n                  - Added K (clone) option to clone a member\n                    ** generations are NOT cloned\n                  - Correction if Edit is canceled on new member to\n                    not update the row with last option.\n                  - If selection is O or / then display panel PDSEGSLN\n                    or PDSEGSL0\n                  - Correction for ghost member appearing in table\n                    after del\n                  - Correction for members/gens with no stats\n                    *Major Bug Fix*\n                  - Reset table title row after Prune Reset if Filter\n                    was on\n                  - Fix rename issue with just recovered member\n                  - Fix so multiple line commands can be\n                    selected at once\n                  - Clean up of last used option\n                  - Process PDSEGENS new option of clean for Validate\n       PDSEGENC   - Correction for copy count due to ghosts not\n                    copying\n       PDSEGENS   - Update to add Clean option (see PDSEGVAL)\n       PDSEGBAK   - Correction for members/gens with no stats\n                    *Major Bug Fix*\n                  - Add Control Errors Return for testing members\n                    to see if they are ghosts\n                  - Add Batch option for online scripting\n       PDSEGVAL   - Add parm option of clean to force clean up of\n                    pending deletes.\n                    See APARs OA47755 and OA50214.\n     - Misc changes\n       SAMPLE     - A sample backup of a PDSE for testing and\n                    demonstration purposes in TSO Transmit format\n       $RECV      - Update to restore SAMPLE backup PDS from TSO\n                    Transmit format.  The user must use PDSEGEN\n                    to restore to real PDSE.\n     - Panel changes\n       PDSEGH*    - Changed command line from Selection to Command\n       PDSEG*     - Added/corrected the help panel for numerous panels\n       PDSEGENT   - Typo correction\n                  - add K (clone) option\n       PDSEGCL    - Klone prompt\n       PDSEGENP   - Add / as a selection option\n       PDSEGHAU   - Update version\n       PDSEGHCG   - change history\n       PDSEGDEL   - updated\n       PDSEGDSL   - added for dataset selection list\n       PDSEGHD    - typo correction\n       PDSEGHU    - typo correction and add Compuware's Topaz\n       PDSEGH0    - several updates\n       PDSEGH11   - updated for C (change) updates\n       PDSEGH13   - new tutorial panel for select/edit commands\n       PDSEGH14   - new tutorial panel for Line Selection prompting\n       PDSEGH15   - new tutorial panel for Klone\n       PDSEGH16   - new tutorial panel for User command\n       PDSEGH8    - update tutorial for / set option\n       PDSEGHPD   - Added with doc on IEBPDSE\n       PDSEGRM    - define cursor location\n       PDSEGSET   - Add / as a selection option and make point and shoot\n       PDSEGSLN   - added\n       PDSEGSL0   - added\n       PDSEGUC    - Added for user command\n\n  Version 3.9   August 10, 2016\n     - ASM changes\n       PDSEGDEL   - Changed to RENT,REUS\n                    thanks to Bill Fleury's contribution\n     - Exec changes\n       PDSEGEN    - Added PRUNE command\n                  - Add SET option to bypass the SET prompt panel\n                  - Clean up sort a bit\n                  - Error message if Locate blank\n                  - Use PDSEGDEL for all delete processing instead\n                    of LMMDEL\n                  - Add NOWRITE to the TBCREATE\n                  - Clean up relative gen after delete of individual\n                    gen\n                  - Change to use panel pdseginf for INFO (was\n                    pdsedgend)\n                  - Prevent reName for non-0 gen\n                  - Add relative generation number on delete message\n                  - Allow Edit for non-gen d/s members\n                  - Prevent Promote/Recover for non-gen d/s members\n     - Misc changes\n       $MODULES   - Add to summarize what the load modules do\n       ASMJCL     - Updated to reflect change in PDSEGDEL RENT\n                    status\n       PDSEGDEL   - added to the distribution load library\n     - Panel changes\n       PDSEGHAU   - Update version\n       PDSEGHBJ   - enable zcmd\n       PDSEGHC    - enable zcmd\n       PDSEGHCG   - change history\n       PDSEGHN    - add prune notes\n       PDSEGHT    - add prune tips\n                  - add tip about copying a non-gen pds into a pdse\n                    with generations enabled\n       PDSEGH0    - Added Prune and restructure\n                  - Add Mail option\n       PDSEGH6    - Update to document loss of absolute\n                    generation numbers\n                  - Update for improved Delete\n                    (missed doing this in 3.8)\n       PDSEGH8    - Update for SET option\n       PDSEGH12   - Prune tutorial\n       PDSEGHM    - Added for Mail tutorial\n       PDSEGPRU   - Prune prompting popup panel\n       PDSEGPRV   - Prune RESET validation popup\n\n  Version 3.8a  August 05, 2016\n     - MISC changes\n       ASMJCL     - Fixed JCL options\n\n  Version 3.8   August 05, 2016\n     - ASM changes\n       PDSEGDEL   - Added as a REXX function to delete members and\n                    member generations (not to be used for non member\n                    generation enabled datasets)\n     - Exec changes\n       $RECV      - Updated to properly handle the source dataset name\n       PDSEGEN    - Update locate routine when member not located\n                  - update reName newname to mbr\n                  - correction for null tso prefix users\n                  - use PDSEGEL to delete members/generations if the\n                    generations are enabled\n                    - used in the rename routine as well\n                  - LMMDEL will be used for non-generation enabled\n                    datasets\n                  - fix bug in rename and recover thx to Bill Fleury\n       PDSEGENC   - correction for null tso prefix users\n     - Misc changes\n       $RECV      - Correction for received dsn\n       $INSTALL   - Added\n     - Panel changes\n       PDSEGH0    - Correction for abbreviation comment\n                  - Add Delete to the Rename tutorial panel\n       PDSEGHR    - Add some more info to restrictions\n       PDSEGHRN   - Add Delete to the Rename tutorial panel\n       PDSEGHT    - Add tip on use of delete\n\n  Version 3.7   August 2, 2016\n     - Exec changes\n       GNAME      - ISPF Edit command (macro) added based on suggestion\n                    from John Kalinich.\n                    * Use in PDSEGBAK PDS on backup member to find\n                      real member name and generation information\n       PDSEGEN    - Update to change the color of the sorted column\n                    Thanks to a suggestion from Bruce Koss\n                  - allow sort field-name order (order = a or d)\n                  - add new SET command to change line selection S\n                    action (browse, edit, or view)\n                  - Remove Control Display Save/Restore as not needed\n                    in some places\n                  - Changed to use NEWAPPL(PDSE)\n                  - Support SORT ? as a command to display the SORT\n                    popup information\n                  - Add C command to change to a different dataset.\n                  - If Find in a backup pds use alternate find\n                    routine Thanks to John Kalinich\n       PDSEGENS   - Add base_color and sort_color defaults\n       PDSEGFND   - New exec for find within backup PDS\n     - Panel changes\n       PDSEGENT   - Update for dynamic colors for sorted columns\n       PDSEGHBR   - Update for new GNAME command info\n       PDSEGHF    - Update to add command abbreviation\n       PDSEGHFS   - Update to add command abbreviation\n       PDSEGHR    - Updates to restrictions\n       PDSEGHT    - Add FTP to the list of restrictions\n       PDSEGHU    - Added to document unsupported products\n       PDSEGH0    - Updated for PDSEGH8\n       PDSEGH10   - Renamed from PDSEGH15\n       PDSEGH11   - Added for the C command\n       PDSEGH2    - Update to add command abbreviation\n       PDSEGH4    - Update to add command abbreviation\n       PDSEGH5    - Update to add command abbreviation\n       PDSEGH6    - Update for sort order\n       PDSEGH8    - Added for SET command help\n       PDSEGH9    - Added for Validate command\n       PDSEGSET   - Added for SET command\n\n  Version 3.6   July 29, 2016\n     - Exec changes\n       PDSEGEN    - Add INFO command\n     - Panel changes\n       PDSEGHAU   - update version\n       PDSEGHCG   - update change history\n       PDSEGHCD   - Panel for INFO\n       PDSEGENT   - Change created and changed headings\n       PDSEGH0    - Add option I for Info and change 15 to N, 16 to R\n                    and 17 to T\n       PDSEGH15   - Add for INFO command\n\n  Version 3.5a  July 29, 2016\n     - Panel changes\n       PDSEGH0    - Added option 17 for Hints and Tips\n       PDSEGHT    - Added Hints and Tips\n       PDSEGHAU   - update version\n       PDSEGHCG   - update change history\n       PDSEGENT   - Fix truncated vv.mm\n\n  Version 3.5   July 28, 2016\n     - Exec changes\n       PDSEGEN    - Fix member display list\n                  - Dynamically get the system maxgen limit and\n                    use it for the COPY operation\n       PDSEGBAK   - Update to check system maxgen limit and compare\n                    to $ALLOC maxgen value. If $ALLOC value is greater\n                    then use system limit and inform user.\n       PDSEGENC   - Correction if used to copy a non-generation enabled\n                    PDS\n     - Panel changes\n       PDSEGHAU   - update version\n       PDSEGHCG   - update change history\n       PDSEGCPY   - Add system maxgen limit and verify the range\n                    if the maxgen changed\n       PDSEGENT   - Add REINIT(ZCMD)\n\n  Version 3.4   July 27, 2016\n     - Exec changes\n       PDSEGEN    - Fix member display list\n                    location\n                  - other cleanup for last used op\n                  - Correct zcmd after copy\n                  - Change Copy space units from 1 char to 3\n       PDSEGENM   - Remove extraneous trace for find routine (sigh)\n       PDSEGBAK   - Add time stamp for start of backup/restore\n     - Panel changes\n       PDSEGCPY   - update for larger space units value\n       PDSEGHAU   - update version\n       PDSEGHCG   - update change history\n\n  Version 3.3   July 25, 2016\n     - Exec changes\n       PDSEGEN    - Add Find command (suggestion from John Kalinich)\n                  - Allow changing space and maxgen on copy\n                  - Allow S member as alias of Edit member\n       PDSEGBAK   - Change from msg isrz001 to isrz002\n       PDSEGENM   - Add Find command\n       PDSEGBAK   - Change from msg isrz001 to isrz002\n       PDSEGENC   - Change from msg isrz001 to isrz002\n       PDSEGBAK   - Change from msg isrz001 to isrz002\n     - Panel changes\n       PDSEGCPY   - Add option to change space and maxgen\n       PDSEGFP    - Add progress for Find\n       PDSEGHAU   - update version\n       PDSEGHCG   - update change history\n       PDSEGHFS   - tutorial for Find\n       PDSEGHN    - Add comment on Find\n       PDSEGH0    - Add Find to tutorial menu\n       PDSEGH3    - Add Space and Maxgen change ability\n\n  Version 3.2   July 21, 2016\n     - Exec changes\n       PDSEGEN    - Update to prime Backup or Restore when calling\n                    PDSEGBAK\n       PDSEGBAK   - Update to progress meter\n                  - Report elapsed time for backup and restore\n       PDSEGENC   - Add display progress for base members\n                  - Correction in logic if replace blank\n                  - Report elapsed time for backup and restore\n     - Misc changes\n       DOCX       - removed to be added into a zip file as too large\n                    for SMTP\n     - Panel changes\n       PDSEGBAK   - change default initial cursor position to fromdsn\n                    or todsn\n       PDSEGCPY   - change default initial cursor position to topdse\n       PDSEGHAU   - update version\n       PDSEGHCG   - update change history\n\n  Version 3.1   July 20, 2016\n     - Exec changes\n       PDSEGEN    - If filter is * then turn off filtering\n       PDSEGBAK   - Updated to add progress meter\n                  - Delete temp dataset for report if it exists\n                  - Correction to not call ISPF Browse for\n                    backup report if running in batch\n     - Misc changes\n       $RECV      - updated to update the ASMJCL member of the\n                    install PDS with the dataset names of the\n                    restored (received) source and load library\n       DOCX       - added - User's Guide in MS Word format\n                    download in binary and open - tailor for your site\n     - Panel changes\n       PDSEGHAU   - update version\n       PDSEGHCG   - update change history\n       PDSEGPR    - Added for backup/restore progress display\n\n  Version 3.0a  July 20, 2016\n     - Panel changes\n       PDSEGRM    - Add generation to recover prompt\n       PDSEGH5    - Remove non-working option\n       PDSEGHBJ   - Update to replace comments about COPY with\n                    Backup/Restore\n\n  Version 3.0   July 19, 2016\n     - ASM changes\n       PDSEGENI   - fix to support some pds members with no stats that\n                    were being ignored\n     - Exec changes\n       PDSEGEN    - Support new BACKUP and RESTORE commands to invoke\n                    PDSEGBAK\n                  - use Replace instead of Cut/Paste\n       PDSEGGENC  - use Replace instead of Cut/Paste\n                  - Enhance reporting to include relative gen\n       PDSEGBAK   - New exec to backup or restore a PDSE V2 with\n                    all member generations\n                  - Enhance reporting to include relative gen\n                  - Additional doc and add $BACKUP member\n       PDSEGGENM  - Add replace option\n     - Panel changes\n       PDSEGBAK   - Add tutorial\n       PDSEGHAU   - update version\n       PDSEGHBJ   - added to document batch backup/restore\n       PDSEGHBR   - updated\n       PDSEGHCG   - update change history\n       PDSEGH0    - updated to add Backup and Restore commands and\n                    reorder\n       PDSEGH3    - updated\n     - Other changes\n       SAMPBR     - added sample batch JCL to backup and restore\n       SAMPCOPY   - updated sample JCL with refinements\n\n  Version 2.91  July 15, 2016\n     - Exec changes\n       PDSEGBAK   - New exec to backup or restore a PDSE V2 with\n                    all member generations\n     - Panel changes\n       PDSEGBAK    - ISPF panel for PDSEGBAK\n\n  Version 2.91  July 14, 2016\n     - Exec changes\n       PDSEGEN   - Turn TSO PROFILE MSGID off for JCL submit\n                   and back on if it was on before\n     - Panel changes\n       PDSEGHAU  - update version\n       PDSEGHCG  - update change history\n\n  Version 2.9   July 13, 2016\n     - Exec changes\n       PDSEGEN   - Add selection option J to submit the member to the\n                   internal reader\n     - Panel changes\n       PDSEGHAU  - update version\n       PDSEGHCG  - update change history\n       PDSEGHX   - add Submit\n       PDSEGH0   - add Submit\n       PDSEGH6   - add J line selection\n\n  Version 2.8   July 06, 2016\n     - Exec changes\n       PDSEGEN   - Cleanup Sort to use improved point/shoot on the\n                 panel - Add reName option N to rename a member -\n                 Removed the set_msgid process as it didn't work as\n                   desired\n                 - Correct but in locate routine\n                 - Support extended statistics in member\n                 - Support Filter /a same as a/ and a: same as a/\n                 - Support Filter for member name\n       PDSEGENC  - Support same filters are PDSEGEN\n       PDSEGENS  - removed the msgid option\n     - Panel changes\n       PDSEGCPY  - update panel\n       PDSEGENP  - update for improved filtering\n       PDSEGENT  - updated the point and shoot to use PAS(ON) and\n                   thus hilite(uscore)\n       PDSEGHAU  - update version\n       PDSEGHCG  - update change history\n       PDSEGHF   - update for filter enhancements\n       PDSEGHR   - update restrictions\n       PDSEGHRN  - Help for reName\n       PDSEGH0   - Add help for reName\n       PDSEGH6   - Updated for reName\n       PDSEGPH   - update for filtering enhancements\n       PDSEGRNM  - Rename prompt popup panel\n\n  Version 2.71  June 30, 2016\n     - Exec changes\n       PDSEGEN   - version change\n     - Panel changes\n       PDSEGHAU  - added from John Kalinich (with thanks)\n       PDSEGHCG  - ditto\n       PDSEGHD   - add to display support disclaimer\n       PDSEGH0   - updated to add author and disclaimer tutorial\n       pages PDSEGH6   - wording corrections\n\n  Version 2.7   June 29, 2016\n     - Exec changes\n       PDSEGEN   - Change 3 displays to use popups\n                 - Prompt for Delete\n                   - thanks to Peter Giles suggestion\n                 - Check for z/OS 2.1 or newer and message/exit if\n                   not - thanks to Peter Giles suggestion\n                 - Changed to call PDSEGENS to setup site\n                   customization variables\n                 - Display blanks for stats if no stats present\n                 - Clean up last option for Recover\n                 - Correct dialog exit if on Delete generations are\n                   selected along with the base member\n                 - Add filter command\n       PDSEGENM  - Change the locate special to locate label\n       message PDSEGENS  - Added to provide a central place for\n       site customization\n                   variables\n       $RECV     - Update to display this member\n     - Panel changes\n       PDSEGCOM  - change from pad('_') to hilite(uscore)\n                   suggested by Tom Conley\n       PDSEGCPY  - change from pad('_') to hilite(uscore)\n                   suggested by Tom Conley\n       PDSEGDEL  - added - delete confirmation panel\n       PDSEGENP  - change from pad('_') to hilite(uscore)\n                   suggested by Tom Conley\n                 - Add filter option\n       PDSEGENT  - change from pad('_') to hilite(uscore)\n                   suggested by Tom Conley\n       PDSEGHC   - renamed\n       PDSEGHF   - new for filter\n       PDSEGHI   - renamed\n       PDSEGHR   - renamed\n       PDSEGHX   - new\n       PDSEGHCG  - new Changes tutorial panel (thanks John K)\n       PDSEGH0   - updated for new names and add pdseghx\n       PDSEGH3   - updated for copy member pattern\n       PDSEGRM   - change from pad('_') to hilite(uscore)\n                   suggested by Tom Conley\n\n  Version 2.6   June 24, 2016\n     - Exec changes\n       PDSEGEN   - Several bug fixes\n       PDSEGENM  - Fix to the test for empty non-0 generations that\n                   have no stats\n\n  Version 2.5   June 24, 2016\n     - Exec changes\n       PDSEGEN   - add test for non-supported versions of z/OS\n                   thanks to Peter Giles\n                 - correct the compare so that when comparing\n                   both non-0 generations that it uses View instead\n                   of Edit\n                 - clear stats if ghost members stats are corrupt\n       PDSEGENC  - updated to run in batch\n       PDSEGENM  - remove save and update for ispf version and\n                   level since we have that info from PDSEGENI\n                   function\n                 - support if a ghost member is empty due to\n                   corruption during the Promote or Recover process\n     - Panel changes\n       all       - change header from Generations Member to\n                   Member Generations\n       PDSEGENP  - change panel colors\n       PDSEGENT  - add summary line to member list with info\n                   on PDSE library usage (thanks to John Kalinich)\n       PDSEGH0   - update to add promote and recover tutorials\n       PDSEGH7   - new promote and recover tutorial panel\n       PDSEGH8   - renamed from pdsegh7\n       PDSEGPH   - updated colors and add zup for pdsegh0\n       PDSEGP10  - added to document running PDSEGENC in batch\n     - Other changes\n       SAMPCOPY  - added sample PDSEGENC batch JCL\n\n\n  Version 2.0   June 21, 2016\n     - Major update to use Greg Price's update to the Xephon\n       PDSEINFO routine - renamed to PDSEGENI. This routine\n       extracts PDSE V2 member and generation information using\n       DESERV into REXX stem variables. This made the application\n       much faster and exposed ghost members.\n  Version 1.0   June 13, 2016\n     - first general release to selected testers\n  Version 0.1   May 26, 2016\n     - initial creation of this exec using information from Thomas\n       Reed's SHARE presentation\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}, "$INSTALL": {"ttr": 1288, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x12\\x00\\x00\\x01\\x16!\\x7f\\x01 \\x03?\\x11\\x02\\x00L\\x00\\x15\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.18", "flags": 0, "createdate": "2016-08-04T00:00:00", "modifydate": "2020-02-02T11:02:00", "lines": 76, "newlines": 21, "modlines": 0, "user": "PDSE"}, "text": "$INSTALL\n\n/* ---------------------------------------------- *\\\n * If you downloaded this from github then ignore *\n * the $RECV instructions.                        *\n * BUT you will need to do a TSO RECEIVE of the   *\n * LOAD.XMIT file which is the load library.      *\n\\* ---------------------------------------------- */\n\nTo install this tool run the $RECV member from the ISPF 3.4 Edit member\nlist (as that provides the ability to enter EXEC next to the member).\nThat will receive the individual members of this PDS that are in TSO\nTransmit format.\n\nOptional:  Run the ASMJCL member if you want to assemble and linkedit\nthe 3 load modules - you do not have to as the load modules are already\nin the provided load library.\n\nReview and/or update the PDSEGENS REXX Exec which contains some local\nsettings. These are the current settings. In PDSEGENS is a description\nof each and the supported options:\n\n     Variable     Value           Comments\n     higen       = 0               Set to 1 to always show higen entries\n     clean       = 0               Set to 1 if APAR OA50214 is installed\n     def_unit    = ''              Default unit for allocation for temp files\n     etime       = 0               Set to 1 to always  show elapsed time\n     mail        = 1               Set to 0 if XMITIP is not installed\n     prune       = 1               Set to 0 to disable prompting with prune\n                                  ** recommendation is leave it at 1\n     base_color  = 'green'         Change for a different unsorted column color\n     sort_color  = 'Turq'          Change for a different sort column color\n     tempmem     = 'Z$Z@Z9Z8'      Change for different temp member name\n     disp_change = 1               Set to 0 to not display the changes\n                                   tutorial when the version changes\n\nSuggestion: Install PDSEGMAT into LPA to improve its performance as it\nis used frequently for member pattern matching. This is only if PDSEGEN\nis heavily used. It is not a requirement.\n\nISPF Command Table Update\n\nUpdate the ISPF command table, this could be the ISPCMDS or your site\ncommand table, to add these (or variations) commands:\n\n     Verb     Trunc Action\n     PG       0     SELECT CMD(%PDSEGEN &ZPARM)\n     PDSEGEN  5     SELECT CMD(%PDSEGEN &ZPARM)\n\nUse the EXEC member PDSEGENX as an example of how to invoke this\napplication without copying the elements into existing libraries.  This\nwill use altlib and libdef. This exec can also be used to test the\npackage.\n\nIf you prefer to have the elements installed in a common set of\nlibraries then:\n\n   1. Copy the PDSEGEN.EXEC into your SYSEXEC common library\n   2. Copy the PDSEGEN.PANELS into your ISPF Panels common library\n   3. Copy the PDSEGEN.LOAD into your common steplib, linklist or\n      ISPLLIB library\n\nAlternate installation for (1) and (2) is to use the ZSYNC application\n(found in CBT file 314 or at www.lbdsoftware.com) to only copy the\nupdated EXEC and PANELS elements.\n\nCheck out the EXEC member PG which can be used if you do copy the\nelements into a common set of libraries. Or you can delete PG and\nrename PDSEGENX to PG for use.\n\nNOTE: do not start PDSEGEN in APPLID of PDSE as that will bypass the\n      creation of the ISPF command table environment for PDSEGEN.\n\nReview the sample JCL in the ISPF Panels PDSEGHBJ and PDSEGHC, which are\nthe sample JCL for Batch Backup and Copy respectively, and make\nappropriate changes for your installation.\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}, "$MODULES": {"ttr": 1291, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x04\\x00%\\x01\\x16!\\x8f\\x01\\x18\\x07\\x8f\\x10R\\x00?\\x000\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.04", "flags": 0, "createdate": "2016-08-05T00:00:00", "modifydate": "2018-03-19T10:52:25", "lines": 63, "newlines": 48, "modlines": 0, "user": "PDSE"}, "text": "Information on the load modules\n\nPDSEGDEL\n\nThis is a REXX function that uses the STOW DG (delete generation)\ninterface to delete individual members and individual generations\nin a member generation enabled PDSE Library.\n\nUsage is rc = pdsegdel(member,generation,ddname)\n\nWhere:     member is the member name to be deleted\n\n           generation is the absolute generation to be deleted\n           or zero to delete the member and all generations\n\n           ddname is the pre-allocated DD of the PDSE Library\n\nThe return code is 0 for success or 4 if not.\n\nPDSEGENI\n\nThis is a REXX function that will return in the stem member.\ninformation on all members in the PDS or PDSE Library, including\ngeneration information. It should not be used on a load library as\nit is not designed for them.\n\nUsage is:  rc = pdsegeni(ddname)\n\nWhere the ddname is preallocated to the desired library.\n\nThe returned member.0 stem contains the number of members returned.\nThis includes both members and generations.\n\nThe format of the member.x stem is:\n\n     Field    start length\n     ID       0     4   PDSE\n     Member   5     8\n     absgen   14    6\n     vrm      22    6\n     cdate    35    7   yyyyddd\n     aliasflg 43    1   Y or N\n     ttr      46    3\n     mdate    49    7   yyyyddd\n     mtime    56    7   0hhmmss\n     userid   63    8\n     mod      72    2   hex\n     cur size 75    5\n     init size 79   4\n     dummy flg 83   1   'D' for dummy generation\n\nPDSEGMAT\n\nThis routine is used for pattern matching and supports:\n\n   * - any number of any characters\n   % - any single character\n\nUsage:\n\n    rc = pdsegmat(member,pattern)\n\n    rc = 1 if ok, 0 if not\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}, "$MONITOR": {"ttr": 1293, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x00\\x00G\\x01\\x190_\\x01\\x190_\\x065\\x00\\x0b\\x00\\x0b\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.00", "flags": 0, "createdate": "2019-11-01T00:00:00", "modifydate": "2019-11-01T06:35:47", "lines": 11, "newlines": 11, "modlines": 0, "user": "PDSE"}, "text": "IBM has released a PDSE Monitor capability that is documented in\nthis url (created by tinyurl.com) https://tinyurl.com/y4lfwhry\n\nFrom the document:\n\nThe PDSE monitor proactively detect PDSE resource exception issues.\nSuch exception issues can include processing hangs, latch and lock\ncontention, and XCF communications issues. The monitor runs as a TCB\nin the SMSPDSE or SMSPDSE1 address space. The monitor task executes\nt predefined intervals and it reports on PDSE resources that are held\nor longer than a predefined duration.\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}, "$RECV": {"ttr": 1537, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01D\\x00\"\\x01\\x16 /\\x01\\x190_\\x066\\x00\\x96\\x00l\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.68", "flags": 0, "createdate": "2016-07-20T00:00:00", "modifydate": "2019-11-01T06:36:22", "lines": 150, "newlines": 108, "modlines": 0, "user": "PDSE"}, "text": "/* this rexx exec is expected to be invoked by the EXEC command\n   thus:\n\n   EXec 'dsname($RECV)'\n\n   Prompting will occur for hlq and optional volser.\n\n   and it will then issue the TSO RECEIVE command for the\n   the following members to create these new data sets:\n\n   Member       Dataset\n   ASM          hlq.ASM\n   EXEC         hlq.EXEC\n   LOAD         hlq.LOAD\n   PANELS       hlq.PANELS\n   SAMPLE       hlq.SAMPLE.PDS\n\n   You will then need to copy these datasets/members into\n   datasets for production use.\n\n   During this process the PDSGENX will be updated with the\n   hlq for the received datasets so it can be used for testing.\n\n   After these data sets are created several of the members\n   of this install data set will be browsed.\n   */\n\n  parse source x1 x2 x3 x4 dsn .\n  x = PROMPT(\"ON\") /* enable prompting */\n\n /* ----------------------------------------- *\n * Load and execute the CLS routine to clear *\n * the screen so the prompts are on the top  *\n * of the screen and easy to see.            *\n * ----------------------------------------- */\n  \"Loadgo '\"dsn\"(cls)' noterm\"\n\n  say \"Enter desired hlq for target data sets\",\n    \"(default is\" sysvar(\"syspref\")\".PDSEGEN.NEW):\"\n  pull hlq\n  hlq = strip(hlq)\n\n  if hlq = \"\" then hlq = sysvar(\"syspref\")\".PDSEGEN.NEW\"\n  hlq = translate(hlq)\n\n  say \"Enter optional volser for target data sets\",\n    \"default is to allow standard allocation to\",\n    \"find a volume.\"\n  pull volser\n  volser = strip(volser)\n\n  say \"Enter optional SYSOUT class for RECEIVE messages,\" ,\n      \"a null SYSOUT class is recommended.\"\n  pull sysout\n  sysout = strip(sysout)\n  if sysout <> \"\" then sys = \"sysout(\"sysout\")\"\n  else sys = \"\"\n\n  if volser <> \"\" then vol = \"vol(\"volser\")\"\n  else vol = \"\"\n\n  Say \"Using HLQ:\" hlq\n  if vol <> \"\" then\n  Say \"Using Volser:\" volser\n\n/* ----------------------------------------------- *\n * Check for an ISPF environment and then check to *\n * see if the receive target datasets exist. If so *\n * then compress  them before the receive.         *\n * ----------------------------------------------- */\n  if sysvar('sysispf') = \"ACTIVE\" then do\n    Address ISPEXEC\n    call do_comp   \"'\"hlq\".asm'\"\n    call do_comp   \"'\"hlq\".exec'\"\n    call do_comp   \"'\"hlq\".load'\"\n    call do_comp   \"'\"hlq\".panels'\"\n    Address TSO\n  end\n\n/* ------------------------------------------------------------ *\n * Process the TSO RECEIVE command on all the pertinent members *\n * ------------------------------------------------------------ */\n  queue \"dsn('\"hlq\".asm')\" vol sys\n  \"Receive inds('\"dsn\"(asm)')\"\n  queue \"dsn('\"hlq\".exec')\" vol sys\n  \"Receive inds('\"dsn\"(exec)')\"\n  queue \"dsn('\"hlq\".load')\" vol sys\n  \"Receive inds('\"dsn\"(load)')\"\n  queue \"dsn('\"hlq\".panels')\" vol sys\n  \"Receive inds('\"dsn\"(panels)')\"\n  queue \"dsn('\"hlq\".sample.pds')\" vol sys\n  \"Receive inds('\"dsn\"(sample)')\"\n\n/* ----------------------------------------------------- *\n | Altlib to this PDS and invoke the fixpdseg edit macro |\n | to highlight the customization available in PDSEGEN   |\n |                                                       |\n | Invoke fixpdseg edit macro to update the assembler    |\n | JCL for the received datasets                         |\n * ----------------------------------------------------- */\n  \"altlib activate dataset('\"dsn\"') application(exec)\"\n  Address ISPExec\n  \"Edit Dataset('\"hlq\".exec(\"pdsegenx\")') macro(fixpdseg)\" ,\n    'parm(hlq)'\n  \"Edit Dataset('\"dsn\"(\"asmjcl\")') macro(fixpdseg)\",\n    'parm(hlq)'\n  Address TSO\n  'altlib deactivate application(exec)'\n\n/* -------------------------------------------- *\n * If ISPF is active show key members in Browse *\n * -------------------------------------------- */\n  if sysvar('sysispf') <> \"ACTIVE\" then exit\n  Address ISPEXEC\n  say 'Do you want to browse important documenation members' ,\n    '- Y or N?'\n  pull reply\n  if left(reply,1) = 'Y' then do\n    \"Browse dataset('\"dsn\"($changes)')\"\n    \"Browse dataset('\"dsn\"($install)')\"\n    \"Browse dataset('\"dsn\"($$$doc)')\"\n    \"Browse dataset('\"dsn\"($monitor)')\"\n    \"Browse dataset('\"dsn\"(@backup)')\"\n    \"Browse dataset('\"dsn\"(support)')\"\n    \"Browse dataset('\"dsn\"(license)')\"\n  end\n  \"Edit dataset('\"hlq\".exec(pdsegens)')\"\n\n/* ------------------------------------------------- *\n * Now display a list of the received datasets using *\n * ISPF LMM services (ISPF 3.4)                      *\n * ------------------------------------------------- */\n  Address ISPExec\n  if vol <> \"\" then lmvol = \"VOLUME(\"vol\")\"\n  else lmvol = \"\"\n  \"LMDINIT LISTID(LISTID) LEVEL(\"hlq\")\" lmvol\n  \"LMDDISP LISTID(\"ListId\") Confirm(Yes)\",\n    \"View(Volume)\"\n  \"LMDFREE LISTID(\"ListId\")\"\n\n  Exit\n\nDo_Comp: procedure\n  arg compdsn\n  if sysdsn(compdsn) /= 'OK' then return\n  say \"Compressing:\"  compdsn\n  \"LMInit dataid(compress) enq(exclu) dataset(\"compdsn\")\"\n  \"LMComp Dataid(\"compress\")\"\n  \"LMFree Dataid(\"compress\")\"\n  return\n", "mimetype": "text/plain", "datatype": "ebcdic", "extension": ".txt"}, "$UNDOC": {"ttr": 1541, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x07\\x00(\\x01\\x17\\x00o\\x01 \\x02o\\x08\"\\x00\\x10\\x00\\x0c\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.07", "flags": 0, "createdate": "2017-01-06T00:00:00", "modifydate": "2020-01-26T08:22:28", "lines": 16, "newlines": 12, "modlines": 0, "user": "PDSE"}, "text": "There are some undocumented primary and line commands:\n\nPrimary Commands:\n\nACHmed - used to allow the display in the member list of dummy members\n       - the absolute generation for these dummy members is the high\n         water mark of absolute generations for that member and where\n         the generation count will resume if/when the member is\n         recreated.\n       - Entering Achmed ? will bring up a short tutorial about Achmed\n       - Aliases are Casper and Zombie\n\nLine Commands:\n\nW      - Allows editing generations directly as PDSEGEN\n         automatically converts an Edit to View\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}, "@ASMCLS": {"ttr": 1543, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x03\\x00\\x12\\x01\\x16$O\\x01\\x176?\\x134\\x00&\\x00\\t\\x00&\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.03", "flags": 0, "createdate": "2016-08-31T00:00:00", "modifydate": "2017-12-29T13:34:12", "lines": 38, "newlines": 9, "modlines": 38, "user": "PDSE"}, "text": "//ASMCLS   JOB ...\n//ASM      PROC MEMBER=CLS\n//             INSTLIB='HLQ.ASM',\n//             ARENT='RENT',LRENT='RENT,REUS'\n//*     PRIOR RECORD IS THE INSTALLATION SOURCE LIBARRY\n//ASM      EXEC PGM=ASMA90,REGION=32M,\n//             PARM=(NORLD,&ARENT,TERM,'XREF(SHORT),SIZE(MAX,ABOVE)')\n//SYSUT1    DD UNIT=VIO,SPACE=(4096,(120,1200),,,ROUND),DCB=BUFNO=1\n//SYSLIN    DD UNIT=VIO,SPACE=(TRK,(5,5)),DISP=(NEW,PASS),\n//             DCB=BLKSIZE=3120\n//SYSPRINT  DD SYSOUT=*\n//SYSTERM   DD SYSOUT=*\n//SYSLIB    DD DSN=SYS1.MODGEN,DISP=SHR\n//          DD DSN=SYS1.MACLIB,DISP=SHR\n//          DD DSN=&INSTLIB,DISP=SHR\n//LKED     EXEC PGM=IEWL,COND=(4,LT),REGION=32M,\n//             PARM='MAP,&LRENT,NCAL'\n//SYSPRINT  DD SYSOUT=*\n//SYSLIN    DD DSN=*.ASM.SYSLIN,DISP=(OLD,DELETE)\n//SYSLMOD   DD DISP=SHR,\n//             DSN=HLQ.LOAD(&MEMBER)\n//*     PRIOR RECORD IS THE LINKEDIT TARGET LOAD LIBRARY\n//SYSUT1    DD UNIT=VIO,SPACE=(1024,(120,120),,,ROUND),\n//             DCB=BUFNO=1\n//         PEND\n//*\n//ASMCLS   EXEC ASM\n//SYSIN     DD *\n*---------------------------------------------------------------------*\n*        TSO \"CLEAR SCREEN\" COMMAND                                   *\n*---------------------------------------------------------------------*\nCLEARSCR CSECT\nCLEARSCR RMODE ANY\n         STLINENO LINE=1,CLEAR=YES     TOP OF SCREEN\n         BR    14                      GOBACK\n         DC    C'GSF UTILITIES - CLS R300'\n         END\n/*\n", "mimetype": "text/plain", "datatype": "ebcdic", "extension": ".txt"}, "@BACKUP": {"ttr": 1545, "alias": false, "halfwords": 30, "notes": 0, "parms": "b\"\\x01\\x0c\\x00\\x11\\x01\\x16\\x19\\x7f\\x01\\x17'\\x0f\\x14\\x14\\x00w\\x00<\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@\"", "ispf": {"version": "01.12", "flags": 0, "createdate": "2016-07-15T00:00:00", "modifydate": "2017-09-27T14:14:11", "lines": 119, "newlines": 60, "modlines": 0, "user": "PDSE"}, "text": "PDSEGBAK and PDSEGRST are rexx utilities that utilizes the PDSEGENI REXX\nfunction and ISPF services to make a complete backup of a PDSE V2 that\nhas members with generations, and then provides the ability to restore\nthat backup.\n\nNOTE 1: If the backup PDS does not have generations enabled then an\n        error message will be generated as this is not the best utility\n        to process datasets without member generations defined.\n\nNOTE 2: The target PDS for both backup and restore must NOT exist as\n        it will be dynamically allocated as needed.\n\nNOTE 3: There are times when PDSEGBAK will fail in batch. This occurs\n        for some generations, not for base members, and is an issue\n        where ISPF in batch encounters some issue that I haven't figured\n        out yet. The solution is to delete the offending generation and\n        then the backup should proceed to the next offending generation\n        or to successful completion. I can't recreate at will and\n        haven't seen anything in the ispfvcall traces.\n\nBackup will create a new PDS based on the space allocations and DCB\nfor the source PDSE. It will then copy all the members with their\ngenerations into a backup PDS. The backup PDS can then be processed\nby any existing utility that can process a PDS without fear of\nhaving the member generations lost.\n\nThree special members in the backup PDS are $ALLOC and $INDEX.\n\n   $ALLOC contains the maxgen specification of the original PDSE so\n   that the PDSE can be recreated during the restoration process.\n\n   $BACKUP contains the backup report generated during the backup\n   process.\n\n   $INDEX contains a list of all members with their backup member\n   names. This is used during the restoration process. The members\n   are created in the correct sequence so that after restoration the\n   base member will be the correct base member and the relative\n   generations will be their original relative generation. The\n   absolute generation number will be lost but the key is to use is\n   the relative generation (right?).\n\nThe member names within the backup PDS are special members that\nretain all the ISPF statistics of the original PDSE.\n\nRestore (using either PDSEGBAK or PDSEGRST) will read in the $ALLOC\nmember to pick up the MAXGEN specification so that it can allocate a new\nPDSE with that MAXGEN value. It will then read in the $INDEX member and\nuse ISPF LMCOPY to copy each backup member into the restore target PDSE\nin sequence in order to retain the correct relative generation sequence.\n\nBefore the target dataset is allocated the $ALLOC MAXGEN value is\ncompared to the system MAXGENS_LIMIT value. If the system value is\ngreater than the $ALLOC value then a warning message is issued and\nthe target dataset is allocated using the system limit. NOTE: This\ncould result in lost generations.\n\nPDSEGBAK can be run without options under ISPF and will display a\nprompting ISPF Panel to assist with performing the backup or restore.\nIt can also be run in batch using the TMP with all the appropriate\nISPF allocations (see member SAMPBR for sample JCL for this).\n\nThe command syntax to run outside of the dialog is:\n\n Syntax:    %pdsegbak input output option1 option2\n\n            input  is either the pdse with member/gens\n                   or the backup pds\n            output is the target dataset for backup or\n                   restore.  this dataset will be\n                   allocated based on the input dataset\n            option1 is:  backup or restore\n            option2 is:  batch or null\n\n            If no parameters, or just a input parm, and running\n            under ISPF in the foreground then display a prompting\n            panel\n\n            If option2 is batch then the backup/restore report\n            will be written to the terminal for online scripting\n            instead of opened in ispf browse.\n\nPDSEGRST is a improved restore utility that provides the ability to\nrestore to an existing, or new, PDSE. It also allows for member and/or\ngeneration selection during the restore.\n\nSyntax:    %pdsegrst backup-dsn target-dsn mbr gen / NEW\n\n           backup-dsn   PDSEGEN Backup PDS\n           target-dsn   PDS/PDSE to restore to\n                        ** must exist **\n           mbr          Member name or member pattern\n           gen          Absolute or Relative Gen to\n                        restore\n\n           / NEW        allocate the target PDSE\n\n           mbr is optional - default is all\n           gen is optional - default is all generations\n           / NEW is optional and may be any non-blank char\n\nUsage Notes:\n          1. If restoring to a PDS or PDSE without\n             generations then only the base (gen 0)\n             will be restored.\n          2. If gen is not specified then all generations\n             will be restored starting with the oldest to\n             the newest. This retains the relative\n             generations number.\n          3. The absolute generation number cannot be\n             retained on restoration.\n          4. If the member already exists in the target\n             then the existing member/generations will\n             be pushed up the relative generation range\n             until they roll out.\n          5. If the option / NEW is specified then the\n             target PDSE will be allocated using the DCB\n             and space of the backup PDS/PDSE and using\n             the MAXGEN found in the Backup $ALLOC member\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}, "@FILE969": {"ttr": 1548, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x05\\x00\\x008\\x01 5\\x1f\\x01 5\\x1f\\x16I\\x00q\\x00q\\x00\\x00\\xc3\\xc2\\xe3`\\xf5\\xf0\\xf0@@@'", "ispf": {"version": "05.00", "flags": 0, "createdate": "2020-12-16T00:00:00", "modifydate": "2020-12-16T16:49:38", "lines": 113, "newlines": 113, "modlines": 0, "user": "CBT-500"}, "text": "//***FILE 969 is from Lionel Dyck in Austin, Texas and contains     *   FILE 969\n//*           the PDSEGEN ISPF application.                         *   FILE 969\n//*                                                                 *   FILE 969\n//*           website: http://www.lbdsoftware.com                   *   FILE 969\n//*           email:  lbdyck@gmail.com                              *   FILE 969\n//*                                                                 *   FILE 969\n//*    Lionel Dyck's large collection of utilities has now been     *   FILE 969\n//*    divided between Files 312, 313, 314, and 969.  All member    *   FILE 969\n//*    names beginning with A-R are on File 312.  Names beginning   *   FILE 969\n//*    with S-TS are on File 313.  Names from TX-Z are on File      *   FILE 969\n//*    314.  File 969 contains the PDSEGEN ISPF application to      *   FILE 969\n//*    exploit the capabilities of using PDSE Version 2 member      *   FILE 969\n//*    generations.                                                 *   FILE 969\n//*                                                                 *   FILE 969\n//*    These four files contain quite a few separate utility        *   FILE 969\n//*    packages which are unrelated to each other.  You can tell    *   FILE 969\n//*    which members of these files belong to the same utility      *   FILE 969\n//*    package, by the similarities in their member names.          *   FILE 969\n//*                                                                 *   FILE 969\n//*       NAME       VER.MOD   LAST MODIFIED     SIZE   ID          *   FILE 969\n//*       $$$#DATE    05.00   2020/12/16 16:49     12 CBT-500       *   FILE 969\n//*       $$$DOC      01.27   2020/01/31 12:02    429 PDSE          *   FILE 969\n//*       $CHANGES    04.64   2020/12/14 06:25   1711 PDSE          *   FILE 969\n//*       $INSTALL    01.12   2020/02/02 11:02     76 PDSE          *   FILE 969\n//*       $MODULES    01.04   2018/03/19 10:52     63 PDSE          *   FILE 969\n//*       $MONITOR    01.00   2019/11/01 06:35     11 PDSE          *   FILE 969\n//*       $RECV       01.44   2019/11/01 06:36    150 PDSE          *   FILE 969\n//*       $UNDOC      01.07   2020/01/26 08:22     16 PDSE          *   FILE 969\n//*       @ASMCLS     01.00   2020/03/09 12:35     38 PDSE          *   FILE 969\n//*       @BACKUP     01.00   2020/03/09 12:35    119 PDSE          *   FILE 969\n//*       @FILE969    05.89   2020/09/18 08:44    112 CBT           *   FILE 969\n//*       ASM         01.00   2020/12/14 06:20   1504 XMIT          *   FILE 969\n//*       ASMJCL      01.00   2020/09/26 10:16     30 PDSE          *   FILE 969\n//*       CLS         01.03   2016/09/01 07:05      2 PDSE          *   FILE 969\n//*       EXEC        01.00   2020/12/14 06:20  11820 XMIT          *   FILE 969\n//*       FIXPDSEG    01.02   2018/04/24 09:27     25 PDSE          *   FILE 969\n//*       LICENSE     01.00   2016/06/10 13:52    674 PDSE          *   FILE 969\n//*       LOAD        01.00   2020/12/14 06:20    234 XMIT          *   FILE 969\n//*       PANELS      01.00   2020/12/14 06:20   7636 XMIT          *   FILE 969\n//*       PDSEGEN     04.60   2017/12/14 11:24  18975 PDSE          *   FILE 969\n//*       PDSEGQW     01.08   2018/03/21 06:08    414 PDSE          *   FILE 969\n//*       PDSEPDF     01.03   2019/07/22 12:46  28543 PDF           *   FILE 969\n//*       PDSEREFC    01.02   2019/06/25 14:15   2403 PDF           *   FILE 969\n//*       QWLOAD      01.00   2018/03/20 13:15     22 PDSE          *   FILE 969\n//*       SAMPBR      01.09   2017/09/27 14:09     50 PDSE          *   FILE 969\n//*       SAMPCOPY    01.00   2016/10/27 13:30     48 PDSE          *   FILE 969\n//*       SAMPLE      01.00   2020/12/14 06:20    668 XMIT          *   FILE 969\n//*       SUPPORT     01.02   2017/07/17 14:05     10 PDSE          *   FILE 969\n//*       WISHLIST    01.00   2018/03/26 14:16     12 PDSE          *   FILE 969\n//*                                                                 *   FILE 969\n//*                                                                 *   FILE 969\n//*  Member $DOC - basic information                                *   FILE 969\n//*                                                                 *   FILE 969\n//*  Member PDSEGEN - PDSE V2 Member Generation dialog              *   FILE 969\n//*         Updated 12/14/2020 - Version 5.8.5                      *   FILE 969\n//*                                                                 *   FILE 969\n//*     The PDSEGEN ISPF Dialog found in this package will          *   FILE 969\n//*     present the user with a list of all members of their        *   FILE 969\n//*     PDSE, including all generations.  There are several         *   FILE 969\n//*     commands and many line selection options available,         *   FILE 969\n//*     including Browse, Edit, View, Compare, Delete, Promote,     *   FILE 969\n//*     and Recover.  The list of members will be updated           *   FILE 969\n//*     appropriately as members are edited, added, deleted,        *   FILE 969\n//*     recovered, or promoted. Full member filtering using         *   FILE 969\n//*     * and % is available as are date filters.                   *   FILE 969\n//*                                                                 *   FILE 969\n//*     Now with action bars (optional).                            *   FILE 969\n//*                                                                 *   FILE 969\n//*     Other capabilities include the ability to Backup your       *   FILE 969\n//*     PDSE, with ALL generations, to a standard PDS so that       *   FILE 969\n//*     it can be transported/copied by other utilities. Then       *   FILE 969\n//*     there is the Restore capability to rebuild the PDSE with    *   FILE 969\n//*     all generations.                                            *   FILE 969\n//*                                                                 *   FILE 969\n//*     The Copy command will copy a PDS into a PDSE with           *   FILE 969\n//*     generations enabled or copy a PDSE with members and         *   FILE 969\n//*     generations to another PDSE without the loss of any         *   FILE 969\n//*     generations.                                                *   FILE 969\n//*                                                                 *   FILE 969\n//*     The PRUNE function will let you remove older (or all)       *   FILE 969\n//*     generations that the user considers obsolete. Or            *   FILE 969\n//*     completely empty the PDSE of all members and generations.   *   FILE 969\n//*     PRUNE can be limited using FILTERs.                         *   FILE 969\n//*                                                                 *   FILE 969\n//*     The Validate command will invoke the IBM IEBPDSE utility    *   FILE 969\n//*     which will validate the integrity of the PDSE and, if       *   FILE 969\n//*     the correct PTF is installed clean up pending delete        *   FILE 969\n//*     members/generations.                                        *   FILE 969\n//*                                                                 *   FILE 969\n//*     NOTES: This application requires z/OS 2.1 or newer to       *   FILE 969\n//*           support access via ISPF to generations and does       *   FILE 969\n//*           NOT support load libraries or aliases at this         *   FILE 969\n//*           time.                                                 *   FILE 969\n//*                                                                 *   FILE 969\n//*           PDS/PDSE's are supported with up to approx 22,000     *   FILE 969\n//*           members. The more members, the slower the opening     *   FILE 969\n//*           process.                                              *   FILE 969\n//*                                                                 *   FILE 969\n//*           Full documentation is included in DOCX amd PDF in     *   FILE 969\n//*           this file (see the member ID for them) and the        *   FILE 969\n//*           EPUB and MOBI versions can be found at these urls:    *   FILE 969\n//*                                                                 *   FILE 969\n//*           EPUB foramt: http://tinyurl.com/ybl3un5z              *   FILE 969\n//*           MOBI format: http://tinyurl.com/y9dck3dy              *   FILE 969\n//*           PDF format:  https://tinyurl.com/y725a2qj             *   FILE 969\n//*                                                                 *   FILE 969\n//*           A reference card in PDF format can be found at:       *   FILE 969\n//*           https://tinyurl.com/y9tbgpdw                          *   FILE 969\n//* --------------------------------------------------------------- *   FILE 969\n//*     Lionel B. Dyck                                              *   FILE 969\n//*     email:   lbdyck@gmail.com                                   *   FILE 969\n//*     website: www.lbdsoftware.com                                *   FILE 969\n//* --------------------------------------------------------------- *   FILE 969\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}, "ASM": {"ttr": 1551, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x00\\x00\\x16\\x01 4\\x9f\\x01 4\\x9f\\x06 \\x05\\xe0\\x05\\xe0\\x00\\x00\\xe7\\xd4\\xc9\\xe3@@@@@@'", "ispf": {"version": "01.00", "flags": 0, "createdate": "2020-12-14T00:00:00", "modifydate": "2020-12-14T06:20:16", "lines": 1504, "newlines": 1504, "modlines": 0, "user": "XMIT"}, "mimetype": "application/xmit", "datatype": "binary", "extension": ".xmi"}, "ASMJCL": {"ttr": 2308, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x0b\\x00H\\x01\\x16 /\\x01\\x19\"\\x7f\\x133\\x00\\x1e\\x00\\x1b\\x00\\x1e\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.11", "flags": 0, "createdate": "2016-07-20T00:00:00", "modifydate": "2019-08-15T13:33:48", "lines": 30, "newlines": 27, "modlines": 30, "user": "PDSE"}, "text": "//ASMJCL   JOB .\n//PDSGEN   PROC MEMBER=MISSING,\n//             INSTLIB='T311LBD.PDSEGEN.ASM',\n//             LOADLIB='T311LBD.PDSEGEN.LOAD',\n//             ARENT='RENT',LRENT='RENT,REUS'\n//ASM      EXEC PGM=ASMA90,REGION=32M,\n//             PARM=(NORLD,&ARENT,TERM,'XREF(SHORT),SIZE(MAX,ABOVE)')\n//SYSUT1    DD UNIT=VIO,SPACE=(4096,(120,1200),,,ROUND),DCB=BUFNO=1\n//SYSLIN    DD UNIT=VIO,SPACE=(TRK,(5,5)),DISP=(NEW,PASS),\n//             DCB=BLKSIZE=3120\n//SYSPRINT  DD SYSOUT=*\n//SYSTERM   DD SYSOUT=*\n//SYSIN     DD DISP=SHR,DSN=&INSTLIB.(&MEMBER)\n//SYSLIB    DD DSN=SYS1.MODGEN,DISP=SHR\n//          DD DSN=SYS1.MACLIB,DISP=SHR\n//          DD DSN=&INSTLIB,DISP=SHR\n//LKED     EXEC PGM=IEWL,COND=(4,LT),REGION=32M,\n//             PARM='MAP,&LRENT,NCAL'\n//SYSPRINT  DD SYSOUT=*\n//SYSLIN    DD DSN=*.ASM.SYSLIN,DISP=(OLD,DELETE)\n//SYSLMOD   DD DISP=SHR,\n//             DSN=&LOADLIB(&MEMBER)\n//SYSUT1    DD UNIT=VIO,SPACE=(1024,(120,120),,,ROUND),\n//             DCB=BUFNO=1\n//         PEND\n//*\n//PDSEGENI EXEC PDSGEN,MEMBER=PDSEGENI\n//PDSEGDEL EXEC PDSGEN,MEMBER=PDSEGDEL\n//PDSEGMAT EXEC PDSGEN,MEMBER=PDSEGMAT\n//*\n", "mimetype": "text/plain", "datatype": "iso-8859-1", "extension": ".txt"}, "CLS": {"ttr": 2310, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x03\\x00\\x00\\x01\\x16$O\\x01\\x16$_\\x07\\x05\\x00\\x02\\x00\\t\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.03", "flags": 0, "createdate": "2016-08-31T00:00:00", "modifydate": "2016-09-01T07:05:00", "lines": 2, "newlines": 9, "modlines": 0, "user": "PDSE"}, "mimetype": "application/octet-stream", "datatype": "binary", "extension": ".bin"}, "EXEC": {"ttr": 2312, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x00\\x00\\x16\\x01 4\\x9f\\x01 4\\x9f\\x06 .,.,\\x00\\x00\\xe7\\xd4\\xc9\\xe3@@@@@@'", "ispf": {"version": "01.00", "flags": 0, "createdate": "2020-12-14T00:00:00", "modifydate": "2020-12-14T06:20:16", "lines": 11820, "newlines": 11820, "modlines": 0, "user": "XMIT"}, "mimetype": "application/xmit", "datatype": "binary", "extension": ".xmi"}, "FIXPDSEG": {"ttr": 7171, "alias": false, "halfwords": 30, "notes": 0, "parms": "b\"\\x01\\x02\\x00!\\x01\\x17\\x03O\\x01\\x18\\x11O\\t'\\x00\\x19\\x00\\x19\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@\"", "ispf": {"version": "01.02", "flags": 0, "createdate": "2017-02-03T00:00:00", "modifydate": "2018-04-24T09:27:21", "lines": 25, "newlines": 25, "modlines": 0, "user": "PDSE"}, "text": "/* --------------------  rexx procedure  -------------------- *\n | Name:      fixpdseg                                        |\n |                                                            |\n | Function:  ISPF Edit Macro to update the pdsegen           |\n |            elements                                        |\n |                                                            |\n | Usage Notes: called by the $RECV process out of the        |\n |              distribution pds                              |\n |                                                            |\n | Dependencies:                                              |\n |                                                            |\n | Author:    Lionel B. Dyck                                  |\n |                                                            |\n | History:  (most recent on top)                             |\n |            02/03/17 - Creation                             |\n |                                                            |\n * ---------------------------------------------------------- */\n Address ISREdit\n 'Macro (hlq)'\n '(member) = member'\n  if wordpos(member,'ASMJCL PDSEGENX') > 0 then do\n     \"c 'hlq.' '\"hlq\"' all\"\n     'save'\n     'end'\n     end\n", "mimetype": "text/plain", "datatype": "ebcdic", "extension": ".txt"}, "LICENSE": {"ttr": 7173, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x00\\x00\\x15\\x01\\x16\\x16/\\x01\\x16\\x16/\\x13R\\x02\\xa2\\x02\\xa2\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.00", "flags": 0, "createdate": "2016-06-10T00:00:00", "modifydate": "2016-06-10T13:52:15", "lines": 674, "newlines": 674, "modlines": 0, "user": "PDSE"}, "text": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<http://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<http://www.gnu.org/philosophy/why-not-lgpl.html>.\n", "mimetype": "text/plain", "datatype": "ebcdic", "extension": ".txt"}, "LOAD": {"ttr": 7429, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x00\\x00\\x16\\x01 4\\x9f\\x01 4\\x9f\\x06 \\x00\\xea\\x00\\xea\\x00\\x00\\xe7\\xd4\\xc9\\xe3@@@@@@'", "ispf": {"version": "01.00", "flags": 0, "createdate": "2020-12-14T00:00:00", "modifydate": "2020-12-14T06:20:16", "lines": 234, "newlines": 234, "modlines": 0, "user": "XMIT"}, "mimetype": "application/xmit", "datatype": "binary", "extension": ".xmi"}, "PANELS": {"ttr": 7434, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x00\\x00\\x16\\x01 4\\x9f\\x01 4\\x9f\\x06 \\x1d\\xd4\\x1d\\xd4\\x00\\x00\\xe7\\xd4\\xc9\\xe3@@@@@@'", "ispf": {"version": "01.00", "flags": 0, "createdate": "2020-12-14T00:00:00", "modifydate": "2020-12-14T06:20:16", "lines": 7636, "newlines": 7636, "modlines": 0, "user": "XMIT"}, "mimetype": "application/xmit", "datatype": "binary", "extension": ".xmi"}, "PDSEGEN": {"ttr": 10753, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x04<\\x000\\x01\\x161\\x1f\\x01\\x174\\x8f\\x11$J\\x1f7\\x8b\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "04.60", "flags": 0, "createdate": "2016-11-06T00:00:00", "modifydate": "2017-12-14T11:24:30", "lines": 18975, "newlines": 14219, "modlines": 0, "user": "PDSE"}, "mimetype": "application/xmit", "datatype": "binary", "extension": ".xmi"}, "PDSEGQW": {"ttr": 18436, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x08\\x002\\x01\\x18\\x07\\x9f\\x01\\x18\\x08\\x0f\\x06\\x08\\x01\\x9e\\x01,\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.08", "flags": 0, "createdate": "2018-03-20T00:00:00", "modifydate": "2018-03-21T06:08:32", "lines": 414, "newlines": 300, "modlines": 0, "user": "PDSE"}, "text": "K** This is an attempt to create a MVS/QuickRef entry for\nK** PDSEGEN - still in very early alpha\nK**\nKCAD C=PDSEGEN D='PDSEGEN ISPF Dialog'\nKCAP V='CBTTAPE.ORG' P=PDSEGEN R=* C=PDSEGEN\nKCPY V='CBTTAPE.ORG' C=NO\nK V='CBTTAPE.ORG' P=PDSEGEN R='*' I=INTRO\n The PDSEGEN ISPF Dialog will present the user with a list of all members\n of their PDSE, including all generations.  There are many commands\n including Copy and Compare, and many line selection options available,\n including Browse, Edit, View, Compare, Delete, J (submit), Promote,\n Rename and Recover.  The list of members will be updated appropriately\n as members are edited, added, deleted, recovered, or promoted. This\n application will also work with non generation enabled PDSE's and PDS's.\n\n Why use, or consider, PDSEGEN:\n\n    1. To see the generations easily\n    2. To be able to compare current generation to prior generations to\n       see what changed (broke)\n    3. To easily recover a prior generation using recover to a new member\n       or promote to replace the current base member\n    4. To easily clean up obsolete, no longer needed, generations (prune)\n    5. To safely copy the base member and all generations\n    6. To easily backup and restore without loss of generations\n    7. Protection from accidentally editing a non-0 generation\n    8. Easily search members and generations\n    9. Easy access to up to 15 datasets\n    10. Info on which generation is being browsed/edited/viewed\n    11. All the above and more\nK V='CBTTAPE.ORG' P=PDSEGEN R='*' I=USAGE\n Entry to the dialog is via the PDSEGEN exec. If called with no parameters\n then a prompting panel is displayed.\n\n     Syntax is:\n     ISPF Command Line: TSO %PDSEGEN dsname filter set\n  or\n     ISPF Command Line: PG dsname filter set\n  or\n     ISPF Option 6: %PDSEGEN dsname filter set\n\n     Where dsname is the dataset name for a PDSE with generations.\n\n     If dsname is * then a display of the last 15 referenced datasets\n     will be presented to select from.\n\n     If dsname is ? then the ISPF tutorial will be presented.\n\n     The dsname may also contain a filter - 'sys1.parmlib(ieasys*)'\n\n     Where filter is any valid filter.\n\n        Filter are:  ABC*, ABC: ,ABC, ABC/, /ABC, or ABC\n                     TODAY, WEEK, MONTH, YEAR, SINCE YY/MM/DD, SINCE -nn\n\n        The date filters are toggles.\n\n     Where SET is SET=x where x is B, E, V, or / to define the\n     default select. This over-rides anything the user may have\n     set in the entry panel or using the SET command and is\n     saved in the ISPF profile.\n\n PDSEGEN may also be entered on a DSLIST or ISPF 3.4 dataset list in\n the command field with a / to indicate to use the dataset on that row\n as the PDSE to work with.\n\nK V='CBTTAPE.ORG' P=PDSEGEN R='*' I=COMMANDS\n Within the application there are commands available on the ISPF Command\n line and Line selection commands for each member. See the ISPF Tutorial\n for all commands and options available.\n\n Command line options are:\n\n        Backup                    to invoke the Backup dialog\n        Browse                    to browse a member or members from the\n                                  command line: B member or B *, or B A%\n        C                         to change to a previous dsn using *\n                                  to change to the copy target dsn using >\n                                  to display a selection list of previous\n                                  dsns using ?\n                                  to jump directly to a dsn use #\n        Compare member from to    to Compare the 2 generations\n                                  e.g. Compare ABC -4 -1\n                                  if no member specified then a\n                                  prompting panel will popup\n        Copy                      Copy from current PDSE to new or existing\n                                  PDSE - will allocate new PDSE based\n                                  on the current PDSE if create specified\n                                  With Copy the space and maxgen can\n                                  be changed.\n        Edit member               to edit an existing or new member\n                                  e.g. E abc or E *, or E A%\n        Filter member-pattern     to Filter by member mask\n                                  abc* for members starting with abc\n                                  *abc for members ending with abc\n                                  abc/ for members with abc anywhere\n                                  Today for updated today\n                                  Week for updated last 7 days\n                                  Month for updated last 30 days\n                                  Year for updated this year\n                                  Since yy/mm/dd\n                                  Since -nn\n                                  OFF to turn off filtering\n        Find string               to find a string in all members/gens\n        HIGen                     Display the High Generation members\n                                  - known as dummy members\n        Locate member or member*  to scroll to the member\n                                  e.g. L abc\n                                   or  L ab*\n        MODel                     to allocate a new dataset based on the\n                                  attributes of the current dataset\n                                  - after Model the Change > command may\n                                    be used to change to the newly created\n                                    dataset\n        Options                   Display a Primary Command prompting panel\n        Output                    to create a report of the active member list\n        Prune                     to delete obsolete generations\n        Refresh <filter>          to rebuild the member list\n                                  with optional filter\n        Restore                   to invoke the Restore dialog\n        Set                       popup to change the line selection S\n                                  action (B, E, V)\n        Sort                      Sort by Name, Creation, Changed, or User\n                                  - point/shoot for these column headers\n                                  Sort Field-name Order where order is A or D\n        Submit                    Submit a member, member generation or *\n                                  e.g. SUB ABC, or SUB *, or SUB A%C\n        Validate                  Validate the PDSE using IEBPDSE\n                                  - if clean is enabled in PDSEGENS then the\n                                    validate will also force a clean for all\n                                    pending deletes.\n        View                      To View a member, or members, from the\n                                  command line:  V member or V * or V A%\n        Quit and Exit             Commands to end the dialog (F3 always works)\nK V='CBTTAPE.ORG' P=PDSEGEN R='*' I=SELECTIONS\n Line selection options are (short and long forms):\n\n        A to change attributes (ver/mod/userid)\n          - Attrib\n        B to browse the member\n          - Browse\n     ** C or COPy to copy a member to a different dataset\n          - May only be used on base members but all generations\n            for the selected member will also be copied\n        D to delete the member, or a generation\n         - Delete\n     *  E to edit the member\n          - Edit\n     ** G Recover a generation to a new member based on the\n          name provided via a prompting popup panel\n          - RECover\n        H hide the member/generation from the table\n          to exclude the member/generation from command line\n          B *, E *, V *\n          - Hide\n        I display ISPF statistics for the member or generation\n          - Info\n        J to submit the member (JCL) to the internal reader\n          - Submit\n        K to clone a member (generation 0 only)\n          - no generations are cloned\n          - Klone or Clone\n        M to eMail the member (using XMITIP)\n          - Mail\n        O to display the tutorial for options\n     ** P Promote a generation to generation 0\n          Copies a non-0 generation into generation 0\n          and leaves the user in Edit.  If you save then\n          generation 0 is replaced.\n          - Promote\n      * R to REName a member and all generations\n          - REName\n        S to use the default option as defined on the entry panel\n          - default is B\n          - Select\n        U to invoke a user command on the dataset(member)\n          - including generations\n          - User\n        V to view the member\n          - View\n        X to eXecute the member (REXX or CLIST)\n          - EXecute\n    **  Z to compare the base (gen 0) non-0 generation\n          - COMpare\n        / to display the tutorial for options\n\n        Placing the cursor on the row and hitting ENTER will also\n        select the row.\n\n     * - ONLY allowed for generation 0 members\n    ** - ONLY work with non-0 generation members\n\n Notes:\n    - All line selection options can be used in block form - BB/BB or B99\n    - Expanded commands may also be blocked by doubling the 1st character,\n      e.g. KKlone, but expanded commands may not have a count\n    - When using the expanded selection panel then any TSO command, clist,\n      or exec can be used along with any valid line selections. The User\n      command dialog will be presented to allow the user to enter other\n      parameters.\nK V='CBTTAPE.ORG' P=PDSEGEN R='*' I=NOTES\n Notes:\n\n 1.  Browse works as you would expect it to\n\n 2.  Using Edit or View you can use all normal edit commands,\n     including edit macros. However commands that reference other\n     members can only reference the base, or generation 0, member.\n\n 3.  Multiple members may be selected for Browse or View but Edit\n     will only work if the member IS NOT saved or updated.  If a\n     member is saved or updated then all rows for that member are\n     deleted and re-added to include the updated generation info.\n\n 4.  It shouldn't have to be stated but generations are only\n     supported for PDSE Version 2 datasets where generations have\n     been enabled.\n\n 5.  Edit will be converted to View for non-0 generation members.\n\n 6.  The Compare command only accepts relative generation numbers.\n\n 7.  The Compare line option will compare the base member to the\n     selected generation.\n\n 8.  It is possible to allow Edit to edit a generation BUT when that\n     happens only the generation is updated and the base member is\n     NOT updated. Thus the generation with the update could be lost\n     and/or hidden since it is not possible to access a generation\n     using dynamic allocation or JCL.\n\n     This application has been configured to prevent editing non-0\n     generations.\n\n 9.  The ISPF Edit compare command has been extended using an edit\n     macro. The new capabilities include the ability while in Edit to\n     compare to another generation of that member (e.g. compare -2)\n     or to compare to another member generation (e.g. compare xx -3).\n     When in view it is possible to compare to the base (e.g. compare 0)\n     or to another member or generation (e.g. compare xxx -1). If the\n     compare options do not include a generation then the normal ISPF\n     compare will be invoked.\n\n 10. The e-mail option utilizes XMITIP using the XMITIPFE (front end)\n     exec. This option is only available if the mail variable is\n     customized to 1.\n\n 11. Aliases are NOT supported by the PDSEGENI Rexx Function so this\n     application does not support aliases (at this time)\n\n 12. Rename will rename the base member and all generations by doing a\n     copy of the generations so they are retained.\n\n 13. Find can be faster if Filter is used prior to the find\n\n 14. Prune operates on only the members in the display list so\n     using Filter before Prune is a good way to limit the members\n     that Prune will clean up.\n\n 15. Before using Prune a Backup is recommended (CYA).\n\n 16. PDSEGEN supports extended statistics. If a member has more than 64K\n     (65535) records then the only way to display the actual record count\n     is to turn on extended statistics using the ISPF Edit command STATS\n     EXT.\n\n 17. When Hide is active, Delete, Prune, and Rename are not available.\n\n 18. The Member list display defaults to a 2 digit year display. Using the\n     Left or Right keys (F10 or F11) will shift to use the 4 digit year\n     display by removing the Initial size field from the table. This view\n     is remembered across sessions.\n\n 19. If you see a member with a -1 generation and there is no 0 generation\n     that indicates that the member was deleted outside of PDSEGEN. The\n     normal ISPF member delete will delete the base member but leave the\n     generations and the base member will become the -1 generation.\nK V='CBTTAPE.ORG' P=PDSEGEN R='*' I=BACKUP\nK* Restore\n PDSEGBAK and PDSEGRST are rexx utilities that utilizes the PDSEGENI REXX\n function and ISPF services to make a complete backup of a PDSE V2 that\n has members with generations, and then provides the ability to restore\n that backup.\n\n NOTE 1: If the backup PDS does not have generations enabled then an\n         error message will be generated as this is not the best utility\n         to process datasets without member generations defined.\n\n NOTE 2: The target PDS for both backup and restore must NOT exist as\n         it will be dynamically allocated as needed.\n\n NOTE 3: There are times when PDSEGBAK will fail in batch. This occurs\n         for some generations, not for base members, and is an issue\n         where ISPF in batch encounters some issue that I haven't figured\n         out yet. The solution is to delete the offending generation and\n         then the backup should proceed to the next offending generation\n         or to successful completion. I can't recreate at will and\n         haven't seen anything in the ispfvcall traces.\n\n Backup will create a new PDS based on the space allocations and DCB\n for the source PDSE. It will then copy all the members with their\n generations into a backup PDS. The backup PDS can then be processed\n by any existing utility that can process a PDS without fear of\n having the member generations lost.\n\n Three special members in the backup PDS are $ALLOC and $INDEX.\n\n    $ALLOC contains the maxgen specification of the original PDSE so\n    that the PDSE can be recreated during the restoration process.\n\n    $BACKUP contains the backup report generated during the backup\n    process.\n\n    $INDEX contains a list of all members with their backup member\n    names. This is used during the restoration process. The members\n    are created in the correct sequence so that after restoration the\n    base member will be the correct base member and the relative\n    generations will be their original relative generation. The\n    absolute generation number will be lost but the key is to use is\n    the relative generation (right?).\n\n The member names within the backup PDS are special members that\n retain all the ISPF statistics of the original PDSE.\n\n Restore (using either PDSEGBAK or PDSEGRST) will read in the $ALLOC\n member to pick up the MAXGEN specification so that it can allocate a new\n PDSE with that MAXGEN value. It will then read in the $INDEX member and\n use ISPF LMCOPY to copy each backup member into the restore target PDSE\n in sequence in order to retain the correct relative generation sequence.\n\n Before the target dataset is allocated the $ALLOC MAXGEN value is\n compared to the system MAXGENS_LIMIT value. If the system value is\n greater than the $ALLOC value then a warning message is issued and\n the target dataset is allocated using the system limit. NOTE: This\n could result in lost generations.\n\n PDSEGBAK can be run without options under ISPF and will display a\n prompting ISPF Panel to assist with performing the backup or restore.\n It can also be run in batch using the TMP with all the appropriate\n ISPF allocations (see member SAMPBR for sample JCL for this).\n\n The command syntax to run outside of the dialog is:\n\n  Syntax:    %pdsegbak input output option1 option2\n\n             input  is either the pdse with member/gens\n                    or the backup pds\n             output is the target dataset for backup or\n                    restore.  this dataset will be\n                    allocated based on the input dataset\n             option1 is:  backup or restore\n             option2 is:  batch or null\n\n             If no parameters, or just a input parm, and running\n             under ISPF in the foreground then display a prompting\n             panel\n\n             If option2 is batch then the backup/restore report\n             will be written to the terminal for online scripting\n             instead of opened in ispf browse.\n\n PDSEGRST is a improved restore utility that provides the ability to\n restore to an existing, or new, PDSE. It also allows for member and/or\n generation selection during the restore.\n\n Syntax:    %pdsegrst backup-dsn target-dsn mbr gen / NEW\n\n            backup-dsn   PDSEGEN Backup PDS\n            target-dsn   PDS/PDSE to restore to\n                         ** must exist **\n            mbr          Member name or member pattern\n            gen          Absolute or Relative Gen to\n                         restore\n\n            / NEW        allocate the target PDSE\n\n            mbr is optional - default is all\n            gen is optional - default is all generations\n            / NEW is optional and may be any non-blank char\n\n Usage Notes:\n           1. If restoring to a PDS or PDSE without\n              generations then only the base (gen 0)\n              will be restored.\n           2. If gen is not specified then all generations\n              will be restored starting with the oldest to\n              the newest. This retains the relative\n              generations number.\n           3. The absolute generation number cannot be\n              retained on restoration.\n           4. If the member already exists in the target\n              then the existing member/generations will\n              be pushed up the relative generation range\n              until they roll out.\n           5. If the option / NEW is specified then the\n              target PDSE will be allocated using the DCB\n              and space of the backup PDS/PDSE and using\n              the MAXGEN found in the Backup $ALLOC member\nK V='CBTTAPE.ORG' P=PDSEGEN R='*' I=CREDITS\n\n Acknowledgements:  Thanks are due to Thomas Reed of IBM who presented at\n                    the 2015 SHARE in Seattle on PDSE V2 Member\n                    Generations and provided sample code for finding the\n                    generations which I've used as a starting place for\n                    my dialog.\n\n                    Thanks also to the following for testing, commenting,\n                    trouble shooting, and making suggestions to improve\n                    this tool:\n\n                    * Bill Smith        * Sam Golob\n                    * Bruce Koss        * Tom Conley\n                    * John Kalinich     * Greg Price\n                    * Salvador Carrasco\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}, "PDSEPDF": {"ttr": 18443, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x058\\x00#\\x01\\x176?\\x01\\x19 ?\\x12Fo\\x7fq\\xf7\\x00\\x00\\xd7\\xc4\\xe2\\xc5\\xc7\\xc5\\xd5@@@'", "ispf": {"version": "05.56", "flags": 0, "createdate": "2017-12-29T00:00:00", "modifydate": "2019-07-22T12:46:23", "lines": 28543, "newlines": 29175, "modlines": 0, "user": "PDSEGEN"}, "mimetype": "application/pdf", "datatype": "binary", "extension": ".pdf"}, "PDSEREFC": {"ttr": 30212, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x02\\x002\\x01\\x176?\\x01\\x19\\x17o\\x14\\x15\\tc\\x01U\\x00\\x00\\xd7\\xc4\\xc6@@@@@@@'", "ispf": {"version": "01.02", "flags": 0, "createdate": "2017-12-29T00:00:00", "modifydate": "2019-06-25T14:15:32", "lines": 2403, "newlines": 341, "modlines": 0, "user": "PDF"}, "mimetype": "application/pdf", "datatype": "binary", "extension": ".pdf"}, "QWLOAD": {"ttr": 31235, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x00\\x00\"\\x01\\x18\\x07\\x9f\\x01\\x18\\x07\\x9f\\x13\\x15\\x00\\x16\\x00\\x16\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.00", "flags": 0, "createdate": "2018-03-20T00:00:00", "modifydate": "2018-03-20T13:15:22", "lines": 22, "newlines": 22, "modlines": 0, "user": "PDSE"}, "text": "//*\n//*  THIS MEMBER LOADS PDSEGQW TO A QUICKREF USER DATABASE\n//*\n//JS10     EXEC  PGM=QWIKREF2,REGION=0K\n//SYSPRINT DD  SYSOUT=*\n//DATAIN   DD  DISP=SHR,DSN=HLQ.PDSEGEN.PDS      <<=== PDS INSTLIB\n//*   UPDATE THE DSN FOR YOUR USER DATABASE OR ALLOCATE A NEW ONE\n//QWREFDD  DD  DSN=HLQ.QREF.USER.DATABASE,DISP=SHR\n//*QWREFDD  DD  DSN=HLQ.QREF.USER.DATABASE,\n//*            UNIT=3390,VOL=SER=2INT0A,\n//*            DCB=(RECFM=F,BLKSIZE=6160,LRECL=6160),\n//*            SPACE=(CYL,(5),RLSE),\n//*            DISP=(,CATLG,DELETE)\n//SYSIN    DD  *\nPDSEGQW\n/*\n//SYSOUT   DD  SYSOUT=*\n//SORTIN   DD  UNIT=3380,SPACE=(CYL,(10,10))\n//SORTOUT  DD  UNIT=3380,SPACE=(CYL,(10,10))\n//SORTWK01 DD  UNIT=3380,SPACE=(CYL,(10,10))\n//SORTWK02 DD  UNIT=3380,SPACE=(CYL,(10,10))\n//SORTWK03 DD  UNIT=3380,SPACE=(CYL,(10,10))\n", "mimetype": "text/plain", "datatype": "iso-8859-1", "extension": ".txt"}, "SAMPBR": {"ttr": 31237, "alias": false, "halfwords": 30, "notes": 0, "parms": "b\"\\x01\\t\\x00Y\\x01\\x16 \\x0f\\x01\\x17'\\x0f\\x14\\t\\x002\\x00/\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@\"", "ispf": {"version": "01.09", "flags": 0, "createdate": "2016-07-18T00:00:00", "modifydate": "2017-09-27T14:09:59", "lines": 50, "newlines": 47, "modlines": 0, "user": "PDSE"}, "text": "//USERIDT JOB XXXXXXXX,USERID,\n//          NOTIFY=USERID,MSGCLASS=A\n//OUT       OUTPUT DEFAULT=YES,JESDS=ALL,OUTDISP=(HOLD,HOLD)\n//* ----------------------------------------------------------- *\n//* THIS IS A SAMPLE BATCH JOB TO DEMONSTRATE HOW TO RUN        *\n//* THE PDSEGBAK ROUTINE TO BACKUP AND THE THE PDSEGRST ROUTINE *\n//* TO RESTORE A PDSE WITH MEMBER GENERATIONS.                  *\n//* ----------------------------------------------------------- *\n//* THE PDSEGBAK SYNTAX IS:                                     *\n//*                                                             *\n//* %PDSEGBAK  INPUT TARGET OPTION                              *\n//*                                                             *\n//* WHERE INPUT IS THE SOURCE PDSE                              *\n//*       TARGET IS THE TARGET PDSE                             *\n//*       OPTION IS EITHER BACKUP OR RESTORE                    *\n//*                                                             *\n//* ----------------------------------------------------------- *\n//* THE PDSEGRST SYNTAX IS:                                     *\n//*                                                             *\n//* %PDSEGRST BACKUP-PDSE TARGET-PDSE MEMBER GEN / NEW          *\n//*                                                             *\n//* WHERE BACKUP-PDSE IS THE PDSE BACKUP FROM PDSEGBAK          *\n//*       TARGET-PDSE IS THE PDSE TO BE RESTORED INTO           *\n//*       MEMBER IS A MAMBER NAME OR MEMBER MASK TO LIMIT       *\n//*         THE MEMBERS RESTORED                                *\n//*       GEN IS AN ABSOLUTE GENERATION (E.G. 0, 5, 99) OR      *\n//*         A RELATIVE GENERATION (E.G. -1, -914) TO LIMIT      *\n//*         THE MEMBERS RESTORED                                *\n//*       / NEW IS A FLAG TO FORCE THE TARGET-PDSE TO BE        *\n//*          ALLOCATED                                          *\n//* ----------------------------------------------------------- *\n//PDSEGBAK EXEC PGM=IKJEFT01,DYNAMNBR=50\n//SYSEXEC  DD DISP=SHR,DSN=HLQ.PDSEGEN.EXEC\n//STEPLIB  DD DISP=SHR,DSN=HLQ.PDSEGEN.LOAD\n//ISPPROF  DD DISP=(,DELETE),SPACE=(TRK,(1,1,1)),UNIT=SYSDA,\n//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)\n//ISPMLIB  DD DISP=SHR,DSN=SYS1.SISPMENU\n//ISPPLIB  DD DISP=(,DELETE),SPACE=(TRK,(1,1,1)),UNIT=SYSDA,\n//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)\n//ISPSLIB  DD DISP=(,DELETE),SPACE=(TRK,(1,1,1)),UNIT=SYSDA,\n//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)\n//ISPTLIB  DD DISP=SHR,DSN=SYS1.SISPTENU\n//SYSTSPRT DD SYSOUT=*\n//SYSTSIN  DD *\n PROFILE PREFIX(HLQ)\n DELETE TEST.N.BACKUP\n ISPSTART CMD(%PDSEGBAK TEST.PDSE TEST.N.BACKUP BACKUP)\n DELETE TEST.N.PDSE\n ISPSTART CMD(%PDSEGRST TEST.N.BACKUP TEST.N.PDSE / NEW)\n/*\n", "mimetype": "text/plain", "datatype": "iso-8859-1", "extension": ".txt"}, "SAMPCOPY": {"ttr": 31239, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\r\\x00\\x08\\x01\\x16\\x17o\\x01\\x160\\x1f\\x130\\x000\\x00+\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.13", "flags": 0, "createdate": "2016-06-24T00:00:00", "modifydate": "2016-10-27T13:30:08", "lines": 48, "newlines": 43, "modlines": 0, "user": "PDSE"}, "text": "//USERIDT JOB XXXXXXXX,USERID,\n//          NOTIFY=USERID,MSGCLASS=A\n//OUT       OUTPUT DEFAULT=YES,JESDS=ALL,OUTDISP=(HOLD,HOLD)\n//* ------------------------------------------------------ *\n//* THIS IS A SAMPLE BATCH JOB TO DEMONSTRATE HOW TO RUN   *\n//* THE PDSEGENC ROUTINE TO COPY A PDSE TO ANOTHER PDSE.   *\n//*                                                        *\n//* THE PDSEGENC SYNTAX IS:                                *\n//*                                                        *\n//* %PDSEGENC  FROMPDSE TOPDSE MEMBER-FILTER ( OPTIONS     *\n//*                                                        *\n//* WHERE FROMPDSE IS THE SOURCE PDSE                      *\n//*       TOPDSE IS THE TARGET PDSE                        *\n//*       MEMBER-FILTER IS * FOR ALL                       *\n//*                 * TO FILTER ON MULTIPLE CHARACTERS     *\n//*                 % TO FILTER ON A SINGLE CHARACTERS     *\n//*                 SPECIFIC MEMBER NAME                   *\n//*                 MEM/ TO COPY ALL MEMBERS WITH MEM      *\n//*                     ANYWHERE IN THE NAME               *\n//*       ( REQUIRED IF ANY OPTION IS SPECIFIED            *\n//*                                                        *\n//* OPTIONS MAY BE:                                        *\n//*                                                        *\n//*       BATCH TO BYPASS THE ISPF PROGRESS POPUP          *\n//*       NEW TO CREATE THE TARGET PDSE USING ALLOC INFO   *\n//*           FROM THE FROM PDSE                           *\n//*       REPLACE TO REPLACE SAME MEMBER (AND GENERATIONS) *\n//* ------------------------------------------------------ *\n//COPY     EXEC PGM=IKJEFT1B,DYNAMNBR=50\n//SYSEXEC  DD DISP=SHR,DSN=HLQ.PDSEGEN.EXEC\n//STEPLIB  DD DISP=SHR,DSN=HLQ.PDSEGEN.LOAD\n//ISPPROF  DD DISP=(,DELETE),SPACE=(TRK,(1,1,1)),UNIT=SYSDA,\n//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)\n//ISPMLIB  DD DISP=SHR,DSN=SYS1.SISPMENU\n//ISPPLIB  DD DISP=(,DELETE),SPACE=(TRK,(1,1,1)),UNIT=SYSDA,\n//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)\n//ISPSLIB  DD DISP=(,DELETE),SPACE=(TRK,(1,1,1)),UNIT=SYSDA,\n//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)\n//ISPTLIB  DD DISP=SHR,DSN=SYS1.SISPTENU\n//SYSTSPRT DD SYSOUT=*\n//SYSTSIN  DD *\n PROFILE PREFIX(HLQ)\n DELETE TEST.N.PDSE\n ALLOC DS(TEST.N.PDSE) NEW SPA(30,30) DSNTYPE(LIBRARY,2) +\n    MAXGEN(10) LIKE(TEST.PDSE)\n FREE DS(TEST.N.PDSE)\n ISPF CMD(%PDSEGENC TEST.PDSE TEST.N.PDSE *)\n/*\n", "mimetype": "text/plain", "datatype": "iso-8859-1", "extension": ".txt"}, "SAMPLE": {"ttr": 31241, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x00\\x00\\x16\\x01 4\\x9f\\x01 4\\x9f\\x06 \\x02\\x9c\\x02\\x9c\\x00\\x00\\xe7\\xd4\\xc9\\xe3@@@@@@'", "ispf": {"version": "01.00", "flags": 0, "createdate": "2020-12-14T00:00:00", "modifydate": "2020-12-14T06:20:16", "lines": 668, "newlines": 668, "modlines": 0, "user": "XMIT"}, "mimetype": "application/xmit", "datatype": "binary", "extension": ".xmi"}, "SUPPORT": {"ttr": 31494, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x02\\x00!\\x01\\x16\\x16_\\x01\\x17\\x19\\x8f\\x14\\x05\\x00\\n\\x00\\x07\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.02", "flags": 0, "createdate": "2016-06-13T00:00:00", "modifydate": "2017-07-17T14:05:21", "lines": 10, "newlines": 7, "modlines": 0, "user": "PDSE"}, "text": "Disclaimer: This software is provided for your use without any warranty\nor recourse should it not perform or cause problems. The author and\nothers who have contributed are not responsible for issues that arise,\nnor are their employers. Use this software at your own risk. Test and\ntest again before using in any productive capacity.\n\nThe complete source is provided and it is my hope that you will not find\nany issues.  However if you do have issues please let me know\n(lbdyck@gmail.com) and if you do make changes/enhancements please let me\nknow as well.\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}, "WISHLIST": {"ttr": 31496, "alias": false, "halfwords": 30, "notes": 0, "parms": "b'\\x01\\x1a\\x00\\x16\\x01\\x16 \\x1f\\x01\\x18\\x08_\\x14\\x16\\x00\\x0c\\x00\\x0c\\x00\\x00\\xd7\\xc4\\xe2\\xc5@@@@@@'", "ispf": {"version": "01.26", "flags": 0, "createdate": "2016-07-19T00:00:00", "modifydate": "2018-03-26T14:16:16", "lines": 12, "newlines": 12, "modlines": 0, "user": "PDSE"}, "text": "This member contains a list of features that have been requested\nbut not yet implemented.\n\nThere is no guarantee that any of these will be implemented but if\nanyone wants to do the code and share it with me that will improve\nthe chances of them being implemented.\n\nTracking  Date     Description\n0         .......  Support alias members\n1         7/12/16  Interface to the PDS command\n2        01/13/17  Allow volser for backup/restore/copy\n3        10/05/17  Create SMF records for tracking usage (target 2050)\n", "mimetype": "text/plain", "datatype": "unknown-8bit", "extension": ".txt"}}}}, "SCRIPTOPTIONS": {"filename": "./CBT969/FILE969.XMI", "LRECL": 80, "loglevel": 30, "outputfolder": "CBT969", "encoding": "cp1140", "unnum": true, "quiet": false, "force": false, "binary": false, "modifydate": true}}