PROC 1 MEMBER EDIT
SET BROWSE = BROWSE
IF &SYSCAPS(&STR(&EDIT)) = EDIT THEN SET BROWSE = EDIT
IF &STR(&MEMBER.) = &STR(*) THEN DO
   SET CHK =  &STR(&SYSDSN('TSOMODEL.PUBLIC.TEXT')
   IF &STR(&CHK.) = OK THEN -
      ISPEXEC &BROWSE DATASET('TSOMODEL.PUBLIC.TEXT')
   ELSE WRITE:  DATASET 'TSOMODEL.PUBLIC.TEXT' &STR(&CHK.)
   EXIT CODE(0)
END
IF &LENGTH(&STR(&MEMBER.)) > 8 THEN DO
   WRITE &STR() THE SPECIFIED MEMBERNAME "&MEMBER" EXCEEDS 8 +
       BYTES  LENGTH IS &LENGTH(&MEMBER)
   EXIT CODE(12)
END
SET MULTIMEM = &SYSINDEX(&STR(*),&STR(&MEMBER.))
IF &MULTIMEM = 0 THEN -
   SET MULTIMEM = &SYSINDEX(&STR(%),&STR(&MEMBER.))
IF &MULTIMEM > 0 THEN DO
   $&BROWSE. TSOMODEL.PUBLIC.TEXT(&MEMBER.)
   EXIT CODE(&LASTCC.)
END
SET CHK =  &STR(&SYSDSN('TSOMODEL.PUBLIC.TEXT(&MEMBER.)')
IF &STR(&CHK.) = OK THEN -
ISPEXEC &BROWSE DATASET('TSOMODEL.PUBLIC.TEXT(&MEMBER.)')
ELSE DO
   WRITE : You can browse all members in turn using
   WRITE :                tso modelt *
   WRITE : which gets you to the directory.
   WRITE
   WRITE
   WRITE :  MEMBER &MEMBER NOT FOUND - GIVING YOU BACK THE INDEX MEMBER
   WRITE :       WHEN YOU HAVE LOCATED THE CORRECT MEMBER
   WRITE :          PLEASE REENTER ON THE COMMAND LINE
   WRITE :                TSO MODELT xxxxx
   ISPEXEC &BROWSE DATASET('TSOMODEL.PUBLIC.TEXT(INDEX)')
END
EXIT CODE(0)
