PROC 1 FILE TO(0) ONLY DOC M() ART
/* DOCUMENTATION FOR CBT AND NASPA -- IN "THE REXX MACROS TOOLBOX" -- SOP #6260*
/* PROGRAMS, CLISTS, DOCUMENTATION, ETC. FROM PROFESSIONAL PROGRAMMERS*/
/*
/* COMPANION CLIST IS  CBT   -- SAME TECHNIQUES USED AS IN NASPA */
/*  --------- EXAMPLES ------------------. */
/*   ==> TSO CBT DOC
/*   ==> TSO CBT 50
/*   ==> TSO CBT 50 M(%OC*)
/*   ==> TSO CBT 50 TO(55)
/*  --------- USEFUL TECHNIQUES ---------. */
/*   ==> TSO NASPA DOC
/*   ==> X ALL;FIND SMF WORD ALL
/*   ==> APPEND DOC    -- IDENTIFY WITH CC-CC RANGE
/*   ==> TSO NASPA 97  -- OR  TSO NASPA 97 M($DOC)
/*   ==> APPEND DOC    -- IDENTIFY WITH CC-CC RANGE
/*   ==> $EDIT USERID.CUTDSN.LIST
/*   ==> @PRINT DOWN8
/*
CONTROL NOFLUSH NOMSG
/* DOCUMENTATION FOR CBT AND NASPA -- IN "THE REXX MACROS TOOLBOX" -- SOP #6260*
/* PROGRAMS, CLISTS, DOCUMENTATION, ETC. FROM PROFESSIONAL PROGRAMMERS*/
SET LP = &STR((
SET RP = &STR())
IF &STR(&M.) ^= &STR() THEN DO
  SET M = &STR(&M.)
  SET M = &STR(&LP.&STR(&M.)&RP.)
   SET MULTIMEM = &SYSINDEX(&STR(*),&STR(&MEMBER.))
   IF &MULTIMEM = 0 THEN -
      SET MULTIMEM = &SYSINDEX(&STR(%),&STR(&MEMBER.))
  SET ONLY = ONLY
END
ELSE SET M = &STR()
IF DOC = &DOC | DOC = &SYSCAPS(&FILE.) THEN DO
  ISPEXEC EDIT DATASET('TECH.NASPA.FILE001.DATA')
  EXIT CODE(0)
END
IF ART = &ART | ART = &SYSCAPS(&FILE.) THEN DO
  ISPEXEC EDIT DATASET('TECH.NASPA.ARTICLES')
  EXIT CODE(0)
END
IF &TO. = 0 THEN SET TO = &FILE.
SET TO = &TO.
SET FILE = 1000 + &FILE.
SET MAX = 0
BACK: -
SET MAX = &MAX. + 1
IF &MAX. = 5  THEN DO
  SET &ZEDSMSG = &STR(NASPA &SUBSTR(2:4,&FILE.)
  SET &ZEDLMSG = &STR(===> TSO &ZEDSMSG   -- TO CONTINUE WHERE LEFT OFF)
  ISPEXEC     SETMSG MSG(ISRZ000)
  EXIT CODE(0)
END
SET FILE = &SUBSTR(2:4,&FILE.)
IF &EVAL(&FILE.) > 900 THEN EXIT CODE(8)
IF MULTIMEM = 0 +
   THEN SET DSN = 'TECH.NASPA.FILE&FILE..PDS&STR(&M.)'
   ELSE SET DSN = 'TECH.NASPA.FILE&FILE..PDS'
SET XX = &SYSDSN(&DSN.)
IF &XX = OK THEN DO
 SET DSN = 'TECH.NASPA.FILE&FILE..PDS&STR(&M.)'
 ISPEXEC EDIT DATASET(&DSN.)
END
ELSE DO
   SET XX = &SYSDSN('TECH.NASPA.FILE&FILE..DATA')
   IF &XX = OK THEN ISPEXEC EDIT DATASET('TECH.NASPA.FILE&FILE..DATA')
END
IF ONLY = &ONLY THEN EXIT CODE(0)
IF &EVAL(&TO.) NE 0 THEN -
  IF &EVAL(&FILE.) GE &EVAL(&TO.) THEN EXIT CODE(0)
SET FILE = 1001 + &FILE.
GOTO BACK
/*   TECH.NASPA.FILE001.DATA
/*   TECH.NASPA.FILE002.DATA
/*   TECH.NASPA.FILE003.DATA
/*   TECH.NASPA.FILE004.PDS
/*   TECH.NASPA.FILE005.PDS
/*   TECH.NASPA.FILE006.PDS
/*   TECH.NASPA.FILE007.PDS
/*   TECH.NASPA.FILE008.PDS
/*   TECH.NASPA.FILE009.PDS
/*   TECH.NASPA.FILE010.PDS
/*   TECH.NASPA.FILE011.PDS
/*   TECH.NASPA.FILE012.PDS
/*   TECH.NASPA.FILE013.PDS
/*   TECH.NASPA.FILE014.PDS
/*   TECH.NASPA.FILE015.PDS
/*   TECH.NASPA.FILE016.PDS
/*   TECH.NASPA.FILE017.PDS
/*   TECH.NASPA.FILE018.PDS
/*   TECH.NASPA.FILE019.PDS
/*   TECH.NASPA.FILE020.PDS
/*   TECH.NASPA.FILE021.PDS
/*   TECH.NASPA.FILE022.PDS
/*   TECH.NASPA.FILE023.PDS
/*   TECH.NASPA.FILE024.PDS
/*   TECH.NASPA.FILE025.PDS
/*   TECH.NASPA.FILE026.PDS
/*   TECH.NASPA.FILE027.PDS
/*   TECH.NASPA.FILE028.PDS
/*   TECH.NASPA.FILE029.PDS
/*   TECH.NASPA.FILE030.PDS
/*   TECH.NASPA.FILE031.PDS
/*   TECH.NASPA.FILE032.PDS
/*   TECH.NASPA.FILE033.DATA
/*   TECH.NASPA.FILE034.PDS
/*   TECH.NASPA.FILE035.PDS
/*   TECH.NASPA.FILE036.PDS
/*   TECH.NASPA.FILE037.PDS
/*   TECH.NASPA.FILE038.PDS
/*   TECH.NASPA.FILE039.PDS
/*   TECH.NASPA.FILE040.PDS
/*   TECH.NASPA.FILE041.PDS
/*   TECH.NASPA.FILE042.PDS
/*   TECH.NASPA.FILE043.PDS
/*   TECH.NASPA.FILE044.PDS
/*   TECH.NASPA.FILE045.PDS
/*   TECH.NASPA.FILE046.PDS
/*   TECH.NASPA.FILE047.PDS
/*   TECH.NASPA.FILE048.PDS
/*   TECH.NASPA.FILE049.PDS
/*   TECH.NASPA.FILE050.PDS
/*   TECH.NASPA.FILE051.PDS
/*   TECH.NASPA.FILE052.PDS
/*   TECH.NASPA.FILE053.PDS
/*   TECH.NASPA.FILE054.PDS
