/*rexx: Make Proper nouns if original strictly lowercase */
/*PROPER    Author: David McRitchie, created 1992/02/11 IS03  */
/*          at "The REXX Macros Toolbox", DMcRitchie@aol.com    */
/*          Updated 1992/02/17 20:22 IS03                     */
Address "ISREDIT"
"MACRO (TOKEN)"
"CAPS OFF"
/* Contributed: David McRitchie, "The REXX Macros Toolbox", 1992/02/11 */
/* suggest use is AFTER using the @SMALLS macro clist/execute        */
/* suggest and EXCLUDE of all lines before using PROPER macro.       */
/*  RELATED CLISTS -- @SMALLS, PERIOD,  SPELL                        */
/*********************************************************************/
/* Optional usage -- supply own words -- ignore words BUILTIN        */
/*      ===> PROPER Librarian SQLNO SYSIN                            */
/*********************************************************************/
/* The text is basically same as added to our dictionary, except     */
/* that words were checked with the SPELLING clist to make sure      */
/* that none of these words are valid in all lowercase letters.      */
/* A few of those that were valid in all lowercase letters were      */
/* left in                                                           */
/*   1. Take words of dictionary additions                           */
/*   2. Remove AP and HP prefix in col 1-2                           */
/*   3. Change all double hyphens (--) to single hyphens (-)         */
/*   4. Reformat  into two columns as follows:                       */
/*      .cm Word-A               ;word-a                             */
/*      with the left-hand side being a comment and the right        */
/*      side converted to lowercase.                                 */
/*   5. Exclude all lines and execute  SPELL.                        */
/*   6. Delete all excluded (or valid in lowercase) lines.           */
/*   7. REFORMAT words into listing as needed below.                 */
/* WARNING: do not remove the PROCESS procedure at the end.          */
/*********************************************************************/
/* Since word are sorted, it will not make any difference in the     */
/* results if a word appears both as Albert and ALBERT, since the one*/
/* with the lowercase letters will have completed and rendered the   */
/* second form unfindable when checked for in lowercase.             */
/*********************************************************************/
"EXCLUDE ALL"
" ISREDIT (MEMBERX) = MEMBER "
" ISREDIT (DSNX)    = DATASET"
"(LINE) = linenum .zf"
IF RC \= 0 then return
  twords = 0; cwords=0; owords=0;
  ZEDSMSG =
  BEGAN = TIME('N')
  ZEDLMSG = BEGAN ||" -- PROPER began"
/*********************************************************************/
/*   Address "ISPEXEC" "CONTROL DISPLAY LOCK"                        */
/*********************************************************************/
  Address "ISPEXEC" "SETMSG  MSG(ISRZ000)"
IF TOKEN \= "" then do
   CALL PROCESS       TOKEN
   report = "PROPER changed " owords "occurrences of" ,
     cwords "(list" twords")"
   "LINE_BEFORE .zf = NOTELINE """||began||"--"||TIME('N') ,
       MEMBERX report||""" "
         ZEDSMSG = "COMPLETED"
         ZEDLMSG = BEGAN||"--"TIME('N') report
         Address "ISPEXEC" "SETMSG  MSG(ISRZ000)"
   RETURN 1
END
/******************* BUILTIN words portion follows *****************/
"CHANGE ALL WORD p'sys#' p'>>>>'"
"CHANGE ALL WORD c'dpt' p'>>>'"
"CHANGE ALL WORD c'VSAM' VSAM"
"CHANGE ALL WORD c'SPF'  SPF"
CALL PROCESS " Albert Alexander Alfisi Alice Alison Allen "
CALL PROCESS " Allentown Allison Alma Alpine Alt-Esc Alunni "
CALL PROCESS " Alvarez Amalia Amolia @AMSRCAT @C @CAPS @COMPARE "
/* ...... documentation shows how it works not all words shown ..
.go xxx;.ct */
CALL PROCESS " @DATE @DIR @EDITMSK @EQUFLAG @ICOPY @INDEX @MEMO "
CALL PROCESS " @RENAME @RESQ @RESQTXT @SCRIPT @SCRPTDU @SEQ @SLCT "
CALL PROCESS " @SLCTDSX @SMALLS @STRAPE @STRAPQ @TPP @TSO @TSOX "
CALL PROCESS " @TSOXD @VP @XMIT LaserJet mAh nnnnK nnnK nnFASCIS "
CALL PROCESS " non-ANSI-standard non-Network non-NETWORK "
CALL PROCESS " non-NETWORK-related nonIBM pppppFnn pppppTnn pPUNn "
CALL PROCESS " pRDRn qNCPUxx sPUNn sRDRn titNN x'FE xxxxAGVET "
CALL PROCESS " xxxxCMDS xxxxEDIT xxxxEDRT xxxxFILE xxxxPROF "
CALL PROCESS " xxxxRSR xxFFFFFF yymmIOG Abadie Abee Ada Adobe "
CALL PROCESS " Agrivet Akron Alampi Alan Anaheim Anderson Angeles "
CALL PROCESS " Angstadt Anil Ann Anne Annette Annn Apr Archdale "
CALL PROCESS " Argo Arledge Armstrong Arora Arthur Artis Ashley "
CALL PROCESS " Ashton-Tate Assemblr Assin Asynch Aten Atg Athenian "
CALL PROCESS " Atlanta Aton Auburn Audix Aug Austin Australia "
CALL PROCESS " Austria Authentication Authorizer Autotab Ave Axxxx "
CALL PROCESS " Azoplate AAA AAAAA AAAAAAAAAFF AB ABCDE ABCDEF "
CALL PROCESS " ABCDEFGHIJK ABCDEFGHIJKLMNOPQRSTUVWXYZ ABM ABND "
CALL PROCESS " ABOX ABP ACBLIB ACBNAME ACC ACCCC ACCO ACCTG ACCTIN "
CALL PROCESS " ACCTIO ACCTIVP ACCTOUT ACF ACK ACO ACOPROC ACOS "
CALL PROCESS " ACPRIM ACR ACRITH ACSEC ADDCHK ADDENDEM ADDMSGD "
CALL PROCESS " ADDNAME ADF ADHIN ADLIN ADM ADMGDF ADMINIS ADMN "
CALL PROCESS " ADMOPUT ADMPRINT ADR ADRDMPRS ADRDSSU ADRS ADSMI "
CALL PROCESS " ADUMP ADV ADY AEC AF AFF AFP AFPREFR AFPRINT AG "
CALL PROCESS " AGIN AGRI-VET AGRICULT AGS AGVET AGVT AHnnnn AHC "

CALL PROCESS " AHCINDT AHCLINE AHCMAIL AHCNETWORK AHCNOTE AHCPROF "
CALL PROCESS " AHCSCORE AHCSTH AHCTABS AHCTECHS AHCXWTR AHDAILY "
CALL PROCESS " AHDUMPnn AHF AHHEAD AHSYSLOG AHZIMxxx AI AJnnnn AL "
CALL PROCESS " ALAB ALBANY ALIGNJCL ALLEN ALLMBRS ALLOEXIT "
CALL PROCESS " ALOGRECA ALOGRECH ALPHALOW ALTCPy ALTCTL ALTPARM "
CALL PROCESS " ALTRES ALTRNAME ALX AMASPZAP AMBLIST AMDPRDMP AMG "
CALL PROCESS " AMI AMODE AMODGEN AMOLIA AMORG AMPBLK AMRF "
CALL PROCESS " AMS AMSRCAT ANMP ANOPROC ANS ANSI ANSWR "
CALL PROCESS " ANT AO AOR AP APA APAP APF APF-authorized APFLIB "
CALL PROCESS " APFUA APFUD APHDRS API APL APOST APPsnn APPC "
CALL PROCESS " APPLNAME APPN APPOVED APSWPROC APX APXCTL AR ARCnnn "
CALL PROCESS " ARCxxx ARCCRIT ARCHCMDS ARCHIV ARCHIVEC ARCHPOOL "
CALL PROCESS " ARCOS ARCPRINT ARCRESEX ARCRETPD ARCTEST ARCTSO "
CALL PROCESS " ARCVSAM ARF ARFTERM ARJE ARMSTRONG ARSIN ARSYSTEM "
CALL PROCESS " ARY ASAP ASCB ASI ASID ASIN ASIS ASKIP ASM ASS "
CALL PROCESS " ASSETSNW ASSETSRC ASSOC ASSURANCE-DYES ASU ASYNCRTN "
CALL PROCESS " ATBLINK ATC ATD ATMS ATP ATT ATTR ATTRCHAR ATTRIB "
CALL PROCESS " ATZ AU AUL AUT AUTABLE AUTHIVP AUTOEXEC AUTOLOGN "
CALL PROCESS " AUTOM AUTOTAB AUTOTEST AUX AUXLRY AVE AVOSS AVP "
CALL PROCESS " AVPRPRT AYSYNC AZ AZO AZOPLATE Backgrnd Badders "
CALL PROCESS " Bagg Bahama Baime Barbara Barletta Barry Bayport "
CALL PROCESS " Beatrice Beatty Beckman Bedminster Bedminster-Aquet "
CALL PROCESS " Bedminster-Internal Bedminster-SCG Beggs Behring "
CALL PROCESS " Bejgrowicz Belgium Benefitse Benito Bergan Berilla "
CALL PROCESS " Bernardino Bernie Bessie Beta-Max Betty Bi Bickford "
CALL PROCESS " Biolsi Biomedical Bitting Blake Blvd Bolshevik "
CALL PROCESS " BookManager BookMaster Borden Boston Bounpane "
CALL PROCESS " Bradford Bradstreet Brady Branchburg "
CALL PROCESS " Branchburg-Human Branchburg-Meister "

CALL PROCESS " Brisbane Britain Britannia British Briton Broteau "
CALL PROCESS " Brower Bruce Bruning Bruno Brunswick Brzycki Btu "
CALL PROCESS " Buchanan Budgest Bulgaria Bunner Burbank Burchfield "
CALL PROCESS " Burke Burnett Burroughs Burton Byerlee Byyyyy BAA "
CALL PROCESS " BAB BAC BACCOUNT BACKME BACKRPT BACKUPDR BADIN BAE "
CALL PROCESS " BAF BAL BALR BANN BARF BASDATA BASICDRN BASICF "
CALL PROCESS " BASICRUN BASOBJ BASSM BAYPORT BAYPRT BB BB-M "
CALL PROCESS " BB-M-Purchasing BB-T BBA BBB BBBBBBBBBB BBBBBBBBBBB "
CALL PROCESS " BBBBBBBBBBBB BBC BBE BBF BBLOCK BBOP BBURG BC BCD "
CALL PROCESS " BCK BCKxxx BCREATOR BD BDAM BDD BDI BDT BEGCOL "
CALL PROCESS " BFRUSE BFT BG BGU BI BIC BILLBACK BILLBACKBLDG "
CALL PROCESS " BIMED BIMEDT BING BIRTHD BIRTHDATE BISAM BKEND BKP "
CALL PROCESS " BKUP BKUPnn BLDGA BLDGD BLDGO BLKCNT BLKSI BLKSIZ "
CALL PROCESS " BLKSZ BLOCKTEST BLP BMC BMDP BMDPLOAD BMDPOPEN BMP "
CALL PROCESS " BMPs BMPMSGRQ BMPSYSCH BMS BMSGRQ BN BNAME BO BOCON "
CALL PROCESS " BOMP BOTTOMKP BPAM BPF BPTAGSA BR BREAKSTA BREK BRG "


CALL PROCESS " BSB BSB-Fine BSIZ BSIZE BSM BSYSCHG BTAM BTAM-ES "
CALL PROCESS " BTAM-ES BTS BTU BTYPE BU BUF BUFFERRED BUFFERSPACE "
CALL PROCESS " BUFFSIZE BUFNO BUFOFF BUFSIZE BUFSP BUGSDOC BUGSIBM "
CALL PROCESS " BUGSIBMX BUMMDDYY BW BWDFM BXBV BXCX BXLH BXLL BXLR "
CALL PROCESS " BXRH BXTV BXUL BXUR BXVT BZ C-H C-H-R Caesar Cal "
CALL PROCESS " Calbiochem Calif California Callas Campbell Campsen "
CALL PROCESS " Canada Canon Capex Carl Carley Carlo Carnegie Carol "
CALL PROCESS " Carole Carolina Caroline Cary Caserta Casserta "
CALL PROCESS " Catawba Catherine Cathy Cel Celanese Celeste "
CALL PROCESS " Celriver Celtran Centre Centrex Cericola Cesari "
CALL PROCESS " Cevallos Chablis Chad Charlene Charles Charlotte "
CALL PROCESS " Chatham Chem Chesapeake Chester Chet Chicago China "
CALL PROCESS " Chisholm Chk Chow Chris Christi Chrysler Cichetti "
CALL PROCESS " Cindy Cladek Clara Clark Clarkwood Clemons Clifton "
CALL PROCESS " Cobol Colgate Colinas Colodner Colorado Comdisco "
CALL PROCESS " Commtrack Comp Computer-Graphics CompuServ "
CALL PROCESS " Con-nect-i-cut Consultative Cornelius Costa "
CALL PROCESS " Coventry Craig Crocco Cromartie Crosby Crtform Ctlr "
CALL PROCESS " Cursr Custom-Built Customiz Cynthia CA-FINPLAN "
CALL PROCESS " CA-UCANDO CACHOFF CACHON CACHSTAT CADAM CAEDS CAGRP "
CALL PROCESS " CAI CAIDLIB CAILIB CAIM CAISRC CAITGT CALBIOCHEM "
CALL PROCESS " CALCDATE CALLE CALLERR CALLFUNC CAMI CAPEIND CAPEX "
CALL PROCESS " CAROL CAS CASXA CATnnnn CATxxxx CATALOGn CATALOGB "
CALL PROCESS " CATDISP CATIA CATLG CATRES CB CBADATA CBADEC CBAINT "
CALL PROCESS " CBALEN CBASTR CBC CBCVSE CBDS CBIPO CBPDO CBT CCAGF "
CALL PROCESS " CCD CCF CCG CCHAR CCHH CCHHR CCITT CCM CCS CCSS CCU "
CALL PROCESS " CDATE CDELSQST CDINCR CDMsnn CDRM CDRMs CDRMS CDRSC "
CALL PROCESS " CDSEQ CDSSNNN CDT CDU CE CEs CEC CELANESE CELMEX "
CALL PROCESS " CEMT CEO CEPT CER CERES CERTCNT CERTDT CF CFF CFO "
CALL PROCESS " CG CHA CHAN CHANGER CHARLES CHARLOT CHARTST CHD CHE "
CALL PROCESS " CHECKDUP CHECKPT CHECKSUM CHEMPLAS CHGA CHGALL CHGB "
CALL PROCESS " CHGC CHGD CHK CHKLIST CHKLNK CHKNO CHKPT CHMOEX "
CALL PROCESS " CHNGZONE CHP CHPID CHPIDs CHPIDS CHPRECVY CHR CHRON "
CALL PROCESS " CHV CIC CICS CICSz CICSBMS CICSCOB CICSPARS CICSPLI "
CALL PROCESS " CIM CIP CIPREC CIS CISMAN CISPROD CISTEST CISZ "
CALL PROCESS " CJnnnn CJOB CKD CKNO CKPT CKPTDEF CKPTLINE CKPTMODE "
CALL PROCESS " CKPTPAGE CKPTPGS CKPTSEC CLEANCNT CLEANDT CLG CLGP "
CALL PROCESS " CLIN CLISTHLP CLN CLOSFILE CLP CLS CLSDST CLW "
CALL PROCESS " CMDLIB CMDPRINT CMOS CMPR CMR CMRSCS CN CNCL CNM "
CALL PROCESS " CNSL CNSTR CNTR COB COBBAT COBCMD COBDLI COBLIB "
CALL PROCESS " COBMAP COBOL COBOPT COBSKEL COBU COBUC COBUCG "
CALL PROCESS " COBUCL COBUCLGP COBUCLP CODA CODEPGX CODEXOLD "
CALL PROCESS " COLODNER COLPAGE COMIN COMM COMMANDxx COMMNAD "
CALL PROCESS " COMMNDxx COMP COMPAS COMPDATE COMPILETIME COMPIOPT "
CALL PROCESS " COMPLDT COMPLIBS COMPOPT COMPPLI COMPRESSOR "
CALL PROCESS " COMPZONE CONCT COND CONFIGR CONLIST CONN CONTIG "
CALL PROCESS " CONTROLD CONTROLINTERVALSIZE CONTROLM CONVPARM "
CALL PROCESS " COPER COPICS COPIS COPT COPTC COPTCL COPTCLG "
CALL PROCESS " COPTIMS COPYMAN COPYMOD COPYPRD COPYPRO COREDUMP "
CALL PROCESS " CORPACCT CORPTAX COSnnn COSMOS COSTACCT COSTDATA "
CALL PROCESS " CPa CPb CPx CPy CPF CPI-C CPI-C CPLOAD CPM "
CALL PROCESS " CPU-to-CPU CPUs CPUAD CPUS CPX CPXCSL CPXMOPTS "
CALL PROCESS " CPXMRPTS CPXMSNAP CPXOPT CPXTnnnn CPXTxxxx CPXTIMSV "
CALL PROCESS " CPY CPYLIB CRDAT CREDT CRH CRI CRJE CRP CRPROW CRT "
CALL PROCESS " CRTMSGF CRYPTO CSA CSALIMIT CSDB CSERV CSG CSI CSMT "
CALL PROCESS " CSP CSQUEEZE CSRPOS CSRROW CSSF CSSN CSTALCDS "
CALL PROCESS " CSTALCLS CSTALCSY CSTEP CSTMTA CSTRETCH CSTU CSU "
CALL PROCESS " CTC CTCs CTCA CTDATE CTDATES CTIME CTLCARD CTLCARDS "
CALL PROCESS " CTMI CTNL CTR CTRNO CTW CTWED CTY CU CUA CUNIT CURR "
CALL PROCESS " CUS CUSTMVSP CUSTREFA CUSTSVC CUSTVMSP CUTOFWED CUU "
CALL PROCESS " CVAF CVOL CVT CVTSHRVM CVTUCBA CVTUSER CW CWA CWED "
CALL PROCESS " CXI CXS CY CYLAD CYLOFL CYLOV Dahlin Dale Dallas "
CALL PROCESS " Damone Dan Daneshfar Daniel Danny Datacomm "
CALL PROCESS " Datamaster Datapro Dave David Dawson Debbie Deborah "
CALL PROCESS " Decatur Delaware Deltak Dematos Denmark Deremer "
CALL PROCESS " Dermatop Devin-Adair Devlin Dewerth DeRemer Diana "
CALL PROCESS " Diane Diazo Dick Dickey Disoss Displaywrite "
CALL PROCESS " Displaywriter DisplayWrite Dk Dnnnn Doaks Dobbins "
CALL PROCESS " Dominguez Donna Donohue Doreen Doremus Dormanski "
CALL PROCESS " Douglas Drawtwist Dreyfus Drp Dua Dun Durel DuPont "
CALL PROCESS " Dyyzz DAA DACOS DACU DADSCLASS DADSM DADSOR DADSORT "
CALL PROCESS " DADSPLUS DADSRT DADX DADY DAIR DALJCL DALJOBS "
CALL PROCESS " DALLETE DALPFOC DALPSTOP DALTFOC DALTSTOP DANESHFA "
CALL PROCESS " DARCOS DARSIN DASDnn DASDxx DASDADM DASDERR "
CALL PROCESS " DASDEXCP DASDMON DASDMOON DASDPOOL DASPLUS DATAFIL "
CALL PROCESS " DATAGEN DATAID DATAPRO DATATEST DATECD DATEDIFF "
CALL PROCESS " DATEX DATIME DATSETS DAVE DAVETONE DAVID DAVSCALE "
CALL PROCESS " DAYDIFF DAYLIB DAYOFWK DAYSMFR DBase DBA DBA's DBCS "
CALL PROCESS " DBCTL DBDA DBDC DBDEF DBDGEN DBDLIB DBDNAMEA "
CALL PROCESS " DBDNAMEX DBEDIT DBEDITP DBIL DBMAUI DBMS DBR DBRCP "
CALL PROCESS " DBRM DBRMLIB DBS DBSP DBT DBUSS DC-DDP DCA DCB "
CALL PROCESS " DCBDDDDDDDDDD DCBEOBW DCBOFLGS DCBOPTA DCBOPTB "
CALL PROCESS " DCBOPTC DCBOPTCD DCBOPTE DCBOPTF DCBOPTH DCBOPTI "
CALL PROCESS " DCBOPTL DCBOPTM DCBOPTO DCBOPTQ DCBOPTR DCBOPTT "
CALL PROCESS " DCBOPTTO DCBOPTU DCBOPTUF DCBOPTW DCBOPTY DCBOPTZ "
CALL PROCESS " DCC DCE DCF DCFCLIST DCFDSAG DCFDSAGM DCFDUCK "
CALL PROCESS " DCFINDEX DCFJCLDU DCFJCLPC DCFJJCL DCFJONLY DCFLENG "
CALL PROCESS " DCFMAN DCGEN DCK DCLASS DCLGEN DCLGENS DCM DCMS DCQ "
CALL PROCESS " DCT DCTI DDATA DDCAT DDDD DDDEFs DDDEFS DDM DDMCAT "
CALL PROCESS " DDP DDPT DDR DDS DDSRV DDY DDYY DEERFLD DEFALIAS "
CALL PROCESS " DEFDDIR DEFPAGE DEFSWAP DEFVSOP DEHSA DEL-C "
CALL PROCESS " DELAWARE DELETESTA DELPAGE DELSQST DELSWAP DELTAK "
CALL PROCESS " DENVER DEQ DER DERSQNM DES DESC DESKCALC DESTID "
CALL PROCESS " DESTIDs DESTRYDT DET DEVICETYPE DEVT DFDS DFDSS "
CALL PROCESS " DFEF DFH DFHBMSMM DFHDUP DFHPC DFHSM DFHTC DFNAME "
CALL PROCESS " DFP DFSMS DFSORT DFSUDUMP DFSURIDX DFSVSAMP "
CALL PROCESS " DFSXXXXX DFT DFU DG DGN DHCF DHR DIA DIAGFILE "
CALL PROCESS " DIALSURV DICT DIDX DIF DIFF DII DINDEX DIPPIE "
CALL PROCESS " DIREDIT DIRMAINT DIRMDOWN DIRPARM DIRSTAT DIRVSPC "
CALL PROCESS " DIRVSPCX DISA DISKcx DISKnn DISKnx DISKxx DISKACNT "
CALL PROCESS " DISKC DISKCn DISKCx DISKVn DISKVx DISKVA DISKVB "
CALL PROCESS " DISKVC DISKVD DISKXn DISSOS DISSPLA DIST DISTRS "
CALL PROCESS " DIVDESC DIVLUKUP DJnnnn DL DLBL DLDDPCC DLF DLG DLI "
CALL PROCESS " DLIBs DLIBACK DLIBATCH DLIBTCH DLIHDRL DLIHDUL "
CALL PROCESS " DLILIB DLIMAGE DLIPRG DLIPRR DLIPRU DLIRECV DLISASP "
CALL PROCESS " DLITEST DLIWRK DLM DLMDMSDMSTSO DLN DLSE DLTX DLY "
CALL PROCESS " DLZ DLZACT DLZDLTXX DMAP DMAS DMB DMDPOPEN DMJ "
CALL PROCESS " DMJnnnn DMN DMNDSET DMP DMPn DMPNCPU DMSnnn DMSxx "
CALL PROCESS " DMSxxx DMSADM DMSBACK DMSCLASS DMSCUT DMSERR "
CALL PROCESS " DMSFORM DMSLIST DMSLISTD DMSN DMSOS DMSPOOL "
CALL PROCESS " DMSPOOLS DMSPROJ DMSREST DMSTABLE DMSUTIL DMSVSAM "
CALL PROCESS " DMXDBD DNAME DOB DOC DOCC DOCID DOCIT DOCLIST DOCS "
CALL PROCESS " DOM'D DOS DOSCMD DOSF DOSRES DOSVSDMP DP DPCMPARE "
CALL PROCESS " DPCX DPM DPPX DPR DPS DPXCTL DQUOTE DRD DRDsxxnn "
CALL PROCESS " DRDA DRDS DREISAM DRESKEEP DRESTORE DROPDUMP DRPAY "
CALL PROCESS " DSnnnn DSA DSAB DSAG DSBCATEG DSBUSERD DSC DSCL DSD "
CALL PROCESS " DSDR DSDUMP DSE DSECT DSERV DSF DSFORM DSINDEX DSK "
CALL PROCESS " DSKxxx DSL DSList DSLIST DSLO DSMGMT DSMPROFS "
CALL PROCESS " DSMUTMSG DSMXMP DSNn DSNCAPEX DSNDELETE DSNHCOB "
CALL PROCESS " DSNHPLI DSNHSPU DSNINDEX DSNTABLE DSNTIAR DSNUPROC "
CALL PROCESS " DSO DSPLTCEL DSQQMFE DSS DSSA DSSFNN DSSFNNMM "
CALL PROCESS " DSSNNNM DSSNNNN DSSREST DSSTAP DSSTNNN DSSXXXXX DSU "
CALL PROCESS " DSUCATLGY DSUTIL DSUTILSQN DSX DTnnnn DTE DTESTCPU "
CALL PROCESS " DTESTPC DTMS DTS DTSFILE DTSUTIL DUADDT DUAL-DEN "
CALL PROCESS " DUDUDU DUMPnn DUMPxx DUMPA DUMPDIR DUMPDS DUMPEND "
CALL PROCESS " DUMPERn DUMPMASTER DUMPON DUMPPACK DUMPQ DUMPSTAT "
CALL PROCESS " DUMPTAP DUPKEY DUPREC DUREL DVA DVC DVCDN DVCUP DVD "
CALL PROCESS " DVG DVGFID DVGFILEI DVGFILEO DVGFIT DVGFOD DVGFOT "
CALL PROCESS " DVGINCLUDE DVH DVL DVM DVR DW DXT DYN DYNAL DYNAM "
CALL PROCESS " DZDDPDC DZS E-Mail Easter Easytrev Easytrieve "
CALL PROCESS " Edison Edward Edwards Effler Eileen Elaine Electret "
CALL PROCESS " Elizabeth Ellen Ellyce End-of-da Enercell Eng "
CALL PROCESS " Enterprise-wide Epd Esmond Esock Esposito Estelle "
CALL PROCESS " Europe European Evans Execucom Exmpl Exten ExSel "
CALL PROCESS " EAN EASYMOVE EASYTREIVE EASYTREV EASYTRIEVE EB "
CALL PROCESS " EBCDIC EBCIDIC EC ECF ECLEV ECLIST ECODEPTR ECPS "
CALL PROCESS " EDATE EDCHEK EDD EDF EDI EDITCHEK EDITISPF EDITMAC "
CALL PROCESS " EDITOL EDITPAGE EDITPR EDITSOPF EDITSOPS EDITXXXX "
CALL PROCESS " EDL EDON EDREC EDS EDSSNNNX EDT EDTGEN EDTGENs EDX "
CALL PROCESS " EE EEEE EEEEEEEEEEEPPPPPPPP EFFECTOR EHSA EIA EIB "
CALL PROCESS " EIS ELEM ELNE ELTERM EM EMER EMERG EMIMS EML EMOD "
CALL PROCESS " EMP EMPLOYEENAME EMPNAME EMU EN ENA ENAMDLCD ENCO "
CALL PROCESS " ENCO's ENCOxx ENDDATA ENDFILE ENDIF ENDJOB ENDMONTH "
CALL PROCESS " ENDO ENDPAGE ENDQTR ENG ENGR ENQ ENQF ENV EOD EOF "
CALL PROCESS " EOS EOTSPACE EOV EP EPA EPIFILE EPLOAD EPS EQU "
CALL PROCESS " EQUALTO EQUFLAG EQUIV ERE EREP ERF ERFC ERG ERISA "
CALL PROCESS " ERN ERNs ERP ERRORLIMIT ES ESA ESADEV ESCON ESDS "
CALL PROCESS " ESHA ESMOND ESOP ESS ESSL ESTAE ESYS ETESTCPU "
CALL PROCESS " ETESTPC ETHS ETSS EUC EUROPE EXAMP EXCPVR EXDC "
CALL PROCESS " EXECUTIL EXEMPTSO EXLST EXP EXPDSN EXPDSNS EXPDT "
CALL PROCESS " EXPDTUSE EXPERMNT EXPRT EXPVOLS EXTABLE EXTWRITE "
CALL PROCESS " Fairfield Falcon Falk Fareed Faynin Feb Filesave "
CALL PROCESS " Finland Finley Fischer Fisher Fixform Flansburg "
CALL PROCESS " Florence Fluor-Daniels Fm Fontana Foregrnd Fortex "
CALL PROCESS " Fortran Fortron Fran France Frances Francisco "
CALL PROCESS " Franklin Fred Fri Fullerton Fwd FA FAC FALC FALCON "
CALL PROCESS " FALCONB FAS FASTCOPY FASTRES FASTREST FAX-AKRON "
CALL PROCESS " FAX-ATLANTA FAX-AUBURN FAX-BAY FAX-BAYPORT "

CALL PROCESS " FAX-BUCKS FAX-BURBANK FAX-CHARLOTTE FAX-CHATHAM "
CALL PROCESS " FAX-CLEAR FAX-CORPUS FAX-COVENTRY FAX-DALLAS "
CALL PROCESS " FAX-EDISON FAX-FAIRFIELD FAX-FLORENCE FAX-GREER "
CALL PROCESS " FAX-HOUSTON FAX-INDIANAPOLIS FAX-IRVING FAX-LONG "
CALL PROCESS " FAX-LOS FAX-MOUNT FAX-NARROWS FAX-NEW FAX-NEWARK "
CALL PROCESS " FAX-PAMPA FAX-PHOENIX FAX-PORTSMOUTH FAX-RANCHO "
CALL PROCESS " FAX-ROCK FAX-SALISBURY FAX-SCHILLER FAX-SHELBY "
CALL PROCESS " FAX-SHORT FAX-SPARTANBURG FAX-SUMMIT FAX-TIGAR "
CALL PROCESS " FAX-WALNUT FAX-WASHINGTON FAX-WEST FAX-WESTLAKE "
CALL PROCESS " FAX-WOODDALE FBA FBADAT FBADEC FBAINT FBALEN FBAS "
CALL PROCESS " FBK FBM FBS FBSA FBSM FC FCL FCOPY FCT FD FDATE "
CALL PROCESS " FDEFLIB FDISK FDM FDMTODO FDR FDRDMP FDRDSF FDRRPT "
CALL PROCESS " FEFORE FEOV FET FETCHABLE FF FFFF FFFFFFFF FFPRINT "
CALL PROCESS " FFT FFTDCA FG FGC FH FHACCT FIBERTST FIBR FIELDNAME "
CALL PROCESS " FILEnn FILEnnn FILEA FILEB FILEC FILECNT FILECONV "
CALL PROCESS " FILECOPY FILEDEF FILELST FILESZ FILETRAN FILPRINT "
CALL PROCESS " FILSZ FINIS FIOA FIPS FIXLI FIXP FIXPI FIXQUOTE "
CALL PROCESS " FIXSCRP FL FLASHTST FLD FLGS FLIST FLOC FLPA "
CALL PROCESS " FLUOR-DANIELS FMID FMIDs FMT FNAM FNCHK FNEND "
CALL PROCESS " FOCDEF FOCEXEC FOCNET FOCSU FOCTEL FOCUSCDB "
CALL PROCESS " FOCUSDUP FOCUSEND FOCUSPDN FOCUSPUP FOCUSTDN "
CALL PROCESS " FOCUSTUP FONTPS FONTSNU FORMCHAR FORMDEF FORMDEFS "
CALL PROCESS " FORTEX FORTHCLG FORTLIB FORTRAN FORTRON FORTX "
CALL PROCESS " FORTXCLG FOUT FP FPARM FPASSES FPS FR FREESPACE "
CALL PROCESS " FRIDEN FRMT FROMADDR FROMADDRESS FROMDEV FROMKEY "
CALL PROCESS " FROMLOC FRU FRV FRVolumes FS FSBROWSE FSEQN FSI "
CALL PROCESS " FSINN FSM FSN FSP FSS FSSDEF FSSNAME FSTOP FTnnFxxx "
CALL PROCESS " FTABLE FTABLES FTAM FTCLOSE FTDDDNNN FTDSSNNN "
CALL PROCESS " FTERASE FTINCL FTOPEN FTP FTPAHC FTPCFO FTPRECV "
CALL PROCESS " FTPSEND FTPSUB FV FWA FYI Gaitrie Galloway Galski "
CALL PROCESS " Garamond Garczynski Gard Garde Garnett Geo George "
CALL PROCESS " Georgia Gerard German Germany Gianneschi Giardina "
CALL PROCESS " Gil Gilbert Gilday Gildea Girardy Gladstone "
CALL PROCESS " Glenford Glenn Glenoaks Gloria Goforth Goldberg "
CALL PROCESS " Gordon Govt Graeme Graf Grambor Greco Greek "
CALL PROCESS " Greenwich Greer Gregorian Gregory Gribben Griffin "
CALL PROCESS " Griswold Grp Gruenling Gwen Gwendolyn GA GAESDA "
CALL PROCESS " GALI GALLARY GAM GB GBnn GBL GCR GCS GCSRECOV GDBS "
CALL PROCESS " GDDM GDF GDG-ALL GDGs GDQF GDR GDS GE GE's GEISCO "
CALL PROCESS " GEISCO's GENACCT GENCD GENCDX GENCYCLE GENER "
CALL PROCESS " GENERATIONDATAGROUP GENJCL GENLIB GENLIBA GENTIME "
CALL PROCESS " GETFILE GETJFCB GETMAIN GETMAINed GETMAINS GETMSG "
CALL PROCESS " GETPARM GETPRM GETRC GFC GLBLZONE GLLOGFL GLREPT "
CALL PROCESS " GLWTR GM GMCRAE GMLDOC GMT GNA GOBACK GONUMBER "
CALL PROCESS " GOODBYE GOSTMT GOSUB GOTO GOVT GP GPAR GPARS GPG "
CALL PROCESS " GPSS GRAF GREDATE GREER GROUPID GROUPNAME "
CALL PROCESS " GRP GRS GSAM GSC GSL GTnn GTF "
CALL PROCESS " GTFIVP GTFPARS GTFTSO GTFVTAM GTX GW-BASIC GWM H-R "
CALL PROCESS " Hal Hank Hany Hardwarea Harmon Harold Harris "
CALL PROCESS " Harrison Hartmann Hathaway Hayes Haynes Headley "
CALL PROCESS " Headly Hebrew Heimsch Hel Helen Henderson Henry "
CALL PROCESS " Herbein Herbel Hercules Hewlett Hewlett-Packard "

CALL PROCESS " Hofer Hoffman Holland Holly Hollywood Hong Houghton "
CALL PROCESS " Houston Howard Hreno Huber Hughes Huhn Hungary "
CALL PROCESS " Huntsman Hz HANDBK HARDCPY HASP HASPnnn HASPxx "
CALL PROCESS " HASPACE HASPCn HASPCKPT HASPPARM HASPPRPU HASPXEQ "


CALL PROCESS " HCF HCLOGO HCPRIO HCPSYS HCPXA HCRC HCSM HD-RELOAD "
CALL PROCESS " HD-UNLOAD HDA HDAM HDC HDDI HDLC HDREFID HDSSNNNX "
CALL PROCESS " HELPPLI HEXIT HEXSHOW HF HFI HI-RISE HIDAM HIPO "
CALL PROCESS " HISAM HISTORYX HJnnnn HLL HLP HMBLIST "

CALL PROCESS " HOT-I HPC HPI HPO HPPLUS HPWORD HRAV HRDCOPY HRE "
CALL PROCESS " HRJE HRP HRPI HRPI-Business HRPI-BUSINESS "
CALL PROCESS " HRPI-Customer HRPI-CUSTOMER HRPI-President "
CALL PROCESS " HRPI-Purchasing HRPI-PRESIDENT HRPI-PURCHASING "
CALL PROCESS " HRPI-Training HRPI-TRAINING HS HSAM HSM HSS HST "
CALL PROCESS " HUBMVS HUM HUNTMAN HUNTSMAN HVAC HY Ilch Illinois "
CALL PROCESS " ImagePlus Inc Ind India Indianapolis Inds Infodata "
CALL PROCESS " Init Innn Int'l Interceptor Intra Iran Iraq Ireland "
CALL PROCESS " Irving Italy Ixx Ixxxxxxx IBB IBM IBM's IBMIN "
CALL PROCESS " IBMMAIL IBMNET IBMPCYT IBMSUPP IC ICA ICAsnn ICCF "
CALL PROCESS " ICD ICEF ICF ICFDEL ICFDIAG ICFDSS ICFEXP ICFLOC "
CALL PROCESS " ICFLOCK ICFREST ICFRU ICFSMF ICFUNLK ICH ICHETEST "
CALL PROCESS " ICKDSF ICOM ICOPY ICP ICQADMIN ICROFGIS ICU "
CALL PROCESS " ICVARXNT IDAM IDATE IDBACKUP IDCAMS IDD IDDU "
CALL PROCESS " IDFSTWPM IDIS IDRC IDRDATA IDSN IDSNXUPD IDTF IDU "
CALL PROCESS " IEAxxx IEAIPSnn IEB IEBCOMPR IEBCOPY IEBDB IEBDG "
CALL PROCESS " IEBEDIT IEBGENER IEBIMAGE IEBPTPCH IEBUPDTE IEC "
CALL PROCESS " IECIEXPL IECUC IEFRDER IEFRDSN IEHDASDR IEHLIST "
CALL PROCESS " IEHMOVE IEHPROGM IEHPROGRM IEIF IEUSERxx IEXEXT "
CALL PROCESS " IEXEXTBL IEXEXTCD IEXFLAG IEXFLAGS IEXFUN IEXUCB "
CALL PROCESS " IEXVIO IFs IFA IFBxxx IFILE IFIX IFPS IFPSSAVE IGES "
CALL PROCESS " IGG IHALIST IHAUCB IIAS IIPS IISVTAM IJOB IJSYSRS "
CALL PROCESS " IJZADOLT IKJ IKJEB IKJEBCY IKJEBMIN IKJEFTSR IL "
CALL PROCESS " ILLINOIS IMAGELIB IMAGEPLUS IMD IMDS IMGDSN IMIMS "
CALL PROCESS " IML IMLed IMMCLOSE IMMED IMS-PSBGEN IMSA IMSAC "
CALL PROCESS " IMSACCUM IMSADF IMSAOMEG IMSBACK IMSBATCH IMSBKOUT "
CALL PROCESS " IMSCOBOL IMSCTL IMSDLI IMSGENS IMSHDRLD IMSHDULD "
CALL PROCESS " IMSHSRLD IMSHSULD IMSID IMSIMAGE IMSIMG IMSLOG "
CALL PROCESS " IMSLOGRC IMSMON IMSPARC IMSPARS IMSPCB IMSPREOR "
CALL PROCESS " IMSPRES IMSRnn IMSRECOV IMSRECV IMSRES IMSSYS IMST "
CALL PROCESS " IMSTARC IMSTEST IMSTOMEG IMSVS IMSX IMSXXXVS INCM "
CALL PROCESS " INCREMEN IND INDD INDEXC INDEXIF INDEXREC INDEXTEST "
CALL PROCESS " INDEXTP INDX INFDS INFMJF INFOnnn INFOCOM "
CALL PROCESS " INFOExpress INFOINDX INFOLIB INFOMVS INFOSCRP INIT "
CALL PROCESS " INITDISK INITI INITIMG INMXPARM INNOV INP INPRIM "
CALL PROCESS " INQ INR INT INT'L INV INVENTRY IO IOA IOCDS IOCDSM "
CALL PROCESS " IOCHECK IOCMDF IOCP IOERR IOF IOFIOF IOFLIST IOFS "
CALL PROCESS " IOFTEST IOGEN IOGENs IOGENOLD IOPCB IORECL IOV IOVX "
CALL PROCESS " IOVXP IP IPA IPCS IPDT IPF IPL IPL'd IPLed IPLing "
CALL PROCESS " IPLs IPLG IPLGVVE IPO IPOEIVP IPORES IPSTART IRA "
CALL PROCESS " IRAxxxI IRB IRLMPROC IRLMPROD IRMA IRPT ISA ISAM "
CALL PROCESS " ISASIZE ISBN ISC ISDN ISER ISG ISO ISP ISP@MSTR "
CALL PROCESS " ISPCMDS ISPEXEC ISPF-EDIT ISPFs ISPFD ISPFILE "
CALL PROCESS " ISPFINDX ISPFPDF ISPFT ISPLINK ISPLIST ISPLLIB "
CALL PROCESS " ISPLOAD ISPLOG ISPPROF ISPRSI ISPSTART ISPTABL "
CALL PROCESS " ISPTASK ISPTLIB ISPTSC ISPTUTOR ISPVM ISR ISRBRO "
CALL PROCESS " ISRCLIB ISRCMDS ISREDIT ISREDRTS ISREORG ISRLCFIL "
CALL PROCESS " ISRLFMPP ISRLOAD ISRLPCPY ISRTSP ISSCO ITR ITSRRC "
CALL PROCESS " IUNIT IVL IVLxxx IVLR IVLRLEN IVLRMA IVLRNAME "
CALL PROCESS " IVLRTG IVLSEND IVLSMMSG IVLSMPRM IVLSP IVLSPACE "
CALL PROCESS " IVLSPALT IVLSPDEN IVLSPFLD IVLSPMA IVLSPNTB IVLSPP "
CALL PROCESS " IVLSPVLN IVLSPVNO IVLSPVOL IVLSVARY IVP IXF IXMAINT "
CALL PROCESS " IXUPDATE IXX Jacobs Jacobsen James Jan Jane Japan "
CALL PROCESS " Japanese Jeff Jeffers Jeffrey Jepson Jernigan Jerry "
CALL PROCESS " Jersey Jim Jo Joan Joaquim Joe John Johnson Jolla "
CALL PROCESS " Jones Jordan Jose Joseph Jr Juan Juarez Judith Judy "
CALL PROCESS " Jul Juliet Julius Jumba Jun Jus Jxxxx JA JACCT JBB "
CALL PROCESS " JCLcontd JCLscan JCLACT JCLARC JCLARCH JCLCOM "
CALL PROCESS " JCLCONTD JCLG JCLGVE JCLIN JCLLIB JCLLIST JCLONLY "
CALL PROCESS " JCLSAFE JCS JCT JDS JDUTY JE JECL JECODE JENTRY JEP "
CALL PROCESS " JESA JESANODE JESDS JESPARMS JFCB JFK JJ JK JMSG "
CALL PROCESS " JNF JNM JNUM JOBDEF JOBLIB JOBLOG JOBN JOBNUM "
CALL PROCESS " JOBPARM JOENUM JOHN JOHNSON JRn JSI JSIRPG JSIRPT "
CALL PROCESS " JSISAVET JSISLCT JSTA JT JTn JTS JULADD JULDATE "
CALL PROCESS " JULDIFF JULIANX JUNKDU JUNKESX JUNKPIC JWK JWKFILE "
CALL PROCESS " Kaiser Kaminski Kanji Karen Karl Karpen Katakana "
CALL PROCESS " Kathy Katie Kaushik Keebler Keich Kelly Kemeny Ken "
CALL PROCESS " Kennedy Kerry Kevin Kilgore Kim Kirkland Kizer "
CALL PROCESS " Kodak Kong Korea Korinna Kristin Krynski Kuper "
CALL PROCESS " Kurtz Kuwait KxxxxxxL KA KARLIS KB KEEPDT KENNEDY "
CALL PROCESS " KEYLEN KEYPLUS KEYPOINT KL KLM KN KNAPSACK KSDS KSL "
CALL PROCESS " KWI KWIC KWJ KY KYBD La Lacko Lajolla Landes Larry "
CALL PROCESS " Larsen Las Laurel Lavin Laye Lazerson LaJolla Lee "
CALL PROCESS " Lees Legent Lehigh Leo Leominster Levine Lewis Liaw "
CALL PROCESS " Lic Lilo Lima Linda Lindner Linehan Lisa Locational "
CALL PROCESS " Lorraine Los Louisiana Lugenbeel Lyall Lynn "
CALL PROCESS " LABELxxx LABELALL LABELPRB LABELPTB LABELSB LABELSX "
CALL PROCESS " LABEXEC LABLIBF LABLPRTB LABNX LABSEQ LAN LANGLVL "
CALL PROCESS " LASTPAGE LASTUSED LAUREL LBASIC LBKG LBRUPDT LBS "
CALL PROCESS " LCAsnn LCFIX LCHTAB LCXsnn LCYAD LDA LDATE LDDSUUUU "
CALL PROCESS " LDDUUUUU LDU LEDG LF LIBDEF LIBDEFs LIBRCIS LIBRCOB "
CALL PROCESS " LIBRLIB LIBSYM LIEBOW LIFO LIM LINECNT LINECT "
CALL PROCESS " LINEDATA LINENO LINKAG LINKLST LINKSTRT LINPUT "
CALL PROCESS " LISTC LISTCRA LISTD LISTDRFM LISTDUMP LISTER "
CALL PROCESS " LISTIDR LISTIO LISTMEM LISTPDS LISTRP LISTV "
CALL PROCESS " LISTVTOC LJnnnn LKED LLA LLC LLL LLMAX LLSET LM "
CALL PROCESS " LMIN LMOD LMODs LMSAD LMSG LMU LNGTH LOA LOADBUF "
CALL PROCESS " LOADERn LOADGO LOADPARM LOCsnn LOCKCP LOCKLP LOCKRS "
CALL PROCESS " LODn LOGDSN LOGFILE LOGICCHG LOGLIST LOGLST LOGMODE "
CALL PROCESS " LOGOTEST LOGTERM LON LOSANGL LOSTLIST LOTSAVE LOTUS "
CALL PROCESS " LPALIB LPAMOD LPAR LPARS LPDA LPO LPRAD LPREC LR "
CALL PROCESS " LRDA LRDB LRDC LRDD LRUY LS LSA LSG LSG-Credit "
CALL PROCESS " LSG-Group LSG-Law LSI LTERM LTEST LTM LTORG LTRAD "
CALL PROCESS " LTWA LU LUs LV LVL M-B-C-H M-B-C-H-R M-LOBBY Mac "
CALL PROCESS " Mack Mackiewicz Maine Maiorelli Maliszewski Maltby "
CALL PROCESS " Manchester Manville Marcia Margaret Maria Marietta "
CALL PROCESS " Marilyn Markners Markowitch Markowitz Martha Martin "
CALL PROCESS " Martowicz Marwick Mary's Maryann Massey Matlock "
CALL PROCESS " Mattes Matthew Maugham Maxwell McFadden McAuto "
CALL PROCESS " McCall McCliment McCullagh McDonald McDonnell "
CALL PROCESS " McGee McMillan McMurtrie McR McRae "
CALL PROCESS " McRitchie Mech Meister Mekjian Merrills Merriman "
CALL PROCESS " Meryl Metonic Metta Mex Mexico Meyers Mgr Michael "
CALL PROCESS " Michelle Mickey Microvax MicroVax MicroVAX MicroVMS "
CALL PROCESS " Midilist Mifflin Mike Milltown Mimi Mink Misc "
CALL PROCESS " Misner Mitch Mitchell Mittel Mktg Mockingbird Modi "
CALL PROCESS " Modrowsky Mohammed Molina Mon Monaco Montrose "
CALL PROCESS " Morelli Morino Morris Morrison MoveCopy Mr Mulhearn "
CALL PROCESS " Mullen Mundy Murphy MxxxxxxL MA MACH MACLIB MACLIST "
CALL PROCESS " MACXXP MAE MAICMS MAILBIN MAILDOC MAILROOM MAINMENU "
CALL PROCESS " MAINSIZE MAINTP MAJNODES MANDMS MANFG MANLAB MANMVS "
CALL PROCESS " MANRLAB MANUAL@@ MANUALSP MANUALX MAPC MAPICS MAPP "
CALL PROCESS " MARCO MARKETGP MARKSTR MAS MASDEF MASPC MASSCOPY "
CALL PROCESS " MASTinit MASTpic MASTuuuu MASTxxxx MASTCAT MASTDMCR "
CALL PROCESS " MASTDMS MASTGSB MASTIN MASTRCVY MATCADD MATCHLIM "
CALL PROCESS " MATSRV MAXCC MAXFLDS MAXLENGTH MAXLITS MAXNAME "
CALL PROCESS " MAXPART MAXRECS MAXUSER MBBCCHH MBR MBRSCS MBS MCAA "
CALL PROCESS " MCAUTO MCRAE MCRITCHIE MCS MD MDS MDT MEH MEM "
CALL PROCESS " MEMNAMES MEMOPREF MEMOPROF MEMSYM MER MERGECOPY "
CALL PROCESS " MERRILL MES MESSAGEX MFG MFI MFM MFORM MFS MFT MHz "
CALL PROCESS " MI MICF MICHIGAN MICR MICROFCH MICSnn MICSxx "
CALL PROCESS " MICSDAIL MICSDS MICSSUB MIDI MIDIDSN MIDILAST "
CALL PROCESS " MIDILIST MIDITL MIDLIST MIH MILIKEN MIPS MISC MKTG "
CALL PROCESS " MKTVOL MLIM MLPA MMDDYYA MMDDYYMMDDYY MMG MMM "
CALL PROCESS " MMXDDXYY MN MNGT MNNXX MNSW MODBLK MODBLKS MODELDCB "
CALL PROCESS " MODELDSC MODELSMF MODEREG MODETAB MODETABI MODI "
CALL PROCESS " MODYYR MON MONs MORGEN MOS MOSFET MOVEBCD MOVEDT "
CALL PROCESS " MOVEFILE MOVEIOPT MOVEOPT MPO MPP MPRIVATL MPS MPSX "
CALL PROCESS " MPX MR MRCS MRJE MRO MRP MRS MRTG MSA MSC MSDS MSE "
CALL PROCESS " MSGA MSGCLASS MSGF MSGIEHnnn MSGLEVEL MSGPRINT "
CALL PROCESS " MSGSS MSGV MSNF MSO MSRJE MSS MSSC MSSE MSSF "
CALL PROCESS " MSTCONS MSTR MSVGP MSWP MTC MTDSSNNN MTHNNnnn "
CALL PROCESS " MTHOLLY MTLOGOFF MTO MULTI-SYSTEM MVC MVI MVLIB "
CALL PROCESS " MVNBCD MVS MVSCAT MVSDLB MVSPA MVSPRD MVSPRDBK "
CALL PROCESS " MVSPRDT MVSPROD MVSREPLY MVSSOFT MVST MVSTxx MVSTA "
CALL PROCESS " MVSTC MVSTCn MVSTCx MVSTL MVSTLx MVSTP MVSTPn "
CALL PROCESS " MVSTPx MVSTPB MVSTPP MVSTST MVSTSTT MVSTVn MVSTVx "
CALL PROCESS " MVSTXn MVSX MVSXnn MVZBCD MWF MXG MXIG MYAPPL "
CALL PROCESS " MYDATA Nancy Natale NaSpa Nbr Neal Neil Ness Netman "
CALL PROCESS " NetView Neubauer Newark Newstate NewJersey Ni-Cd "
CALL PROCESS " Nichols Nijah Nixdorf NnRn NnRr Non-NETWORK Norfolk "
CALL PROCESS " Norway Nov Novick NumLk NumLock NA NAMECOND NAP "
CALL PROCESS " NARECORD NASPA NATLABS NBD NBUF NC NCAPXC NCAPXD "
CALL PROCESS " NCAPXT NCAPXZ NCC NCCF NCCFs NCL NCLISTAH NCLISTB "
CALL PROCESS " NCLTPLIB NCP NCP's NCPnnn NCPs NCPsnn NCPsxx NCPxxx "
CALL PROCESS " NCPATT NCPC NCPCxx NCPH NCPS NCPU NCPUxx NCPUXX "
CALL PROCESS " NCPV NCPVARY NCPXXX NCTE NCTNL NDA NDT NEC NETCHK "
CALL PROCESS " NETCTLB NETCTLF NETCTLP NETCTLT NETDOWN NETF NETMAC "
CALL PROCESS " NETMAN NETMOLD NETMOORE NETNAME NETNOTE NETOFF "
CALL PROCESS " NETPARS NETSOL NETVIEW NETVSSI NETWARN "
CALL PROCESS " NETWORK-related NEVERFIND NEWAPPL NEWARG NEWARK "
CALL PROCESS " NEWCOPY NEWDD NEWGEN NEWLETTER NEWLETTERS NEWLOG "
CALL PROCESS " NEWPDS NEWPOOL NEWTAP NEWVER NEWXMP NEWYORK NF NG "
CALL PROCESS " NIC NIS NIXDORF NIXDORFNJ NJ NJAMG NJE NJEs NJEA "
CALL PROCESS " NJEB NJEDEF NJEG NJEXB NL NLDM NMAX NME NMPF NNNNNK "
CALL PROCESS " NOADV NOBYT NOC NOCAPS NOCATALOG NOCC NOCHECK "
CALL PROCESS " NOCOMP NOCONLIST NODEID NODEIDS NODIRECT NODUMP "
CALL PROCESS " NOEJECT NOEMPTY NOEQUALS NOERASE NOEXEC NOFEOV "
CALL PROCESS " NOFLUSH NOFORCE NOFORCER NOFT NOFUNC NOHEX NOHOLD "
CALL PROCESS " NOINDEX NOJCL NOKEY NOLEV NOLOGLST NOMARK NOMSG "
CALL PROCESS " NON-STA NONDISPL NONLIN NONULL NOP NOPASS NOPAUSE "
CALL PROCESS " NOPC NOPFLOW NOPREVIEW NOPROMPT NOREAL NOREC NOREPL "
CALL PROCESS " NORESEQ NORUN NOS NOSAVE NOSCRATCH NOSPACES "
CALL PROCESS " NOSPELLCHK NOSPIE NOSTAE NOSYMLIST NOTAUTH NOTCAT "
CALL PROCESS " NOTEMAN NOTFND NOTRACE NOTRC NOTRK NOTUSED "
CALL PROCESS " NOVALIDATE NOVERIFY NOWRITE NOXCO NOXCOUNT NOXREF "
CALL PROCESS " NP NPA NPDA NPM NPRO NPSI NPT NRD NRDA NRDC NRE "
CALL PROCESS " NRESTART NRZI NSCRIPT NSCRIPTA NSCRIPTS NSEXIT NSF "
CALL PROCESS " NSL NSS NT NTM NTMRPT NTO NTSC NTXsnn NUC NUCID NUL "
CALL PROCESS " NULLFILE NUMp NUMERAX NUMFDp NUMFDX NUMR NVSAM NXX "
CALL PROCESS " NY NYC NYHG NYSE O'Donnell Oct Ohio Okidata "
CALL PROCESS " Omegamon Onhand Onka Opachinski Orecchio Oscar Ott "
CALL PROCESS " Ottawa Otto OAM OBJ OBJLIB OCx OCB OCCF OCCI "
CALL PROCESS " OCCURED OCL OCR ODATE ODAY OEM OEMUCL "
CALL PROCESS " OFF-------TOUR OFF-------TOUR OFFLOADn OFILE OFLOW "
CALL PROCESS " OGddddAA OGL OGLCHAR OH OI OJ OJnnnn OJNNNN OKMVSTP "
CALL PROCESS " OKNOTCAT OLCG OLDF OLDGEN OLDIDSNX OLDJPARM OLDLOG "
CALL PROCESS " OLDRES OLDTEXT OLDVER OLDXUPD OLPXX OLSSNNN OLSXX "
CALL PROCESS " OLTD OLTEP OM OMEGAMON OMONTH OMS OMSnnn ONs "
CALL PROCESS " ONCEOVER ONLPARM ONLYLIST OODISSY OPddddAA OPC "
CALL PROCESS " OPCOM OPENFILE OPERATNS OPERSEC OPLG OPN OPNDST "
CALL PROCESS " OPRCTL OPS OPSYS OPTCD OPTCDJ OPTLIB ORD ORDBILL "
CALL PROCESS " ORDERNET ORG ORIGLIB OS OSI OSJOB OSPCAT OTTAWA "
CALL PROCESS " OUTDD OUTIN OUTLIM OUTPUTCM OUTPUTX OV OVRCT "
CALL PROCESS " OWNNODE OX OYEAR OZSSDNN Pacific Pacifica Packard "
CALL PROCESS " Paiz Palatino Pampa Panasonic Pansophic Papa "
CALL PROCESS " Paraform Parkinson's Parslow Parti Pasadena "
CALL PROCESS " Pasadenta Pascal Patricia Patrick Paul Payee Payne "
CALL PROCESS " Pbi Pecora Pender Pennsylvania Percival Perra Perry "
CALL PROCESS " Peru Pescatore Peterson Petrolino Petruzzellis "
CALL PROCESS " Petzinger PgDn PgUp Phares Phenoxyn Phil "
CALL PROCESS " Philadelphia Philbrick Philip Philippines Phillips "
CALL PROCESS " Phoenix Pierce Pietrusza Pillsbury Pittsburg "
CALL PROCESS " Pittsburgh Pittson Plainfield Plexiglas Pointe "
CALL PROCESS " Poland Polybenzimidazole Polyethylene Pook "
CALL PROCESS " Portsmouth Portugal PostScript Pressley Prew "
CALL PROCESS " Princeton Printlog PrintNet Procics Prodctl "
CALL PROCESS " Protestant Protestants Puma Purina Pxxxx "
CALL PROCESS " Pyrotronics PACKETY PAGEA PAGEADD PAGEBUILD PAGEDEF "
CALL PROCESS " PAGEDEFs PAGEDEFS PAGENUC PAGEOF PAGERATE PAII PAK "
CALL PROCESS " PAM PANDMS PANELID PANGEN PANVALET PAPERX PARMLIST "
CALL PROCESS " PARMWORK PARMX PASSLIB PASSTRHU PASZ PATsnn PATP "
CALL PROCESS " PAUSExx PAUSEBG PAYBL PAYMAST PBA PBADATA PBADEC "
CALL PROCESS " PBAINT PBALEN PBI-ALL PBIS PBX PCs PCALC PCB PCC "
CALL PROCESS " PCF PCI PCI'S PCINFO PCIRES PCMS PCODEPTR PCOND "
CALL PROCESS " PCOX PCSINIT PCT PCTM PCTRANS PD PDDB PDDBs PDEFLIB "
CALL PROCESS " PDEV PDFB PDLN PDLR PDLT PDLY PDM PDQ PDSs PDSBKCM "
CALL PROCESS " PDSBKRS PDSCOPY PDSDIR PDSFILEL PDSFILEM PDSSNNN "
CALL PROCESS " PDSWORK PDSWORKA PDSWORKS PDT PEMPDATA PEMPLYEE "
CALL PROCESS " PERBS PERF PETROCHE PFT PGF PGJT PGLDDPT PGMINDX "
CALL PROCESS " PGMNEW PGMPARM PGMX PGMXPRM PGMXREF PGP PHARM PHO "
CALL PROCESS " PHOENIX PHR PHV PHVVSAM PID PIF PIGMNT PIMS PIMSG "
CALL PROCESS " PIMSPOLYMER PINX PINXDOIT PIRTXT PIX PK PKED "
CALL PROCESS " PLDDNNN PLI PLIBAT PLICHK PLICK PLICKCL PLICKCLG "
CALL PROCESS " PLICMD PLIDEQ PLIDLI PLIDUMP PLIENQ PLIF PLIM "
CALL PROCESS " PLIMAP PLINCL PLINK PLIREST PLIRETC PLISTRS PLIX "
CALL PROCESS " PLIXC PLIXCG PLIXCL PLIXCLG PLIXCLGP PLIXCLP "
CALL PROCESS " PLIXOPT PLIY PLIYCL PLIZ PLMS PLNE PLNES PLOAD PLPA "
CALL PROCESS " PLQUEUE PLR PLU PMA PMD PMF PMM PMMVSTP PMONITOR "
CALL PROCESS " PMRXXXX PMRXXXY PMS PMTSO PNET PNETNJEx PNETNJEG "
CALL PROCESS " PNUM PO PO# POAQUINO POBJLIB POC POLYESTER POOLDEFS "
CALL PROCESS " POOLIST POOLLIST POOLNAME POOLSTAR POPERCENT "
CALL PROCESS " PORTFOLO POSMAST POTHRES PPC PPD PPDSALES PPHELP "
CALL PROCESS " PPMODE PPN PPOBJ PPOPTION PPPP PPT PQ PQUERY PR "
CALL PROCESS " PR/SM PRn PRCTR PRDCLG PRDEST PRDMP PRDUCC PRDUCL "
CALL PROCESS " PREF PREREORGANIZATION PRG PRGMRR PRIM "
CALL PROCESS " PRIME------TOUR PRIME------TOUR PRINTDEV PRINTDS "
CALL PROCESS " PRINTERn PRINTLOG PRINTRnn PRIOINC PRIOLIM PRIV "
CALL PROCESS " PRLCL PRM PRMODE PRN PROCICS PROCINDX PRODCTL "
CALL PROCESS " PRODDS PRODJCL PRODLIST PRODMVSS PRODVMSP PRODVMXA "
CALL PROCESS " PRODVSE PROFAHC PROFILEV PROFILU PROFL PROJ PROJACS "
CALL PROCESS " PRPQ PRPTEST PRTn PRTDMPed PRTDUMP PRTFMT PRTPDS "
CALL PROCESS " PRTZO PS PSA PSAF PSAFOPTS PSB PSB's PSBgen PSBGEN "
CALL PROCESS " PSDN PSEGLIB PSF PSFAG PSFBK PSFCMI PSFCR PSFGR "
CALL PROCESS " PSFHV PSFKO PSFNCS PSFPL PSFSYM PSFZD PSOUT PSP PSR "
CALL PROCESS " PST PSTHRES PSW PSWD PTF PTR PTRDS PTS PTXTA PTXTP "
CALL PROCESS " PUs PUDEST PULCL PUNn PUNCHP PUR PURCH PURCHDT PUTD "
CALL PROCESS " PUTFILE PVC PVM PVS PVT PW PWR PWRON PWRONRST "
CALL PROCESS " PWRSTA PWRTAPE PWS PX PXS PXXXXXX PXXXXXXX PZDDDNN "
CALL PROCESS " QtePh Quebec QuickRef Quietwriter Quinn QA QAR "
CALL PROCESS " QARCOS QAT QBE QCINVEN QCOUNT QDSSNNN QEND QFY "
CALL PROCESS " QHELP QID QISAM QIT QL QLL QLPU QLU QMF QMFBATCH "
CALL PROCESS " QNAME QRPT QRTP QS QSAM QTAM QTY QUASAR QUE QUIK "
CALL PROCESS " QUINN QW QY Racf Rae Ragno Railcar RailcarSyst "
CALL PROCESS " Rajwant Ralf Ralph Ralston Ramos Rancho Rapifaxed "
CALL PROCESS " Rd Realtime Recoverability Reinput Revisable Rhode "
CALL PROCESS " Richard Richter Rick Rita Rnn Rnnn Rnnnn Roadmap "
CALL PROCESS " Robert Robertson Roethke Roger Rogers Rolodex Romeo "
CALL PROCESS " Ron Rooney Rosemary Rosenberg Roth Rouge Roussel Rt "
CALL PROCESS " Rubics Russell Russian Rutgers Ruth Rutins Rxx "
CALL PROCESS " RxxxxxxL RAC RACF RACFPROCN RACFREST RACFX RAILCAR "
CALL PROCESS " RAS RB RBs RBA RBN RBS RCA RCS RCVBLS RD RDn RDBACK "
CALL PROCESS " RDH RDI RDJFCB RDR RDRn RDRDUMP RDRLIST RDROPSL "
CALL PROCESS " READB READDVAL REALVOLS RECATLG RECCT RECEIVEX "
CALL PROCESS " RECSIZE RECV REFR RELOPER REM REMIT-TO REPEATNX "
CALL PROCESS " REPL REPLID REQID RES-Q RES-Q's RESIGNAT RESLIB "
CALL PROCESS " RESNUC RESP RESPRINT RESQ RESQTXT RESRETPD RESTCMDS "
CALL PROCESS " RETBUFFER RETCODE RETENTAU RETENTPR RETENTPREF "
CALL PROCESS " RETENTXM RETENTXMPT RETEXCLD RETLGTH RETREPTDnnnn "
CALL PROCESS " RETRETPD RETVOLSP RETVOLSPEC REXAMINED REXX RFM RFT "
CALL PROCESS " RFTDCA RGB RGN RHO RISC RISLAND RIW RJ RJE RJEF RKP "
CALL PROCESS " RL RLSE RM RMnnn RMAS RMDS RMEX RMEXENT RMEXEVT "
CALL PROCESS " RMEXT RMF RMFIVP RMFUPDT RMID RML RMLIST RMODE RMS "
CALL PROCESS " RMTnnn RNAME RNAMES RND RNTOPT RNUM ROCF ROE ROFICS "
CALL PROCESS " ROM ROS ROSCOE ROUGE ROUSSEL ROUTCD ROUTECDE "
CALL PROCESS " ROWUSER RPAD RPG RPGLIB RPLIOPT RPLOPT RPQ RPS RPT "
CALL PROCESS " RPTS RPW RRDS RS RSA RSCS RSCSDOWN RSF RSFCNF "
CALL PROCESS " RSFLOG RSR RST RSTALM RSTCRIT RSTDCAT RSU RSVP RT "
CALL PROCESS " RTAM RTG RTM RTME RTMSF RTN RTNxxxx RTRM RUTINS "
CALL PROCESS " RVARY RVWS RX Sabol Saffioti Sagan Salegna "
CALL PROCESS " Salisbury Sandifer Sandoz Sandra Sandusky Sanocki "
CALL PROCESS " Santangelo Sara Sarah Scarano Scg Scharwath Sched "
CALL PROCESS " Scheuerle Schiavino Schiller Schmieding Schoonover "
CALL PROCESS " Scott Seabrook Seamon Seattle Sena Sept Shannon "
CALL PROCESS " Sharon Shelby Shenandoah Shephard Shjarback Sholler "
CALL PROCESS " Sierra Sills Simeon Singapore Singh Skydell "
CALL PROCESS " Smartmodem Smith Softare Softcopy Softswitch "

CALL PROCESS " Sou-tex Soutex Soviet Spain Spartanburg Spd "
CALL PROCESS " Speciality Spg Spotts Sprague Spunbond Sr St "
CALL PROCESS " Stachura Stacy Stanley Stauff Steiert Stephen Steve "
CALL PROCESS " Steven Stevie Stewart Storeroom Storey Storrs "
CALL PROCESS " Streep Strimple Strupczewski Stryker StttLsnn Stu "
CALL PROCESS " Sunnyvale Superabsorbent Supp Swart Sweden "
CALL PROCESS " Switzerland Sxxx Sxxxx Sykes Sym Sysmods Syst "
CALL PROCESS " SysReq Szwarc SAnnnn SAA SAAxxxx SAALIB SAAMSGF "
CALL PROCESS " SADMP SADUMP SAFETY-BSB SAFNFEP SAHCPROD SAM SAMON "
CALL PROCESS " SAMPJCL SAMPNSS SANJOSE SANWET SAR SART SAS SASCOPY "
CALL PROCESS " SASFSP SASGraph SASGRAPH SASMESS SASPROD SAST SASZ "
CALL PROCESS " SAV SAVEAREA SAVELOC SAVESYS SB SBU SC SCnnnn SCCCC "
CALL PROCESS " SCD SCG-VANGUARD SCGGL SCH SCHARWAT SCHDCTL "
CALL PROCESS " SCHEDCHT SCHEDCTL SCHEDJT SCHEDOPC SCHEDQ SCIDS "
CALL PROCESS " SCIEN SCOPY SCOPYNX SCORPIO SCP SCPMSG SCRDAT SCRDT "
CALL PROCESS " SCRIPTFT SCRIPTM SCRIPTPG SCS SCSI SD SDA SDAID "
CALL PROCESS " SDATA SDATE SDB SDF SDLC SDMA SDR'S SDSs SDSF "
CALL PROCESS " SDSSNNN SECAM SECLVL SECP SECUDATA SEG SEGS SENDI "
CALL PROCESS " SENDTEST SEP SEPDS SEQIN SEQLEN SEQTOPDS SEQTOSEQ "
CALL PROCESS " SERIFS SERIN SEROUT SERV SERVOFF SESEAME SESS "
CALL PROCESS " SETABND SETINIT SETLP SETVERB SETVTV SEU SFFFF SFFI "
CALL PROCESS " SGML SGSP SH SHAREOPTIONS SHIFTNX SHOWDATE SHRG "
CALL PROCESS " SHRW SIC SID SIDEA SIDEB SIE SIGENLED SIGP SIMON "
CALL PROCESS " SIND SIO SIOT SIXMONTH SKEY SKIPA SKIPB SKIPREC SLA "
CALL PROCESS " SLCxVS SLCTDSX SLCTLIB SLCTNAME SLCTPDS SLCTPRM "
CALL PROCESS " SLCTTSO SLCTV SLCTVS SLCXV SLCXVS SLCXVSPN SLI SLNE "
CALL PROCESS " SLNES SLR SLSS SLU SLWW SM SMALLINT SMCICS SMFnnALL "
CALL PROCESS " SMFF SMFIN SMFOUT SMFSAMP SMFT SMFXWTR SMITH SMP "
CALL PROCESS " SMPxxxn SMPCSI SMPE SMPECAT SMPEIVP SMPEOEM SMPPTS "
CALL PROCESS " SMPQuery SMPSCDS SMPSTS SMS SMSG SMST SMU SNAsnn "
CALL PROCESS " SNADS SNBU SNI SNODE SNOOPY SNOOPYR SNT SOCS SOFLOW "
CALL PROCESS " SOP SOPA SOPINDX SOPMEMB SOPS SOR SORLIB "
CALL PROCESS " SORT-MESSAGES SORTALT SORTCNTL SORTCODE SORTCR "
CALL PROCESS " SORTEM SORTG SORTIN SORTLIB SORTMSG SORTOUT SORTSVC "
CALL PROCESS " SORTWK SORTWKnn SORTWORK SOS SOURC SOUT SOUTEX "
CALL PROCESS " SPnnnn SPARTANBURG SPC SPF SPFI SPFPC SPFTEST SPG "
CALL PROCESS " SPGD SPGIS SPIE SPLEVEL SPLITJCL SPLITTER SPLITV "
CALL PROCESS " SPM SPOOLn SPOOLDEF SPOOLNUM SPPMTEST SPREC SPTAPE "
CALL PROCESS " SPUFI SPZAP SQ SQEESTR SQL SQLCA SQLCODE SQLERRMC "
CALL PROCESS " SQLERROR SQR SQRT SR SRn SRC SRCHJCL SRCLIST SRL "
CALL PROCESS " SRM SRTEALOC SRTECHGS SRTED SRTEPRES SRTERESV SRTES "
CALL PROCESS " SRTESTAT SSCP SSCPs SSL SSLIB SSN SSP SSPROF SSTABI "
CALL PROCESS " SSW SSWMVS SSWMVST SSWPD SSWRSCS SSX ST STn STnnnn "
CALL PROCESS " STA STABLIZE STAE STAP STAPE STARTNEW STATEM STC "
CALL PROCESS " STDHEAD STDHEADER STDHED STDHEDWS STDHEDX STEPnnn "
CALL PROCESS " STEPCAT STEPLINES Steve STHEAD STHEADLN STHEADPLN "
CALL PROCESS " STHPG STICKONS STO STOPAFT STOPQ STOR STRAPD STRAPE "
CALL PROCESS " STRTAFT STXXX SUBA SUBINIT SUBMITIT SUBON SUBSCRPT "
CALL PROCESS " SUL SUPC SUPD SUPERC SUPMAP SUPPRESSABLE SUPT SUPVR "
CALL PROCESS " SURFANAL SVA SVARY SVCD SVCLIB SVCNODMS SVDICT SVS "
CALL PROCESS " SWNsnn SWPRIM SWSEC SWT Sykes SYMLIST SYN SYSx "
CALL PROCESS " SYSyyddd SYSABNCD SYSABNRC SYSABOUT SYSACT SYSAFF "
CALL PROCESS " SYSAFT SYSBACK SYSBRD SYSBRO SYSCATLG SYSCHG SYSCIN "
CALL PROCESS " SYSCMDRC SYSCOPY SYSCP SYSCTL SYSCTLG SYSDA SYSDATE "
CALL PROCESS " SYSDAYOFM SYSDAYOFW SYSDBOUT SYSDEF SYSDLM SYSDSN "
CALL PROCESS " SYSDVAL SYSENV SYSEVENT SYSEXEC SYSGNOLD SYSHO "
CALL PROCESS " SYSHOUR SYSIBM SYSICMD SYSID SYSINDEX SYSIO SYSISPF "
CALL PROCESS " SYSITEXT SYSJDATE SYSLIB SYSLIN SYSLMOD SYSLOGW "
CALL PROCESS " SYSLST SYSLTERM SYSMAINT SYSMDUMP SYSMINUTE SYSMOD "
CALL PROCESS " SYSMONTH SYSMSG SYSNEST SYSOUx SYSOUT-trapped "
CALL PROCESS " SYSOUTLINEn SYSPARMS SYSPCH SYSPCMD SYSPDS SYSPOST "
CALL PROCESS " SYSPREF SYSPRINT SYSPUNCH SYSRACF SYSRSB SYSSCAN "
CALL PROCESS " SYSSCMD SYSSDATE SYSSECOND SYSSQ SYSSRV SYSSTIME "
CALL PROCESS " SYST SYSTERM SYSTIME SYSTSIN SYSTSOUT SYSTSPRT "
CALL PROCESS " SYSTST SYSUDUMP SYSUID SYSUSAGE SYSVARW SYSWKx "
CALL PROCESS " SYSWKA SYSWKB SYSWKC SYSWKD SYSWKE SYSWKF SYSWKX "
CALL PROCESS " SYSWTER SYSX SYSYEAR T-shirt Taiwan Taker's Talbot "
CALL PROCESS " Tampa Tango Taylor Tbbb Tektronix Telagraf Telex "
CALL PROCESS " Tennessee Teresa Terry Testa Texas Textpack "
CALL PROCESS " Thailand Thhmmss Thomas Thompson Thur Thurlby Thurs "
CALL PROCESS " Tigard Tim Timothy Tnnnn Token-Ring Tom Tomasheski "
CALL PROCESS " Tonn Torrey Tracs Traveletter Troisi Trost Trum "
CALL PROCESS " Tucker Tue Tues Tuyet Tx TABLENAME TACCT TAF TAGDT "
CALL PROCESS " TAND TAPEDUMP TAPEIN TAPEIVP TAPELABEL TAPELIB "
CALL PROCESS " TAPEPOOLN TAPESL TAPETYPE TARPS TAS TAXWK TAXWKXX "
CALL PROCESS " TBADD TBADDs TBBOTTOM TBCLOSE TBCREATing TBCREATE "
CALL PROCESS " TBCREATEd TBDELETE TBDISPL TBDISPL's TBEND TBERASE "
CALL PROCESS " TBEXIST TBGET TBMOD TBOPEN TBOPENed TBOPENing TBPUT "
CALL PROCESS " TBQUERY TBRG TBS TBSARG TBSAVE TBSCAN TBSKIP TBSORT "
CALL PROCESS " TBSORTed TBSTATS TBTOP TBVCLEAR TBWRITE TC TCA TCAM "
CALL PROCESS " TCAPCLA TCAS TCB TCBs TCM TCO TCOMMAND TCP TCS-ACF "
CALL PROCESS " TCT TCTTUA TDA TDAGENERAL TDD TE TECHDS TECHDUM "
CALL PROCESS " TECHPRIM TECHSUPP TECHT TECHV TEL TELEX TELMEM "
CALL PROCESS " TEMPDATA TEMPLYEE TEMPORAR TEMPPO TEMPX TER TERMI "
CALL PROCESS " TESTnn TESTnx TESTxx TESTARCH TESTAUTH TESTBATC "
CALL PROCESS " TESTCn TESTCAT TESTDISKTESTPx TESTDU TESTIMS TESTIT "
CALL PROCESS " TESTLIB TESTOL TESTP TESTPx TESTPROC TESTVMSP "
CALL PROCESS " TESTVMXA TESTVSE TESTX TF TG THISQTR THO THR "
CALL PROCESS " THROUGHT THU THV TIFCONV TIFF TIMETU TIOA TIOCNJOB "
CALL PROCESS " TIOCSTEP TIODDPTR TIOED TIOENTRY TIOEQNAM TIOERLOC "
CALL PROCESS " TIOES TIOPNSRT TIOPPOOL TIOPS TIOPSLOT TIOSJBLB "
CALL PROCESS " TIOSLABL TIOSLTYP TIOSM TIOSV TIOSVERF TIOSVLSR "
CALL PROCESS " TIOSVOLP TIS TJnnnn TJAUTH TLBL TLD TLGNn TLMS "
CALL PROCESS " TLMSx TLMSBLKS TLMSCOMB TLMSCONE TLMSCTAB TLMSDSN "
CALL PROCESS " TLMSII TLMSLIST TLMSRMF TLMSRPT TLMSRPTS TLMSTRKA "
CALL PROCESS " TLMSTRS TLMSTSO TLMSUPDT TLMSUSER TLMSUSR TLMSVCVS "
CALL PROCESS " TLMSX TLMSXOLD TLMSXUPD TLNEn TM TME TMONLINE TMP "
CALL PROCESS " TMPs TMPRDERR TMS TNL TOADDR TOADDRESS TOD TODEV "
CALL PROCESS " TODO TOJnnnn TOKEY TOL TOPROW TOSCnn TOV TOVolumes "
CALL PROCESS " TOVOLUME TPAL TPCONFIG TPF TPHISTRY TPNS TPNSE "
CALL PROCESS " TPRTn TPRTnn TPS TPSEQOP TPX TRA TRACEOFF TRANDESC "
CALL PROCESS " TRANSM TRASNMIT TRDATA TRFR TRK TRKCALC TRMAP "
CALL PROCESS " TRMTnnnn TRS TRTCH TSMCOM TSMDOPTS TSMJCL TSMLINK "
CALL PROCESS " TSMPDFTB TSMPDM TSMPMD TSMSHOW TSMSTART TSMSTOP "
CALL PROCESS " TSMUSRTB TSOs TSOASM TSOB TSOCLIST TSOCONV TSOD "
CALL PROCESS " TSODn TSODnn TSODnx TSODxx TSODA TSOEXEC TSOEXET "
CALL PROCESS " TSOF TSOHELP TSOLABEL TSOMODEL TSOMON TSONAME "
CALL PROCESS " TSONCAT TSOOPT TSOPRO TSOPROC TSOPROF TSORUN "
CALL PROCESS " TSOTSODnx TSOUSER TSOUTIL TSOX TSOXD TSOY TSP "
CALL PROCESS " TSPLIT TSS TSTOCL TSTRCVER TSTUCL TSU TSVSPF TT TTL "
CALL PROCESS " TTR TTTTNNN TTTTTTTMV TTY TUA TVTOCs TW TWA TWX TXT "
CALL PROCESS " TXXXXXXX TY TYMNET TYMNET's TYP TYPEITAL TYPERUN "
CALL PROCESS " TYPESIZE TYPEWGT TYPEWID TYPORG Uneeda Univar Unnn "
CALL PROCESS " Util Uxxx UA UACC UADS UCB UCBID UCBSTND UCBUNTYP "
CALL PROCESS " UCBVR UDMH UHL UHO UHV UID UIN UITILITY UNAL "
CALL PROCESS " UNCATLG UNCOND UNDEFINEDFILE UNDR UNHEXIT "
CALL PROCESS " UNITADDRESS UNITAFF UNIX UNKNWN UNLOCKLP UPC UPD "
CALL PROCESS " UPDAT UPPR UPR UPSI UPV UR USA USASCII USASI USCORE "
CALL PROCESS " USEDT USERCAT USERCATALOG USERCATALOGs USERCODT "
CALL PROCESS " USEREXITS USERSDCF USERSET USP USS USSTABI UT "
CALL PROCESS " UTILLIB UTL UTME UV UVOLID UXXX UXXXX UZxxxxxx Va "
CALL PROCESS " Vanguard Vanness Vax Vectra Vermont Vern Vienna "
CALL PROCESS " Vija Villano Villaruz Vin Vince Virginia Vnnn Vogt "
CALL PROCESS " Vxxxxxx VAH VALPRODD VALTHODS VANGUARD VARYPHY VAX "
CALL PROCESS " VBM VBS VC VCI VCNA VCODE VCTR VD VDATE VDEFINE "
CALL PROCESS " VDELETE VDELETEd VDR VECTRA VEMP VF VGddddAA VGET "
CALL PROCESS " VGETS VHS VI-A VIP VIP# VIPOCAT VIPS VIRT VM VMxxxx "
CALL PROCESS " VMBACKUP VMBACUP VMBLIST VMC VMCDAILY VMF VMFHASM "
CALL PROCESS " VMFLKED VMFVCVS VMGROUP VMMAP VMPPF VMPRF VMS "
CALL PROCESS " VMSPCST VMSPROD VMUTIL VMVSCA VMVSCAT VMVSTST VMXA "
CALL PROCESS " VMXAnn VNAS VNCA VOLCNT VOLDELETE VOLID VOLSEQ "
CALL PROCESS " VOLSPEC VP VPddddAA VPIC VPS VPSPRINT VPSSEP "
CALL PROCESS " VPSSSEPR VPUT VRN VRNs VRU VS-DB VSept VSAMnn "
CALL PROCESS " VSAMxx VSAMxxVSPC VSAMBP VSAMDEF VSAMDLT VSAMTUNE "
CALL PROCESS " VSBASIC VSE VSEPT VSERES VSETAPE VSN VSPC-to-TSO "
CALL PROCESS " VSPCCOPY VSPCDATE VSPCINDX VSPCLIB VSPCLIST VSPCQF "
CALL PROCESS " VSPCQFDT VSPCQFRD VSPCREAD VSPCSEQ VSPCSERI VSPCVn "
CALL PROCESS " VSPCX VSSNE VST VSYSTST VSYSUNUM VTAM VTAM/E VTAMs "
CALL PROCESS " VTAMxx VTAMA VTAMB VTAME VTAMF VTAMG VTAMI VTAMLST "
CALL PROCESS " VTAMPARS VTAMS VTAMX VTELE VTMS VTOC VTOCs VTOCS "
CALL PROCESS " VUT VV VVDS VVDSes VVVVVVVVV VWR VWR's VZERO Waaser "
CALL PROCESS " Walker Walkthrough Walkthroughs Wally Walt Walter "
CALL PROCESS " Washington Wasser Watson Weed-B-Gon Wesley Westlake "
CALL PROCESS " Westwood Whisky Whitely Whse Wilczek Wilkins "
CALL PROCESS " William Williams Wilmington Wilson WordPerfect "
CALL PROCESS " Workflow Worley Worthen Wumpus Wylbur WADS WADSXX "
CALL PROCESS " WARMSTART WATS WHERE-USED WHOGOT WHSE WITHINPAREN "
CALL PROCESS " WORKnn WRAPALL WRD WRIGHT WRITELOG WRITENR WRONGVOL "
CALL PROCESS " WSER WSF WSU WT WTM WTO WTOR X'FF XapfDingbats "
CALL PROCESS " Xedit Xerox Xeroxed Xmas XnAxxxxx Xray XADLIB XAPFK "
CALL PROCESS " XASRES XASTAT XAUTOLOG XCOM XCOUNT XCTL XDAYS XEDIT "
CALL PROCESS " XEQc XF XIV-Lab XMITOBJ XMMAP XMT XRF XS XSANR XT "
CALL PROCESS " XTIME XV-Lab XWTR XXssssss XXEEEEcc XXPCMDS XXRCMDS "
CALL PROCESS " XXXXCYYY XXXXYY XXXYY XXZ Yale Yelton York YDD "
CALL PROCESS " YEAR-TO-DATE YESTRDAY YN YYDDMM YYYYY YZXXXX Zapf "
CALL PROCESS " Zinser Znnn Zulu Zxxx ZAAFREQ ZCMD ZCONT ZCTACT "
CALL PROCESS " ZCTTRUNC ZCTVERB ZD ZDDSUUUU ZDDUUUUU ZDIV ZER ZETA "
CALL PROCESS " ZF ZIn ZIND ZIPLUKUP ZIPST ZIPSTCD ZL ZN ZPLACE "
/*-- ,
...xxx;.ct */
CALL PROCESS " ZPRIM ZPROFAPP ZSEL ZTDSELS ZTDTOP ZTEMPF ZUP ZUSER "
CALL PROCESS " ZVARS ZVERB ZZBR ZZCH ZZCL ZZFO ZZINIT ZZLI ZZLO "
CALL PROCESS " ZZNO ZZPO ZZPV ZZRECV ZZSEND ZZST ZZTERM "
/*********************************************************************/
/* That's all -- now for the return and the PROCESS procedure        */
/*********************************************************************/
   report = "PROPER changed " owords "occurrences of" ,
     cwords "(builtin" twords")"
"LINE_BEFORE .zf = NOTELINE """||began||"--"||TIME('N') report """ "
         ZEDSMSG = "COMPLETED"
         ZEDLMSG = BEGAN||"--"TIME('N') report
         Address "ISPEXEC" "SETMSG  MSG(ISRZ000)"
return 1
PROCESS: procedure expose cwords owords twords;
Address "ISREDIT"
a. = "";
PARSE ARG a.1 a.2 a.3 a.4 a.5 a.6 a.7 a.8 a.9 a.10 ,
          a.11 a.12 a.13 a.14 a.15 a.16 a.17 a.18;
do i = 1 by 1 while a.I \= "";
   twords = twords + 1;
   from = translate(a.i,'abcdefghijklmnopqrstuvwxyz', ,
                        'ABCDEFGHIJKLMNOPQRSTUVWXYZ')
   "change all word  c"""||from||""" """||a.i||""" "
   if rc = 0 then cwords = cwords + 1
   "(OWORDSX) = CHANGE_COUNTS"; owords = owords + owordsx
end
"RESET CHANGE"
return
/*********************************************************************/
/* The following was tried using all words in one large string, but  */
/* appeared to take the same amount of time -- so staying with old.  */
/* DICT had to be built with concatenation, due to 500 clause limit. */
/*********************************************************************/
/* limit = words(dict)                                               */
/* do i = 1 by 1  to limit;                                          */
/*    to = word(dict,1);                                             */
/*    dict = delword(dict,1,1);                                      */
/*    from = translate(to,'abcdefghijklmnopqrstuvwxyz', ,            */
/*                         'ABCDEFGHIJKLMNOPQRSTUVWXYZ')             */
/*    "change all word  c"""||from||""" """||to||""" "               */
/* end                                                               */
/*********************************************************************/
