PROC 0 PRM()
/* THIS CLIST CAN BE USED TO INVOKE MVS/QUICKREF USING THE
/* ISPF LIBDEF FACILITY. THIS CLIST SUPPORTS NESTED
/* MVS/QUICKREF INVOCATIONS AND THE "FAST-PATH" INVOCATION
/* METHOD.
/*
/* IF YOU MODIFY THE ISPF COMMANDS TABLE BY ADDING THE "QW"
/* COMMAND, AND YOU WANT THE QW COMMAND TO INVOKE THIS
/* CLIST, THEN THE ISPF COMMANDS TABLE ENTRY YOU ADD SHOULD
/* LOOK LIKE THIS:
/*
/*   QW   0   SELECT CMD(%QW PRM('&ZPARM') NEWAPPL(QWRF))
/*
IF &SYSISPF ^= ACTIVE THEN DO
  WRITE THIS CLIST MUST BE EXECUTED UNDER ISPF - TRY AGAIN
  EXIT
  END
CONTROL MAIN NOMSG
IF &LENGTH(&STR(&PRM)) < 3 THEN SET &PRM = ''
ISPEXEC LIBDEF ISPPLIB DATASET ID('TECH.QW.V40.PANELS')
ISPEXEC LIBDEF ISPMLIB DATASET ID('TECH.QW.V40.MESSAGES')
ISPEXEC LIBDEF ISPTLIB DATASET ID('TECH.QW.V40.TABLES')
ISPEXEC LIBDEF ISPLLIB DATASET ID('TECH.QW.V40.LINKLIB')
ALLOC F(QWREFDD) DA('TECH.QW.V40.DATABASE') SHR REUS
/*   ALLOC F(QWREFDDU) DA('?????????') SHR REUS    */
/*   ALLOC F(QWPARMS) DA(????????) SHR REUS  <OPTIONAL PARMS */
ISPEXEC SELECT PGM(QWIKREF1) PARM(&PRM)
ISPEXEC LIBDEF ISPPLIB
ISPEXEC LIBDEF ISPMLIB
ISPEXEC LIBDEF ISPTLIB
ISPEXEC LIBDEF ISPLLIB
FREE F(QWREFDD)
FREE F(QWREFDDU)
/*   FREE F(QWPARMS)   */
