//CBCCO PROC INFILE=ROLANDS.C(TEST),      < INPUT ... REQUIRED
//   CRUN=,                               < COMPILER RUNTIME OPTIONS
//   CPARM='OPTFILE(DD:ROLANDS)',         < COMPILER OPTIONS
//   CREGSIZ='4M',                        < COMPILER REGION SIZE
//   LIBPRFX='CEE',                       < PREFIX FOR LIBRARY DSN
//   LNGPRFX='CBC',                       < PREFIX FOR LANGUAGE DSN
//   CLANG='EDCMSGE', <NOT USED IN THIS RELEASE. KEPT FOR COMPATIBILITY
// CXXLANG='CBCMSGE', <NOT USED IN THIS RELEASE. KEPT FOR COMPATIBILITY
// OUTFILE='ROLANDS.LOAD(TEST),DISP=SHR',
//   TUNIT='VIO'                          < UNIT FOR TEMPORARY FILES
//*-------------------------------------------------------------------
//*  COMPILE STEP:
//*-------------------------------------------------------------------
//COMPILE EXEC PGM=CBCDRVR,REGION=&CREGSIZ,
//    PARM=('&CRUN/ &CPARM')
//* LMKLIST CONTAINS THE C-COMPILER
//STEPLIB  DD  DSN=&LIBPRFX..SCEERUN,DISP=SHR
//*        DD  DSN=<THE.C370.COMPILER>,DISP=SHR
//SYSMSGS  DD  DUMMY,DSN=&LNGPRFX..SCBC3MSG(&CLANG),DISP=SHR
//SYSXMSGS DD  DUMMY,DSN=&LNGPRFX..SCBC3MSG(&CXXLANG),DISP=SHR
//SYSIN    DD  DSN=&INFILE,DISP=SHR
//SYSLIN   DD  DSN=&OUTFILE
//*SYSLIN   DD  DSN=&&LOADSET,UNIT=&TUNIT.,
//*             DISP=(MOD,PASS),SPACE=(512,(50,20)),
//*             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSCPRT  DD  SYSOUT=*
//SYSUT1   DD  UNIT=&TUNIT.,SPACE=(32000,(30,30)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//SYSUT4   DD  UNIT=&TUNIT.,SPACE=(32000,(30,30)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//SYSUT5   DD  UNIT=&TUNIT.,SPACE=(32000,(30,30)),
//             DCB=(RECFM=FB,LRECL=3200,BLKSIZE=12800)
//SYSUT6   DD  UNIT=&TUNIT.,SPACE=(32000,(30,30)),
//             DCB=(RECFM=FB,LRECL=3200,BLKSIZE=12800)
//SYSUT7   DD  UNIT=&TUNIT.,SPACE=(32000,(30,30)),
//             DCB=(RECFM=FB,LRECL=3200,BLKSIZE=12800)
//SYSUT8   DD  UNIT=&TUNIT.,SPACE=(32000,(30,30)),
//             DCB=(RECFM=FB,LRECL=3200,BLKSIZE=12800)
//SYSUT9   DD  UNIT=&TUNIT.,SPACE=(32000,(30,30)),
//             DCB=(RECFM=VB,LRECL=137,BLKSIZE=882)
//SYSUT10  DD  SYSOUT=*
//SYSUT14  DD  UNIT=&TUNIT.,SPACE=(32000,(30,30)),
//             DCB=(RECFM=FB,LRECL=3200,BLKSIZE=12800)
//SYSUT15  DD  SYSOUT=*
//ROLANDS  DD  DISP=SHR,DSN=ROLANDS.GZIP390.CNTL(COPTS)
//       PEND
