/*                                                                 rexx
   RXOPCOMM IVP
*/
 v=RXOPCOMM('version')
 if word(v,1)<>'RXOPCOMM' then,
   exit xmsg('Version does not begin with program name:' v,8)
 call xmsg('Version:' v)

 cc=DoIt('init')
 cc=DoIt('wto','Inititialization done for' word(v,1) 'version' subword(v,2))

 wto='Waiting for response or STOP'
 do n=1 to 9999
   cc=DoIt('get',wto)
   wto=''
   if cc<>'' then do
     if cc='STOP' then leave
     cc=DoIt('wto',cc)
     wto='Waiting for response or STOP'
   end
   call syscalls 'ON'
   call time 'E'
   address syscall 'sleep' 2  /* secs  */
   call syscalls 'OFF'
 end
 cc=DoIt('term')
 cc=DoIt('wto','Termination done')

 exit 0

DoIt:
trace off
 if translate(arg(1)''arg(2))<>'GET' then,
   say time() arg(1)','arg(2)','arg(3)
 cc=RXOPCOMM(arg(1),arg(2),arg(3))
 if datatype(cc)='NUM' & cc<>0 then,
   exit xmsg(RXOPCOMM_REASON,8)
 if cc<>'' then say time() 'response:' cc
 return cc
XMsg: if arg(1)<>'' then say time() arg(1);return word(arg(2) 0,1)
