//RXVBIVP1 JOB (1),'RXVSAMBA-IVP-1',
//             CLASS=A,REGION=32M,TIME=NOLIMIT,COND=(5,LT)
//*
//IVP1     EXEC PGM=IKJEFT1B,PARM='RXVBIVP1'  PFX(Z)'  PGM(RXVSAMBT)'
//STEPLIB  DD DISP=SHR,DSN=CBT669.LPALIB
//SYSEXEC  DD DISP=SHR,DSN=CBT669.PP.RXVSAMBA.LIB
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
