//AXBASML  PROC AMEMB=,
//         SRCDSN=ALEX.ASM,                      <--- CHANGE THAT
//         ASMPARM='NODECK,OBJECT,TERM',
//         LNKPARM='XREF,LET,LIST',
//         LOADLIB=ALEX.LOAD,                    <--- CHANGE THAT
//         MAC1=SYS1.MACLIB,
//         MAC2=SYS1.MACLIB,
//         MAC3=SYS1.MACLIB,
//         MAC4=SYS1.MACLIB,
//         LNK1=SYS1.CSSLIB,
//         LNK2=SYS1.CSSLIB
//*-----------------------------------------------
//* ASSEMBLE AND LINKEDIT MOST OF MY STUFF.
//*
//* 08/96 AXB
//*-----------------------------------------------
//A        EXEC PGM=ASMA90,PARM='&ASMPARM',REGION=2M
//SYSLIB   DD   DISP=SHR,DSN=&SRCDSN
//         DD   DISP=SHR,DSN=&MAC1
//         DD   DISP=SHR,DSN=&MAC2
//         DD   DISP=SHR,DSN=&MAC3
//         DD   DISP=SHR,DSN=&MAC4
//SYSUT1   DD   UNIT=SYSDA,SPACE=(CYL,(10,5))
//SYSPUNCH DD   SYSOUT=*,DCB=(LRECL=80,BLKSIZE=23440)
//SYSTERM  DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//SYSLIN   DD   DISP=(,PASS),UNIT=SYSDA,SPACE=(CYL,(5,5)),
//             DCB=(LRECL=80,BLKSIZE=400),DSN=&&LOADSET
//SYSIN    DD   DSN=&SRCDSN(&AMEMB),DISP=SHR
//L        EXEC PGM=IEWL,
//             PARM='&LNKPARM',REGION=2M,COND=(4,LT,A)
//OBJECT   DD   DSN=&&LOADSET,DISP=(OLD,DELETE)
//SYSLIB   DD   DISP=SHR,DSN=&LNK1
//         DD   DISP=SHR,DSN=&LNK2
//SYSLMOD  DD   DISP=SHR,DSN=&LOADLIB
//SYSUT1   DD   UNIT=SYSDA,SPACE=(CYL,(3,2))
//SYSPRINT DD   SYSOUT=*,DCB=(RECFM=FB,BLKSIZE=3509)
//         PEND
