//*
//*-------------------------------------------------------------------
//*    Y2K VOLS TO NORMAL SYSTEM VOLS
//*
//*-------------------------------------------------------------------
//*
//VARY293 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 293,OFFLINE'
//VARY294 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 294,OFFLINE'
//VARY295 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 295,OFFLINE'
//VARY296 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 296,OFFLINE'
//VARY3D2 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 3D2,OFFLINE'
//VARY3D3 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 3D3,OFFLINE'
//VARY3D4 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 3D4,OFFLINE'
//VARY3D5 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 3D5,OFFLINE'
//VARY3D7 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 3D7,OFFLINE'
//VARY282 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 282,OFFLINE'
//VARY283 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 283,OFFLINE'
//VARY284 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 284,OFFLINE'
//VARY285 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 285,OFFLINE'
//VARY286 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 286,OFFLINE'
//VARY287 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 287,OFFLINE'
//VARY288 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 288,OFFLINE'
//VARY289 EXEC PGM=W$$MGCR,PARM='MGCR=VARY 289,OFFLINE'
//*
/*
//INIT     EXEC PGM=ICKDSF
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  REFORMAT UNITADDRESS(293) VERIFY(SPR293) VOLID(SBOS21)
  REFORMAT UNITADDRESS(294) VERIFY(SPR294) VOLID(SBOS22)
  REFORMAT UNITADDRESS(295) VERIFY(SPR295) VOLID(S$OS31)
  REFORMAT UNITADDRESS(296) VERIFY(SPR296) VOLID(SBOS32)
  REFORMAT UNITADDRESS(3D2) VERIFY(SPR3D2) VOLID(S$OS33)
  REFORMAT UNITADDRESS(3D3) VERIFY(SPR3D3) VOLID(PBOE21)
  REFORMAT UNITADDRESS(3D4) VERIFY(SPR3D4) VOLID(P$OE31)
  REFORMAT UNITADDRESS(3D5) VERIFY(SPR3D5) VOLID(P$OE32)
  REFORMAT UNITADDRESS(3D7) VERIFY(SPR3D7) VOLID(P$OE34)
  REFORMAT UNITADDRESS(282) VERIFY(SP3282) VOLID(SBRES1)
  REFORMAT UNITADDRESS(283) VERIFY(SP3283) VOLID(SBOS11)
  REFORMAT UNITADDRESS(284) VERIFY(SP3284) VOLID(S$OS12)
  REFORMAT UNITADDRESS(285) VERIFY(SP3285) VOLID(SBDT01)
  REFORMAT UNITADDRESS(286) VERIFY(SP3286) VOLID(S$DT02)
  REFORMAT UNITADDRESS(287) VERIFY(SP3287) VOLID(SBDT03)
  REFORMAT UNITADDRESS(288) VERIFY(SP3288) VOLID(P$OE03)
  REFORMAT UNITADDRESS(289) VERIFY(SP3289) VOLID(PBDT01)
/*
//*
