*PROCESS SUPRWARN(33)                                         DRK AUG09
DIALOG   TITLE 'P D S  --  ISPF DIALOG DISPLAY CODE'         09/28/88'
*  PDS DIALOG SERVICES                                         SS NOV85
*      LOGICAL LEVELS                                          SS NOV85
*        SERVICES  - REQUESTS FROM PDS                         SS NOV85
*        FUNCTIONS - SECTIONS OF CODE TO PERFORM SERVICES      SS NOV85
*                    EACH FUNCTIONS ROUTES TO NEXT FUNCTION    SS NOV85
*                    VIA ISPROUT                               SS NOV85
*        HI LEVEL  SUBROUTINES - PROVIDE HIGH LEVEL ACTIONS    SS OCT88
*        MED LEVEL SUBROUTINES - PROVIDE MOST COMMON SERVICE   SS OCT88
*        LOW LEVEL SUBROUTINES - ONLY CALL BASE LV SERVICES    SS OCT88
*        BASE LV   SUBROUTINES - PROVIDE PRIMITIVE ACTIONS     SS OCT88
*                               I.E. SPF SERVICE INTERFACE     SS NOV85
*                                                              SS NOV85
*                                                              SS NOV85
         TITLE 'P D S  --  ISPF DIALOG MACROS'
         MACRO
&L       $TL   &TB,&F,&F2,&P,&P2,&F3,&P3                       SS MAY89
         LCLC  &TC                                             SS JUL85
&TC      SETC  '&TB'.' '                                       SS JUL85
&L       DC    CL8'&TC'                        *** TABLE OFFSET
         DC    AL1(&F),AL1(&F2)                *** FLAGS 1 AND 2
         DC    AL1(&P),AL1(&P2)                *** PROC1,PROC2 SS NOV84
         DC    AL1(&F2),AL1(&P3)               *** FLAG2,PROC3 SS MAY89
         MEND
         SPACE 2
         MACRO
&L       $TX   &TB,&F,&F2,&P,&P2,&F3,&P3                       SS MAY89
&L       DC    XL2'&TB',XL6'00'                                SS JUL85
         DC    AL1(&F+#X),AL1(&F2)             *** FLAGS 1 AND 2
         DC    AL1(&P),AL1(&P2)                *** PROC1,PROC2 SS NOV84
         DC    AL1(&F2),AL1(&P3)               *** FLAG2,PROC3 SS MAY89
         MEND
         MACRO
&L       $TD   ,                                               SS AUG85
*  ISPF COMMAND TABLE FLAGS                                    SS NOV84
*  FLAG1                                                       SS NOV84
#X       EQU   X'80'   NOT USED                                SS SEP84
#V       EQU   X'40'   VIEW MODE REQUIRED FOR LINE MODE        SS SEP84
#L       EQU   X'20'   LINE MESSAGE INDEX IN $TLEX2            SS NOV88
#K       EQU   X'10'   DISABLE MEMLIST WITH THIS COMMAND       SS SEP84
#E       EQU   X'08'   END OF TABLE                            SS SEP84
#O       EQU   X'04'   ADD T( FOR REPRO                       ABL JAN87
#S       EQU   X'02'   VALID FOR SOURCE ONLY                   SS SEP84
#U       EQU   X'01'   VALID FOR LOADMOD ONLY                  SS SEP84
*  FLAG2                                                       SS NOV84
#C       EQU   X'80'   $TLEX HAS COMMAND TABLE INDEX           SS NOV85
#P       EQU   X'40'   $TLEX HAS POST PROCESS FUNC CODE        SS NOV84
#R       EQU   X'20'   $TLEX HAS OFFSET TO OFFSET OF REAL CMD  SS NOV84
*                      ALSO USE FIRST CHAR FOR BLOCK REPEAT    SS JUL87
#T       EQU   X'10'   COMMAND LINE FUNC CALL PROVIDED         SS MAR85
*                      LINE COMMAND IS INTERNAL (O RESCAN)     SS NOV85
#D       EQU   X'08'   DO NOT USE FOR REPEATS                  SS NOV84
#M       EQU   X'04'   PERFORM MEMLIST ON MEMBER TO REFR STATS SS NOV84
#2       EQU   X'02'   SUBCOMMAND TURNS OFF VIEW MODE         ABL OCT84
#H       EQU   X'01'   COMMAND ALLOWED FROM O LINE COMMAND    ABL DEC84
* FOLLOWING CODES USED BY SELECT PANEL MODE                    SS NOV84
#A       EQU   X'10'   ACTIVATE RESCAN IN PANEL MODE           SS AUG86
*  NOTE #A AND #T ARE SAME, USE ONLY ONE                       SS AUG86
#Z       EQU   X'08'   USE CONTROL NONDISPL: NO INPUT REQUIRED SS AUG86
         SPACE 1                                               SS SEP84
$TLCM    EQU   0       CMD (VALUE, TABLE OFFSET, EXTENDED OFF) SS NOV84
$TLF1    EQU   8       FLAG1                                   SS MAR85
$TLF2    EQU   9       FLAG2                                   SS NOV84
$TLFU    EQU   10      FUNCTION CODE                           SS NOV84
$TLEX    EQU   11      EXTENDED USE CODE                       SS NOV84
$TLF3    EQU   12      FLAG3                                   SS MAY89
$TLMG    EQU   13      MESSAGE OFFSET (1 BYTES)                SS MAY89
$TLEX2   EQU   13      EXTENDED USE CODE                       SS NOV84
         SPACE 2                                               SS NOV84
         MEND
         SPACE 2
*************************************************************  SS JUL84
*                                                              SS JUL84
*        ADDED SUPPORT OF DIALOG DISPLAY MODE USING            SS JUL84
*        A DIALOG TABLE TO DISPLAY PDS OUTPUT                  SS JUL84
*                                                              SS JUL84
*************************************************************  SS JUL84
         SPACE 2                                               SS JUL84
         COPY  #PDSGEN                                         SS AUG86
         TITLE 'P D S  --  ISPF DIALOG DISPLAY CODE'         09/28/88'
ISPDSPY  CSECT
R0       EQU   0                                               SS JUL85
R1       EQU   1                                               SS JUL85
R2       EQU   2                                               SS JUL85
R3       EQU   3                                               SS JUL85
R4       EQU   4                                               SS JUL85
R5       EQU   5                                               SS JUL85
R6       EQU   6                                               SS JUL85
R7       EQU   7                                               SS JUL85
R8       EQU   8                                               SS JUL85
R9       EQU   9                                               SS JUL85
R10      EQU   10                                              SS JUL85
R11      EQU   11                                              SS JUL85
R12      EQU   12                                              SS JUL85
R13      EQU   13                                              SS JUL85
R14      EQU   14                                              SS JUL85
R15      EQU   15                                              SS JUL85
FF       EQU   255                                            ABL OCT85
         USING *,R8                                            SS JUL84
         USING WORKAREA,R7                                     SS JUL85
         ST    R14,SPFSAV14        SAVE 14                     SS JUL84
         STM   R1,R8,SPFSAV1       SAVE REGS 1-8               SS JUL84
         LR    R8,R15              ENTRY AND BASE IN R8        SS JUL84
         LA    R5,2048(,R8)                                    SS AUG86
         LA    R5,2048(,R5)        SECOND BASE                 SS AUG86
         USING ISPDSPY+4096,R5                                 SS AUG86
         ICM   R6,15,SPFXWRK                                   SS NOV85
         BNZ   ISPXOK                                          SS NOV85
         CLI   SPFLAG1,SPFCLEAN    OPT CLEANUP                 SS AUG86
         BE    ISPEXIT2            YES, NOTHING TO CLEANUP     SS AUG86
         LH    R0,ISPWKLN          GETMAIN LENGTH              SS AUG86
         GETMAIN R,LV=(0)                                      SS AUG86
         LR    R6,R1                                           SS NOV85
         ST    R6,SPFXWRK                                      SS NOV85
         LR    R0,R7                    ANY ADDRESS            SS AUG86
         SR    R1,R1                    ZERO LENGTH            SS AUG86
         LR    R14,R6                   WORK AREA ADDRESS      SS AUG86
         LH    R15,ISPWKLN              WORK AREA LENGTH, PAD  SS AUG86
         MVCL  R14,R0                   CLEAR WORK AREA        SS AUG86
         LA    R1,2048(,R6)             *                      SS MAY88
         LA    R1,2048(,R1)             SECOND 4K              SS MAY88
         ST    R1,SPFSEC4A-SPWRKC(,R6)  SET HANDY POINTER      SS MAY88
         B     ISPXOK                   CONTINUE               SS AUG86
ISPWKLN  DC    AL2(SPWRKCL)        GETMAIN LENGTH              SS AUG86
ISPXOK   DS    0H                                              SS NOV85
         USING SPWRKC,R6                                       SS NOV85
         TM    SPFLAG0,SPFTABLE    FIRST TIME IN               SS JUL84
         BO    ISPOPT              NO, ALL SET                 SS JUL84
         SPACE 3
* INITIALIZE THE DIALOG VARIABLES                              SS JUL84
         L     R4,ISPVINIA         ADDR OF INIT ROUTINE        SS MAR85
         BASR  R3,R4                                           SS MAR85
         SPACE 3                                               SS SEP84
ISPOPT   DS    0H                                              SS NOV84
         TM    SPFLAG4,SPFRST2          FLAG RESTART2          SS AUG86
         BO    ISPREST3                 CONT WHERE LEFT OFF    SS AUG86
*        OI    SPFLAG3,SPFREFR        MAKE SURE OF REFRESH     SS AUG86
*   CONTROL DISPLAY SM DONE BEFORE GOING TO PDSMAIN            SS AUG86
         SR    R15,R15                                         SS NOV84
         IC    R15,SPFLAG1            FUNCTION CODE            SS JUL84
         B     *+4(R15)               FUNCTION BRANCH TABLE    SS JUL84
         B     ISPEXIT                NOP                      SS JUL84
         B     ISPCLN                 CLEAN UP                 SS JUL84
         B     ISPPTGET               PUTGET                   SS JUL84
         B     ISPPUTL                PUTLINE                  SS JUL84
         B     ISPMEML                ADD LINE TO MEMLIST      SS SEP84
         B     ISPPNSUP               PANEL SUPPORT            SS NOV84
         B     ISPICMD                SET UP ISPF CMD          SS MAY88
         B     ISPPN1I                SINGLE PAN DISP INTERFAC SS APR89
         B     ISPSUBTR               SUBLIST = MEMLIST        SS MAY89
         B     ISPEXIT                PAD                      SS MAY89
         SPACE 3
ISPERR   DS    0H                                              SS JUL84
         STM   R0,R15,SPFSVERR    SAVE ERROR REGS              SS OCT88
         LR    R4,R2              SAVE R2 FOR DEBUGGING        SS NOV85
         BAS   R2,ISPUSTKM        UNSTACK                      SS NOV85
         NI    SPFLAG0,255-SPFDON-SPFDSUSP-SPFVIEW            ABL JUN85
         NI    SPFLAG2,0             CLEAR MEMLIST MODE       ABL NOV84
         NI    SPFLAG3,SPFSELV       CLEAR MEMLIST MODE       ABL NOV84
         NI    SPFLAG4,0             CLEAR MEMLIST MODE       ABL JUN85
         DC    X'00'          FORCE 0C1                        SS JUL84
         SPACE 3
ISPCLN   DS    0H                                              SS JUL84
         L     R4,ISPCLNUA              SUBR ADDR              SS OCT88
         BASR  R3,R4                    CALL                   SS OCT88
         L     R0,SPWRKCLV                                     SS DEC87
         LR    R1,R6                                           SS NOV85
         FREEMAIN R,A=(1),LV=(0)                               SS NOV85
         SR    R6,R6                                          ABL FEB86
         ST    R6,SPFXWRK         CLEAR THE WORK AREA POINTER ABL FEB86
         B     ISPEXIT2                                        SS JUL84
SPWRKCLV DC    A(SPWRKCL)               *                      SS DEC87
ISPCLNUA DC    A(ISPCLNUP)        CLEANUP SUBROUTINE           SS OCT88
         TITLE 'P D S  --  ISPF DIALOG ADD LINE TO LOG'
*                                                              SS JUL84
*  ADD ANOTHER DISPLAY LINE                                    SS JUL84
*                                                              SS JUL84
ISPPUTL  DS    0H                                              SS JUL84
         BAS   R2,ISPADDLN                                     SS AUG84
         TM    SPFLAG0,SPFCKER                                 SS SEP84
         BZ    ISPPUTL2                                        SS SEP84
         L     R1,SPFSAV1        RELOAD REGISTER 1            ABL JUN85
         CLI   4+6(R1),C'E'      ERROR TYPE MESSAGE           ABL JUN85
         BNE   ISPPUTL2                                        SS SEP84
         CLC   4+0(3,R1),ISPPDS  "PDS" PREFIX?                ABL JUN84
         BNE   ISPPUTL2          NO, BRANCH                   ABL OCT84
         TM    4+5(R1),X'F0'     NUMERIC?                     ABL JUN84
         BNO   ISPPUTL2          NO, BRANCH                   ABL OCT84
         TM    4+4(R1),X'F0'     NUMERIC?                     ABL JUN84
         BNO   ISPPUTL2          NO, BRANCH                   ABL OCT84
         TM    4+3(R1),X'F0'     NUMERIC?                     ABL JUN84
         BNO   ISPPUTL2          NO, BRANCH                   ABL OCT84
         OI    SPFLAG0,SPFMSGER  FLAG ERROR FOUND              SS SEP84
         MVC   SPFMLIN1(8),4(R1)     SAVE THE ERROR HEADER    ABL JUN85
         MVC   SPFMLIN2(79),SPFLINE  SAVE THE ERROR MESSAGE   ABL JUN85
ISPPUTL2 DS    0H                                              SS SEP84
         L     R14,SPFCKPT       COUNT FROM LAST CKPT         DRK JAN12
*        LH    R14,SPFCKPT       COUNT FROM LAST CKPT          SS JUL84
         LA    R14,1(R14)        ONE MORE ENTRY                SS JUL84
         ST    R14,SPFCKPT       SAVE COUNT                   DRK JAN12
*        STH   R14,SPFCKPT       SAVE COUNT                    SS JUL84
* END COMMMAND IN CHECKPOINT LEAVES SYSPRINT OPEN             DRK JUL20
         CLC   ##SUBCOM(3),=CL3'AMB'     AMBLIST?             DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(3),=CL3'COB'     COBANAL?             DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(3),=CL3'CPK'     CPKMAP?              DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(4),=CL4'DISA'    DISASM?              DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(3),=CL3'DLI'     DLINK?               DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(3),=CL3'LMA'     LMA?                 DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(3),=CL3'LOA'     LOAD?                DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(3),=CL3'MAT'     MATCH?               DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(3),=CL3'MXI'     MXIBATCH?            DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(3),=CL3'OFF'     OFFLOAD?             DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(3),=CL3'PTS'     PTSEXP?              DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         CLC   ##SUBCOM(3),=CL3'VPD'     VPDSE?               DRK JUL20
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20
         C     R14,SPFCCKPT      TIME FOR NEW CKPT             SS OCT88
         BL    ISPEXIT           DONE WITH PUTLINE            ABL OCT84
ISPATCK  DS    0H                CHECK POINT TIME              SS JUL84
         L     R1,SPFSTART        REPOSITION TO HERE           SS JUL84
         S     R1,SPFLAST         CALCULATE RELATIVE POSITION  SS JUL84
         BZ    ISPATCK2           IF ZERO SKIP REPOSITION      SS JUL84
         ST    R1,SPFFIXED        SAVE VALUE                   SS JUL84
         LA    R14,TBSKIP         CONTROLTABLE                 SS JUL84
         LA    R15,SPFTBL                                      SS JUL84
         LA    R0,SPFFIXED                                     SS JUL84
         STM   R14,R0,PARMLIST                                 SS JUL84
         OI    PARMLIST+08,X'80'                               SS JUL84
         LA    R1,PARMLIST                                     SS JUL84
         L     R15,ISPLINK                                     SS JUL84
         BASR  R14,R15                                         SS JUL84
         C     R15,ISPL8                                       SS JUL84
         BH    ISPERR                                          SS JUL84
ISPATCK2 DS    0H                CHECK POINT TIME              SS JUL84
         LA    R1,3              PANEL 3                       SS JUL87
         CH    R1,SPFTBPI        SAME PANEL                    SS JUL87
         BE    ISPATCK3          YES, CONTINUE                 SS JUL87
         BAS   R2,ISPSTKI        NO, STACK IT                  SS JUL87
ISPATCK3 DS    0H                       *                      SS JUL87
         OI    ##ADRPA#,$A+$D     IGNORE ATTENTION NOW         SS JUL84
         LA    R15,100            TBDISPL SUPPORT              SS NOV85
         B     ISPROUT                                         SS NOV85
ISPATCK5 DS    0H                                              SS NOV85
         MVC   SPFMSGID,ISPPDSM       SET UP INVALID MESSAGE  ABL DEC84
         MVI   SPFMSGID+6,C'3'        ADD PANELID             ABL DEC84
         B     ISPATCK2                                        SS NOV85
ISPATCK4 DS    0H                                             ABL DEC84
         BAS   R2,ISPBOTM             REPOSITION FOR NEXT ADD  SS AUG84
         MVC   SPFSTART,SPFTDTOP      NEXT DISPLAY SAME PLACE  SS AUG84
         LA    R14,0                                           SS JUL84
         ST    R14,SPFCKPT        RESET CKPT VALUE            DRK JAN12
*        STH   R14,SPFCKPT        RESET CKPT VALUE             SS JUL84
         L     R14,SPFLAST                                     SS JUL84
         C     R14,SPFCMAX        OVER MAX                     SS OCT88
         BL    ISPEXIT                                         SS JUL84
*            CODE TO DELETE OLD OUTPUT IF OVER TABLE MAX       SS JUL84
         L     R14,SPFCMAX        MAX                          SS OCT88
         LNR   R14,R14            NEGATIVE .. BACKUP VALUE     SS JUL84
         ST    R14,SPFFIXE2       SAVE                         SS JUL84
         A     R14,SPFLAST        CALC DEL AMOUNT              SS JUL84
         ST    R14,SPFFIXED       SAVE                         SS JUL84
         L     R1,SPFSTART                                     SS JUL84
         SR    R1,R14             ADJUST SPFSTART              SS JUL84
         BP    ISPSTOK            NEGATIVE IS THAT LINE DELETE SS JUL84
         LA    R1,1               DISPLAY AT LINE 1            SS JUL84
ISPSTOK  ST    R1,SPFSTART        NEW START LINE VALUE         SS JUL84
         BAS   R2,ISPDEL          POSITION AND DELETE          SS JUL84
         BAS   R2,ISPQUERY        NEW TABLE SIZE               SS JUL84
         B     ISPEXIT                                         SS JUL84
ISPNWCMD DS    0H                                              SS JUL84
         BAS   R2,ISPBOTM             REPOSITION FOR NEXT ADD  SS AUG84
         MVC   SPFSTART,SPFTDTOP      NEXT DISPLAY SAME PLACE  SS AUG84
         MVC   PMEMCURR(4),PMEMMAX   TERMINATE MEMBER LIST    ABL APR85
         NI    FLAGSAA,255-FMEM#MEM  TURN OFF MEMBER RANGE     SS JUL84
         LA    R14,0
         ST    R14,SPFCKPT        RESET CKPT VALUE            DRK JAN12
*        STH   R14,SPFCKPT        RESET CKPT VALUE             SS JUL84
         LM    R1,R8,SPFSAV1                                   SS JUL84
         L     R14,SPFSAV14                                    SS JUL84
         BR    R14                ATT RETURN                   SS JUL84
         TITLE 'P D S  --  ISPF DIALOG PUT GET'
*                                                              SS JUL84
*  DISPLAY OUTPUT FROM LAST CMD .. ASK FOR NEW CMD             SS JUL84
*                                                              SS JUL84
ISPPTGET DS    0H                                              SS JUL84
         LA    R15,172              PUTGET PROCESSOR           SS MAY88
         B     ISPROUT                  *                      SS MAY88
         SPACE 2                        *                      SS MAY88
         TITLE 'P D S  --  ISPF DIALOG SIMPLE FUNCTIONS'
         SPACE 2                                               SS NOV84
*ISPOPTT MOVE TO OWN AREA               *                      SS MAY88
*                                                              SS NOV84
* PANEL MESSAGE SETUP                                          SS NOV84
*                                                              SS NOV84
ISPOPTIV DS    0H                                              SS NOV84
         MVC   SPFMSGID,ISPPDSM   SET UP INVALID MSG           SS NOV84
* THE FOLLOWING INST SHOULD USE A VALUE FROM PANEL TABLE ENTRY SS NOV85
         MVI   SPFMSGID+6,C'1'                                 SS NOV85
ISPOPTI2 DS    0H                                             ABL JAN87
         XC    SPFTCCRP,SPFTCCRP    NOT ON A LINE COMMAND     ABL APR86
         TM    SPFLAG4,SPFFFUN          FROM FUNCTION PROC     SS AUG86
         BZ    ISPOPTI3                 NO, GOTO ERROR PANEL   SS DEC87
         L     R14,ISP$FUNA             POINT TO FUNCTION      SS AUG86
         ST    R14,SPFVTPT              *                      SS AUG86
         LA    R15,16                   FUNCTION PROCESS       SS AUG86
         BR    R3                       *                      SS AUG86
ISPOPTI3 DS    0H                                              SS DEC87
         LA    R0,0                     DEFAULT PANEL          SS OCT88
         LA    R15,168                  ERROR PROMPT           SS DEC87
         B     ISPROUT                  *                      SS DEC87
         SPACE 3                        *                      SS MAY88
*  END IS INVALID REQUEST, REPLY REQUIRED                      SS MAY88
ISPENDIV DS    0H                                             ABL MAR86
         LA    R15,0                ASSUME END IS VALID       ABL FEB87
         CLC   SPFMLIN2(6),ISP381A  PROMPT FOR DATA SET NAME? ABL FEB87
         BER   R3                   YES, BRANCH                SS MAY88
         MVC   SPFMSGID,ISPPDSM   SET UP INVALID MSG          ABL MAR86
         MVI   SPFMSGID+6,C'1'                                ABL MAR86
         MVI   SPFMSGID+7,C'E'    END IS NOT ALLOWED          ABL MAR86
         MVC   SPFTTOP2,SPFTTOP   NO FREEZE/POSITIONING        SS JUL87
         XC    SPFTCCRP,SPFTCCRP  NOT ON A LINE COMMAND       ABL APR86
         LA    R15,100                  *                      SS MAY88
         BR    R3                                              SS MAY88
         SPACE 3                                               SS MAY88
ISPMSGEN DS    0H                                              SS NOV84
         MVC   SPFMSGID,ISPPDSM   SET UP ENTER OPTION MSG      SS NOV84
         MVI   SPFMSGID+6,C'9'                                 SS NOV84
         MVI   SPFMSGID+7,C'E'                                 SS NOV84
         LA    R15,100                  *                      SS MAY88
         BR    R3                       *                      SS MAY88
*        B     ISPDISP4                                        SS MAY88
         SPACE 2                                               SS NOV84
ISPROUT  DS    0H                                              SS SEP85
         LA    R3,*                                            SS SEP85
         L     R4,ISPRTB(R15)                                  SS NOV84
         BR    R4                                              SS SEP85
ISPRTB   DS    0F                                              SS SEP85
* COMMON FUNCTIONS                                             SS NOV84
         DC    A(ISPEND)       0    . END COMMAND              SS NOV84
         DC    A(ISPSUSP)      4    . SUSPEND ISPMODE          SS NOV84
         DC    A(ISPMISC)      8    . MISC FUNCTIONS (KLEAR)   SS AUG86
ISPSORTA DC    A(ISPSORT)     12    . SORT TABLE               SS OCT88
         DC    A(ISPFUNSW)    16    . FUNCTION SWITCH PROCESS  SS AUG86
         DC    A(ISPCMDCC)    20    . CHECK COMMAND CONTINUE   SS AUG86
         DC    A(ISPCMDCK)    24    . CHECK COMMAND            SS NOV84
         DC    A(ISPOPTIV)    28    . OPTION INVALID           SS NOV84
         DC    A(ISPMSGEN)    32    . PROVIDE ENTER OPTIONS    SS NOV84
         DC    A(ISPPEND)     36    . PENDING ACT PROCESSOR    SS AUG86
         DC    A(ISPDISP6)    40    . ISPMODE DISPLAY          SS NOV84
ISPRCALA DC    A(ISPRCAL)     44    . RECALL                   SS NOV84
         DC    A(ISPSETP)     48    . PROCESS O COMMAND        SS NOV84
*                                                              SS NOV84
* MEMLIST ONLY FUNCTIONS                                       SS NOV84
*                                                              SS NOV84
         DC    A(ISPMML)      52    . MEMLIST COMMAND PROC     SS NOV84
         DC    A(ISPOPTI2)    56    . OPTION INVALID PART 2   ABL JAN87
         DC    A(0)           60    . RESERVED                 SS NOV85
         DC    A(ISPLNC2)     64    . MEMLIST LINE CMD PROC    SS NOV84
*                                                              SS AUG86
* PROCESS SPECIAL PDS COMMANDS THAT AFFECT THE MEMLIST TABLE   SS AUG86
*                                                              SS AUG86
         DC    A(ISPCCF)      68    . CHANGE/COMPRESS/FIXPDS   SS AUG86
         DC    A(0)           72    . RESERVED                 SS AUG86
*                                                              SS AUG86
* MEMLIST ONLY FUNCTIONS                                       SS AUG86
*                                                              SS AUG86
         DC    A(0)           76    . RESERVED                 SS AUG86
         DC    A(ISPCKALI)    80    . ALIAS CHECK              SS AUG86
         DC    A(ISPCKAL2)    84    . ALIAS CHECK ADD PROCS    SS AUG86
ISPSUBA  DC    A(ISPSUB)      88    . SUBLIST =MEMLIST        ABL APR86
*                                                              SS NOV84
* MORE COMMON FUNCTIONS                                        SS NOV84
*                                                              SS NOV84
         DC    A(ISPUTL11)    92    . UT1 COMMAND              SS NOV84
         DC    A(ISPFIND)     96    . FIND                     SS NOV84
         DC    A(ISPTBDSP)   100    . COMMON TABLE DISPLAY     SS NOV84
         DC    A(ISPOPTT)    104    . PROCESS OPTION           SS SEP85
         DC    A(ISPREPLY)   108    . RETURN PDS REPLY         SS NOV85
         DC    A(ISPCMDC)    112    . COMMON COMMAND EXIT      SS NOV85
*                                                              SS NOV85
* CHECK POINT PROCESSING                                       SS NOV85
*                                                              SS NOV85
         DC    A(ISPNWCMD)   116    . TERMINATE COMMAND        SS NOV85
         DC    A(ISPATCK4)   120    . CONTINUE COMMAND         SS NOV85
         DC    A(ISPATCK5)   124    . INVALID                  SS NOV85
*                                                              SS NOV84
* MORE COMMON FUNCTIONS                                        SS NOV84
*                                                              SS NOV84
         DC    A(ISPCCF)     128    . CHANGE/COMPRESS/FIXPDS   SS NOV85
         DC    A(ISPUNSTK)   132    . UNSTACK PANEL            SS NOV84
         DC    A(ISPMEMG)    136    . MEMLIST GROUP            SS NOV85
         DC    A(ISPDISPT)   140    . OUTPUT TABLE             SS NOV85
*                                                              SS NOV84
* LISTA/LISTV FUNCTIONS                                        SS NOV84
*                                                              SS NOV84
         DC    A(ISPLISTA)   144    . LISTA NEW/REPEAT         SS NOV84
         DC    A(ISPLISTV)   148    . LISTV NEW/UPDATE         SS NOV85
         DC    A(ISPLAVL)    152    . LISTA/V LINE CMDS        SS NOV85
*                                                              SS NOV84
* MORE COMMON FUNCTIONS                                        SS NOV84
*                                                              SS NOV84
         DC    A(ISPCLXL)    156    . COMMON LINE CMD EXT      SS JUL87
         DC    A(ISPENDIV)   160    . INVALID END MESSAGE      SS AUG86
         DC    A(ISPOPTIV)   164    . UNUSED                   SS MAY88
         DC    A(ISPVERR)    168    . PROMPT FOR INVALID CMD   SS DEC87
         DC    A(ISPPTGT0)   172    . PUTGET PROCESSOR         SS MAY88
         DC    A(ISPLISTC)   176    . LISTC/LISTF FUNCTION     SS OCT88
         DC    A(ISPTCT)     180    . TCT FUNCTION             SS NOV88
         DC    A(ISPTCTAD)   184    . TCT ADD/INSERT LINES     SS NOV88
         DC    A(ISPCAX)     188    . CAX FUNCTION             SS NOV88
ISPVIEWA DC    A(ISPVIEW)    192    . VIEW LOG FUNCTION        SS NOV88
         DC    A(ISPOPTIV)   196    . UNUSED                   SS AUG89
         DC    A(ISPOPTIV)   200    . UNUSED                   SS AUG89
         DC    A(ISPOPTIV)   204    . UNUSED                   SS AUG89
         DC    A(ISPCLZL)    208    . UNUSED                   SS AUG89
         SPACE 2                                               SS NOV84
*   REPLY PROCESSING                                           SS NOV85
ISPREPLY DS    0H                                              SS NOV85
         LA    R1,0                 POP PANEL                  SS NOV85
         BAS   R2,ISPSTKI           UNSTACK                    SS NOV85
         OI    SPFLAG3,SPFLOGM      LOG THE COMMAND            SS NOV85
         LA    R15,112              ROUTE TO ISPCMDC           SS NOV85
         CLC   SPFMLIN2(6),ISP381A  PROMPT FOR DATA SET NAME  ABL APR86
         BE    ISPREP4              YES, BRANCH               ABL APR86
         CLC   SPFMLIN2(5),ISP390A  PROMPT FOR YES/NO ?       ABL JUN86
         BNER  R3                   NO, BRANCH                ABL APR86
         CLI   SPFNAMEH,C'Y'        VALID REPLY?              ABL APR86
         BE    ISPREP4              YES, DO NOT FREEZE        ABL JUN86
         CLI   SPFNAMEH,C'N'        VALID REPLY?              ABL APR86
         BNER  R3                   NO, BRANCH                ABL APR86
ISPREP4  OI    SPFLAG2,SPFNPOS      YES, NO FREEZE/POSITION   ABL APR86
         BR    R3                                              SS NOV85
         SPACE  2                                              SS NOV85
ISPENDTB DS    0H                                              SS NOV85
ISPUNSTK DS    0H                                              SS NOV85
* FUNCTION MOVE TO FUNCTION CMD ROUTINE                        SS NOV85
         SPACE 2                        *                      SS AUG86
*  PROCESS SELECTION FOR PENDING FUNCTIONS                     SS AUG86
ISPPEND  DS    0H                       *                      SS AUG86
         TM    SPFTBPF1,SPFTRET    THIS HAVE RETURN PROCESSING SS NOV85
         BO    ISPPEND2            NO, DISPLAY THIS PANEL      SS AUG86
         TM    SPFTBPF1,SPFTLIN    THIS HAVE LINE CMDS         SS NOV85
         BZ    ISPPEND3            NO, DISPLAY THIS PANEL      SS MAY88
         TM    SPFTFLG1,SPFTLCD    LINE CMD ACTIVE             SS NOV85
         BZ    ISPPEND3            NO, DISPLAY THIS PANEL      SS MAY88
         LH    R15,SPFTBPLF        GET LINE PROC FUNC CODE     SS NOV85
         BR    R3                  RETURN TO ROUTER            SS NOV85
ISPPEND2 DS    0H                                              SS AUG86
         NI    SPFTBPF1,255-SPFTRET  ONLY ONCE                 SS NOV85
         SR    R15,R15                                         SS NOV85
         IC    R15,SPFTPOSI        GET POST PROC INDEX         SS NOV85
         BR    R3                  RETURN TO ROUTER            SS NOV85
ISPPEND3 DS    0H                       *                      SS MAY88
         LA    R15,100             DISPLAY PANELS              SS MAY88
         BR    R3                       *                      SS MAY88
         SPACE 2                                               SS NOV85
*   SET UP END COMMAND AND SAY BYBY     *                      SS AUG86
ISPEND   MVC   PUTGETBF(13),ISPENDIT END COMMAND INTO BUFFER   SS JUL84
         MVC   PMEMCURR(4),PMEMMAX   TERMINATE MEMBER LIST    ABL APR85
         NI    FLAGSAA,255-FMEM#MEM  TURN OFF MEMBER RANGE     SS JUL84
         B     ISPCLN                                          SS JUL84
         SPACE 2                                               SS NOV85
*   SET UP DSN COMMAND AND SET SUSPEND  *                      SS AUG86
ISPSUSP  MVC   PUTGETBF(13),ISPDSNMG DSN COMMAND INTO BUFFER   SS JUL84
         NI    SPFLAG0,255-SPFDON    TURN DIALOG DISPLAY OFF   SS JUL84
         OI    SPFLAG0,SPFDSUSP      SUSPEND BIT ON            SS JUL84
         TM    SPFTBPF2,SPFTREP      REPLY PANEL?             ABL APR86
         BNO   ISPSUSP2              NO, BRANCH               ABL APR86
         LA    R1,0                  POP PANEL                ABL APR86
         BAS   R2,ISPSTKI            UNSTACK                  ABL APR86
ISPSUSP2 DS    0H                                             ABL APR86
         BAS   R2,ISPUSTKM        UNSTACK                      SS NOV85
         LH    R1,SPFFUNLP              SWAP TO LOG            SS AUG86
         LNR   R1,R1                    SWAP INDICATION        SS AUG86
         BAS   R2,ISPSTKI               DO IT                  SS AUG86
         BAS   R2,ISPCTLSM                                     SS MAR85
         B     ISPEXIT                                         SS JUL84
         SPACE 3                                               SS NOV84
*                                                              SS MAR85
*   FORMAT UT1 COMMAND                                         SS MAR85
*                                                              SS MAR85
ISPUTL11 DS    0H                                              SS MAR85
         MVC   PUTGETBF(4),ISPCMD21                            SS MAR85
         MVC   SPFINPUT(8),$UT1   COPY CMD NAME                SS MAR85
*        MVC   SPFINPUT+08(5),ISPUTDOT INSERT LITERAL UT.     ABL FEB86
         TM    $TLF2(R14),#R       IS REAL COMMAND HERE        SS MAR85
         BO    ISPUTL41            YES, USE AFTER UT.          SS MAR85
         LA    R15,$TLCM(R14)      COMMAND NAME                SS JUL85
         B     ISPUTL51            USE IT                      SS MAR85
ISPUTL41 DS    0H                                              SS MAR85
         SR    R15,R15             CLEAR FOR INSERT            SS MAR85
         IC    R15,$TLEX(R14)      GET OFFSET OF REAL CMD      SS MAR85
         LA    R15,ISPREAL(R15)    GET ADDRESS                 SS MAR85
ISPUTL51 DS    0H                                              SS MAR85
         MVC   SPFINPUT+08(4),0(R15) INSERT 4 CHAR OF CMD     ABL FEB86
ISPUTL71 DS    0H                                              SS MAR85
         LA    R15,24              TO CMDCK                    SS NOV85
         B     ISPROUT             USE ROUTER                  SS NOV85
         SPACE 3                                               SS NOV84
*                                                              SS NOV84
*  MEMLIST ADD LINE FUNCTION                                   SS JUL84
*                                                              SS JUL84
ISPMEML  DS    0H                                              SS SEP84
         L     R4,MEMLFUNA        GET MEMLIST SUB              SS NOV85
         BASR  R3,R4                                           SS NOV85
         TM    FLAGSII,FMEMLIST   IF/FIND .. THEN(MEMLIST)?   ABL APR86
         BNO   ISPEXIT            NO, BRANCH                  ABL APR86
         MVI   SPFLAG1,0          TURN OFF FUNCTION           ABL APR86
         L     R8,=V(SUBLIST)     INVOKE                      ABL APR86
         BR    R8                       SUBLIST               ABL APR86
         SPACE 2                                               SS SEP84
*                                                              SS NOV84
*  SUPPORT REQUEST  SELECT PANEL DISPLAY (SUBCOMMANDS UT1,UT2) SS NOV84
*                                                              SS NOV84
ISPPNSUP DS    0H                                              SS NOV84
         MVI   SPFVZCMD,C' '                                   SS NOV84
         MVC   SPFVZCMD+1(249),SPFVZCMD                        SS NOV84
         LH    R15,SPFZLEN        GET LENG                     SS NOV84
         LTR   R15,R15            ZERO                         SS NOV84
         BZ    ISPPNSU3                                        SS NOV84
         BCTR  R15,0              LESS 1 MVC                   SS NOV84
         L     R14,SPFZDATA       PASSED ZCMD DATA             SS NOV84
ISPPNSU4 MVC   SPFVZCMD(0),0(R14)                              SS NOV84
         EX    R15,ISPPNSU4       COPY TO CMD FROM INPUT       SS NOV84
         BAS   R2,ISPFIRST        CHECK FOR ANY REAL DATA      SS NOV84
         LTR   R15,R15            CHECK RETURN ADDRESS/RC      SS MAR85
         BZ    ISPPNSU3           ALL BLANK                    SS MAR85
ISPPNSU2 DS    0H                                              SS NOV84
         OI    SPFLAG4,SPFNOND       INVOKE PANEL NON-DISPLAY  SS AUG85
ISPPNSU3 DS    0H                                              SS NOV84
         BAS   R2,ISPSETVI                                     SS NOV85
         MVC   SPFPANT2(12),SPFPANT  SAVE ISPMODE PAN SUPPORT  SS NOV84
         MVC   SPFPSTK2(8),SPFSAVP2  GET PASSED PANEL NAME     SS AUG85
         MVC   SPFMEMB,SPFSAVM2   GET PASSED MEMBER NAME       SS AUG85
         LA    R1,SPFPSTK2                                     SS NOV84
         ST    R1,SPFPANT                                      SS NOV84
         ST    R1,SPFPANC                                      SS NOV84
         LA    R1,SPFPSTKE                                     SS NOV84
         ST    R1,SPFPANB2                                     SS NOV84
         BAS   R2,ISPPANDI                                     SS NOV85
         MVC   SPFPANT(12),SPFPANT2  RESTORE ISPMODE PAN SUPPO SS NOV84
         LA    R1,SPFZSEL                                      SS NOV84
         ST    R1,SPFSAV1         RETURN DATA                  SS SEP84
         B     ISPEXIT                                         SS SEP84
*                                                              SS APR89
*  SUPPORT REQUEST  SINGLE PANEL DISPLAY                       SS APR89
*                                                              SS APR89
*        SPFZSAVP2 = PANEL NAME         *                      SS APR89
*        SPFZLEN   = LENGTH OF DISPLAY DATA                    SS APR89
*        SPFZDATA  = ADDRESS OF DISPLAY DATA                   SS APR89
*        R1 ON RETURN = ADDRESS OF RETURNED DATA               SS APR89
*        SPFZRC = DISPLAY RETURN CODE   *                      SS APR89
*                                       *                      SS APR89
ISPPN1I  DS    0H                                              SS APR89
         MVI   SPFVZCMD,C' '                                   SS APR89
         MVC   SPFVZCMD+1(249),SPFVZCMD                        SS APR89
         MVI   SPFZSEL,C' '                                    SS APR89
         MVC   SPFZSEL+1(249),SPFZSEL                          SS APR89
         LH    R15,SPFZLEN        GET LENG                     SS APR89
         LTR   R15,R15            ZERO                         SS APR89
         BZ    ISPPN1I3                                        SS APR89
         BCTR  R15,0              LESS 1 MVC                   SS APR89
         L     R14,SPFZDATA       PASSED ZCMD DATA             SS APR89
ISPPN1I4 MVC   SPFZSEL(0),0(R14)                               SS APR89
         EX    R15,ISPPN1I4       COPY TO CMD FROM INPUT       SS APR89
ISPPN1I3 DS    0H                                              SS APR89
         BAS   R2,ISPSETVI                                     SS APR89
         L     R1,SPFZCURO        GET PASSED OFFSET            SS APR89
         ST    R1,SPFCURSO              *                      SS APR89
         MVC   SPFCURNM,ISPPN1I8  SET TO PDSZSEL               SS APR89
         LA    R1,ISPBLK8         NO MESSAGE                   SS APR89
         LA    R15,SPFSAVP2       PANEL NAME                   SS APR89
         BAS   R2,ISPSINGI                                     SS APR89
         ST    R15,SPFZRC               *                      SS APR89
         SR    R1,R1                    *                      SS APR89
         ST    R1,SPFZCURO        RESET CURSOR OFFSET          SS APR89
         LA    R1,SPFZSEL                                      SS APR89
         ST    R1,SPFSAV1         RETURN DATA                  SS APR89
         B     ISPEXIT                                         SS APR89
ISPPN1I8 DC    CL8'PDSZSEL'             *                      SS APR89
*                                                              SS MAY89
*  SUPPORT REQUEST  SUBLIST = MEMBLIST                         SS MAY89
*                                                              SS MAY89
ISPSUBTR DS    0H                       *                      SS MAY89
         L     R0,ISPSUBA               *                      SS MAY89
         BAS   R2,ISPSUBI               *                      SS MAY89
         B     ISPEXIT                  *                      SS MAY89
*                                                              SS NOV84
*  SUPPORT REQUEST  SETUP ISPF CMD TO EXECUTE NEXT FROM PUTGET SS NOV84
*                                                              SS NOV84
ISPICMD  DS    0H                                              SS JUL87
         L     R1,SPFSEC4A         GET  BASE                   SS MAY88
         LA    R1,SPFICMDS-SPFSEC4K(,R1)  POINT TO SPFICMDS    SS MAY88
         MVI   0(R1),C' '         BLANK FIRST                  SS MAY88
         MVC   1(249,R1),0(R1)          RIPPLE                 SS JUL87
         LH    R14,SPFZLEN        GET LENG                     SS JUL87
         LTR   R14,R14            ZERO                         SS JUL87
         BZ    ISPICMD3                                        SS JUL87
         BCTR  R14,0              LESS 1 MVC                   SS JUL87
         L     R15,SPFZDATA       PASSED ZCMD DATA             SS JUL87
ISPICMD4 MVC   0(0,R1),0(R15)     EXECUTED MOVE                SS MAY88
         EX    R14,ISPICMD4       COPY TO CMD FROM INPUT       SS JUL87
         BAS   R2,ISPCKBLK        CHECK FOR ANY REAL DATA      SS JUL87
         LTR   R15,R15            CHECK RETURN ADDRESS/RC      SS JUL87
         BZ    ISPICMD3           ALL BLANK                    SS JUL87
         OI    SPFLAG5,SPFICMD    FLAG FOR ACTION              SS JUL87
ISPICMD3 DS    0H                       *                      SS JUL87
         B     ISPEXIT                  *                      SS JUL87
         TITLE 'P D S  --  ISPF DIALOG LV2 SUBROUTINES'
         COPY  @DIAORG                  *                      SS OCT88
*                                                              SS JUL84
*    INTERFACE TO RESTART2                                     SS AUG86
*                                                              SS JUL84
ISPREST2 DS    0H                       *                      SS AUG86
         STM   R2,R4,SPFRS2SV           SAVE REGISTER FOR RTN  SS AUG86
         OI    SPFLAG4,SPFRST2          FLAG RESTART2          SS AUG86
         B     RESTART2                 UPDATE DSN             SS AUG86
*  AT RETURN AT ISPOPT, FLAG WILL CAUSE BRANCH TO HERE         SS AUG86
ISPREST3 DS    0H                                              SS AUG86
         LM    R2,R4,SPFRS2SV           SAVE REGISTER FOR RTN  SS AUG86
         NI    SPFLAG4,255-SPFRST2      RESET FLAG             SS AUG86
         BR    R2                       GO BACK TO CALLER      SS AUG86
* ISPLINK INTERFACE SUBROUTINES                                SS AUG86
ISPSXEQ  DS    0H                                              SS JUL87
         LA    R1,PARMLIST                                     SS JUL87
         L     R15,ISPLINK                                     SS JUL87
         BR    R15                                             SS JUL87
ISPSXEQ0 DS    0H                                              SS MAR85
         LA    R1,PARMLIST                                     SS JUL84
         L     R15,ISPLINK                                     SS JUL84
         BASR  R14,R15                                         SS JUL84
         LTR   R15,R15                                         SS JUL84
         BNZ   ISPERR                                          SS JUL84
         BR    R2                                              SS SEP84
ISPSXEQ8 DS    0H                                              SS MAR85
         LA    R1,PARMLIST                                     SS JUL84
         L     R15,ISPLINK                                     SS JUL84
         BASR  R14,R15                                         SS JUL84
         C     R15,ISPL8                                       SS JUL84
         BH    ISPERR                                          SS JUL84
         BR    R2                 RETURN                       SS JUL84
         SPACE 1                                              ABL SEP84
*                                                              SS JUL84
*  VDEFINE SUPPORT SUBROUTINE: BEFORE ENTRY SET:               SS JUL84
*  R14=ADDR OF VARIABLE NAME                                   SS JUL84
*  R15=ADDR OF VARIABLE                                        SS JUL84
*  R1 =ADDR OF VARIABLE LENGTH                                 SS JUL84
*                                                              SS JUL84
ISPVDEF  DS    0H                                              SS SEP84
         LA    R0,ISPCHAR                                      SS SEP84
         STM   R14,R1,PARMLIST+4                               SS JUL84
         OI    PARMLIST+16,X'80'                               SS JUL84
         LA    R14,VDEFINE         START VDEFINES              SS JUL84
         ST    R14,PARMLIST                                    SS JUL84
         B     ISPSXEQ0                                        SS MAR85
         SPACE 2                                               SS SEP84
*  VDEFINE EXTENDED SUPPORT
*  R1 ADDR OF A DEFINE  CNTL AND LIST AS FOLLOWS               SS NOV85
*  CNTL BYTE OFFSET, HALF WORD                                 SS NOV85
*  CNTL BIT  (BIT WITHIN BYTE)                                 SS NOV85
*  OPTION BYTE                                                 SS AUG86
*       X'80'    NUMERIC VARIABLE       *                      SS AUG86
*       X'01'    VARIABLE IN #MDSECT (WORKAREA)                SS AUG86
*  REPEATED ENTRIES AS FOLLOWS:                                SS NOV85
* ADDR OF VARIABLE NAME OR NAME LIST , FULL WORD               SS NOV85
* OFFSET TO STORAGE FOR VARIABLE(S)  , HALF WORD               SS NOV85
* LENGTH OF THE VARIABLE             , HALF WORD               SS NOV85
* X'FF' TO END LIST                                            SS NOV85
*                                                              SS AUG86
*   CURRENT CONTROL BIT ASSIGNMENTS                            SS AUG86
*   OFFSET,HEX   ASSIGNMENT                                    SS AUG86
*        0,80    DIALOG INITIALIZATION                         SS AUG86
*        0,40    DISPLAY PANEL SUPPORT INIT                    SS AUG86
*        0,20    MEMLIST SUPPORT                               SS AUG86
*        0,10    LISTA SUPPORT                                 SS AUG86
*        0,08    LISTV SUPPORT                                 SS AUG86
*        0,04    SECONDARY DIALOG INIT (#MDSECT AREA)          SS AUG86
*        0,02    LISTC/LISTF SUPPORT                           SS OCT88
*        0,01    TCT SUPPORT                                   SS OCT88
*        1,80    CAX SUPPORT                                   SS OCT88
*        1,40    FILTER SUPPORT                                SS OCT88
*        1,20    CSECT  SUPPORT                                SS OCT88
*        1,10    TRAP   SUPPORT                                SS NOV88
*                                       *                      SS AUG86
ISPVDEFX DS    0H                                              SS NOV85
         LH    R14,0(R1)           GET CNTL BYTE OFFSET        SS NOV85
         LA    R14,SPFVFLGS(R14)   CALC ADDR OF CNTL BYTE      SS NOV85
         IC    R15,2(R1)           GET CNTL BIT                SS NOV85
         EX    R15,ISPVTM          IS BIT ALREADY SET          SS NOV85
         BOR   R2                  YES SKIP IT                 SS NOV85
         EX    R15,ISPVOI          SET THE BIT                 SS NOV85
         MVC   SPFTSVX(1),3(R1)    SAVE OPTION BYTE            SS AUG86
         LA    R14,VDEFINE         START VDEFINES              SS NOV85
         ST    R14,PARMLIST                                    SS NOV85
         TM    SPFTSVX,X'80'       NUMERIC                     SS AUG86
         BZ    ISPVDEFC            NO                          SS AUG86
         LA    R15,ISPFIX               *                      SS AUG86
         B     ISPVDEF2                 *                      SS AUG86
ISPVDEFC DS    0H                       *                      SS AUG86
         LA    R15,ISPCHAR         THIS ROUTINE ONLY FOR CHAR  SS NOV85
ISPVDEF2 DS    0H                       *                      SS AUG86
         LA    R0,PARMLIST+20      WHERE LENGTH IS STORED      SS NOV85
         STM   R15,R0,PARMLIST+12                              SS NOV85
         LA    R1,4(R1)            FIRST ENTRY IN LIST         SS NOV85
ISPVLOOP DS    0H                                              SS NOV85
         CLI   0(R1),X'FF'         END OF LIST                 SS NOV85
         BER   R2                  ALL DONE                    SS NOV85
         MVC   PARMLIST+4(4),0(R1) COPY VAR NAME ADDR          SS NOV85
         LH    R14,4(R1)           GET OFFSET                  SS NOV85
         TM    SPFTSVX,X'01'       IN WORKAREA                 SS AUG86
         BZ    ISPVDEF3                 *                      SS AUG86
         LA    R14,WORKAREA(R14)   CALC ADDR                   SS AUG86
         B     ISPVDEF4                 *                      SS AUG86
ISPVDEF3 DS    0H                       *                      SS AUG86
         LA    R14,SPWRKC(R14)     CALC ADDR                   SS NOV85
ISPVDEF4 DS    0H                       *                      SS AUG86
         ST    R14,PARMLIST+8                                  SS NOV85
         LH    R0,6(R1)            GET LENGTH                  SS NOV85
         TM    SPFTSVX,X'80'       NUMERIC                     SS AUG86
         BZ    *+8                 NO                          SS AUG86
         LA    R0,4                SET TO 4                    SS AUG86
         ST    R0,PARMLIST+20      PUT LENGTH HERE             SS NOV85
         OI    PARMLIST+16,X'80'                               SS NOV85
         ST    R1,PARMLIST+24      SAVE R1                     SS NOV85
         LA    R1,PARMLIST                                     SS JUL84
         L     R15,ISPLINK                                     SS JUL84
         BASR  R14,R15                                         SS JUL84
         LTR   R15,R15                                         SS JUL84
         BNZ   ISPERR                                          SS JUL84
         L     R1,PARMLIST+24      RESTORE R1                  SS NOV85
         LA    R1,8(,R1)           NEXT ENTRY                  SS NOV85
         B     ISPVLOOP                                        SS NOV85
ISPVTM   TM    0(R14),0            <<EXECUTED>>                SS NOV85
ISPVOI   OI    0(R14),0            <<EXECUTED>>                SS NOV85
         SPACE 2                                               SS SEP84
*            CODE TO POSITION TO FIRST NON BLANK IN INPUT      SS JUL84
ISPFIRST DS    0H                                              SS SEP84
         LA    R15,SPFVZCMD           START OF ZCMD            SS NOV84
         LA    R14,48                 INPUT SIZE               SS JUL84
ISPCKBLK CLI   0(R15),C' '            BLANK                    SS JUL84
         BNE   ISPNONBL                                        SS JUL84
         LA    R15,1(,R15)            NEXT CHAR                SS JUL84
         BCT   R14,ISPCKBLK                                    SS JUL84
         SR    R15,R15                ERROR                    SS JUL84
         BR    R2                                             DRK JAN13
ISPNONBL DS    0H                                              SS JUL84
         CLI   0(R15),0               NULL CHAR                SS AUG86
         BNER  R2                     NO, REAL FIRST NONBLK    SS AUG86
         SR    R15,R15                END OF DATA              SS AUG86
         BR    R2                                              SS SEP84
         SPACE 2                                               SS SEP84
*            CODE TO POSITION DATA AFTER PERIOD                SS NOV84
ISPSHCMD DS    0H                                              SS NOV84
         LA    R15,SPFVZCMD           START OF ZCMD            SS NOV84
         LA    R14,240                INPUT SIZE               SS OCT88
ISPSHBLK CLI   0(R15),C' '            BLANK                    SS NOV84
         BNE   ISPSHBL2                                        SS NOV84
         LA    R15,1(,R15)            NEXT CHAR                SS NOV84
         BCT   R14,ISPSHBLK                                    SS NOV84
         SR    R15,R15                ERROR                    SS NOV84
         BR    R2                                             ABL JAN87
ISPSHBL2 CLI   0(R15),C' '            BLANK                    SS NOV84
         BE    ISPSHBL3                                        SS NOV84
         CLI   0(R15),C'.'            PERIOD                   SS NOV84
         BE    ISPSHPRD                                        SS NOV84
         LA    R15,1(,R15)            NEXT CHAR                SS NOV84
         BCT   R14,ISPSHBL2                                    SS NOV84
ISPSHBL3 DS    0H                                              SS NOV84
         MVI   SPFVZCMD,C' '          BLANK                    SS NOV84
         MVC   SPFVZCMD+1(249),SPFVZCMD  RIPPLE                SS NOV84
         BR    R2                                              SS NOV84
ISPSHPRD DS    0H                                              SS NOV84
         LA    R15,1(,R15)                                     SS NOV84
         LA    R1,SPFVZCMD+250                                 SS NOV84
         SR    R1,R15                                          SS NOV84
ISPSHR2  MVC   SPFVZCMD(0),0(R15)     SHIFT BACK               SS NOV84
         EX    R1,ISPSHR2                                      SS NOV84
         LA    R15,SPFVZCMD(R1)                                SS NOV84
         LA    R1,SPFVZCMD+250                                 SS NOV84
         SR    R1,R15                                          SS NOV84
         MVI   0(R15),C' '                                     SS NOV84
         BCTR  R1,0                                            SS NOV84
         BCTR  R1,0                                            SS NOV84
ISPSHR3  MVC   1(0,R15),0(R15)                                 SS NOV84
         EX    R1,ISPSHR3                                      SS NOV84
         BR    R2                                              SS SEP84
         SPACE 2                                               SS SEP84
*  CODE TO FIND CHAR MATCH                                     SS MAR85
ISPCLI   DS    0H                                              SS MAR85
ISPCLILP EX    R1,ISPCLI0         USE CHAR IN R1 FOR COMPARE   SS MAR85
         BER   R2                 DONE IF EQU .. RETURN        SS MAR85
         LA    R15,1(,R15)        NEXT CHAR                    SS MAR85
         BCT   R14,ISPCLILP       CHARS LEFT COUNT DOWN        SS MAR85
         SR    R15,R15            RETURN 0 IF NONE FOUND       SS MAR85
         BR    R2                                              SS MAR85
ISPCLI0  CLI   0(R15),0           <<EXECUTED>>                 SS MAR85
         SPACE 2                                               SS MAR85
*  CODE TO FIND CHAR MATCH WORKING BACKWARD                    SS MAR85
ISPCLIB  DS    0H                                              SS MAR85
ISPCLIL2 EX    R1,ISPCLI0         USE CHAR IN R1 FOR COMPARE   SS MAR85
         BER   R2                 DONE IF EQU .. RETURN        SS MAR85
         BCTR  R15,0              NEXT CHAR BACK               SS MAR85
         BCT   R14,ISPCLIL2       CHARS LEFT COUNT DOWN        SS MAR85
         SR    R15,R15            RETURN 0 IF NONE FOUND       SS MAR85
         BR    R2                                              SS MAR85
         SPACE 2                                               SS MAR85
*                                       *                      SS AUG86
*  SET CURRENT FUNCTION STATUS          *                      SS AUG86
*       REGISTERS ON RETURN             *                      SS AUG86
*         R1  FUNCTION INDEX            *                      SS AUG86
*         R14 ADDRESS OF LAST PANEL     *                      SS AUG86
*         R15 ADDRESS OF STATUS FLAG  (I.E. I, A, P)           SS AUG86
*                                       *                      SS AUG86
ISPSETST DS    0H                       *                      SS AUG86
* HIERARCHICAL SUPPORT REMOVED                                 SS OCT88
         LH    R1,SPFTBPFI              FUNCTION INDEX         SS AUG86
         LA    R15,SPFFUNST(R1)         ADDRESS OF FLAG        SS AUG86
         MVI   0(R15),C'I'              ASSUME INACTIVE        SS AUG86
         TM    SPFTFLG1,SPFTACT         ACTIVE TABLE           SS AUG86
         BZR   R2                       NO, DONE               SS AUG86
         LA    R14,0(R1,R1)             INDEX TIMES TWO        SS AUG86
         LA    R14,SPFFUNLP(R14)        LAST PANEL ENTRY       SS AUG86
         MVC   0(2,R14),SPFTBPI         COPY PANEL INDEX       SS AUG86
         MVC   SPFTPANL(2),SPFTBPI      ALSO SAVE HERE         SS OCT88
         MVI   0(R15),C'A'              ASSUME ACTIVE          SS AUG86
         TM    SPFTFLG1,SPFTLCD         LINE CMDS ACTIVE       SS AUG86
         BZR   R2                       NO, DONE               SS AUG86
         MVI   0(R15),C'P'              SET PENDING            SS AUG86
         BR    R2                       DONE                   SS AUG86
         SPACE 2                        *                      SS AUG86
ISPCREF  DS    0H                                              SS NOV84
* CONTROL DISPLAY SESSION MGR  (REFRESH)                       SS MAR85
ISPCTLSM DS    0H                                              SS AUG85
*        BR    R2                         ***TEST             ABL JAN87
         LA    R14,ISPCNTL                FIRST PARAMETER      SS AUG86
         LA    R15,ISPDSP                 SECOND PARAMETER     SS AUG86
         LA    R0,ISPSM                   THIRD PARAMETER      SS AUG86
         LA    R1,=F'1'                   FOURTH PARAMETER     SS AUG86
         TM    SPFDEFT1,SPFDSM1         DEFAULT  SM LINE 1     SS AUG86
         BO    *+8                      YES, SKIP              SS AUG86
         LA    R1,=F'0'                 ISPF DEFAULT (BOT -3) DRK JAN13
         STM   R14,R1,PARMLIST            SAVE ADDRESSES       SS AUG86
         OI    PARMLIST+12,X'80'          LAST                ABL SEP84
         LA    R1,PARMLIST                    PARAMETER       ABL SEP84
         L     R15,ISPLINK                                    ABL SEP84
         BASR  R14,R15                    LET SPF KNOW        ABL SEP84
         LTR   R15,R15                                         SS JUL84
         BNZ   ISPERR                                          SS JUL84
         NI    SPFLAG3,255-SPFREFR                             SS NOV84
         BR    R2                                              SS NOV84
         SPACE 2                                               SS SEP84
* RECORD TCTLIN AND TCTLOUT COUNTS                            ABL JAN87
REFSAVE  L     R1,CVTPTR(,R0)                                 ABL JAN87
         L     R1,0(,R1)                                      ABL JAN87
         L     R1,0(,R1)                                      ABL JAN87
         L     R1,X'A4'(,R1)        TCT ON EXIT TO PDS        ABL JAN87
         ICM   R0,B'1111',48(R1)    TCTLIN  -- LINES IN       ABL JAN87
         ST    R0,LSTTCTI                                     ABL JAN87
         ICM   R1,B'1111',52(R1)    TCTLOUT -- LINES OUT      ABL JAN87
         ST    R1,LSTTCTO                                     ABL JAN87
         BR    R2                                             ABL JAN87
         SPACE 2                                              ABL JAN87
* RECORD TCTLIN AND TCTLOUT COUNTS                            ABL JAN87
*        AND PERFORM A CONDITIONAL REFRESH                    ABL JAN87
REFCHECK L     R1,CVTPTR(,R0)                                 ABL JAN87
         L     R1,0(,R1)                                      ABL JAN87
         L     R1,0(,R1)                                      ABL JAN87
         L     R1,X'A4'(,R1)        CURRENT TCT               ABL JAN87
         ICM   R0,B'1111',48(R1)    TCTLIN  -- LINES IN       ABL JAN87
**NOSAVE ST    R0,CURTCTI                                     ABL JAN87
         ICM   R1,B'1111',52(R1)    TCTLOUT -- LINES OUT      ABL JAN87
**NOSAVE ST    R1,CURTCTO                                     ABL JAN87
         C     R0,LSTTCTI           ANY PROMPTING?            ABL JAN87
         BNE   ISPCREF2             YES, CONTROL REFRESH      ABL JAN87
         C     R1,LSTTCTO           ANY TPUTS?                ABL JAN87
         BER   R2                   NO, RETURN                ABL JAN87
         SPACE 2                                              DRK JUN98
*                                                             DRK JUN98
*  DEVICE NUMBER LIST SEARCH SUBROUTINE:  BEFORE ENTRY SET:   DRK JUN98
*  R15=ADDRESS OF UCBNAME FROM UCBDEVN (4DIGIT EBCDIC)        DRK JUN98
*                                                             DRK JUN98
DEVNLIST DS    0H                                             DRK JUN98
         L     R1,DEVLISTP              DEVICE NUMBER LIST    DRK JUN98
         L     R14,4(,R1)               COUNT OF ENTRIES      DRK JUN98
         C     R14,=F'0'                EMPTY LIST?           DRK JUN98
         BE    DEVNEND                  YES                   DRK JUN98
         LA    R1,8(,R1)                NO, PT AFTER HEADER   DRK JUN98
DEVNLOOP DS    0H                                             DRK JUN98
         CLI   0(R1),C' '               3DIGIT UCB NAME?      DRK JUN98
         BNE   *+8                      NO                    DRK JUN98
         MVI   0(R1),C'0'               YES, THEN ZERO FILL   DRK JUN98
         CLC   0(4,R15),0(R1)           DEVNO MATCH IN ARRAY? DRK JUN98
         BE    DEVNOK                   YES                   DRK JUN98
         LA    R1,4(,R1)                NO, LOOK AT NEXT      DRK JUN98
         BCT   R14,DEVNLOOP             LOOP                  DRK JUN98
         LA    R15,4                    NO HIT, SET RC=4      DRK JUN98
         BR    R2                                             DRK JUN98
DEVNEND  DS    0H                                             DRK JUN98
         LA    R15,8                    EMPTY LIST, SET RC=8  DRK JUN98
         BR    R2                                             DRK JUN98
DEVNOK   DS    0H                                             DRK JUN98
         LA    R15,0                    FOUND, SET RC=0       DRK JUN98
         BR    R2                                             DRK JUN98
         SPACE 1                                              DRK JUN98
ISPCREF2 DS    0H                                             ABL JAN87
         LA    R14,ISPCNTL          'CONTROL '                ABL JAN87
         LA    R15,ISPDSP           'DISPLAY '                ABL JAN87
         LA    R0,ISPREF            'REFRESH '                ABL JAN87
         STM   R14,R0,PARMLIST                                ABL JAN87
         OI    PARMLIST+08,X'80'                              ABL JAN87
         LA    R1,PARMLIST                                    ABL JAN87
         L     R15,ISPLINK                                    ABL JAN87
         BASR  R14,R15                                        ABL JAN87
         LTR   R15,R15                                        ABL JAN87
         BNZ   ISPERR                                         ABL JAN87
*        NI    SPFLAG3,255-SPFREFR                            ABL JAN87
         BR    R2                                             ABL JAN87
ISPREF   DC    C'REFRESH '                                    ABL JAN87
*                                                             ABL JAN87
* VGET ZVERB                            *                      SS AUG86
ISPDVGET DS    0H                                              SS NOV84
         LA    R14,VGET               VGET                    ABL OCT84
         LA    R15,VZVERB             ZVERB                   ABL OCT84
         LA    R0,ISPSHARE            SHARED                  ABL OCT84
         STM   R14,R0,PARMLIST                                ABL OCT84
         OI    PARMLIST+8,X'80'                               ABL OCT84
         B     ISPSXEQ0                                        SS MAR85
         SPACE 2                                               SS SEP84
*                                       *                      SS AUG86
*  VGET PROFILE                         *                      SS AUG86
*  R15=ADDRESS OF VARIABLE LIST         *                      SS AUG86
*                                       *                      SS AUG86
ISPVGETP DS    0H                                              SS AUG86
         LA    R14,VGET               VGET                     SS AUG86
         LA    R0,ISPPROFL            PROFILE                  SS AUG86
         STM   R14,R0,PARMLIST                                 SS AUG86
         OI    PARMLIST+8,X'80'                                SS AUG86
         B     ISPSXEQ8                                        SS AUG86
         SPACE 2                                               SS AUG86
*                                       *                      SS AUG86
*  VGET SHARED                          *                      SS OCT88
*  R15=ADDRESS OF VARIABLE LIST         *                      SS OCT88
*                                       *                      SS OCT88
ISPVGETS DS    0H                                              SS OCT88
         LA    R14,VGET               VGET                     SS OCT88
         LA    R0,ISPSHARE            SHARED                   SS OCT88
         STM   R14,R0,PARMLIST                                 SS OCT88
         OI    PARMLIST+8,X'80'                                SS OCT88
         B     ISPSXEQ8                                        SS OCT88
         SPACE 2                                               SS OCT88
*                                       *                      SS OCT88
*  VPUT PROFILE                         *                      SS OCT88
*  R15=ADDRESS OF VARIABLE LIST         *                      SS OCT88
*                                       *                      SS OCT88
ISPVPUTP DS    0H                                              SS OCT88
         LA    R14,VPUT               VGET                     SS OCT88
         LA    R0,ISPPROFL            PROFILE                  SS OCT88
         STM   R14,R0,PARMLIST                                 SS OCT88
         OI    PARMLIST+8,X'80'                                SS OCT88
         B     ISPSXEQ8                                        SS OCT88
         SPACE 2                                               SS OCT88
*                                       *                      SS OCT88
*  VPUT SHARED                          *                      SS OCT88
*  R15=ADDRESS OF VARIABLE LIST         *                      SS OCT88
*                                       *                      SS OCT88
ISPVPUTS DS    0H                                              SS OCT88
         LA    R14,VPUT               VGET                     SS OCT88
         LA    R0,ISPSHARE            SHARED                   SS OCT88
         STM   R14,R0,PARMLIST                                 SS OCT88
         OI    PARMLIST+8,X'80'                                SS OCT88
         B     ISPSXEQ8                                        SS OCT88
         SPACE 2                                               SS OCT88
* CREATE OR RECREATE TABLE FROM SAVED INFO                     SS AUG86
ISPTBCRE DS    0H                                              SS AUG86
         L     R0,SPFTVARA            ADDRESS OF VARS          SS AUG86
         L     R15,SPFTKEYA           ADDRESS OF KEY           SS AUG86
         B     ISPTBOP2                 *                      SS AUG86
         SPACE 2                                               SS AUG86
*   TB OPEN (CREATE)                                           SS NOV85
*   R0=ADDR OF VAR NAMES                                       SS NOV85
*   R15=ADDRESS OF KEY VAR NAME (OR 0)                         SS NOV85
ISPTBOPN DS    0H                                              SS AUG86
         ST    R0,SPFTVARA            ADDRESS OF VARS          SS AUG86
         ST    R15,SPFTKEYA           ADDRESS OF KEY           SS AUG86
ISPTBOP2 DS    0H                                              SS AUG86
         MVI   SPFTFLG1,0                                      SS AUG86
         XC    SPFTFF(2),SPFTFF                                SS NOV85
         OI    SPFTFLG1,SPFTACT                                SS NOV85
         LA    R1,ISPNOWRT       NO WRITE                      SS NOV85
         LA    R14,SPFTBL                                      SS NOV85
         STM   R14,R1,PARMLIST+4                               SS NOV85
         LA    R14,TBCREATE                                    SS NOV85
         ST    R14,PARMLIST                                    SS NOV85
         OI    PARMLIST+16,X'80'                               SS NOV85
         BAS   R14,ISPSXEQ                                     SS JUL87
         LTR   R15,R15                                         SS AUG86
         BNZ   ISPERR                                          SS AUG86
         TM    SPFTFLG3,SPFTSORT        SORTED                 SS AUG86
         BO    ISPTSORT                 YES INIT WITH SORT     SS AUG86
         BR    R2                       RETURN                 SS AUG86
         SPACE 2                                               SS AUG86
* SORT TABLE USING SORT LIST IN SPFTSORA                       SS AUG86
ISPTSORT DS    0H                                              SS AUG86
         LA    R14,TBSORT               SORT REQUEST           SS AUG86
         LA    R15,SPFTBL               TABLE NAME             SS AUG86
         L     R0,SPFTSORA              SORT LIST ADDRESS      SS AUG86
         STM   R14,R0,PARMLIST                                 SS AUG86
         OI    PARMLIST+08,X'80'                               SS AUG86
         B     ISPSXEQ0                                        SS AUG86
         SPACE 2                                               SS SEP84
ISPTBT#S MVI   SPFTBL+2,C'S'         TERMINATE ISPMODE TABLE  ABL OCT84
         B     ISPTBEND                                       ABL OCT84
         SPACE 1
*SPTBT#M TM    SPFLAG2,SPFMEMA       TERMINATE MEMLIST TABLE  ABL OCT84
ISPTBT#M TM    SPFTFLG1,SPFTACT      TERMINATE MEMLIST TABLE   SS AUG86
         BZR   R2                    DOES NOT EXIST, RETURN   ABL OCT84
         NI    SPFLAG0,255-SPFCLNM   CLEAR MEMLIST MODE       ABL OCT84
         NI    SPFLAG2,0             CLEAR MEMLIST MODE       ABL OCT84
         NI    SPFLAG3,255-SPFCONV   CLEAR MEMLIST MODE       ABL OCT84
         NI    SPFLAG3,SPFSELV+SPF300A                        ABL NOV84
         B     ISPTBEND                                        SS NOV85
         SPACE 1
ISPTBEND DS    0H                                              SS SEP84
         NI    SPFTFLG1,255-SPFTACT                            SS NOV85
         LA    R14,TBEND          END TABLE                    SS JUL84
         LA    R15,SPFTBL         TABLE NAME                   SS JUL84
         STM   R14,R15,PARMLIST                                SS JUL84
         OI    PARMLIST+04,X'80'                               SS JUL84
         BAS   R14,ISPSXEQ                                     SS OCT88
         LTR   R15,R15                                         SS AUG86
         BNZ   ISPERR                                          SS AUG86
         TM    SPFTFLG1,SPFTLCD   IN LINE CMD MODE             SS AUG86
         BZR   R2                 NO    *                      SS AUG86
         NI    SPFTFLG1,255-SPFTLCD-SPFTMUT                    SS AUG86
         BR    R2                 MISSING IN PDS81 AND PDS82   SS OCT88
         SPACE 2                                               SS JUL84
ISPCTLND DS    0H                                              SS JUL87
         LA    R0,ISPENTER      ENTER                          SS JUL87
         B     *+8              SKIP END OPERAND               SS JUL87
ISPCTNDE DS    0H                       *                      SS JUL87
         LA    R0,ISPCEND       END                            SS JUL87
         LA    R14,ISPCNTL      CONTROL                        SS JUL87
         LA    R15,ISPNOND      NONDISPL                       SS JUL87
         STM   R14,R0,PARMLIST                                 SS JUL87
         OI    PARMLIST+8,X'80'                                SS JUL87
         B     ISPSXEQ0                                        SS JUL87
ISPDSPSV DS    0H                                              SS SEP84
         LA    R14,ISPCNTL      CONTROL                        SS SEP84
         LA    R15,ISPDSP       DISPLAY                        SS SEP84
         LA    R0,ISPSAVE       SAVE                           SS SEP84
         STM   R14,R0,PARMLIST                                 SS SEP84
         OI    PARMLIST+8,X'80'                                SS SEP84
         B     ISPSXEQ0                                        SS MAR85
         SPACE 2                                               SS JUL84
ISPDSPRS DS    0H                                              SS SEP84
         LA    R14,ISPCNTL      CONTROL                        SS SEP84
         LA    R15,ISPDSP       DISPLAY                        SS SEP84
         LA    R0,ISPRSTR       RESTORE                        SS SEP84
         STM   R14,R0,PARMLIST                                 SS SEP84
         OI    PARMLIST+8,X'80'                                SS SEP84
         B     ISPSXEQ0                                        SS MAR85
         SPACE 2                                               SS JUL84
ISPCERT  DS    0H                                              SS SEP84
         LA    R14,ISPCNTL      CONTROL                        SS SEP84
         LA    R15,ISPERRS      ERRORS                         SS SEP84
         LA    R0,ISPRETN       RETURN                         SS SEP84
         STM   R14,R0,PARMLIST                                 SS SEP84
         OI    PARMLIST+8,X'80'                                SS SEP84
         B     ISPSXEQ0                                        SS MAR85
ISPCERC  DS    0H                                              SS SEP84
         LA    R14,ISPCNTL      CONTROL                        SS SEP84
         LA    R15,ISPERRS      ERRORS                         SS SEP84
         LA    R0,ISPCANCL      CANCEL                         SS SEP84
         STM   R14,R0,PARMLIST                                 SS SEP84
         OI    PARMLIST+8,X'80'                                SS SEP84
         B     ISPSXEQ0                                        SS MAR85
ISPPTON  DS    0H                                             DRK JUN19
         LA    R14,ISPCNTL      CONTROL                       DRK JUN19
         LA    R15,ISPPASST     PASSTHRU                      DRK JUN19
         LA    R0,ISPLRSCR      LRSCROLL                      DRK JUN19
         LA    R1,ISPBLK8       BLANK                         DRK JUN19
         STM   R14,R1,PARMLIST                                DRK JUN19
         LA    R1,ISPPASON      PASON                         DRK JUN19
         ST    R1,PARMLIST+16                                 DRK JUN19
         OI    PARMLIST+16,X'80'                              DRK JUN19
         LA    R1,PARMLIST                                    DRK JUN19
         L     R15,ISPLINK                                    DRK JUN19
         BASR  R14,R15                                        DRK JUN19
         BR    R2                                             DRK JUN19
         SPACE 2                                               SS JUL84
ISPADD1  DS    0H                                              SS JUL84
         LA    R14,1              SET COUNTS TO ONE            SS JUL84
         ST    R14,SPFSTART           START OF LAST CMD        SS JUL84
         ST    R14,SPFCRP             CPR                      SS JUL84
         ST    R14,SPFTDTOP           DISPLAY TOP              SS JUL84
         LA    R14,0              SET COUNTS TO ZERO           SS JUL84
         ST    R14,SPFCKPT            COUNT FROM LAST CKPT     SS JUL84
         ST    R14,SPFLAST            ZERO SIZE TABLE          SS JUL84
         LA    R1,FIRST4K                                      SS NOV85
         LA    R1,MSGENTDS-FIRST4K(R1) ADD LINE AND RETURN     SS NOV85
         ST    R1,SPFSAV1                                      SS SEP84
         B     ISPADDLN                                        SS SEP84
         SPACE 2                                               SS SEP84
*                                                              SS NOV86
*    POSITION TO BOTTOM OF LOG                                 SS NOV86
*                                                              SS NOV86
ISPLOGBT DS    0H                                              SS NOV86
         LA    R14,TBBOTTOM      ADD TO TABLE                  SS NOV86
         LA    R15,SPFLOGNM      TABLE NAME FOR LOG            SS OCT88
         STM   R14,R15,PARMLIST                                SS NOV86
         OI    PARMLIST+4,X'80'                                SS NOV86
         LA    R1,PARMLIST                                     SS NOV86
         L     R15,ISPLINK                                     SS NOV86
         BASR  R14,R15                                         SS NOV86
         C     R15,ISPL8                                       SS NOV86
         BH    ISPERR                                          SS NOV86
         BR    R2                                              SS NOV86
*                                                              SS NOV86
*    ADD LINE TO LOG                                           SS NOV86
* ISPADDLN  PRIMARY.. ADD FROM BUFFER                          SS NOV86
* ISPADD79  ALT       ADD FROM R1, LN=R14                      SS NOV86
* ISPADDCO  ALT       ADD WHATS IN SPFLINE                     SS NOV86
*    NOTE.. TO USE ALT, A ISPLOGBT MUST BE DONE                SS NOV86
*                       BEFORE THE SERIES OF ADDS              SS NOV86
*                                                              SS NOV86
ISPADDLN DS    0H                                              SS JUL84
* ALWAYS ADD TO TBBOTTOM                                       SS NOV85
         LA    R14,TBBOTTOM      ADD TO TABLE                  SS NOV85
         LA    R15,SPFLOGNM      TABLE NAME FOR LOG            SS OCT88
         STM   R14,R15,PARMLIST                                SS NOV85
         OI    PARMLIST+4,X'80'                                SS NOV85
         LA    R1,PARMLIST                                     SS NOV85
         L     R15,ISPLINK                                     SS NOV85
         BASR  R14,R15                                         SS NOV85
         C     R15,ISPL8                                       SS NOV85
         BH    ISPERR                                          SS NOV85
         MVI   SPFLINE,C' '      PRE CLEAR OUTPUT LINE         SS JUL84
         MVC   SPFLINE+1(159),SPFLINE                          SS OCT88
         L     R1,SPFSAV1        OUTPUT BUFFER                 SS JUL84
         LH    R14,0(R1)         LENGTH                        SS JUL84
         SH    R14,ISPH5         -4 FOR HEADER -1 FOR MVC      SS JUL84
         L     R15,ADDRUPT              ADDRESS OF THE UPT    ABL APR85
         TM    UPTSWS-UPT(R15),UPTMID   MESSAGE ID DESIRED?   ABL APR85
         BO    ISPADD79                 YES, BRANCH           ABL APR85
         CLC   4(3,R1),ISPPDS    PDS PREFIX?                  ABL APR85
         BNE   ISPADD79          NO, BRANCH                   ABL APR85
         TM    9(R1),X'F0'       NUMERIC?                     ABL APR85
         BNO   ISPADD79          NO, BRANCH                   ABL APR85
         TM    8(R1),X'F0'       NUMERIC?                     ABL APR85
         BNO   ISPADD79          NO, BRANCH                   ABL APR85
         TM    7(R1),X'F0'       NUMERIC?                     ABL APR85
         BNO   ISPADD79          NO, BRANCH                   ABL APR85
         CLI   11(R1),X'40'      A FOLLOWING BLANK?           ABL APR85
         BNE   ISPADD79          NO, BRANCH                   ABL APR85
         CLI   10(R1),C'I'       INFORMATIONAL MESSAGE?       ABL APR85
         BE    ISPADDLS          YES, BRANCH                  ABL APR85
         CLI   10(R1),C'A'       ACTION MESSAGE?              ABL APR85
         BE    ISPADDLS          YES, BRANCH                  ABL APR85
         CLI   10(R1),C'W'       WARNING MESSAGE?             ABL APR85
         BE    ISPADDLS          YES, BRANCH                  ABL APR85
         CLI   10(R1),C'E'       ERROR MESSAGE?               ABL APR85
         BNE   ISPADD79          NO, BRANCH                   ABL APR85
ISPADDLS DS    0H                                             ABL APR85
         LA    R0,8              LITERAL 8                    ABL APR85
         SR    R14,R0            -8 FOR THE MESSAGE ID        ABL APR85
         AR    R1,R0                                          ABL APR85
ISPADD79 DS    0H                                             ABL APR85
         CH    R14,ISPH159       MAX LENGTH                    SS OCT88
         BNH   ISPMVLIN          OK                            SS OCT88
         LH    R14,ISPH159       TRUNCATE                      SS OCT88
ISPMVLIN MVC   SPFLINE(0),4(R1)  MOVE TO DIALOG VARIABLE       SS JUL84
         EX    R14,*-6                                         SS JUL84
ISPADDCO DS    0H                                              SS MAY85
         CLI   SPFLINE,X'40'     BLANK IN CHARACTER 1         ABL SEP84
         BNE   *+8               NO, BRANCH                   ABL SEP84
         MVI   SPFLINE,0         YES, CONVERT TO NULL         ABL SEP84
         LA    R14,TBADD         ADD TO TABLE                  SS JUL84
         LA    R15,SPFLOGNM      TABLE NAME FOR LOG            SS OCT88
         STM   R14,R15,PARMLIST                                SS JUL84
         OI    PARMLIST+4,X'80'                                SS JUL84
         LA    R1,PARMLIST                                     SS JUL84
         L     R15,ISPLINK                                     SS JUL84
         BASR  R14,R15                                         SS JUL84
         LTR   R15,R15                                         SS JUL84
         BNZ   ISPERR                                          SS JUL84
         L     R14,SPFLAST       TRACK TABLE POSITION          SS JUL84
         LA    R14,1(R14)        ONE MORE ENTRY                SS JUL84
         ST    R14,SPFLAST       SAVE NEW COUNT                SS JUL84
         BR    R2                RETURN                        SS AUG84
         SPACE 2                                               SS JUL84
* SIMPLE SCAN EQU                       *                      SS AUG86
ISPMEMSC DS    0H                                              SS JUL84
         LA    R14,TBSCAN                                      SS SEP84
         LA    R15,SPFTBL                                      SS SEP84
* R0 PASSED POINTING TO VAR NAME                               SS SEP84
         STM   R14,R0,PARMLIST                                 SS SEP84
         OI    PARMLIST+8,X'80'                                SS SEP84
         B     ISPSXEQ8                                        SS MAR85
         SPACE 2                                               SS AUG86
* SCAN LINE COMMAND FOR NON BLANK       *                      SS JUL87
ISPNXLN  DS    0H                FIND NEXT NON BLANK LINE      SS JUL87
         LH    R1,SPFTBPOT              COMMAND OFFSET         SS JUL87
         LA    R1,SPWRKC(R1)                    ADDRESS        SS JUL87
         MVC   0(4,R1),ISPBLK8          SET BLANK              SS JUL87
         LA    R14,TBSCAN                                      SS JUL87
         LA    R15,SPFTBL                                      SS JUL87
         L     R0,SPFTBPOA              OPT VAR NAME ADDRESS   SS JUL87
         STM   R14,R0,PARMLIST                                 SS JUL87
         LA    R14,ISPBLK8              NO EXTENT VARS         SS JUL87
         LA    R15,ISPBLK8              NO ROWID               SS JUL87
         LA    R0,ISPNEXT               NEXT LINE              SS JUL87
         LA    R1,ISPBLK8               NO NOREAD              SS JUL87
         STM   R14,R1,PARMLIST+12                              SS JAN89
         LA    R14,ISPBLK8              NO  CRP                SS JUL87
         LA    R15,ISPGT                NOT EQUAL              SS JUL87
         STM   R14,R15,PARMLIST+28                             SS JUL87
         OI    PARMLIST+32,X'80'                               SS JUL87
         B     ISPSXEQ8                                        SS JUL87
         SPACE 2                                               SS AUG86
* MEML INFORMATION MOVE ROUTINES                               SS AUG86
* MADE COMMON SO THEY ONLY HAVE TO BE CHANGE IN ONE SPOT       SS AUG86
MEMLSAVE DS    0H                                              SS AUG86
         MVC   MEMLMV1(MEMLLN1),MEM2MV1    SAVE STATS          SS AUG86
         MVC   MEMLMV2(MEMLLN2),MEM2MV2    SAVE STATS          SS AUG86
         BR    R2         RETURN                               SS AUG86
         SPACE 2                                               SS AUG86
MEMLSET  DS    0H                                              SS AUG86
         MVC   MEM2MV1(MEMLLN1),MEMLMV1    SAVE STATS          SS AUG86
         MVC   MEM2MV2(MEMLLN2),MEMLMV2    SAVE STATS          SS AUG86
         BR    R2         RETURN                               SS AUG86
         SPACE 2                                               SS JUL84
* COMMON BLDL  FIRST ENTRY SETS DCB TO INDCB                   SS AUG86
*              SECOND ENTRY (ISPBLDL1) CALLER SET R1 = DCB ADR SS AUG86
*              CALLER MUST MOVE MEMBER NAME TO DIRNAME(8)      SS AUG86
*                                                              SS AUG86
ISPBLDL  DS    0H           BLDL SUBROUTINE                    SS AUG86
         LA    R1,INDCB                 *                      SS AUG86
ISPBLDL1 DS    0H                       *                      SS AUG86
         BLDL  (1),BLDLLIST             INSURE IT IS THERE     SS AUG86
         B     *+4(R15)                 PROCESS RETURN CODE   ABL FEB86
         B     ISPLSTT4                   00 - MEMBER FOUND   ABL FEB86
         B     ISPLSTT8                   04 - NOT FOUND      ABL FEB86
         B     ISPLSTT8                   08 - DIRECTORY I/O  ABL FEB86
         SPACE 1                                              ABL FEB86
ISPLSTT4 MVC   SPFDIRFG(2),DIRFLAG      SAVE BLDL FLAGS        SS AUG86
         MVC   DIRFLAG(DIREND-DIRFLAG),DIRFLAG+2 BLDL ADDS     SS AUG86
         BR    R2                                              SS AUG86
ISPLSTT8 XC    DIRFLAG(DIREND-DIRFLAG),DIRFLAG  CLEAR ENTRY   ABL FEB86
         BR    R2                       *                      SS AUG86
         SPACE 2                                               SS JUL84
*  TB ADD                                                      SS NOV85
ISPTBADD DS    0H                                              SS NOV85
         LA    R15,SPFTBL                                      SS NOV85
ISPTBAD2 DS    0H                ENTRY WITH R15=TABLE NAME     SS JUL87
         LA    R14,TBADD         ADD TO TABLE                  SS NOV85
         LA    R0,ISPBLK8        NO EXTENT VARS                SS NOV86
         LA    R1,ISPORDER       IN ORDER                      SS AUG86
         STM   R14,R1,PARMLIST                                 SS AUG86
         OI    PARMLIST+12,X'80'                               SS AUG86
         B     ISPSXEQ8                                        SS NOV85
         SPACE 2                                               SS JUL84
ISPTOP   DS    0H                                              SS MAY89
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89
ISPTOP2  LA    R14,TBTOP          PRE POSITION TO BOTTOM       SS MAY89
         STM   R14,R15,PARMLIST                                SS MAY89
         OI    PARMLIST+04,X'80'                               SS MAY89
         B     ISPSXEQ8                                        SS MAY89
         SPACE 2                                               SS MAY89
ISPBOTM  DS    0H                                              SS MAY89
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89
ISPBOT2  LA    R14,TBBOTTOM       PRE POSITION TO BOTTOM       SS MAY89
         STM   R14,R15,PARMLIST                                SS MAY89
         OI    PARMLIST+04,X'80'                               SS MAY89
         B     ISPSXEQ8                                        SS MAY89
         SPACE 2                                               SS MAY89
ISPGET   DS    0H                                              SS MAY89
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89
ISPGET2  LA    R14,TBGET          GET IT IF IT IS THERE        SS MAY89
         STM   R14,R15,PARMLIST                                SS MAY89
         OI    PARMLIST+04,X'80'                               SS MAY89
         B     ISPSXEQ8                                        SS MAY89
         SPACE 2                                               SS MAY89
ISPDEL1  DS    0H                                              SS MAY89
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89
ISPDEL2  LA    R14,TBDELETE       DELETE HIS LINE              SS MAY89
         STM   R14,R15,PARMLIST                                SS MAY89
         OI    PARMLIST+04,X'80'                               SS MAY89
         B     ISPSXEQ8                                        SS MAY89
         SPACE 2                                               SS MAY89
ISPSKIP1 DS    0H                                              SS MAY89
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89
ISPSKIP2 LA    R14,TBSKIP         DELETE HIS LINE              SS MAY89
         STM   R14,R15,PARMLIST                                SS MAY89
         OI    PARMLIST+04,X'80'                               SS MAY89
         B     ISPSXEQ8                                        SS MAY89
         SPACE 2                                               SS JUL84
*                                       *                      SS MAY89
* TABLE ABSOLUTE POSITIONING SERVICES   *                      SS MAY89
* BASED OF ISPF ROW ID  (A 4 BYTE TAG)  *                      SS MAY89
*                                       *                      SS MAY89
*  TABLE ROW ID NOTE                    *                      SS MAY89
*  ROW ID RETURNED IN SPFFIXED          *                      SS MAY89
*                                       *                      SS MAY89
ISPTBNT  DS    0H                       *                      SS MAY89
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89
         LA    R14,TBSKIP         SKIP COMMAND                 SS MAY89
         LA    R0,ISPL0           ZERO SKIP                    SS MAY89
         LA    R1,ISPBLK8         NO EXT VARS                  SS MAY89
         STM   R14,R1,PARMLIST    SAVE 4                       SS MAY89
         LA    R14,VSPFFIX        NAME WERE TO PLACE           SS MAY89
         LA    R15,ISPBLK8        NO POSITIONING               SS MAY89
         LA    R0,ISPNORAD        NO READ                      SS MAY89
         STM   R14,R0,PARMLIST+16       *                      SS MAY89
         OI    PARMLIST+24,X'80'        *                      SS MAY89
         B     ISPSXEQ8                 *                      SS MAY89
*                                       *                      SS MAY89
*  TABLE ROW ID POINT (NO READ)         *                      SS MAY89
*  R15 = ROW ID VALUE                   *                      SS MAY89
*                                       *                      SS MAY89
ISPTBPT  DS    0H                       *                      SS MAY89
         ST    R15,SPFFIXED       SET ROW ID                   SS MAY89
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89
         LA    R14,TBSKIP         SKIP COMMAND                 SS MAY89
         LA    R0,ISPL0           ZERO SKIP                    SS MAY89
         LA    R1,ISPBLK8         NO EXT VARS                  SS MAY89
         STM   R14,R1,PARMLIST    SAVE 4                       SS MAY89
         LA    R14,ISPBLK8        NO RETURN                    SS MAY89
         LA    R15,SPFFIXED       POSITION ROW ID              SS MAY89
         LA    R0,ISPNORAD        NO READ                      SS MAY89
         STM   R14,R0,PARMLIST+16       *                      SS MAY89
         OI    PARMLIST+24,X'80'        *                      SS MAY89
         B     ISPSXEQ8                 *                      SS MAY89
*                                       *                      SS MAY89
*  TABLE ROW ID READ                    *                      SS MAY89
*  R15 = ROW ID VALUE                   *                      SS MAY89
*                                       *                      SS MAY89
ISPTBRD  DS    0H                       *                      SS MAY89
         ST    R15,SPFFIXED       SET ROW ID                   SS MAY89
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89
         LA    R14,TBSKIP         SKIP COMMAND                 SS MAY89
         LA    R0,ISPL0           ZERO SKIP                    SS MAY89
         LA    R1,ISPBLK8         NO EXT VARS                  SS MAY89
         STM   R14,R1,PARMLIST    SAVE 4                       SS MAY89
         LA    R14,ISPBLK8        NO RETURN                    SS MAY89
         LA    R15,SPFFIXED       POSITION ROW ID              SS MAY89
         STM   R14,R15,PARMLIST+16      *                      SS MAY89
         OI    PARMLIST+20,X'80'        *                      SS MAY89
         B     ISPSXEQ8                 *                      SS MAY89
*                                       *                      SS MAY89
*  TB MOD                                                      SS NOV85
ISPTBMOD DS    0H                                              SS NOV85
         LA    R15,SPFTBL                                      SS NOV85
ISPTBMD2 DS    0H                ENTRY WITH R15=TABLE NAME     SS JUL87
         LA    R14,TBMOD         MOD TO TABLE                  SS NOV85
         LA    R0,ISPBLK8        NO EXTENT VARS                SS NOV86
         LA    R1,ISPORDER       IN ORDER                      SS AUG86
         STM   R14,R1,PARMLIST                                 SS AUG86
         OI    PARMLIST+12,X'80'                               SS AUG86
         B     ISPSXEQ8                                        SS NOV85
         SPACE 2                                               SS JUL84
*  TB PUT                                                      SS NOV85
ISPTBPUT DS    0H                                              SS NOV85
         LA    R15,SPFTBL                                      SS NOV85
ISPTBPT2 DS    0H                ENTRY WITH R15=TABLE NAME     SS JUL87
         LA    R14,TBPUT         ADD TO TABLE                  SS NOV85
         LA    R0,ISPBLK8        NO EXTENT VARS                SS NOV86
         LA    R1,ISPORDER       IN ORDER                      SS AUG86
         STM   R14,R1,PARMLIST                                 SS AUG86
         OI    PARMLIST+12,X'80'                               SS AUG86
         B     ISPSXEQ8                                        SS NOV85
         SPACE 2                                               SS JUL84
ISPQUERY DS    0H                                              SS JUL84
         LA    R14,TBQUERY        GET CPR                      SS JUL84
         ST    R14,PARMLIST                                    SS JUL84
         LA    R14,SPFTBL         TABLE NAME                   SS JUL84
         LA    R15,ISPBLK8       NO KEYS                       SS NOV86
         LA    R0,ISPBLK8        NO NAMES                      SS NOV86
         LA    R1,VSPFFIX2        TABLE SIZE GOES HERE         SS JUL84
         STM   R14,R1,PARMLIST+4                               SS JUL84
         STM   R15,R0,PARMLIST+20                              SS JUL84
         LA    R14,VSPFFIX        CPR GOES HERE                SS JUL84
         ST    R14,PARMLIST+28                                 SS JUL84
         OI    PARMLIST+28,X'80'                               SS JUL84
         BAS   R14,ISPSXEQ                                     SS MAY89
         LTR   R15,R15                                         SS JUL84
         BNZ   ISPERR                                          SS JUL84
         TM    SPFTBPF1,SPFTLOG   LIST TABLE                   SS NOV85
         BZ    ISPQUER2           YES                          SS NOV85
         L     R15,SPFFIXE2       SAVE INFO                    SS JUL84
         LTR   R15,R15                                         SS JUL84
         BZ    ISPADD1            NOW EMPTY, PAD WITH ONE LINE SS JUL84
         ST    R15,SPFLAST                                     SS JUL84
         L     R14,SPFFIXED                                    SS JUL84
         ST    R14,SPFCRP                                      SS JUL84
         BR    R2                                              SS NOV85
ISPQUER2 DS    0H                                              SS SEP84
         SR    R15,R15           NORMAL RETURN                 SS SEP84
         L     R14,SPFFIXE2                                    SS SEP84
         ST    R14,SPFTSIZE                                    SS NOV85
         L     R14,SPFFIXED                                    SS SEP84
         ST    R14,SPFTCRP                                     SS NOV85
         TM    SPFTBPF1,SPFTMLX     MEMLIST                    SS NOV85
         BR    R2                                              SS SEP84
         SPACE 2                                               SS SEP84
*                                                              SS JUL84
*  SPFTTOP  CONTAIN TABLE   NEW POSITION                       SS NOV85
*  SPFTCRP  CONTAIN TABLE   CURRENT POSITION (QUERY FIRST)     SS NOV85
*                                                              SS JUL84
ISPOSTN  DS    0H                                              SS JUL84
         L     R15,SPFTTOP        CALCULATE                    SS NOV85
         LR    R14,R15                                         SS SEP84
         S     R15,SPFTCRP           SKIP AMOUNT + OR -        SS NOV85
         ST    R14,SPFTCRP        SET NEW CRP                  SS NOV85
ISPSKIP  DS    0H                 R15 IS SKIP VALUE            SS SEP84
         LTR   R15,R15            CHECK POSITION               SS JUL84
         BZR   R2                 NO SKIP REQUIRED             SS JUL84
         ST    R15,SPFFIXE2                                    SS SEP84
         LA    R14,TBSKIP         SKIP FUNCTION                SS JUL84
         LA    R15,SPFTBL                                      SS JUL84
         LA    R0,SPFFIXE2                                     SS JUL84
         STM   R14,R0,PARMLIST                                 SS JUL84
         OI    PARMLIST+08,X'80'                               SS JUL84
         B     ISPSXEQ8                                        SS MAR85
         SPACE 2                                               SS NOV84
*                                                              SS JUL84
*  SPFFIXED CONTAIN DELETE COUNT                               SS JUL84
*  SPFFIXE2 CONTAIN SKIP AMOUNT                                SS JUL84
*                                                              SS JUL84
ISPDEL   DS    0H                                              SS JUL84
*  FORCE SKIP 0 TO READ KEYED TABLE RECORD                     SS AUG86
         LA    R14,TBSKIP         SKIP FUNCTION                SS JUL84
         LA    R15,SPFTBL                                      SS JUL84
         LA    R0,SPFFIXE2                                     SS JUL84
         STM   R14,R0,PARMLIST                                 SS JUL84
         OI    PARMLIST+08,X'80'                               SS JUL84
         BAS   R14,ISPSXEQ                                     SS MAY89
         C     R15,ISPL8                                       SS JUL84
         BH    ISPERR                                          SS JUL84
ISPNOSK  L     R14,SPFFIXED       INIT R14                     SS JUL84
         LTR   R14,R14            DEL AMOUNT                   SS JUL84
         BZR   R2                 NO DEL REQUIRED OR DONE      SS JUL87
         SR    R15,R15            MAKE ZERO                    SS AUG86
         ST    R15,SPFFIXE2       SET FOR SKIP 0               SS AUG86
         LA    R14,TBDELETE       DELETE HIS LINE              SS AUG86
         LA    R15,SPFTBL         TABLE NAME                   SS JUL84
         STM   R14,R15,PARMLIST                                SS JUL84
         OI    PARMLIST+04,X'80'                               SS JUL84
ISPDLUP1 BAS   R14,ISPSXEQ                                     SS MAY89
         C     R15,ISPL8                                       SS JUL84
         BH    ISPERR                                          SS JUL84
         BER   R2                                              SS JUL84
         L     R14,SPFFIXED      DEL COUNT                     SS JUL84
         BCT   R14,ISPDLUP2      DECREMENT AND LOOP            SS JUL84
         ST    R14,SPFFIXED      ZERO COUNT                    SS JUL87
         B     ISPDEL            FORCE SKIP 0 TO READ ENTRY    SS JUL87
ISPDLUP2 ST    R14,SPFFIXED       SAVE COUNT LIFT              SS AUG86
         ICM   R15,15,SPFTKEYA    IS IT A KEYED TABLE          SS AUG86
         BZ    ISPDLUP1           NO CONTINUE DELETE           SS AUG86
         B     ISPDEL             FORCE SKIP 0 TO READ         SS AUG86
         SPACE 2                                               SS JUL84
*  MESSAGE INSERT ROUTINE                                      SS NOV85
ISPLMSGS DS    0H                                              SS NOV85
         LH    R1,SPFTBPDA            OFFSET TO DATA FIELD     SS NOV85
         LA    R1,SPWRKC(R1)          CALC REAL ADDRESS        SS NOV85
         L     R14,SPFTTPT            MAKE SURE WE HAVE PTR    SS NOV85
         SR    R15,R15                ZERO                     SS NOV88
         IC    R15,$TLMG(R14)         MSG OFFSET               SS MAY89
         TM    $TLF1(R14),#L          MSG OFFSET REQ           SS NOV88
         BZ    ISPLMSG2                 *                      SS NOV88
ISPLMSG0 DS    0H                       *                      SS NOV88
         AL    R15,ISP$TMGA           CALC MSG ADDR            SS NOV85
         MVC   0(8,R1),0(R15)         MOVE MESSAGE             SS NOV85
         BR    R2                     RETURN                   SS NOV85
ISPM9000 DC    H'9000'                MSG NUM 9000 AND UP      SS NOV85
ISPLMSG2 DS    0H                                              SS NOV85
         MVI   0(R1),C'*'             SET TO *                 SS NOV85
         MVC   1(7,R1),$TLCM(R14)     COPY CMD NAME            SS NOV85
         LA    R15,6                                           SS NOV85
         LA    R1,2(R1)               SKIP OVER *+1 CHAR       SS NOV85
ISPLMSG3 DS    0H                                              SS NOV85
         CLI   0(R1),C' '             BLANK                    SS NOV85
         BE    ISPLMSG4               YES,  SET TO *           SS NOV85
         LA    R1,1(,R1)              NEXT CHAR                SS NOV85
         BCT   R15,ISPLMSG3           FIND END OF CMD          SS NOV85
         BR    R2                     NO END, SKIP IT          SS NOV85
ISPLMSG4 DS    0H                                              SS NOV85
         MVI   0(R1),C'*'             MAKE *                   SS NOV85
         BR    R2                                              SS NOV85
         SPACE 3                                               SS NOV85
*                                                              SS NOV85
* CONVERT DEC TO PRINTABLE                                     SS NOV85
*  R1=DEC VALUE                                                SS NOV85
*                                                              SS NOV85
ISPDECCV DS    0H                                              SS NOV85
         CVD   R1,DOUBLE                                       SS NOV85
         MVC   SPFDCONV,ISPDCNV1                               SS NOV85
         ED    SPFDCONV,DOUBLE+2                               SS NOV85
         BR    R2                                              SS NOV85
ISPDCNV1 DC    X'402020202020202020202120'                     SS NOV85
         SPACE 3                                               SS NOV85
*                                                              SS NOV85
* CONVERT PRINTABLE HEX                                        SS NOV85
*  R1=ONE WORD OF DATA                                         SS NOV85
*                                                              SS NOV85
ISPHEXCV DS    0H                                              SS NOV85
         ST    R1,DOUBLE                                       SS NOV85
         MVI   DOUBLE+4,X'0C'      FAKE SIGN                   SS NOV85
         UNPK  SPFHEXCV(9),DOUBLE(5)                           SS NOV85
         TR    SPFHEXCV(8),ISPHEXTR                            SS NOV85
         BR    R2                                              SS NOV85
         DC    C'0123456789ABCDEF'                             SS NOV85
ISPHEXTR EQU   *-256                                           SS NOV85
         SPACE 3                                               SS NOV85
*                                                              SS NOV85
* CONVERT HEX INPUT TO BINARY                                  SS NOV85
*  R1=BINARY OUT  DATA, INPUT SPFHEXCV                         SS NOV85
*                                                              SS NOV85
ISPBINCV DS    0H                                              SS NOV85
         NC    SPFHEXCV(8),ISPBINC2                            SS NOV85
         TR    SPFHEXCV(8),ISPHEXT2                            SS NOV85
         MVI   SPFHEXCV+8,X'C0'      FAKE SIGN                 SS NOV85
         PACK  DOUBLE(5),SPFHEXCV(9)                           SS NOV85
         L     R1,DOUBLE                                       SS NOV85
         BR    R2                                              SS NOV85
ISPBINC2 DC    X'1F1F1F1F1F1F1F1F'                             SS NOV85
ISPHEXT2 DC    X'00FAFBFCFDFEFF',XL9'00'   00-0F               SS NOV85
         DC    C'0123456789',XL6'00'       10-1F               SS NOV85
         SPACE 3                                               SS NOV85
*                                       *                      SS AUG86
*   FIND ENTRY IN MOVE TABLE            *                      SS AUG86
*   R0=0 USE CURRENT PANEL TABLE        *                      SS AUG86
*        VIA SPFTBPPI                   *                      SS AUG86
*                                       *                      SS AUG86
ISPMVTBL DS    0H                       *                      SS AUG86
         LH    R0,SPFTBPPI              INDEX                  SS AUG89
         BCTR  R0,0                     INDEX FROM ZERO        SS AUG86
         LR    R1,R0                    INDEX                  SS AUG86
         AR    R1,R0                    INDEX X 2              SS AUG86
         AR    R1,R0                    INDEX X 3              SS AUG86
         SLL   R1,2                     INDEX X 12             SS AUG86
         AL    R1,ISPMOVEA              ADDED ADDRESS          SS AUG86
         L     R15,0(,R1)               GET ROUTINE ADDRESS    SS AUG86
         L     R14,4(,R1)               GET TITLE ADDRESS      SS AUG86
         BR    R2                       DONE                   SS AUG86
         SPACE 3                        *                      SS AUG86
*                                                              SS NOV85
*   FIND DSAB TO MATCH DDNAME                                  SS NOV85
*   R14=ADDR OF DDNAME                                         SS NOV85
*   R1=RETURNED DSAB ADDRESS OR 0 IF NOT FOUND                 SS NOV85
ISPFDSAB DS    0H                                              SS NOV85
         L     R1,CVTPTR(,R0)     CVT                          SS NOV85
         L     R1,0(,R1)          ACT TCB PT                   SS NOV85
         L     R1,4(,R1)          ACT TCB                      SS NOV85
         L     R1,TCBJSCB-TCBRBP(R1)     JSCB                  SS NOV85
         L     R1,JSCDSABQ-IEZJSCB(R1)   DSAB QUE              SS NOV85
         L     R1,12(,R1)                FIRST DSAB            SS NOV85
ISPFDSB1 LTR   R1,R1         END OF DSAB CHAIN                 SS NOV85
         BZR   R2            RETURN WITH R1=0                  SS NOV85
         L     R15,DSABTIOT-DSAB(R1)                           SS NOV85
         CLC   0(8,R14),TIOEDDNM-TIOENTRY(R15)                 SS NOV85
         BER   R2            GOT A MATCH                       SS NOV85
         L     R1,DSABFCHN-DSAB(R1)     NEXT DSAB              SS NOV85
         B     ISPFDSB1                                        SS NOV85
*                                                              SS NOV85
*   DSORG CONVERT TO PRINTABLE                                 SS NOV85
*   R1=ADDRESS OF DSORG INFORMATION                            SS NOV85
*   R0=WILL BE SET TO 4 CHAR DSORG MNEMONIC (IE PO PS VSAM)    SS NOV85
*                                                              SS NOV85
ISPDSORG DS    0H            DSORG LEV 2 ROUTINE               SS NOV85
         TM    0(R1),JFCORGIS                                  SS NOV85
         BZ    *+14                                            SS NOV85
         ICM   R0,15,*+6                                       SS NOV85
         BR    R2                                              SS NOV85
         DC    C'ISAM'                                         SS NOV85
         TM    0(R1),JFCORGPO                                  SS NOV85
         BZ    *+14                                            SS NOV85
         ICM   R0,15,*+6                                       SS NOV85
         BR    R2                                              SS NOV85
         DC    C'PO  '                                         SS NOV85
         TM    0(R1),JFCORGPS                                  SS NOV85
         BZ    *+14                                            SS NOV85
         ICM   R0,15,*+6                                       SS NOV85
         BR    R2                                              SS NOV85
         DC    C'PS  '                                         SS NOV85
         TM    0(R1),JFCORGDA                                  SS NOV85
         BZ    *+14                                            SS NOV85
         ICM   R0,15,*+6                                       SS NOV85
         BR    R2                                              SS NOV85
         DC    C'DA  '                                         SS NOV85
         TM    1(R1),JFCORGAM                                  SS NOV85
         BZ    *+14                                            SS NOV85
         ICM   R0,15,*+6                                       SS NOV85
         BR    R2                                              SS NOV85
         DC    C'VSAM'                                         SS NOV85
         ICM   R0,15,*+6                                       SS NOV85
         BR    R2                                              SS NOV85
         DC    C'    '                                         SS NOV85
         AIF   ('&MVSLEV' GE 'MVS710').MVS710                 DRK MAR16
*                                                              SS NOV85
*  LSPACE SUBROUTINE  (USES SVC 78, UPDATES SPFV VARS)         SS NOV85
*   STANDARD MESSAGE FORMAT FOR DASD                          DRK MAY98
*   ----+----1----+----2----+----3                            DRK MAY98
*   SPACE=CCCC,TTTT,XXXX/CCCC,TTTT                            DRK MAY98
*  R0=UCB ADDRESS                                              SS NOV85
*  R15=RC FROM LSPACE                                          SS NOV85
*                                                              SS NOV85
ISPLSPAC DS    0H                                              SS NOV85
         LA    R1,SPFVLSPC     WORK AREA                       SS NOV85
         SVC   78                                              SS NOV85
         LTR   R15,R15                                         SS NOV85
*        BZ    ISPLSPC2                                        SS APR87
*        MVC   SPFVDATA,ISPLSPCE                               SS APR87
         BNZR  R2                                              SS APR87
*SPLSPC2 DS    0H                                              SS APR87
         MVC   SPFVTCYL+1(4),SPFVLSPC+6  TOTAL FREE CYLS      DRK MAY98
         MVC   SPFVTTRK+1(4),SPFVLSPC+11 TOTAL ADDL FREE TRKS DRK MAY98
         MVC   SPFVXNUM,SPFVLSPC+16      NUMBER FREE EXTENTS  DRK MAY98
         MVC   SPFVLCYL+1(4),SPFVLSPC+21 CYLS IN LARGEST FREE DRK MAY98
         MVC   SPFVLTRK+1(4),SPFVLSPC+26 ADDL TRKS IN LARGEST DRK MAY98
         AGO   .MVS710X                                       DRK MAR16
.MVS710  ANOP                                                 DRK MAR16
*                                                             DRK MAY98
*  LSPACE SUBROUTINE  (USES SVC 78, UPDATES SPFV VARS)        DRK MAY98
*   DATA RETURN AREA FORMAT FOR FAT DASD (3390-9 AND ABOVE)   DRK DEC98
*  R0=UCB ADDRESS                                             DRK MAY98
*  R15=RC FROM LSPACE                                         DRK MAY98
*                                                             DRK MAY98
LSPACE   LSPACE EXPDATA=0,MF=L,PLISTVER=MAX                   DRK SEP12
LSPACEL  EQU   *-LSPACE                                       DRK MAY98
ISPLSPAC DS    0H                                             DRK MAY98
         AIF   ('&SYSPARM' NE 'CSC-STL').S2K1                 DRK SEP12
*        ST    R0,FULLWORD               *** TEST ***         DRK SEP12
.S2K1    ANOP                                                 DRK SEP12
         MVC   PARMLIST(LSPACEL),LSPACE                       DRK MAY98
         LSPACE UCB=(R0),EXPDATA=SPFVLSPC,                    DRK SEP12X
               MF=(E,PARMLIST)                                DRK MAY98
         LTR   R15,R15                                        DRK MAY98
         BNZR  R2                                             DRK MAY98
         SPACE 1
         AIF   ('&SYSPARM' NE 'CSC-STL').S2K2                 DRK SEP12
*        L     R14,FULLWORD              *** TEST ***         DRK SEP12
*        USING UCBOB,R14                 *** TEST ***         DRK SEP12
.S2K2    ANOP                                                 DRK SEP12
         L     R1,LSPDTCYL               TOTAL FREE CYLS      DRK DEC98
         AIF   ('&SYSPARM' NE 'CSC-STL').S2K3                 DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K001'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'050000'             *** TEST ***         DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K002'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'075000'             *** TEST ***         DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K003'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'100000'             *** TEST ***         DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K004'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'125000'             *** TEST ***         DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K005'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'150000'             *** TEST ***         DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K006'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'1175000'            *** TEST ***         DRK SEP12
.S2K3    ANOP                                                 DRK SEP12
         CVD   R1,DOUBLE                 PACKED               DRK DEC98
         UNPK  SPFVTCYL(7),DOUBLE+4(4)   DISPLAY              DRK SEP12
         OI    SPFVTCYL+6,C'0'           MAKE PRINTABLE       DRK SEP12
         L     R1,LSPDTTRK               TOTAL ADDL FREE TRKS DRK DEC98
         CVD   R1,DOUBLE                 PACKED               DRK DEC98
         UNPK  SPFVTTRK(7),DOUBLE+4(4)   DISPLAY              DRK SEP12
         OI    SPFVTTRK+6,C'0'           MAKE PRINTABLE       DRK SEP12
         L     R1,LSPDLCYL               CYLS IN LARGEST FREE DRK DEC98
         AIF   ('&SYSPARM' NE 'CSC-STL').S2K4                 DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K001'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'050000'             *** TEST ***         DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K002'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'075000'             *** TEST ***         DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K003'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'100000'             *** TEST ***         DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K004'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'125000'             *** TEST ***         DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K005'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'150000'             *** TEST ***         DRK SEP12
*        CLC   UCBVOLI(6),=C'S2K006'     *** TEST ***         DRK SEP12
*        BNE   *+4+4                     *** TEST ***         DRK SEP12
*        A     R1,=F'1175000'            *** TEST ***         DRK SEP12
.S2K4    ANOP                                                 DRK SEP12
         CVD   R1,DOUBLE                 PACKED               DRK DEC98
         UNPK  SPFVLCYL(7),DOUBLE+4(4)   DISPLAY              DRK SEP12
         OI    SPFVLCYL+6,C'0'           MAKE PRINTABLE       DRK SEP12
         L     R1,LSPDLTRK               ADDL TRKS IN LARGEST DRK DEC98
         CVD   R1,DOUBLE                 PACKED               DRK DEC98
         UNPK  SPFVLTRK(7),DOUBLE+4(4)   DISPLAY              DRK SEP12
         OI    SPFVLTRK+6,C'0'           MAKE PRINTABLE       DRK SEP12
         L     R1,LSPDF0S                FORMAT 0 COUNT       DRK DEC98
         CVD   R1,DOUBLE                 PACKED               DRK DEC98
         UNPK  SPFVFMT0(7),DOUBLE+4(4)   DISPLAY              DRK SEP12
         OI    SPFVFMT0+6,C'0'           MAKE PRINTABLE       DRK SEP12
         L     R1,LSPDVIRS               FREE VIR COUNT       DRK DEC98
         CVD   R1,DOUBLE                 PACKED               DRK DEC98
         UNPK  SPFVVIRS(7),DOUBLE+4(4)   DISPLAY              DRK SEP12
         OI    SPFVVIRS+6,C'0'           MAKE PRINTABLE       DRK SEP12
         L     R1,LSPDNEXT               NUMBER FREE EXTENTS  DRK DEC98
         CVD   R1,DOUBLE                 PACKED               DRK DEC98
         UNPK  DOUBLE(5),DOUBLE+5(3)     DISPLAY              DRK DEC98
         OI    DOUBLE+4,X'F0'            MAKE PRINTABLE       DRK DEC98
         MVC   SPFVXNUM(4),DOUBLE+1      MOVE 4 BYTES         DRK DEC98
         L     R1,LSPDFRAG               FRAGMENTATION INDEX  DRK DEC98
         CVD   R1,DOUBLE                 PACKED               DRK DEC98
         UNPK  DOUBLE(5),DOUBLE+5(3)     DISPLAY              DRK DEC98
         OI    DOUBLE+4,X'F0'            MAKE PRINTABLE       DRK DEC98
         MVC   SPFVFRAG(4),DOUBLE+1      MOVE 4 BYTES         DRK DEC98
.MVS710X ANOP                                                 DRK MAR16
         AIF   ('&SYSPARM' NE 'CSC-STL').S2K5                 DRK SEP12
*        DROP  R14                       *** TEST ***         DRK SEP12
.S2K5    ANOP                                                 DRK SEP12
         LA    R15,SPFVTCYL                                    SS NOV85
         BAS   R1,ISPLSPCS             LITTLE SUB              SS NOV85
         LA    R15,SPFVTTRK                                    SS NOV85
         BAS   R1,ISPLSPCS             LITTLE SUB              SS NOV85
         LA    R15,SPFVLCYL                                    SS NOV85
         BAS   R1,ISPLSPCS             LITTLE SUB              SS NOV85
         LA    R15,SPFVLTRK                                    SS NOV85
         BAS   R1,ISPLSPCS             LITTLE SUB              SS NOV85
         LA    R15,SPFVFMT0                                   DRK DEC98
         BAS   R1,ISPLSPCS             LITTLE SUB             DRK DEC98
         LA    R15,SPFVVIRS                                   DRK DEC98
         BAS   R1,ISPLSPCS             LITTLE SUB             DRK DEC98
         LA    R14,3                   FIRST 3 NUMBERS        DRK MAY98
         LA    R15,SPFVXNUM                                    SS NOV85
         BAS   R1,ISPLSPCL             LITTLE SUB LOOP        DRK MAY98
         LA    R14,3                   FIRST 3 NUMBERS        DRK DEC98
         LA    R15,SPFVFRAG                                   DRK DEC98
         BAS   R1,ISPLSPCL             LITTLE SUB LOOP        DRK DEC98
         SR    R15,R15                 SET 0 RC                SS APR87
         BR    R2                                              SS NOV85
ISPLSPCE DC    CL8'*VTOCERR'                                   SS NOV85
ISPLSPCS DS    0H                                              SS NOV85
         LA    R14,6                   FIRST 6 NUMBERS        DRK SEP12
ISPLSPCL CLI   0(R15),C'0'             STILL ZEROS             SS NOV85
         BHR   R1                      NO, END OF LEADING 0    SS NOV85
         MVI   0(R15),C' '             CONVERT TO BLANK        SS NOV85
         LA    R15,1(,R15)             NEXT NUMBER             SS NOV85
         BCT   R14,ISPLSPCL            LOOP FOR 6             DRK SEP12
         BR    R1                      ALL DONE                SS NOV85
*  DEVTYPE CHARACTERISTICS FOR DASD                            SS NOV85
*  R1=ADDRESS OF 4 BYTE DEVTYPE DATA (IE UCBTYP OR FROM CATLG) SS NOV85
*  R14=RETURNED ADDRESS OF TABLE ENTRY (SEE DVCT MACRO)        SS NOV85
*  R15=TRKS PER CYLINDER                                       SS NOV85
*                                                              SS NOV85
ISPDEVTC DS    0H                                              SS NOV85
         L     R14,CVTPTR(,R0)                                 SS NOV85
         L     R14,CVTZDTAB-CVT(R14)                           SS NOV85
         LA    R15,DVCTYPMK     MASK                           SS NOV85
         N     R15,0(R1)        TYPE DATA AND WITH MASK        SS NOV85
         IC    R15,0(R15,R14)   INDEX TO ENTRY                 SS NOV85
         LA    R14,0(R15,R14)   CALC ADDRESS                   SS NOV85
         LH    R15,DVCTRK-DVCT(R14)  TRACKS PER CYL            SS NOV85
         BR    R2                                              SS NOV85
*                                                              SS NOV85
*    GET FORMAT 4 DSCB   R1=ADDR OF VOLUME ID                  SS NOV85
*                                                              SS NOV85
ISPFMT4  DS    0H                                              SS NOV85
         LA    R14,WORKTBL     PUT FMT4 KEY HERE               SS AUG86
         MVI   0(R14),X'04'    KEY 04                          SS AUG86
         MVC   1(43,R14),0(R14)   RIPPLE                       SS AUG86
         B     ISPDSCB                                         SS NOV85
         SPACE 2                                               SS NOV85
*                                                              SS NOV85
*    GET FORMAT 1 DSCB                                         SS NOV85
*                        R1=ADDR OF VOLUME ID                  SS NOV85
*                       R14=ADDR OF DSN                        SS NOV85
ISPDSCB  DS    0H                                              SS NOV85
         MVC   SPFCAMLS(4),ISPDSCBS    SEARCH CAMLST           SS NOV85
         AIF   ('&MVSLEV' LT 'MVS710').NOEAV1                 DRK JAN13
         OI    SPFCAMLS+2,X'08'        SET EADSCB=OK BIT       JH JAN13
.NOEAV1  ANOP                                                 DRK JAN13
         B     ISPDSCB2                                        SS NOV85
*                                                              SS NOV85
*    GET DSCB BY CCHHR                                         SS NOV85
*                        R1=ADDR OF VOLUME ID                  SS NOV85
*                       R14=ADDR OF CCHHR                      SS NOV85
ISPDSCBC DS    0H                                              SS NOV85
         MVC   SPFCAMLS(4),ISPDSCBK    SEEK   CAMLST           SS NOV85
         AIF   ('&MVSLEV' LT 'MVS710').NOEAV2                 DRK JAN13
         OI    SPFCAMLS+2,X'08'        SET EADSCB=OK BIT       JH JAN13
.NOEAV2  ANOP                                                 DRK JAN13
ISPDSCB2 DS    0H                                              SS NOV85
         ST    R14,SPFCAMLS+4    DSN OR CCHHR                  SS NOV85
         ST    R1,SPFCAMLS+8     VOLUME                        SS NOV85
         LA    R15,SPFDSCB                                     SS NOV85
         ST    R15,SPFCAMLS+12   DSCB RETURN AREA              SS NOV85
         OBTAIN SPFCAMLS                                       SS NOV85
* CALLER CAN CHECK RETURN CODE                                 SS NOV85
         BR    R2                                              SS NOV85
ISPDSCBS CAMLST SEARCH,0,4,8                                   SS NOV85
         ORG    ISPDSCBS+4       OVERLAP CAMLST                SS AUG86
ISPDSCBK CAMLST SEEK,0,4,8                                     SS NOV85
         SPACE 2                                               SS NOV85
*                                                              SS MAY89
*    GET CATALOG ENTRY USING LOCATE                            SS MAY89
*                        R1=ADDR OF DSN                        SS MAY89
*                                                              SS MAY89
ISPCATL  DS    0H                                              SS MAY89
         MVC   SPFCAMLS(12),ISPCATLS   LOCATE CAMLST           SS MAY89
         ST    R1,SPFCAMLS+4    DSN                            SS MAY89
         LA    R15,WORKTBL                                     SS MAY89
         ST    R15,SPFCAMLS+12   VOL  RETURN AREA              SS MAY89
         LOCATE SPFCAMLS                                       SS MAY89
* CALLER CAN CHECK RETURN CODE                                 SS MAY89
         BR    R2                                              SS MAY89
ISPCATLS CAMLST NAME,0,,8                                      SS NOV85
         SPACE 2                                               SS NOV85
*                                                              SS NOV85
*                                                              SS NOV85
*  GET DEVICE GROUP NAME USING DEVICE TYPE (IE UCBTYP)         SS NOV85
*  R1=ADDRESS OF 4 BYTE DEVT DATA                              SS NOV85
*  R15=ADDRESS OF NAME  (ZERO IF NOT FOUND)                    SS NOV85
*  R0=RETURNED DEVTYPE WITH UNNESSARY BITS REMOVED             SS NOV85
ISPDEVNM DS    0H                                              SS NOV85
         L     R15,SPFSEC4A             BASE                   SS JUL88
         LA    R15,SPFDEVTT-SPFSEC4K(,R15) DEVTYPE TABLE       SS JUL88
         MVI   SPFDEVTL(R15),0          REUSE LAST ENTRY       SS JUL88
ISPDEVN6 DS    0H                       *                      SS JUL88
         CLI   0(R15),0                 LAST ENTRY             SS JUL88
         BE    ISPDEVN8                 NO MATCH               SS JUL88
         CLC   2(2,R15),2(R1)           MATCH ON DEV CLASS+TYP SS JUL88
         BE    ISPDEVN7                 YES                    SS JUL88
         LA    R15,12(,R15)             NEXT ENTRY             SS JUL88
         B     ISPDEVN6                 KEEP LOOKING           SS JUL88
ISPDEVN7 DS    0H                       *                      SS JUL88
         L     R0,0(R15)                LOAD GOOD ONE          SS JUL88
         LA    R15,4(,R15)              ADDR OF NAME           SS JUL88
         BR    R2                                              SS JUL88
ISPDEVN8 DS    0H                       *                      SS JUL88
         ST    R15,PARMLIST+28          SAVE POINTER           SS JUL88
         TM    SPFLAG5,SPFXA           XA SYSTEM               SS JUL88
         BO    ISPDEVN3                USE IEFEB4UV            SS NOV85
         L     R15,CVTPTR(,R0)         LOAD CVT ADDRESS        SS AUG88
         L     R15,CVTJESCT-CVT(R15)   JESCT                   SS NOV85
         L     R15,JESEDT-JESCT(R15)   EDT                     SS NOV85
* NO MACRO FOR EDT                                             SS NOV85
         L     R15,0(R15)              LOOK UP SECTION         SS NOV85
         L     R0,4(R15)               SIZE OF EACH ENTRY      SS NOV85
         L     R14,0(R14)              NUMBER OF ENTRIES       SS NOV85
         LA    R15,8(R15)              OVER HEADER             SS NOV85
ISPDEVN1 DS    0H                      LOOP BACK HERE          SS NOV85
         CLC   2(2,R1),10(R15)         COMPARE LAST 2 BYTES    SS NOV85
         BE    ISPDEVN2                GOT IT                  SS NOV85
         ALR   R15,R0                  NEXT ENTRY              SS NOV85
         BCT   R14,ISPDEVN1            KEEP LOOKING            SS NOV85
         SR    R15,R15                 NONE FOUND              SS NOV85
         SR    R0,R0                                           SS NOV85
         BR    R2                                              SS NOV85
ISPDEVN2 DS    0H                      GOT IT                  SS NOV85
         L     R0,8(R15)               LOAD GOOD DEVT          SS NOV85
         L     R14,PARMLIST+28         GET POINTER             SS JUL88
         ST    R0,0(R14)               GOOD DEVTYPE            SS JUL88
         MVC   4(8,R14),0(R15)         GOOD DEV NAME           SS JUL88
         BR    R2                                              SS NOV85
*   USE IEFEB4UV  (XA EDT SERVICE ROUTINE)                     SS NOV85
ISPDEVNF DC    X'2100'                 CONVERT DEVT TO NAME    SS NOV85
ISPDEVN3 DS    0H                                              SS NOV85
         LA    R15,PARMLIST+8          UNIT TABLE              SS NOV85
         ST    R15,PARMLIST                                    SS NOV85
         LA    R15,ISPDEVNF            FLAGS                   SS NOV85
         ST    R15,PARMLIST+4                                  SS NOV85
         OI    PARMLIST+4,X'80'                                SS NOV85
         MVC   PARMLIST+8+8(4),0(R1)   COPY DEVT               SS NOV85
         NI    PARMLIST+8+8+1,255-X'20' TURN OFF SHARE BIT     SS NOV85
         SR    R14,R14                                         SS NOV85
         ST    R14,PARMLIST+8+12       ZERO ATTRIBUTE AREA PT  SS NOV85
         LA    R1,PARMLIST                                     SS NOV85
         LINK  EP=IEFEB4UV                                     SS NOV85
         LTR   R15,R15                                         SS NOV85
         BZ    ISPDEVN4                                        SS NOV85
         SR    R15,R15                 NONE FOUND              SS NOV85
         SR    R0,R0                                           SS NOV85
         BR    R2                                              SS NOV85
ISPDEVN4 DS    0H                      GOT IT                  SS NOV85
         L     R0,PARMLIST+8+8         LOAD GOOD DEVT          SS NOV85
         LA    R15,PARMLIST+8          PT TO RETURNED NAME     SS NOV85
         L     R14,PARMLIST+28         GET POINTER             SS JUL88
         ST    R0,0(R14)               GOOD DEVTYPE            SS JUL88
         MVC   4(8,R14),0(R15)         GOOD DEV NAME           SS JUL88
         BR    R2                                              SS NOV85
*                                       *                      SS AUG89
*  GET DEVICE TYPE FOR A VOLUME         *                      SS AUG89
*  R15 = ADDRESS OF VOLUME              *                      SS AUG89
*  R1 IS THE RETURNED DEVICE TYPE       *                      SS AUG89
*  R15 = RC, 0 FOUND,  8  VOLUME NOT FOUND                     SS AUG89
ISPDEVTY DS    0H                       *                      SS AUG89
         CLC   SPFCLVOL,0(R15)          LAST VOL HERE          SS AUG89
         BNE   ISPDEVT1                 NO                     SS AUG89
         ICM   R1,B'1111',SPFCLDEV      GET DEVT FOR THIS VOL  SS AUG89
         SR    R15,R15                  RC0                    SS AUG89
         BR    R2                       ALL DONE               SS AUG89
ISPDEVT1 DS    0H                       *                      SS AUG89
         MVC   PARMLIST+16(6),0(R15)    SAVE VOL               SS AUG89
         L     R1,SPFSEC4A         GET  BASE                   SS AUG89
         LA    R1,SPFUCBSN-SPFSEC4K(,R1) POINT TO SPFUCBSN     SS AUG89
         XC    0(100,R1),0(R1)     ZERO FOR FRESH START        SS AUG89
*        XC    SRVUCBIC,SRVUCBIC   ZERO UCBSCAN IOC TOKEN     DRK JUN98
         L     R1,CVTPTR(,R0)      CVT                         SS AUG89
         L     R1,CVTUCBSC-CVT(R1) IOSSVSUCB  UCB SCAN         SS AUG89
         ST    R1,PARMLIST+12      SAVE ADDRESS                SS AUG89
ISPDEVTL DS    0H                       *                      SS AUG89
         AIF   ('&MVSLEV' GE 'MVS410').MVS410                 DRK JUN98
         L     R1,SPFSEC4A         GET  BASE                   SS AUG89
         LA    R1,SPFUCBSN-SPFSEC4K(,R1) POINT TO SPFUCBSN     SS AUG89
         ST    R1,PARMLIST                                     SS AUG89
         LA    R1,ISPDEVTZ                                     SS AUG89
         ST    R1,PARMLIST+4                                   SS AUG89
         LA    R1,SPFUCBA                                      SS AUG89
         ST    R1,PARMLIST+8                                   SS AUG89
         OI    PARMLIST+8,X'80'                                SS AUG89
         LA    R1,PARMLIST                                     SS AUG89
         L     R15,PARMLIST+12     ROUTINE ADDRESS             SS AUG89
         BASR  R14,R15                                         SS AUG89
         LTR   R15,R15                                         SS AUG89
         BNZ   ISPDEVTE            DONE                        SS AUG89
         L     R1,SPFUCBA                                      SS AUG89
         AGO   .MVS410X                                       DRK JUN98
.MVS410  ANOP                                                 DRK JUN98
         L     R1,SPFSEC4A         GET  BASE                  DRK JUN98
         LA    R1,SPFUCBSN-SPFSEC4K(,R1) POINT TO SPFUCBSN    DRK JUN98
         LR    R0,R1               UCBSCAN WORKAREA           DRK JUN98
         L     R15,CVTPTR(,R0)     CVT                        DRK JUN98
         TM    CVTOSLV1-CVT(R15),HBB5510  4-DIGIT UCBS?       DRK JUN98
         BO    ISPDEVT4                                       DRK JUN98
         UCBSCAN COPY,                                        DRK JUN98X
               WORKAREA=(R0),                                 DRK JUN98X
               UCBAREA=SRVUCBUC,                              DRK JUN98X
               DYNAMIC=YES,                                   DRK JUN98X
               DEVCLASS=DASD,                                 DRK JUN98X
               MF=(E,SRVUCBPL)                                DRK JUN98
         LTR   R15,R15                                        DRK JUN98
         BNZ   ISPDEVTE            DONE                       DRK JUN98
         LA    R1,SRVUCBUC         UCB ADDRESS                DRK JUN98
         B     ISPDEVTP            PROCESS UCB                DRK JUN98
ISPDEVT4 DS    0H                                             DRK JUN98
         UCBSCAN COPY,                                        DRK JUN98X
               WORKAREA=(R0),                                 DRK JUN98X
               UCBAREA=SRVUCBUC,                              DRK JUN98X
               RANGE=ALL,                                     DRK JUN98X
               DYNAMIC=YES,                                   DRK JUN98X
               DEVCLASS=DASD,                                 DRK JUN98X
               MF=(E,SRVUCBPL)                                DRK JUN98
         LTR   R15,R15                                        DRK JUN98
         BNZ   ISPDEVTE            DONE                       DRK JUN98
         LA    R1,SRVUCBUC         UCB ADDRESS                DRK JUN98
.MVS410X ANOP                                                 DRK JUN98
ISPDEVTP DS    0H
         USING UCBOB,R1                                        SS AUG89
         CLI   UCBTBYT3,X'20'      REALLY A DASD DEVICE        SS AUG89
         BNE   ISPDEVTL            NO, SKIP IT                 SS AUG89
         TM    UCBSTAT,UCBONLI     IS IT ONLINE                SS AUG89
         BZ    ISPDEVTL            NO, SKIP IT                 SS AUG89
         CLI   UCBVOLI,C' '        ANY VOLUME                  SS AUG89
         BNH   ISPDEVTL            NO VOLUME, SKIP IT          SS AUG89
         TM    UCBSTAT,UCBCHGS+UCBUNLD GOING OFFLINE           SS AUG89
         BNZ   ISPDEVTL            YES, SKIP IT                SS AUG89
         CLC   UCBVOLI(6),PARMLIST+16    THIS THE VOLUME       SS AUG89
         BNE   ISPDEVTL            NO, SKIP IT                 SS AUG89
         MVC   SPFCLVOL,UCBVOLI         SET NEW VOL            SS AUG89
         MVC   SPFCLDEV,UCBTYP          AND DEVTYP             SS AUG89
         NI    SPFCLDEV+1,255-UCBRR     OFF SHARE BIT          SS AUG89
         L     R1,SPFCLDEV              SET DEVTYP             SS AUG89
         SR    R15,R15                  RC0                    SS AUG89
         DROP  R1                                              SS AUG89
ISPDEVTE DS    0H                       *                      SS AUG89
         BR    R2                       *                      SS AUG89
ISPDEVTZ DC    X'2000'                  *                      SS AUG89
         SPACE 2                                               SS AUG89
*                                                              SS NOV85
*  DYNAMIC UNALLOCATE/DECONCATENATE                            SS NOV85
*  R0=02/04 S99VRBAL/S99VRBDC                                  SS NOV85
*  R1=ADDR OF DDNAME                                           SS NOV85
ISPUNALC DS    0H                                              SS NOV85
         XC    M99RBPTR(40),M99RBPTR    CLEAR THE WORK AREA
         LA    R14,M99RB
         USING S99RB,R14
         ST    R14,M99RBPTR
         OI    M99RBPTR,S99RBPND        MARK END OF LIST
         SPACE 1
         MVI   S99RBLN,20               LENGTH 20
         STC   R0,S99VERB               UNALLOC/DECONCAT
         LA    R15,M99TUPL
         ST    R15,S99TXTPP             POINT TO TEXT POINTERS
         MVC   WORKTBL+6(8),0(R1)       DDNAME                 SS NOV85
         LA    R1,WORKTBL                        START OF TEXT
         ST    R1,0(R15)                FIRST TEXT UNIT        SS NOV85
         MVC   0(6,R1),ISPUNAL2         DD TEXT UNIT           SS NOV85
         CLI   S99VERB-S99RB+M99RB,S99VRBDC  DECONCAT          SS NOV85
         BE    ISPUNAL1                                        SS NOV85
         LA    R1,WORKTBL+14            NEXT TEXT UNIT         SS NOV85
         LA    R15,4(,R15)              NEXT POINTER           SS NOV85
         ST    R1,0(R15)                SET  POINTER           SS NOV85
         MVC   0(4,R1),ISPUNAL3         UNALLOC PERM           SS NOV85
ISPUNAL1 OI    0(R15),X'80'             END OF LIST            SS NOV85
         B     ISPDYNA                  DO DYNAM               SS NOV85
ISPUNAL2 DC    X'000100010008'         BY DDNAME               SS NOV85
ISPUNAL3 DC    X'00070000'             UNALLOC EVEN PERM       SS NOV85
*                                                              SS NOV85
*  DYNAMIC ALLOCATION INTERFACE                                SS NOV85
*    M99RBPTR MUST BE SET BY USER                              SS NOV85
*    R15= RETURN CODE,  ANY ERROR MESSAGE WILL BE PRESET       SS NOV85
*                                                              SS NOV85
ISPDYNA  DS    0H                                              SS NOV85
         LA    R1,M99RBPTR                                     SS NOV85
         DYNALLOC                                              SS NOV85
         DROP  R14                                            DRK NOV98
         LTR   R15,R15                                         SS NOV85
         BZR   R2                                              SS NOV85
         ST    R15,DOUBLE            TEMP SAVE                 SS NOV85
         LA    R14,M99RB                POINTER TO SVC 99 BLOCK
         ST    R15,DAIRRC               RETURN CODE
         LA    R15,DAIRRC               POINTER TO RETURN CODE
         LA    R0,ADDRFF02              POINTER TO A(IKJEFF02)
         LA    R1,ISPDYN5               POINTER TO INVOCATION TYPE
         CLI   S99VERB-S99RB+M99RB,S99VRBAL                    SS NOV85
         BE    ISPDYN2                                         SS NOV85
         CLI   S99VERB-S99RB+M99RB,S99VRBCC                    SS NOV85
         BE    ISPDYN2                                         SS NOV85
         LA    R1,ISPDYN6               POINTER TO INVOCATION TYPE
         CLI   S99VERB-S99RB+M99RB,S99VRBUN                    SS NOV85
         BE    ISPDYN2                                         SS NOV85
         CLI   S99VERB-S99RB+M99RB,S99VRBDC                    SS NOV85
         BE    ISPDYN2                                         SS NOV85
         B     ISPDYN3                                         SS NOV85
ISPDYN2  DS    0H                                              SS NOV85
         STM   R14,R1,DFDAPLP           INITIALIZE DFDAPLP, DFDRCP,
*                                         DFJEFF02, DFIDP      SS NOV85
         L     R1,ADDRCPPL              POINTER TO THE CPPL    SS NOV85
         ST    R1,DFDAPLP+16               AND DFCPPLP         SS NOV85
         SPACE 1
         LINK  EP=IKJEFF18,MF=(E,DFPARMS)
ISPDYN3  DS    0H                                              SS NOV85
         MVC   SPFMLIN2,ISPDYN7                                SS NOV85
         SR    R1,R1                                           SS NOV85
         ICM   R1,3,S99ERROR-S99RB+M99RB  ERROR CODE           SS NOV85
         LR    R0,R2                                           SS NOV85
         BAS   R2,ISPHEXCV                                     SS NOV85
         LR    R2,R0                                           SS NOV85
         MVC   SPFMLIN2+29(4),SPFHEXCV+4                       SS NOV85
         MVC   SPFMSGID,ISPPDSM    BASE MESSAGE                SS NOV85
         MVI   SPFMSGID+6,C'1'                                 SS NOV85
         MVI   SPFMSGID+7,C'A'                                 SS NOV85
         L     R15,DOUBLE          RELOAD RETURN CODE          SS NOV85
         BR    R2                                              SS NOV85
ISPDYN5  DC    AL2(DFSVC99)                                    SS NOV85
ISPDYN6  DC    AL2(DFFREE)                                     SS NOV85
ISPDYN7  DC    CL79'DYNALLOC - ERROR REASON CODE=0000, SEE AUTHORIZED A*
               SSEMBLER SERVICES GUIDE'                       DRK APR13
         AGO   .SKIPN7
ISPDYN7  DC    CL79'DYNAMIC ALOC/UNAL ERROR CODE=0000, SEE TUTORIAL APP*
               ENDIX A'                                        SS NOV85
.SKIPN7  ANOP
         TITLE 'P D S  --  ISPF DIALOG SUB INTERFACES'
*                                                              SS AUG86
*  LOW LV  SUBROUTINES                                         SS AUG86
*                                                              SS AUG86
*                                                              SS NOV85
*       INTERFACE FOR ISPPARSE                                 SS NOV85
*                                                              SS NOV85
ISPPARSI DS    0H                                              SS NOV85
         L     R0,ISPPARSA   LOAD ADDRESS OF SUBROUTINE        SS AUG86
         B     ISPSUBL0                                        SS AUG86
         SPACE 1                                               SS MAR85
ISPSORTI DS    0H                       *                      SS OCT88
         L     R15,ISPSORTA ADDRESS FOR SORT                   SS OCT88
         B     ISPSUBIL  INTERFACE      *                      SS OCT88
         SPACE 1                                               SS OCT88
*                                                              SS OCT88
*  LOW LV  SUBROUTINE INTERFACE CODE (ADDRESS IN R15)          SS OCT88
*                                                              SS OCT88
ISPSUBIL DS    0H                                              SS OCT88
         STM   R2,R4,SPFSVLR2                                  SS OCT88
         LR    R4,R15        LOAD ADDRESS OF SUBROUTINE        SS OCT88
         BASR  R3,R4                                           SS OCT88
         LM    R2,R4,SPFSVLR2                                  SS OCT88
         BR    R2                                              SS OCT88
         SPACE 2                                               SS OCT88
*                                                              SS OCT88
*  LOW LV  SUBROUTINE INTERFACE CODE (ADDRESS IN R0)           SS OCT88
*                                                              SS OCT88
ISPSUBL0 DS    0H                                              SS OCT88
         STM   R2,R4,SPFSVLR2                                  SS OCT88
         LR    R4,R0         LOAD ADDRESS OF SUBROUTINE        SS OCT88
         BASR  R3,R4                                           SS OCT88
         LM    R2,R4,SPFSVLR2                                  SS OCT88
         BR    R2                                              SS OCT88
         SPACE 5                                               SS OCT88
*                                                              SS NOV85
*  MED LEV SUBROUTINES                                         SS NOV85
*                                                              SS NOV85
*  THESE SAVE R2-R4 AND USE A BASR R3,R4 FOR LINKAGE           SS NOV85
*  RETURN IS BY R2                                             SS NOV85
         SPACE 1                                               SS NOV85
*                                                              SS SEP84
*  SUBROUTINE TO LOCATE COMMAND IN BUFFER AND MATCH WITH TABLE SS SEP84
*  OF COMMANDS                                                 SS SEP84
*  ENTRY ISPVER FOR ZCMD  BUFFER                               SS SEP84
*                                                              SS SEP84
ISPVERG  DS    0H            FIND VERB WITH GIVEN PARMS        SS NOV84
         LA    R15,30         LIMIT OF SCAN                    SS SEP84
         B     ISPVER1                                         SS SEP84
ISPVER1  DS    0H                                              SS MAR85
         STM   R2,R4,SPFSAVR2                                  SS NOV85
         L     R4,ISPVERAD   LOAD ADDRESS OF VERB SUBROUTINE   SS MAR85
         BASR  R3,R4                                           SS NOV85
         LM    R2,R4,SPFSAVR2                                  SS NOV85
         BR    R2                                              SS NOV85
         SPACE 1                                               SS NOV85
*                                                              SS NOV85
*       INTERFACE FOR ISPPAND                                  SS NOV85
*                                                              SS NOV85
ISPPANDI DS    0H                                              SS NOV85
         STM   R2,R4,SPFSAVR2                                  SS NOV85
         L     R4,ISPPANDA   LOAD ADDRESS OF SUBROUTINE        SS MAR85
         BASR  R3,R4                                           SS NOV85
         LM    R2,R4,SPFSAVR2                                  SS NOV85
         BR    R2                                              SS NOV85
         SPACE 1                                               SS MAR85
*                                                              SS NOV85
*       INTERFACE FOR ISPSETVS                                 SS NOV85
*                                                              SS NOV85
ISPSETVI DS    0H                                              SS NOV85
         L     R0,ISPSETVA   LOAD ADDRESS OF SUBROUTINE        SS AUG86
         B     ISPSUBI                                         SS AUG86
         SPACE 1                                               SS MAR85
*                                                              SS NOV85
*       INTERFACE FOR MEMLIST                                  SS NOV85
*                                                              SS NOV85
MEMLISTI DS    0H                                              SS NOV85
         L     R0,AMEMLIST   LOAD ADDRESS OF SUBROUTINE        SS AUG86
         B     ISPSUBI                                         SS AUG86
         SPACE 1                                               SS MAR85
*                                                              SS NOV85
*       INTERFACE FOR FIND COMMAND                             SS NOV85
*                                                              SS NOV85
ISPFNDI  DS    0H                                              SS NOV85
         L     R0,ISPFNDA    LOAD ADDRESS OF SUBROUTINE        SS AUG86
         B     ISPSUBI                                         SS AUG86
*                                                              SS NOV85
*       INTERFACE FOR ISPVSTAT                                 SS NOV85
*                                                              SS NOV85
ISPVSTAI DS    0H                                              SS NOV85
         L     R0,ISPVSTAA   LOAD ADDRESS OF SUBROUTINE        SS AUG86
         B     ISPSUBI                                         SS AUG86
         SPACE 1                                               SS MAR85
*                                                              SS NOV85
*       INTERFACE FOR ISPVSPAC                                 SS NOV85
*                                                              SS NOV85
ISPVSPAI DS    0H                                              SS NOV85
         L     R0,ISPVSPAA   LOAD ADDRESS OF SUBROUTINE        SS AUG86
         B     ISPSUBI                                         SS AUG86
         SPACE 1                                               SS MAR85
*                                                              SS NOV85
*       INTERFACE FOR SINGLE PANEL DISPLAY                     SS AUG86
*                                                              SS AUG86
ISPSINGI DS    0H                                              SS AUG86
         L     R0,ISPSINGA   LOAD ADDRESS OF SUBROUTINE        SS AUG86
         B     ISPSUBI                                         SS AUG86
         SPACE 1                                               SS MAR85
*                                                              SS NOV85
*       INTERFACE FOR ISPEXEC SELECT                           SS AUG86
*                                                              SS AUG86
ISPSLCTI DS    0H                                              SS AUG86
         L     R0,ISPSLCTA   LOAD ADDRESS OF SUBROUTINE        SS AUG86
         B     ISPSUBI                                         SS AUG86
         SPACE 3                                               SS AUG86
*                                                              SS NOV85
*       INTERFACE FOR OPEN LISTC/LISTF TABLE                   SS AUG86
*                                                              SS AUG86
ISPLSCOI DS    0H                                              SS AUG86
         L     R0,ISPLSCOA   LOAD ADDRESS OF SUBROUTINE        SS AUG86
         B     ISPSUBI                                         SS AUG86
         SPACE 3                                               SS AUG86
*                                                              SS NOV88
*       INTERFACE TO CHANGE VIEW LOG                           SS NOV88
*                                                              SS NOV88
ISPVIEWI DS    0H                                              SS NOV88
         L     R15,ISPVIEWA  LOAD ADDRESS OF SUBROUTINE        SS NOV88
         B     ISPSUBM                                         SS NOV88
         SPACE 3                                               SS NOV88
*                                                              SS AUG86
*  MED LV  SUBROUTINE INTERFACE CODE, R0=ADDR                  SS NOV88
*                                                              SS AUG86
ISPSUBI  DS    0H                                              SS AUG86
         STM   R2,R4,SPFSAVR2                                  SS NOV85
         LR    R4,R0         LOAD ADDRESS OF SUBROUTINE        SS AUG86
         BASR  R3,R4                                           SS NOV85
         LM    R2,R4,SPFSAVR2                                  SS NOV85
         BR    R2                                              SS NOV85
         SPACE 5                                               SS MAR85
*                                                              SS NOV88
*  MED LV  SUBROUTINE INTERFACE CODE, R15=ADDR                 SS NOV88
*                                                              SS NOV88
ISPSUBM  DS    0H                                              SS NOV88
         STM   R2,R4,SPFSAVR2                                  SS NOV85
         LR    R4,R15        LOAD ADDRESS OF SUBROUTINE        SS NOV88
         BASR  R3,R4                                           SS NOV88
         LM    R2,R4,SPFSAVR2                                  SS NOV88
         BR    R2                                              SS NOV88
         SPACE 5                                               SS NOV88
*                                                              SS NOV85
*    LOG COMMAND IN SESSION LOG                                SS NOV85
*                                                              SS NOV85
ISPLOGCD DS    0H                                              SS NOV85
         STM   R2,R4,SPFSVLR2                                  SS NOV85
         LA    R15,1(,R15)                                    ABL OCT84
         ST    R15,SPFSTART                                   ABL OCT84
         LH    R3,0(,R1)          GET BUFFER LENGTH            SS MAY85
         LA    R4,4(,R1)                                       SS MAY85
         S     R3,ISPL4           LESS -4 FOR HEADER           SS MAY85
         MVI   SPFLINE,C'>'       FLAG CMD LINE                SS MAY85
ISPCOLP  MVI   SPFLINE+1,C' '     BLANK                        SS MAY85
         MVC   SPFLINE+2(158),SPFLINE+1 RIPPLE                 SS OCT88
         CH    R3,ISPH78          LENGTH 78                    SS MAY85
         BNH   ISPCOLPL           LESS , LAST                  SS MAY85
         CLC   SPFLINE+1(78),0(R4) IS IT A BLANK LINE          SS MAY85
         BE    ISPCOLPN           YES SKIP TO NEXT             SS MAY85
         MVC   SPFLINE+1(78),0(R4) COPY GOOD LINE              SS MAY85
         BAS   R2,ISPADDCO        PUT IT INTO THE TABLE        SS MAY85
         MVI   SPFLINE,C'-'       FLAG ADDITIONAL LINES        SS MAY85
ISPCOLPN LA    R4,78(,R4)         NEXT PART OF LINE            SS MAY85
         SH    R3,ISPH78          REDUCE BY LENGTH             SS MAY85
         B     ISPCOLP                                         SS MAY85
ISPCOLPL BCTR  R3,0               ONE LESS FOR MVC             SS MAY85
         CLC   SPFLINE+1(0),0(R4) IS IT A BLANK LINE           SS MAY85
         EX    R3,*-6             EXECUTE IT                   SS MAY85
         BE    ISPCOLPS                                        SS MAY85
         MVC   SPFLINE+1(0),0(R4) COPY TO OUTPUT LINE          SS MAY85
         EX    R3,*-6             EXECUTE IT                   SS MAY85
         BAS   R2,ISPADDCO                                     SS MAY85
ISPCOLPS DS    0H                                              SS MAY85
         NI    SPFLAG3,FF-SPFLOGM LOGGED NOW                  ABL OCT84
         LM    R2,R4,SPFSVLR2                                  SS NOV85
         BR    R2                                              SS NOV85
         SPACE 5                                               SS MAR85
*                                                              SS NOV85
*       INTERFACE FOR ISPSTACK                                 SS NOV85
*                                                              SS NOV85
*  SWAP TO LOG                                                 SS NOV85
ISPSTKLG DS    0H                                              SS NOV85
         LH    R1,SPFFUNLP+0       GET LOG LAST PANEL          SS NOV88
         LNR   R1,R1               SET FOR SWAP                SS NOV88
*  STACK PANEL INDEX IN R1                                     SS NOV85
ISPSTKI  DS    0H                                              SS NOV85
         STM   R2,R4,SPFSVLR2                                  SS OCT88
         L     R4,ISPSTKA    LOAD ADDRESS OF SUBROUTINE        SS MAR85
         BASR  R3,R4                                           SS NOV85
         LM    R2,R4,SPFSVLR2                                  SS OCT88
         C     R15,ISPL8                                       SS NOV85
         BNL   ISPERR                                          SS NOV85
         BR    R2                                              SS NOV85
         SPACE 5                                               SS MAR85
*                                                              SS NOV85
*       MEMLIST UNSTACK (HAS INTERFACE TO ISPSTACK)            SS NOV85
*       (TERMINATE MEMLIST)                                    SS OCT88
*                                                              SS NOV85
ISPTERMM DS    0H                                              SS NOV85
ISPUSTKM DS    0H                                              SS NOV85
         STM   R2,R4,SPFSVLR2                                  SS OCT88
         L     R4,ISPSTKA    LOAD ADDRESS OF SUBROUTINE        SS MAR85
         CLI   SPFFUNST+1,C'I'   INACTIVE MEMLIST              SS AUG86
         BE    ISPUSTK8          OK     *                      SS AUG86
* HIERARCHICAL SUPPORT REMOVED                                 SS OCT88
ISPUSTK4 DS    0H                       *                      SS AUG86
         BAS   R2,ISPSETST              SAVE STATS ORG TABLE   SS AUG86
         CLI   SPFTBPFI+1,1             MEMLIST FUNCTION       SS AUG86
         BE    ISPUSTK6                 YES, KILL TABLE        SS AUG86
         STH   R14,SPFTSVH              SAVE PANEL ID          SS AUG86
         LH    R1,SPFFUNLP+2            GET MEMLIST PANEL ID   SS AUG86
         LNR   R1,R1                    SET FOR SWAP           SS AUG86
         BASR  R3,R4                                           SS NOV85
ISPUSTK6 DS    0H                       *                      SS AUG86
         NI    SPFTFLG1,255-SPFTZSV-SPFTRET  CANCEL THEM       SS AUG86
         TM    SPFTFLG1,SPFTLCD         PENDING LINE CMDS?    ABL FEB87
         BZ    ISPUSTK7                 NO, BRANCH            ABL FEB87
         NI    SPFTFLG1,255-SPFTLCD-SPFTMUT RESET CANCEL      ABL FEB87
ISPUSTK7 DS    0H                                             ABL FEB87
         BAS   R2,ISPTBT#M       DELETE MEMLIST TABLE          SS AUG86
         BAS   R2,ISPSETST       UPDATE STATUS                 SS AUG86
         LH    R1,SPFFUNLP              GET LOG PANEL ID       SS AUG86
         LNR   R1,R1                    SET FOR SWAP           SS AUG86
         BASR  R3,R4                                           SS NOV85
ISPUSTK8 DS    0H                       *                      SS AUG86
         LM    R2,R4,SPFSVLR2                                  SS OCT88
         BR    R2                                              SS NOV85
         SPACE 5                                               SS MAR85
ISPEXIT  DS    0H                                              SS JUL84
         TM    SPFLAG3,SPFREFR          NEED REFRESH           SS AUG86
         BZ    ISPEXIT2                 NO                     SS AUG86
*        BAS   R2,ISPCTLSM        FORCE DISPLAY REFRESH        SS AUG88
         L     R1,SPFSAV1         RELOAD R1                    SS AUG86
ISPEXIT2 MVI   SPFLAG1,0      TURN OFF FUNCTION                SS AUG86
         LM    R2,R8,SPFSAV2                                   SS AUG86
         L     R14,SPFSAV14                                    SS JUL84
         B     4(R14)                                          SS JUL84
         SPACE 5                                               SS MAR85
*                                                              SS AUG86
*  HIGH LEVEL SUBROUTINE INTERFACES                            SS NOV88
*                                                              SS AUG86
         SPACE 5                                               SS MAR85
*                                                              SS AUG86
*  TRAP COMMAND OUTPUT  INTERFACES                             SS NOV88
*                                                              SS AUG86
ISPTRAPI DS    0H                       *                      SS NOV88
         L     R0,ISPTRAPA              *                      SS NOV88
         B     ISPSUBIH                 *                      SS NOV88
         SPACE 5                                               SS MAR85
*                                                              SS AUG86
*  HIGH LEVEL SUBROUTINE INTERFACE CODE, R0=ADDR               SS NOV88
*                                                              SS AUG86
ISPSUBIH DS    0H                                              SS AUG86
         STM   R2,R4,SPFSVHR2                                  SS NOV85
         LR    R4,R0         LOAD ADDRESS OF SUBROUTINE        SS AUG86
         BASR  R3,R4                                           SS NOV85
         LM    R2,R4,SPFSVHR2                                  SS NOV85
         BR    R2                                              SS NOV85
         SPACE 5                                               SS MAR85
         TITLE 'P D S  --  ISPF DIALOG CONSTANTS'
*                                                              SS JUL84
*  CONSTANTS                                                   SS JUL84
*                                                              SS JUL84
*  ISPF FUNCTIONS                                              SS JUL84
ISPCNTL  DC    C'CONTROL'                                      SS JUL84
ISPDISP  DC    C'DISPLAY'                                      SS NOV84
ISPLOG   DC    C'LOG '                                        ABL FEB87
TBADD    DC    C'TBADD'                                        SS JUL84
TBBOTTOM DC    C'TBBOTTOM'                                     SS JUL84
TBCREATE DC    C'TBCREATE'                                     SS JUL84
TBDELETE DC    C'TBDELETE'                                     SS JUL84
TBDISPL  DC    C'TBDISPL'                                      SS JUL84
TBEND    DC    C'TBEND'                                        SS JUL84
TBGET    DC    C'TBGET'                                        SS JUL84
TBMOD    DC    C'TBMOD'                                        SS JUL84
TBPUT    DC    C'TBPUT'                                        SS JUL84
TBQUERY  DC    C'TBQUERY'                                      SS JUL84
TBSCAN   DC    C'TBSCAN'                                       SS JUL84
TBSKIP   DC    C'TBSKIP'                                       SS JUL84
TBTOP    DC    C'TBTOP'                                        SS JUL84
TBVCLEAR DC    C'TBVCLEAR'                                     SS JUL84
TBSORT   DC    C'TBSORT'                                       SS AUG86
VCOPY    DC    C'VCOPY'                                        SS JUL84
VDEFINE  DC    C'VDEFINE'                                      SS JUL84
VDELETE  DC    C'VDELETE'                                      SS JUL84
VGET     DC    C'VGET'                                         SS JUL84
VPUT     DC    C'VPUT'                                         SS OCT88
VRESET   DC    C'VRESET'                                       SS JUL84
VREPLACE DC    C'VREPLACE'                                     SS DEC87
*  ISPF OPERANDS                                               SS JUL84
ISPLRSCR DC    C'LRSCROLL'                                    DRK JUN19
ISPPASON DC    C'PASON'                                       DRK JUN19
ISPPASOF DC    C'PASOFF'                                      DRK JUN19
ISPDSP   DC    C'DISPLAY'                                      SS JUL84
ISPNOND  DC    C'NONDISPL'                                     SS NOV84
ISPENTER DC    C'ENTER'                                        SS JUL87
ISPERRS  DC    C'ERRORS'                                       SS AUG86
ISPRETN  DC    C'RETURN'                                       SS AUG86
ISPCANCL DC    C'CANCEL'                                       SS AUG86
ISPORDER DC    C'ORDER'                                        SS AUG86
ISPSAVE  DC    C'SAVE'                                         SS JUL84
ISPRSTR  DC    C'RESTORE'                                      SS JUL84
ISPCHAR  DC    C'CHAR'                                         SS JUL84
ISPFIX   DC    C'FIXED'                                        SS JUL84
ISPMOVE  DC    C'MOVE'                                         SS JUL84
ISPNOWRT DC    C'NOWRITE'                                      SS JUL84
ISPNORAD DC    C'NOREAD '                                      SS MAY89
ISPNEXT  DC    C'NEXT'                                         SS JUL87
*SPPANAL DC    C'P..PN   '                                     SS NOV85
ISPPDSM  DC    C'PDS&M..N'                                    ABL OCT84
ISPL1A   DC    C'PDS&M.1A'                                    DRK AUG98
ISPL1C   DC    C'PDS&M.1C'                                    DRK AUG08
ISPSM    DC    C'SM '                                         ABL OCT84
ISPSHARE DC    C'SHARED '                                     ABL SEP84
ISPPROFL DC    C'PROFILE '              *                      SS AUG86
ISPYES   DC    C'YES'          GENERAL PURPOSE YES AND NO      SS DEC87
ISPNO    DC    C'NO '          TBDSPLY AUTOSEL=NO              SS MAR85
ISPCCMD  DC    C'CMD'          SELECT CMD                      SS AUG86
ISPPGM   DC    C'PGM'          SELECT PGM                      SS AUG86
ISPTRAP  DC    C'TRP'          SYSOUT TRAP OPTION              SS NOV88
ISPGT    DC     C'(GT)'            CONDLIST(NE)                SS JUL87
*  ISPF VARIABLE NAMES AND NAME LISTS                          SS JUL84
VSPFVFIX DC    C'('        START OF FIX DIALOG VERBS           SS SEP84
VSPFFIX  DC    C'PDSFIX '                                      SS JUL84
VSPFFIX2 DC    C'PDSFIX2 '                                     SS JUL84
VSPFCRP  DC    C'PDSCRP '                                      SS JUL84
VZTDTOP  DC    C'ZTDTOP '                                      SS JUL84
VZTDSELS DC    C'ZTDSELS '              *                      SS AUG86
         DC    C'PDSCSIZE '             *                      SS AUG86
         DC    C'PDSCMAX '              *                      SS AUG86
         DC    C'PDSCCKPT '             *                      SS AUG86
         DC    C'PDSTTSIZ '             *                      SS OCT88
         DC    C'ZSCROLLN '             *                      SS OCT88
         DC    C')'        END OF FIX DIALOG VERBS             SS SEP84
VSPFMSG  DC    C'PDSMSG '                                      SS JUL84
VSPFMSG1 DC    C'PDSMSG1 '                                    ABL JUN85
VSPFMSG2 DC    C'PDSMSG2 '                                    ABL JUN85
VZCMD    DC    C'ZCMD '                                        SS JUL84
VZTIME   DC    C'ZTIME '                                       SS JUL84
VZSCREEN DC    C'ZSCREEN '                                    DRK MAR03
VZENVIR  DC    C'ZENVIR '  ISPF V2 INDICATOR                   SS MAR85
VZVERB   DC    C'ZVERB '                                      ABL SEP84
VZSCRLL  DC    C'('                     *                      SS OCT88
VZSCRLA  DC    C'ZSCROLLA '             *                      SS OCT88
VZSCRLN  DC    C'ZSCROLLN '             *                      SS OCT88
         DC    C')'                     *                      SS OCT88
VPDSLN1  DC    C'PDSLN1 '               *                      SS OCT88
VPDSLN2  DC    C'PDSLN2 '               *                      SS OCT88
VPDSLN1W DC    C'PDSLN1W '                                    DRK JUL04
VPDSLIN  DC    C'(PDSLN1 PDSLN2 PDSLN1W)' TABLE VARIABLES     DRK JUL04
* THE FOLLOWING CONSTANTS DEFINE THE TABLE VARIABLES, BOTH KEY AND
*   NAMES
         SPACE
MEMLTKEY DC    C'(MEMLNAME)'       TABLE KEY
         SPACE 3
MEMLTDAT DC    C'MEMLDATA '        USER ENTERED DATA
MMLOPT   DC    C'MEMLOPT '
MMLALIS  DC    C'MEMLALIS '
MMLTTR   DC    C'MEMLTTR '         MEM TBL ALIAS SCAN ARG LIST
         SPACE
         EJECT
*  ISPF VARIABLE LENGTHS
ISPL0    DC    F'0'                     *                      SS MAY89
ISPL1    DC    F'1'                     LENGTH OF TYPE  VAR    SS SEP84
ISPL2    DC    F'2'                     LENGTH OF DSORG VAR    SS SEP84
ISPL4    DC    F'4'                     LENGTH OF FIXED VAR    SS JUL84
ISPL6    DC    F'6'                     LENGTH OF VOLUME VAR   SS SEP84
ISPL8    DC    F'8'                     LENGTH OF 8            SS JUL84
ISPL32   DC    F'32'                    LENGTH OF ZENVIR       SS MAR85
ISPL44   DC    F'44'                    LENGTH OF DSN          SS SEP84
ISPLMSG  DC    F'79'                    LENGTH OF SPFMSG      ABL NOV84
ISPL80   DC    F'80'                    LENGTH OF TABLE VAR   ABL APR86
ISPL250  DC    F'250'                   LENGTH OF ZSEL/ZCMD    SS SEP84
ISPX80   DC    X'80000000'              HI ORDER BIT           SS JUL88
ISPH78   DC    H'78'                    LENGTH OF MSG VAR-1    SS JUL84
ISPH79   DC    H'79'                    LENGTH OF TABLE VAR-1 ABL APR86
ISPH159  DC    H'159'                   LENGTH OF LINE         SS OCT88
ISPH5    DC    H'5'                     LEN PUTL BUF LESS HEAD SS JUL84
ISPH12   DC    H'12'                    RC 16                  SS NOV84
ISPH16   DC    H'16'                    RC 16                  SS NOV84
ISPH9999 DC    H'9999'                  *                      SS AUG86
ISPLEN   DC    H'52',H'0'               LENGTH (ZCMD+4,0)     ABL OCT84
ISPLEN2  DC    H'254',H'0'              LENGTH (ZCMD+4,0)      SS NOV84
*  ISPF SUBROUTINE ACONS
ISPVERAD DC    A(ISPVER11)                                     SS MAR85
ISPALICA DC    A(ISPALICK)                                     SS MAR85
ISPTBDSA DC    A(ISPTBDSP)                                     SS MAR85
ISPPANDA DC    A(ISPPAND)                                      SS MAR85
ISPSETVA DC    A(ISPSETVS)                                     SS MAR85
ISPPARSA DC    A(ISPPARSE)                                     SS MAR85
ISPVINIA DC    A(ISPVINIT)                                     SS MAR85
ISPSTKA  DC    A(ISPSTACK)                                     SS NOV85
ISPESTAE DC    V(STAEEXIT)                                    ABL JUN85
VLOGDATA DC    V(LOGDATA)                                      SS JUL85
ISPRLOGA DC    A(ISPRLOG)                                      SS MAY85
ISPFNDA  DC    A(ISPFND)                                       SS NOV85
AMEMLIST DC    A(MEMLIST)                                      SS JUL85
MEMLFUNA DC    A(MEMLFUNC)                                     SS NOV85
ISPLNCA  DC    A(ISPLNC2)                                     ABL FEB86
ISPMOVEA DC    A(ISPMOVES)              MOVE TABLE             SS AUG86
ISPVSTAA DC    A(ISPVSTAT)                                     SS AUG86
ISPVSPAA DC    A(ISPVSPAC)                                     SS AUG86
ISPSINGA DC    A(ISPSINGL)              MOVE TABLE             SS AUG86
ISPGET3A DC    A(GET370GN)              GET GENERIC            SS AUG86
ISPSLCTA DC    A(ISPSLCT)               ISPEXEC SELECT         SS AUG86
ISPTRAPA DC    A(ISPTRAPX)              TRAP TSO CMD OUTPUT    SS NOV88
ISPLSCOA DC    A(ISPLSCOP)              OPEN LISTC/LISTF TBL   SS OCT88
*  ISPF OTHER CONSTANTS
$ATT     DC    CL8'&NATT '                                     SS JUL85
$HIS     DC    CL8'&NHIS '                                     SS JUL85
$MAP     DC    CL8'&NMAP '                                     SS JUL85
$MML     DC    CL8'&NMML '                                     SS JUL85
$SUL     DC    CL8'&NSUL '                                    ABL APR86
$UT1     DC    CL8'&NUT1 '                                     SS JUL85
$UT2     DC    CL8'&NUT2 '                                     SS JUL85
ISPBLK44 DC    CL44' '                                        DRK AUG98
         ORG   ISPBLK44                                       DRK AUG98
ISPBLK8  DC    CL8' '                                          SS SEP84
         ORG   ,                                              DRK AUG98
ISPPDS   DC    C'PDS'                                          SS JUL84
ISPCEND  DC    C'END '                                         SS NOV84
ISPCPAN  DC    C'PANEL('                                       SS NOV84
ISP300A  DC    C'PDS300A'               MSG TO SKIP            SS AUG84
ISP381A  DC    C'PDS381A'               DSNAME PROMPT         ABL APR86
ISP390A  DC    C'PDS390A'               RESTORE PROMPT        ABL APR86
ISPALIS  DC    CL8'*AL*  '                                     SS SEP84
ISPUNKN  DC    CL8'*UNKNOWN'                                   SS SEP84
ISPORP   DC    CL8'*ORPHAN'                                    SS SEP84
ISPNEWNM DC    CL8'*NEWNAME'                                  ABL OCT84
ISPERMSG DC    CL8'**ERROR*'                                  ABL OCT84
ISPATTN  DC    CL8'**ATTN**'                                  ABL APR85
ISPINVLD DC    CL8'*INVALID'                                  ABL OCT84
ISPEDIT  DC    CL8'*EDIT'               *                      SS JUL87
ISPBUSY  DC    CL8'*BUSY'               *                      SS FEB89
ISPPO    DC    C'PO'                                           SS SEP84
ISPPS    DC    C'PS'                                           SS SEP84
**PUTDOT DC    C'  UT.'                                       ABL FEB86
ISPENDIT DC    X'000D0000',CL9'&NEND'                          SS JUL84
ISPDSNMG DC    X'000D0000',CL9'&NDSN'                          SS JUL84
ISPMALL  DC    X'00100000',CL9'&NMML ',CL3':  '              ABL NOV84
ISPSUBL  DC    X'00150000',CL9'&NSUL ',CL8'*  ALIAS '          SS AUG86
ISPCMD21 DC    X'00150000'                                     SS SEP84
ISPCMD30 DC    X'001E0000'                                    ABL DEC84
ISPCMD34 DC    X'00220000'                                    ABL JAN87
ISPPASST DC    C'PASSTHRU'    USED TO CONTROL USRXXXX VARS     SS AUG86
ISPBLKC  EQU   X'&IBLK'       BLANK OUT LINE CMD               SS JUL87
STAELIST ESTAE *-*,PARAM=*-*,MF=L                              SS JUL85
         SPACE 2                                               SS MAR85
* PARSE PARM LIST OPTIONS                                      SS MAR85
*        DC    X'XX'   OPTION FLAG                             SS MAR85
*              X'80'   STRING   (MUST BE FIRST IF USED)        SS MAR85
*              X'40'   NUMERIC PARM (MUST BE FIRST AFTER STR)  SS MAR85
*              X'20'   KEYWORD (NO SUB VALUES)                 SS MAR85
*              X'10'   ALLOW KEYWORD SINGLE CHAR MATCH         SS MAR85
*              X'10'   CHECK STRING FOR IMBED CHAR (FUTURE)    SS MAR85
*              X'10'   NUMERIC RANGE CHECK REQUESTED           SS MAR85
*              X'00-07' LENGTH OF COMPARE                      SS MAR85
*              X'FF'   END OF TABLE                            SS MAR85
*        DC    X'XX'   BITS ORED IF MATCH                      SS MAR85
*        DC    CL8''/F'',F''                                   SS MAR85
*                      KEYWORD                                 SS MAR85
*                      RANGE VALUES                            SS MAR85
         SPACE 2                                               SS MAR85
* PARSE PARM LIST FOR STRING ONLY                              SS MAR85
ISPPARST DC    X'80',X'80',X'00',X'00',CL8' ',X'FF'            SS MAR85
         SPACE 1                                               SS MAY85
* PARSE PARM LIST FOR RECALL                                   SS MAR85
         SPACE 3                                               SS MAR85
L7FFF    EQU   32767                                           SS MAR85
H7FFF    DC    H'32767'                                        SS MAR85
         SPACE 1                                               SS JUL85
         LTORG
         AIF   ('&MVSLEV' LT 'MVS710').NOEAV3                 DRK JAN13
C_DCBE   DCBE  EADSCB=OK                                       JH DEC12
C_DCBEL  EQU   *-C_DCBE                                        JH DEC12
.NOEAV3  ANOP                                                 DRK JAN13
         SPACE 1                                               SS SEP84
* ADDCONS TO COMMAND TABLES AND TABLE ENTRIES                  SS NOV84
ISPEXECA DC    A(ISPEXECT)                                    ABL DEC84
ISP$PNA  DC    A(ISP$PAN)                                      SS MAR85
ISP$TMGA DC    A(ISP$TMG)                                      SS MAR85
ISP$ENDA DC    A(ISP$END)                                      SS AUG86
ISP$FUNA DC    A(ISP$FUN)                                      SS AUG86
ISP$RCHA DC    A(ISP$RCH)                                      SS AUG86
ISP$LOGA DC    A(ISP$LOG)                                      SS AUG86
         SPACE 2                                               SS NOV84
         COPY  @DIATBL                                         SS FEB89
         COPY  @DIAPANL                 *                      SS FEB89
         COPY  @DIAPART                 *                      SS FEB89
         COPY  @DIACLN                  *                      SS OCT88
         COPY  @DIAFUN                  *                      SS OCT88
         COPY  @DIAINIT                 *                      SS NOV88
         COPY  @DIASEL                  *                      SS NOV88
         COPY  @DIAFIND                 *                      SS OCT88
         COPY  @DIAOUT                  *                      SS OCT88
         COPY  @DIASTAK                 *                      SS FEB89
         COPY  @DIAMEML                 *                      SS NOV88
         COPY  @DIALALV                 *                      SS FEB89
         COPY  @DIALSTC                 *                      SS OCT88
         COPY  @DIATCT                  *                      SS NOV88
         COPY  @DIACAX                  *                      SS NOV88
         COPY  @DIALINE                 *                      SS NOV88
         COPY  @DIALINZ                 *                      SS AUG89
         SPACE 5                                               SS JUL87
         TITLE  'MODEL SUBROUTINE'                             SS JUL87
*************************************************************  SS NOV85
*      MODEL SUBROUTINE                                        SS NOV85
*      MODEL SUBROUTINE                                        SS NOV85
*      MODEL SUBROUTINE                                        SS NOV85
*************************************************************  SS NOV85
         SPACE 2
ISPXXXX  DS    0H                                              SS NOV85
         USING *,R4                                            SS NOV85
         SPACE 1
         BR    R3                                              SS NOV85
         DROP  R4                                             DRK FEB98
         SPACE 5                                               SS NOV85
         TITLE  'GET 370 EDT UCB ADDRESS BY GENERIC'           SS AUG86
GET370GN DS    0H                       *                      SS AUG86
         USING GET370GN,R15             *                      SS AUG86
         SAVE  (14,12),T,GET370GN       *                      SS AUG86
         LM    R2,R4,0(R1)              GET PARMS              SS AUG86
         ST    R13,4(,R2)               BACK SAVE POINTER      SS AUG86
         ST    R2,8(,R13)               FORWARD POINTER        SS AUG86
         LR    R13,R2                   NEW SAVE AREA          SS NOV85
         USING GET3WORK,R13             *                      SS AUG86
         CLC   GET3SAVE(4),GET3TAG      MY TAG                 SS AUG86
         BE    GET3NXTU                 GET NEXT UNIT          SS AUG86
         OC    GET3SAVE(4),GET3SAVE     CHECK FOR ZEROS        SS AUG86
         BNE   GET3RC4                  WHAT CAN I DO          SS AUG86
         MVC   GET3SAVE(4),GET3TAG      MY TAG                 SS AUG86
         L     R5,CVTPTR(,R0)           *                      SS AUG86
         L     R6,X'28'(R5)             *                     ABL FEB87
         ST    R6,GET3LK2               *                      SS AUG86
         L     R5,CVTJESCT-CVT(R5)      JESCT TO GET EDT       SS AUG86
         L     R5,JESEDT-JESCT(R5)      EDT ADDRESS            SS AUG86
         L     R5,EDTLKUP-EDT(R5)       LOOK UP SECTION        SS AUG86
         L     R6,0(R5)                 COUNT OF LKUP ENT      SS AUG86
         LA    R5,8(,R5)                FIRST ENTRY            SS AUG86
GET3IGN  DS    0H                       *                      SS AUG86
         CLC   LKPNAME-LKPSECT(8,R5),0(R3) COMPARE NAME        SS AUG86
         BE    GET3GOT                  *                      SS AUG86
         LA    R5,LKPLNG(,R5)           NEXT ENT               SS AUG86
         BCT   R6,GET3IGN               *                      SS AUG86
         B     GET3RC4                  GENERIC NOT FOUND      SS AUG86
GET3GOT  DS    0H                       *                      SS AUG86
         L     R6,LKPGNRC#-LKPSECT(R5)  GET COUNT OF GENERICS  SS AUG86
         L     R5,LKPGNRC1-LKPSECT(R5)  FIRST GENERIC          SS AUG86
GET3IGP  DS    0H                       *                      SS AUG86
         ST    R6,GET3GENC              *                      SS AUG86
         ST    R5,GET3GENP                                     SS AUG86
         L     R6,GNRCGRP#-GNRCSECT(R5) COUNT OF GROUPS        SS AUG86
         L     R5,GNRCGRP1-GNRCSECT(R5) FIRST ENTRY            SS AUG86
GET3IUC  DS    0H                       *                      SS AUG86
         ST    R6,GET3GRPC              *                      SS AUG86
         ST    R5,GET3GRPP              *                      SS AUG86
         L     R5,0(,R5)                ADDRESS IN FIRST PTR   SS AUG86
         L     R6,GRPUCB#-GRPSECT(R5)   COUNT OF UCBS          SS AUG86
         L     R5,GRPUCB1-GRPSECT(R5)   FIRST UCB              SS AUG86
GET3GUC  DS    0H                       *                      SS AUG86
         ST    R6,GET3UCBC              *                      SS AUG86
         ST    R5,GET3UCBP              *                      SS AUG86
         LH    R6,0(R5)                 GET NUMBER             SS AUG86
         SLL   R6,1                     TIMES 2 FOR OFFSET     SS AUG86
         AL    R6,GET3LK2               ADD ADDRESS OF LK2     SS AUG86
         XC    0(4,R4),0(R4)            CLEAR UCB ADDRESS      SS AUG86
         MVC   2(2,R4),0(R6)            MOVE UCB ADDRESS       SS AUG86
         B     GET3RC0                  GOT ONE                SS AUG86
GET3NXTU DS    0H                       *                      SS AUG86
         L     R6,GET3UCBC              *                      SS AUG86
         L     R5,GET3UCBP              *                      SS AUG86
         LA    R5,UCBLNG(,R5)           NEXT ENT               SS AUG86
         BCT   R6,GET3GUC               *                      SS AUG86
         L     R6,GET3GRPC              *                      SS AUG86
         L     R5,GET3GRPP              *                      SS AUG86
         LA    R5,GRPPLNG(,R5)          NEXT ENT               SS AUG86
         BCT   R6,GET3IUC               *                      SS AUG86
         L     R6,GET3GENC              *                      SS AUG86
         L     R5,GET3GENP              *                      SS AUG86
         LA    R5,GNRCLNG(,R5)          NEXT ENT               SS AUG86
         BCT   R6,GET3IGP               *                      SS AUG86
* DONE                                  *                      SS AUG86
         MVI   GET3SAVE,255             TERMINATE TAG          SS AUG86
         LA    R1,4                     END OF LIST            SS AUG86
         B     GET3RTN                  *                      SS AUG86
GET3RC4  DS    0H                       *                      SS AUG86
         LA    R1,4                     *                      SS AUG86
         B     GET3RTN                  *                      SS AUG86
GET3RC0  DS    0H                       *                      SS AUG86
         SR    R1,R1                    *                      SS AUG86
GET3RTN  DS    0H                       *                      SS AUG86
         L     R13,4(,R13)              BACK UP SAVE AREAS     SS AUG86
         LR    R15,R1                   SET RC                 SS AUG86
         RETURN (14,12),T,RC=(15)       *                      SS AUG86
         DROP  R13,R15                  *                      SS AUG86
GET3TAG  DC   C'GET3'                   *                      SS AUG86
         SPACE 5                        *                      SS AUG86
*                                                              SS NOV85
*    END OF EXECUTABLE CODE                                    SS NOV85
*                                                              SS NOV85
         DROP  R5,R6,R7,R8                                    DRK NOV98
         TITLE 'P D S  --  ISPF WORK AREA 2                          '
         COPY  @DIAWRK                                         SS FEB89
         SPACE 5
SYMDEL   DSECT ,           Z/XDC DELETE SYMBOLS               DRK DEC09
         SPACE 1
         TITLE 'P D S  --  PDS DYNAMIC AREA                          '
         COPY  #MDSECT                                         SS JUL85
         SPACE 5
         TITLE 'P D S  --  DATA CONTROL BLOCK                        '
         DCBD  DSORG=PO                                        SS JUL85
         SPACE 5
         TITLE 'P D S  --  THE USER PROFILE TABLE                    '
         IKJUPT                                                SS JUL85
         SPACE 5
         TITLE 'P D S  --  TSO/E PROTECTED STEP CONTROL BLOCK        '
         IKJPSCB
         SPACE 5
         TITLE 'P D S  --  SVC 99 PARAMETER LIST             09/28/88'
         IEFZB4D0                                              SS JUL85
         SPACE 5
         TITLE 'P D S  --  COMMUNICATIONS VECTOR TABLE               '
         CVT   DSECT=YES                                       SS JUL85
         SPACE 5
         TITLE 'P D S  --  DATA SET ASSOCIATION BLOCK                '
         IHADSAB                                               SS NOV85
         SPACE 5
         TITLE 'P D S  --  TASK CONTROL BLOCK                        '
         IKJTCB ,                                              SS NOV85
         SPACE 5
         TITLE 'P D S  --  ENVIRONMENT CONTROL TABLE                 '
         IKJECT                                               GLA JUN88
         SPACE 5
         TITLE 'P D S  --  TASK INPUT/OUTPUT TABLE                   '
TIOT     DSECT                                                 SS NOV85
         IEFTIOT1                                              SS NOV85
         SPACE 5
         TITLE 'P D S  --  UNIT CONTROL BLOCK                        '
         IEFUCBOB ,                                            SS NOV85
         SPACE 5
         TITLE 'P D S  --  UCB DASD CLASS EXTENSION                  '
         IECDDCE                                              DRK AUG98
         SPACE 5
         TITLE 'P D S  --  JOB/STEP CONTROL BLOCK                    '
         IEZJSCB                                               SS NOV85
         SPACE 5
         TITLE 'P D S  --  JOB FILE CONTROL BLOCK                    '
JFCB     DSECT                                                 SS NOV85
         IEFJFCBN                                              SS NOV85
         SPACE 5
         TITLE 'P D S  --  STEP INPUT/OUTPUT TABLE                   '
SIOT     DSECT                                                 SS NOV85
         IEFASIOT                                              SS NOV85
         SPACE 5
         TITLE 'P D S  --  DEVICE CHARACTERISTICS TABLE              '
         IHADVCT                                               SS NOV85
         SPACE 5
         TITLE 'P D S  --  JOB ENTRY SUBSYSTEM COMMUNICATION TABLE   '
         IEFJESCT                                              SS NOV85
         SPACE 5
         TITLE 'P D S  --  DATA SET CONTROL BLOCK                    '
         IECSDSL1  (2,3,4,5)                                   SS NOV85
         SPACE 5
         AIF   ('&MVSLEV' LT 'MVS510').NODEAR                 DRK JAN08
         TITLE 'P D S  --  SYSTEM MANAGED DIRECTORY ENTRY            '
         IGWSMDE                                               GP JAN08
         SPACE 5
         TITLE 'P D S  --  PROGRAM MANAGEMENT ATTRIBUTE RECORD       '
         IEWPMAR                                               GP JAN08
         SPACE 5
.NODEAR  ANOP  ,                                              DRK JAN08
         SPACE 1
SYMNODEL DSECT ,           Z/XDC DELETE SYMBOLS               DRK DEC09
* FROM SHOWZOS
IGGCAXWA DSECT                         CATALOG WORK AREA
CAXID    DS    C'CAX'                  CAX ID
CAXFLG4  DS    X                       FLAGS (4)
CAXLOCK  EQU   X'01'                   CATALOG LOCKED            RS0301
CAXCHN   DS    A(IGGCAXWA)             NEXT CAXWA IN CHAIN
CAXFLGS  DS    X                       FLAGS (1)
CAXCLS   EQU   X'20'                   CLOSE IN CONTROL
CAXMCT   EQU   X'04'                   MASTER CATALOG
CAXCMR   EQU   X'02'                   CATALOG MANAGEMENT INVOKED
CAXSCR   EQU   X'01'                   SCHEDULER INVOKED
CAXFLG2  DS    X                       FLAGS (2)
CAXF2DT  EQU   X'80'                   CATALOG DELETED
CAXF2REC EQU   X'02'                   RECOVERABLE CATALOG
CAXFLG3  DS    X                       FLAGS (3)
CAXF3ICF EQU   X'20'                   ICF TYPE CATALOG          RS1199
CAXF3SO4 EQU   X'02'                   ICF SHARE OPTION          RS1199
CAXF3SHD EQU   X'01'                   ICF CAT ON SHARED DASD    RS1199
CAXFLG5  DS    X                       FLAGS (5)                 RS1199
CAXLCDB  EQU   X'10'                   VLF CACHE ACTIVE          RS1199
         DS    3F                                                RS1199
CAXACB   DS    V(IFGACB)               CATALOG'S ACB
CAXUCB   DS    V(UCBOB)                CATALOG'S UCB ADDRESS (24-BIT)
         DS    FL3,FL3,FL3,FL3,H,H,A
CAXCNAM  DS    CL44                    CATALOG'S DSNAME
         ORG   IGGCAXWA+147                                      RS1199
CAXFLG6  DS    X                       FLAGS (6)                 RS1199
CAXCDSCA EQU   X'20'                   VLF CACHE ACTIVE          RS1199
CAXISC   DS    F                       ISC TABLE POINTER         RS1199
         ORG   IGGCAXWA+188
CAXREUCB DS    V(UCBOB)                CATALOG'S UCB ADDRESS (31-BIT)
         DS    CL4,F                                             RS1199
CAXDSABP DS    F                       DSAB POINTER              RS1199
         DS    CL24                                              RS0701
CAXRECO  DS    F                       RECORDS                   RS0701
CAXSEAR  DS    F                       SEARCH                    RS0701
CAXFOUND DS    F                       FOUND                     RS0701
CAXDELET DS    F                       DELETES                   RS0701
CAXUPD   DS    F                       UPD                       RS0701
CAXPURGE DS    F                       PURGE                     RS0701
         DS    CL4                                               RS0701
CAXECS   DS    F                       ECS INDICATOR             RS0301
         END
