         TITLE 'P D S  --  DASD GEOMETRY CHART               12/01/04'
GEO      CSECT
         DS    0D
*     ----+----1----+----2----+----3----+----4----+----5----+----6----+
 DC C'                        CKD Devices                             '
 DC C'                                                                '
 DC C'               Data  Alt  Trks/ Bytes/   Bytes/        Bytes/   '
 DC C'Disk Type      Cyls  Cyls  Cyl   Trk      Cyl          Module   '
 DC C'                                                                '
 DC C'3390-1        1113    1    15   56,664   849,960     946,005,480'
 DC C'3390-2        2226    1    15   56,664   849,960   1,892,010,960'
 DC C'3390-3        3339    1    15   56,664   849,960   2,838,016,440'
 DC C'3390-9       10017    3    15   56,664   849,960   8,514,049,320'
 DC C'3390-9*3     32760    3    15   56,664   849,960  27,844,689,600'
 DC C'3390-9*6     65520    3    15   56,664   849,960  55,689,379,200'
 DC C'3390-A      262668    0    15   56,664   849,960 223,257,293,280'
 DC C'3390-A*4   1182006    0    15   56,664   849,960             1TB'
 DC C'3390-A*n 268434453    0    15   56,664   849,960           225TB'
 DC C'9345-1        1440    0    15   46,456   696,840   1,003,449,600'
 DC C'9345-2        2156    0    15   46,456   696,840   1,502,387,040'
 DC C'3380 A/B/D/J   885    1    15   47,476   712,140     630,243,900'
 DC C'3380 E        1770    2    15   47,476   712,140   1,260,487,800'
 DC C'3380 K        2655    3    15   47,476   712,140   1,890,731,700'
 DC C'EMC3380K+     3339    3    15   47,476   712,140   2,377,835,460'
 DC C'EMC3380K++    3993    3    15   47,476   712,140   2,843,575,020'
 DC C'3375           959    1    12   35,616   427,392     409,868,928'
 DC C'3350           555    5    30   19,069   572,070     317,498,850'
 DC C'3340-35        348    1    12    8,368   100,416      34,944,768'
 DC C'3340-70        696    2    12    8,368   100,416      68,889,536'
 DC C'3330-1         404    7    19   13,030   247,570     100,018,280'
 DC C'3330-11        808    7    19   13,030   247,570     200,036,560'
 DC C'2314           200    3    20    7,294   145,880      29,176,000'
 DC C'2311           200    3    10    3,625    36,250       7,250,000'
 DC C'2305-1          48    6     8   14,136   113,088       5,428,224'
 DC C'2305-2          96   12     8   14,660   117,280      11,258,880'
 DC C'                                                                '
 DC C'Compiled by John Broughton, SDI (www.sdisw.com)                 '
 DC C' Updated by John Kalinich, CSC                                  '
 DC X'FFFF'            END OF TABLE
