         TITLE 'P D S  --  PDS TIME                          09/28/88'
***********************************************************************
***      TIME  SUBCOMMAND                                           ***
***********************************************************************
*
         SPACE 1
TIME     CSECT
         USING *,R8
         MVC   MSGTEXT2(132),MSGBL132    BLANK LINE
         MVC   MSGTEXT2+4(14),TIMETBL    EDIT MASK
         CLC   ##SUBCOM(3),=CL3'IPL'     IPL TIME CONVERSION? DRK NOV06
         BE    IPLTIME                   YES, R0-R1 LOADED    DRK NOV06
         TIME  DEC                       R0=HHMMSSTH  R1=0CYYDDDF     "
IPLTIME  DS    0H                                             DRK NOV06
         CL    R0,TIMEL12A               MORNING?
         BL    *+12                      YES, BRANCH
         MVI   MSGTEXT2+14,C'P'          NO, SET TO PM
         SL    R0,TIMEL12A               NO, SUBTRACT 12 HOURS
         ST    R0,TIMEWRKW               ADJUSTED TIME
         TM    TIMEWRKW,X'08'            ADJUSTMENT ERROR (20 OR 21)?
         BZ    *+8                       NO, BRANCH
         NI    TIMEWRKW,X'09'            YES, CONVERT TO 8 OR 9 (PM)
         CLI   TIMEWRKW,X'00'            ZERO HOURS?
         BNE   *+8                       NO, BRANCH
         MVI   TIMEWRKW,X'12'            YES, CONVERT ZERO TO 12
         ED    MSGTEXT2+4(9),TIMEWRKW    FINISH TIME PROCESSING
         MVC   MSGTEXT2+34(25),DATEPC    TIME CONSTANT
         ST    R1,TIMEWRKW               SAVE 0CYYDDDF DATE WORD
         UNPK  MSGTEXT2+44(5),TIMEWRKW+1(3) MOVE IN "YY"
         MVC   MSGTEXT2+42(2),=C'19'       ASSUME 19XX        Y2K AUG97
         TM    TIMEWRKW,X'01'              CENTURY BIT ON?    Y2K MAR99
         BNO   CEN1900                     NO,  THEN 19XX     Y2K AUG97
         MVC   MSGTEXT2+42(2),=C'20'       YES, THEN 20XX     Y2K AUG97
CEN1900  DS    0H                                             Y2K AUG97
         MVC   MSGTEXT2+51(2),MSGTEXT2+44 (YY.
         MVC   MSGTEXT2+54(3),MSGTEXT2+46 DDD)
         OI    MSGTEXT2+56,X'F0'         FIX THE ZONE
         MVC   MSGTEXT2+46(3),BLANKS     BLANK THE NEXT THREE BYTES
         LH    R1,TIMEWRKW+2
         SRL   R1,12                     D..  (HUNDREDS)
         M     R0,TIMEL10
         IC    R15,TIMEWRKW+2
         N     R15,=F'15'
         AR    R1,R15                    .D.  (TENS)
         M     R0,TIMEL10
         IC    R15,TIMEWRKW+3
         SRL   R15,4
         AR    R1,R15                    ..D  (UNITS)
         PACK  TIMEDOUB(8),MSGTEXT2+44(2)
         CVB   R15,TIMEDOUB              CONVERT YEAR TO BINARY
         LR    R0,R15
         N     R15,TIMELFFC              YEAR/4*4  (INTEGER DIVISION)
         CR    R0,R15                    LEAP YEAR?
         BE    NOADJUST                  YES, NO ADJUSTMENT NEEDED
         CH    R1,CUMDAYS+4              BEFORE FEB 30?
         BL    NOADJUST                  YES, NO ADJUSTMENT NEEDED
         AH    R1,=H'1'                  ADD 1 TO THE JULIAN DATE
NOADJUST SR    R15,R15
         AH    R15,=H'2'
         CH    R1,CUMDAYS(R15)
         BH    *-8
         SH    R1,CUMDAYS-2(R15)
         LR    R14,R15
         SRL   R15,1                     MONTH IN BINARY
         LA    R14,0(R14,R15)
         LA    R14,MONTHS-3(R14)
         MVC   MSGTEXT2+34(3),0(R14)     MONTH TEXT
         AR    R15,R15
         LA    R15,CONVTBL(R15)
         MVC   TIMEDOUB+4(2),0(R15)      MOVE IN MONTH
         LR    R15,R1                    DAY OF MONTH IN BINARY
         AR    R15,R15
         LA    R15,CONVTBL(R15)
         MVC   MSGTEXT2+38(2),0(R15)     MOVE IN DAY OF MONTH
         MVC   TIMEDOUB(4),MSGTEXT2+42   MOVE IN '19XX'
         MVC   TIMEDOUB+6(2),MSGTEXT2+38 MOVE IN DAY OF MONTH
         BAS   R14,WEEKDAY               FIND THE DAY OF WEEK
         L     R15,TIMEWRKW
         SLL   R15,4
         SRL   R15,28
         MH    R15,=H'10'
         LA    R15,DAY@WEEK(R15)
         MVC   MSGTEXT2+22(10),0(R15)
         MVI   MSGTEXT2+1,79
         CLC   ##SUBCOM(4),TIMETIME                TIME SUBCOMMAND?
         BNER  R2                                  NO, BRANCH
         M$ERRST MSGTEXT2
         B     NEWCMD
         SPACE 4
TIMETIME DC    CL4'TIME'
DAY@WEEK DC    CL10'SUNDAY',CL10'MONDAY',CL10'TUESDAY',CL10'WEDNESDAY'
         DC    CL10'THURSDAY',CL10'FRIDAY',CL10'SATURDAY'
         SPACE 2
CONVTBL  DC    CL32' 0 1 2 3 4 5 6 7 8 9101112131415'
         DC    CL32'16171819202122232425262728293031'
         SPACE 2
TIMETBL  DC    XL14'4021204B20204B202040C1D44040'
         SPACE 2
DATEPC   DC    CL26'ABC EF, 19GH    (12.456)'
         SPACE 2
CUMDAYS  DC    H'0,31,60,91,121,152,182,213,244,274,305,335,32000'
         SPACE 2
MONTHS   DC    CL36'JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC'
         EJECT
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*                                                                     *
*     THIS REENTRANT SUBROUTINE DETERMINES THE DAY OF THE             *
*   WEEK FOR ANY GREGORIAN DATE FROM OCTOBER 15,1582, THROUGH         *
*   FEBRUARY 28, 4000.                                                *
*                                                                     *
*         NOTE:  DATE IS THE ARGUMENT AND DAY IS THE ANSWER.          *
*           THEY HAVE THE FOLLOWING FORMATS, RESPECTIVELY -           *
*                                                                     *
*TIMEDOUB DS   0ZL8     ARGUMENT                                      *
*TIMEINYR DS   ZL4      YEAR - ANY VALUE 1582-4000                    *
*TIMEINMT DS   ZL2      MONTH - ANY VALUE 01-12                       *
*TIMEINDY DS   ZL2      DAY OF MONTH - ANY VALUE 01-31                *
*TIMEWRKW DS   ZL1      DAY OF WEEK -  0 (SUNDAY) - 6 (SATURDAY)      *
*                                                                     *
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
         SPACE 1
WEEKDAY  ST    R14,R14SAVE
         XC    TIMEDDAT(8),TIMEDDAT
         PACK  TIMEDECC,TIMEINDY
         CVB   R1,TIMEDDAT
         PACK  TIMEDECM,TIMEINMT
         CVB   R15,TIMEDDAT
         IC    R15,FFTBL-1(R15)      FIND FUDGE FACTOR
         AR    R1,R15                   AND APPLY IT TO CORRECTION
         PACK  TIMEDECC,TIMEINYR
         SP    TIMEDECC,TIMELP3      ADJUST YEAR IF JANUARY OR FEBRUARY
         OI    TIMEYRSG,15           LEGITIMIZE SIGN FOR ZAP
         ZAP   TIMEDECC,TIMEDECY
         CVB   R15,TIMEDDAT
         SR    R14,R14
         LA    R0,3                  USED TO FIND CENTURY MOD 4
         D     R14,=F'100'           FIND CENTURY
         NR    R15,R0                CENTURIES MOD 4
         NR    R0,R14                THIS MANY COMMON YEARS
         SRA   R14,2                   AND
         AR    R15,R14                   THIS MANY LEAP YEARS
         MH    R15,=H'5'
         AR    R1,R15
         AR    R1,R0
         SR    R1-1,R1-1             PREPARE TO DIVIDE
         D     R1-1,TIMEL7
         STC   R1-1,TIMEWRKW
         OI    TIMEWRKW,X'F0'        ADD A ZONE FIELD
         L     R14,R14SAVE
         BR    R14                   AND RETURN
         SPACE 1
FFTBL    DC    FL1'0,3,2,5,0,3,5,1,4,6,2,4'  FUDGE FACTORS
TIMEL10  DC    F'10'
TIMEL7   DC    F'7'
TIMEL12A DC    X'12000000'
TIMELFFC DC    X'FFFFFFFC'
TIMELP3  DC    P'3'
