//CBT1060P JOB 527TSO000S0008,ARNIE,CLASS=8,MSGCLASS=5,NOTIFY=TS15500
//*
//PDSGEN PROC  MEMBER=MISSING,
//             INSTLIB='TS15500.CBT1060P.PDS'       <<=== INSTALL LIB
//ONE    EXEC  PGM=AEV90,REGION=4064K,
//             PARM=(DECK,NOOBJECT,NORLD,RENT,TERM,'XREF(FULL)')
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(25,5))
//SYSUT2   DD  UNIT=SYSDA,SPACE=(CYL,(25,5))
//SYSUT3   DD  UNIT=SYSDA,SPACE=(CYL,(25,5))
//SYSPUNCH DD  UNIT=SYSDA,SPACE=(TRK,(5,5)),DISP=(MOD,PASS),DSN=&&X,
//             DCB=BLKSIZE=3120
//SYSTERM  DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DISP=SHR,DSN=&INSTLIB.(&MEMBER)
//SYSLIB   DD  DSN=SYS2.AMODGEN,DISP=SHR,DCB=BLKSIZE=23440
//         DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=&INSTLIB,DISP=SHR
//       PEND
//*
//BANNER#0   EXEC   BANNER,P='PDS CP  CBT1060P           '
//*
//PDSMAIN  EXEC  PDSGEN,MEMBER=@PDSMAIN
//*
//SUBS     EXEC  PDSGEN,MEMBER=@SUBS
//*
//PARSE    EXEC  PDSGEN,MEMBER=@PARSE
//*
//DIALOG   EXEC  PDSGEN,MEMBER=@DIALOG
//*
//LK1      EXEC  PGM=IEWL,REGION=1024K,COND=(0,LT),
// PARM='XREF,LIST,MAP,RENT,REUS,REFR,LET,NCAL,SIZE=(1024K,128K)'
//SYSLIB   DD  DSN=SYS2.MLINKLIB,DISP=SHR
//SYSLMOD  DD  DISP=SHR,DSN=SYS2.MLINKLIB           <<=== LINK TARGET
//*YSLMOD  DD  DISP=SHR,DSN=TS15500.T.LOAD          <<=== LINK TARGET
//IN       DD  DSN=&&X,DISP=(OLD,DELETE)
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(8,1))
//SYSPRINT DD  DSN=&LINX,SPACE=(CYL,(5,5)),DCB=BLKSIZE=968,
//         UNIT=SYSDA,DISP=(NEW,PASS)
//SYSLIN   DD  *
  INCLUDE  IN
  ENTRY    PDSMAIN
  ORDER    PDSMAIN(P)
  NAME     CBT1060P(R)                              <<=== LOADMOD NAME
//LKEDXREF EXEC PGM=CBT415,REGION=256K
//FT05F001 DD  DSN=&LINX,DISP=(OLD,DELETE)
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
