//ZAPPDS   EXEC  PGM=AMASPZAP
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHARE,DSN=hlq.new.pds86.load
 NAME  PDS86 OPTIONS
 VER   0EBC  C3D6D4D7,C1D9C540      COMPARE    SUBCOMMAND
 VER   0ED0  C3D6D4D7,C1D9C5C3      COMPAREC   SUPER-C  (DEFAULT)
*REP   0ED0  C3D6D4D7,C1D9C55B      COMPARE$   YALE
*REP   0ED0  C3D6D4D7,C1D9C5E6      COMPAREW   COMPAREX
