)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL+-\-\-¢How to use PASTE+-\-\-
%OPTION    ===>_ZCMD                                                           +
+
        The PASTE macro works with the Edit line commands for
        After or Before (A or B).  This specifies where all lines
        previously saved are to be inserted.  The operand Z or
        ZERO specifies that the table is to be cleared after the
        lines have been inserted.  The operand K or KEEP specifies
        that the table is not to be cleared, thus the saved lines
        are to be kept for future PASTE requests or to be added
        to by other CUT requests.  The default, if not changed, is
        ZERO.

)END
