)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
)BODY EXPAND(\\)
+-\-\-¢PDS O Subcommand Selection+-\-\-
%OPTION  ===>_ZCMD                                                             +
+
 Choose one of the following:
+
    %1 +- Function selection list
    %2 +- Display or Table processing options (SORT, F, X)
    %3 +- Features and Short Hand commands
    %4 +- Set default selection list
+
)INIT
 .HELP = P86LA@PH
)PROC
 &PDSZSEL=TRANS(TRUNC(&ZCMD,'.')
             1,'PANEL(P86FNFN)'
             2,'PANEL(P86CXTB)'
             3,'PANEL(P86OPFE)'
             4,'PANEL(P86SET@)'
           ' ',' '
             *,'?')
 &ZTRAIL=.TRAIL
 &OPERS=.TRAIL
)END
