)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢o.vps    VPSPRINT line command+-\-\-
%OPTION  ===>¦ZCMD                                                             +
%
+Enter the printer name and any operands below for%VPSPRINT  &PDSMEM
%===>¦LOPER
                                                                               +
+Operands:% printername
          % DDNAME(ddname)  DIRECT(KEEP/DELETE)
          % LINES(linenum1:linenum2)
          % NUM(loc,length)/SNUM(loc,length)/NONUM
          % FCB(fcbname)  FORMS(formname)
          % CLASS(c)  HOLD/NOHOLD  COL(col1:col2, ...)  COPIES(number)
          % PAGELEN(num)  TMARGIN(num)  BMARGIN(num)
          % SINGLE/DOUBLE/CCHAR
          % FOLD(width)/TRUNCATE(width)
          % EJECT/NOEJECT  NOEJMESS  NOHEADER
          % TERMINAL  TRACE  WTR(wtrname)
+
+Required:  printername
+Defaults:  NUM, CLASS(A), COPIES(1), NOHOLD, SINGLE, HEADER, NOEJECT, MEMBERS
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86LOHH
  IF(&LOPER  = &Z) &LOPER=&P86#VP3
)PROC
 &P86#VP3=&LOPER
 &PDSZSEL='Vpsprint  &PDSMEM &LOPER'
)END
