)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢PDS LISTV Command Selection+-\-\-
%OPTION  ===>_ZCMD                                                             +
+
+
+Enter operands for LISTV.
%===>_LOPER                                                            +
+
+Operands:
+ % 'volume'  -+ all or part of volume serial (* or : for all)%or+
+ % 'address' -+ ucb  ADDR      ucb address or part of address%or+
+ % 'unitname'-+ unit GENERIC   unit name (for volumes matching this unit name)
+
+Optional:
+%  SPACE/NOSPACE+   If VTOC is to be read (default is SPACE).
+                     VTOC read may be slowed or stopped by I/O
+                     contention or RESERVE lockout.
+%  RESET       +    If table is to be cleared first; otherwise, the new
+                    entries will be merged with the current entries.
+Optional Filtering:
+% SHR/SHARED  PRIVATE PUBLIC STORAGE +one or more of these volume
+                    attributes may be used to limit selection
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
 .HELP = P86PNI@
  IF(&LOPER  = &Z) &LOPER=&P86#LT1
  IF(&ZCMD ¬= &Z)
    &X=TRUNC(&ZCMD,' ')
    &LOPER = .TRAIL
    &ZCMD = &Z
)PROC
 &P86#LT1=&LOPER
 &PDSZSEL = 'LISTV  &LOPER'
)END
