)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢o.tsoe    TSOEDIT line command+-\-\-
%OPTION  ===>¦ZCMD                                                             +
%
+Enter any operands below for%TSOEDIT  &PDSMEM
%===>¦LOPER
                                                                               +
+
+Operands:%NONUM
+         %ASIS
+         %OLD/NEW
+         %ASM/BASIC/CLIST/CNTL/COBOL/DATA/
+         %FORTE/FORTG/FORTGI/FORTH/GOFORT/
+         %IPLI/LIST/PLI/PLIF/TEXT/VSBASIC
+
+Defaults: edit type based on the data set name
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#TE3
)PROC
 &P86#TE3=&LOPER
 &PDSZSEL='Tsoedit  &PDSMEM &LOPER'
)END
