)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢PDS o.ut    user line command+-\-\-
%OPTION  ===>_ZCMD                                                             +
+

 Choose one of the following:

    %AL+- List catalog connect information and alias list
    %LI+- List catalog connect information
    %US+- List all catalog usage information
    %VT+- List Volume Table of Contents


 Note: this is a installation-modifiable panel; the commands on this
 panel may also be used as line commands from the CAX panel.
)INIT
 .HELP = P86PNO@
)PROC
 &PDSZSEL=TRANS(TRUNC(&ZCMD,'.')
          ALIA,'TRP(LISTC ENTRY(''&PDSXDSN'') ALL)'
           ALI,'TRP(LISTC ENTRY(''&PDSXDSN'') ALL)'
            AL,'TRP(LISTC ENTRY(''&PDSXDSN'') ALL)'
             A,'TRP(LISTC ENTRY(''&PDSXDSN'') ALL)'
            LI,'TRP(LISTC ENTRY(''&PDSXDSN'') VOL)'
           LIS,'TRP(LISTC ENTRY(''&PDSXDSN'') VOL)'
            US,'TRP(LISTC ENTRY(''&PDSXDSN'') ALL CAT(''&PDSXDSN'') )'
          UCAT,'TRP(LISTC ENTRY(''&PDSXDSN'') ALL CAT(''&PDSXDSN'') )'
            VT,'TRP(VTOC &PDSXVOL)'
           VTO,'TRP(VTOC &PDSXVOL)'
          VTOC,'TRP(VTOC &PDSXVOL)'
           ' ',' '
             *,'?')
 &ZTRAIL=.TRAIL
 &OPERS =.TRAIL
)END
 Note: this panel is normally reached by entering o as a line command
 from a CAX panel, followed by entering ut from the command selection
 panel.  The commands above may also be used as direct line commands
 from the CAX panel; thus, this is termed an "extensible panel".

 If you modify this panel, documentation is found in PDS source
       member $$$CUSTM
