)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
)BODY EXPAND(\\)
+-\-\-¢PDS o LISTA line command+-\-\-
%OPTION  ===>_ZCMD                                                             +
+
+Choose one of the following line commands:
+   %C   +- change to '&PDSADSN'
+   %DCAT+- deconcatenate non-permanent members of a concatenated group
+   %FREE+- free a ddname or all members of a concatenated group
+   %LOG +- format and copy line to session log
+The following line commands cause a change to '&PDSADSN':
+   %A   +- execute alternate saved command
+   %B   +- browse the dataset
+   %E   +- edit the dataset
+   %M   +- create MEMLIST of the dataset or %6  +- for MEMLIST ALL
+   %P   +- prompt for¢PDS+dataset commands
+   %U   +- display usage information
+   %V   +- view the dataset     %Y   +- verify the dataset
+   %Z   +- compress the dataset
+Special line commands:
    %X   +- remove line
    %=   +- repeat previous line command
    %K   +- kill and clear all following line commands
    %UT  +- extended/user/installation utility command  panel
+Note: these line commands can also be entered from the LISTA panel.
)INIT
 .HELP = P86LA@LH
)PROC
 &PDSZSEL=TRANS(TRUNC(&ZCMD,'.')
           ' ',' '
             F,'FREE'
             A,'AL'
            AL,'AL'
             B,'BR'
            BR,'BR'
             C,C
             D,'DCAT'
             E,'EDIT'
            ED,'EDIT'
            FR,'FREE'
            DC,'DCAT'
           FRE,'FREE'
           DCA,'DCAT'
             K,K
             L,'LOG'
            LO,'LOG'
           LOG,'LOG'
          FREE,'FREE'
          DCAT,'DCAT'
             M,'ML'
            ML,'ML'
             P,'P   '
             X,'X   '
             U,'US  '
            US,'US  '
             V,'VIEW'
            VI,'VIEW'
             UT,'PANEL(P86LAUX)'
           UTI,'PANEL(P86LAUX)'         UTIL,'PANEL(P86LAUX)'
             Y,'Y   '
           VER,'Y   '
            VE,'Y   '
             Z,'Z   '
             6,'6   '
           '=','='
             *,'?')
 &ZTRAIL=.TRAIL
 &OPERS=.TRAIL
 &ZCMD =.TRAIL
 IF (&OPERS = ' ') &OPERS = &PDSDATA
)END
