)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢o.f    Find line command+-\-\-
%OPTION  ===>¦ZCMD                                                             +
%
+Enter the search string and any operands below for%FIND  &PDSMEM
%===>¦LOPER
                                                                               +
+Operands:% 'string'  NUM / SNUM / NONUM / LBLOCK / LDUMP / BLOCK / DUMP
%                     CAPS/ASIS/IGNORE   FIRST/NOFIRST
%                     OFFSET(hex)        MODULE(Partname)
%                     MAXIN(num)         MAXLEN(num)      MAXOUT(num)
%                     SKIPCOL(num)       SKIPREC(num)     MAXFIND(num)
%                   THEN(ATTRIB/ BROWSE/ DIRENTRY/ DELETE/&EDIT
%                        END/ FIND/&FSE HISTORY/ LIST/ MAP/
%                        MEMBERS/ MEMLIST/ NEWML/ OUTCOPY/ PRINTOFF/
%                        REVIEW/&SPFEDIT SUBLIST/&SUBMIT TSOLIST/
%                        VIEW/ VERIFY)
%                   ELSE(ATTRIB/ BROWSE/ DIRENTRY/ DELETE/&EDIT
%                        END/ FIND/&FSE HISTORY/ LIST/ MAP/
%                        MEMBERS/ MEMLIST/ NEWML/ OUTCOPY/ PRINTOFF/
%                        REVIEW/&SPFEDIT SUBLIST/&SUBMIT TSOLIST/
%                        VIEW/ VERIFY)
+Defaults:  If string is null, previous string;
+           NUM or previous FIND/LIST/REPLACE format; CAPS
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86LOHH
  IF(&LOPER  = &Z) &LOPER=&P86#FI3
  IF(&PDSTYPE = 'U')
    &SPFEDIT = ''
    &SUBMIT = ''
    &EDIT = ''
    &FSE = ''
  ELSE
    &SPFEDIT = ' SPFEDIT/'
    &SUBMIT = ' SUBMIT/'
    &EDIT = ' EDIT/'
    &FSE = ' FSE/'
)PROC
 &P86#FI3=&LOPER
 &PDSZSEL='Find  &PDSMEM &LOPER'
)END
