)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢O.E    EDIT Subcommand+-\-\-
%OPTION  ===>¦ZCMD                                                             +
%
+Enter the member group name and any operands below for%EDIT:
%===>¦LOPER
                                                                               +
+
+Operands:%memgroup          -+(e.g., *; start:end; first*pat; range*; part/)
%          OLD               -¢PDS+is to verify that the member exists
%          NEW               -¢PDS+is to verify that the member does not exist
%          MACRO(macname)    -+indicates an initial EDIT macro
%          PROFILE(profname) -+specifies the edit profile name
%          SETPROF(profname) -+specifies a default profile name
%          /SP(profname)      +Note: to delete a default profile, use SETPROF(*)
%          SETMACRO(macname) -+specifies a default initial EDIT macro
%          /SM(macname)       +Note: to delete a default macro, use SETMACRO(*)
+
+Defaults: memgroup
+          current SETPROF  = &PDSSETP
+          current SETMACRO = &PDSSETM
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#ED1
)PROC
 &P86#ED1=&LOPER
 &PDSZSEL='Edit  &LOPER'
)END
