)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-¢O Subcommand Selection+-\-\-
%OPTION  ===>_ZCMD                                                             +
%               ---------------------------------------------
%               |            Subcommand Selection           |
%               ---------------------------------------------
+
   The O subcommand selection panel directs you as to which¢PDS+
   subcommands are available.  Enter an acceptable subcommand name or
   abbreviation to continue with the subcommand assistance panel.

   Shorthand notes:
%   1.+ You can bypass the O command option panel.  For example, enter
       %O.VE+as a command to enter the VERIFY assistance panel.  Note:
        the following example would skip both panels:%O.VE.memname stats+
%   2.+ From the O command option panel, you can bypass the
        assistance panel.  For example, enter%ve.memname stats+
        to format the subcommand:%Verify memname stats+

   To get explanations of¢PDS+subcommands, you need to reference the¢PDS+
   HELP data set.  Enter%H+from the%OPTION ===>+line on the O subcommand
   selection panel to use the HELP subcommand entry assistance panel.

                                   (continued)
)PROC
 &ZCONT = P86PN@PO
)END
