)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢O.A    ATTRIB Subcommand+-\-\-
%OPTION  ===>¦ZCMD                                                             +
%
+Enter the member group name and any operands below for%ATTRIB:
%===>¦LOPER
                                                                               +
+Operands: %memgroup+     (e.g., *; start:end; start:; first*pat; range*; part/)
%           AMODE24/AMODE31/AMODE64/AMODEANY
%           AUTH/NOAUTH  or  APF/NOAPF
%           DC/NODC                     EDIT/NOEDIT
%           ENTRY(entryname)            EXEC/NOEXEC
%           LOADONLY/NOLOADONLY         PAGE/NOPAGE
%           REFR/NOREF                  RENT/NORENT
%           REUS/NOREUS                 RLDFIX/NORLDFIX
%           RMODE24/RMODEANY            SSI(hexdata)/NOSSI
%           UNALIAS                     NONE
+
%           ALIASINFO/NOALIASINFO       LKEDDATE/NOLKEDDATE
+
+Defaults:  memgroup, ALIASINFO
)INIT
 &LOPER = '&OPERS'
 .CURSOR = LOPER
 .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#AU1
)PROC
 &P86#AU1=&LOPER
 &PDSZSEL='Attrib  &LOPER'
)END
