)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢O.TSOL    TSOLIST Subcommand+-\-\-
%OPTION  ===>¦ZCMD                                                             +
%
+Enter the member group name and any operands below for%TSOLIST:
%===>¦LOPER
                                                                               +
+
+Operands:%memgroup +     (e.g., *; start:end; start:; first*pat; range*; part/)
%          BYPASS(num)
%          MAX(num)
%          HEX/X
%          NUM/SNUM/NONUM
%          COL(begin:end)
+
+
+Defaults: memgroup, NUM (if a non-numeric is encountered, then NONUM)
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#TL1
)PROC
 &P86#TL1=&LOPER
 &PDSZSEL='Tsolist  &LOPER'
)END
