)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢O.CON    CONTROL Subcommand+-\-\-
%OPTION ===>¦ZCMD                                                              +
+
+Enter any operands for%CONTROL:+
%===>¦LOPER
                                                                               +
+
+Operands:% ALIASINFO  / NOALIASINFO
%           LKEDDATE   / NOLKEDDATE
%           PROMPT     / NOPROMPT
%           RECOVER    / NORECOVER
%           TRANSLATOR / NOTRANSLATOR
%           SYSOUT(c)  / NOSYSOUT      FORM(ffff)/NOFORM   DEST(destname)/NODEST
%           DSN(dsn)   / NODSN         OLD/MOD/NEW/SHR
%           SINGLE     / DOUBLE      / MULTIPLE

%           IOSTATS    / TESTABEND   / TESTCPULOOP  /
%                        TESTMSGS    / TESTOUTLOOP  / TESTREAD  /
%                        GLOBALMODS  / ALLGLOBALS   / PDSMAIN   / MODS      /
%                        GEO         / TSO          / LISTENV   / COMPILER  /
%                        MBRVAL      / ISPLOG       / MEMLIST   / TOGGLES   /

+Initial defaults:  NOTRANSLATOR, ALIASINFO, LKEDDATE, PROMPT, RECOVER, MULTIPLE
)INIT

  &LOPER = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#CN1
)PROC
 &P86#CN1=&LOPER
  &PDSZSEL='Control  &LOPER'
)END
