)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢O.MEML    MEMLIST Subcommand (load members)+-\-\-
%OPTION ===>¦ZCMD                                                              +
+
+Enter the member group specification and any operands for%MEMLIST:+
%===>¦LOPER
                                                                               +
+Operands:% memgroup   -+(e.g., *; start:end; start:; first*pat; range*; part/)
%           AUTH/NOAUTH        DC/NODC            EDIT/NOEDIT        EXEC/NOEXEC
%           FLEVEL/NOFLEVEL    OVERLAY/NOOVERLAY  PAGE/NOPAGE        REFR/NOREFR
%           RENT/NORENT        REUS/NOREUS        SCTR/NOSCTR        TEST/NOTEST
%           SINCE/BEFORE
%           TODAY/YESTERDAY/WEEK/CURRENT/BIWEEK/MONTH/BIMONTH/QUARTER/
%                 HALFYEAR/YEAR/BIYEAR/LAST(numdays)/DATE(mm/dd/yy)
%           ABOVE(count)            BELOW(count)
%           ALIAS/NOALIAS           HASALIAS/NOHASALIAS
%           ORPHAN/NOORPHAN         SSI(hexdata)/SSI/NOSSI/PARTSSI(hexdata)
%           TTR(lttr:httr)          LKED(pname)
%           MODULE(pname)           SYSMOD(pname)/USERDATA(pname)
%           SYSMOD(pname)           TRAN(pname)
%           VSLKED/NOVSLKED         ZAP(pname)
%           RESET/NORESET           LKEDDATE/NOLKEDDATE
+
+Defaults:  NORESET, LKEDDATE, SINCE
)INIT

  &LOPER = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#MU1
)PROC
 &P86#MU1=&LOPER
  &PDSZSEL='Memlist  &LOPER'
)END
