)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢O.COM    COMPARE Subcommand+-\-\-
%OPTION  ===>¦ZCMD                                                             +
%
+Enter the old member name, the new member name and any operands for%COMPARE:
%===>¦LOPER
                                                                               +
+Operands:% oldmem/olddsn -+specifies the old member or dsname and member
%           newmem/newdsn -+specifies the new member or dsname and member
%           DELTA         -+lists the differences between the source data sets,
                            followed by the overall summary results
%           OVSUM         -+lists only the overall summary of the comparison
%           CHNG          -+lists the differences between the source data sets,
                            plus up to 10 matching output lines before and after
                            the differences
%           LONG          -+Lists all the new data set source lines, plus old
                            data set deleted lines; both inserted and deleted
                            lines are flagged
%           OVOL(volnam)  -+if not cataloged, the volume with the old data set
%           NVOL(volnam)  -+if not cataloged, the volume with the new data set
                            Note: if either OVOL or NVOL is needed, enter both

+Defaults:  COMPAREC (IBM SuperC compare utility) is used
+Required:  oldmem/olddsn, newmem/newdsn
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#CO1
)PROC
 &P86#CO1=&LOPER
 &PDSZSEL='Compare  &LOPER'
)END
