)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢O.FIX    FIXPDS Subcommand+-\-\-
%OPTION ===>¦ZCMD                                                              +
+
+Enter any operands for%FIXPDS: +
%===>¦LOPER
                                                                               +
+
+Operands:% EXPANDDIR(Addblks)  / RESET(Totblks) /*RESET / INITDIR(rblks)
%          *STOWINIT
%           FREEDIR(Numblks)    / ADDTRK(trks)   / ADDCYL(cyls)
%           RELEASE / RELEXTENT / RELSAVE(trks)  / MAXSPACE
%           DCB CHECK/NOCHECK
%           ASM / CLIST / CNTL / LOAD / OBJECT
%          *OPTCD(W/WC/WCZ/C/CZ/Z) /*NOOPTCD
%           RECFM(F/FB/FT/FBT/FA/FBA/FTA/FBTA/FM/FBM/FTM/FBTM/
%                 V/VB/VT/VBT/VA/VBA/VTA/VBTA/VM/VBM/VTM/VBTM/
%                 U/UT/UA/UM/UTA/UTM)
%           LRECL(L1) *BLKSIZE(L2)
+
+Defaults:  DCB, CHECK
            OPTCD(previous value), RECFM(previous value),
            LRECL(previous value), BLKSIZE(previous value)
+Note: Items with an asterisk (*) are supported for PDSE data sets.
)INIT

  &LOPER = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#FX1
)PROC
 &P86#FX1=&LOPER
  &PDSZSEL='Fixpds  &LOPER'
)END
