)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢O.T    TSO Subcommand+-\-\-
%OPTION ===>¦ZCMD                                                              +
+
+Enter any%TSO+command:
%===>¦LOPER


                +
+
+Operands:  a TSO command followed by any of its operands
+
+Defaults:  none
)INIT

  &LOPER = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#TS1
)PROC
 &P86#TS1=&LOPER
  &PDSZSEL='Tso  &LOPER'
)END
