)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢O.OUT    OUTCOPY Subcommand+-\-\-
%OPTION  ===>¦ZCMD                                                             +
%
+Enter the member group name and any operands below for%OUTCOPY:
%===>¦LOPER
                                                                               +
+
+Operands:% memgroup    -+(e.g., *; start:end; start:; first*pat; range*; part/)
%           ECHO        -+display each SELECT statement
%           NOECHO      -+direct output only to file PDSOUT
%           CLOSE       -+close the data set (will not output this member)
%           ALIAS       -+output any associated member names too
%           NOALIAS     -+output only the identified member name
%           TEXT('str') -+replace the second member identifier with STR
%           NOTEXT      -+revert to the default SELECT statement format
%           IEBUPDTE    -+output member statements in IEBUPDTE format
+
+Initial defaults:  memgroup, ECHO, NOALIAS, NOTEXT
+Thereafter:        previous ECHO/NOECHO, ALIAS/NOALIAS and TEXT/NOTEXT
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#OU1
)PROC
 &P86#OU1=&LOPER
 &PDSZSEL='Outcopy  &LOPER'
)END
