)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢O.D    DISPLAY Subcommand+-\-\-
%OPTION ===>¦ZCMD                                                              +
+
+Enter any operands for%DISPLAY:+
%===>¦LOPER
                                                                               +
+
+Operands:  % memstart memend+
+
+Alternates: %memstart
%             memstart:memend
%             memstart:
%             :memend
%             :
%             start*pat
%             start*
%             part1/part2
%             part1/
%             /part1
+
+
+Defaults:    If no specification, a list of all members
)INIT

  &LOPER = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#DI1
)PROC
 &P86#DI1=&LOPER
  &PDSZSEL='Display  &LOPER'
)END
