)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-¢PDS MEMLIST Load Display 1+-\-\-
%OPTION  ===>_ZCMD                                                             +
%               -------------------------------------------
%               |         MEMLIST Load Member List        |
%               -------------------------------------------
+

   MEMLIST provides a scrollable list of member names on which you may
   enter¢PDS+subcommands on the individual member lines (these subcommands
   are called line commands).


   The following topics are presented in sequence or may be requested
   by number:
    %1+ General MEMLIST information          %4+ MEMLIST line commands
    %2+ MEMLIST F (find) command             %5+ MEMLIST block commands
    %3+ MEMLIST SORT command                 %6+ MEMLIST example
   The following optional topics may be requested by number:
    %7+ Member groups and member notation
    %8+¢PDS+subcommands (primary commands)
    %9+ ISPF commands and PF keys
   %10+¢PDS+primary command extensions (local)
)INIT
  &USRLEFT  = ''
  &USRRIGHT = ''
)PROC
  &ZSEL = TRANS(&ZCMD  1,P86PN5A   2,P86PN8F   3,P86PN8S   4,P86PN5B1 5,P86PN8B
                       6,P86PN8D   7,*P86PN1M@ 8,*P86PN5E  9,*ISP01300
                      10,*P86CUST *,'?')
)END
