)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-¢PDS TCT Line Commands+-\-\-
%OPTION  ===>_ZCMD                                                             +
+
+The following commands are supported as line commands:
     %EXEC+- execute the command
     %UP  +- update or view, and execute command or CLIST
     %VIEW+- view and change command or CLIST with no execution
     %IN  +- insert a blank line
+Special line commands:
     %=   +- repeat previous line command
     %S   +- SELECT line command
     %K   +- kill and clear all following line commands
     %LOG +- format and copy a line to the session log
     %O   +- provide line command operand assistance
     %X   +- delete this line from the table display
)END
