)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ~ TYPE(TEXT) INTENS(HIGH) COLOR(RED)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    < AREA(SCRL) EXTEND(ON)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-¢PDS LISTC Outputs+-\-\-
%OPTION  ===>_ZCMD                                                             +
<PDSAREA                                                                       <
)AREA PDSAREA
  +The first LISTC panel shows basic dataset information like:
   DSNAME, VOLUME, attributes.  Command error messages are provided
   under the DATA header as follows:
    ~*INVALID+- This line command is not supported
    ~*NOTPSPO+- This dataset is not sequential or partitioned
    ~*UNAVAL +- Dataset is migrated
    ~*NOCAT  +- Catalog cannot be found or opened
    ~*NOTCATD+- Dataset was not cataloged
    ~*WASCATD+- Dataset was already cataloged
    ~*WASGONE+- Dataset is not in VTOC
    ~*BADDSN +- Dataset syntax error
    ~*IOERROR+- I/O error in catalog or VTOC
    ~*CANTCAT+- Dataset name inconsistent with catalog structure
    ~*NOSPACE+- There is no space to catalog the dataset
    ~*DUP    +- Duplicate name on the catalog
    ~*NOVOL  +- Volume not mounted or available
    ~*NOTHERE+- Dataset not on volume
    ~*INUSE  +- Dataset is in use
    ~*SECURED+- Userid does not have update authority for dataset

   The second LISTC panel provides the full 44 character dataset name
   which leaves room for only a little attribute information.
   The third LISTC panel is a triple line panel with most of the dataset
   attribute and space information.

   The UPD field indicates if the dataset has been updated since the
   last backup:  Y for yes or N for no.

   The C and V fields are to indicate if the dataset is cataloged and/or
   on the volume:  Y for yes or N for no or "-" for unknown or not checked.

   Other catalog indicators from VTOC command:
     W -  Cataloged on another volume   E -  Catalog processing error
)END
