)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-¢PDS LISTC Line Commands+-\-\-
%OPTION  ===>_ZCMD                                                             +
+
+The following commands are supported as line commands for the file table:
     %C   +- change to a different data set
     %CAT +- catalog the dataset  %UN   +- uncatalog the dataset
     %DEL +- delete the dataset   %REN  +- rename the dataset
+The following line commands cause a change to the data set on the line:
     %A   +- execute alternate saved command
     %B   +- browse the dataset
     %E   +- edit the dataset
     %V   +- view the dataset
     %M   +- create MEMLIST of the dataset (or%6+for MEMLIST ALL)
     %P   +- prompt for¢PDS+dataset commands
     %U   +- display usage information        %Y  +- verify the dataset
     %Z   +- compress the dataset
+Special line commands:
     %=   +- repeat previous line command
     %S   +- SELECT line command
     %K   +- kill and clear all following line commands
     %LOG +- format and copy a line to the session log
     %O   +- provide line command operand assistance
     %X   +- delete this line from the table display
)END
