)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-¢PDS CAX F (Find) Command+-\-\-
%OPTION  ===>_ZCMD                                                             +
+
   The F command may be used to position the CAX table.

   Syntax for the F command is as follows:
    %F string  ASIS  FIRST/LAST/PREV  PREFIX/SUFFIX/WORD
    %          ANY/DSNAME/VOLUME
+ +where -
      %string+is any group of characters beginning with an alphabetic or
              national character and ending with a blank or any group of
              characters enclosed in delimiters such as%"+or%'+
      %ASIS+               Allows upper/lower case string searches
      %FIRST/LAST/PREV+    Sets the search direction and initial positioning
      %PREFIX/SUFFIX/WORD+ Allows partial and full-word searches

      %ANY+     Default, searches all data columns in the table
      %DSNAME+  Searches the Catalog dataset name column only
      %VOLUME+  Searches the volume column only

   Notes: string is a positional parameter; it must be entered first.
          F with no operands may be entered to perform a repeat find.
          Only the first match on a line is reported for a repeat find.
)END
