)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    # TYPE(text) INTENS(HIGH) COLOR(RED) hilite(blink)
    ¬ TYPE(INPUT) intens(non)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢EDIT - RECOVERY+-\-\-
%COMMAND ===>_ZCMD                                                             +
%
%                  *****************************************
%                  *    #   EDIT AUTOMATIC RECOVERY   %    *
%                  *****************************************
%
+The following data set was being edited when a system failure or
+task abend occurred:
%
+Data set:%&Z1                                                  +
+&Z2      %&ZEDTVOL +
%
+Instructions:
+   Press%ENTER+key to continue editing the data set, or
+   Enter%END+command to defer recovery of the specified data set, or
+   Enter%DEFER+command to defer recovery of the specified data set, or
+   Enter%CANCEL+command to cancel recovery of the data set.
%
+To continue editing a password protected data set, specify:
+
+   DATA SET PASSWORD%===>¬PSWD    +
)INIT
  .HELP = ISR2J000
  .CURSOR = ZCMD
  IF (&ZEDTMEM ¬= ' ')
    &Z1 = '&ZEDTDSN(&ZEDTMEM)'
  IF (&ZEDTMEM = ' ')
    &Z1 = '&ZEDTDSN'
  IF (&ZEDTVOL ¬= ' ')
    &Z2 = 'Volume  :'
  IF (&ZEDTVOL = ' ')
    &Z2 = ' '
  &ZCMD = ' '
)PROC
 VER (&ZCMD LIST CANCEL CAN C DEFER DEF D)
 IF (&ZCMD ¬= ' ' )
   &PDSEDOP = TRUNC (&ZCMD,1)
 IF (&ZCMD = ' ' )
   &PDSEDOP = ' '
 &ZCMD = ' '
 VPUT (PSWD) PROFILE
 VPUT (PDSEDOP) SHARED
)END
