)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-¢LKED Date for Load Modules+-\-\-
%OPTION  ===>_ZCMD                                                             +
+
+ MEMLIST prompt     %===>    + (Yes/No) %LKED Date for load  ===>+???  (Yes/No)
+ Alias check        %===>    + (Yes/No)  Auto member update %===>    + (Yes/No)
+ Remove deleted mem %===>    + (Yes/No)  Remove old members %===>    + (Yes/No)
+ Alias update       %===>    + (Yes/No)  Save in profile    %===>    + (Yes/No)

%LKED date for load:+
   The date a load module was linked is not available in its directory
   entry.  A considerable amount of I/O processing is required to provide
   linkage-edit dates since it is recorded in the load module itself.

   The value chosen for this parameter can be overridden on each
   MEMLIST subcommand.

   Respond with%YES+if you want¢PDS+to provide the linkage-edit date
   for load modules displayed by the MEMLIST subcommand.
)END
