PROC 0
CONTROL PROMPT
ISPEXEC LIBDEF ISPPLIB DATASET ID('SHARE.PDS.SPDSPLIB') STACK
ISPEXEC LIBDEF ISPMLIB DATASET ID('SHARE.PDS.SPDSMLIB') STACK
ISPEXEC LIBDEF ISPLLIB DATASET ID('SHARE.PDS.SPDSLLIB') STACK
ISPEXEC SELECT PANEL(PDS@PRIM) NEWAPPL(ISR) PASSLIB SCRNAME(PDS)
ISPEXEC LIBDEF ISPPLIB
ISPEXEC LIBDEF ISPMLIB
ISPEXEC LIBDEF ISPLLIB
