    PROC 2 MEMN DSNN  DEBUG
    IF &DEBUG=DEBUG THEN CONTROL LIST CONLIST SYMLIST
    SET TITLE=PANEL PREPROCESSER
    SET CLR=D
    SET NONDPLY='N'
      ISPEXEC  CONTROL NONDISPL
      ISPEXEC  DISPLAY  PANEL(SCPDSN)
      IF &LASTCC ¬= 0 THEN  DO          /* RETURN CODES */
        EXIT
        END
    REPET2: -
    SET MSG01=ENTER TAGET PANEL DSN
    SET MSG02=ENTER OBJECT DSNAME
       SET &DSN1='SCP.ISPFPREP.PANELS'
    REPET: -
    SET TYPE=
    SET REQ1=   ENTER TAGED PANEL DSN
    SET REQ2=   REPLACE
    SET ENT2=   YES
    SET REQ3=
    SET ENT3=
    SET REQ4=
    SET ENT4=
    SET REQ5=
    SET ENT5=
    SET REQ6=
    SET ENT6=
      ISPEXEC  DISPLAY  PANEL(SCPDSN) MSG(SCPM010I)
      IF &LASTCC ¬= 0 THEN  DO          /* RETURN CODES */
        EXIT
        END
    IF &MEM1¬= THEN SET MEM2=&MEM1
    ELSE SET MEM2=&MEMN
    IF &ENT2=YES THEN SET &REP=REPLACE
    ELSE SET &REP=NOREPL
    ISPEXEC SELECT PGM(ISPPREP) PARM(INPAN('&DSNN(&MEMN)') -
                 OUTPAN('&ENT1(&MEM2)') &REP)
    SET &LCC=&LASTCC
    WRITE RC=&LCC
    EXIT CODE(&LCC)
