/* Rexx */
Trace
Arg olddd newdd

Address "TSO"
"ALLOC F(SYSIN) UNIT(VIO) NEW REUSE SPACE(1,1) TRACKS",
  "LRECL(80) RECFM(F B) BLKSIZE(0) DSORG(PS)"

"NEWSTACK"
Queue "CMPCOLM 1:133"
Queue ""
"EXECIO * DISKW SYSIN (FINIS"
"DELSTACK"

"ALLOC F(OLDDD) DA("olddd") SHR REUSE"
"ALLOC F(NEWDD) DA("newdd") SHR REUSE"
"ALLOC F(OUTDD) UNIT(VIO) NEW REUSE SPACE(15,15) TRACKS",
               "RECFM(F B A) LRECL(133) BLKSIZE(0) DSORG(PS)"

parm = "LINECMP,DELTAL"
Address  LINKMVS "ISRSUPC parm"

Address ISPEXEC
"ISPEXEC LMINIT DATAID(ID) DDNAME(OUTDD) ENQ(EXCLU)"
If rc <> 0 Then
  Say LMINIT failed
"ISPEXEC VIEW   DATAID("id")"
"ISPEXEC LMFREE DATAID("id")"

Address "TSO"
"ALLOC F(SYSIN) DA(*) SHR REUSE"
"FREE  F(OLDDD NEWDD OUTDD)"

Exit
/* J. Kalinich               */
/* P86LOUX line command to invoke SuperC on two members */
