)ATTR
$ TYPE(OUTPUT) INTENS(HIGH) PAD(' ')
)BODY WINDOW(25,2)
$Msgout
)PROC
  &CPOS   = .CSRPOS             /* GET CURSOR OFFSET                  */
  &CNAME  = .CURSOR             /* GET CURSOR FIELD NAME              */
  &CSEL   = &ZKEY
)END
