)ATTR
 % COLOR(TURQ)    INTENS(HIGH) TYPE(TEXT)
 + COLOR(YELLOW)  INTENS(HIGH) TYPE(TEXT)
 @ COLOR(PINK)    INTENS(HIGH) TYPE(OUTPUT) CAPS(OFF)
 ` COLOR(RED)     INTENS(HIGH) TYPE(TEXT)   HILITE(BLINK)
 $ COLOR(GREEN)   INTENS(HIGH) TYPE(TEXT)   CAPS(OFF)
 # COLOR(PINK)    INTENS(HIGH) TYPE(DATAOUT)
 ? COLOR(&BARDYE) INTENS(HIGH) TYPE(DATAOUT) HILITE(REVERSE)
 * AREA(DYNAMIC) SCROLL(OFF)  EXTEND(OFF)
)BODY  WINDOW(55,5)
%                                                +
+&WaitMsg                                        +
%                                                +
 *PROCIND                                        *
%                                                +
)INIT
 &ZWINTTL = ' Progress Meter '
)PROC
 &ZWINTTL = ''
)END
