)ATTR
? TYPE(INPUT) INTENS(LOW) JUST(LEFT)
_ TYPE(INPUT) INTENS(LOW) JUST(LEFT) PAD(' ') COLOR(YELLOW)
)BODY WINDOW(70,10)
 Command ==>?ZCMD                                         _C
_UT1
_UT2
_UT3
_UT4
_UT5
_UT6
_UT7
_UT8
)PROC
  &CPOS   = .CSRPOS             /* GET CURSOR OFFSET                  */
  &CNAME  = .CURSOR             /* GET CURSOR FIELD NAME              */
  &CSEL   = &ZKEY
  .CURSOR = ZCMD
)END
