)ATTR
+ TYPE(TEXT)   INTENS(LOW) COLOR(WHITE)
_ TYPE(INPUT)  INTENS(LOW) JUST(LEFT)  PAD(' ') CAPS(OFF) COLOR(YELLOW)
)BODY WINDOW(21,02)
   _Yes+<< Proceed
   _No +<< Cancel
)INIT
&ZWINTTL= '* Delete? *'
&Yes    = Yes
&No     = No
)PROC
&ZWINTTL= ''
&CNAME  = .CURSOR
)END
