//INITT    JOB CLASS=A,MSGCLASS=A
//IEHINITT EXEC PGM=IEHINITT
//SYSPRINT  DD SYSOUT=*
//TAPE      DD UNIT=(TAPE,,DEFER),DCB=DEN=4  6250 BPI
//SYSIN     DD *
TAPE     INITT SER=XV0005,OWNER='N9GTM'
//
