//INSTALL  JOB XMIT370,CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(2,0),NOTIFY=N9GTM
//*            RESTART=LINK
//*            RESTART=XMIT06.ASMBLR
//* -------------------------------------------------------------------
//DELETE   EXEC PGM=IEHPROGM
//SYSPRINT  DD DUMMY
//MVS3380   DD UNIT=3380,VOL=SER=MVS809,DISP=SHR
 SCRATCH DSNAME=SYS2.U370370.LIST,VOL=3380=MVS809
 UNCATLG DSNAME=SYS2.U370370.LIST
 SCRATCH DSNAME=SYS2.U370370.OBJ,VOL=3380=MVS809
 UNCATLG DSNAME=SYS2.U370370.OBJ
//*
//ALLOC    EXEC PGM=IEFBR14
//LIST      DD DSN=SYS2.U370370.LIST,
//             UNIT=3380,VOL=SER=MVS809,
//             SPACE=(CYL,(20,0,5),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=23474),
//             DISP=(,CATLG)
//OBJ       DD DSN=SYS2.U370370.OBJ,
//             UNIT=3380,VOL=SER=MVS809,
//             SPACE=(CYL,(5,0,5),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200),
//             DISP=(,CATLG)
//*
//* -------------------------------------------------------------------
//U370ABND EXEC ASM370,APP=U370,M=U370ABND
//U370AP00 EXEC ASM370,APP=U370,M=U370AP00
//U370AP99 EXEC ASM370,APP=U370,M=U370AP99
//U370CHAR EXEC ASM370,APP=U370,M=U370CHAR
//U370DATE EXEC ASM370,APP=U370,M=U370DATE
//U370DBUG EXEC ASM370,APP=U370,M=U370DBUG
//U370HERC EXEC ASM370,APP=U370,M=U370HERC
//U370HEX  EXEC ASM370,APP=U370,M=U370HEX
//U370LOG  EXEC ASM370,APP=U370,M=U370LOG
//U370PSR  EXEC ASM370,APP=U370,M=U370PSR
//U370QENV EXEC ASM370,APP=U370,M=U370QENV
//U370QSS  EXEC ASM370,APP=U370,M=U370QSS
//U370QTCB EXEC ASM370,APP=U370,M=U370QTCB
//U370SDWA EXEC ASM370,APP=U370,M=U370SDWA
//U370SNAP EXEC ASM370,APP=U370,M=U370SNAP
//U370STAE EXEC ASM370,APP=U370,M=U370STAE
//U370TIOT EXEC ASM370,APP=U370,M=U370TIOT
//U370VADR EXEC ASM370,APP=U370,M=U370VADR
//U370WTO  EXEC ASM370,APP=U370,M=U370WTO
//* -------------------------------------------------------------------
//LINK     EXEC PGM=IEWL,
//             COND=(5,LT),
//             PARM='LIST,MAP,XREF,LET,NCAL,RENT'
//SYSPRINT  DD SYSOUT=*
//SYSLMOD   DD DSN=SYS2.LOCAL.LINKLIB,DISP=SHR
//U370LIB   DD DSN=SYS2.LOCAL.LINKLIB,DISP=SHR
//SYSLIB    DD DSN=SYS2.U370370.OBJ,DISP=SHR
//SYSUT1    DD UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSLIN    DD DSN=SYS2.XMIT370.ASM(KLNKU370),DISP=SHR
//
