//INSTALL  JOB XMIT370,CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(2,0),NOTIFY=N9GTM
//*            RESTART=LINK
//*            RESTART=XMIT06.ASMBLR
//* -------------------------------------------------------------------
//* RUN JXMITNEW TO CREATE LIST & OBJ DATASETS
//* -------------------------------------------------------------------
//U370ABND EXEC ASM370,APP=XMIT,M=U370ABND
//U370AP00 EXEC ASM370,APP=XMIT,M=U370AP00
//U370AP99 EXEC ASM370,APP=XMIT,M=U370AP99
//U370CHAR EXEC ASM370,APP=XMIT,M=U370CHAR
//U370DATE EXEC ASM370,APP=XMIT,M=U370DATE
//U370DBUG EXEC ASM370,APP=XMIT,M=U370DBUG
//U370HERC EXEC ASM370,APP=XMIT,M=U370HERC
//U370HEX  EXEC ASM370,APP=XMIT,M=U370HEX
//U370LOG  EXEC ASM370,APP=XMIT,M=U370LOG
//U370PSR  EXEC ASM370,APP=XMIT,M=U370PSR
//U370QENV EXEC ASM370,APP=XMIT,M=U370QENV
//U370QSS  EXEC ASM370,APP=XMIT,M=U370QSS
//U370QTCB EXEC ASM370,APP=XMIT,M=U370QTCB
//U370SDWA EXEC ASM370,APP=XMIT,M=U370SDWA
//U370SNAP EXEC ASM370,APP=XMIT,M=U370SNAP
//U370STAE EXEC ASM370,APP=XMIT,M=U370STAE
//U370TIOT EXEC ASM370,APP=XMIT,M=U370TIOT
//U370VADR EXEC ASM370,APP=XMIT,M=U370VADR
//U370WTO  EXEC ASM370,APP=XMIT,M=U370WTO
//XMITBUF  EXEC ASM370,APP=XMIT,M=XMITBUF
//XMITCPR1 EXEC ASM370,APP=XMIT,M=XMITCPR1
//XMITDIR  EXEC ASM370,APP=XMIT,M=XMITDIR
//XMITESZ  EXEC ASM370,APP=XMIT,M=XMITESZ
//XMITKDSN EXEC ASM370,APP=XMIT,M=XMITKDSN
//XMITKEY  EXEC ASM370,APP=XMIT,M=XMITKEY
//XMITPUT  EXEC ASM370,APP=XMIT,M=XMITPUT
//XMITUNLD EXEC ASM370,APP=XMIT,M=XMITUNLD
//XMITVTAB EXEC ASM370,APP=XMIT,M=XMITVTAB
//XMIT01   EXEC ASM370,APP=XMIT,M=XMIT01
//XMIT02A  EXEC ASM370,APP=XMIT,M=XMIT02A
//XMIT02B  EXEC ASM370,APP=XMIT,M=XMIT02B
//XMIT03   EXEC ASM370,APP=XMIT,M=XMIT03
//XMIT06   EXEC ASM370,APP=XMIT,M=XMIT06
//XMIT370  EXEC ASM370,APP=XMIT,M=XMIT370
//* -------------------------------------------------------------------
//LINK     EXEC PGM=IEWL,
//             COND=(5,LT),
//             PARM='LIST,MAP,XREF,LET,NCAL,RENT'
//SYSPRINT  DD SYSOUT=*
//SYSLMOD   DD DSN=SYS2.LOCAL.LINKLIB,DISP=SHR
//U370LIB   DD DSN=SYS2.LOCAL.LINKLIB,DISP=SHR
//SYSLIB    DD DSN=SYS2.XMIT370.OBJ,DISP=SHR
//SYSUT1    DD UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSLIN    DD DSN=SYS2.XMIT370.ASM(KLNKU370),DISP=SHR
//          DD DSN=SYS2.XMIT370.ASM(KLNKXMIT),DISP=SHR
//
