//INSTALL  JOB XMIT370,CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(2,0),NOTIFY=N9GTM
//DELETE   EXEC PGM=IEHPROGM
//SYSPRINT  DD DUMMY
//MVS3380   DD UNIT=3380,VOL=SER=MVS809,DISP=SHR
 SCRATCH DSNAME=SYS2.XMIT370.LIST,VOL=3380=MVS809
 UNCATLG DSNAME=SYS2.XMIT370.LIST
 SCRATCH DSNAME=SYS2.XMIT370.OBJ,VOL=3380=MVS809
 UNCATLG DSNAME=SYS2.XMIT370.OBJ
//*
//ALLOC    EXEC PGM=IEFBR14
//LIST      DD DSN=SYS2.XMIT370.LIST,
//             UNIT=3380,VOL=SER=MVS809,
//             SPACE=(CYL,(20,0,5),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=23474),
//             DISP=(,CATLG)
//OBJ       DD DSN=SYS2.XMIT370.OBJ,
//             UNIT=3380,VOL=SER=MVS809,
//             SPACE=(CYL,(5,0,5),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200),
//             DISP=(,CATLG)
//
