//SBGOLOBL  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//* ---------------------------------------------------------- *//
//*  BDMDUMP  -  CREATE A FB-130 BACKUP OF A BRODCAST DATASET  *//
//* ---------------------------------------------------------- *//
//BDMDUMP1 EXEC PGM=BDMDUMP,REGION=3M
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.BDM140B.LOADLIB
//BRODMAP  DD  SYSOUT=*
//BRODPRNT DD  SYSOUT=*
//BRODUSER DD  SYSOUT=*
//BRODCAST DD  DISP=SHR,DSN=SBGOLOB.NEW.BRODCAST
//BRODDUMP DD  DISP=(NEW,CATLG,CATLG),DSN=SBGOLOB.DUMP.NEW.BRODCAST,
//         DCB=(RECFM=FB,LRECL=130,BLKSIZE=27950),
//         SPACE=(TRK,(30,30),RLSE)
//*
