//SBGOLOBC JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//* ----------------------------------------------------------- *//
//*   BDMUSORT EXECUTION - SORT USERIDS FOR INPUT TO BDMULOAD   *//
//* ----------------------------------------------------------- *//
//BDMUSORT EXEC PGM=BDMUSORT,REGION=3000K
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.BDM140B.LOADLIB
//USERIDS  DD  DISP=SHR,DSN=SBGOLOB.MYBRODCS.USROUT
//         DD  DISP=SHR,DSN=SBGOLOB.SYS1.USROUT
//USRIDOUT DD  DISP=(NEW,CATLG,DELETE),DSN=SBGOLOB.MYBRODCS.USRSORT,
//             DCB=(RECFM=FB,DSORG=PS,LRECL=8,BLKSIZE=8000),
//             SPACE=(TRK,(5,5)),UNIT=SYSALLDA,VOL=SER=WORK04
//SORTIN   DD  DSN=&&SORT,DISP=(NEW,PASS),UNIT=SYSALLDA,
//             DCB=(RECFM=FB,LRECL=8,BLKSIZE=8000),
//             SPACE=(TRK,(5,5))
//SORTOUT  DD  DSN=&&SORT,DISP=(SHR,PASS),VOL=REF=*.SORTIN
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
