/* REXX PROG TO READ UNIQUE-FILE LIST AND PRODUCE 10 AND OVER LIST */
ADDRESS "TSO";
"FREE F(INDD)";
"ALLOC DA('SYS1.TECH.LIBSCN.IN') F(INDD) SHR";
"ALLOC DA('SYS1.TECH.LIBRSCAN.OUT') F(OUTDD)  NEW ",
       "SPACE(30,10) DSORG(PS) RECFM(F,B) LRECL(80) BLKSIZE(800)",
       "UNIT(SEQDA) TRACKS";
"EXECIO * DISKR INDD (FINIS STEM DATA.";
PREVIOUS_MEMBER = EMPTY
COUNT = 0
DO I = 1 TO DATA.0
   FULLINE = DATA.I
   IF WORDS(FULLINE) < 2 THEN ITERATE
   COPYPOS = WORDPOS(' COPY ',FULLINE)
   IF COPYPOS = 0 THEN ITERATE
   WORD2 = WORD(FULLINE,2)
   LENWORD2 = LENGTH(WORD2)
   IF SUBSTR(FULLINE,2,1) /= ' ' & LENWORD2 = 4 THEN DO
     WORD1 = SUBSTR(FULLINE,2,8)
     PREVIOUS_MEMBER = WORD1
     END
   IF POS('*',FULLINE) = 29 THEN ITERATE
   COPYBOOK = WORD(FULLINE,COPYPOS+1)
   BOOKLENGTH = LENGTH(COPYBOOK)
   PERIOD = SUBSTR(COPYBOOK,BOOKLENGTH,1)
   WORD3 = WORD(FULLINE,COPYPOS+2)

   IF (PERIOD /= '.') & ((WORD3 /= 'REPLACING') & ,
      (WORD3 /= 'SUPPRESS.')) THEN ITERATE;
   IF PERIOD = '.' THEN
     DO
       COPYBOOK = SUBSTR(COPYBOOK,1,BOOKLENGTH-1)
       BOOKLENGTH = BOOKLENGTH - 1
     END
   IF BOOKLENGTH < 4 THEN ITERATE
   IF SUBSTR(COPYBOOK,1,1) = "'" THEN
     DO
       NEWBOOK = SUBSTR(COPYBOOK,2,BOOKLENGTH-2)
       COPYBOOK = NEWBOOK
     END
   DO
     IF PREVIOUS_MEMBER = 'EMPTY' THEN ITERATE
     DETAIL_LINE = PREVIOUS_MEMBER || '   ' || COPYBOOK
     PUSH DETAIL_LINE
     "EXECIO 1 DISKW OUTDD"
   END
 END I;
"EXECIO 0 DISKW OUTDD (FINIS"
"FREE F(INDD)";
"FREE F(OUTDD)";
EXIT 0;
