 PROC 0
 SET VARLIST = &STR(ZTIME ZJDATE COUNT DSNWHOLE)
 ISPEXEC VGET (&VARLIST) SHARED
 SET HOUR = &SUBSTR(1:2,&ZTIME)
 SET MINS = &SUBSTR(4:5,&ZTIME)
 SET &HHMM = &STR(&HOUR)&STR(&MINS)
 SET YEAR = &SUBSTR(1:2,&ZJDATE)
 SET DAYS = &SUBSTR(4:6,&ZJDATE)
 SET &YYDDD = &STR(&YEAR)&STR(&DAYS)
 SET VARLIS2 = &STR(COUNT DSNWHOLE)
 SET &COUNT = &COUNT + 1
 SET &BASENAME = &STR(CARTS23)
 SET &DSNWHOLE = &STR(&SYSUID..&BASENAME..D&YYDDD..T&HHMM..F&COUNT)
 ISPEXEC VPUT (&VARLIS2) SHARED
 ALLOC FI(CONTROLT) DA('&DSNWHOLE.') +
       NEW  BLKSIZE(8000) LRECL(5000) +
       SP(2,1) TRACKS RECFM(V B) DSORG(PS)
