/* REXX EXEC  */
/* LIB/CCF COBOL2 QA TURNOVER COMPILE FACILITY TO DETERMINE NATIVE OR
   COMPATIBILITY MODE COMPILE OPTION   */

TRACE O
/*     */
HOUSE_KEEPING:
ARG TSOUSER MEMBER
IF MEMBER = '' THEN DO
   SAY '*** MEMBER NAME NOT PASSED ON COMMAND LINE. ***'
   EXIT 8
END
EXITRC = 4
C2P = 'APOST,LIB,CMPR2,RES,RENT,DYNAM'
ADDRESS TSO
"ALLOC DA('"TSOUSER"."MEMBER".SEQFILE') F(ISPFILE) SHR"
IF RC ¬= 0 THEN DO
   SAY '*** DATASET ALLOCATE ERROR:' TSOUSER||'.'||MEMBER||'.'||SEQFILE '***'
   EXIT 8
END
"EXECIO * DISKR ISPFILE (FINIS STEM DATA."
IF RC ¬= 0 THEN DO
   SAY '*** DATASET EXECIO ERROR:' TSOUSER||'.'||MEMBER||'.'||SEQFILE '***'
   EXIT 8
END
DO I = 1 TO DATA.0
   NOCMPR2 = POS('NOCMPR2-FLAG',DATA.I)
   IF NOCMPR2 ¬= 0 THEN DO
      EXITRC = 0
      C2P = 'APOST,LIB,NOCMPR2,RES,RENT,DYNAM'
      LEAVE
   END
END
"FREE F(ISPFILE)"
EXIT EXITRC
