         MACRO
&NAME    QTILT &MESSAGE
&NAME    L     R15,QVDSPL     LOAD BASE REG
         USING QDISPLAY,R15   BASE REG FOR DISPLAY WORK AREA
         L     R14,QDHLINE@   POINT TO HEADING LINE
         MVC   0(80,R14),=CL80&MESSAGE
         MVC   QDMLNG,=H'0'   ZERO MESSAGE LENGTH
         L     R14,QDSHADO@   POINT TO THE SHADOW BUFFER
         AH    R14,QDLNELEN   POINT TO HEADING LINE SHADOW
         MVI   0(R14),X'22'   RED REVERSE VIDEO FOR ERROR MESSAGE
         MVC   1(79,R14),0(R14)
         DROP  R15
         L     R15,=V(DISPLAY) ADDR OF DISPLAY MODULE
         LR    R14,R15        SET FOR LOOP
         BR    R15            GO TO IT
         MEND
