//COMMANDS EXEC ASMFCL,PARM.LKED='LET,LIST,RENT,REUS'
//ASM.SYSIN DD *
         ENTRY APFCTABL
IKJEFTE2 CSECT
         DC    CL8'IKJEFTE2'
         DC    CL8'06.01.80'
APFCTABL DC    CL8'QUEUE   '       QUEUE COMMAND
         DC    CL8'Q       '       ALIAS
         DC    CL8'CMD1    '       SPARE TABLE ENTRIES
         DC    CL8'CMD2    '       SPARE TABLE ENTRIES
         DC    CL8'CMD3    '       SPARE TABLE ENTRIES
         DC    CL8'        '       8 BLANKS TABLE TERMINATOR
         END
/*
//LKED.SYSLMOD DD DSN=T90000.IPO38.GENLIB(IKJEFTE2),DISP=SHR
//*
//* CHANGE SYSLMOD TO WHATEVER LIBRARY YOU USE TO HOLD SYSTEM MODULES
//*
//TSOCMDS EXEC IPOSMP4
//SMP.SMPCNTL DD *
  RECEIVE S(TR00003).
  APPLY S(TR00003) DIS(WRITE).
/*
//*
//* THE VERIFY CARD BELOW IS SET UP FOR A MVS 3.8 SYSTEM WITH THE
//* TSO COMMAND PACKAGE INSTALLED. IF YOU DON'T HAVE THE COMMAND
//* PACKAGE YOU WILL NEED TO MODIFY THE VERIFY TO MATCH YOUR
//* SYSTEM ENVIRONMENT.
//*
//SMP.SMPPTFIN DD *
++ USERMOD(TR00003) /* TSO AUTHORIZED COMMANDS */.
++ VER(Z038) FMID(EBB1102) PRE(JBB1112).
++ MOD(IKJEFTE2) DISTLIB(AOST4) LKLIB(GENLIB).
/*
//GENLIB DD DSN=T90000.IPO38.GENLIB,DISP=SHR
//*
//* CHANGE GENLIB TO WHATEVER LIBRARY YOU USE TO HOLD SYSTEM MODULES
//*
