PLIAVG:PROC OPTIONS(MAIN);
 /*==================================================================*/
 /*==================================================================*/
         DCL AVERAGE_GRADE FIXED DECIMAL(5);
         DCL TDTIME CHAR(17);
         DCL TTIME CHAR(8);
         DCL TDATE CHAR(6);
         TTIME = TIME();
         TDATE = DATE();
         TDTIME = DATETIME();
         DISPLAY ('TIME IS ' || TTIME);
         DISPLAY ('DATE IS ' || TDATE);
         DISPLAY ('DATETIME IS ' || TDTIME);
         END PLIAVG;
