//DAHANDBK JOB (........),'INSTALL - DAHANDBK -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=1M,TIME=1
/*JOBPARM L=5
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* PRE-REQUISITE MODULES INSTALLATION :                              *
//*                GFDATE                                             *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASS     EXEC PAJ1AS3,MBR=DAHANDBK
//LNK     EXEC PAJILKL
//SYSIN     DD *
  INCLUDE SYSADD(GFDATE)
  ENTRY   DAHANDBK
  NAME    DAHANDBK(R)
/*
