PROC 0 DEBUG
CONTROL NOLIST NOMSG NOFLUSH PROMPT
IF &DEBUG NE &STR() THEN +
  CONTROL LIST MSG NOFLUSH PROMPT CONLIST SYMLIST
ISPEXEC CONTROL ERRORS RETURN
SET &RC EQ &STR(0)
SET &POPT EQ &STR(YES)
ISPEXEC VGET (BJC1,BJC2,BJC3,BJC4) PROFILE
SET &JOB1 EQ &STR(&BJC1)
SET &JOB2 EQ &STR(&BJC2)
SET &JOB3 EQ &STR(&BJC3)
SET &JOB4 EQ &STR(&BJC4)
ISPEXEC VPUT (JOB1,JOB2,JOB3,JOB4,POPT) SHARED
ISPEXEC SELECT PANEL(USERSELB)
SET &RC EQ &LASTCC
ISPEXEC VGET (JOB1,JOB2,JOB3,JOB4,POPT,ZTEMPF) SHARED
IF &RC EQ &STR(0) THEN +
  DO
    ISPEXEC FTCLOSE
      IF &LASTCC EQ 8 THEN +
        DO
          GOTO GETOUT
        END
      ELSE +
        DO
          CONTROL MSG
          SUB '&ZTEMPF'
          CONTROL NOMSG
        END
  END
ELSE +
  IF &RC EQ &STR(4) THEN +
    DO
      IF &STR(&POPT) EQ &STR(CANCEL) THEN +
        DO
          GOTO GETOUT
        END
      ELSE +
        DO
          ISPEXEC FTCLOSE
          IF &LASTCC EQ 8 THEN +
            DO
              GOTO GETOUT
            END
          ELSE +
            DO
              CONTROL MSG
              SUB '&ZTEMPF'
              CONTROL NOMSG
            END
        END
    END
GETOUT: +
ISPEXEC FTOPEN TEMP
ISPEXEC FTCLOSE
SET &BJC1 EQ &STR(&JOB1)
SET &BJC2 EQ &STR(&JOB2)
SET &BJC3 EQ &STR(&JOB3)
SET &BJC4 EQ &STR(&JOB4)
ISPEXEC VPUT (BJC1,BJC2,BJC3,BJC4) PROFILE
END
