//DIDOCS   JOB (........),'INSTALL  - DIDOCS -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=1M,TIME=1
/*JOBPARM L=6
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* PRE-REQUISITE MODULES INSTALLATION :                              *
//*                AUTHCTL                                            *
//* NOTE - THE ASSEMBLY OF DIDOCS CONTAINS THE FOLLOWING STATEMENT :  *
//*           COPY  DIDOCSM                                           *
//*        WHICH IS AN UPDATED VERSION OF THE MACRO IEECRDCM MISSING  *
//*        IN THE GENERATED SYS1.MODGEN (MVS/XA 2.2.3).               *
//*        THAT'S ALL FOLKS - GOOD LUCK                               *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASS     EXEC PAJ4AS3,OPT=',RENT',MBR=DIDOCS
//LNK     EXEC PAJILKC,OPT=',RENT'
//SYSIN     DD *
  ENTRY   DIDOCS
  SETCODE AC(1)
  NAME    DIDOCS(R)
/*
