//ETPSTSO  JOB (........),'INSTALL   ETPSTSO',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=1M,TIME=1
/*JOBPARM L=30
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* MANDATORY : BEFORE YOU EXECUTE THIS JOB, READ THE INSTALLATION    *
//*             DOCUMENTATION IN MEMBER "ETPS@".                      *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* AT ASSEMBLY STEP BELOW, YOU MAY USE THE SYSPARM TO SELECT THE     *
//* PRINT OPTION AS FOLLOWS :                                         *
//*            NONE OR OMITTED = NO LIST OF MACROS DEVELOPMENT        *
//*            SHORT = REDUCED LIST OF MACROS DEVELOPMENT             *
//*            FULL = LIST ALL MACROS DEVELOPMENT                     *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASS     EXEC PAJ4AS6,MBR=ETPSTSO,OPT=',RENT'
//LNK     EXEC PAJILKC,OPT=',NCAL,RENT'
//SYSIN     DD *
  ENTRY   ETPSTSO
  SETCODE AC(1)
  NAME    ETPSTSO(R)
/*
