//MEMSTAT  JOB (........),'INSTALL  - MEMSTAT-',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=4
//ASS     EXEC PAJ4AS3,OPT=',RENT',MBR=MEMSTAT
//LNK     EXEC PAJILKC,OPT=',MAP,RENT'
//SYSIN     DD *
  ENTRY   MEMSTAT
  NAME    MEMSTAT(R)
/*
//HLP     EXEC PAJHELP,MBR=MEMSTATH,DSS='->.SOURCE.FILE4'
