//WHATDSN  JOB (........),'INSTALL - WHATDSN -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=1M,TIME=1
/*JOBPARM L=5
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* PRE-REQUISITE MODULES INSTALLATION :                              *
//*                DSNTAB                                             *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASS     EXEC PAJ4AS3,OPT=',RENT',MBR=WHATDSN
//LNK     EXEC PAJILKC,OPT=',MAP,RENT'
//SYSIN     DD *
  INCLUDE SYSADD(DSNTAB)
  ENTRY   WHATDSN
  NAME    WHATDSN(R)
/*
//HLP     EXEC PAJHELP,MBR=WHATDSNH,DSS='->.SOURCE.FILE4'
