//ZAP      JOB (........),'INSTALL  - Z A P -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=1M,TIME=1
/*JOBPARM L=10
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* PRE-REQUISITE MODULES INSTALLATION :                              *
//*                AUTHCTL                                            *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASZ     EXEC PAJ4AS3,OPT=',RENT',MBR=ZAP
//ASO     EXEC PAJ4AS1,OPT=',RENT',MBR=OACNOW
//LNK     EXEC PAJILKC,OPT=',RENT'
//SYSIN     DD *
  ENTRY   ZAP
  NAME    ZAP(R)
/*
//HLP     EXEC PAJHELP,MBR=ZAPH,DSS='->.SOURCE.FILE4'
