//SBGOLOBC JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//*    COMPARE 2 ENTIRE PACKS
//*
//STEP1  EXEC PGM=DISKCOMP,
//       PARM='0ACD,0AEF'
//*      PARM='UNIT1,UNIT2,LOCYL,HICYL,MSGDDN'
//STEPLIB  DD DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSPRINT DD SYSOUT=*
