++USERMOD(TCMD001)  REWORK(1986039)  .
++VER(Z038) FMID(JBB1329) VERSION(TCMD100)   /*
 ********************************************************************
 *                                                                  *
 *  THIS MAKES THE USER EXIT AVAILABLE TO NIP. SEE IEAVNP99 FOR     *
 *  DOCUMENTATION ON CODING ENTRIES TO THE TABLE. IF YOU HAVE ANY   *
 *  OEM MICROCODE ASSIST TYPE CODE, EXPECT TO DO A BYPASS(PRE).     *
 *                                                                  *
 *                              M CRUZAN                            *
 *                                                                  *
 ********************************************************************
                            */  .
++ZAP(IEAVNIPM) DISTLIB(AOSC5) .
 NAME IEAVNIPM
 VER 2FB8 4040,F0F0       /*   FIND AN EMPTY SLOT   */
 REP 2FB8 F9F9,F0F3       /*  FOR THE OPTIONAL MOD  */
 IDRDATA TCMD001
