)ATTR
_ TYPE(INPUT)   INTENS(HIGH) COLOR(YELLOW)
% TYPE(TEXT)    COLOR(RED)
* TYPE(TEXT)    COLOR(YELLOW)
+ TYPE(TEXT)    COLOR(WHITE)
# TYPE(OUTPUT)  INTENS(HIGH) COLOR(BLUE)
? TYPE(OUTPUT)  INTENS(HIGH) COLOR(RED)
@ TYPE(OUTPUT)  COLOR(RED)
)BODY WINDOW(60,5)
%
%    -----------------------------------------------------
%    |  EDT ESOTERIC Search is in progress. Please Wait  |
%    -----------------------------------------------------
%
)INIT
&ZCMD= ' '
&ZWINTTL=  'EDT ESOTERIC Search'
)REINIT
&ZCMD= ' '
)PROC
)END
