)ATTR
_ TYPE(INPUT)   INTENS(HIGH) COLOR(YELLOW)
% TYPE(TEXT)    COLOR(RED)
* TYPE(TEXT)    COLOR(YELLOW)
+ TYPE(TEXT)    COLOR(WHITE)
# TYPE(OUTPUT)  INTENS(HIGH) COLOR(BLUE)
? TYPE(OUTPUT)  INTENS(HIGH) COLOR(RED)
@ TYPE(OUTPUT)  COLOR(RED)
)BODY WINDOW(54,7)
%
%COMMAND ===>_ZCMD      %         SCROLL ===>_AMT   +
%
%   ------------------------------------------------
%   | Your Request Is Being Processed. Please Wait |
%   ------------------------------------------------
%
)INIT
&ZCMD= ' '
&ZWINTTL=  'Progress Panel'
)REINIT
&ZCMD= ' '
)PROC
)END
