%-----------------------  NETWORK PROBLEM TRACKING/LOGGING  --------------------
%COMMAND ===>_ZCMD
+
+
      The program has run out of memory!!

      Everything you have done so far will be saved. Press the Enter key or
      your PF3 key to proceed to the Problem Number Assignment screen.

%     Please notify Network Control in Helena that you had this problem.
+
)INIT
 &A = ' '
 &ZCMD = ' '
)PROC
 IF (&ZCMD ¬= &Z) .MSG=ISPZ001
)END
