//IGYWCL   JOB  ACCOUNT,'COBOL COMPILE',
//         CLASS=F,
//         MSGCLASS=H,
//         NOTIFY=&SYSUID
//PROCLIB  JCLLIB ORDER=(IGY520.SIGYPROC)
//SCEELKED SET  SCEELKED=CEE.SCEELKED Change as needed.
//TESTCOB1 EXEC IGYWCL,
//         LNGPRFX='IGY520',
//         PARM.LKED=(LET,LIST,XREF,MAP,CALL)
//COBOL.SYSIN DD DISP=SHR,DSN=&SYSUID..SQL3210.CNTL(TESTCOB1)
//COBOL.SYSLIB DD DISP=SHR,DSN=CEE.SCEESAMP
//             DD DISP=SHR,DSN=&SYSUID..SQL3210.CNTL
//LKED.SYSLIB DD
//            DD DISP=SHR,DSN=&SYSUID..SQL3210.LINKLIB
//            DD DISP=SHR,DSN=&SCEELKED
//LKED.SYSLMOD DD DSN=&SYSUID..SQL3210.LINKLIB,DISP=SHR
//*
//TESTCOB2 EXEC IGYWCL,
//         LNGPRFX='IGY520',
//         PARM.LKED=(LET,LIST,XREF,MAP,CALL)
//COBOL.SYSIN DD DISP=SHR,DSN=&SYSUID..SQL3210.CNTL(TESTCOB2)
//COBOL.SYSLIB DD DISP=SHR,DSN=CEE.SCEESAMP
//             DD DISP=SHR,DSN=&SYSUID..SQL3210.CNTL
//LKED.SYSLIB DD
//            DD DISP=SHR,DSN=&SYSUID..SQL3210.LINKLIB
//            DD DISP=SHR,DSN=&SCEELKED
//LKED.SYSLMOD DD DSN=&SYSUID..SQL3210.LINKLIB,DISP=SHR
//*
