//JOBNAME  JOB (XX,R412,30,20,05),'PROGRAMMER NAME ',MSGLEVEL=(1,1),
//  CLASS=A,MSGCLASS=A
//*
//*  PULL OFF RMF RECORD 72 INFORMATION.  THIS INCLUDES TSO USERS
//*  CPU TIME BATCH USERS ETC. STORE INFO ON SAS DATA BASE.
//*
//STEP1  EXEC SAS
//SAS.FT11F001 DD SYSOUT=*,DCB=(BLKSIZE=141,LRECL=137,RECFM=VBA)
//SAS.FT12F001 DD SYSOUT=*,DCB=(BLKSIZE=141,LRECL=137,RECFM=VBA)
//SASDB DD DSN=XY.TC.A.SASDB.CPU,
//   DISP=OLD
//SYSIN DD *
PROC PRINT DATA = SASDB.S370WK01;
 VAR S70DAT S70INT S70IST CPU_UT S70TMM S70SID;
/*
//
