)ATTR
  _ TYPE(input) INTENS(HIGH) COLOR(RED)
  ! TYPE(TEXT) INTENS(low) COLOR(GREEN)
  + TYPE(TEXT) INTENS(low) COLOR(blue)
  $ TYPE(TEXT) INTENS(high) COLOR(white)
)body
+                    ---> $COMJCL: EDIT MACRO HELP  +<---
+
$Syntax: !Enter$COMJCL!on the EDIT command line and a line destination
           (either$A!for after or$B!for before).
!
$Use:    !COMJCL adds a comment block at the designated place to your CNTL type
           data set. The comment includes your user id, the date and the time.
!
$

!
!
!
!
!
!
+Press$ENTER+to return to Tutorial menu, or$PF3+to return from whence you came.
)INIT
)PROC
  &ZUP = EMHIS000
)END
