)ATTR DEFAULT(%\¦)
)BODY Expand(//)
%Tutorial /-/  CORNER  /-/ Tutorial
%SELECTION ===>¦ZCMD                                                           +
%                     --------------------------------
                      |     Edit Macro  "CORNER"     |
                      --------------------------------
\
 This macro changes certain visible characters to IBM 3800 style format
 characters to print continous box shapes. The conversion is:

         { upper left corner    (left bracket)
         } upper right corner   (right bracket)
         ¢ lower left corner    (cent sign)
         ! lower right corner   (exclamation point)
         < left "t"             (less-than sign)
         > right "t"            (greater-than sign)
         ~ ascending "t"        (wavy line - upper case left of 1)
         ` descending "t"       (accent - lower case wavy line)
         | vertical bar         (vertical bar)
         _ horizontal bar       (underscore)
         + cross                (plus sign)

%SYNTAX:\   CORNER

            There are no operands for this command
)PROC
     &ZUP = #EMCH
)END
