)ATTR DEFAULT(%+_)
/*********************************************************************/
/*    This is a tutorial screen for documenting the edit macro       */
/*    SHOWDCB.                                                       */
/*********************************************************************/
/*    Bob Zimmerman                                                  */
/*    CNA Insurance                                                  */
/*    Last Modified 8506                                             */
/*********************************************************************/
)BODY Expand(//)
%Tutorial /-/  SHOWDCB  /-/ Tutorial
%SELECTION ===>_ZCMD                                                           +
%                    ----------------------------------
                     |     Edit Macro  "SHOWDCB"      |
                     ----------------------------------
+
    This Edit Macro will write a comment line on the 3rd line of the
    edit display screen with the current DCB information of the
    dataset you are in edit on.

+   The syntax is as follows:

%   SHOWDCB
+
)PROC
     &ZUP = #EMCH
)END
