*          DATA SET HEX        AT LEVEL 001 AS OF 08/29/77
      TITLE ' BASE 16 ARITHMETIC '                                      00001
*                                                                       00002
*       THE IMPETUS FOR WRITING THIS PROGRAM COMES FROM THOSE           00003
*    FRUSTRATING HOURS SPENT FUMBLING WITH A DUMP ONLY TO DISCOVER      00004
*    THAT MY INABILITY TO FIND A SOLUTION STEMS FROM AN ARITHMETIC      00005
*    ERROR IN THE INITIAL STEPS.                                        00006
*                                                                       00007
*       SYNTAX FOLLOWS THIS FORM:                                       00008
*       (OPERATOR)  (OPERAND A), (OPERAND B)                            00009
*                                                                       00010
*       BOTH THE OPERATOR (IMPERATIVE), AND THE OPERANDS ARE            00011
*   OPTIONAL, WITH THE EXCEPTION THAT OPERAND B CANNOT BE SPECIFIED     00012
*   WITHOUT OPERAND A.                                                  00013
*                                                                       00014
*       BLANKS OR COMMAS SEPARATE FIELDS. THE ONLY SPECIAL CHARACTER    00015
*   ALLOWED IS THE MINUS(-) IN THE CONVERT TO HEX SUBCOMMAND.           00016
*              HEX  -1                                                  00017
*   THE INPUT IS SCANNED FROM LEFT TO RIGHT. IF THE FIRST FIELD         00018
*   ENCOUNTERED IS A RECOGNISABLE OPERATOR, IT IS TAKEN AS SUCH.        00019
*   OTHERWISE, IT IS ASSUMED TO BE OPERAND A. OPERAND B, IF             00020
*   PRESENT, MUST FOLLOW OPERAND A. EVERYTHING PAST OPERAND B IS        00021
*   IGNORED.                                                            00022
*                                                                       00023
*       HEX WILL "REMEMBER" ITS PREVIOUS OPERATION. THUS, IF ANY        00024
*   PARAMETER IS LEFT OUT  OF  AN INPUT, IT WILL BE FILLED IN           00025
*   BY THE PARAMETER FROM THE PREVIOUS OPERATION. THE SAME OPERATION    00026
*   AND THE SAME OPERAND A WILL BE USED. OPERAND B IS THE RESULT        00027
*   JUST DISPLAYED ON YOUR SCREEN. OBVIOUSLY, THE PURPOSE OF THIS       00028
*   IS TO ALLOW "CHAINING" IN THE SENSE IT CAN BE DONE ON A             00029
*   POCKET CALCULATOR WITH THE K= KEY.                                  00030
*                                                                       00031
*       THE ORDER OF OPERATIONS IS AS FOLLOWS:                          00032
*                                                                       00033
*    (ADD,A)          (OPERAND A)  TO    (OPERAND B)                    00034
*    (SUBTR.,SUB,S)   (OPERAND A)  FROM  (OPERAND B)                    00035
*    (MULTIPLY,MUL,M) (OPERAND A)  TIMES (OPERAND B)                    00036
*    (DIVIDE,DIV,D)   (OPERAND A)  INTO  (OPERAND B)                    00037
*    (HEX,X)          (OPERAND A)  OR -(OPERAND A)  CONVERT TO HEX      00038
*    (DEC,P)           OPERAND A                    CONVERT TO DECIMAL  00039
*    (BR)                                           BRANCH TO BRKPT     00040
*    (END,E)                                        END                 00041
*                                                                       00042
*       ADDITION AND SUBTRACTION ARE STRAIGHTFOREWARD. REMEMBER THAT    00043
*   NEGATIVE NUMBERS APPEAR IN TWO'S COMPLIMENT NOTATION.               00044
*   MULTIPLICATION OUTPUTS A TWO FULLWORD MULTIPLICAND TO THE           00045
*   TERMINAL, BUT ONLY THE SECOND FULLWORD IS "REMEMBERED" AS THE       00046
*   PREVIOUS RESULT. IN DIVISION, THE REMAINDER IS "FORGOTTEN."         00047
*                                                                       00048
*       CONVERT TO HEX WILL ACCEPT A MINUS SIGN IN FRONT OF OPERAND A.  00049
*   OPERAND A IS REQUIRED FOR THIS COMMAND. CONVERT TO DECIMAL IS       00050
*   STRAIGHTFOREWARD EXCEPT FOR THE ABBREVIATION, WHICH IS, "P."        00051
*                                                                       00052
*       BREAK (BR) IS USED WITH THE TSO TEST COMMAND. PICK UP HEX       00053
*   WITH TEST, AND SET A BREAKPOINT AT "BRKPT". THEN ENTER "GO"         00054
*   TO USE THE HEX PROGAM, AND "BR" TO USE TEST. THIS FACILITATES       00055
*   BROWSING THROUGH THE SYSTEMS' CONTROL BLOCKS.                       00056
*                                                                       00057
*       EXAMPLES.    (PROGRAM RESPONSES ARE INDENTED FROM COMMANDS).    00058
*                                                                       00059
*   HEX                            INVOKE PROGRAM                       00060
*     HEX                             PROGAM IS ACTIVE                  00061
*   A 1 1                          ADD 1 TO 1                           00062
*     00000002                        RESPONSE                          00063
*   8                              CHAIN ADD X'8'                       00064
*     0000000A                        RESPONSE                          00065
*   (HITS ENTER)                   NO OPERANDS AT ALL                   00066
*     00000012                        REPEAT OF LAST OPERATION          00067
*                                                                       00068
*   S     4                        SUBTRACT 4                           00069
*     0000000E                        RESULT IS STILL CHAINED           00070
*   M  12345678 FEDCBA98           BY PROVIDING AN OPERAND B, WE        00071
*     FFEB4992 35068740               REPLACE THE PREVIOUS RESULT OF    00072
*                                     0000000E.                         00073
*   ADD 1                                                               00074
*     35068741                     THE DOUBLEWORD RESULT OF THE         00075
*                                     MULTIPLICATION HAS BEEN TRUNCATED 00076
*   DIV 400                        DIVIDING BY X'400' GIVES A RESULT    00077
*     000D41A1  REMAINDER 00000341    THAT IS THE HEX EQUIVALENT OF K.  00078
*                                                                       00079
*   DEC                            CONVERT 000D41A1 TO DECIMAL          00080
*              868,769                                                  00081
*                                                                       00082
*   END                                                                 00083
*    READY                                                              00084
*                                                                       00085
*   TEST 'LIBRARY.NAME(HEX)'       PICK UP HEX UNDER TEST               00086
*     TEST                            RESPONSE FROM TEST                00087
*   AT BRKPT                       SET BREAKPOINT                       00088
*     TEST                            RESPONSE FROM TEST                00089
*   GO                             ENTER HEX PROGAM                     00090
*     HEX                             RESPONSE FROM HEX                 00091
*   A 1 1                          USE HEX                              00092
*     00000002                                                          00093
*   BR                             GO TO BREAKPOINT, TO INVOKE TEST     00094
*     AT BRKPT                                                          00095
*     TEST                            RESPONSES FROM TEST               00096
*   L 10. X                        USE TEST                             00097
*     000010. 0000B680                RESPONSE FROM TEST                00098
*   GO                             GET BACK INTO HEX                    00099
*                                                                       00100
         EJECT                                                          00101
HEX      PRIME ID=DICK_SZIEDE_CSC_1972                                  00102
*                                                                       00103
         REGS                                                           00104
         EJECT                                                          00105
         GETMAIN R,LV=1024,SP=0                                         00106
         LR    R11,R1                                                   00107
         USING WORKAREA,R11                SET UP WORK DSECT            00108
*                                                                       00109
         XC    WORKAREA(256),WORKAREA        SET TO ZEROA               00110
         MVC   OPCODE,=C'A  '                                           00111
         BAL   R2,PUTOUT               CLEAR OUTAREA                    00112
         MVC   OUTAREA(3),=C'HEX'                                       00113
         BAL   R2,PUTTER               INITIAL RESPONSE                 00114
         EJECT                                                          00115
READCARD LA    R1,INAREA                                                00116
         O     R1,=X'80000000'                SET TGET BITS             00117
         LA    R0,80                           BUFFER LENGTH            00118
         TGET  (R1),(R0),R                                              00119
*                                                                       00120
         OC    INAREA,OUTAREA              CONVERT TO UPPER CASE        00121
         BAL   R14,SCANIT                  FORMAT INPUT                 00122
         BAL   R14,CHOOSIT                    DECIDE ON ROUTINE         00123
         BALR  R14,R15                     DO IT                        00124
         BAL   R2,PUTTER                   RETURN OUTPUT                00125
*                                                                       00126
         CLI   OPCODE,C'E'             DID WE GIVE UP?                  00127
         BNE   READCARD                                                 00128
         B     QUIT                                                     00129
*                                                                       00130
PUTTER   LA    R10,3                                                    00131
PUTPUT   LA    R8,OUTAREA                                               00132
         LR    R1,R8                                                    00133
         LA    R0,80                           BUFFER LENGTH            00134
         TPUT  (R1),(R0),R                                              00135
*                                                                       00136
         LTR   R15,R15                                                  00137
         BZ    PUTOUT                                                   00138
         ST    R15,RESULT                                               00139
         BAL   R15,RESTOHEX                                             00140
         BCT   R10,PUTPUT                                               00141
PUTOUT   MVI   INAREA,C' '                                              00142
         MVC   INAREA+1(159),INAREA                                     00143
         BR    R2                                                       00144
*                                                                       00145
QUIT     FREEMAIN R,LV=1024,A=(R11)                                     00146
         TERME RC=0                                                     00147
         EJECT                                                          00148
*                                                                       00149
SCANIT   EQU   *                                                        00150
         XC    TABLE1(256),TABLE1                                       00151
         MVI   TABLE1+193,X'01'                                         00152
         MVC   TABLE1+194(56),TABLE1+193                                00153
*                                                                       00154
         XC    TABLE2(256),TABLE2                                       00155
         MVI   TABLE2+64,C' '                                           00156
         MVI   TABLE2+107,X'6B'                                         00157
*                                                                       00158
         SR    R3,R3                                                    00159
         LA    R6,INAREA                                                00160
         LR    R1,R6                                                    00161
         LA    R9,3                    LIMIT LOOP                       00162
*                                                                       00163
SC1      LA    R7,INAREA+72                                             00164
         SR    R7,R6                   GET LENGTH FOR TRANSLATE         00165
SC1TR    EX    R7,SC1TRNB              FIND NON-BLANK                   00166
         BZ    SC1END                  NOT FOUND                        00167
         ST    R1,ARG1+4(R3)        STORE POINTER                       00168
         LR    R6,R1                   SAVE POINTER TO FRONT OF FIELD   00169
         LA    R7,INAREA+72                                             00170
         SR    R7,R6                   GET LENGTH FOR SECOND TRANSLATE  00171
         EX    R7,SC1TRBL              FIND NEXT BL OR COMMA            00172
         BZ    SC1END                                                   00173
         LR    R7,R1                                                    00174
         SR    R7,R6                                                    00175
         ST    R7,ARG1(R3)          STORE LENGTH                        00176
         LR    R6,R1                                                    00177
         LA    R3,8(R3)                INCREMENT INDEX                  00178
         BCT   R9,SC1                                                   00179
*                                                                       00180
SC1END   ST    R3,ARGCT                                                 00181
         B     SC2                                                      00182
*                                                                       00183
SC1TRNB  TRT   0(0,R1),TABLE1                                           00184
SC1TRBL  TRT   0(0,R1),TABLE2                                           00185
SC2      LTR   R3,R3                   IS ARGCT = 0 ?                   00186
         BNZ   SC2A                                                     00187
         ST    R3,FIELDCT              SAVE COUNT OF OPERANDS           00188
         B     SCANEND                                                  00189
SC2A     L     R2,ARG1                 LENGTH OF 1ST OPERAND            00190
         BCTR  R2,0                    DECREMENT LGTH FOR MOVE          00191
         LA    R7,OPTABLEN             LIMIT FOR SEARCH                 00192
         LA    R4,OPTABLE                                               00193
         L     R5,ARG1+4               ADDR OF NOMINAL OPCODE           00194
         LA    R6,4                    INCREMENT                        00195
*                                                                       00196
SC2B     EX    R2,SC2COMP                                               00197
         BE    SC2FOUND                                                 00198
         BXLE  R4,R6,SC2B                                               00199
         MVC   ARG3(8),ARG2               IF THERE IS NO OPCODE ENTERED 00200
         MVC   ARG2(8),ARG1                     AS THE FIRST OPERAND,   00201
*                                                 MAKE                  00202
*                                          IT LOOK AS THOUGH THERE IS   00203
*                                                                       00204
         B     SCANEND                                                  00205
SC2FOUND MVC   OPCODE(1),0(R4)         INPLANT NEW OPCODE               00206
         SH    R3,=H'8'                REMOVE 1 FROM OPERAND COUNT      00207
         B     SCANEND                 WITH ARGUMENT COUNT DECREMENTED  00208
*                                                                       00209
SC2COMP  CLC   0(0,R5),1(R4)                                            00210
*                                                                       00211
SC4      EQU   *                                                        00212
SCANEND  ST     R3,FIELDCT              SAVE OPERAND COUNT              00213
         BR     R14                                                     00214
*                                                                       00215
*                                                                       00216
         EJECT                                                          00217
CHOOSIT  LA    R2,RTNTABLE                                              00218
         LA    R7,RTNEND                                                00219
         LA    R6,4                                                     00220
*                                                                       00221
CH1      CLC   0(1,R2),OPCODE                                           00222
         EJECT                                                          00223
         BE    CH2                                                      00224
         BXLE  R2,R6,CH1                                                00225
         LA    R15,ENDIT               DEFAULT OPCODE IS END            00226
         BR    R14                                                      00227
CH2      L     R15,0(R2)               CHOSEN ROUTINE                   00228
         BR    R14                                                      00229
*                                                                       00230
RESTOHEX EQU   *                                                        00231
         LA    R4,2                                                     00232
         LA    R5,OUTAREA+6                                             00233
         LA    R3,OUTAREA                                               00234
*                                                                       00235
         MVO   CONVERT,RESULT          MOVE FOR LEFT HALF-BYTE          00236
         BAL   R9,RESTCONV                                              00237
         LA    R3,OUTAREA+1            SET POINTER TO RESULT            00238
         LA    R5,OUTAREA+7                                             00239
         MVC   CONVERT,RESULT          MOVE FOR RIGHT HALF-BYTE         00240
         BAL   R9,RESTCONV                                              00241
         BR    R15                     RETURN TO CALLER                 00242
*                                                                       00243
RESTCONV NC    CONVERT,ZEROLEFT                                         00244
         TR    CONVERT(4),ONETOF                                        00245
         LA    R6,CONVERT                                               00246
RESTMOVE MVC   0(1,R3),0(R6)           INTERLEAVE RESULTS               00247
         LA    R6,1(R6)                                                 00248
         BXLE  R3,R4,RESTMOVE                                           00249
         BR    R9                                                       00250
*                                                                       00251
*******************CONVERT DISPLAY HEX TO INTERNAL BINARY******         00252
*                                                                       00253
XTOBIN   MVI   TABLE2,X'01'            FIRST, WE                        00254
         MVC   TABLE2+1(256),TABLE2        CHECK FOR VALIDITY           00255
         MVI   TABLE2+193,X'00'                                         00256
         MVC   TABLE2+194(5),TABLE2+193                                 00257
         MVI   TABLE2+240,X'00'                                         00258
         MVC   TABLE2+241(9),TABLE2+240                                 00259
         LM    R3,R4,0(R3)          GET VICTUMS                         00260
         BCTR  R3,0                DECREMENT LGTH FOR EX                00261
         EX    R3,XTOTRT            CHECK FOR INVALID CHAR              00262
         BZ    XTOTRAN                                                  00263
         MVC   OUTAREA(L'VALCK),VALCK                                   00264
         MVC   OUTAREA+18(1),0(R1)                                      00265
         LA    R15,4                   INVALID CHARACTER RC             00266
*         BAL   R8,SNAPPER              *****TEMPORARY*****             00267
         BR    R9                                                       00268
*                                                                       00269
XTOTRAN  EQU  *                                                         00270
         MVC   TABLE2+193(L'XABCDEF),XABCDEF     SET UP TABLE FOR       00271
         MVC   TABLE2+240(L'X012345),X012345     TABLE                  00272
         EX    R3,XTOTR                GET VALUES INTO RIGHT 4 BITS     00273
         EX    R3,XTOPK                SQUEEZE OUT LEFT 4 BITS          00274
         SR    R4,R4                                                    00275
         L     R5,XTOPACK+1            GET IT INTO                      00276
         IC    R4,XTOPACK                  REGISTERS                    00277
         SRDL  R4,4                    SHIFT OUT UNWABTED HALF-BYTE     00278
         LR    R4,R5                                                    00279
         SR    R15,R15                 GOOD RC                          00280
         BR    R9                                                       00281
*                                                                       00282
*                                                                       00283
XTOTRT   TRT   0(0,R4),TABLE2         VALIDATE INPUT                    00284
XTOTR    TR    0(0,R4),TABLE2         MAKE EACH DISPLAY BYTE INTO       00285
*                                        THE HEX IT REPRESENTS          00286
XTOPK    PACK  XTOPACK,0(0,R4)        GET RID OF LEFT HALF-BYTES        00287
*                                                                       00288
         EJECT                                                          00289
OPERATIO EQU   *                                                        00290
         CLI   FIELDCT+3,X'00'                                          00291
         BE    OPEUP                                                    00292
         LA    R3,ARG2                                                  00293
         BAL   R9,XTOBIN               CONVERT 1ST ARGUMENT TO BINARY   00294
         LTR   R15,R15                                                  00295
         BZ    OPERES                  IF BAD RETURN CODE FROM CONVERT  00296
         BR    R14                         PUT OUT ERROR MESSAGE        00297
OPERES   ST    R4,ARGUMENT            REPLACE RESULT                    00298
*                                                                       00299
OPE1     EQU    *                                                       00300
         CLI   FIELDCT+3,X'10'         IS THERE A FIELD TO REPLACE      00301
         BNE   OPEUP                       RESULT                       00302
         LA    R3,ARG3                YUP                               00303
         BAL   R9,XTOBIN                                                00304
         LTR   R15,R15                                                  00305
         BZ    OPE3                                                     00306
         BR    R14                                                      00307
OPE3    ST     R4,RESULT                                                00308
*                                                                       00309
OPEUP    SR   R4,R4                    ZERO HO REG                      00310
         LM    R5,R6,RESULT            GET OPERANDS- RESULT NEXT TO     00311
*                                          ZERO REG                     00312
         BR    R8                      RETURN TO OPERATION              00313
*                                                                       00314
*                                                                       00315
ADD      BAL   R8,OPERATIO                                              00316
         AR    R5,R6                                                    00317
         B     ADDSUB                                                   00318
*                                                                       00319
SUBTRACT BAL   R8,OPERATIO                                              00320
         SR    R5,R6                                                    00321
*                                                                       00322
ADDSUB   ST    R5,RESULT                                                00323
         BAL   R15,RESTOHEX                                             00324
         BR    R14                                                      00325
*                                                                       00326
         EJECT                                                          00327
*                                                                       00328
MULTIPLY BAL   R8,OPERATIO                                              00329
         MR    R4,R6                                                    00330
         ST    R4,RESULT                                                00331
         LR    R10,R5                                                   00332
         BAL   R15,RESTOHEX                                             00333
         MVC   OUTAREA+9(8),OUTAREA                                     00334
         ST    R10,RESULT                                               00335
         BAL   R15,RESTOHEX                                             00336
MULXC    XC    OUTAREA(8),OUTAREA+9                                     00337
         XC    OUTAREA+9(8),OUTAREA                                     00338
         EX    0,MULXC                                                  00339
*         BAL   R8,SNAPPER                                              00340
         BR    R14                                                      00341
*                                                                       00342
*                                                                       00343
DIVIDE   BAL   R8,OPERATIO                                              00344
         LTR   R6,R6            TEST FOR DIVIDE BY ZERO                 00345
         BZ    DIVBY0                                                   00346
         LR    R4,R5                                                    00347
         SRDA  R4,32               SET UP FOR FULLWORD DIVIDE           00348
         DR    R4,R6                                                    00349
         LR    R10,R5                  SAVE R5                          00350
         ST    R4,RESULT                                                00351
         BAL   R15,RESTOHEX                                             00352
         MVC   OUTAREA+20(8),OUTAREA                                    00353
         MVC   OUTAREA+10(9),=C'REMAINDER'                              00354
         ST    R10,RESULT                                               00355
         BAL   R15,RESTOHEX                                             00356
*         BAL   R8,SNAPPER                                              00357
         BR    R14                                                      00358
*                                                                       00359
DIVBY0  MVC   OUTAREA(L'DIVMSG),DIVMSG      SAY "NAUGHTY NAUGHTY"       00360
        BR    R14                                                       00361
         EJECT                                                          00362
*                                                                       00363
HEXIDECI EQU   *                                                        00364
         LM    R3,R7,ARGCT             INPUT ARGUMENTS                  00365
         LTR   R3,R3                   MUST HAVE SOMETHING              00366
         BZ    HEXERR                                                   00367
         CH    R3,=H'8'                ONE FIELD ?                      00368
         BH    HEXMOVE                     NO - TAKE SECOND FIELD       00369
         CLI   0(R5),C'Z'              IS IT A NUMBER OR LETTER ?       00370
         BH    HEX0                        IF A NUMBER, USE IT          00371
         B     HEXERR                      ELSE ASK FOR NUMBER          00372
HEXMOVE  LR    R4,R6                                                    00373
         LR    R5,R7                                                    00374
         B     HEX0                                                     00375
*                                                                       00376
HEXERR   EQU   *                                                        00377
         MVC   OUTAREA(29),=C'ENTER DECIMAL NUMBER, PLEASE   '          00378
         BR    R14                                                      00379
*                                                                       00380
HEX0     EQU   *                                                        00381
*                                      VALIDATE INPUT                   00382
         LR    R7,R5                   SAVE POINTER FROM TRT            00383
         BCTR  R4,0                    DECREMENT LENGTH FOR EXECUTE     00384
         CH    R4,=H'16'               CHECK FOR INVALID LENGTH         00385
         BL    HEX0TAB                                                  00386
         LA    R4,15                   ERROR MEANS DEFAULT TO 16        00387
HEX0TAB  EQU   *                                                        00388
         MVI   TABLE2,X'01'            SET UP                           00389
         MVC   TABLE2+1(256),TABLE2        TABLE FOR TRT                00390
         MVI   TABLE2+240,X'00'                                         00391
         MVC   TABLE2+241(9),TABLE2+240                                 00392
         EX    R4,HEXTRT               CHECK FOR NON-NUMERIC            00393
         BZ    HEX1                    OK                               00394
         MVC   OUTAREA(L'VALCK),VALCK                                   00395
         MVC   OUTAREA+18(1),0(R1)     REPORT  BAD CHARACTER            00396
         BR    R14                                                      00397
*                                      CONVERT TO BINARY                00398
HEX1     EQU   *                 CONVERT TO BINARY                      00399
         EX    R4,HEXPACK              PACKIT                           00400
         CP    OPER1,HEXTOP                                             00401
         BH    HEXLIMIT                                                 00402
         CP    OPER1,HEXBOT                                             00403
         BL    HEXLIMIT                PREVENT OC9                      00404
         CVB   R3,OPER1                CONVERT TO BINARY                00405
*                                                                       00406
         BCTR  R5,0                   POINT TO CHAR AHEAD OF ARGUMENT   00407
         CLI   0(R5),C'-'             IS IT A MINUS?                    00408
         BNE   HEXST                       NOPE - CONTINUE              00409
         LNR   R3,R3                       YEP  - COMPLIMENTS TO THE    00410
*                                                 OPERAND               00411
HEXST    ST    R3,RESULT                                                00412
         BAL   R15,RESTOHEX                                             00413
*         BAL   R8,SNAPPER              *****TEMPORARY****              00414
         BR    R14                                                      00415
*                                                                       00416
HEXLIMIT MVC   OUTAREA(L'HEXLIM),HEXLIM ENTER ERROR MSG                 00417
         BR    R14                                                      00418
*                                                                       00419
*                                                                       00420
HEXTRT   TRT   0(0,R7),TABLE2                                           00421
HEXPACK  PACK  OPER1(8),0(0,R5)                                         00422
*                                                                       00423
*                                                                       00424
         EJECT                                                          00425
DECIMAL  EQU   *                       CONVERT HEX TO DECIMAL           00426
         BAL   R8,OPERATIO             SCAN INPUT                       00427
         CLI   FIELDCT+3,X'00'         CHECK FOR INPUT                  00428
         BE    DEC1                    NO INPUT, WE CONVER              00429
         MVC   RESULT,ARGUMENT                                          00430
*                                                                       00431
DEC1     L     R3,RESULT                                                00432
         CVD   R3,OPER1                                                 00433
         MVC   OUTAREA(L'DECMASK),DECMASK                               00434
         ED    OUTAREA(L'DECMASK),OPER1                                 00435
         BR    R14                                                      00436
*                                                                       00437
ENDIT    B     QUIT                                                     00438
*                                                                       00439
*                                                                       00440
BRKPT    MVC   OUTAREA(13),=C'PRAY CONTINUE'    THIS IS WHERE           00441
         BR    R14               THE TEST BREAKPOINT IS SET BY XTEST    00442
         EJECT                                                          00443
*                                                                       00444
*              CONSTANTS                                                00445
ENDED    DC    C'ENDED'                                                 00446
OPTABLE  DC    C'AADD'                                                  00447
         DC    C'AA  '                                                  00448
         DC    C'SSUB'                                                  00449
         DC    C'SS  '                                                  00450
         DC    C'MMUL'                                                  00451
         DC    C'MM  '                                                  00452
         DC    C'DDIV'                                                  00453
         DC    C'DD  '                                                  00454
         DC    C'HHEX'                                                  00455
         DC    C'HH  '                                                  00456
         DC    C'HX  '                                                  00457
         DC    C'EE  '                                                  00458
         DC    C'EEND'                                                  00459
         DC    C'PDEC'                                                  00460
         DC    C'PP  '                                                  00461
         DC    C'BB  '                                                  00462
         DC    C'BBR '                                                  00463
         DC    C'BBRK'                                                  00464
OPTABLEN EQU   *-4                                                      00465
*                                                                       00466
RTNTABLE DS    0F                                                       00467
         DC    C'A'                                                     00468
         DC    AL3(ADD)                                                 00469
         DC    C'S'                                                     00470
         DC    AL3(SUBTRACT)                                            00471
         DC    C'M'                                                     00472
         DC    AL3(MULTIPLY)                                            00473
         DC    C'D'                                                     00474
         DC    AL3(DIVIDE)                                              00475
         DC    C'H'                                                     00476
         DC    AL3(HEXIDECI)                                            00477
         DC    C'P'                                                     00478
         DC    AL3(DECIMAL)                                             00479
         DC    C'E'                                                     00480
         DC    AL3(ENDIT)                                               00481
         DC    C'B'                                                     00482
         DC    AL3(BRKPT)                                               00483
RTNEND   EQU   *-4                                                      00484
*                                                                       00485
ONETOF   DC    C'0123456789ABCDEF'                                      00486
ZEROLEFT DC    5X'0F'                                                   00487
XABCDEF  DC    X'0A0B0C0D0E0F'                                          00488
X012345  DC    X'00010203040506070809'                                  00489
VALCK    DC    C'INVALID CHARACTER '                                    00490
DECMASK  DC    X'402020206B2020206B2020206B2020206B20202060'            00491
HEXTOP   DC    P'2147483647'                                            00492
HEXBOT   DC    P'-2147483648'                                           00493
HEXLIM   DC    C'FULLWORD LIMITS 2,147,483,647, -2,147,483,648'         00494
DIVMSG   DC    C'YOU CAN''T DIVIDE BY ZERO, SILLY.'                     00495
         LTORG                                                          00496
         EJECT                                                          00497
WORKAREA DSECT                                                          00498
         DS    0D                                                       00499
INAREA      DS CL80                                                     00500
OUTAREA  DS    CL80                                                     00501
SAVEBL   DS    F                                                        00502
SAVER14  DS    F                                                        00503
SAVER15  DS    F                                                        00504
FIELDCT  DS    F                                                        00505
OPER1    DS    CL8                                                      00506
OPER2    DS    CL8                                                      00507
OPER3    DS    CL8                                                      00508
OPCODE   DS    CL3                                                      00509
RESULT   DS    F                                                        00510
ARGUMENT DS    F                                                        00511
DADA     DS    D                                                        00512
ARGCT    DS    F                                                        00513
ARG1     DS    2F                                                       00514
ARG2     DS    2F                                                       00515
ARG3     DS    2F                                                       00516
TABLE1   DS    256C                                                     00517
TABLE2   DS    256C                                                     00518
         ORG   TABLE1                                                   00519
CONVERT  DS    CL5                                                      00520
         DS    0F                                                       00521
         DS    3C                                                       00522
XTOPACK  DS    CL5                                                      00523
         END                                                            00524
