)PANEL
)ATTR
  @ TYPE(OUTPUT)  INTENS(HIGH) COLOR(RED)  CAPS(OFF)
  + TYPE(TEXT)    INTENS(LOW)
  # TYPE(TEXT)    INTENS(HIGH)
  $ TYPE(OUTPUT)  INTENS(HIGH) SKIP(ON)    JUST(ASIS)
  ^ TYPE(INPUT)   INTENS(HIGH) CAPS(OFF)   JUST(ASIS)
)BODY WIDTH(&ZSCREENW)
%COMMAND=>_ZCMD
+
+                       #VTOC zap
@PMSG1
@PMSG2
@PMSG3
@PMSG4
@PMSG5
+
+
%                  Enter VOLSER: _PVOLSER
)INIT
 .CURSOR=PVOLSER
)REINIT
  REFRESH(ZCMD,PMSG1,PMSG2,PMSG3,PMSG4,PMSG5)
)END
