)ATTR
  @ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
  ~ TYPE(OUTPUT) INTENS(HIGH) COLOR(RED)
)BODY EXPAND (\\)
@*******************************************************************************
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+               Transaction~OTRN+no longer available.                       @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*+                                                                           @*
@*******************************************************************************
)PROC
 &ZCONT = HNOHELP
 &ZUP   = HNOHELP
)END
