*
* THE L.B.D. U BYUTE UNPATTENTED SYS.
*
DMP150    WCCDC W,,COLOR
          SBADC 04,01,PHN,Y,O
          DC   CL32'Miscellaneous commands (cont''d):'
          RADC  04,33,PHN,Y,O,05,01,' ','CONT.D FROM PREV "SBA" DETS'
          RADC  05,01,PLN,B,O,06,01,' '
          SBADC 06,01,PHN,Y,O
          DC   CL11'  TRACE OFF'
          RADC  06,12,PHN,Y,O,07,01,' ','CONT.D FROM PREV "SBA" DETS'
          RADC  07,01,PLN,B,O,07,11,' '
          SBADC 07,10,PLN,B,O,'CONT.D FROM PREV "SBA" DETS'
          DC   CL47': Turns trace off. All subsequent encounters of'
          SBADC 07,58,PHN,Y,O
          DC   CL05'PDUMP'
          SBADC 07,64,PLN,B,O
          DC   CL16'will be ignored '
          RADC  08,01,PLN,B,O,08,13,' '
          SBADC 08,12,PLN,B,O,'CONT.D FROM PREV "SBA" DETS'
          DC   CL61'until the address specified by the trace supervisorX
                parameter'
          RADC  08,73,PLN,B,O,09,01,' ','CONT.D FROM PREV "SBA" DETS'
          RADC  09,01,PHN,Y,O,09,13,' '
          SBADC 09,12,PHN,Y,O,'CONT.D FROM PREV "SBA" DETS'
          DC   CL14'TRACES=address'
          SBADC 09,27,PLN,B,O
          DC   CL09'is set to'
          SBADC 09,37,PHN,Y,O
          DC   CL01'Y'
          SBADC 09,39,PLN,B,O
          DC   CL11' or another'
          SBADC 09,51,PHN,Y,O
          DC   CL05'PDUMP'
          SBADC 09,57,PLN,B,O
          DC   CL23'statement is processed '
          RADC  10,01,PLN,B,O,10,13,' '
          SBADC 10,12,PLN,B,O,'CONT.D FROM PREV "SBA" DETS'
          DC   CL68'without a trace supervisor parameter or one with a X
               diferent address.'
          RADC  11,01,PLN,B,O,12,01,' '
          SBADC 12,01,PHN,Y,O
          DC   CL08'  ABOVE '
          SBADC 12,10,PLN,B,O
          DC   CL30': Change to 31 bit addressing.'
          RADC  12,40,PLN,B,O,13,01,' ','CONT.D FROM PREV "SBA" DETS'
          SBADC 13,01,PHN,Y,O
          DC   CL08'  BELOW '
          SBADC 13,10,PLN,B,O
          DC   CL30': Change to 24 bit addressing.'
          RADC  13,40,PLN,B,O,14,01,' ','CONT.D FROM PREV "SBA" DETS'
          RADC  14,01,PLN,B,O,15,01,' '
          RADC  15,01,PLN,B,O,16,01,' '
          RADC  16,01,PLN,B,O,17,01,' '
          RADC  17,01,PLN,B,O,18,01,' '
          RADC  18,01,PLN,B,O,19,01,' '
          RADC  19,01,PLN,B,O,20,01,' '
          RADC  20,01,PLN,B,O,21,01,' '
          RADC  21,01,PLN,B,O,22,01,' '
          RADC  22,01,PLN,B,O,23,01,' '
          RADC  23,01,PLN,B,O,24,01,' '
          RADC  24,01,PLN,B,O,01,01,' '
DMPSZ150 EQU   *-DMP150
