//T66KKKA  JOB DC1Z6170,'AL-PROGDUMP',MSGCLASS=X,CLASS=A,
//       NOTIFY=T66KKK,REGION=4096K
/*JOBPARM ROOM=ZTS,LINES=999
//*
//*
//*    JOB TO ASSEMBLE AND LINK ASSEMBLER SOURCE
//*
//*
//LKED1    EXEC PGM=IEWL,COND=(5,LT),
//         PARM='MAP,LET,LIST,AMODE=31'
//SYSUT1   DD UNIT=3380,SPACE=(1024,(100,10))
//SYSLMOD  DD DISP=SHR,DSN=T66KKK.LOADLIB
//*YSLMOD  DD DISP=SHR,DSN=TFWK.ARFN.CICS.LOADLIB.V33
//SYSPRINT DD SYSOUT=*
//SYSLIB   DD DISP=SHR,DSN=T66KKK.OBJ
//CICSMODS  DD DISP=SHR,DSN=TF99.CHGMAN.FWK.#002363.CLL
//          DD DISP=SHR,DSN=TF99.CHGMAN.FWK.#002363.LOD
//          DD DISP=SHR,DSN=DFWK.ARFN.CICS.LOADLIB
//          DD DISP=SHR,DSN=DFWK.ARFN.LOADLIB
//          DD DISP=SHR,DSN=PFWK.AFP.OVERLIB
//          DD DISP=SHR,DSN=PFWK.ARFN.LOADLIB
//          DD DISP=SHR,DSN=PFWK.ARFN.CICS.LOADLIB
//          DD DISP=SHR,DSN=CICSESA.V330.SDFHLOAD
//**************************************************************
//SYSLIN   DD *
    INCLUDE SYSLIB(PROGDUMP)
    INCLUDE CICSMODS(DFHEAI,DFHEAI0)
    MODE    RMODE(24),AMODE(31)
    NAME    PROGDUMP(R)
/*
