//TSGAKA   JOB ,'JCLASMA',
//             CLASS=C,COND=(4,LT),
//             MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//*   EX 'TSGAK.$TAPEMAP(JCLASMA)'
//*
//*
//*     ASM LINKEDIT FROM SOURCE ASM
//*
//ASMH EXEC PGM=ASMA90,PARM=(OBJECT,NODECK,NOESD,NORLD,NOXREF)
//SYSLIB   DD DISP=SHR,DSN=SYS1.MACLIB
//         DD DISP=SHR,DSN=SYS1.MODGEN
//         DD DISP=SHR,DSN=TSGAK.$TAPEMAP
//SYSIN    DD DISP=SHR,DSN=TSGAK.$TAPEMAP(TAPEMAP)
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,2)
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD UNIT=VIO,SPACE=(TRK,1),DISP=(,PASS),DCB=BLKSIZE=3200,
//            DSN=&&TEMP
//*
//LKED   EXEC  PGM=HEWLKED,
//       PARM='NCAL,MAP,LIST,LET'
//SYSUT1   DD  UNIT=SYSDA,SPACE=(2048,(200,20))
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DSN=TSGAK.LOADLIB
//SYSLMOD  DD  DISP=SHR,DSN=TSGAK.LOADLIB
//OBJECT   DD  DISP=(OLD,DELETE),DSN=&&TEMP
//SYSLIN   DD  *
 INCLUDE OBJECT
 NAME    TAPEMAP(R)
/*
