         MACRO
         ETOA
*---------------------------------------------------------------------*
*                                                                     *
*---------------------------------------------------------------------*
EBCDIC_TO_ASCII       DS     0C
                      DC     X'000102030405060708090A0B0C0D0E0F' 10-0F
                      DC     X'101112131415161718191A1B1C1D1E1F' 10-1F
                      DC     X'202122232425262728292A2B2C2D202F' 20-2F
                      DC     X'303132333435363738393A3B3C3D303F' 30-3F
                      DC     X'204142434445464748494A2E3C282B4F' 40-4F
                      DC     X'2651525354555657585921242A293B5F' 50-5F
                      DC     X'2D2F62636465666768697C2C255F3E3F' 60-6F
                      DC     X'707172737475767778793A2340273D22' 70-7F
                      DC     X'806162636465666768698A7B8C8D808F' 80-8F
                      DC     X'906A6B6C6D6E6F7071729A7D9C9D909F' 90-9F
                      DC     X'A07E737475767778797AAAABACADAEAF' A0-AF
                      DC     X'B0B1B2B3B4B5B6B7B8B9BABBBCBDB0BF' B0-BF
                      DC     X'C0414243444546474849CACBCCCDC0CF' C0-CF
                      DC     X'D04A4B4C4D4E4F505152DADBDCDDD0DF' D0-DF
                      DC     X'5CE1535455565758595AEAEBECEDE0EF' E0-EF
                      DC     X'30313233343536373839FAFBFCFDF0FF' F0-FF
         MEND
