        /* this rexx exec is expected to be invoked by the EXEC command
           thus:

           EXec 'dsname(RECEIVE)'

           Prompting will occur for hlq and optional volser.

           and it will then issue the TSO RECEIVE command for the
           the following members to create these new data sets:

           Member       Dataset
           ASM          hlq.ASM
           EXEC         hlq.EXEC and
           MSGS         hlq.MSGS
           PANELS       hlq.PANELS
           NOTIFY       hlq.NOTIFY
           LOAD         hlq.LOAD
           TDA          hlq.TDA
           UDSMTPS      hlq.UDSMTPS.TAR.GZ

           You will then need to copy these datasets/members into
           datasets for production use.

           After these data sets are created several of the members
           of this install data set will be browsed.
           */

        parse source x1 x2 x3 x4 dsn .
         x = PROMPT("ON") /* enable prompting */

        say "If you received this package from a location other than"
        say "the authors at http://www.lbdsoftware.com you might want"
        say "to check the authors site now for a more current"
        say "version of this package."
        say " "
        say "To cancel this receive so you can verify that you have"
        say "the most current version enter CANCEL, otherwise any key"
        say "to continue"
        pull cont
        if cont = "CANCEL" then exit

        say "Enter desired hlq for target data sets",
            "(default is" sysvar("syspref")".XMITIP.NEW):"
        pull hlq
        hlq = strip(hlq)

        if hlq = "" then hlq = sysvar("syspref")".XMITIP.NEW"

        say "Enter optional volser for target data sets",
            "default is to allow standard allocation to",
            "find a volume."
        pull volser
        volser = strip(volser)

        say "Enter optional device type for target data sets",
            "default is to use your default unit."
        pull device
        device = strip(device)

        if volser <> "" then vol = "vol("volser")"
                        else vol = ""

        if device <> "" then dev = "unit("device")"
                        else dev = ""

        Say "Using HLQ:" hlq
        if vol <> "" then
           Say "Using Volser:" volser

        queue "dsn('"hlq".exec')" vol dev
        "Receive inds('"dsn"(exec)')"
        queue "dsn('"hlq".msgs')" vol dev
        "Receive inds('"dsn"(msgs)')"
        queue "dsn('"hlq".panels')" vol dev
        "Receive inds('"dsn"(panels)')"
        queue "dsn('"hlq".notify')" vol dev
        "Receive inds('"dsn"(notify)')"
        queue "dsn('"hlq".asm')" vol dev
        "Receive inds('"dsn"(asm)')"
        queue "dsn('"hlq".load')" vol dev
        "Receive inds('"dsn"(load)')"
        queue "dsn('"hlq".tda')" vol dev
        "Receive inds('"dsn"(tda)')"
        queue "dsn('"hlq".udsmtps.tar.gz')" vol dev
        "Receive inds('"dsn"(udsmtps)')"

        if sysvar('sysispf') <> "ACTIVE" then exit
        Address ISPEXEC
           "Browse dataset('"dsn"($doc)')"
           "Browse dataset('"dsn"(license)')"
           "Browse dataset('"dsn"(changes)')"
           "Browse dataset('"dsn"(compile)')"
           "Browse dataset('"dsn"(spoof1)')"
           "Browse dataset('"dsn"(spoof2)')"
           "Browse dataset('"dsn"(ldap)')"
           "Browse dataset('"dsn"(charset)')"
           "Browse dataset('"dsn"(server)')"
           "Browse dataset('"dsn"(sdsf)')"
           "Browse dataset('"dsn"(tools)')"
           "Browse dataset('"dsn"(distinfo)')"
           "Browse dataset('"dsn"(securpdf)')"
           "Browse dataset('"dsn"(smtpexit)')"
           "Browse dataset('"dsn"(tcpdata)')"
           "Browse dataset('"dsn"(udsmtp)')"
