$PLCOMP  CSECT                                                     00000
SYSINIT  STM   R12,R2,2040(R15)        90C2 F7F8        *.B78*     00000
         L     R12,2752(,R15)          58C0 FAC0        *.{.{*     00004
         MVI   2156(R12),X'FF'         92FF C86C        *k.H%*     00008
         MVI   2157(R12),X'FF'         92FF C86D        *k.H_*     0000C
         MVI   2158(R12),X'00'         9200 C86E        *k.H>*     00010
         L     R1,0(,R1)               5810 1000        *....*     00014
         LA    R2,2(,R1)               4120 1002        *....*     00018
         AH    R2,0(,R1)               4A20 1000        *¢...*     0001C
         LA    R1,2(,R1)               4110 1002        *....*     00020
         LR    R3,R1                   1831             *..*       00024
         CR    R3,R2                   1932             *..*       00026
         BE    60(,R12)                4780 C03C        *..{.*     00028
         CLI   0(R3),X'6B'             956B 3000        *n,..*     0002C
         BE    60(,R12)                4780 C03C        *..{.*     00030
         LA    R3,1(,R3)               4130 3001        *....*     00034
         B     38(,R12)                47F0 C026        *.0{.*     00038
         MVI   2159(R12),X'FF'         92FF C86F        *k.H?*     0003C
         LA    R4,6(,R1)               4140 1006        *. ..*     00040
         CR    R4,R3                   1943             *..*       00044
         BNE   92(,R12)                4770 C05C        *..{**     00046
         CLC   0(2,R1),2776(R12)       D501 1000 CAD8   *N....Q*   0004A
         BNE   150(,R12)               4770 C096        *..{o*     00050
         MVI   2159(R12),X'00'         9200 C86F        *k.H?*     00054
         LA    R1,2(,R1)               4110 1002        *....*     00058
         LA    R4,4(,R1)               4140 1004        *. ..*     0005C
         CR    R4,R3                   1943             *..*       00060
         BNE   150(,R12)               4770 C096        *..{o*     00062
         CLC   0(4,R1),2756(R12)       D503 1000 CAC4   *N....D*   00066
         BNE   118(,R12)               4770 C076        *..{.*     0006C
         MVC   2156(1,R12),2159(R12)   D200 C86C C86F   *K.H%H?*   00070
         CLC   0(4,R1),2760(R12)       D503 1000 CAC8   *N....H*   00076
         BNE   134(,R12)               4770 C086        *..{f*     0007C
         MVC   2157(1,R12),2159(R12)   D200 C86D C86F   *K.H_H?*   00080
         CLC   0(4,R1),2764(R12)       D503 1000 CACC   *N.....*   00086
         BNE   150(,R12)               4770 C096        *..{o*     0008C
         MVC   2158(1,R12),2159(R12)   D200 C86E C86F   *K.H>H?*   00090
         LA    R1,1(,R3)               4110 3001        *....*     00096
         CR    R1,R2                   1912             *..*       0009A
         BL    36(,R12)                4740 C024        *. {.*     0009C
         MVI   2159(R12),C' '          9240 C86F        *k H?*     000A0
         LA    R1,1500(,R12)           4110 C5DC        *..E.*     000A4
         CLI   2156(R12),X'FF'         95FF C86C        *n.H%*     000A8
         BNE   184(,R12)               4770 C0B8        *..{.*     000AC
         L     R0,1516(,R12)           5800 C5EC        *..E.*     000B0
         BAL   R2,534(,R12)            4520 C216        *..B.*     000B4
         CLI   2157(R12),X'FF'         95FF C86D        *n.H_*     000B8
         BNE   200(,R12)               4770 C0C8        *..{H*     000BC
         L     R0,1520(,R12)           5800 C5F0        *..E0*     000C0
         BAL   R2,534(,R12)            4520 C216        *..B.*     000C4
         CLI   2158(R12),X'FF'         95FF C86E        *n.H>*     000C8
         BNE   216(,R12)               4770 C0D8        *..{Q*     000CC
         L     R0,1524(,R12)           5800 C5F4        *..E4*     000D0
         BAL   R2,534(,R12)            4520 C216        *..B.*     000D4
         LA    R2,1528(,R12)           4120 C5F8        *..E8*     000D8
         ST    R2,2152(,R12)           5020 C868        *&.H.*     000DC
         MVI   96(R2),X'00'            9200 2060        *k..-*     000E0
         MVC   97(11,R2),96(R2)        D20A 2061 2060   *K../.-*   000E4
         LA    R1,1500(,R12)           4110 C5DC        *..E.*     000EA
         SVC   19      OPEN            0A13             *..*       000EE
         BAL   R1,254(,R12)            4510 C0FE        *..{.*     000F0
         DC    AL4(A0007E8)            000007E8         *...Y*     000F4
         DC    AL4(A0007F0)            000007F0         *...0*     000F8
         DC    X'C000'                 C000             *{.*       000FC
         SVC   4       GETMAIN         0A04             *..*       000FE
         LM    R3,R4,2032(R12)         9834 C7F0        *q.G0*     00100
         AR    R3,R4                   1A34             *..*       00104
         S     R3,2768(,R12)           5B30 CAD0        *$..}*     00106
         ST    R3,2024(,R12)           5030 C7E8        *&.GY*     0010A
         MVC   2028(4,R12),2768(R12)   D203 C7EC CAD0   *K.G..}*   0010E
         BAL   R1,290(,R12)            4510 C122        *..A.*     00114
         DC    X'00000000'             00000000         *....*     00118
         DC    AL4(A0007E8)            000007E8         *...Y*     0011C
         DC    X'C000'                 C000             *{.*       00120
         SVC   5       FREEMAIN        0A05             *..*       00122
         L     R3,2032(,R12)           5830 C7F0        *..G0*     00124
         S     R4,2768(,R12)           5B40 CAD0        *$ .}*     00128
         ST    R4,2036(,R12)           5040 C7F4        *& G4*     0012C
         AR    R4,R3                   1A43             *..*       00130
         MVI   2128(R12),C' '          9240 C850        *k H&*     00132
         MVC   2129(15,R12),2128(R12)  D20E C851 C850   *K.H.H&*   00136
         LA    R1,2                    4110 0002        *....*     0013C
         SVC   11      TIME            0A0B             *..*       00140
         SRL   R0,12                   8800 000C        *h...*     00142
         ST    R0,2088(,R12)           5000 C828        *&.H.*     00146
         OI    2091(R12),X'0F'         960F C82B        *o.H.*     0014A
         UNPK  2140(4,R12),2088(4,R12) F333 C85C C828   *3.H*H.*   0014E
         ST    R1,2088(,R12)           5010 C828        *&.H.*     00154
         UNPK  2144(5,R12),2089(3,R12) F342 C860 C829   *3.H-H.*   00158
         CP    2090(2,R12),2778(2,R12) F911 C82A CADA   *9.H...*   0015E
         BNH   382(,R12)               47D0 C17E        *.}A=*     00164
         TM    2089(R12),X'01'         9101 C829        *j.H.*     00168
         BNZ   376(,R12)               4770 C178        *..A.*     0016C
         TM    2089(R12),X'12'         9112 C829        *j.H.*     00170
         BNM   382(,R12)               47B0 C17E        *..A=*     00174
         AP    2090(2,R12),2780(1,R12) FA10 C82A CADC   *..H...*   00178
         LA    R15,2104(,R12)          41F0 C838        *.0H.*     0017E
         LA    R14,12                  41E0 000C        *.\..*     00182
         ZAP   2100(4,R12),2781(1,R12) F830 C834 CADD   *8.H...*   00186
         AP    2100(4,R12),2772(4,R12) FA33 C834 CAD4   *..H..M*   0018C
         CP    2090(2,R12),0(2,R15)    F911 C82A F000   *9.H.0.*   00192
         BNH   426(,R12)               47D0 C1AA        *.}A.*     00198
         SP    2090(2,R12),0(2,R15)    FB11 C82A F000   *..H.0.*   0019C
         LA    R15,2(,R15)             41F0 F002        *.00.*     001A2
         BCT   R14,396(,R12)           46E0 C18C        *.\A.*     001A6
         L     R1,2088(,R12)           5810 C828        *..H.*     001AA
         LR    R14,R1                  18E1             *..*       001AE
         N     R1,2092(,R12)           5410 C82C        *..H.*     001B0
         SRL   R1,8                    8810 0008        *h...*     001B4
         O     R1,2100(,R12)           5610 C834        *..H.*     001B8
         N     R14,2096(,R12)          54E0 C830        *.\H.*     001BC
         SLL   R14,12                  89E0 000C        *i\..*     001C0
         OR    R1,R14                  161E             *..*       001C4
         ST    R1,2088(,R12)           5010 C828        *&.H.*     001C6
         UNPK  2130(7,R12),2088(4,R12) F363 C852 C828   *3.H.H.*   001CA
         MVC   2128(2,R12),2130(R12)   D201 C850 C852   *K.H&H.*   001D0
         MVI   2130(R12),C'/'          9261 C852        *k/H.*     001D6
         MVC   2131(2,R12),2132(R12)   D201 C853 C854   *K.H.H.*   001DA
         MVI   2133(R12),C'/'          9261 C855        *k/H.*     001E0
         MVI   2136(R12),C' '          9240 C858        *k H.*     001E4
         MVI   2137(R12),C'@'          927C C859        *k@H.*     001E8
         MVC   2139(2,R12),2140(R12)   D201 C85B C85C   *K.H$H**   001EC
         MVI   2141(R12),C':'          927A C85D        *k:H)*     001F2
         NOPR  R0                      0700             *..*       001F6
         BAL   R1,514(,R12)            4510 C202        *..B.*     001F8
         DC    X'00'                   00               *.*        001FC
         DC    AL3(A000564)            000564           *...*      001FD
         DC    X'0008'                 0008             *..*       00200
         SVC   14      SPIE            0A0E             *..*       00202
         ST    R1,1376(,R12)           5010 C560        *&.E-*     00204
         LA    R1,2128(,R12)           4110 C850        *..H&*     00208
         LM    R12,R0,2040(R12)        98C0 C7F8        *q{G8*     0020C
         LA    R15,255                 41F0 00FF        *.0..*     00210
         BR    R14                     07FE             *..*       00214
         NI    0(R1),C'"'              947F 1000        *m"..*     00216
         LA    R1,4(,R1)               4110 1004        *....*     0021A
         ST    R0,0(,R1)               5000 1000        *&...*     0021E
         BR    R2                      07F2             *.2*       00222
SYSTERM  STM   R12,R2,1492(R15)        90C2 F5D4        *.B5M*     00224
         L     R12,2204(,R15)          58C0 F89C        *.{8.*     00228
         BAL   R1,570(,R12)            4510 C23A        *..B.*     0022C
         DC    X'00000000'             00000000         *....*     00230
         DC    AL4(A0007F0)            000007F0         *...0*     00234
         DC    X'C000'                 C000             *{.*       00238
         SVC   5       FREEMAIN        0A05             *..*       0023A
         L     R1,1376(,R12)           5810 C560        *..E-*     0023C
         SVC   14      SPIE            0A0E             *..*       00240
         LA    R1,1500(,R12)           4110 C5DC        *..E.*     00242
         SVC   20      CLOSE           0A14             *..*       00246
         LA    R2,1500(,R12)           4120 C5DC        *..E.*     00248
         L     R1,0(,R2)               5810 2000        *....*     0024C
         TM    23(R1),X'01'            9101 1017        *j...*     00250
         BO    646(,R12)               4710 C286        *..Bf*     00254
         L     R15,20(,R1)             58F0 1014        *.0..*     00258
         OI    23(R1),X'01'            9601 1017        *o...*     0025C
         SR    R14,R14                 1BEE             *..*       00260
         SR    R1,R1                   1B11             *..*       00262
         ICM   R1,B'0011',6(R15)       BF13 F006        *..0.*     00264
         IC    R14,5(,R15)             43E0 F005        *.\0.*     00268
         MR    R0,R14                  1C0E             *..*       0026C
         LA    R1,8(,R1)               4110 1008        *....*     0026E
         TM    4(R15),C' '             9140 F004        *j 0.*     00272
         BNO   638(,R12)               47E0 C27E        *.\B=*     00276
         LA    R1,8(,R1)               4110 1008        *....*     0027A
         LR    R0,R1                   1801             *..*       0027E
         LA    R1,0(,R15)              4110 F000        *..0.*     00280
         SVC   10      FREEMAIN        0A0A             *..*       00284
         TM    0(R2),X'80'             9180 2000        *j...*     00286
         BO    662(,R12)               4710 C296        *..Bo*     0028A
         LA    R2,4(,R2)               4120 2004        *....*     0028E
         B     588(,R12)               47F0 C24C        *.0B<*     00292
         SR    R15,R15                 1BFF             *..*       00296
         IC    R15,2157(,R12)          43F0 C86D        *.0H_*     00298
         LM    R0,R2,2056(R12)         9802 C808        *q.H.*     0029C
         LM    R12,R14,2040(R12)       98CE C7F8        *q.G8*     002A0
         BR    R14                     07FE             *..*       002A4
COPY     STM   R12,R2,1362(R15)        90C2 F552        *.B5.*     002A6
         L     R12,2074(,R15)          58C0 F81A        *.{8.*     002AA
         CLI   2159(R12),C' '          9540 C86F        *n H?*     002AE
         BNE   914(,R12)               4770 C392        *..Ck*     002B2
         MVC   2440(96,R12),1928(R12)  D25F C988 C788   *K^IhGh*   002B6
         LA    R2,2440(,R12)           4120 C988        *..Ih*     002BC
         MVI   96(R2),X'00'            9200 2060        *k..-*     002C0
         MVC   97(11,R2),96(R2)        D20A 2061 2060   *K../.-*   002C4
         ST    R2,2152(,R12)           5020 C868        *&.H.*     002CA
         MVI   2159(R12),C':'          927A C86F        *k:H?*     002CE
         LR    R1,R0                   1810             *..*       002D2
         MVI   2548(R12),C' '          9240 C9F4        *k I4*     002D4
         MVC   2549(15,R12),2548(R12)  D20E C9F5 C9F4   *K.I5I4*   002D8
         LA    R14,2548(,R12)          41E0 C9F4        *.\I4*     002DE
         BAL   R15,822(,R12)           45F0 C336        *.0C.*     002E2
         CLI   0(R1),X'4D'             954D 1000        *n(..*     002E6
         LA    R14,2556(,R12)          41E0 C9FC        *.\I.*     002EA
         LA    R1,1(,R1)               4110 1001        *....*     002EE
         BAL   R15,822(,R12)           45F0 C336        *.0C.*     002F2
         CLI   0(R1),C')'              955D 1000        *n)..*     002F6
         MVC   40(8,R2),2548(R12)      D207 2028 C9F4   *K...I4*   002FA
         BAL   R1,776(,R12)            4510 C308        *..C.*     00300
         DC    X'00000000'             00000000         *....*     00304
         ST    R2,0(R1)                5021 0000        *&...*     00308
         MVI   0(R1),X'80'             9280 1000        *k...*     0030C
         SVC   64      RDJFCB          0A40             *. *       00310
         MVC   2608(8,R12),2556(R12)   D207 CA30 C9FC   *K...I.*   00312
         OI    2650(R12),X'01'         9601 CA5A        *o..!*     00318
         OI    2616(R12),X'08'         9608 CA38        *o...*     0031C
         BAL   R1,808(,R12)            4510 C328        *..C.*     00320
         DC    X'00000000'             00000000         *....*     00324
         ST    R2,0(R1)                5021 0000        *&...*     00328
         MVI   0(R1),X'80'             9280 1000        *k...*     0032C
         SVC   22      OPEN TYPE=J     0A16             *..*       00330
         B     894(,R12)               47F0 C37E        *.0C=*     00332
         LA    R0,8                    4100 0008        *....*     00336
         EX    R0,0(,R15)              4400 F000        *..0.*     0033A
         BZ    4(,R15)                 4780 F004        *..0.*     0033E
         CLI   0(R1),C' '              9540 1000        *n ..*     00342
         BE    868(,R12)               4780 C364        *..C.*     00346
         MVC   0(1,R14),0(R1)          D200 E000 1000   *K.\...*   0034A
         LA    R14,1(,R14)             41E0 E001        *.\\.*     00350
         LA    R1,1(,R1)               4110 1001        *....*     00354
         BCT   R0,826(,R12)            4600 C33A        *..C.*     00358
         EX    R0,0(,R15)              4400 F000        *..0.*     0035C
         BE    4(,R15)                 4780 F004        *..0.*     00360
         MVC   40(8,R2),2548(R12)      D207 2028 C9F4   *K...I4*   00364
         NOPR  R0                      0700             *..*       0036A
         BAL   R1,884(,R12)            4510 C374        *..C.*     0036C
         DC    X'00000000'             00000000         *....*     00370
         ST    R2,0(R1)                5021 0000        *&...*     00374
         MVI   0(R1),X'80'             9280 1000        *k...*     00378
         SVC   19      OPEN            0A13             *..*       0037C
         TM    48(R2),X'10'            9110 2030        *j...*     0037E
         BO    914(,R12)               4710 C392        *..Ck*     00382
         LA    R1,1528(,R12)           4110 C5F8        *..E8*     00386
         ST    R1,2152(,R12)           5010 C868        *&.H.*     0038A
         MVI   2159(R12),C' '          9240 C86F        *k H?*     0038E
         LM    R12,R2,2040(R12)        98C2 C7F8        *qBG8*     00392
         BR    R14                     07FE             *..*       00396
READ     STM   R12,R7,1120(R15)        90C7 F460        *.G4-*     00398
         L     R12,1832(,R15)          58C0 F728        *.{7.*     0039C
         L     R2,2152(,R12)           5820 C868        *..H.*     003A0
         L     R3,100(,R2)             5830 2064        *....*     003A4
         C     R3,104(,R2)             5930 2068        *....*     003A8
         BL    1026(,R12)              4740 C402        *. D.*     003AC
         LR    R1,R2                   1812             *..*       003B0
         L     R15,48(,R1)             58F0 1030        *.0..*     003B2
         BALR  R14,R15                 05EF             *..*       003B6
         CLI   98(R2),X'FF'            95FF 2062        *n...*     003B8
         BNE   968(,R12)               4770 C3C8        *..CH*     003BC
         MVI   98(R2),X'00'            9200 2062        *k...*     003C0
         B     944(,R12)               47F0 C3B0        *.0C.*     003C4
         LR    R3,R1                   1831             *..*       003C8
         AH    R1,82(,R2)              4A10 2052        *¢...*     003CA
         ST    R3,100(,R2)             5030 2064        *&...*     003CE
         ST    R1,104(,R2)             5010 2068        *&...*     003D2
         CLI   99(R2),X'FF'            95FF 2063        *n...*     003D6
         BE    1200(,R12)              4780 C4B0        *..D.*     003DA
         MVC   2088(4,R12),0(R3)       D203 C828 3000   *K.H...*   003DE
         TM    36(R2),X'C0'            91C0 2024        *j{..*     003E4
         BO    1012(,R12)              4710 C3F4        *..C4*     003E8
         MVI   99(R2),X'FF'            92FF 2063        *k...*     003EC
         B     1200(,R12)              47F0 C4B0        *.0D.*     003F0
         LR    R1,R3                   1813             *..*       003F4
         AH    R1,2088(,R12)           4A10 C828        *¢.H.*     003F6
         ST    R1,104(,R2)             5010 2068        *&...*     003FA
         LA    R3,2(,R3)               4130 3002        *....*     003FE
         CLI   99(R2),X'FF'            95FF 2063        *n...*     00402
         BE    1200(,R12)              4780 C4B0        *..D.*     00406
         MVI   2160(R12),C' '          9240 C870        *k H.*     0040A
         MVC   2161(235,R12),2160(R12) D2EA C871 C870   *K.H.H.*   0040E
         MVC   2088(4,R12),0(R3)       D203 C828 3000   *K.H...*   00414
         L     R1,2088(,R12)           5810 C828        *..H.*     0041A
         CVD   R1,2432(,R12)           4E10 C980        *+.I.*     0041E
         MVC   2396(8,R12),2744(R12)   D207 C95C CAB8   *K.I*..*   00422
         ED    2395(9,R12),2436(R12)   DE08 C95B C984   *..I$Id*   00428
         LA    R5,2403(,R12)           4150 C963        *.&I.*     0042E
         CLI   0(R5),C'0'              95F0 5000        *n0&.*     00432
         BNE   1090(,R12)              4770 C442        *..D.*     00436
         MVI   0(R5),C' '              9240 5000        *k &.*     0043A
         BCT   R5,1074(,R12)           4650 C432        *.&D.*     0043E
         SR    R5,R5                   1B55             *..*       00442
         IC    R5,4(,R3)               4350 3004        *.&..*     00444
         SR    R1,R1                   1B11             *..*       00448
         LA    R3,5(,R3)               4130 3005        *....*     0044A
         LA    R6,2160(,R12)           4160 C870        *.-H.*     0044E
         LA    R7,236(,R6)             4170 60EC        *..-.*     00452
         MVC   72(8,R6),236(R6)        D207 6048 60EC   *K.-.-.*   00456
         LTR   R5,R5                   1255             *..*       0045C
         BNP   1186(,R12)              47D0 C4A2        *.}Ds*     0045E
         IC    R1,0(,R3)               4310 3000        *....*     00462
         BCTR  R5,R0                   0650             *.&*       00466
         LA    R3,1(,R3)               4130 3001        *....*     00468
         LA    R4,15                   4140 000F        *. ..*     0046C
         NR    R4,R1                   1441             *..*       00470
         SRL   R1,4                    8810 0004        *h...*     00472
         LA    R6,0(R1,R6)             4161 6000        *./-.*     00476
         LTR   R4,R4                   1244             *..*       0047A
         BNP   1168(,R12)              47D0 C490        *.}D.*     0047C
         SR    R5,R4                   1B54             *..*       00480
         BCTR  R4,R0                   0640             *. *       00482
         EX    R4,1194(,R12)           4440 C4AA        *. D.*     00484
         LA    R6,1(R4,R6)             4164 6001        *..-.*     00488
         LA    R3,1(R4,R3)             4134 3001        *....*     0048C
         CR    R6,R7                   1967             *..*       00490
         BNH   1116(,R12)              47D0 C45C        *.}D**     00492
         CLI   2159(R12),C':'          957A C86F        *n:H?*     00496
         BE    1252(,R12)              4780 C4E4        *..DU*     0049A
         B     1244(,R12)              47F0 C4DC        *.0D.*     0049E
         LA    R1,2160(,R12)           4110 C870        *..H.*     004A2
         B     1206(,R12)              47F0 C4B6        *.0D.*     004A6
         MVC   0(1,R6),0(R3)           D200 6000 3000   *K.-...*   004AA
         LR    R1,R3                   1813             *..*       004B0
         LA    R3,80(,R3)              4130 3050        *...&*     004B2
         ST    R3,100(,R2)             5030 2064        *&...*     004B6
         L     R15,2056(,R12)          58F0 C808        *.0H.*     004BA
         MVC   0(80,R15),0(R1)         D24F F000 1000   *K|0...*   004BE
         CLI   79(R15),C' '            9540 F04F        *n 0|*     004C4
         BNE   1234(,R12)              4770 C4D2        *..DK*     004C8
         MVC   79(1,R15),2159(R12)     D200 F04F C86F   *K.0|H?*   004CC
         CLI   96(R2),X'00'            9500 2060        *n..-*     004D2
         LM    R12,R7,2040(R12)        98C7 C7F8        *qGG8*     004D6
         BR    R14                     07FE             *..*       004DA
A0004DC  MVI   96(R2),X'FF'            92FF 2060        *k..-*     004DC
         B     1234(,R12)              47F0 C4D2        *.0DK*     004E0
A0004E4  L     R2,2152(,R12)           5820 C868        *..H.*     004E4
         BAL   R1,1264(,R12)           4510 C4F0        *..D0*     004E8
         DC    X'00000000'             00000000         *....*     004EC
         ST    R2,0(R1)                5021 0000        *&...*     004F0
         MVI   0(R1),X'80'             9280 1000        *k...*     004F4
         SVC   20      CLOSE           0A14             *..*       004F8
         LR    R1,R2                   1812             *..*       004FA
         L     R15,20(,R1)             58F0 1014        *.0..*     004FC
         OI    23(R1),X'01'            9601 1017        *o...*     00500
         SR    R14,R14                 1BEE             *..*       00504
         SR    R1,R1                   1B11             *..*       00506
         ICM   R1,B'0011',6(R15)       BF13 F006        *..0.*     00508
         IC    R14,5(,R15)             43E0 F005        *.\0.*     0050C
         MR    R0,R14                  1C0E             *..*       00510
         LA    R1,8(,R1)               4110 1008        *....*     00512
         TM    4(R15),C' '             9140 F004        *j 0.*     00516
         BNO   1314(,R12)              47E0 C522        *.\E.*     0051A
         LA    R1,8(,R1)               4110 1008        *....*     0051E
         LR    R0,R1                   1801             *..*       00522
         LA    R1,0(,R15)              4110 F000        *..0.*     00524
         SVC   10      FREEMAIN        0A0A             *..*       00528
         LA    R2,1528(,R12)           4120 C5F8        *..E8*     0052A
         ST    R2,2152(,R12)           5020 C868        *&.H.*     0052E
         MVI   2159(R12),C' '          9240 C86F        *k H?*     00532
         B     932(,R12)               47F0 C3A4        *.0Cu*     00536
         DC    X'0000'                 0000             *..*       0053A
A00053C  DC    X'05'                   05               *.*        0053C
         DC    AL3(A000544)            000544           *...*      0053D
         DC    X'87'                   87               *g*        00540
         DC    AL3(A000A04)            000A04           *...*      00541
A000544  OI    228(R15),X'08'          9608 F0E4        *o.0U*     00544
         CLI   97(R2),X'00'            9500 2061        *n../*     00548
         BNE   18(,R15)                4770 F012        *..0.*     0054C
         MVI   97(R2),X'FF'            92FF 2061        *k../*     00550
         BR    R14                     07FE             *..*       00554
         MVI   98(R2),X'FF'            92FF 2062        *k...*     00556
         MVI   99(R2),X'00'            9200 2063        *k...*     0055A
         BR    R14                     07FE             *..*       0055E
         DC    X'00000000'             00000000         *....*     00560
A000564  MVI   16(R1),X'00'            9200 1010        *k...*     00564
         BR    R14                     07FE             *..*       00568
         DC    X'0000'                 0000             *..*       0056A
A00056C  DC    X'85'                   85               *e*        0056C
         DC    AL3(A000570)            000570           *...*      0056D
A000570  SR    R2,R2                   1B22             *..*       00570
         CH    R2,62(R1)               4921 003E        *....*     00572
         BNE   18(,R15)                4770 F012        *..0.*     00576
         LH    R2,82(R1)               4821 0052        *....*     0057A
         STH   R2,62(R1)               4021 003E        * ...*     0057E
         BR    R14                     07FE             *..*       00582
WRITE    STM   R12,R2,628(R15)         90C2 F274        *.B2.*     00584
         L     R12,1340(,R15)          58C0 F53C        *.{5.*     00588
         CLI   2156(R12),X'FF'         95FF C86C        *n.H%*     0058C
         BNE   1438(,R12)              4770 C59E        *..E.*     00590
         LA    R1,1640(,R12)           4110 C668        *..F.*     00594
         L     R15,48(,R1)             58F0 1030        *.0..*     00598
         BALR  R14,R15                 05EF             *..*       0059C
         LM    R12,R2,2040(R12)        98C2 C7F8        *qBG8*     0059E
         BR    R14                     07FE             *..*       005A2
PUNCH    STM   R12,R2,596(R15)         90C2 F254        *.B2.*     005A4
         L     R12,1308(,R15)          58C0 F51C        *.{5.*     005A8
         LR    R2,R0                   1820             *..*       005AC
         CLI   2157(R12),X'FF'         95FF C86D        *n.H_*     005AE
         BNE   1472(,R12)              4770 C5C0        *..E{*     005B2
         LA    R1,1832(,R12)           4110 C728        *..G.*     005B6
         L     R15,48(,R1)             58F0 1030        *.0..*     005BA
         BALR  R14,R15                 05EF             *..*       005BE
         CLI   2158(R12),X'FF'         95FF C86E        *n.H>*     005C0
         BNE   1492(,R12)              4770 C5D4        *..EM*     005C4
         LR    R0,R2                   1802             *..*       005C8
         LA    R1,1736(,R12)           4110 C6C8        *..FH*     005CA
         L     R15,48(,R1)             58F0 1030        *.0..*     005CE
         BALR  R14,R15                 05EF             *..*       005D2
         LM    R12,R2,2040(R12)        98C2 C7F8        *qBG8*     005D4
         BR    R14                     07FE             *..*       005D8
         DC    X'000080'               000080           *...*      005DA
         DC    AL3(A0005F8)            0005F8           *..8*      005DD
         DC    X'0000000000000000'     0000000000000000 *........* 005E0
         DC    X'000000008F'           000000008F       *.....*    005E8
         DC    AL3(A000668)            000668           *...*      005ED
         DC    X'9F'                   9F               *.*        005F0
         DC    AL3(A000728)            000728           *...*      005F1
         DC    X'BF'                   BF               *.*        005F4
         DC    AL3(A0006C8)            0006C8           *..H*      005F5
A0005F8  DC    X'0000000000000000'     0000000000000000 *........* 005F8
         DC    X'0000000000000000'     0000000000000000 *........* 00600
         DC    X'0000000000000001'     0000000000000001 *........* 00608
         DC    X'0000'                 0000             *..*       00610
         DC    C' ',X'00'              4000             * .*       00612
         DC    X'0000000100'           0000000100       *.....*    00614
         DC    AL3(A0004DC)            0004DC           *...*      00619
         DC    X'00'                   00               *.*        0061C
         DC    AL3(A00053C)            00053C           *...*      0061D
         DC    C'SYSIN   '             E2E8E2C9D5404040 *SYSIN   * 00620
         DC    X'0200'                 0200             *..*       00628
         LH    R0,0                    4800 0000        *....*     0062A
         DC    X'0001000000010000'     0001000000010000 *........* 0062E
         DC    X'0000000000000000'     0000000000000000 *........* 00636
         DC    X'0001000000010000'     0001000000010000 *........* 0063E
         DC    X'0001000000002000'     0001000000002000 *........* 00646
         DC    X'0001000000000000'     0001000000000000 *........* 0064E
         DC    X'0001000000000000'     0001000000000000 *........* 00656
         DC    X'0000000000000000'     0000000000000000 *........* 0065E
         DC    X'0000'                 0000             *..*       00666
A000668  DC    X'0000000000000000'     0000000000000000 *........* 00668
         DC    X'0000000000000000'     0000000000000000 *........* 00670
         DC    X'0000000000000001'     0000000000000001 *........* 00678
         DC    X'0000'                 0000             *..*       00680
         DC    C' ',X'00'              4000             * .*       00682
         DC    X'0000000100000001'     0000000100000001 *........* 00684
         DC    X'94'                   94               *m*        0068C
         DC    AL3(A00056C)            00056C           *..%*      0068D
         DC    C'SYSPRINT'             E2E8E2D7D9C9D5E3 *SYSPRINT* 00690
         DC    X'0200005000000001'     0200005000000001 *...&....* 00698
         DC    X'0000000100000000'     0000000100000000 *........* 006A0
         DC    X'0000000000000001'     0000000000000001 *........* 006A8
         DC    X'0000000100000001'     0000000100000001 *........* 006B0
         DC    X'0000008520000001'     0000008520000001 *...e....* 006B8
         DC    X'0000000000000001'     0000000000000001 *........* 006C0
A0006C8  DC    X'0000000000000000'     0000000000000000 *........* 006C8
         DC    X'0000000000000000'     0000000000000000 *........* 006D0
         DC    X'0000000000000001'     0000000000000001 *........* 006D8
         DC    X'0000'                 0000             *..*       006E0
         DC    C' ',X'00'              4000             * .*       006E2
         DC    X'0000000100000001'     0000000100000001 *........* 006E4
         DC    X'90'                   90               *.*        006EC
         DC    AL3(A00056C)            00056C           *..%*      006ED
         DC    C'SYSPUNCH'             E2E8E2D7E4D5C3C8 *SYSPUNCH* 006F0
         DC    X'0200005000000001'     0200005000000001 *...&....* 006F8
         DC    X'0000000100000000'     0000000100000000 *........* 00700
         DC    X'0000000000000001'     0000000000000001 *........* 00708
         DC    X'0000000100000001'     0000000100000001 *........* 00710
         DC    X'0000005020000001'     0000005020000001 *...&....* 00718
         DC    X'0000000000000001'     0000000000000001 *........* 00720
A000728  DC    X'0000000000000000'     0000000000000000 *........* 00728
         DC    X'0000000000000000'     0000000000000000 *........* 00730
         DC    X'0000000000000001'     0000000000000001 *........* 00738
         DC    X'0000'                 0000             *..*       00740
         DC    C' ',X'00'              4000             * .*       00742
         DC    X'0000000100000001'     0000000100000001 *........* 00744
         DC    X'90'                   90               *.*        0074C
         DC    AL3(A00056C)            00056C           *..%*      0074D
         DC    C'SYSGO   '             E2E8E2C7D6404040 *SYSGO   * 00750
         DC    X'0200005000000001'     0200005000000001 *...&....* 00758
         DC    X'0000000100000000'     0000000100000000 *........* 00760
         DC    X'0000000000000001'     0000000000000001 *........* 00768
         DC    X'0000000100000001'     0000000100000001 *........* 00770
         DC    X'0000005020000001'     0000005020000001 *...&....* 00778
         DC    X'0000000000000001'     0000000000000001 *........* 00780
         DC    X'0000000000000000'     0000000000000000 *........* 00788
         DC    X'0000000000000000'     0000000000000000 *........* 00790
         DC    X'0000000000000001'     0000000000000001 *........* 00798
         DC    X'0000'                 0000             *..*       007A0
         DC    C' ',X'00'              4000             * .*       007A2
         DC    X'0000000100'           0000000100       *.....*    007A4
         DC    AL3(A0004E4)            0004E4           *..U*      007A9
         DC    X'00'                   00               *.*        007AC
         DC    AL3(A00053C)            00053C           *...*      007AD
         DC    C'UNIT1   '             E4D5C9E3F1404040 *UNIT1   * 007B0
         DC    X'0200'                 0200             *..*       007B8
         LH    R0,0                    4800 0000        *....*     007BA
         DC    X'0001000000010000'     0001000000010000 *........* 007BE
         DC    X'0000000000000000'     0000000000000000 *........* 007C6
         DC    X'0001000000010000'     0001000000010000 *........* 007CE
         DC    X'0001000000002000'     0001000000002000 *........* 007D6
         DC    X'0001000000000000'     0001000000000000 *........* 007DE
         DC    X'0001'                 0001             *..*       007E6
A0007E8  DC    X'0001000000100000'     0001000000100000 *........* 007E8
A0007F0  DC    X'0000000000000000'     0000000000000000 *........* 007F0
         DC    X'0000000000000000'     0000000000000000 *........* 007F8
         DC    X'0000000000000000'     0000000000000000 *........* 00800
         DC    X'0000000000000000'     0000000000000000 *........* 00808
         DC    X'0000000000000000'     0000000000000000 *........* 00810
         DC    X'0000000000000000'     0000000000000000 *........* 00818
         DC    X'0000000000000000'     0000000000000000 *........* 00820
         DC    X'0000000000FF0000'     0000000000FF0000 *........* 00828
         DC    X'00000FF000000000'     00000FF000000000 *...0....* 00830
         DC    X'031C029C031C030C'     031C029C031C030C *........* 00838
         DC    X'031C030C031C031C'     031C030C031C031C *........* 00840
         DC    X'030C031C030C031C'     030C031C030C031C *........* 00848
         DC    X'0000000000000000'     0000000000000000 *........* 00850
         DC    X'0000000000000000'     0000000000000000 *........* 00858
         DC    X'0000000000000000'     0000000000000000 *........* 00860
         DC    X'0000000000000000'     0000000000000000 *........* 00868
         DC    X'0000000000000000'     0000000000000000 *........* 00870
         DC    X'0000000000000000'     0000000000000000 *........* 00878
         DC    X'0000000000000000'     0000000000000000 *........* 00880
         DC    X'0000000000000000'     0000000000000000 *........* 00888
         DC    X'0000000000000000'     0000000000000000 *........* 00890
         DC    X'0000000000000000'     0000000000000000 *........* 00898
         DC    X'0000000000000000'     0000000000000000 *........* 008A0
         DC    X'0000000000000000'     0000000000000000 *........* 008A8
         DC    X'0000000000000000'     0000000000000000 *........* 008B0
         DC    X'0000000000000000'     0000000000000000 *........* 008B8
         DC    X'0000000000000000'     0000000000000000 *........* 008C0
         DC    X'0000000000000000'     0000000000000000 *........* 008C8
         DC    X'0000000000000000'     0000000000000000 *........* 008D0
         DC    X'0000000000000000'     0000000000000000 *........* 008D8
         DC    X'0000000000000000'     0000000000000000 *........* 008E0
         DC    X'0000000000000000'     0000000000000000 *........* 008E8
         DC    X'0000000000000000'     0000000000000000 *........* 008F0
         DC    X'0000000000000000'     0000000000000000 *........* 008F8
         DC    X'0000000000000000'     0000000000000000 *........* 00900
         DC    X'0000000000000000'     0000000000000000 *........* 00908
         DC    X'0000000000000000'     0000000000000000 *........* 00910
         DC    X'0000000000000000'     0000000000000000 *........* 00918
         DC    X'0000000000000000'     0000000000000000 *........* 00920
         DC    X'0000000000000000'     0000000000000000 *........* 00928
         DC    X'0000000000000000'     0000000000000000 *........* 00930
         DC    X'0000000000000000'     0000000000000000 *........* 00938
         DC    X'0000000000000000'     0000000000000000 *........* 00940
         DC    X'0000000000000000'     0000000000000000 *........* 00948
         DC    X'0000000000000000'     0000000000000000 *........* 00950
         DC    X'0000000000000000'     0000000000000000 *........* 00958
         DC    X'0000000000000000'     0000000000000000 *........* 00960
         DC    X'0000000000000000'     0000000000000000 *........* 00968
         DC    X'0000000000000000'     0000000000000000 *........* 00970
         DC    X'0000000000000000'     0000000000000000 *........* 00978
         DC    X'0000000000000000'     0000000000000000 *........* 00980
         DC    X'0000000000000000'     0000000000000000 *........* 00988
         DC    X'0000000000000000'     0000000000000000 *........* 00990
         DC    X'0000000000000000'     0000000000000000 *........* 00998
         DC    X'0000000000000000'     0000000000000000 *........* 009A0
         DC    X'0000000000000000'     0000000000000000 *........* 009A8
         DC    X'0000000000000000'     0000000000000000 *........* 009B0
         DC    X'0000000000000000'     0000000000000000 *........* 009B8
         DC    X'0000000000000000'     0000000000000000 *........* 009C0
         DC    X'0000000000000000'     0000000000000000 *........* 009C8
         DC    X'0000000000000000'     0000000000000000 *........* 009D0
         DC    X'0000000000000000'     0000000000000000 *........* 009D8
         DC    X'0000000000000000'     0000000000000000 *........* 009E0
         DC    X'0000000000000000'     0000000000000000 *........* 009E8
         DC    X'0000000000000000'     0000000000000000 *........* 009F0
         DC    X'0000000000000000'     0000000000000000 *........* 009F8
         DC    X'00000000'             00000000         *....*     00A00
A000A04  DC    X'0000000000000000'     0000000000000000 *........* 00A04
         DC    X'0000000000000000'     0000000000000000 *........* 00A0C
         DC    X'0000000000000000'     0000000000000000 *........* 00A14
         DC    X'0000000000000000'     0000000000000000 *........* 00A1C
         DC    X'0000000000000000'     0000000000000000 *........* 00A24
         DC    X'0000000000000000'     0000000000000000 *........* 00A2C
         DC    X'0000000000000000'     0000000000000000 *........* 00A34
         DC    X'0000000000000000'     0000000000000000 *........* 00A3C
         DC    X'0000000000000000'     0000000000000000 *........* 00A44
         DC    X'0000000000000000'     0000000000000000 *........* 00A4C
         DC    X'0000000000000000'     0000000000000000 *........* 00A54
         DC    X'0000000000000000'     0000000000000000 *........* 00A5C
         DC    X'0000000000000000'     0000000000000000 *........* 00A64
         DC    X'0000000000000000'     0000000000000000 *........* 00A6C
         DC    X'0000000000000000'     0000000000000000 *........* 00A74
         DC    X'0000000000000000'     0000000000000000 *........* 00A7C
         DC    X'0000000000000000'     0000000000000000 *........* 00A84
         DC    X'0000000000000000'     0000000000000000 *........* 00A8C
         DC    X'0000000000000000'     0000000000000000 *........* 00A94
         DC    X'0000000000000000'     0000000000000000 *........* 00A9C
         DC    X'0000000000000000'     0000000000000000 *........* 00AA4
         DC    X'0000000000000000'     0000000000000000 *........* 00AAC
         DC    X'0000000020202120'     0000000020202120 *........* 00AB4
         SH    R2,32(,R2)              4B20 2020        *....*     00ABC
         DC    AL4($PLCOMP)            00000000         *....*     00AC0
         DC    C'LISTLOAD'             D3C9E2E3D3D6C1C4 *LISTLOAD* 00AC4
         DC    C'DECK'                 C4C5C3D2         *DECK*     00ACC
         DC    X'000090000100000C'     000090000100000C *........* 00AD0
         DC    C'NO'                   D5D6             *NO*       00AD8
         BALR  R9,R12                  059C             *..*       00ADA
         MR    R0,R12                  1C0C             *..*       00ADC
         END
