/* rexx */
/*********************************************************************/
/* used with the nj command to locate a particular line in an edit   */
/*********************************************************************/
Address ISPEXEC
"VGET POS SHARED"
If RC > 0 Then Return
"VERASE POS SHARED"

Address ISREDIT
"MACRO"
"CURSOR =" POS 1

Return
