  MACRO
  IFTEST &THISIF
  GBLC  &LASTIF
  COPY  GBLVARS
.*
.*   THIS MACRO ENSURES THAT THE 'IF' MACROS HAVE BEEN CODED
.*   IN A SYNTACTICALLY CORRECT SEQUENCE.
.*
  AIF   ('&LASTIF' EQ '').OK
  AIF   ('&LASTIF' EQ 'ENDIF').OK
  AIF   ('&THISIF' EQ 'ENDIF').OK
  AIF   ('&THISIF' EQ 'IF').OK
  AIF   ('&THISIF' EQ 'ELSEIF' AND '&LASTIF' EQ 'ELSEIF').OK
  AIF   ('&THISIF' EQ 'ELSEIF' AND '&LASTIF' EQ 'IF').OK
  AIF   ('&THISIF' EQ 'ELSE' AND '&LASTIF' EQ 'ELSEIF').OK
  AIF   ('&THISIF' EQ 'ELSE' AND '&LASTIF' EQ 'IF').OK
 MNOTE 8,'ERROR - ''&THISIF'' MACRO INVALID AFTER ''&LASTIF''.'
  MEXIT
.*
.OK  ANOP
&LASTIF  SETC  '&THISIF'
  MEND
