//WFMCTL   PROC DATE=,DISK=
//*
//* Generate control data for other steps
//* Allocate some general datasets
//*
//WFMCTLS1 EXEC PGM=IKJEFT1B,
//            PARM='%WFMCTLX1 DATE(&DATE) DISK(&DISK)'
//STEPLIB  INCLUDE MEMBER=WFMSTEPL
//SYSEXEC  DD DISP=SHR,DSN=&WFMLIB
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
//LASTDATE DD DISP=SHR,DSN=&PARMDS(LASTDATE)
//SMFLDATE DD DISP=SHR,DSN=&PARMDS(SMFLDATE)
//SMFHDATE DD DISP=SHR,DSN=&PARMDS(SMFHDATE)
//SMFDISK  DD DISP=SHR,DSN=&PARMDS(SMFDISK)
//DDBDISK  DD DISP=SHR,DSN=&PARMDS(DDBDISK)
//VTOCDISK DD DISP=SHR,DSN=&PARMDS(VTOCDISK)
//VTOCDATE DD DISP=SHR,DSN=&PARMDS(VTOCDATE)
//UPD      DD DISP=(MOD,CATLG),DSN=&DSPFX..UPD,LRECL=51,RECFM=FB,
//            UNIT=SYSDA,SPACE=(51,(2,2),RLSE),AVGREC=K
//WFMCTL   PEND
