)ATTR
 +  type(text) color(green)
 %  type(text) color(yellow)
 "  type(text  ) color(yellow)
 !  type(input ) color(turq  ) hilite(uscore) caps(on)
 @  type(output) color(green ) caps(off)
)BODY EXPAND(\\)
%
+
+
   @lmwarn1 \ \+
   @lmwarn2 \ \+
)INIT
)PROC
)END
