)ATTR
 +  type(text) color(green)
 %  type(text) color(white)
 "  type(text  ) color(turq  )
 !  type(input ) color(turq  ) hilite(uscore) caps(on)
 #  type(output) color(turq  )
 @  type(output) color(yellow)
)BODY EXPAND(\\)
"\ \Find Member Info (WFM4.002)\ \+
%Cmd =>_zcmd \ \+    +
+
+
%Member info
+  Name     #mbrname +
+  User     #mbruser +
+  Create   #mbrcredt         +
+  Update   #mbrupddt         +
+  Size     #mbrsize +
+  Init     #mbrisize+
+  Aliasof  #mbraliof+
+  SSI      #mbrssi  +
+
%Dataset info
+  Name     #dsnname
+  Volume   #dsnvol+
+  Cataloged#dsncat+
+  Type     #dsntype+
+  Dsorg    #dsndsorg+
+  Recfm    #dsnrecfm+
+  Lrecl    #dsnlrecl+
+  Blksz    #dsnblksz+
+
)INIT
)PROC
)END
