//WFMLST   PROC DS=
//WFMLSTS1 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSUT1   DD DISP=SHR,DSN=&DS
//SYSUT2   DD SYSOUT=*
//         PEND
