*
*  Compiled by DCC Version 1.31.00
*           on Wed Jan 10 16:22:50 2001
*

*
*
*
*    Code Section
*
@ZLIB08 CSECT
@ZLIB08 AMODE ANY
@ZLIB08 RMODE ANY
*
*
*
huftbld  #PROLOG CINDEX=83,BASER=12,FRAME=368,ENTRY=NO
         ST    1,80(0,13)  ; Save ptr to incoming parm block
* ******* End of Prologue
* *
* ***
* ***   uInt a;
* ***     uInt cÝ15+1¨;
* ***     uInt f;
* ***     int g;
* ***     int h;
* ***     register uInt i;
* ***     register uInt j;
* ***     register int k;
* ***     int l;
* ***     uInt mask;
* ***     register uIntf *p;
* ***     inflate_huft *q;
* ***     struct inflate_huft_s r;
* ***     inflate_huft *uÝ15¨;
* ***     register int w;
* ***     uInt xÝ15+1¨;
* ***     uIntf *xp;
* ***     int y;
* ***     uInt z;
* ***
* ***
* ***
* ***   p = c;
         LA    2,116(0,13) ; &c
         ST    2,212(0,13) ; p
* ***
* ***
* ***
* ***   *p++ = 0; *p++ = 0; *p++ = 0; *p++ = 0; *p++ = 0; *p++ = 0; *p\
* ++ = 0; *p++ = 0; *p++ = 0; *p++ = 0; *p++ = 0; *p++ = 0; *p++ = 0; \
* *p++ = 0; *p++ = 0; *p++ = 0;
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,0(0,0)
         ST    4,0(0,3)
* ***     p = b; i = n;
         L     3,0(0,1)    ; b
         ST    3,212(0,13) ; p
         L     2,4(0,1)    ; n
         ST    2,192(0,13) ; i
* ***     do {
@L0      DS    0H
* ***       cÝ*p++¨++;
         L     2,212(0,13) ; p
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         L     4,0(0,3)
         LA    3,116(0,13) ; &c
         SLL   4,2(0)
         LA    4,0(4,3)
         LR    3,4
         L     5,0(0,4)
         LR    4,5
         AL    4,@lit_83_1
         ST    4,0(0,3)
* ***     } while (--i);
         L     3,192(0,13) ; i
         BCTR  3,0
         ST    3,192(0,13) ; i
         LTR   3,3
         BNZ   @L0
* ***     if (cÝ0¨ == n)
         LA    4,116(0,13) ; &c
         L     5,0(0,4)
         L     4,80(0,13)
         CL    5,4(0,4)
         BNE   @L3
* ***     {
* ***       *t = (inflate_huft *)0;
         L     5,20(0,4)   ; t
         LA    6,0(0,0)
         ST    6,0(0,5)    ; t
* ***       *m = 0;
         L     2,24(0,4)   ; m
         LA    3,0(0,0)
         ST    3,0(0,2)    ; m
* ***       return 0;
         LA    15,0(0,0)
         AL    12,@lit_region_diff_83_1_2
         DROP  12
         USING @REGION_83_2,12
         B     @ret_lab_83
         DROP  12
         USING @REGION_83_1,12
         DS    0D
@FRAMESIZE_83  DC F'368'
@lit_83_1  DC F'1' 0x00000001
@lit_region_diff_83_1_2  DC A(@REGION_83_2-@REGION_83_1)
@lit_83_3  DC F'15' 0x0000000f
@lit_83_4  DC F'-3' 0xfffffffd
@lit_83_9  DC F'-1' 0xffffffff
@lit_83_14  DC F'1440' 0x000005a0
@lit_83_15  DC F'-4' 0xfffffffc
@lit_83_16  DC F'256' 0x00000100
@lit_83_18  DC F'64' 0x00000040
@lit_83_17  DC F'16' 0x00000010
@lit_83_21  DC F'-5' 0xfffffffb
* ***     }
* ***
* ***
* ***
* ***   l = *m;
@L3      DS    0H
         L     2,80(0,13)
         L     3,24(0,2)   ; m
         L     4,0(0,3)
         ST    4,204(0,13) ; l
* ***     for (j = 1; j <= 15; j++)
         LA    5,1(0,0)
         ST    5,196(0,13) ; j
         B     @L5
@L4      DS    0H
* ***       if (cÝj¨)
         L     2,196(0,13) ; j
         LA    3,116(0,13) ; &c
         SLL   2,2(0)
         LA    2,0(2,3)
         L     3,0(0,2)
         LTR   3,3
         BZ    @L8
* ***         break;
         B     @L6
* ***     k = j;
@L8      DS    0H
         L     2,196(0,13) ; j
         AL    2,@lit_83_1
         ST    2,196(0,13) ; j
@L5      DS    0H
         L     2,196(0,13) ; j
         CL    2,@lit_83_3
         BNH   @L4
@L6      DS    0H
         L     2,196(0,13) ; j
         ST    2,200(0,13) ; k
* ***     if ((uInt)l < j)
         L     3,204(0,13) ; l
         CL    3,196(0,13)
         BNL   @L9
* ***       l = j;
         ST    2,204(0,13) ; l
* ***     for (i = 15; i; i--)
@L9      DS    0H
         LA    2,15(0,0)
         ST    2,192(0,13) ; i
         B     @L11
@L10     DS    0H
* ***       if (cÝi¨)
         L     2,192(0,13) ; i
         LA    3,116(0,13) ; &c
         SLL   2,2(0)
         LA    2,0(2,3)
         L     3,0(0,2)
         LTR   3,3
         BZ    @L14
* ***         break;
         B     @L12
* ***     g = i;
@L14     DS    0H
         L     2,192(0,13) ; i
         BCTR  2,0
         ST    2,192(0,13) ; i
@L11     DS    0H
         L     2,192(0,13) ; i
         LTR   2,2
         BNZ   @L10
@L12     DS    0H
         L     2,192(0,13) ; i
         ST    2,184(0,13) ; g
* ***     if ((uInt)l > i)
         L     3,204(0,13) ; l
         CL    3,192(0,13)
         BNH   @L15
* ***       l = i;
         ST    2,204(0,13) ; l
* ***     *m = l;
@L15     DS    0H
         L     2,80(0,13)
         L     3,24(0,2)   ; m
         L     4,204(0,13) ; l
         ST    4,0(0,3)    ; m
* ***
* ***
* ***
* ***   for (y = 1 << j; j < i; j++, y <<= 1)
         LA    4,1(0,0)
         L     5,196(0,13) ; j
         SLL   4,0(5)
         ST    4,360(0,13) ; y
         B     @L17
@L16     DS    0H
* ***       if ((y -= cÝj¨) < 0)
         L     2,360(0,13) ; y
         L     3,196(0,13) ; j
         LA    4,116(0,13) ; &c
         SLL   3,2(0)
         LA    3,0(3,4)
         L     4,0(0,3)
         SLR   2,4
         ST    2,360(0,13) ; y
         LTR   2,2
         BNL   @L20
* ***         return (-3);
         L     15,@lit_83_4
         AL    12,@lit_region_diff_83_1_2
         DROP  12
         USING @REGION_83_2,12
         B     @ret_lab_83
         DROP  12
         USING @REGION_83_1,12
* ***     if ((y -= cÝi¨) < 0)
@L20     DS    0H
         L     2,196(0,13) ; j
         AL    2,@lit_83_1
         ST    2,196(0,13) ; j
         L     3,360(0,13) ; y
         SLL   3,1(0)
         ST    3,360(0,13) ; y
@L17     DS    0H
         L     2,196(0,13) ; j
         CL    2,192(0,13)
         BL    @L16
         L     3,360(0,13) ; y
         L     4,192(0,13) ; i
         LA    5,116(0,13) ; &c
         SLL   4,2(0)
         LA    4,0(4,5)
         L     5,0(0,4)
         SLR   3,5
         ST    3,360(0,13) ; y
         LTR   3,3
         BNL   @L21
* ***       return (-3);
         L     15,@lit_83_4
         AL    12,@lit_region_diff_83_1_2
         DROP  12
         USING @REGION_83_2,12
         B     @ret_lab_83
         DROP  12
         USING @REGION_83_1,12
* ***     cÝi¨ += y;
@L21     DS    0H
         L     2,192(0,13) ; i
         LA    3,116(0,13) ; &c
         SLL   2,2(0)
         LA    2,0(2,3)
         LR    3,2
         L     4,0(0,2)
         AL    4,360(0,13)
         ST    4,0(0,3)
* ***
* ***
* ***
* ***   xÝ1¨ = j = 0;
         LA    2,292(0,13) ; &x
         LA    2,4(0,2)
         LA    3,0(0,0)
         ST    3,196(0,13) ; j
         ST    3,0(0,2)
* ***     p = c + 1; xp = x + 2;
         LA    2,116(0,13) ; &c
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    3,292(0,13) ; &x
         LA    3,8(0,3)
         ST    3,356(0,13) ; xp
* ***     while (--i) {
         B     @L23
@L22     DS    0H
* ***       *xp++ = (j += *p++);
         L     2,356(0,13) ; xp
         LR    3,2
         LA    2,4(0,2)
         ST    2,356(0,13) ; xp
         L     4,212(0,13) ; p
         LR    5,4
         LA    4,4(0,4)
         ST    4,212(0,13) ; p
         L     6,0(0,5)
         AL    6,196(0,13)
         ST    6,196(0,13) ; j
         ST    6,0(0,3)
* ***     }
@L23     DS    0H
         L     2,192(0,13) ; i
         BCTR  2,0
         ST    2,192(0,13) ; i
         LTR   2,2
         BNZ   @L22
* ***
* ***
* ***
* ***   p = b; i = 0;
         L     3,80(0,13)
         L     4,0(0,3)    ; b
         ST    4,212(0,13) ; p
         LA    5,0(0,0)
         ST    5,192(0,13) ; i
* ***     do {
@L26     DS    0H
* ***       if ((j = *p++) != 0)
         L     2,212(0,13) ; p
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         L     4,0(0,3)
         ST    4,196(0,13) ; j
         LTR   4,4
         BE    @L29
* ***         vÝxÝj¨++¨ = i;
         LA    3,292(0,13) ; &x
         SLL   4,2(0)
         LA    4,0(4,3)
         LR    3,4
         L     5,0(0,4)
         LR    4,5
         AL    4,@lit_83_1
         ST    4,0(0,3)
         L     3,80(0,13)
         L     4,36(0,3)   ; v
         SLL   5,2(0)
         LA    5,0(5,4)
         L     6,192(0,13) ; i
         ST    6,0(0,5)
* ***     } while (++i < n);
@L29     DS    0H
         L     2,192(0,13) ; i
         AL    2,@lit_83_1
         ST    2,192(0,13) ; i
         L     3,80(0,13)
         CL    2,4(0,3)
         BL    @L26
* ***     n = xÝg¨;
         L     4,184(0,13) ; g
         LA    5,292(0,13) ; &x
         SLL   4,2(0)
         LA    4,0(4,5)
         L     5,0(0,4)
         ST    5,4(0,3)    ; n
* ***
* ***
* ***
* ***   xÝ0¨ = i = 0;
         LA    4,292(0,13) ; &x
         LA    6,0(0,0)
         ST    6,192(0,13) ; i
         ST    6,0(0,4)
* ***     p = v;
         L     2,36(0,3)   ; v
         ST    2,212(0,13) ; p
* ***     h = -1;
         L     4,@lit_83_9
         ST    4,188(0,13) ; h
* ***     w = -l;
         L     5,204(0,13) ; l
         LCR   5,5
         ST    5,288(0,13) ; w
* ***     uÝ0¨ = (inflate_huft *)0;
         LA    6,228(0,13) ; &u
         LA    7,0(0,0)
         ST    7,0(0,6)
* ***     q = (inflate_huft *)0;
         LA    2,0(0,0)
         ST    2,216(0,13) ; q
* ***     z = 0;
         LA    4,0(0,0)
         ST    4,364(0,13) ; z
* ***
* ***
* ***   for (; k <= g; k++)
         B     @L31
@L30     DS    0H
* ***     {
* ***       a = cÝk¨;
         L     2,200(0,13) ; k
         LA    3,116(0,13) ; &c
         SLL   2,2(0)
         LA    2,0(2,3)
         L     3,0(0,2)
         ST    3,112(0,13) ; a
* ***       while (a--)
         B     @L35
@L34     DS    0H
* ***
* ***
* ***   while (k > w + l)
@L38     DS    0H
* ***           h++;
         L     2,188(0,13) ; h
         A     2,@lit_83_1
         ST    2,188(0,13) ; h
* ***           w += l;
         L     3,288(0,13) ; w
         A     3,204(0,13) ; l
         ST    3,288(0,13) ; w
* ***
* ***
* ***   z = g - w;
         L     4,184(0,13) ; g
         S     4,288(0,13)
         ST    4,364(0,13) ; z
* ***           z = z > (uInt)l ? l : z;
         CL    4,204(0,13)
         BNH   @@gen_label15
         L     5,204(0,13) ; l
         B     @@gen_label16
@@gen_label15 DS 0H
         L     2,364(0,13) ; z
         LR    5,2
@@gen_label16 DS 0H
         ST    5,364(0,13) ; z
* ***           if ((f = 1 << (j = k - w)) > a + 1)
         LA    2,1(0,0)
         L     3,200(0,13) ; k
         S     3,288(0,13)
         ST    3,196(0,13) ; j
         SLL   2,0(3)
         ST    2,180(0,13) ; f
         L     4,112(0,13) ; a
         AL    4,@lit_83_1
         CLR   2,4
         BNH   @L42
* ***           {
* ***             f -= a + 1;
         L     4,112(0,13) ; a
         AL    4,@lit_83_1
         SLR   2,4
         ST    2,180(0,13) ; f
* ***             xp = c + k;
         LA    4,116(0,13) ; &c
         L     6,200(0,13) ; k
         SLL   6,2(0)
         LA    4,0(4,6)
         ST    4,356(0,13) ; xp
* ***             if (j < z)
         CL    3,364(0,13)
         BNL   @L42
* ***               while (++j < z)
         B     @L45
@L44     DS    0H
* ***                 if ((f <<= 1) <= *++xp)
         L     2,180(0,13) ; f
         SLL   2,1(0)
         ST    2,180(0,13) ; f
         L     3,356(0,13) ; xp
         LA    3,4(0,3)
         ST    3,356(0,13) ; xp
         L     4,0(0,3)
         CLR   2,4
         BH    @L48
* ***                   break;
         B     @L42
* ***                 f -= *xp;
@L48     DS    0H
         L     2,180(0,13) ; f
         L     3,356(0,13) ; xp
         L     4,0(0,3)
         SLR   2,4
         ST    2,180(0,13) ; f
* ***               }
@L45     DS    0H
* ***               {
         L     2,196(0,13) ; j
         AL    2,@lit_83_1
         ST    2,196(0,13) ; j
         CL    2,364(0,13)
         BL    @L44
         B     @L42
@L46     DS    0H
* ***           }
@L43     DS    0H
* ***           z = 1 << j;
@L42     DS    0H
         LA    2,1(0,0)
         L     3,196(0,13) ; j
         SLL   2,0(3)
         ST    2,364(0,13) ; z
* ***
* ***
* ***   if (*hn + z > 1440)
         L     4,80(0,13)
         L     5,32(0,4)   ; hn
         L     6,0(0,5)
         AL    6,364(0,13) ; z
         CL    6,@lit_83_14
         BNH   @L49
* ***             return (-4);
         L     15,@lit_83_15
         AL    12,@lit_region_diff_83_1_2
         DROP  12
         USING @REGION_83_2,12
         B     @ret_lab_83
         DROP  12
         USING @REGION_83_1,12
* ***           uÝh¨ = q = hp + *hn;
@L49     DS    0H
         L     2,188(0,13) ; h
         LA    3,228(0,13) ; &u
         SLL   2,2(0)
         LA    2,0(2,3)
         L     3,80(0,13)
         L     4,28(0,3)   ; hp
         L     5,32(0,3)   ; hn
         L     6,0(0,5)
         SLL   6,3(0)
         LA    4,0(4,6)
         ST    4,216(0,13) ; q
         ST    4,0(0,2)
* ***           *hn += z;
         L     2,32(0,3)   ; hn
         LR    4,2
         L     5,0(0,2)
         AL    5,364(0,13) ; z
         ST    5,0(0,4)
* ***
* ***
* ***   if (h)
         L     4,188(0,13) ; h
         LTR   4,4
         BZ    @L50
* ***           {
* ***             xÝh¨ = i;
         LA    5,292(0,13) ; &x
         SLL   4,2(0)
         LA    4,0(4,5)
         L     5,192(0,13) ; i
         ST    5,0(0,4)
* ***             r.word.what.Bits = (Byte)l;
         LA    4,220(0,13) ; &r
         LA    4,1(0,4)    ; offset of Bits in 0000001
         L     5,204(0,13) ; l
         STC   5,0(0,4)    ; offset of Bits in 0000001
* ***             r.word.what.Exop = (Byte)j;
         LA    4,220(0,13) ; &r
         L     6,196(0,13) ; j
         STC   6,0(0,4)
* ***             j = i >> (w - l);
         L     4,192(0,13) ; i
         L     7,288(0,13) ; w
         S     7,204(0,13)
         SRL   4,0(7)
         ST    4,196(0,13) ; j
* ***             r.base = (uInt)(q - uÝh-1¨ - j);
         LA    6,220(0,13) ; &r
         LA    6,4(0,6)    ; offset of base in inflate_huft_s
         L     7,216(0,13) ; q
         L     8,188(0,13) ; h
         BCTR  8,0
         LA    9,228(0,13) ; &u
         SLL   8,2(0)
         LA    8,0(8,9)
         L     9,0(0,8)
         SLR   7,9
         LR    8,7
         SRA   8,2(0)
         SRL   8,29(0)
         AR    8,7
         SRA   8,3(0)
         SL    8,196(0,13)
         ST    8,0(0,6)    ; offset of base in inflate_huft_s
* ***             uÝh-1¨Ýj¨ = r;
         L     4,196(0,13) ; j
         L     5,188(0,13) ; h
         BCTR  5,0
         LA    6,228(0,13) ; &u
         SLL   5,2(0)
         LA    5,0(5,6)
         L     6,0(0,5)
         SLL   4,3(0)
         LA    4,0(4,6)
         LA    5,220(0,13) ; &r
         MVC   0(8,4),0(5)
* ***           }
* ***           else
* ***             *t = q;
         B     @L39
@L50     DS    0H
         L     2,80(0,13)
         L     3,20(0,2)   ; t
         L     4,216(0,13) ; q
         ST    4,0(0,3)    ; t
* ***         }
@L39     DS    0H
* ***         {
         L     2,200(0,13) ; k
         L     3,288(0,13) ; w
         A     3,204(0,13) ; l
         CR    2,3
         BH    @L38
* ***
* ***
* ***   r.word.what.Bits = (Byte)(k - w);
         LA    3,220(0,13) ; &r
         LA    3,1(0,3)    ; offset of Bits in 0000001
         S     2,288(0,13)
         STC   2,0(0,3)    ; offset of Bits in 0000001
* ***         if (p >= v + n)
         L     2,212(0,13) ; p
         L     3,80(0,13)
         L     4,36(0,3)   ; v
         L     5,4(0,3)    ; n
         SLL   5,2(0)
         LA    4,0(4,5)
         CR    2,4
         BL    @L52
* ***           r.word.what.Exop = 128 + 64;
         LA    4,220(0,13) ; &r
         LA    5,192(0,0)
         STC   5,0(0,4)
* ***         else if (*p < s)
         B     @L53
@L52     DS    0H
         L     2,212(0,13) ; p
         L     3,0(0,2)
         L     4,80(0,13)
         CL    3,8(0,4)
         BNL   @L54
* ***         {
* ***           r.word.what.Exop = (Byte)(*p < 256 ? 0 : 32 + 64);
         L     3,0(0,2)
         CL    3,@lit_83_16
         BNL   @@gen_label27
         LA    3,0(0,0)
         B     @@gen_label28
@@gen_label27 DS 0H
         LA    2,96(0,0)
         LR    3,2
@@gen_label28 DS 0H
         LA    2,220(0,13) ; &r
         STC   3,0(0,2)
* ***           r.base = *p++;
         L     2,212(0,13) ; p
         LR    3,2
         LA    2,4(0,2)
         ST    2,212(0,13) ; p
         LA    4,220(0,13) ; &r
         LA    4,4(0,4)    ; offset of base in inflate_huft_s
         L     5,0(0,3)
         ST    5,0(0,4)    ; offset of base in inflate_huft_s
* ***         }
* ***         else
* ***         {
         B     @L53
@L54     DS    0H
* ***           r.word.what.Exop = (Byte)(eÝ*p - s¨ + 16 + 64);
         LA    2,220(0,13) ; &r
         L     3,212(0,13) ; p
         L     4,0(0,3)
         L     5,80(0,13)
         SL    4,8(0,5)
         L     6,16(0,5)   ; e
         SLL   4,2(0)
         LA    4,0(4,6)
         L     7,0(0,4)
         AL    7,@lit_83_17
         AL    7,@lit_83_18
         STC   7,0(0,2)
* ***           r.base = dÝ*p++ - s¨;
         LR    2,3
         LA    3,4(0,3)
         ST    3,212(0,13) ; p
         LA    4,220(0,13) ; &r
         LA    4,4(0,4)    ; offset of base in inflate_huft_s
         L     7,0(0,2)
         SL    7,8(0,5)
         L     2,12(0,5)   ; d
         SLL   7,2(0)
         LA    7,0(7,2)
         L     8,0(0,7)
         ST    8,0(0,4)    ; offset of base in inflate_huft_s
* ***         }
* ***
* ***
* ***   f = 1 << (k - w);
@L53     DS    0H
         LA    2,1(0,0)
         L     3,200(0,13) ; k
         S     3,288(0,13)
         SLL   2,0(3)
         ST    2,180(0,13) ; f
* ***         for (j = i >> w; j < z; j += f)
         L     3,192(0,13) ; i
         L     4,288(0,13) ; w
         SRL   3,0(4)
         ST    3,196(0,13) ; j
         B     @L57
@L56     DS    0H
* ***           qÝj¨ = r;
         L     2,196(0,13) ; j
         L     3,216(0,13) ; q
         SLL   2,3(0)
         LA    2,0(2,3)
         LA    4,220(0,13) ; &r
         MVC   0(8,2),0(4)
         L     2,196(0,13) ; j
         AL    2,180(0,13) ; f
         ST    2,196(0,13) ; j
@L57     DS    0H
         L     2,196(0,13) ; j
         CL    2,364(0,13)
         BL    @L56
* ***
* ***
* ***   for (j = 1 << (k - 1); i & j; j >>= 1)
         LA    3,1(0,0)
         L     4,200(0,13) ; k
         BCTR  4,0
         SLL   3,0(4)
         ST    3,196(0,13) ; j
         B     @L61
@L60     DS    0H
* ***           i ¬= j;
         L     2,192(0,13) ; i
         X     2,196(0,13)
         ST    2,192(0,13) ; i
         L     3,196(0,13) ; j
         SRL   3,1(0)
         ST    3,196(0,13) ; j
@L61     DS    0H
         L     2,192(0,13) ; i
         N     2,196(0,13)
         LTR   2,2
         BNZ   @L60
* ***         i ¬= j;
         L     2,192(0,13) ; i
         X     2,196(0,13)
         ST    2,192(0,13) ; i
* ***
* ***
* ***   mask = (1 << w) - 1;
         LA    3,1(0,0)
         L     4,288(0,13) ; w
         SLL   3,0(4)
         BCTR  3,0
         ST    3,208(0,13) ; mask
* ***         while ((i & mask) != xÝh¨)
         B     @L65
@L64     DS    0H
* ***           h--;
         L     2,188(0,13) ; h
         BCTR  2,0
         ST    2,188(0,13) ; h
* ***           w -= l;
         L     3,288(0,13) ; w
         S     3,204(0,13)
         ST    3,288(0,13) ; w
* ***           mask = (1 << w) - 1;
         LA    4,1(0,0)
         SLL   4,0(3)
         BCTR  4,0
         ST    4,208(0,13) ; mask
* ***         }
@L65     DS    0H
* ***         {
         L     2,192(0,13) ; i
         N     2,208(0,13)
         L     3,188(0,13) ; h
         LA    4,292(0,13) ; &x
         SLL   3,2(0)
         LA    3,0(3,4)
         L     4,0(0,3)
         CLR   2,4
         BNE   @L64
* ***       }
@L35     DS    0H
         L     2,112(0,13) ; a
         LR    3,2
         BCTR  2,0
         ST    2,112(0,13) ; a
* ***       {
         LTR   3,3
         BNZ   @L39
* ***     }
         L     3,200(0,13) ; k
         A     3,@lit_83_1
         ST    3,200(0,13) ; k
@L31     DS    0H
         L     2,200(0,13) ; k
         C     2,184(0,13)
         BNH   @L30
* ***
* ***
* ***
* ***   return y != 0 && g != 1 ? (-5) : 0;
         L     3,360(0,13) ; y
         LTR   3,3
         BNE   *+12  Around region break
         AL    12,@lit_region_diff_83_1_2
         DROP  12
         USING @REGION_83_2,12
         B     @@gen_label37
         DROP  12
         USING @REGION_83_1,12
         L     4,184(0,13) ; g
         C     4,@lit_83_1
         BNE   *+12  Around region break
         AL    12,@lit_region_diff_83_1_2
         DROP  12
         USING @REGION_83_2,12
         B     @@gen_label37
         DROP  12
         USING @REGION_83_1,12
@@gen_label35 DS 0H
         L     2,@lit_83_21
         AL    12,@lit_region_diff_83_1_2
         DROP  12
         USING @REGION_83_2,12
         B     @@gen_label38
         DROP  12
         USING @REGION_83_1,12
@REGION_83_2 DS 0H
         DROP  12
         USING @REGION_83_2,12
@@gen_label37 DS 0H
         LA    2,0(0,0)
@@gen_label38 DS 0H
         LR    15,2
         B     @ret_lab_83
* ***   }
@ret_lab_83 DS 0H
* * **** Start of Epilogue
         #EPILOG
* * **** End of Epilogue
*
*   DSECT for automatic variables in "huftbld"
*      (FUNCTION #83)
*
@AUTO#huftbld DSECT
         DS    XL112
huftbld#a#0 DS 1F          ; a
huftbld#c#0 DS 16F         ; c
huftbld#f#0 DS 1F          ; f
huftbld#g#0 DS 1F          ; g
huftbld#h#0 DS 1F          ; h
huftbld#i#0 DS 1F          ; i
huftbld#j#0 DS 1F          ; j
huftbld#k#0 DS 1F          ; k
huftbld#l#0 DS 1F          ; l
huftbld#mask#0 DS 1F       ; mask
huftbld#p#0 DS 1A          ; p
huftbld#q#0 DS 1A          ; q
huftbld#r#0 DS 8XL1        ; r
huftbld#u#0 DS 15A         ; u
huftbld#w#0 DS 1F          ; w
huftbld#x#0 DS 16F         ; x
huftbld#xp#0 DS 1A         ; xp
huftbld#y#0 DS 1F          ; y
huftbld#z#0 DS 1F          ; z
*
@ZLIB08  CSECT
*
*
*
iftb     #PROLOG CINDEX=80,BASER=12,FRAME=192,ENTRY=YES
         ST    1,80(0,13)  ; Save ptr to incoming parm block
* ******* End of Prologue
* *
         L     2,4(0,1)
         LR    5,2
         L     6,16(0,1)
         LR    2,6
* ***     int r;
* ***     uInt hn = 0;
         LA    7,0(0,0)
         ST    7,140(0,13) ; hn
* ***     uIntf *v;
* ***
* ***   if ((v = (uIntf*)(*((z)->zalloc))((z)->opaque, (19), (sizeof(u\
* Int)))) == 0)
         LA    8,40(0,2)   ; offset of opaque in z_stream_s
         L     9,0(0,8)
         LA    8,19(0,0)
         LA    10,4(0,0)
         ST    9,152(0,13)
         ST    8,156(0,13)
         ST    10,160(0,13)
         LA    8,32(0,2)   ; offset of zalloc in z_stream_s
         L     9,0(0,8)
         LA    1,152(0,13)
         L     8,72(0,13)
         LR    15,9
         BALR  14,15
         LR    4,15        ; v
         LA    6,0(0,0)
         CR    15,6
         BNE   @L68
* ***       return (-4);
         L     15,@lit_80_31
         B     @ret_lab_80
         DS    0D
@FRAMESIZE_80  DC F'192'
@lit_80_31  DC F'-4' 0xfffffffc
@lit_80_33  DC F'-3' 0xfffffffd
@lit_80_32  DC A(huftbld)
@lit_80_34 DC XL8'96A58599A2A482A2' oversubs
         DC XL8'8399898285844084' cribed.d
         DC XL8'A895819489834082' ynamic.b
         DC XL8'89A34093859587A3' it.lengt
         DC XL8'88A240A399858500' hs.tree.
@lit_80_35  DC F'-5' 0xfffffffb
@lit_80_36 DC XL8'8995839694979385' incomple
         DC XL8'A3854084A8958194' te.dynam
         DC XL8'8983408289A34093' ic.bit.l
         DC XL8'859587A388A240A3' engths.t
         DC XL4'99858500' ree.
* ***     r = huftbld(c, 19, 19, (uIntf*)0, (uIntf*)0,
@L68     DS    0H
         L     6,80(0,13)
         L     7,0(0,6)    ; c
         LA    8,19(0,0)
         LA    9,19(0,0)
         LA    10,0(0,0)
         LA    11,0(0,0)
* ***                    tb, bb, hp, &hn, v);
         ST    7,88(0,13)
         L     7,8(0,6)    ; tb
         LR    6,5
         ST    8,92(0,13)
         L     8,80(0,13)
         ST    9,96(0,13)
         L     9,12(0,8)   ; hp
         LA    8,140(0,13) ; &hn
         ST    10,100(0,13)
         LR    10,4
         ST    11,104(0,13)
         L     11,88(0,13)
         ST    11,152(0,13)
         L     11,92(0,13)
         ST    11,156(0,13)
         L     11,96(0,13)
         ST    11,160(0,13)
         L     11,100(0,13)
         ST    11,164(0,13)
         L     11,104(0,13)
         ST    11,168(0,13)
         ST    7,172(0,13)
         ST    6,176(0,13)
         ST    9,180(0,13)
         ST    8,184(0,13)
         ST    10,188(0,13)
         LA    1,152(0,13)
         L     15,@lit_80_32 ; huftbld
         BALR  14,15
         LR    3,15        ; r
* ***     if (r == (-3))
         C     3,@lit_80_33
         BNE   @L69
* ***       z->msg = (char*)"oversubscribed dynamic bit lengths tree";
         LA    6,24(0,2)   ; offset of msg in z_stream_s
         LA    7,@lit_80_34
         ST    7,0(0,6)    ; offset of msg in z_stream_s
* ***     else if (r == (-5) || *bb == 0)
         B     @L70
@L69     DS    0H
         C     3,@lit_80_35
         BE    @@gen_label41
         L     6,0(0,5)
         LTR   6,6
         BNE   @L70
@@gen_label41 DS 0H
* ***     {
* ***       z->msg = (char*)"incomplete dynamic bit lengths tree";
         LA    6,24(0,2)   ; offset of msg in z_stream_s
         LA    7,@lit_80_36
         ST    7,0(0,6)    ; offset of msg in z_stream_s
* ***       r = (-3);
         L     3,@lit_80_33 ; r
* ***     }
* ***     (*((z)->zfree))((z)->opaque, (voidpf)(v));
@L70     DS    0H
         LA    6,40(0,2)   ; offset of opaque in z_stream_s
         L     7,0(0,6)
         LR    6,4
         ST    7,152(0,13)
         ST    6,156(0,13)
         LA    6,36(0,2)   ; offset of zfree in z_stream_s
         L     7,0(0,6)
         LA    1,152(0,13)
         L     6,72(0,13)
         LR    15,7
         BALR  14,15
* ***     return r;
         LR    15,3
         B     @ret_lab_80
* ***   }
@ret_lab_80 DS 0H
* * **** Start of Epilogue
         #EPILOG
* * **** End of Epilogue
*
*   DSECT for automatic variables in "iftb"
*      (FUNCTION #80)
*
@AUTO#iftb DSECT
         DS    XL136
iftb#r#0 DS    1F          ; r
iftb#hn#0 DS   1F          ; hn
iftb#v#0 DS    1A          ; v
*
@ZLIB08  CSECT
*
*
*
iftd     #PROLOG CINDEX=81,BASER=12,FRAME=192,ENTRY=YES
         ST    1,80(0,13)  ; Save ptr to incoming parm block
* ******* End of Prologue
* *
         L     2,0(0,1)
         LR    5,2
         L     6,32(0,1)
         LR    3,6
* ***     int r;
* ***     uInt hn = 0;
         LA    7,0(0,0)
         ST    7,140(0,13) ; hn
* ***     uIntf *v;
* ***
* ***
* ***   if ((v = (uIntf*)(*((z)->zalloc))((z)->opaque, (288), (sizeof(\
* uInt)))) == 0)
         LA    8,40(0,3)   ; offset of opaque in z_stream_s
         L     9,0(0,8)
         LA    8,288(0,0)
         LA    10,4(0,0)
         ST    9,152(0,13)
         ST    8,156(0,13)
         ST    10,160(0,13)
         LA    8,32(0,3)   ; offset of zalloc in z_stream_s
         L     9,0(0,8)
         LA    1,152(0,13)
         L     8,72(0,13)
         LR    15,9
         BALR  14,15
         LR    4,15        ; v
         LA    6,0(0,0)
         CR    15,6
         BNE   @L72
* ***       return (-4);
         L     15,@lit_81_39
         B     @ret_lab_81
         DS    0D
@FRAMESIZE_81  DC F'192'
@lit_81_39  DC F'-4' 0xfffffffc
@lit_81_41  DC A(huftbld)
@lit_81_40  DC A(@DATA)
@lit_81_42  DC F'-3' 0xfffffffd
@lit_81_43 DC XL8'96A58599A2A482A2' oversubs
         DC XL8'8399898285844093' cribed.l
         DC XL8'89A3859981936193' iteral.l
         DC XL8'859587A38840A399' ength.tr
         DC XL3'858500' ee.
         DC    X'00'
@lit_81_45 DC XL8'8995839694979385' incomple
         DC XL8'A385409389A38599' te.liter
         DC XL8'81936193859587A3' al.lengt
         DC XL7'8840A399858500' h.tree.
         DC    X'00'
@lit_81_49  DC F'257' 0x00000101
@lit_81_51 DC XL8'96A58599A2A482A2' oversubs
         DC XL8'8399898285844084' cribed.d
         DC XL8'89A2A38195838540' istance.
         DC XL5'A399858500' tree.
         DC    X'00'
@lit_81_52  DC F'-5' 0xfffffffb
@lit_81_53 DC XL8'8995839694979385' incomple
         DC XL8'A385408489A2A381' te.dista
         DC XL8'95838540A3998585' nce.tree
         DC X'00' .
         DC    X'00'
@lit_81_56 DC XL8'859497A3A8408489' empty.di
         DC XL8'A2A38195838540A3' stance.t
         DC XL8'99858540A689A388' ree.with
         DC XL8'4093859587A388A2' .lengths
         DC X'00' .
         DC    X'00'
* ***
* ***
* ***   r = huftbld(c, nl, 257, cplens, cplext, tl, bl, hp, &hn, v);
@L72     DS    0H
         L     6,80(0,13)
         L     7,8(0,6)    ; c
         LR    8,5
         LA    9,257(0,0)
         L     10,@lit_81_40
         LA    11,48(0,10) ; cplens
         LA    6,172(0,10) ; cplext
         L     10,80(0,13)
         ST    7,88(0,13)
         L     7,20(0,10)  ; tl
         ST    8,92(0,13)
         L     8,12(0,10)  ; bl
         ST    9,96(0,13)
         L     9,28(0,10)  ; hp
         LA    10,140(0,13) ; &hn
         ST    11,100(0,13)
         LR    11,4
         ST    6,104(0,13)
         L     6,88(0,13)
         ST    6,152(0,13)
         L     6,92(0,13)
         ST    6,156(0,13)
         L     6,96(0,13)
         ST    6,160(0,13)
         L     6,100(0,13)
         ST    6,164(0,13)
         L     6,104(0,13)
         STM   6,11,168(13)
         LA    1,152(0,13)
         L     15,@lit_81_41 ; huftbld
         BALR  14,15
         LR    2,15        ; r
* ***     if (r != 0 || *bl == 0)
         LTR   2,2
         BNE   @@gen_label44
         L     6,80(0,13)
         L     7,12(0,6)   ; bl
         L     8,0(0,7)
         LTR   8,8
         BNE   @L73
@@gen_label44 DS 0H
* ***     {
* ***       if (r == (-3))
         C     2,@lit_81_42
         BNE   @L74
* ***         z->msg = (char*)"oversubscribed literal/length tree";
         LA    6,24(0,3)   ; offset of msg in z_stream_s
         LA    7,@lit_81_43
         ST    7,0(0,6)    ; offset of msg in z_stream_s
* ***       else if (r != (-4))
         B     @L75
@L74     DS    0H
         C     2,@lit_81_39
         BE    @L75
* ***       {
* ***         z->msg = (char*)"incomplete literal/length tree";
         LA    6,24(0,3)   ; offset of msg in z_stream_s
         LA    7,@lit_81_45
         ST    7,0(0,6)    ; offset of msg in z_stream_s
* ***         r = (-3);
         L     2,@lit_81_42 ; r
* ***       }
* ***       (*((z)->zfree))((z)->opaque, (voidpf)(v));
@L75     DS    0H
         LA    6,40(0,3)   ; offset of opaque in z_stream_s
         L     7,0(0,6)
         LR    6,4
         ST    7,152(0,13)
         ST    6,156(0,13)
         LA    6,36(0,3)   ; offset of zfree in z_stream_s
         L     7,0(0,6)
         LA    1,152(0,13)
         L     6,72(0,13)
         LR    15,7
         BALR  14,15
* ***       return r;
         LR    15,2
         B     @ret_lab_81
* ***     }
* ***
* ***
* ***   r = huftbld(c + nl, nd, 0, cpdist, cpdext, td, bd, hp, &hn, v)\
* ;
@L73     DS    0H
         L     6,80(0,13)
         L     7,8(0,6)    ; c
         LR    8,5
         SLL   8,2(0)
         LA    7,0(7,8)
         LA    8,0(0,0)
         L     9,@lit_81_40
         LA    10,296(0,9) ; cpdist
         LA    11,416(0,9) ; cpdext
         L     9,24(0,6)   ; td
         ST    7,88(0,13)
         L     7,16(0,6)   ; bd
         ST    8,92(0,13)
         L     8,28(0,6)   ; hp
         ST    6,96(0,13)
         LA    6,140(0,13) ; &hn
         ST    10,100(0,13)
         LR    10,4
         ST    11,104(0,13)
         L     11,88(0,13)
         ST    11,152(0,13)
         L     11,96(0,13)
         MVC   156(4,13),4(11)
         L     11,92(0,13)
         ST    11,160(0,13)
         L     11,100(0,13)
         ST    11,164(0,13)
         L     11,104(0,13)
         ST    11,168(0,13)
         ST    9,172(0,13)
         STM   7,8,176(13)
         ST    6,184(0,13)
         ST    10,188(0,13)
         LA    1,152(0,13)
         L     15,@lit_81_41 ; huftbld
         BALR  14,15
         LR    2,15        ; r
* ***     if (r != 0 || (*bd == 0 && nl > 257))
         LTR   2,2
         BNE   @@gen_label48
         L     6,80(0,13)
         L     7,16(0,6)   ; bd
         L     8,0(0,7)
         LTR   8,8
         BNE   @L77
         LR    8,5
         CL    8,@lit_81_49
         BNH   @L77
@@gen_label48 DS 0H
* ***     {
* ***       if (r == (-3))
         C     2,@lit_81_42
         BNE   @L78
* ***         z->msg = (char*)"oversubscribed distance tree";
         LA    6,24(0,3)   ; offset of msg in z_stream_s
         LA    7,@lit_81_51
         ST    7,0(0,6)    ; offset of msg in z_stream_s
* ***       else if (r == (-5)) {
         B     @L79
@L78     DS    0H
         C     2,@lit_81_52
         BNE   @L80
* ***
* ***
* ***
* ***
* ***   z->msg = (char*)"incomplete distance tree";
         LA    6,24(0,3)   ; offset of msg in z_stream_s
         LA    7,@lit_81_53
         ST    7,0(0,6)    ; offset of msg in z_stream_s
* ***         r = (-3);
         L     2,@lit_81_42 ; r
* ***       }
* ***       else if (r != (-4))
         B     @L79
@L80     DS    0H
         C     2,@lit_81_39
         BE    @L79
* ***       {
* ***         z->msg = (char*)"empty distance tree with lengths";
         LA    6,24(0,3)   ; offset of msg in z_stream_s
         LA    7,@lit_81_56
         ST    7,0(0,6)    ; offset of msg in z_stream_s
* ***         r = (-3);
         L     2,@lit_81_42 ; r
* ***       }
* ***       (*((z)->zfree))((z)->opaque, (voidpf)(v));
@L79     DS    0H
         LA    6,40(0,3)   ; offset of opaque in z_stream_s
         L     7,0(0,6)
         LR    6,4
         ST    7,152(0,13)
         ST    6,156(0,13)
         LA    6,36(0,3)   ; offset of zfree in z_stream_s
         L     7,0(0,6)
         LA    1,152(0,13)
         L     6,72(0,13)
         LR    15,7
         BALR  14,15
* ***       return r;
         LR    15,2
         B     @ret_lab_81
* ***
* ***   }
* ***
* ***
* ***   (*((z)->zfree))((z)->opaque, (voidpf)(v));
@L77     DS    0H
         LA    6,40(0,3)   ; offset of opaque in z_stream_s
         L     7,0(0,6)
         LR    6,4
         ST    7,152(0,13)
         ST    6,156(0,13)
         LA    6,36(0,3)   ; offset of zfree in z_stream_s
         L     7,0(0,6)
         LA    1,152(0,13)
         L     6,72(0,13)
         LR    15,7
         BALR  14,15
* ***     return 0;
         LA    15,0(0,0)
         B     @ret_lab_81
* ***   }
@ret_lab_81 DS 0H
* * **** Start of Epilogue
         #EPILOG
* * **** End of Epilogue
*
*   DSECT for automatic variables in "iftd"
*      (FUNCTION #81)
*
@AUTO#iftd DSECT
         DS    XL136
iftd#r#0 DS    1F          ; r
iftd#hn#0 DS   1F          ; hn
iftd#v#0 DS    1A          ; v
*
@ZLIB08  CSECT
*
*
*
iftf     #PROLOG CINDEX=82,BASER=12,FRAME=96,ENTRY=YES
         ST    1,80(0,13)  ; Save ptr to incoming parm block
* ******* End of Prologue
* *
         L     2,0(0,1)
         LR    5,2
         L     3,4(0,1)
         LR    4,3
         L     6,8(0,1)
         LR    3,6
         L     7,12(0,1)
         LR    2,7
* ***   # 449
* ***     # 450
* ***   *bl = fixed_bl;
         LR    8,5         ; fixed_bl
         L     9,@lit_82_59
         L     10,536(0,9) ; fixed_bl
         ST    10,0(0,8)   ; bl
* ***     *bd = fixed_bd;
         LR    8,4         ; fixed_bd
         L     10,540(0,9) ; fixed_bd
         ST    10,0(0,8)   ; bd
* ***     *tl = fixed_tl;
         LR    8,3         ; fixed_tl
         LA    10,544(0,9) ; fixed_tl
         ST    10,0(0,8)   ; tl
* ***     *td = fixed_td;
         LR    6,2         ; fixed_td
         L     7,@lit_82_60
         LA    8,544(0,7)  ; fixed_td
         ST    8,0(0,6)    ; td
* ***     return 0;
         LA    15,0(0,0)
         B     @ret_lab_82
         DS    0D
@lit_82_60  DC A(@DATA+4096)
@lit_82_59  DC A(@DATA)
@FRAMESIZE_82  DC F'96'
* ***   }
@ret_lab_82 DS 0H
* * **** Start of Epilogue
         #EPILOG
* * **** End of Epilogue
*
*   DSECT for automatic variables in "iftf"
*      (FUNCTION #82)
*
@AUTO#iftf DSECT
         DS    XL96
*
@ZLIB08  CSECT
*
*  Non-Re-Entrant Data Section
*
@ZLIB08 CSECT
@DATA    DS 0D
         ENTRY ifcrite
ifcrite  DC    X'408995869381A38540F14BF14BF340C3' .inflate.1.1.3.C
         DC    X'9697A899898788A340F1F9F9F560F1F9' opyright.1995.19
         DC    X'F9F840D481999240C18493859940'     98.Mark.Adler.
         DC    2X'00'
         DC    X'00000003000000040000000500000006' ................
         DC    X'0000000700000008000000090000000A' ................
         DC    X'0000000B0000000D0000000F00000011' ................
         DC    X'00000013000000170000001B0000001F' ................
         DC    X'000000230000002B000000330000003B' ................
         DC    X'00000043000000530000006300000073' ................
         DC    X'00000083000000A3000000C3000000E3' ...c...t...C...T
         DC    X'00000102'                         ....
         DC    40X'00'
         DC    X'00000001000000010000000100000001' ................
         DC    X'00000002000000020000000200000002' ................
         DC    X'00000003000000030000000300000003' ................
         DC    X'00000004000000040000000400000004' ................
         DC    X'00000005000000050000000500000005' ................
         DC    4X'00'
         DC    X'00000070000000700000000100000002' ................
         DC    X'00000003000000040000000500000007' ................
         DC    X'000000090000000D0000001100000019' ................
         DC    X'00000021000000310000004100000061' ................
         DC    X'00000081000000C10000010100000181' ...a...A.......a
         DC    X'00000201000003010000040100000601' ................
         DC    X'0000080100000C010000100100001801' ................
         DC    X'00002001000030010000400100006001' ................
         DC    16X'00'
         DC    X'00000001000000010000000200000002' ................
         DC    X'00000003000000030000000400000004' ................
         DC    X'00000005000000050000000600000006' ................
         DC    X'00000007000000070000000800000008' ................
         DC    X'00000009000000090000000A0000000A' ................
         DC    X'0000000B0000000B0000000C0000000C' ................
         DC    X'0000000D0000000D0000000900000005' ................
         DC    X'6007'                             ..
         DC    2X'00'
         DC    X'00000100'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000050'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000105408'                     ......
         DC    2X'00'
         DC    X'000000735207'                     ......
         DC    2X'00'
         DC    X'0000001F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000070'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000030'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000C05007'                     ......
         DC    2X'00'
         DC    X'0000000A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000060'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000020'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000A0'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    7X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000080'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000040'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000E05007'                     ......
         DC    2X'00'
         DC    X'00000006'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000058'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000018'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000905307'                     ......
         DC    2X'00'
         DC    X'0000003B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000078'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000038'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000D05107'                     ......
         DC    2X'00'
         DC    X'00000011'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000068'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000028'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000B0'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000008'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000088'                         ...h
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000048'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000F05007'                     ...0..
         DC    2X'00'
         DC    X'00000004'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000054'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000145508'                     ......
         DC    2X'00'
         DC    X'000000E35307'                     ...T..
         DC    2X'00'
         DC    X'0000002B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000074'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000034'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000C85107'                     ...H..
         DC    2X'00'
         DC    X'0000000D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000064'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000024'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000A8'                         ...y
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000004'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000084'                         ...d
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000044'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000E85007'                     ...Y..
         DC    2X'00'
         DC    X'00000008'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005C'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001C'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000985407'                     ...q..
         DC    2X'00'
         DC    X'00000053'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007C'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003C'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000D85207'                     ...Q..
         DC    2X'00'
         DC    X'00000017'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006C'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002C'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000B8'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000C'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008C'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004C'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000F85007'                     ...8..
         DC    2X'00'
         DC    X'00000003'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000052'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000125508'                     ......
         DC    2X'00'
         DC    X'000000A35307'                     ...t..
         DC    2X'00'
         DC    X'00000023'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000072'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000032'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000C45107'                     ...D..
         DC    2X'00'
         DC    X'0000000B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000062'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000022'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000A4'                         ...u
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000002'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000082'                         ...b
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000042'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000E45007'                     ...U..
         DC    2X'00'
         DC    X'00000007'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001A'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000945407'                     ...m..
         DC    2X'00'
         DC    X'00000043'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003A'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000D45207'                     ...M..
         DC    2X'00'
         DC    X'00000013'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002A'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000B4'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004A'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000F45007'                     ...4..
         DC    2X'00'
         DC    X'00000005'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000056'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000016C008'                     ......
         DC    6X'00'
         DC    X'5307'                             ..
         DC    2X'00'
         DC    X'00000033'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000076'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000036'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000CC5107'                     ......
         DC    2X'00'
         DC    X'0000000F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000066'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000026'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000AC'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000006'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000086'                         ...f
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000046'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000EC5007'                     ......
         DC    2X'00'
         DC    X'00000009'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005E'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001E'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'0000009C5407'                     ......
         DC    2X'00'
         DC    X'00000063'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007E'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003E'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000DC5207'                     ......
         DC    2X'00'
         DC    X'0000001B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006E'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002E'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000BC'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000E'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008E'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004E'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000FC6007'                     ......
         DC    2X'00'
         DC    X'00000100'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000051'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000115508'                     ......
         DC    2X'00'
         DC    X'000000835207'                     ...c..
         DC    2X'00'
         DC    X'0000001F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000071'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000031'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000C25007'                     ...B..
         DC    2X'00'
         DC    X'0000000A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000061'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000021'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000A2'                         ...s
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000001'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000081'                         ...a
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000041'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000E25007'                     ...S..
         DC    2X'00'
         DC    X'00000006'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000059'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000019'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000925307'                     ...k..
         DC    2X'00'
         DC    X'0000003B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000079'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000039'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000D25107'                     ...K..
         DC    2X'00'
         DC    X'00000011'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000069'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000029'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000B2'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000009'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000089'                         ...i
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000049'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000F25007'                     ...2..
         DC    2X'00'
         DC    X'00000004'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000055'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000155008'                     ......
         DC    2X'00'
         DC    X'000001025307'                     ......
         DC    2X'00'
         DC    X'0000002B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000075'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000035'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000CA5107'                     ......
         DC    2X'00'
         DC    X'0000000D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000065'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000025'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000AA'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000005'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000085'                         ...e
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000045'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000EA5007'                     ......
         DC    2X'00'
         DC    X'00000008'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001D'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'0000009A5407'                     ......
         DC    2X'00'
         DC    X'00000053'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003D'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000DA5207'                     ......
         DC    2X'00'
         DC    X'00000017'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002D'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000BA'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004D'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000FA5007'                     ......
         DC    2X'00'
         DC    X'00000003'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000053'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000135508'                     ......
         DC    2X'00'
         DC    X'000000C35307'                     ...C..
         DC    2X'00'
         DC    X'00000023'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000073'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000033'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000C65107'                     ...F..
         DC    2X'00'
         DC    X'0000000B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000063'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000023'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000A6'                         ...w
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000003'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000083'                         ...c
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000043'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000E65007'                     ...W..
         DC    2X'00'
         DC    X'00000007'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001B'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000965407'                     ...o..
         DC    2X'00'
         DC    X'00000043'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003B'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000D65207'                     ...O..
         DC    2X'00'
         DC    X'00000013'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002B'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000B6'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004B'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000F65007'                     ...6..
         DC    2X'00'
         DC    X'00000005'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000057'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000017C008'                     ......
         DC    6X'00'
         DC    X'5307'                             ..
         DC    2X'00'
         DC    X'00000033'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000077'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000037'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000CE5107'                     ......
         DC    2X'00'
         DC    X'0000000F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000067'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000027'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000AE'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000007'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000087'                         ...g
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000047'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000EE5007'                     ......
         DC    2X'00'
         DC    X'00000009'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001F'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'0000009E5407'                     ......
         DC    2X'00'
         DC    X'00000063'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003F'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000DE5207'                     ......
         DC    2X'00'
         DC    X'0000001B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002F'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000BE'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004F'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000FE6007'                     ......
         DC    2X'00'
         DC    X'00000100'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000050'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000105408'                     ......
         DC    2X'00'
         DC    X'000000735207'                     ......
         DC    2X'00'
         DC    X'0000001F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000070'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000030'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000C15007'                     ...A..
         DC    2X'00'
         DC    X'0000000A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000060'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000020'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000A1'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    7X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000080'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000040'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000E15007'                     ......
         DC    2X'00'
         DC    X'00000006'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000058'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000018'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000915307'                     ...j..
         DC    2X'00'
         DC    X'0000003B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000078'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000038'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000D15107'                     ...J..
         DC    2X'00'
         DC    X'00000011'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000068'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000028'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000B1'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000008'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000088'                         ...h
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000048'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000F15007'                     ...1..
         DC    2X'00'
         DC    X'00000004'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000054'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000145508'                     ......
         DC    2X'00'
         DC    X'000000E35307'                     ...T..
         DC    2X'00'
         DC    X'0000002B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000074'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000034'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000C95107'                     ...I..
         DC    2X'00'
         DC    X'0000000D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000064'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000024'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000A9'                         ...z
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000004'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000084'                         ...d
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000044'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000E95007'                     ...Z..
         DC    2X'00'
         DC    X'00000008'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005C'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001C'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000995407'                     ...r..
         DC    2X'00'
         DC    X'00000053'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007C'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003C'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000D95207'                     ...R..
         DC    2X'00'
         DC    X'00000017'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006C'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002C'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000B9'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000C'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008C'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004C'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000F95007'                     ...9..
         DC    2X'00'
         DC    X'00000003'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000052'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000125508'                     ......
         DC    2X'00'
         DC    X'000000A35307'                     ...t..
         DC    2X'00'
         DC    X'00000023'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000072'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000032'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000C55107'                     ...E..
         DC    2X'00'
         DC    X'0000000B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000062'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000022'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000A5'                         ...v
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000002'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000082'                         ...b
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000042'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000E55007'                     ...V..
         DC    2X'00'
         DC    X'00000007'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001A'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000955407'                     ...n..
         DC    2X'00'
         DC    X'00000043'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003A'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000D55207'                     ...N..
         DC    2X'00'
         DC    X'00000013'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002A'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000B5'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004A'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000F55007'                     ...5..
         DC    2X'00'
         DC    X'00000005'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000056'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000016C008'                     ......
         DC    6X'00'
         DC    X'5307'                             ..
         DC    2X'00'
         DC    X'00000033'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000076'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000036'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000CD5107'                     ......
         DC    2X'00'
         DC    X'0000000F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000066'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000026'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000AD'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000006'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000086'                         ...f
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000046'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000ED5007'                     ......
         DC    2X'00'
         DC    X'00000009'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005E'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001E'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'0000009D5407'                     ......
         DC    2X'00'
         DC    X'00000063'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007E'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003E'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000DD5207'                     ......
         DC    2X'00'
         DC    X'0000001B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006E'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002E'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000BD'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000E'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008E'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004E'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000FD6007'                     ......
         DC    2X'00'
         DC    X'00000100'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000051'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000115508'                     ......
         DC    2X'00'
         DC    X'000000835207'                     ...c..
         DC    2X'00'
         DC    X'0000001F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000071'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000031'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000C35007'                     ...C..
         DC    2X'00'
         DC    X'0000000A'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000061'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000021'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000A3'                         ...t
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000001'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000081'                         ...a
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000041'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000E35007'                     ...T..
         DC    2X'00'
         DC    X'00000006'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000059'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000019'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000935307'                     ...l..
         DC    2X'00'
         DC    X'0000003B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000079'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000039'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000D35107'                     ...L..
         DC    2X'00'
         DC    X'00000011'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000069'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000029'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000B3'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000009'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000089'                         ...i
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000049'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000F35007'                     ...3..
         DC    2X'00'
         DC    X'00000004'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000055'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000155008'                     ......
         DC    2X'00'
         DC    X'000001025307'                     ......
         DC    2X'00'
         DC    X'0000002B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000075'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000035'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000CB5107'                     ......
         DC    2X'00'
         DC    X'0000000D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000065'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000025'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000AB'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000005'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000085'                         ...e
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000045'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000EB5007'                     ......
         DC    2X'00'
         DC    X'00000008'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001D'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'0000009B5407'                     ......
         DC    2X'00'
         DC    X'00000053'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003D'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000DB5207'                     ......
         DC    2X'00'
         DC    X'00000017'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002D'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000BB'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008D'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004D'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000FB5007'                     ......
         DC    2X'00'
         DC    X'00000003'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000053'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'000000135508'                     ......
         DC    2X'00'
         DC    X'000000C35307'                     ...C..
         DC    2X'00'
         DC    X'00000023'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000073'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000033'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000C75107'                     ...G..
         DC    2X'00'
         DC    X'0000000B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000063'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000023'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000A7'                         ...x
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000003'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000083'                         ...c
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000043'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000E75007'                     ...X..
         DC    2X'00'
         DC    X'00000007'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001B'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000975407'                     ...p..
         DC    2X'00'
         DC    X'00000043'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003B'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000D75207'                     ...P..
         DC    2X'00'
         DC    X'00000013'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002B'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000B7'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004B'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000F75007'                     ...7..
         DC    2X'00'
         DC    X'00000005'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000057'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000017C008'                     ......
         DC    6X'00'
         DC    X'5307'                             ..
         DC    2X'00'
         DC    X'00000033'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000077'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000037'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000CF5107'                     ......
         DC    2X'00'
         DC    X'0000000F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000067'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000027'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000AF'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000007'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000087'                         ...g
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'00000047'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000EF5007'                     ......
         DC    2X'00'
         DC    X'00000009'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000005F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000001F'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'0000009F5407'                     ......
         DC    2X'00'
         DC    X'00000063'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000007F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000003F'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000DF5207'                     ......
         DC    2X'00'
         DC    X'0000001B'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000006F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000002F'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000BF'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000000F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000008F'                         ....
         DC    1X'00'
         DC    X'08'                               .
         DC    2X'00'
         DC    X'0000004F'                         ....
         DC    1X'00'
         DC    X'09'                               .
         DC    2X'00'
         DC    X'000000FF5005'                     ......
         DC    2X'00'
         DC    X'000000015705'                     ......
         DC    2X'00'
         DC    X'000001015305'                     ......
         DC    2X'00'
         DC    X'000000115B05'                     ......
         DC    2X'00'
         DC    X'000010015105'                     ......
         DC    2X'00'
         DC    X'000000055905'                     ......
         DC    2X'00'
         DC    X'000004015505'                     ......
         DC    2X'00'
         DC    X'000000415D05'                     ......
         DC    2X'00'
         DC    X'000040015005'                     ......
         DC    2X'00'
         DC    X'000000035805'                     ......
         DC    2X'00'
         DC    X'000002015405'                     ......
         DC    2X'00'
         DC    X'000000215C05'                     ......
         DC    2X'00'
         DC    X'000020015205'                     ......
         DC    2X'00'
         DC    X'000000095A05'                     ......
         DC    2X'00'
         DC    X'000008015605'                     ......
         DC    2X'00'
         DC    X'00000081C005'                     ...a..
         DC    2X'00'
         DC    X'000060015005'                     ......
         DC    2X'00'
         DC    X'000000025705'                     ......
         DC    2X'00'
         DC    X'000001815305'                     ...a..
         DC    2X'00'
         DC    X'000000195B05'                     ......
         DC    2X'00'
         DC    X'000018015105'                     ......
         DC    2X'00'
         DC    X'000000075905'                     ......
         DC    2X'00'
         DC    X'000006015505'                     ......
         DC    2X'00'
         DC    X'000000615D05'                     ......
         DC    2X'00'
         DC    X'000060015005'                     ......
         DC    2X'00'
         DC    X'000000045805'                     ......
         DC    2X'00'
         DC    X'000003015405'                     ......
         DC    2X'00'
         DC    X'000000315C05'                     ......
         DC    2X'00'
         DC    X'000030015205'                     ......
         DC    2X'00'
         DC    X'0000000D5A05'                     ......
         DC    2X'00'
         DC    X'00000C015605'                     ......
         DC    2X'00'
         DC    X'000000C1C005'                     ...A..
         DC    2X'00'
         DC    X'00006001'                         ....
*
         END
