//TSOTESTA PROC
//TSOTESTA EXEC PGM=IKJEFT01,
//             DYNAMNBR=200,
//             PARM='%STARTUP'
//*
//*            SYSPROC
//*
//STEPLIB  DD  DISP=SHR,DSN=SYS2.AUTHLIB
//SYSPROC  DD  DISP=SHR,DSN=SYS1.ISRCLIB
//*
//*            OTHER BITS
//*
//SYSIN    DD  TERM=TS
//SYSPRINT DD  TERM=TS,SYSOUT=*
//*
