)BODY
%PERSONAL USERIDS UTILITIES - Main Menu (HELP) ---------------------------------
%COMMAND ===>_ZCMD                                                            +
%
+     ISPF option%S.PU+has been set up to help with migration to%personal IDs+
+     on TSO. It will be extended as new facilities are written. There are help
+     screens with the individual options. Options available are:
%
%     1+ Display all%RACF+groups you belong to. You can change your default if
+        you belong to more than one TSO project.
%
%     2+ Dataset renaming utility. Rename datasets with a prefix of
%        <old-project>.<old-user>+to a prefix of%<new-project>.<new-user>+
%
%     3+ Change your ISPF account code variable in-flight.%NB+this change will
+        only last for the duration of your TSO session.
%
%     4+ Set up an ISPF profile for a new user based on an existing profile
%
%
)INIT
  &ZCMD = &Z
  /*******************************************************************/
  /*                                                                 */
  /* PANEL       : TSPU                                              */
  /*                                                                 */
  /* AUTHOR      : Richard Haydock                                   */
  /*                                                                 */
  /* LAST UPDATE : 09/09/92                                          */
  /*                                                                 */
  /* PURPOSE     : Help panel for SPU                                */
  /*                                                                 */
  /* COMMENTS    : Part of ISPF S.PU                                 */
  /*                                                                 */
  /*******************************************************************/
)PROC
)END
