//MKT01RES JOB 000000000000,'CONNECT DIRECT      ',CLASS=C,MSGCLASS=C,
//  NOTIFY=&SYSUID
//*
//*      *************************************************************
//*      *                                                           *
//*      * JOB NAME: STARO.                                          *
//*      *                                                           *
//*      * Purpose:  Extract only RO type records.                   *
//*      *                                                           *
//*      * Date Written: October 2020.                               *
//*      *                                                           *
//*      * Programmer:   John Bradley.                               *
//*      *                                                           *
//*      * Copyright (c) Meerkat Computer Services Limited.          *
//*      *                                                           *
//*      *************************************************************
//*
//JCLLIB1    JCLLIB  ORDER=SUPPLIED.PROCLIB
//*
//INCLUDE1   INCLUDE MEMBER=CDPARMS
//*
//STEP1       EXEC  CDJCL
//TEMPDSN     DD    DSN=&HLQSTAT..ROX,
//            DISP=(NEW,CATLG),
//            UNIT=3390,
//            SPACE=(CYL,(100,100),RLSE),
//            DCB=(DSORG=PS,RECFM=VBA,LRECL=4100,BLKSIZE=0)
//DMBATCH.SYSIN DD  *,SYMBOLS=JCLONLY
  SIGNON TMPDD=TEMPDSN
  SELECT STATISTICS WHERE (TYPE=RO EXCLUDE=(WTO,MEMB)) FILE
  SIGNOFF
/*
//
