)ATTR DEFAULT(%+_)
       %   TYPE(TEXT)   INTENS(HIGH)
       +   TYPE(TEXT)   INTENS(LOW)
       $   TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW)
)BODY
%TUTORIAL ------------------ $REASID   +$REASVR % -------------------- %TUTORIAL
%OPTION  ===>_ZCMD                                                             +

%                     +-------------------------------+
                      |  INTERACTIVE    DISASSEMBLER  |
                      |          MARK  NAMES          |
                      +-------------------------------+
+
  Reasm lets you mark points of project. Later you may "point" project to
desired offset using primary command%LOCATE+or through the mark table. Once you
entered primary command%MARK+ without operands the mark table appears on the
screen.

  You can scroll mark table to find the appropriate mark name and then select
it by "S" at the first position. Project will be pointed to the corresponding
offset.



  The following topic will be presented only if selected by number:
   %1+- Reasm primary commands

)PROC
   &ZSEL = TRANS(&ZCMD
                1,*REAPR000
                )

&ZUP   = REA00000
)END
