)ATTR DEFAULT(%+_)
       %   TYPE(TEXT)   INTENS(HIGH)
       +   TYPE(TEXT)   INTENS(LOW)
       $   TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW)
)BODY
%TUTORIAL ------------------ $REASID   +$REASVR % -------------------- %TUTORIAL
%OPTION  ===>_ZCMD                                                             +

+
  Basic commands are most popular and useful REASM commands. They make it
possible to basically prepare project.

  The following topics are presented in sequence, or may be selected by number:

  %USING      + - Set     the base register
  %DROP       + - Delete  the base register
  %RETRANSLATE+ - Convert data to commands

)PROC
   &ZSEL = TRANS(&ZCMD
                USING,       REAPRU00
                DROP,        REAPRD00
                RETRANSLATE, REAPRR00
                )
&ZUP   = REA00000
)END
