)ATTR DEFAULT(%+_)
       %   TYPE(TEXT)   INTENS(HIGH)
       +   TYPE(TEXT)   INTENS(LOW)
       $   TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW)
)BODY
%TUTORIAL ------------------ $REASID   +$REASVR % -------------------- %TUTORIAL
%OPTION  ===>_ZCMD                                                             +

%                      'RETRANSLATE+ primary command
+                      -----------------------------

  Primary command%RETRANSLATE+allows you convert text of project to command
presentation. During retranslation Reasm performs a lot of automatic actions to
make project text maximum readable.

  Format of the RETRANSLATE command is:

 %R{ETRANSLATE} {Offset} {G{LOBAL}}+

  - First operand%Offset+may define the offset in project where to start
    from. If it is ommited then offset of first row of the screen is assumed.

  - Second operand%GLOBAL+may define where to stop. Default assumption
    is%NONGLOBAL+. In this case Reasm will stop retranslate process at first
    non-command part of text. If GLOBAL was specified then Reasm will try skip
    this piece and continue the process up to end of the text.

                        ( continued on next page )

)PROC
&ZCONT = REAPRR01
&ZUP   = REA00000
)END
