)ATTR DEFAULT(%+_)
       %   TYPE(TEXT)   INTENS(HIGH)
       +   TYPE(TEXT)   INTENS(LOW)
       $   TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW)
)BODY
%TUTORIAL ------------------ $REASID   +$REASVR % -------------------- %TUTORIAL
%OPTION  ===>_ZCMD                                                             +

%                      'AUTO'   primary command
+                      ------------------------

   Primary command%AUTO+allows you enable or disable Reasm automatic actions.
   The format of AUTO command is:

  %A{UTO} ON/OFF+

   AUTO OFF is useful in case you feel REASM is 'too smart' and you prefer to
have the full manual control on all the project changes.


   Examples:
  %AUTO    OFF+- Disable auto actions
  %A        ON+- Enable  auto actions

)PROC
&ZUP   = REA00000
)END
