//PMIS20D  JOB (8231,'rmm and catalog backups'),
//             'catalog backups',
//             CLASS=x,
//             MSGCLASS=x,
//*            RESTART=J010.S030,
//*            TYPRUN=SCAN,
//             MSGLEVEL=(1,1)
//J010     EXEC MIS20,
//             YMDX=001206,        * these symbolics are updated by
//             RUNX=01               JMIS20D job / MIS10 proc
