       FD  INFILE
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 0.

      *    RECORD CONTAINS ## TO ##
      *    RECORDING MODE V.

      *********************************
      **** ALTER: RECORD LENGTH: USE IF SEQUENTIAL
       01  INFILE-RCD.
           05  FILLER                  PIC  X(0080).

      *********************************
      **** ALTER: RECORD LENGTH: USE IF INDEXED
      *01  INFILE-RCD.
      *    05  FILLER                  PIC  X.
      *    05  INFILE-KEY              PIC  X(09).
      *    05  FILLER                  PIC  X(1090).
