)ATTR
 /*  (C) COPYRIGHT AMDAHL CORPORATION  1995. ALL RIGHTS RESERVED    */
 ! TYPE(OUTPUT) INTENS(LOW) COLOR(YELLOW)
 # TYPE(OUTPUT) INTENS(HIGH) COLOR(TURQ)
 $ TYPE(OUTPUT) INTENS(HIGH) COLOR(RED)
 ? TYPE(INPUT) PAD(_) CAPS(ON)
)BODY WINDOW(76,10) ASIS
%COMMAND INPUT ===>_ZCMD                                                  +
+RETURN CODE:$CC+                                                         +
)MODEL
!XLINE                                                                    +
)INIT
 .HELP  = XMITHELP
)PROC
 &ZCMD = TRUNC (&ZCMD,' ')
)END
