)ATTR
 /*  (C) COPYRIGHT AMDAHL CORPORATION  1995. All Rights Reserved    */
)BODY EXPAND(\\)
+\-\%Amdahl Selection Group Panel Help+\-\
%COMMAND ===>_ZCMD                                                             +
+                                                                              +
   The%Selection+panel displays a member list of selection groups.  You
   select one member from this list and press PF3.  The selected member is
   now displayed for modification on the selection group panel.

   You may delete existing lines by entering D on each line to be deleted.
   You may add new lines by entering A or I on any line.
   You may update information on any line by typing over the displayed data.
   Updates will be made each time you press the ENTER key.  When you are
   finished modifying this member press the PF3 key to return to the controller
   panel.
)END
