)ATTR
 /*  (C) COPYRIGHT AMDAHL CORPORATION  1995. All Rights Reserved    */
 ! TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW)
)BODY EXPAND(\\)
+\-\%Amdahl Cache Utility Help+\-\
%COMMAND ===>_ZCMD                                                             +
+                                                                              +
   The%Cache Utility+dialog Duplex panel displays all options available
   for controlling duplex (dual copy) operations.  Since some of these
   operations can involve the copying of an entire volume of data, the
   option to invoke the operation as a batch job is available.  This will
   prevent the terminal from being 'locked' while the operation is in
   progress.

   Any non-blank character can be used to select an operation.
   Field level help is available for most fields.  Place the cursor in a
   field and press the PF1 key.  A help panel will be displayed for the
   corresponding field.
)END
