)ATTR
 /*  (C) COPYRIGHT AMDAHL CORPORATION  1995. All Rights Reserved    */
 ! TYPE(TEXT) INTENS(LOW) COLOR(YELLOW)
 # TYPE(TEXT) INTENS(HIGH) COLOR(TURQ)
 $ TYPE(OUTPUT) COLOR(RED)
 ? TYPE(INPUT) PAD(_) CAPS(ON)
)BODY WINDOW(76,9) ASIS
#                    SETSECONDARY HELP
!
!  #SETSECONDARY!specifies that a dual copy (duplex) pair is to be
!   established.  The secondary device must be offline and is identified
!   by the MVS/ESA and MVS/XA device number.  DASD Fast Write and
!   caching status of the primary volume are maintained for the duplex
!   pair.
!   May be used in conjunction with#COPY! or #NOCOPY.
)END
