)ATTR
 /*  (C) COPYRIGHT AMDAHL CORPORATION  1995. All Rights Reserved    */
)BODY EXPAND(\\)
+\-\%Amdahl Display Cache Help+\-\
%COMMAND ===>_ZCMD                                                             +
+                                                                              +
   The%Display Cache+panel displays the status of all devices on cacheing
   controllers in a grid format. This panel is for informational purposes
   only.  No additional functions can be performed on the values on this
   panel.

   Each device will be represented by three values.  They correspond to
   the:
        device cache status    (Y for on, N for off)
        device DFW status
        device duplex status   (N not duplexed, P primary, S secondary)

   A value of ... indicates the volume is offline or not defined.
)END
