)ATTR
 /*  (C) COPYRIGHT AMDAHL CORPORATION  1995. All Rights Reserved    */
 ! TYPE(TEXT) INTENS(LOW) COLOR(YELLOW)
 # TYPE(TEXT) INTENS(HIGH) COLOR(TURQ)
 $ TYPE(TEXT) INTENS(HIGH) COLOR(RED)
 ? TYPE(INPUT) PAD(_) CAPS(ON)
)BODY WINDOW(76,5) ASIS
#                     SUBSYSTEM STORAGE HELP
!
!   The amount of RAM storage that exists in the cache for this
!   subsystem.
)END
