)ATTR
 /*  (C) COPYRIGHT AMDAHL CORPORATION  1995. All Rights Reserved    */
 ! TYPE(TEXT) INTENS(LOW) COLOR(YELLOW)
 # TYPE(TEXT) INTENS(HIGH) COLOR(TURQ)
 $ TYPE(OUTPUT) COLOR(RED)
 ? TYPE(INPUT) PAD(_) CAPS(ON)
)BODY WINDOW(76,4) ASIS
#                       Read to Write Ratio
!
!   The total Search/Reads / total Writes.
)END
