)ATTR
 /*  (C) COPYRIGHT AMDAHL CORPORATION  1995. All Rights Reserved    */
 * TYPE(TEXT)   INTENS(HIGH) COLOR(TURQ)
 # TYPE(INPUT)  INTENS(HIGH) COLOR(&ATCACH) CAPS(ON)
 @ TYPE(INPUT)  INTENS(HIGH) COLOR(&ATCFW) CAPS(ON)
 ¬ TYPE(INPUT)  INTENS(HIGH) COLOR(&ATNVS) CAPS(ON)
 $ TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW) JUST(RIGHT)
 ¢ TYPE(OUTPUT) INTENS(HIGH) COLOR(GREEN) JUST(RIGHT)
 ! TYPE(OUTPUT) INTENS(LOW) COLOR(BLUE) JUST(RIGHT)
 ? TYPE(INPUT) PAD(_) CAPS(ON)
)BODY EXPAND(\\)
%\-\ AMDAHL CACHE UTILITY!VERS %\-\
%COMMAND INPUT ===>_ZCMD                                     %SCROLL ===>_AMT +
+
*Intvl:!Z  +sec  \-\ Cache Statistics \-\
%              Cachbl  Tot   DFW Bypass             Read   DFW   CFW        DFW
%          I/O  Hit    Hit   Hit  Rate Inhib  R/W   Hit    Hit   Hit Stage Retry
%Volser   Rate  Pct    Pct   Pct        Rate Ratio  Rate  Rate  Rate  Rate  Rate
%-------------------------------------------------------------------------------
)MODEL
¢VOLSER+!IO   $Z    $Z    $Z    !Z    !Z    !RW   !RHIT !Z    !Z    !STAGE!Z
)INIT
 .HELP  = CSHHMAN5
.ZVARS = '(INTERVAL,CACHABLE,TOTHIT,DFWPCT,BYPASS,INHIBIT,DFWHIT, +
          CFWHIT,DFWRETRY)'
 &AMT=CSR
)PROC
 &ZCMD = TRUNC (&ZCMD,' ')
)HELP
 FIELD(IO)       PANEL(CSHH500)
 FIELD(CACHABLE) PANEL(CSHH501)
 FIELD(TOTHIT)   PANEL(CSHH502)
 FIELD(DFWPCT)   PANEL(CSHH503)
 FIELD(BYPASS)   PANEL(CSHH504)
 FIELD(INHIBIT)  PANEL(CSHH505)
 FIELD(RW)       PANEL(CSHH506)
 FIELD(RHIT)     PANEL(CSHH507)
 FIELD(DFWHIT)   PANEL(CSHH508)
 FIELD(CFWHIT)   PANEL(CSHH509)
 FIELD(STAGE)    PANEL(CSHH510)
 FIELD(DFWRETRY) PANEL(CSHH511)
)END
