//XXXXXXX  JOB ACCTNUM,'NAME',NOTIFY=&SYSUID,REGION=0M,
//             CLASS=U,MSGCLASS=X,MSGLEVEL=(1,1),TIME=1440
//*
//STEP1  EXEC PGM=SMFSLCT,REGION=6M         <== CBT FILE 523
//STEPLIB DD DISP=SHR,DSN=XXXX.LINKLIB      <== CHANGE
//SYSUT1  DD DISP=SHR,DCB=BUFNO=80,
//           DSN=XXXXXXXX.SMF.DATA.G0015V00 <== CHANGE
//*
//SYSUT2  DD DSN=XXXXXXXX.SMF30.OUTPUT,     <== CHANGE
//        UNIT=SYSDA,DISP=(,CATLG,DELETE),
//        DCB=(LRECL=32756,BLKSIZE=32760,RECFM=VB,BUFNO=80),
//        SPACE=(CYL,(200,150),RLSE)
//SYSPRINT DD DUMMY
//SYSIN DD *
START=AADDD,END=AADDD
INCLUDE=30
/*
//
