FREN     TITLE 'F R I E N D  ***  MEMOREX DISK I/O CHECKER'
         MACRO ,             3066/3270 BUFFER ROLL
&NM      ROLL  &OPT=
         LCLA  &I
&I       SETA  &SYSNDX
&NM      SSM   *+1           DISABLE INTERRUPTS
         ORG   *-4           ASSEMBLE FOR 1052/3215 OPTION
         B     BUF&I.Y       BRANCH AROUND ROLL CODE
         STM   R3,R8,BUFRSAVE  SAVE REGISTERS
         AIF   ('&OPT' NE 'READ').NRD1
         XR    R7,R7         CLEAR REWRITE ADDRESS
         ST    R7,CRTREWLN
.NRD1    L     R7,CAW        GET I/O REQUEST (ASSUME UNCHAINED)
         TM    0(R7),255-X'09'  CODE OTHER THAN WRITE ?
         BNZ   BUF&I.R       YES - IGNORE
         LM    R7,R8,0(R7)   GET ADDRESS/LENGTH
         LA    R7,0(,R7)     CLEAR CCW CODE
         LA    R8,0(,R8)     CLEAR FLAGS
BUF&I.P  LTR   R6,R8         SAVE AND TEST REQUEST LENGTH
         BNP   BUF&I.L       DONE - EXIT
         LR    R5,R7         SAVE START TEXT ADDRESS
BUF&I.B  CLI   0(R7),X'15'   NEW LINE SYMBOL ?
         LA    R7,1(,R7)     SET TO NEXT BYTE
         BE    BUF&I.M       YES; MOVE CURRENT TEXT
         BCT   R8,BUF&I.B    ELSE CHECK NEXT BYTE
         B     BUF&I.N       LAST COMPLETE LINE
BUF&I.M  SR    R6,R8         GET LENGTH OF THIS LINE
         BCTR  R8,0          ALLOW FOR NL SYMBOL
BUF&I.N  L     R3,CRTLIN@    GET TOP LINE OF BUFFER
         LH    R4,CRTLIN#    GET NUMBER OF LINES TO ROLL
BUF&I.#  EX    0,CRTMVCL     MOVE ONE LINE UP
         AH    R3,CRTLINW    SKIP DATA AND CONTROL CHARACTERS
         BCT   R4,BUF&I.#    DO NEXT LINE
         EX    0,CRTLINC     CLEAR LAST LINE
         AIF   ('&OPT' NE 'READ').NRD2
         ST    R3,CRTREWAD   SAVE ADDRESS
         STC   R6,CRTREWLN+3  SAVE LAST LENGTH
.NRD2    LTR   R6,R6         ANY DATA TO MOVE ?
         BNP   BUF&I.P       NO; DO NEXT SEGMENT
         CH    R6,CRTLINM    LONGER THAN WILL FIT ?
         BNH   *+8           NO; OK
         LH    R6,CRTLINM    TRUNCATE TO MAX
         AIF   ('&OPT' NE 'READ').NRD3
         STC   R6,CRTREWLN+3  SAVE LAST LENGTH
.NRD3    BCTR  R6,0          LESS ONE FOR EXECUTE
         EX    R6,CRTMVC     MOVE TO SCREEN LINE
         B     BUF&I.P       DO NEXT SEGMENT
BUF&I.L  EQU   *
         AIF   ('&OPT' NE 'READ').NRD4
         LM    R4,R5,CRTREWAD  GET ADDRESS/LENGTH OF REWRITE
         LA    R4,1(R4,R5)   SET REWRITE ADDRESS
         SH    R5,CRTLINM    GET LENGTH - LINE MAXIMUM
         LCR   R5,R5         GET LENGTH OF RESPONSE
         BCTR  R5,0          ALLOW FOR EXTRA SPACER
         STM   R4,R5,CRTREWAD   SET ADDRESS FOR REWRITE OF RESPONSE
.NRD4    ANOP  ,
BUF&I.X  MVC   CAW,CRTC@WR   SET FULL SCREEN WRITE INTO CAW
         AIF   ('&OPT' NE 'WAIT').NOWAIT
         L     R5,CRTDELAY   GET DELAY TIME
         XR    R4,R4         CLEAR FOR DIVIDE
         D     R4,CPUSPYD1   ADJUST BY CPU TYPE
         BCT   R5,*          DELAY TO ALLOW SCREEN REWRITE
.NOWAIT  ANOP  ,
BUF&I.R  LM    R3,R8,BUFRSAVE  RESTORE REGISTERS
BUF&I.Y  DS    0H ,          1052/3215 BRANCH TAG
         MEND  ,
         EJECT ,
FRIENDLY START 0
         USING *,R0          DUMMY DECLARATION
LOWSTORE DS    0D ,          SET START ADDRESS FOR IPL DATA PGM
PSWRSTRT DS    D'0'          IPL/RESTART PSW
IPLCCW1  DS    D'0'          IPL CCW - FIRST
IPLCCW2  DS    D'0'          IPL CCW - SECOND
PSOEXT   DS    D'0'          OLD PSW - EXTERNAL INTERRUPT
PSOSVC   DS    D'0'          OLD PSW - SUPERVISOR CALL
PSOPGM   DS    D'0'          OLD PSW - PROGRAM CHECK
PSOMCC   DS    D'0'          OLD PSW - MACHINE CHECK
PSOIOP   DS    D'0'          OLD PSW - INPUT/OUTPUT INTERRUPTION
CSW      DS    D'0'          CHANNEL STATUS WORD
CAW      DS    F'0'          CHANNEL ADDRESS WORD
OSCVT    DS    F'0'          OS CVT REFRESH
TIMER    DS    F'0'          INTERVAL TIMER
TIMER2   DS    F'0'          UNUSED
PSWEXT   DS    D'0'          NEW PSW - EXTERNAL INTERRUPT
PSWSVC   DS    D'0'          NEW PSW - SUPERVISOR CALL
PSWPGM   DS    D'0'          NEW PSW - PROGRAM CHECK
PSWMCC   DS    D'0'          NEW PSW - MACHINE CHECK
PSWIOP   DS    D'0'          NEW PSW - INPUT/OUTPUT
LOGOUT   EQU   *            VARIABLE SIZE/LOCATION MACHINE CHECK LOGOUT
LOWLEN   EQU   *-LOWSTORE    SIZE OF STORAGE TO BE CLEARED
         SPACE 1
         ORG   FRIENDLY+X'180'   SET FOR PROGRAM LOAD POINT
         SPACE 1
DC       EQU   X'80'         CCW - DATA CHAINING
CC       EQU   X'40'         CCW - COMMAND CHAINING
SLI      EQU   X'20'         CCW - SUPPRESS LENGTH INDICATION
NOR      EQU   X'10'         CCW - SUPPRESS DATA TRANSFER
         SPACE 1
R0       EQU   0
R1       EQU   1
R2       EQU   2
R3       EQU   3
R4       EQU   4
R5       EQU   5
R6       EQU   6
R7       EQU   7
R8       EQU   8
R9       EQU   9
R10      EQU   10
R11      EQU   11
R12      EQU   12
R13      EQU   13
R14      EQU   14
R15      EQU   15
         SPACE 2
BASICS   DC    Y(FRIENDLY+4096-FRIENDLY,FRIENDLY+8192-FRIENDLY)  84127
A0184    DC    A(A2920+800)
         SPACE 1
STARTUP  LH    R1,BASICS     GET FIRST BASE REGISTER
         LH    R15,BASICS+2  GET SECOND BASE REGISTER
         USING FRIENDLY+4096,R1,R15  DECLARE OTHER BASES
REINIT   B     A2920         GO TO INITIALIZATION / LATER NOP
         LA    R4,DEVTAB-32
REINITD  LA    R4,32(,R4)
         NI    3(R4),X'F9'
         CLI   32(R4),X'FF'
         BNE   REINITD
         TM    A1BA4,X'80'
         BO    A022C
A01B2    LA    R13,A2920
         L     R14,A0184
         LA    R4,20
         LA    R5,A2920-256
A01BE    LA    R5,256(,R5)
         XC    0(256,R5),0(R5)
         BCT   R4,A01BE
         XC    DEVTAB(256),DEVTAB
         XC    DEVTAB+256(256),DEVTAB+256
         XC    DEVTAB+512(128),DEVTAB+512
         LA    R4,DEVTAB
         STH   R4,DEVNXT
         ST    R13,A1F58
         LA    R4,IPLINP+L'IPLINP-1
         STH   R4,A202A
         MVI   A2370+4,X'FF'
         MVI   A1BA5,X'00'
         MVI   A1BA4,X'08'
         BAL   R11,CONMSG
         DC    X'0117',Y(MGQDEV-FRIENDLY)                        84127
         MVI   *-3,L'MGQDEV  SET FOR SHORT MESSAGE
         CLI   CONBUF,X'00'
         BE    A0220
         BAL   R2,UNITCNVT
         MVC   USRDEV(2),9
A0220    BAL   R11,ADDDEV
         BAL   R11,PUTMSG
         DC    X'091A',Y(MGQENT-FRIENDLY)                        84127
A022C    BAL   R11,CONMSG    FOR CRT - NEED WRITE PRIOR TO READ
         DC    X'0102',Y(MSQQED-FRIENDLY)  RESPOND TO ATTN ON CRT
A0230    BAL   R9,A025C
A0234    BAL   R9,A0276
         LA    R7,A28B9
         CLI   A1F1F,C'W'
         BE    A0284
         LA    R7,A283C
         CLI   A1F1F,C'R'
         BE    A0284
SYNTERR  BAL   R11,PUTMSG
         DC    X'090F',Y(MSGSYNT-FRIENDLY)                       84127
         B     A022C
A025C    MVI   A1FA4,X'00'
         LA    R7,A2412
         BAL   R8,PARSER
         BR    R9
         MVC   OSCVT,0(R7)
         L     R11,OSCVT
         BR    R11
A0276    MVI   A1FA4,X'01'
         LA    R7,A252C+1
         BAL   R8,PARSER
         BR    R9
A0284    XC    16(8),16
         MVC   16(1),0(R7)
         MVC   23(1),1(R7)
         NI    23,X'0F'
         CLI   16,X'04'
         BE    A02C6
         CLI   16,X'73'
         BE    A02CE
         CLI   16,X'94'
         BE    A02C6
         CLI   16,X'B4'
         BE    A02C6
         CLI   16,X'A4'
         BE    A02C6
         B     A02DA
A02C6    MVI   23,X'18'
         B     A02DA
A02CE    MVC   22(2),A02D8
         B     A02DA
A02D8    DC    X'0200'
A02DA    MVC   20(1),3(R7)
         XC    A1F70(4),A1F70
         LH    R4,DEVNXT
         OI    3(R4),X'01'
         LR    R2,R7
A02F0    LA    R7,A28C0
         LA    R9,SYNTERR
         BAL   R8,PARSER
         BR    R9
         OC    20(1),0(R7)
         TM    1(R7),X'30'
         BZ    A031A
         LH    R4,DEVNXT
         OI    2(R4),X'10'
         OC    21(1),1(R7)
A031A    CLI   CONBUF,C'$'
         BE    A08D4
A0322    CLI   CONBUF,X'00'
         BNE   A02F0
         LR    R7,R2
A032C    OI    IPLCCW2+4,X'40'
         NI    A1BA5,X'7F'
         TM    86,X'10'
         BZ    A0344
         SH    R13,DCH8
         NI    86,X'EF'
A0344    TM    85,X'40'
         BZ    A0376
         NI    85,X'BF'
         LR    R4,R13
         SH    R4,DCH8
         ST    R4,0(,R13)
         MVI   0(R13),X'08'
         MVI   4(R13),X'40'
         LA    R13,8(,R13)
         TM    A1BA5,X'01'
         BO    A0376
         BAL   R11,PUTMSG
         DC    X'0910',Y(MSGTICS-FRIENDLY)                       84127
A0376    TM    16,X'0B'
         BC    5,A0390
         CLI   16,X'44'
         BE    A0390
         MVC   17(3),SENS@@
         B     A08A4
A0390    CLI   16,X'23'
         BE    A0490
         TM    2(R7),X'EF'
         BC    5,A03DA
         TM    2(R7),X'10'
         BZ    A03BE
         TM    A1BA5,X'04'
         BO    A085A
         MVC   0(8,R13),16
         LA    R13,8(,R13)
         MVI   16,X'03'
A03BE    TM    16,X'03'
         BZ    A03CE
         TM    16,X'E0'
         BZ    A085A
A03CE    LH    R2,22
         STH   R2,A1FB4
         B     A07FC
A03DA    TM    2(R7),X'08'
         BZ    A04AC
         TM    86,X'08'
         BZ    A03F2
         CLI   23,X'06'
         BNE   A04AC
A03F2    OI    A1BA4,X'08'
         TM    A1BA4,X'04'
         BZ    A0464
         BAL   R11,CONMSG
A0402    DC    X'0108',Y(MGQBCH-FRIENDLY)                        84127
         LA    R8,A0402
         CLI   CONBUF+12,X'00'
         BNE   A1808
         CLI   CONBUF+11,X'00'
         BE    A1808
         LA    R2,12
         LA    R3,CONBUF
         LA    R4,A1FA8
         BAL   R11,HEXCNVT
A042A    CLI   16,X'23'
         BNE   A0444
         MVC   0(1,R14),A1FAE
         ST    R14,16
         MVI   16,X'23'
         B     A0454
A0444    MVC   0(7,R14),A1FA8
         ST    R14,A1FA8
         MVC   17(3),A1FA9
A0454    LA    R14,7(,R14)
         TM    16,X'03'
         BO    A08A4
         B     A04AC
A0464    BAL   R11,CONMSG
         DC    X'0105',Y(MGQCYL-FRIENDLY)                        84127
         BAL   R9,HEXPACK
         STH   R2,A1FAA
         BAL   R11,CONMSG
         DC    X'0105',Y(MGQHED-FRIENDLY)                        84127
         BAL   R9,HEXPACK
         STH   R2,A1FAC
         CLI   16,X'27'
         BE    A0490
         B     A042A
A0490    BAL   R11,CONMSG
         DC    X'0108',Y(A04A4-FRIENDLY)                         84127
         BAL   R9,HEXPACK
         STC   R2,A1FAE
         B     A042A
A04A4    DC    C' SECTOR='
A04AC    TM    2(R7),X'80'
         BZ    A0518
         TM    86,X'80'
         BO    A0518
         CLI   16,X'1F'
         BE    A04EA
         TM    A1BA5,X'04'
         BO    A0518
         MVC   0(8,R13),CCWSFM
         LA    R13,8(,R13)
         TM    A1BA5,X'01'
         BO    A0518
         BAL   R11,PUTMSG
         DC    X'0914',Y(MSGSFMS-FRIENDLY)                       84127
         B     A0518
A04EA    OI    A1BA4,X'08'
         BAL   R11,CONMSG
         DC    X'0106',Y(MGQMSK-FRIENDLY)                        84127
         CLI   CONBUF,X'00'
         BNE   A0506
         MVI   0(R14),X'C0'
         B     A085A
A0506    LA    R2,2
         LA    R3,CONBUF
         LR    R4,R14
         BAL   R11,HEXCNVT
         B     A085A
A0518    TM    2(R7),X'04'
         BZ    A05A4
         CLI   16,X'15'
         BNE   A052E
         XR    R2,R2
         B     A053A
A052E    BAL   R11,CONMSG
         DC    X'0109',Y(MGQRCD-FRIENDLY)                        84127
         BAL   R9,HEXPACK
A053A    STH   R2,A1FAE
         TM    1(R7),X'40'
         BZ    A05A4
         L     R4,A1FA8
         MVC   0(4,R14),2(R4)
         STC   R2,4(,R14)
         B     A085A
A0558    MVI   A059A,X'1F'
         EX    0,A0284
         MVI   16,X'08'
         OI    20,X'40'
         NI    85,X'BF'
         CLI   CONBUF,X'00'
         BNE   A057C
         LA    R2,8
         B     A0598
A057C    CLI   CONBUF,C'-'
         BE    A0590
         MVI   A059A,X'1E'
         CLI   CONBUF,C'+'
         BNE   A0594
A0590    MVI   CONBUF,C'0'
A0594    BAL   R9,HEXPACK
A0598    LR    R4,R13
A059A    SLR   R4,2
         ST    R4,OSCVT
         B     A085E
A05A4    ST    R14,A1F20
         XC    A1FB0(6),A1FB0
         TM    2(R7),X'02'
         BZ    A05D6
         TM    16,X'02'
         BO    A05C6
         TM    20,X'01'
         BZ    A05D6
A05C6    BAL   R11,CONMSG
         DC    X'0104',Y(MGQKYL-FRIENDLY)                        84127
         BAL   R9,HEXPACK
         STH   R2,A1FB2
A05D6    TM    2(R7),X'01'
         BZ    A0634
         CLI   16,X'44'
         BE    A05FE
         CLI   16,X'0C'
         BE    A05FE
         TM    16,X'02'
         BO    A05FE
         TM    20,X'01'
         BZ    A0634
A05FE    TM    20,X'04'
         BZ    A0616
         LA    R3,A236D
         BAL   R11,A1724
         TM    A203C,X'01'
         BZ    A0634
A0616    BAL   R11,CONMSG
         DC    X'0104',Y(MGQDAL-FRIENDLY)                        84127
         BAL   R9,HEXPACK
         STH   R2,A1FB4
         CLI   16,X'44'
         BNE   A0634
         MVC   22(2),A1FB4
A0634    TM    1(R7),X'20'
         BO    A07FC
         TM    1(R7),X'10'
         BZ    A0684
         BAL   R8,A066A
         B     A0800
         OI    A1BA4,X'02'
         BAL   R11,CONMSG
         DC    X'0106',Y(MGQDAT-FRIENDLY)                        84127
         BAL   R8,A1764
         LH    R2,A1FB0
         MVC   A1FB4(2),A1FB0
         B     A0800
A066A    TM    20,X'02'
         BZ    4(,R8)
         LA    R3,A236D
         BAL   R11,A1724
         TM    A203C,X'01'
         BZR   R8
         B     4(,R8)
A0684    CLI   IPLCCW2,X'39'
         BNE   A069C
         L     R4,A1FA8
         LA    R4,2(,R4)
         ST    R4,OSCVT
         B     A086A
A069C    TM    2(R7),X'04'
         BZ    A06DC
         TM    1(R7),X'40'
         BO    A06DC
         L     R4,A1FA8
         LA    R4,2(,R4)
         MVC   0(4,R14),0(R4)
         MVC   4(1,R14),A1FAF
         LR    R10,R14
         XC    5(3,R14),5(R14)
         LA    R14,8(,R14)
         OI    A1BA5,X'80'
         TM    21,X'30'
         BZ    A06DC
         OI    21,X'40'
A06DC    TM    2(R7),X'40'
         BZ    A072A
         TM    20,X'01'
         BZ    A06F4
         CLI   A1FB3,X'00'
         BE    A072A
A06F4    OI    A1BA4,X'02'
         BAL   R11,CONMSG
         DC    X'0105',Y(MGQKEY-FRIENDLY)                        84127
         BAL   R8,A1764
         TM    20,X'01'
         BO    A071A
         MVC   A1FB2(2),A1FB0
         TM    2(R7),X'04'
         BZ    A072A
A071A    MVC   5(1,R10),A1FB3
         MVC   A1FB2(2),A1FB0
         AH    14,A1FB2
A072A    TM    2(R7),X'20'
         BZ    A0798
         TM    20,X'01'
         BZ    A0744
         OC    A1FB4(2),A1FB4
         BZ    A0798
A0744    BAL   R8,A066A
         B     A0786
         OI    A1BA4,X'02'
         BAL   R11,CONMSG
         DC    X'0106',Y(MGQDAT-FRIENDLY)                        84127
         BAL   R8,A1764
         TM    20,X'01'
         BO    A0772
         MVC   A1FB4(2),A1FB0
         TM    2(R7),X'04'
         BZ    A0798
A0772    MVC   6(2,R10),A1FB4
         MVC   A1FB4(2),A1FB0
         AH    R14,A1FB4
         B     A0798
A0786    TM    2(R7),X'04'
         BZ    A0798
         STH   R2,A1FB4
         MVC   6(2,R10),A1FB4
A0798    TM    1(R7),X'40'
         BZ    A07BC
         TM    2(R7),X'20'
         BO    A07B0
         LH    R2,A1FB2
         B     A0874
A07B0    LH    R2,A1FB2
         AH    R2,A1FB4
         B     A0874
A07BC    CLI   16,X'0F'
         BNE   A07D4
         MVC   0(1,R14),A1FB3
         MVC   1(2,R14),A1FB4
         B     A085A
A07D4    CLI   16,X'16'
         BE    A07EC
         CLI   16,X'0A'
         BE    A07EC
         CLI   16,X'1E'
         BNE   A080E
A07EC    LA    R2,8
A07F0    OI    A1BA5,X'80'
         AH    R2,A1FB2
         AH    R2,A1FB4
A07FC    ST    R14,A1F20
A0800    TM    20,X'10'
         BO    A0874
         AR    R14,R2
         B     A0874
A080E    XR    R2,R2
         CLI   16,X'0E'
         BE    A07F0
         CLI   16,X'19'
         BNE   A0830
         L     R4,A1FA8
         LA    R4,1(,R4)
         ST    R4,OSCVT
         B     A086A
A0830    TM    A1BA5,X'80'
         BZ    A0848
         LA    R2,8
A083C    AH    R2,A1FB2
A0840    AH    R2,A1FB4
         B     A0874
A0848    XR    R2,R2
         CLI   16,X'0D'
         BE    A083C
         CLI   16,X'05'
         BE    A0840
A085A    ST    R14,OSCVT
A085E    TM    20,X'10'
         BO    A08A4
         AH    R14,22
A086A    MVC   17(3),OSCVT+1
         B     A08A4
A0874    STH   R2,22
         TM    20,X'10'
         BO    A08A4
         MVC   17(3),A1F20+1
         TM    20,X'06'
         BC    5,A08E4
A088E    CLI   16,X'0C'
         BNE   A08A4
         L     R4,16
         AH    R4,22
         BCTR  R4,0
         ST    R4,16
A08A4    OC    84(4),0(R7)
         TM    A1BA4,X'40'
         BZ    A08BA
         OI    16,X'80'
         NI    A1BA4,X'BF'
A08BA    NI    20,X'F8'
         MVC   0(8,R13),16
         LA    R13,8(,R13)
         TM    A1BA5,X'04'
         BO    A117C
         B     A022C
A08D4    MVC   A236C(2),CONBUF
         MVC   CONBUF(158),CONBUF+2
         B     A0322
A08E4    LA    R3,A236C
         BAL   R11,A16E0
         TM    A203C,X'04'
         BO    A090E
         LR    R2,R14
         SH    R2,A1FB4
         ST    R2,OSCVT
         MVC   1(3,R3),OSCVT+1
         MVC   4(2,R3),A1FB4
         B     A088E
A090E    TM    A1BA5,X'80'
         BO    A0926
A0916    MVC   17(3),1(R3)
         MVC   22(2),4(R3)
         B     A088E
A0926    LH    R2,22
         SH    R2,A1FB4
         LTR   R2,R2
         BZ    A0916
         STH   R2,22
         MVI   20,X'80'
         MVC   0(8,R13),16
         LA    R13,8(,R13)
         MVI   16,X'00'
         MVI   20,X'60'
         MVI   21,X'00'
         B     A0916
A0956    TM    A1BA5,X'02'
         BO    A11D6
         NI    A1BA5,X'FE'
         NI    A1FD6,X'7F'
A0966    LR    R4,R13
         SH    R4,DCH8
         NI    4(R4),X'B8'
         OI    A1BA4,X'80'
         NI    A1BA4,X'DF'
         LA    R4,A0AF4
         ST    R4,PSWIOP+4
         LH    R4,DEVNXT
         LR    R3,R4
         LA    R2,DEVTAB-32
         SR    R3,R2
         LA    R5,32
         XR    R2,R2
         DR    R2,R5
         STC   R3,A0A7C+3
         M     R2,CPUSPYD1
         LR    R5,R3
         XR    R2,R2
         L     R3,A1F68
         DR    R2,R5
         ST    R3,A1F5C
A09AA    LA    R6,DEVTAB-32
A09AE    LA    R6,32(,R6)
A09B2    SSM   SSMEIO
         NOPR  0
         SSM   SSMDIO
         CH    R6,DEVNXT
         BH    A09AA
         TM    3(R6),X'01'
         BZ    A09AE
         TM    3(R6),X'06'
         BZ    A09F4
         L     R4,16(,R6)
         LA    R4,1(,R4)
         ST    R4,16(,R6)
         C     R4,A1F5C
         BC    10,A0ABE
         TM    2(R6),X'80'
         BO    A09B2
         B     A09AE
A09F4    LH    R12,0(,R6)
         LA    R5,DEVTAB-32
A09FC    LA    R5,32(,R5)
         CR    R5,R6
         BE    A0A16
         CH    R12,0(,R5)
         BNE   A0A16
         TM    3(R5),X'06'
         BC    5,A09AE
A0A16    CH    R5,DEVNXT
         BNE   A09FC
         NI    A203C,X'7F'
         LH    R5,4(,R6)
         ST    R5,CAW
         XC    CSW,CSW
         XC    SENSIN(12),SENSIN
A0A36    SIO   0(R12)
         BALR  R4,0
         TM    A1FD6,X'80'
         BZ    A0A5A
A0A44    TIO   0(R12)
         BZ    A0A44
         SSM   SSMEIO
         NOPR  0
         SSM   SSMDIO
         B     A0A36
A0A5A    SPM   4
         BC    5,A0A84
         BC    2,A0A74
         OI    3(R6),X'02'
         LH    R4,30(,R6)
         LA    R4,1(,R4)
         STH   R4,30(,R6)
A0A74    TM    2(R6),X'80'
         BZ    A09AE
A0A7C    LA    R7,0          DISP FIELD MODIFIED
         B     A09B2
A0A84    CLI   CSW+4,X'10'
         BE    A0AB6
         CLI   CSW+4,X'50'
         BE    A0AB6
         EX    0,A0B54
         BAL   R8,A0EEA
         BAL   R8,CNVTUNIT
         MVC   MSGNSIO+8(4),OSCVT
         BAL   R11,PUTMSG
         DC    X'0926',Y(MSGNSIO-FRIENDLY)                       84127
         BAL   R9,A0E28
         B     A09B2
A0AB6    OI    3(R6),X'04'
         B     A0A74
A0ABE    TM    2(R6),X'80'
         BZ    A0ACE
         EX    0,A0B60
         BCT   R7,A09B2
A0ACE    LH    R12,0(,R6)
         BAL   R8,CNVTUNIT
         MVC   MSGNOCUE+6(4),OSCVT
         BAL   R11,PUTMSG
         DC    X'0928',Y(MSGNOCUE-FRIENDLY)                      84127
         LH    R12,0(,R6)
         HIO   0(R12)                       *
         EX    0,A0B60
         B     A09AE
A0AF4    STM   R2,R11,SAVE211
         LH    R12,PSOIOP+2
         LA    R5,INCHKCON
         LA    R6,DEVTAB-32
A0B04    LA    R6,32(,R6)
         CH    R6,DEVNXT
         BHR   R5
         TM    3(R6),X'06'
         BZ    A0B04
         TM    CSW+4,X'20'
         BZ    A0B44
         N     R12,MASKFFF0
         LH    R2,0(,R6)
         N     R2,MASKFFF0
         CR    R12,R2
         BNE   A0B04
         TM    3(R6),X'04'
         BZ    A0B04
         NI    3(R6),X'F9'
         LA    R5,A0D84
         B     A0B04
A0B44    CH    R12,0(,R6)
         BNE   A0B04
         TM    A1BA4,X'20'
         BO    A0B5A
A0B54    MVC   A1F58+2(2),4(R6)
A0B5A    NC    CSW+4(2),6(R6)
A0B60    XC    16(4,R6),16(R6)
         CLC   CSW+4(2),A2032
         BE    A0D84
         TM    CSW+4,X'02'
         BO    A0E02
A0B78    TM    CSW+4,X'81'
         BC    5,A0EC8
         TM    69,X'FF'
         BC    5,A0EC8
         TM    CSW+4,X'04'
         BZ    A0D84
         NI    3(R6),X'F9'
         TM    2(R6),X'80'
         BZ    A0BA6
         NOPR  0
         L     R4,12(,R6)
         BCT   R4,*
A0BA6    TM    2(R6),X'40'
         BZ    A0C82
         MVC   MSGBYT+17(1),20(R6)
         MVC   MSGBYT+23(1),24(R6)
         NI    A203C,X'BF'
         L     R7,20(,R6)
         L     R10,24(,R6)
         LA    R5,1
         LH    R2,28(,R6)
A0BCE    CH    R2,DCH256
         BC    12,A0BF4
         CLC   0(256,R7),0(R10)
         BNE   A0C04
         LA    R7,256(,R7)
         LA    R10,256(,R10)
         LA    R5,256(,R5)
         SH    R2,DCH256
         B     A0BCE
A0BF4    BCTR  R2,0
         STC   R2,*+5
         CLC   0(0,R7),0(R10)
         BE    A0C76
A0C04    CLC   0(1,R7),0(R10)
         BNE   A0C26
A0C0E    LA    R7,1(,R7)
         LA    R10,1(,R10)
         CH    R5,28(,R6)
         BC    10,A0C76
         LA    R5,1(,R5)
         B     A0C04
A0C26    TM    A203C,X'40'
         BO    A0C44
         OI    A203C,X'40'
         BAL   R8,CNVTUNIT
         MVC   MSGDACHK+7(4),OSCVT
         BAL   R11,PUTMSG
         DC    X'091E',Y(MSGDACHK-FRIENDLY)                      84127
A0C44    CVD   R5,8
         OI    15,X'0F'
         UNPK  MSGBYT+10(5),13(3)
         LR    R3,R7
         LA    R2,1
         LA    R4,MSGBYT+19
         BAL   R11,CNVTHEX
         LR    R3,R10
         LA    R4,MSGBYT+25
         BAL   R11,CNVTHEX
         BAL   R11,PUTMSG
         DC    X'091B',Y(MSGBYT-FRIENDLY)                        84127
         B     A0C0E
A0C76    TM    A203C,X'40'
         BZ    A0C82
         BAL   R9,A0E9C
A0C82    TM    A1BA4,X'20'
         BO    HALTIO
         TM    2(R6),X'10'
         BZ    A0D60
         LH    R2,4(,R6)
A0C96    TM    5(R2),X'30'
         BZ    A0D50
         TM    4(R2),X'80'
         BZ    A0CAA
         LA    R2,8(,R2)
A0CAA    L     R3,0(,R2)
         LH    R4,6(,R2)
         TM    5(R2),X'40'
         BZ    A0CC2
         LA    R3,8(,R3)
         SH    R4,DCH8
A0CC2    TM    5(R2),X'10'
         BO    A0D02
         IC    R7,0(,R3)
         LA    R9,0(R3,R4)
         BCTR  R9,0
A0CD4    CH    R4,DCH256
         BC    12,A0CEE
         MVC   0(256,R3),0(R3)
         LA    R3,256(,R3)
         SH    R4,DCH256
         B     A0CD4
A0CEE    BCTR  R4,0
         STC   R4,*+5
         MVC   0(0,R3),1(R3)
         STC   R7,0(,R9)
         B     A0D50
A0D02    NOP   A0D16
         OI    19(R6),X'01'
         L     R5,16(,R6)
         ST    R5,A1F78
         MVI   A0D02+1,X'F0'
A0D16    L     R9,A1F78
         M     R8,A1F74
         ST    R9,A1F78
         CH    R4,DCH4
         BC    12,A0D40
         ST    R9,OSCVT
         MVC   0(4,R3),OSCVT
         LA    R3,4(,R3)
         SH    R4,DCH4
         B     A0D16
A0D40    SRL   R9,24
         STC   R9,0(,R3)
         LA    R3,1(,R3)
         BCT   R4,A0D16
A0D50    TM    4(R2),X'C0'
         BZ    A0D60
         LA    R2,8(,R2)
         B     A0C96
A0D60    OC    10(2,R6),10(R6)
         BZ    A0D74
         CLC   10(2,R6),30(R6)
         BC    12,A0D8C
A0D74    LM    R2,R5,SAVE211
         LM    R7,R11,SAVE211+20
         LA    R6,32(,R6)
         LPSW  PSOIOP
A0D84    LM    R2,R11,SAVE211
         LPSW  PSOIOP
A0D8C    LH    R12,0(,R6)
         BAL   R8,CNVTUNIT
         MVC   MSGLUPX+26(4),OSCVT
         XC    30(2,R6),30(R6)
         BAL   R11,PUTMSG
         DC    X'091F',Y(MSGLUPX-FRIENDLY)                       84127
         SPACE 1
HALTIO   OI    A1BA4,X'20'
HALTIOL  LA    R4,DEVTAB
HALTION  SSM   SSMEIO
         NOPR  0
         SSM   SSMDIO
         TM    3(R4),X'06'
         BZ    HALTIOI
         L     R5,16(,R4)
         LA    R5,1(,R5)
         ST    R5,16(,R4)
         C     R5,A1F5C
         BL    HALTIOL
         NI    3(R4),X'F9'
         LH    R12,0(,R4)
         HIO   0(R12)                       *
HALTIOI  LA    R4,32(,R4)
         CH    R4,DEVNXT
         BC    12,HALTION
*        LA    R11,A0230
*        B     GETMSG2
         LA    R11,A022C+4   FAKE BAL FROM GETMSG REQUEST
         B     CONMSG+4      GO TO INPUT PROCESSING WITHOUT REGSAVE
         SPACE 1
INCHKCON CH    R12,CONCUU
         BE    HALTIO
         B     I@OINT
A0E02    NI    3(R6),X'F9'
         BAL   R8,CNVTUNIT
         MVC   MSGIUCK+8(4),OSCVT
         NI    A203C,X'7F'
         BAL   R8,A0EEA
         BAL   R11,PUTMSG
         DC    X'0924',Y(MSGIUCK-FRIENDLY)                       84127
A0E20    BAL   R9,A0E28
         B     A0C82
A0E28    MVC   MSGCSW+4(2),MSGCSW+8
         MVC   MSGCSW+7(6),MSGCSW+10
         MVC   MSGCSW+14(2),MSGCSW+16
         MVC   MSGCSW+17(2),MSGCSW+18
         MVI   MSGCSW+19,X'40'
         MVI   MSGCSW+16,X'40'
         MVI   MSGCSW+13,X'40'
         BAL   R11,PUTMSG
         DC    X'0918',Y(MSGCSW-FRIENDLY)                        84127
         TM    A203C,X'80'
         BO    A0E9C
         LA    R2,24
         LA    R3,SENSIN
         LA    R4,MSGSNS+27
         BAL   R11,CNVTHEX
         LA    R2,23
         LA    R3,MSGSNS+4
         LA    R4,MSGSNS+27
A0E78    MVC   0(2,R3),0(R4)
         MVI   2(R3),X'40'
         LA    R3,3(,R3)
         LA    R4,2(,R4)
         BCT   R2,A0E78
         BAL   R11,PUTMSG
         DC    X'094B',Y(MSGSNS-FRIENDLY)                        84127
         TM    A1BA5,X'02'
         BOR   R9
A0E9C    LH    R4,30(,R6)
         CVD   R4,8
         OI    15,X'0F'
         UNPK  MSGLUP+5(5),13(3)
         BAL   R11,PUTMSG
         DC    X'090A',Y(MSGLUP-FRIENDLY)                        84127
         TM    A1FD6,X'04'
         BZR   R9
         BAL   R11,PUTMSG
         DC    X'0910',Y(MSGSTOP-FRIENDLY)                       84127
         B     HALTIO
A0EC8    NI    3(R6),X'F9'
         BAL   R8,CNVTUNIT
         BAL   R8,A0EEA
         MVC   MSGICSW+8(4),OSCVT
         BAL   R11,PUTMSG
         DC    X'0923',Y(MSGICSW-FRIENDLY)                       84127
         OI    A203C,X'80'
         B     A0E20
A0EEA    LA    R2,8
         LA    R3,CSW
         LA    R4,MSGCSW+8
         BAL   R11,CNVTHEX
         MVC   IPLCCW1,CSW
         OC    65(3),65
         BZ    A0F12
         L     R4,CSW
         SH    R4,DCH8
A0F12    ST    R4,A1F70
         TM    A203C,X'80'
         BOR   R8
         LA    R4,CCWSENSE
         ST    R4,CAW
A0F24    SIO   0(R12)                       *
         BC    11,A0F34
         TIO   0(R12)                       *
         B     A0F24
A0F34    TIO   0(R12)                       *
         BH    A0F34
         TM    12,X'02'
         BZR   R8
         NC    SENSIN(2),8(R6)
         OC    SENSIN(2),SENSIN
         BZ    A0B78
         BR    R8
A0F54    OI    A1FD6,X'80'
         TM    A1BA5,X'02'
         BO    A11D6
         B     A0966
A0F64    OI    A1FD6,X'04'
         B     A022C
A0F6C    L     R3,A1F58
A0F70    LA    R4,CONBUF+11
         LA    R2,8
         OC    0(8,R3),0(R3)
         BZ    A022C
         BAL   R11,CNVTHEX
         MVC   CONBUF+8(2),CONBUF+11
         MVC   CONBUF+11(6),CONBUF+13
         MVC   CONBUF+18(4),CONBUF+19
         MVI   CONBUF+22,C' '
         MVI   CONBUF+17,C' '
         MVI   CONBUF+10,C' '
         MVC   CONBUF+6(2),A230D
         C     R3,A1F70
         BNE   A0FBE
         XC    A1F70(4),A1F70
         MVC   CONBUF+6(2),A230F
A0FBE    MVI   CONBUF+20,C'0'
         ST    R3,OSCVT
         LA    R2,3
         LA    R3,OSCVT+1
         LA    R4,CONBUF
         BAL   R11,CNVTHEX
         L     R3,OSCVT
         BAL   R11,PUTMSG
         DC    X'091B',Y(CONBUF-FRIENDLY)                        84127
         TM    4(R3),X'C0'
         BZ    A022C
         LA    R3,8(,R3)
         B     A0F70
A0FF2    LH    R5,DEVNXT
         LA    R5,32(,R5)
         CLI   0(R5),X'FF'
         BE    A102A
         STH   R5,DEVNXT
         STH   R13,4(,R5)
         ST    R13,A1F58
         LR    R4,R13
         SH    R4,DCH8
         NI    4(R4),X'B8'
         BAL   R2,UNITCNVT
         MVC   USRDEV(2),9
         BAL   R11,ADDDEV
         B     A022C
A102A    BAL   R11,PUTMSG
         DC    X'0923',Y(MSGDQFUL-FRIENDLY)                      84127
         B     A022C
A1036    BAL   R2,UNITCNVT
         MVC   A1F3C(3),8
         L     R4,OSCVT
         MVC   CONBUF(10),1(R4)
         BAL   R2,UNITCNVT
         LA    R4,DEVTAB-32
A1052    LA    R4,32(,R4)
         CLC   0(2,R4),9
         BNE   A1066
         MVC   0(2,R4),A1F3C+1
A1066    CLI   32(R4),X'FF'
         BNE   A1052
         B     A022C
A1072    BAL   R2,UNITCNVT
         LA    R4,DEVTAB-32
         LH    R5,DEVNXT
A107E    LA    R4,32(,R4)
         CLC   0(2,R4),9
         BNE   A1098
         MVC   2(30,R5),2(R4)
         MVC   A1F58+2(2),4(R5)
A1098    CLI   32(R4),X'FF'
         BNE   A107E
         B     A022C
A10A4    LA    R8,A10B4
         OI    A1BA4,X'08'
         BAL   R11,CONMSG
         DC    X'0111',Y(MGQCNT-FRIENDLY)                        84127
A10B4    CLI   CONBUF+30,X'00'
         BNE   A1808
         CLI   CONBUF+29,X'00'
         BE    A1808
         LA    R2,30
         LA    R3,CONBUF
         LR    R4,R14
         BAL   R11,HEXCNVT
         XC    CONBUF(10),CONBUF
         LA    R7,A1F48
         B     A0284
A10E0    LA    R2,2
         LA    R3,CONBUF
         LA    R4,A1F54
         BAL   R11,HEXCNVT
         LA    R7,A1F54
         MVC   CONBUF(158),CONBUF+2
         TM    A1F54,X'01'
         BO    A110C
         MVC   A1F50(1),A1F54
         LA    R7,A1F50
A110C    BAL   R11,A1950
         B     A0284
A1114    LA    R2,4
         LA    R3,CONBUF
         LA    R4,OSCVT
         BAL   R11,HEXCNVT
         LH    R4,DEVNXT
         XC    6(2,R4),OSCVT
         OI    6(R4),X'04'
         B     A022C
A1136    LA    R2,4
         LA    R3,CONBUF
         LA    R4,OSCVT
         BAL   R11,HEXCNVT
         LH    R4,DEVNXT
         XC    8(2,R4),OSCVT
         B     A022C
A1154    OI    A1BA5,X'04'
A1158    XC    84(4),84
         ST    R13,A1F3C
         BAL   R9,HEXPACK
         BCTR  R2,0
         SLL   R2,3
         A     R2,A1F58
         LR    R13,R2
         MVC   A1FD7(1),4(R13)
         B     A022C
A117C    NI    A1BA5,X'FB'
         SH    R13,DCH8
         TM    A1FD7,X'40'
         BO    A1190
         NI    4(R13),X'B8'
A1190    EX    0,A1158                     *
         L     R13,A1F3C
         B     A022C
A119C    LR    R4,R13
         SH    R4,DCH8
         OI    4(R4),X'40'
         B     A022C
A11AA    CLI   CONBUF+15,X'00'
         BE    SYNTERR
         CLI   CONBUF+16,X'00'
         BNE   SYNTERR
         LA    R2,16
         LA    R3,CONBUF
         LA    R4,16
         BAL   R11,HEXCNVT
         LA    R7,A252C+1
         B     A032C
A11D2    OI    A1BA5,X'02'
A11D6    LH    R12,USRDEV
         LA    R4,A0AF4
         ST    R4,PSWIOP+4
A11E2    TIO   0(R12)                       *
         BALR  R5,0
         TM    A1FD6,X'80'
         BO    A11E2
         SPM   5
         BL    A1208
         BAL   R9,A1240
A11FA    SSM   SSMEIO
         NOPR  0
         SSM   SSMDIO
         B     A11D6
A1208    LA    R2,8
         LA    R3,CSW
         LA    R4,MSGCSW+8
         BAL   R11,CNVTHEX
         BAL   R9,A1240
         LA    R4,CCWSENSE
         ST    R4,CAW
         LH    R12,USRDEV
         SIO   0(R12)                       *
A122C    TIO   0(R12)                       *
         BC    2,A122C
         NI    A203C,X'78'
         BAL   R9,A0E28
         B     A11FA
A1240    SRL   R5,28
         STC   R5,MSGCOCO+12
         NI    MSGCOCO+12,X'F3'
         OI    MSGCOCO+12,X'F0'
         BAL   R8,CNVTUNIT
         MVC   MSGCOCO+22(4),OSCVT
         BAL   R11,PUTMSG
         DC    X'091A',Y(MSGCOCO-FRIENDLY)                       84127
         BR    R9
A1264    OI    A1BA4,X'40'
         BR    R9
A126A    CLI   CONBUF,C'$'
         BNE   A1280
         LA    R3,CONBUF+1
         BAL   R11,A1724
         LR    R6,R2
         B     A12B2
A1280    BAL   R9,HEXPACK
         LR    R6,R2
         L     R9,OSCVT
         MVC   CONBUF(20),1(R9)
         CLI   CONBUF,C'$'
         BE    A12AA
         BAL   R2,UNITCNVT
         L     R9,OSCVT
         MVC   OSCVT+1(3),8
         B     A12BE
A12AA    LA    R3,CONBUF+1
         BAL   R11,A1724
A12B2    LA    R9,CONBUF+2
         TM    A203C,X'01'
         BO    A1446
A12BE    L     R8,OSCVT
         MVC   CONBUF(20),1(R9)
         MVC   DEVCUU(2),CONCUU
         CLI   CONBUF,X'00'
         BE    A12E0
         BAL   R2,UNITCNVT
         MVC   DEVCUU(2),9
A12E0    LR    R3,R8
         LA    R2,32
A12E6    LA    R4,CONBUF+8
         BAL   R11,CNVTHEX
         ST    R3,OSCVT
         LA    R2,3
         LA    R3,OSCVT+1
         LA    R4,CONBUF
         BAL   R11,CNVTHEX
         MVC   CONBUF+6(2),A230D
         L     R3,OSCVT
         BAL   R11,A1A0E
         DC    X'0948',Y(CONBUF-FRIENDLY)                        84127
         LA    R2,32
         ALR   R3,R2
         SR    R6,R2
         BP    A12E6
         B     A022C
A1324    BAL   R11,CONMSG
         DC    X'0110',Y(MGQLUP-FRIENDLY)                        84127
         BAL   R9,HEXPACK
         LH    R4,DEVNXT
         STH   R2,10(,R4)
         B     A022C
A133C    BAL   R2,UNITCNVT
         LA    R4,DEVTAB-32
A1344    LA    R4,32(,R4)
         CLC   0(2,R4),9
         BNE   A1356
         MVI   3(R4),X'00'
A1356    CLI   32(R4),X'FF'
         BNE   A1344
         B     A022C
A1362    OI    A1BA4,X'08'
         BAL   R11,CONMSG
         DC    X'010A',Y(MGQMOD-FRIENDLY)                        84127
         CLI   CONBUF,X'00'
         BNE   A137E
         MVI   A1F4C,X'93'
         B     A138E
A137E    LA    R2,2
         LA    R3,CONBUF
         LA    R4,A1F4C
         BAL   R11,HEXCNVT
A138E    LA    R7,A1F4C
         XC    CONBUF(10),CONBUF
         B     A0284
A139C    BAL   R9,HEXPACK
         LR    R3,R2
         M     R2,DC1M
         ST    R3,A1F68
         B     A022C
A13AE    BAL   R2,UNITCNVT
         MVC   A202E(2),9
         OI    A1BA5,X'01'
         B     A022C
A13C0    CLI   CONBUF,C'M'
         BE    A0234
         LH    R6,DEVNXT
         OI    2(R6),X'80'
         OI    3(R6),X'01'
         BAL   R9,HEXPACK
         MH    R2,DCH10K
         LR    R3,R2
         XR    R2,R2
         D     R2,CPUSPYD2
         LTR   R3,R3
         BP    A13EE
         LA    R3,1
A13EE    ST    R3,12(,R6)
         B     A022C
A13F6    LH    R6,DEVNXT
         OI    2(R6),X'40'
         CLI   CONBUF,C'$'
         BNE   A1452
         LA    R3,CONBUF+1
         BAL   R11,A1724
         TM    A203C,X'01'
         BO    A1446
         MVC   21(3,R6),OSCVT+1
         STH   R2,28(,R6)
         LA    R3,CONBUF+4
         BAL   R11,A1724
         TM    A203C,X'01'
         BO    A1446
         MVC   25(3,R6),OSCVT+1
         MVC   20(1,R6),CONBUF+1
         MVC   24(1,R6),CONBUF+4
         B     A022C
A1446    BAL   R11,PUTMSG
         DC    X'0914',Y(MSGUNDS-FRIENDLY)                       84127
         B     A022C
A1452    MVI   20(R6),X'F1'
         MVI   24(R6),X'F2'
         BAL   R2,UNITCNVT
         MVC   21(3,R6),8
         L     R2,OSCVT
         MVC   CONBUF(14),1(R2)
         BAL   R2,UNITCNVT
         MVC   25(3,R6),8
         L     R2,OSCVT
         CLI   0(R2),C','
         BNE   SYNTERR
         MVC   CONBUF(6),1(R2)
         BAL   R9,HEXPACK
         STH   R2,28(,R6)
         B     A022C
         SPACE 2
*        HEX INPUT CONVERSION
*
HEXPACK  XR    R2,R2
         LA    R4,CONBUF(R2)
         CLI   0(R4),X'00'
         BE    HEXPACKL
         CLI   0(R4),C','
         BE    HEXPACKL
         CLI   0(R4),C'0'
         BL    SYNTERR
         LA    R2,1(,R2)
         B     HEXPACK+2
HEXPACKL ST    R4,OSCVT
         SPACE 1
HEXPARK  LTR   R2,R2
         BNP   *+6
         BCTR  R2,0
         STC   R2,HEXPACKK+1
         OI    HEXPACKK+1,X'70'
HEXPACKK PACK  8(8),CONBUF(1)
         NI    15,X'F0'
         OI    15,X'0C'
         CVB   R2,8
         BR    R9
         SPACE 2
*        ADD AND TEST A NEW DEVICE
*
ADDDEV   LH    R5,DEVNXT
         MVI   3(R5),X'08'
         MVC   6(4,R5),CYLADR
         XC    84(4),84
         MVC   0(2,R5),USRDEV
         STH   R13,4(,R5)
         NI    A1BA4,X'FB'
         MVI   A156A+1,X'04'
         LH    R5,USRDEV
         ST    R13,A1F58
         TIO   0(R5)                        *
**WHY?** TIO   0(R5)         ???????????????????
         BNZ   A156A
         LA    R4,CCWSEECY
         ST    R4,CAW
         SIO   0(R5)                       *
         BNZ   A1570
A152E    TIO   0(R5)                       *
         BC    2,A152E
         CLI   71,X'00'
         BNE   A1570
         LA    R4,CCWSEEK
A1542    ST    R4,CAW
         SIO   0(R5)                       *
         BNZ   A1570
A154E    TIO   0(R5)                       *
         BC    2,A154E
         TM    CSW+4,X'02'
         BO    A1570
         TM    SENSIN+1,X'02'
         BZ    A156A
         OI    A1BA4,X'04'
A156A    OI    A1BA4,X'00'
         BR    R11
A1570    CLI   A156A+1,X'00'
         BER   R11
         LA    R4,CCWSENSE
         MVI   A156A+1,X'00'
         B     A1542
         SPACE 2
*        CONVERT UNIT ADDRESS
*
CNVTUNIT STH   R12,OSCVT
         LA    R2,2
         LA    R3,OSCVT
         LA    R4,OSCVT
         BAL   R11,CNVTHEX
         BR    R8
         SPACE 2
*        CONVERT UNIT ADDRESS IN CONBUF
*
UNITCNVT LR    R5,R2
         LA    R2,CONBUF
         XC    8(8),8
A15A4    MVC   8(5),9
         MVC   13(1),0(R2)
         CLI   0(R2),C'A'
         BL    SYNTERR
         CLI   0(R2),C'0'
         BC    10,A15C8
         CLI   0(R2),C'F'
         BH    SYNTERR
A15C8    LA    R2,1(,R2)
         CLI   0(R2),C','
         BE    A15DC
         CLI   0(R2),X'00'
         BNE   A15A4
A15DC    ST    R2,OSCVT
         LA    R2,6
         LA    R3,8
         LA    R4,8
         BAL   R11,HEXCNVT
         BR    R5
         SPACE 2
A15F2    NI    A203C,X'FD'
         LH    R2,MSGCCW+2
A15FA    CLI   0(R2),C' '
         BNE   A160A
A1602    LA    R2,1(,R2)
         B     A15FA
A160A    BAL   R6,A1648
         CLC   0(1,R2),0(R4)
         BNE   A16BC
         CLI   0(R4),C'='
         BNE   A1602
A1620    OI    A203C,X'02'
         LA    R2,CONBUF
         XC    CONBUF-6(166),CONBUF-6
A162E    BAL   R6,A1648
         CLI   0(R4),C'/'
         BE    A191E
         MVC   0(1,R2),0(R4)
         LA    R2,1(,R2)
         B     A162E
A1648    LH    R4,A202A
A164C    LA    R4,1(,R4)
         CH    R4,A202C
         BL    A169A
         LH    R12,A202E
         LA    R5,CCWIPLRD
         ST    R5,CAW
A1664    SIO   0(R12)                       *
         BNZ   A1664
A166C    TIO   0(R12)                       *
         BC    2,A166C
         LA    R4,81
A1678    BCTR  R4,0
         LA    R5,IPLINP-1(R4)
         CLI   0(R5),C' '
         BE    A1678
         STC   R4,A1690+1
         LR    R4,R11
         BAL   R11,PUTMSG
A1690    DC    X'0900',Y(IPLINP-FRIENDLY)                        84127
         LR    R11,R4
         LA    R4,IPLINP
A169A    CLI   0(R4),C' '
         BE    A16A8
A16A2    STH   R4,A202A
         BR    R6
A16A8    TM    A203C,X'02'
         BZ    A164C
         TM    A1BA4,X'02'
         BO    A16A2
         B     A164C
A16BC    LR    R3,R11
         SH    R3,DCH4
         MVC   A16D4+1(3),1(R3)
         BAL   R11,PUTMSG
         DC    X'011C',Y(MSGKEYBD-FRIENDLY)                      84127
         BAL   R11,PUTMSG
A16D4    DC    X'09000000'
         NI    A1BA5,X'FE'
         B     A022C
A16E0    NI    A203C,X'FB'
         ST    R4,A2370
         LA    R4,A236E
A16EC    LA    R4,6(,R4)
         CLC   0(1,R4),1(R3)
         BE    A1718
         CLI   0(R4),X'FF'
         BNE   A16EC
         CLI   1(R4),X'FF'
         BE    A1758
         MVC   0(1,R4),1(R3)
         MVI   6(R4),X'FF'
         B     A171C
A1718    OI    A203C,X'04'
A171C    LR    R3,R4
         L     R4,A2370
         BR    R11
A1724    LA    R2,A236E
         NI    A203C,X'FE'
A172C    LA    R2,6(,R2)
         CLC   0(1,R2),0(R3)
         BE    A1748
         CLI   0(R2),X'FF'
         BNE   A172C
         OI    A203C,X'01'
         BR    R11
A1748    MVC   OSCVT+1(3),1(R2)
         MVI   OSCVT,X'00'
         LH    R2,4(,R2)
         BR    R11
A1758    BAL   R11,PUTMSG
         DC    X'0923',Y(MSGSYFUL-FRIENDLY)                      84127
         B     A022C
A1764    XR    R3,R3
         NI    A1BA4,X'FD'
         CLI   CONBUF,X'00'
         BE    A1802
         LA    R5,CONBUF
A1776    OI    0(R5),C' '
         CLI   0(R5),C'X'
         BE    A179A
         CLI   0(R5),C'C'
         BE    A179A
         CLI   0(R5),C'0'
         BL    A1808
         LA    R5,1(,R5)
         B     A1776
A179A    LA    R3,CONBUF
         LR    R2,R5
         SR    R2,R3
         BP    A17AE
         LA    R2,1
         B     A17B2
A17AE    BAL   R9,HEXPARK
A17B2    LR    R6,R2
         LTR   R2,R2
         BZR   R8
         CLI   1(R5),X'00'
         BE    A1808
         LR    R4,R5
         LA    R3,1(,R5)
A17C6    LA    R4,1(,R4)
         CLI   0(R4),X'00'
         BNE   A17C6
         LR    R2,R4
         SR    R2,R3
         LR    R4,R3
         CLI   0(R5),C'X'
         BNE   A17E8
         BAL   R11,HEXCNVT
         SRL   R2,1
A17E8    BCTR  R2,0
         STC   R2,A17F4+1
         LA    R2,1(,R2)
         LR    R3,R14
A17F4    MVC   0(1,R3),0(R4)
         AR    R3,R2
         BCT   R6,A17F4
         SR    R3,R14
A1802    STH   R3,A1FB0
         BR    R8
A1808    BAL   R11,PUTMSG
         DC    X'0919',Y(MSGSYNT-FRIENDLY)                       84127
         SH    R8,DCH16
         BR    R8
         SPACE 2
*        MAIN VERB LOOKUP ROUTINE
*
PARSER   LA    R5,4(,R7)
         XR    R6,R6
PARSERM  IC    R6,0(,R5)
         BCTR  R6,0
         STC   R6,PARSERC+1
         NI    PARSERC+1,X'7F'
         IC    R6,PARSERC+1
         LA    R5,1(,R5)
PARSERC  CLC   CONBUF(1),0(R5)
         BE    PARSEC
         BCTR  R5,0
         TM    0(R5),X'80'
         BZ    PARSERX
         ALR   R5,R6
         LA    R5,2(,R5)
         B     PARSERM
PARSERX  ALR   R5,R6
         LA    R5,2(,R5)
         LR    R7,R5
         CLI   0(R7),X'FF'
         BNE   PARSER
         BR    R8
         SPACE 1
PARSEC   LA    R5,L'CONBUF-2
         SLR   R5,R6
         STC   R5,PARSECS+1
         LA    R5,CONBUF+1
         ALR   R5,R6
PARSECS  MVC   CONBUF(1),0(R5)
         TM    A1FA4,X'01'
         BZ    2(,R8)
         CLI   0(R7),X'00'
         BNE   2(,R8)
         MVC   OSCVT,0(R7)
         L     R7,OSCVT
         B     PARSER
         EJECT ,
*        CONSOLE OUTPUT/INPUT ROUTINE
*
CONMSG   STM   R2,R6,SAVE26
A189A    MVC   MSGCCW(1),0(R11)
A18A0    MVC   MSGCCW+2(2),2(R11)
A18A6    MVC   MSGCCW+7(1),1(R11)
         LA    R2,MSGCCW
         ST    R2,CAW
         LH    R12,CONCUU
         LA    R11,4(,R11)
         TM    A1BA5,X'01'
         BZ    CRTFIX1       SKIP READER INTERCEPT
         CLC   MSGCCW+2(2),A022C+6  UNSPECIFIED INPUT REQUEST ?
         BE    A1620         YES - READ INPUT
         B     A15F2         ELSE CHECK REQUEST TYPE
         SPACE 1
CRTFIX1  ROLL  OPT=READ      ROLL SCREEN ON CRT WITH READ CODE
         SIO   0(R12)                       *
A18C8    TIO   0(R12)                       *
         BC    2,A18C8
         CLI   CONFLG,0      1052 ?
         BE    *+12          YES - OVERLAP WRITE
         TM    CSW+4,X'04'   CRT DEVICE END ?
         BZ    A18C8         NO; WAIT FOR IT
         SPACE 1
         CLI   CONFLG,0      CRT ?
         BE    GETMSG3       NO
         LA    R4,GETMSG2A   SET ATTN EXIT
         ST    R4,PSWIOP+4
GETMSG2W LPSW  IOWPSW        WAIT FOR CRT ATTENTION
GETMSG2A CH    R12,PSOIOP+2  SAME DEVICE ?
         BNE   GETMSG2W      NO; WAIT SOME MORE
         TM    CSW+4,X'80'   REALLY ATTN ?
         BZ    GETMSG2W      NO; WAIT FOR IT
GETMSG3  MVC   CAW,CRTC@RD   SET READ CCW CHAIN
         LA    R4,A1906
         ST    R4,PSWIOP+4
A18F4    XC    CONBUF-6(166),CONBUF-6
A18FA    SIO   0(R12)                       *
         BNZ   A18FA
A1902    LPSW  IOWPSW
A1906    CH    R12,PSOIOP+2
         BNE   A1902
         TM    CSW+4,X'01'
         BO    A18F4
         TM    CSW+4,X'04'   DEVICE END ?
         BZ    A1902
         SPACE 1
         CLI   CONFLG,4      WHICH CONSOLE TYPE ?
         BL    A191E         1052/3215 - INPUT COMPLETE
         BH    CONRD8        ELSE DO 3270 CHECKS
         TM    CONBUF-1,X'80'  3066 ENTER KEY ?
         BZ    BUF1X         NO; REWRITE SCREEN AND WAIT AGAIN
         B     CONRDW
CONRD8   CLI   CONBUF-6,X'6E'   CANCEL KEY ?
         BNE   *+12
         MVI   CONBUF,C'I'   TREAT AS INTERRUPT REQUEST
         B     CONRDW
         CLI   CONBUF-6,X'7D'  ENTER KEY ?
         BNE   BUF1X         NO; REWRITE SCREEN AND WAIT FOR INPUT
CONRDW   LM    R2,R3,CRTREWAD  GET REWRITE ADDRESS/LENGTH
         LTR   R3,R3         ANY ?
         BNP   A191E         NO; SKIP
         BCTR  R3,0          LESS ONE FOR EXECUTE
         EX    R3,CRTOCBUF   WRITE BUFFER TO SCREEN LINE
A191E    CLI   CONBUF+1,X'00'
         BNE   A1936
         CLI   CONBUF,C'I'
         BE    A01B2
         CLI   CONBUF,X'89'
         BE    A01B2
A1936    CLC   CONBUF(5),LCRESET
         BNE   A1948
         CLI   CONBUF+5,X'00'
         BE    A01B2
A1948    TM    A1BA4,X'02'
         BO    A19EA
A1950    LA    R2,CONBUF
         MVI   A196C+3,X'0B'
         TM    A1BA4,X'08'
         BZ    A1968
         MVI   A196C+3,X'04'
         NI    A1BA4,X'F7'
A1968    OI    0(R2),C' '
A196C    LA    R3,0          DISP FIELD MODIFIED
A1970    LA    R4,SKIPVOW-1(R3)
         CLC   0(1,R2),0(R4)
         BE    A19FA
         BCT   R3,A1970
         CLI   0(R2),C'$'
         BNE   A1996
         LA    R2,1(,R2)
         OI    0(R2),C' '
         B     A19D8
A1996    CLI   0(R2),C'='
         BNE   A19A6
         MVI   A196C+3,X'04'
         MVI   0(R2),C'Q'
A19A6    CLC   CONBUF(2),A2514+1
         BE    A19D4
         CLC   CONBUF(2),A250D+1
         BE    A19D4
         CLC   CONBUF(2),A24F7+1
         BE    A19D4
         CLI   0(R2),C','
         BE    A19D4
         CLI   0(R2),C'X'
         BNE   A19D8
A19D4    MVI   A196C+3,X'04'
A19D8    LA    R2,1(,R2)
A19DC    CLI   0(R2),X'00'
         BNE   A1968
         MVC   A1F1F(1),CONBUF
A19EA    LM    R2,R6,SAVE26
         CLC   CONBUF(4),A246B+1
         BE    A01B2
         BR    R11
A19FA    LA    R3,CONBUF+L'CONBUF-1
         SR    R3,R2
         STC   R3,*+5
         MVC   0(1,R2),1(R2)
         B     A19DC
         EJECT ,
*        OUTPUT ROUTINES
*
A1A0E    LH    R12,DEVCUU     GET USER'S DEVICE
         B     A1A1A
         SPACE 1
*        CONSOLE OUTPUT
*
PUTMSG   LH    R12,CONCUU
A1A1A    EX    0,A189A                     *
         EX    0,A18A0                     *
         EX    0,A18A6                     *
         LA    R0,MSGCCW
         ST    R0,CAW
         MVI   CONSTAT,X'00'
         CH    R12,CONCUU    CONSOLE DEVICE ?
         BNE   A1A32         NO; DON'T BOMB
CRTFIX2  ROLL  OPT=WAIT      ROLL SCREEN ON CRT
A1A32    MVI   CSW+4,0       CLEAR CSW STAT
         TIO   0(R12)                       *
         TM    CSW+4,X'80'    ATTENTION (CRT)
         BNZ   HALTIO         YES - SKIP THIS MSG
         SIO   0(R12)                       *
         BNZ   A1A32
A1A3E    TIO   0(R12)                       *
         BC    3,A1A3E
*        BZ    A1A54
*        OC    CONSTAT(1),CSW+4
*        B     A1A3E
A1A54    OC    CONSTAT(1),CSW+4
         TM    CONSTAT,X'80'
         BO    HALTIO
         CLI   CONFLG,0      1052 ?
         BE    4(,R11)       YES - OVERLAP WRITE
         TM    CONSTAT,X'04'   CRT DEVICE END ?
         BZ    A1A3E         NO; WAIT FOR IT
         B     4(,R11)
         SPACE 2
*        HEX OUTPUT FORMATTING
*
CNVTHEX  STM   R2,R5,SAVE26
         AR    R3,R2
         AR    R4,R2
         AR    R4,R2
         XR    R5,R5
CNVTHEXL BCTR  R3,0
         BCTR  R4,0
         IC    R5,0(,R3)
         N     R5,DCF15
         IC    R5,HEXTAB(R5)
         STC   R5,0(,R4)
         BCTR  R4,0
         IC    R5,0(,R3)
         SRL   R5,4
         IC    R5,HEXTAB(R5)
         STC   R5,0(,R4)
         BCT   R2,CNVTHEXL
         LM    R2,R5,SAVE26
         BR    R11
         SPACE 2
*        HEX INPUT CONVERSION
*
HEXCNVT  STM   R2,R6,SAVE26
         IC    R5,0(,R3)
         TM    0(R3),X'C0'
         BZ    HEXCNVTM
         TM    0(R3),X'30'
         BO    HEXCNVTM
         LA    R5,9(,R5)
HEXCNVTM SLL   R5,4
         IC    R6,1(,R3)
         TM    1(R3),X'C0'
         BZ    HEXCNVTN
         TM    1(R3),X'30'
         BO    HEXCNVTN
         LA    R6,9(,R6)
HEXCNVTN N     R6,DCF15
         OR    R5,R6
         STC   R5,0(,R4)
         BCT   R2,HEXCNVTO
         NI    0(R4),X'F0'
         B     HEXCNVTX
HEXCNVTO LA    R3,2(,R3)
         LA    R4,1(,R4)
         BCT   R2,HEXCNVT+4
HEXCNVTX LM    R2,R6,SAVE26
         BR    R11
         SPACE 2
*        UNEXPECTED INTERRUPT PROCESSING
*
EXTINT   MVC   INTLOC(5),INTEXT
         B     FORMINT
SVCINT   MVC   INTLOC(5),INTSVC
         B     FORMINT
PGMINT   MVC   INTLOC(5),INTPGM
         B     FORMINT
MCKINT   MVC   INTLOC(5),INTMCK
         B     FORMINT
I@OINT   MVC   INTLOC(5),INTI@O
FORMINT  LH    R3,INTLOC
         STM   R2,R5,SAVE26
         LA    R2,8
         LA    R4,INTMSG+21
         BAL   R11,CNVTHEX+4
         MVC   INTMSG+17(2),INTMSG+21
         MVC   INTMSG+20(2),INTMSG+23
         MVC   INTMSG+23(4),INTMSG+25
         MVC   INTMSG+28(2),INTMSG+29
         MVI   INTMSG+30,C' '
         MVI   INTMSG+27,C' '
         MVI   INTMSG+22,C' '
         BAL   R11,PUTMSG
         DC    X'0926',Y(INTMSG-FRIENDLY)                        84127
         LPSW  0(R3)
         EJECT ,
*        CRT CONSOLE SUPPORT AREA
*
CRTCCWR  CCW   X'07',0,CC+SLI,2        ERASE SCREEN             *AMS*
         CCW   X'27',*-3,CC+SLI,2      SET BUFFER ADD (0,0)     *AMS*
CRTCCWR2 CCW   X'01',CR6BUF,CC+SLI,CR6BUFL  WRITE FULL SCREEN   *AMS*
         CCW   X'0F',CC6IN@,SLI,2      SET CURSOR               *AMS*
CRTCCRD  CCW   X'0A',CONBUF,SLI,160    READ 3215/1052 INPUT     *AMS*
         CCW   X'27',CC6IN@,CC+SLI,2   SET BUFFER ADDRESS       *AMS*
         CCW   X'06',CONBUF,SLI,79     READ DATA INPUT          *AMS*
CRTLIN@  DC    A(CR6LIN1)    ADDRESS OF FIRST DATA LINE         *AMS*
CRTLIN#  DC    H'33'         NUMBER OF LINES TO ROLL
CRTLINW  DC    AL2(CR6LIN2-CR6LIN1)  LINE SPACING
CRTLINM  DC    AL2(L'CR6LIN1)   LENGTH OF DATA PORTION OF LINE
CRTMVCL  MVC   0(L'CR6LIN1,R3),CR6LIN2-CR6LIN1(R3)  ROLL MOVE
CRTLINC  MVC   0(L'CR6LINL,R3),BLANKS     ROLL - CLEAR BOTTOM LINE
CRTOVLAY EQU   *-CRTCCWR     LENGTH OF DEVICE DEPENDENT OVERLAY
         SPACE 1
MSQQED   DC    C'? '         RESPONSE TO ATTN
CRTC@WR  DC    A(CRTCCWR)    WRITE CHAIN ADDRESS FOR CAW
CRTC@RD  DC    A(CRTCCRD)    READ  CHAIN ADDRESS
BUFRSAVE DC    6A(0)         ROLL - SAVE AREA
CRTMVC   MVC   0(0,R3),0(R5) ROLL - MOVE DATA TO SCREEN
CC6IN@   DC    AL1(34,1)     3066 INPUT & CURSOR ADDRESS
CRTDELAY DC    F'4300000'    CRT UPDATE DELAY FACTOR
CRTREWAD DC    A(0)          CRT RESPONSE WRITE ADDRESS
CRTREWLN DC    F'0'          RESPONSE LENGTH
CRTOCBUF OC    0(0,R2),CONBUF  ECHO UPPER CASE RESPONSE ON CRT
BLANKS   DC    CL80' '       BLANKS
CONFLG   DC    X'0'  CONS TYPE (0)1052/3215 (4)3066/5450 (8)3158/3272
*                              (C)4341 20-LINE 3278/79           84127
         SPACE 2
CONCUU   DC    H'0'
USRDEV   DC    H'0'
A1BA4    DC    X'0'
A1BA5    DC    X'0'
CCWSFM   CCW   X'1F',A2073,CC,1    SET FILE MASK
CCWSENSE CCW   X'04',SENSIN,SLI,24   SENSE
MSGCCW   DC    D'0'
CCWSEEK  CCW   X'07',SEEKAD,CC,6    SEEK
         CCW   X'03',*,SLI,1   NOP
CCWIPLRD CCW   X'02',IPLINP,SLI,80    IPL READ
CCWSEECY CCW   X'0B',CYLADR,0,4   SEEK CYLINDER
IOWPSW   DC    X'FE0600000F',AL3(A1906)
DEVTAB   DC    8F'0'
         DC    152F'0'
CYLADR   DC    X'FFFFFFFF'   SEEK CYLINDER ADDRESS
         DS    0D            ALIGN CONBUF ON DOUBLE-WORD BOUNDARY
DEVNXT   DC    H'0'
         DC    XL6'0'        3066/3270 INPUT BUFFER PREFIX
CONBUF   DC    CL160' '      CONSOLE INPUT
         DC    X'00'         SCAN STOP
A1F1F    DC    X'00'
A1F20    DC    F'0'
SAVE26   DC    6F'0'
A1F3C    DC    F'0'
MASKFFF0 DC    X'0000FFF0'
DCF15    DC    F'15'         AND MASK
A1F48    DC    X'E31F0000'
A1F4C    DC    X'00010020'
A1F50    DC    X'FF200120'
A1F54    DC    X'FF102020'
A1F58    DC    F'0'
A1F5C    DC    F'0'
CPUSPYD1 DC    F'311'
CPUSPYD2 DC    F'190'
A1F68    DC    X'004C4B40'
DC1M     DC    F'1000000'
A1F70    DC    A(0)
A1F74    DC    X'00010003'
A1F78    DC    F'0'
SAVE211  DC    10A(0)
A1FA4    DC    X'0'
SENS@@   DC    AL3(SENSIN)
A1FA8    DC    X'0'
A1FA9    DC    X'0'
A1FAA    DC    H'0'
A1FAC    DC    H'0'
A1FAE    DC    0H'0',X'0'
A1FAF    DC    X'0'
A1FB0    DC    H'0'
A1FB2    DC    0H'0',X'0'
A1FB3    DC    X'0'
A1FB4    DC    H'0'
SENSIN   DC    XL24'0'       SENSE INPUT
DCH8     DC    H'8'
DCH16    DC    H'16'
DCH256   DC    H'256'
DCH10K   DC    H'10000'
A1FD6    DC    X'27'
A1FD7    DC    X'10'
SSMEIO   DC    X'FE'         ENABLE I/O MASK
SSMDIO   DC    X'01'         ENABLE EXTERNAL
IPLINP   DC    CL80' '       IPL READ INPUT
A202A    DC    X'0000'
A202C    DC    X'1F4E'
A202E    DC    X'0000'
DEVCUU   DC    X'0000'
A2032    DC    X'0040'
DCH4     DC    H'4'
SEEKAD   DC    X'000010000000'     SEEK ADDRESS
A203C    DC    X'00'
CONSTAT  DC    X'00'
SKIPVOW  DC    C'  ./YUOIEA*'
HEXTAB   DC    C'0123456789ABCDEF'
MGQENT   DC    C'ENTER CCW LIST IN ENGLISH',X'15'
A2073    DC    X'C0'
LCRESET  DC    X'9985A285A3'
MGQBCH   DC    C' BBCCHH='
MGQMSK   DC    C' MASK='
MGQRCD   DC    C' RCD NO.='
MGQKYL   DC    C' KL='
MGQDAL   DC    C' DL='
MGQKEY   DC    C' KEY='
MGQDAT   DC    C' DATA='
MGQCYL   DC    C' CYL='
MGQHED   DC    C' HD ='
MGQMOD   DC    C' MODE CMD='
MGQCNT   DC    C' MLCCCBBCCHHRDDS='
MGQDEV   DC    C'DEV=',C'DEVICE ADDRESS XXX='
MGQLUP   DC    C'NUMBER OF TIMES='
MSGTICS  DC    C'TIC *-8 INSERTED'
MSGSFMS  DC    C'SET FILE MK INSERTED'
MSGKEYBD DC    C'*KEYWORD MISMATCH ON INPUT -'
MSGUNDS  DC    C'*UNDEFINED SYMBOL(S)'
MSGSYFUL DC    C'*SYMBOL TABLE FULL,LAST CMD IGNORED'
MSGDACHK DC    X'15',C'*UNIT=XXXX DATA COMPARE ERROR'
MSGBYT   DC    C' BYTE NO. XXXXX $X=XX $X=XX'
MSGNOCUE DC    C'*UNIT=XXXX -NO DEV END OR CUE I/O INTRPT'
MSGDQFUL DC    C'*DEVICE QUEUE FULL,LAST CMD IGNORED'
MSGCOCO  DC    C'COND CODE = 9 ON UNIT XXXX'
MSGIUCK  DC    X'1515',C'*UNIT=XXXX - I/O INTRPT,UNIT CHECK'
MSGICSW  DC    X'1515',C'*UNIT=XXXX - INCORRECT CSW OR SNS'
MSGCSW   DC    C'CSW XX XXXXXX XX XX XXXX'
MSGSNS   DC    C'SNS XX XX XX XX XX XX XX XX XX XX XX XX'
         DC    C' XX XX XX XX XX XX XX XX XX XX XX XX'
MSGLUP   DC    C'LOOP XXXXX'
MSGNSIO  DC    X'1515',C'*UNIT=XXXX - START I/O NOT ACCEPTED '
MSGLUPX  DC    X'15',C'LOOP IS FINISHED ON UNIT XXXX',X'15'
MSGSTOP  DC    C'STOPPED ON ERROR'
A230D    DC    C'  '
A230F    DC    C'**'
INTEXT   DC    X'0018',C'EXT'
INTSVC   DC    X'0020',C'SVC'
INTPGM   DC    X'0028',C'PGM'
INTMCK   DC    X'0030',C'MCK'
INTI@O   DC    X'0038',C'I/O'
MSGSYNT  DC    X'15',C'*SYNTAX ERROR* ON INPUT',X'15'
INTLOC   DC    H'0'          KEEP IMMEDIATELY PRIOR TO INTMSG
INTMSG   DC    C'XXX-INTRPT,PSW = XX XX XXXX XX XXXXXX',X'15'
A236C    DC    C'X'
A236D    DC    C'X'
A236E    DC    H'0'
A2370    DC    40F'0'
         DC    X'FFFF'
A2412    DC    AL4(A0956),X'82',C'XO'
         DC    X'82',C'B',X'0'
         DC    X'82',C'G',X'0'
         DC    X'01',X'0'
         DC    AL4(A0F64),X'83',C'HLT'
         DC    X'83',C'STP'
         DC    X'02',C'H',X'0'
         DC    AL4(A0F6C),X'83',C'LST'
         DC    X'03',C'CCW'
         DC    AL4(A13AE),X'88',C'STRTRDR,'
         DC    X'86',C'STRDR,'
         DC    X'02',C'S,'
         DC    AL4(A0FF2),X'84',C'DVCQ'
         DC    X'03',C'DVQ'
         DC    AL4(A01B2),X'83',C'RQT'
         DC    X'82',C'F',X'0'
A246B    DC    X'04',C'RST',X'0'
         DC    AL4(A0F54),X'03',C'SCP'
         DC    AL4(A1114),X'04',C'CSWQ'
         DC    AL4(A1136),X'04',C'SNSQ'
         DC    AL4(A1154),X'02',C'RP'
         DC    AL4(A119C),X'02',C'DD'
         DC    AL4(A11AA),X'82',C'HX'
         DC    X'01',C'X'
         DC    AL4(A11D2),X'82',C'T',X'0'
         DC    X'03',C'TST'
         DC    AL4(A0558),X'02',C'TC'
         DC    AL4(A1264),X'02',C'MT'
         DC    AL4(A126A),X'03',C'DMP'
         DC    AL4(A1324),X'02',C'LP'
         DC    AL4(A133C),X'04',C'RMVQ'
         DC    AL4(A1362),X'84',C'MDST'
         DC    X'04',C'STMD'
         DC    AL4(A13C0),X'02',C'WT'
         DC    AL4(A13F6),X'86',C'CMPARE'
         DC    X'84',C'COMP'
A24F7    DC    X'03',C'CMP'
         DC    AL4(A139C),X'04',C'TMDL'
         DC    AL4(A1036),X'84',C'SBST'
A250D    DC    X'02',C'SB'
         DC    AL4(A1072)
A2514    DC    X'83',C'CPY'
         DC    X'02',C'C'      ???? ASSUME ERROR ?????
         DC    X'0'             ??? WILL THIS FIX IT ?
         DC    AL4(A10A4),X'04',C'NTBF'
         DC    AL4(A10E0),X'03',C'CMD'
         DC    X'FF'
A252C    DC    X'03010020',X'02',C'NP'
         DC    X'04000020',X'03',C'SNS'
         DC    X'27070800',X'89',C'SKDSTSCTR'
         DC    X'03',C'SSS'
         DC    X'23010100',X'86',C'STSCTR'
         DC    X'02',C'SS'
         DC    X'53012000',X'88',C'DGNSTCLD'
         DC    X'02',C'DL'
         DC    X'73002020',X'89',C'DGNSTCWRT'
         DC    X'02',C'DW'
         DC    X'94000020',X'83',C'RLS'
         DC    X'02',C'RL'
         DC    X'B4000020',X'84',C'RSRV'
         DC    X'03',C'RSV'
         DC    X'1F018000',X'87',C'STFLMSK'
         DC    X'86',C'STFLMK'
         DC    X'84',C'FLMK'
         DC    X'84',C'STMK'
         DC    X'83',C'SMK'
         DC    X'02',C'MK'
         DC    X'1B060800',X'84',C'SKHD',X'04',C'SKHH'
         DC    X'0B060800',X'84',C'SKCL',X'04',C'SKCC'
         DC    X'07060800',X'02',C'SK'
         DC    X'13010020',X'86',C'RCLBRT',X'03',C'RCL'
         DC    X'17010020',X'04',C'RSTR'
         DC    X'C3010020',X'05',C'RSTBF'
         DC    X'0F030320',X'85',C'SPCNT',X'06',C'SPCCNT'
         DC    X'07011020',X'84',C'RWND',X'83',C'RWD',X'02',C'RW'
         DC    X'0F011020',X'82',C'RN',X'03',C'NLD'
         DC    X'1F011020',X'02',C'M',X'0'
         DC    X'17011020',X'02',C'RG'
         DC    X'27011020',X'83',C'NBL',X'84',C'BLSP'
         DC    X'82',C'BK',X'03',C'BSP'
         DC    X'2F011020',X'84',C'DSBL',X'03',C'BSF'
         DC    X'37011020',X'03',C'FSR'
         DC    X'3F011020',X'03',C'FSF'
         DC    X'11806F20',X'02',C'RS'
         DC    X'0A200120',X'84',C'NHBT',X'82',C'NH'
         DC    X'85',C'RDNQR',X'04',C'RDNQ'
         DC    AL4(A26FC),X'84',C'SRCH',X'83',C'SCH',X'01',C'S'
         DC    AL4(A27A2),X'82',C'RD',X'01',C'R'
         DC    AL4(A2860),X'83',C'WRT',X'82',C'WR',X'01',C'W'
         DC    X'09102020',X'83',C'PLL',X'02',C'TP'
         DC    X'83',C'PRT',X'04',C'PRNT'
         DC    X'E1102020',X'09',C'PNCH42BNR'
         DC    X'C1102020',X'06',C'PNCH42'
         DC    X'21102020',X'07',C'PNCHBNR'
         DC    X'01102020',X'83',C'PCH',X'04',C'PNCH'
         DC    X'CC000000',X'04',C'XXXX'
         DC    X'FF'
A26FC    DC    X'39440800',X'83',C'QH',X'0'
         DC    X'83',C'HQ',X'0'
         DC    X'82',C'Q',X'0',X'03',C'QHA'
         DC    X'2D406320',X'82',C'DT',X'83',C'QDT',X'03',C'KDQ'
         DC    X'4D406320',X'83',C'HDT',X'03',C'KDH'
         DC    X'6D406320',X'84',C'QHDT',X'84',C'HQDT',X'04',C'KDQH'
         DC    X'31450C00',X'83',C'QLD',X'82',C'DQ'
         DC    X'82',C'D',X'0',X'82',C'QD',X'03',C'QID'
         DC    X'51450C00',X'84',C'QGHD',X'82',C'HD',X'02',C'DH'
         DC    X'71450C00',X'83',C'DQH',X'83',C'QHD',X'03',C'HQD'
         DC    X'29404220',X'83',C'QLK'
         DC    X'82',C'K',X'0',X'82',C'QK',X'02',C'KQ'
         DC    X'49404220',X'84',C'HGHK',X'82',C'HK',X'02',C'KH'
         DC    X'69404220',X'83',C'QHK',X'83',C'HQK',X'03',C'KQH'
         DC    X'FF'
A27A2    DC    X'1A050000',X'01',C'H'
         DC    X'0A000320',X'86',C'R0SPCL',X'03',C'R0S'
         DC    X'22010000',X'83',C'SCT',X'01',C'S'
         DC    X'A4000020',X'8A',C'RSTBFFRDLG'
         DC    X'85',C'RSTBL',X'83',C'RSL',X'02',C'BL'
         DC    X'44000120',X'8B',C'DGNSTCSTTS1',X'03',C'DS1'
         DC    X'16000320',X'82',C'R0',X'01',C'R'
         DC    X'1E800320',X'86',C'CNTKDT',X'03',C'CLD'
         DC    X'0E800320',X'83',C'KDT',X'02',C'KD'
         DC    X'02200180',X'02',C'DC'
         DC    X'06A00120',X'82',C'DT',X'01',C'D'
         DC    X'02200120',X'83',C'CRD',X'82',C'CD',X'02',C'PL'
         DC    X'12080000',X'83',C'CNT',X'01',C'C'
A283C    DC    X'02200120',X'01',X'0'
         DC    X'0C200120',X'87',C'BCKWRDS'
         DC    X'83',C'BCK',X'82',C'BK',X'02',C'B',X'0'
         DC    X'E2200120',X'02',C'BF'
         DC    X'FF'
A2860    DC    X'19058800',X'01',C'H'
         DC    X'1580EF00',X'82',C'R0',X'02',C'R',X'0'
         DC    X'1D806F00',X'86',C'CNTKDT',X'03',C'CKD'
         DC    X'01806F00',X'8A',C'SPCLCNTKDT',X'05',C'SPCKD'
         DC    X'0D806300',X'83',C'KDT',X'02',C'KD'
         DC    X'011020C0',X'02',C'DC'
         DC    X'05802100',X'82',C'P',X'0',X'82',C'DT',X'01',C'D'
         DC    X'E1102000',X'02',C'BF'
A28B9    DC    X'01102020',X'01',X'0'
         DC    X'FF'
A28C0    DC    X'40000000',X'01',X'0'
         DC    X'10000000',X'03',C'SKP'
         DC    X'20000000',X'02',C'SL'
         DC    X'80000000',X'02',C'DC'
         DC    X'01000000',X'05',C'LNGTH'
         DC    X'08000000',X'02',C'PC'
         DC    X'02000000',X'03',C'FRM'
         DC    X'04000000',X'02',C'NT'
         DC    X'40200000',X'84',C'RPPL',X'02',C'RP'
         DC    X'40100000',X'84',C'RNDM',X'02',C'RN'
         DC    X'FF'
         SPACE 1
         DS    0D
A2920    DS    20CL256       WORK AREA
         ORG   A2920
         SPACE 3
         CLI   TIMER2+2,C'C'  SPECIAL CONSOLE INTERFACE ?
         BNE   CONGETI        NO
         MVC   CONFLG,TIMER2+3  COPY CONSOLE TYPE
         MVC   2(4,0),TIMER2    SAVE STUFF
CONGETI  MVC   PSWEXT(40),NEWPSWS
         MVC   80(3),CYLADR
         LH    R12,2         GET IPL/INTERRUPT UNIT
         CLI   4,C'C' SPECIAL CONSOLE ADDRESS INTERFACE ?*AMS*
         BE    IPLGET         YES - PROCEED IMMEDIATELY         *AMS*
A2930    TIO   0(R12)                       *
         BC    2,A2930
         LA    R6,CONSTABL
CONTEST  LH    R12,0(,R6)
         TCH   0(R12)                       *
         BC    1,CONSKIP
         LA    R4,CCWINH
         ST    R4,CAW
         SIO   0(R12)                       *
         BZ    A2994
A2958    LA    R4,CCWSENSE
         ST    R4,CAW
         SIO   0(R12)                       *
A2964    TIO   0(R12)                       *
         BC    2,A2964
CONSKIP  LA    R6,2(,R6)
         CLI   0(R6),X'FF'
         BNE   CONTEST
         LA    R4,A2984
         ST    R4,PSWIOP+4
IPLIONT  LPSW  IPLWAIT
A2984    TM    CSW+4,X'80'
         BZ    IPLIONT
         LH    R12,PSOIOP+2
         B     A29B8
A2994    HIO   0(R12)                       *
A2998    TIO   0(R12)                       *
         BNZ   A2998
         LA    R4,CCWUPLO
         ST    R4,CAW
         SIO   0(R12)                       *
         BNZ   A2958
A29B0    TIO   0(R12)                       *
         BNZ   A29B0
IPLGET   STH   R12,DEVCUU
A29B8    STH   R12,CONCUU
         SLR   R11,R11                                           84127
         ICM   R11,1,CONFLG  LOAD THE CONSOLE TYPE               84127
         BZ    INITCON       1052/3215 - ALL SET                 84127
         L     R11,CONSPTR-4(R11)  GET POINTER                   84127
         MVC   CRTCCWR(CRTOVLAY),0(R11)  USE CORRECT CONSTANTS
         MVC   CRTFIX1(4),CRTSSM       CHANGE BYPASS TO SSM
         MVC   CRTFIX2(4),CRTSSM
INITCON  BAL   R11,PUTMSG
         DC    X'0935',Y(MSGIPL1-FRIENDLY)                       84127
         MVC   PSWRSTRT,IPLRSTRT
         MVC   PSWEXT+4(4),IPLRSTRT
         NOP   NEEDMODL
         BAL   R11,PUTMSG
         DC    X'0950',Y(MSGIPL2-FRIENDLY)                       84127
         BAL   R11,PUTMSG
         DC    X'094B',Y(MSGIPL3-FRIENDLY)                       84127
         BAL   R11,PUTMSG
         DC    X'094D',Y(MSGIPL4-FRIENDLY)                       84127
         BAL   R11,PUTMSG
         DC    X'0935',Y(MSGIPL5-FRIENDLY)                       84127
         BAL   R11,PUTMSG
         DC    X'092A',Y(MSGIPL6-FRIENDLY)                       84127
         BAL   R11,PUTMSG
         DC    X'0931',Y(MSGIPL7-FRIENDLY)                       84127
NEEDMODL XC    CONBUF(16),CONBUF
         MVC   PSWEXT+4(4),NEWPSWS+4
         LA    R11,NOTMD370  GET PROGRAM CHECK INTERRUPT ADDRESS
         ST    R11,PSWPGM+4  SET INTO CHECK ADDRESS
         DC    X'B202',S(CONBUF+8)  STIDP
         UNPK  CONBUF(4),CONBUF+12(3)   UNPACK CPU ID
NOTMD370 MVC   PSWPGM+4(4),NEWPSWS+4+(PSWPGM-PSWEXT)  RESTORE ADDR
         CLI   CONBUF,X'0'   360 ?
         BNE   HAVEMODL      NO; TRY THIS ONE
GETMODL  BAL   R11,CONMSG
         DC    X'010B',Y(MGQMODL-FRIENDLY)                       84127
HAVEMODL CLI   CONBUF,C'1'   PRESUMED 370 ?
         BL    CHKMODL       NO; CHECK IT                        84127
         XR    R2,R2
         IC    R2,CONBUF+1
         LA    R2,1(,R2)     YES; SET FOR ONE HIGHER THAN 360
         STC   R2,CONBUF
CHKMODL  CLI   CONBUF,C'2'
         BL    BADMODL
         CLI   CONBUF,C'7'
         BH    BADMODL
         NI    CONBUF,X'07'
         XR    R2,R2
         IC    R2,CONBUF
         SLL   R2,3
         LA    R3,CPUFACT1-16(R2)
         MVC   CPUSPYD1(8),0(R3)  SET RELATIVE CPU-I/O SPEEDS
         MVC   PSWRSTRT,RUNRSTRT
         MVI   REINIT+1,X'00'
         B     REINIT
BADMODL  BAL   R11,PUTMSG
         DC    X'0924',Y(MSGBAMO-FRIENDLY)                       84127
         B     GETMODL
         SPACE 1
CRTSSM   SSM   CRTCCWR+5     DISABLE EVERYTHING
         SPACE 1
CCWINH   CCW   X'0A',CCWINH,SLI+NOR,1
CCWUPLO  CCW   X'09',UCLC1052,0,4
IPLWAIT  DC    X'FE0600000F',AL3(IPLIONT)
RUNRSTRT DC    X'010400000F',AL3(REINIT)
IPLRSTRT DC    X'00040000',A(NEEDMODL)
CPUFACT1 DC    F'461,432'    360/2X
         DC    F'311,190'    360/3X    370/12X
         DC    F'162,106'    360/4X    370/13X
         DC    F'70,55'      360/5X    370/14X
         DC    F'20,20'      360/6X    370/15X
         DC    F'15,12'      360/7X    370/16X
         SPACE 1
MSGIPL1  DC    C'F R I E N D 4.5 MODIFIED FOR 3670 AND 3675 BY MEMOREX'
MSGIPL2  DC    X'15',C'*WARNING* WRITE COMMANDS MAY DESTROY DATA'
         DC    X'15',C'ON A CUSTOMER PACK/CELL OR CE TRACKS.'
MSGIPL3  DC    X'15',C'INTERPRETIVE PROGRAM TO XEQ CCW COMMANDS'
         DC    X'15',C'THAT YOU ENTER FOR ANY DEVICE(S).'
MSGIPL4  DC    X'15',C'AFTER INSTRUCTIONS ARE TYPED,ENTER EACH COMMAND'
         DC    X'15',C'WHEN PROCEED LIGHT TURNS ON.'
MSGIPL5  DC    X'15',C'TERMINATE EACH ENTRY WITH AN ALTERNATE CODE 5'
         DC    C' (EOB).'
MSGIPL6  DC    X'15',C'AFTER CCW CHAIN HAS BEEN ENTERED,TYPE GO.'
MSGIPL7  DC    C'TO ENTER NEXT CCW CHAIN,PRESS REQUEST,TYPE RESET.'
MGQMODL  DC    X'15',C'CPU MODEL='
MSGBAMO  DC    C'*INVALID CPU MODEL, USE 25-75,125-165'
UCLC1052 DC    X'15360636'
CONSPTR  DC    A(CRT3066,CRT3270,CRT4341)                        84127
NEWPSWS  DC    X'000400000F',AL3(EXTINT)
         DC    X'010400000F',AL3(SVCINT)
         DC    X'0104000000',AL3(PGMINT)
         DC    X'010000000F',AL3(MCKINT)
         DC    X'010400000F',AL3(0)
         DS    0H            ALIGNMENT FOR CONSOLE ADDRESSES
CONSTABL DC    X'001F',X'0009',X'0209',X'021F',X'0309'  1052/3215
         DC    X'0019'                                  3066
         DC    X'0010',X'0011'    TURNKEY               3158    GP08082
         DC    X'0008'       4341 20-LINE 3278/79                84127
         DC    X'00C001C0'        TURNKEY - 3272/3277-2         GP08082
         DC    X'00000000'
         DC    X'FF'
         SPACE 2
*        3066 CRT CONSOLE SUPPORT PATTERN
*
CRT3066  CCW   X'07',0,CC+SLI,2        ERASE SCREEN             *AMS*
         CCW   X'27',*-3,CC+SLI,2      SET BUFFER ADD (0,0)     *AMS*
         CCW   X'01',CR6BUF,CC+SLI,CR6BUFL  WRITE FULL SCREEN   *AMS*
         CCW   X'0F',CC6IN@,SLI,2      SET CURSOR               *AMS*
         CCW   X'0E',CONBUF-3,CC+SLI,3   READ CONTROL INPUT     *AMS*
         CCW   X'27',CC6IN@,CC+SLI,2   SET BUFFER ADDRESS       *AMS*
         CCW   X'06',CONBUF,SLI,79     READ DATA INPUT          *AMS*
         DC    A(CR6LIN1)    ADDRESS OF FIRST DATA LINE         *AMS*
         DC    H'33'         NUMBER OF LINES TO ROLL
         DC    AL2(CR6LIN2-CR6LIN1)  LINE SPACING
         DC    AL2(L'CR6LIN1)   LENGTH OF DATA PORTION OF LINE
         MVC   0(L'CR6LIN1,R3),CR6LIN2-CR6LIN1(R3)  ROLL MOVE
         MVC   0(L'CR6LINL,R3),BLANKS     ROLL - CLEAR BOTTOM LINE
         SPACE 2
*        3270 CRT CONSOLE SUPPORT PATTERN
*
CRT3270  CCW   X'05',CR7BUF,SLI,CR7BUFL  WRITE/ERASE FULL SCREEN*AMS*
         DC    D'0'          3066 FILL                          *AMS*
         DC    D'0'          3066 FILL                          *AMS*
         DC    D'0'          3066 FILL                          *AMS*
         CCW   X'06',CONBUF-6,SLI,6+78   READ MODIFIED          *AMS*
         DC    D'0'          3066 FILL                          *AMS*
         DC    D'0'          3066 FILL                          *AMS*
         DC    A(CR7LIN1)    ADDRESS OF FIRST DATA LINE         *AMS*
         DC    H'22'         NUMBER OF LINES TO ROLL
         DC    AL2(CR7LIN2-CR7LIN1)  LINE SPACING
         DC    AL2(L'CR7LIN1)   LENGTH OF DATA PORTION OF LINE
         MVC   0(L'CR7LIN1,R3),CR7LIN2-CR7LIN1(R3)  ROLL MOVE
         MVC   0(L'CR7LINL,R3),BLANKS     ROLL - CLEAR BOTTOM LINE
         SPACE 2                                                 84127
*        4341 20-LINE 3278/79 CRT CONSOLE SUPPORT PATTERN        84127
*                                                                84127
CRT4341  CCW   X'05',CR7BUF,DC+SLI,CR4BUFL1 ERASE/WRITE SCREEN   84127
         CCW   X'05',CR4BUF,SLI,CR4BUFL2     INPUT FIELD         84127
         DC    D'0'          3066 FILL                          *
         DC    D'0'          3066 FILL                          *
         CCW   X'06',CONBUF-6,SLI,6+78   READ MODIFIED          *
         DC    D'0'          3066 FILL                          *
         DC    D'0'          3066 FILL                          *
         DC    A(CR7LIN1)    ADDRESS OF FIRST DATA LINE         *
         DC    H'18'         NUMBER OF LINES TO ROLL             84127
         DC    AL2(CR7LIN2-CR7LIN1)  LINE SPACING                84127
         DC    AL2(L'CR7LIN1)   LENGTH OF DATA PORTION OF LINE   84127
         MVC   0(L'CR7LIN1,R3),CR7LIN2-CR7LIN1(R3)  ROLL MOVE    84127
         MVC   0(L'CR7LINL,R3),BLANKS     ROLL - CLEAR BOTTOM LIN
         EJECT ,
FRIENDLY CSECT ,             BACK TO MAIN CONTROL SECTION
         ORG   FRIENDLY+X'5000'   UNBASED STORAGE
         SPACE 1
*        3270 OUTPUT BUFFER
*
CR7BUF   DC    X'C31140401D60' KBY/MDT RESTORE, SBA,1,1 SF,P    *AMS*
CR7LIN1  DC    CL79' ',X'11C1501D60' DATA / SBA 2,1 SF,P        *AMS*
CR7LIN2  DC    CL79' ',X'11C2601D60' DATA / SBA 3,1 SF,P        *AMS*
         DC    CL79' ',X'11C3F01D60' DATA / SBA 4,1 SF,P        *AMS*
         DC    CL79' ',X'11C5401D60' DATA / SBA 5,1 SF,P        *AMS*
         DC    CL79' ',X'11C6501D60' DATA / SBA 6,1 SF,P        *AMS*
         DC    CL79' ',X'11C7601D60' DATA / SBA 7,1 SF,P        *AMS*
         DC    CL79' ',X'11C8F01D60' DATA / SBA 8,1 SF,P        *AMS*
         DC    CL79' ',X'114A401D60' DATA / SBA 9,1 SF,P        *AMS*
         DC    CL79' ',X'114B501D60' DATA / SBA 10,1 SF,P       *AMS*
         DC    CL79' ',X'114C601D60' DATA / SBA 11,1 SF,P       *AMS*
         DC    CL79' ',X'114DF01D60' DATA / SBA 12,1 SF,P       *AMS*
         DC    CL79' ',X'114F401D60' DATA / SBA 13,1 SF,P       *AMS*
         DC    CL79' ',X'1150501D60' DATA / SBA 14,1 SF,P       *AMS*
         DC    CL79' ',X'11D1601D60' DATA / SBA 15,1 SF,P       *AMS*
         DC    CL79' ',X'11D2F01D60' DATA / SBA 16,1 SF,P       *AMS*
         DC    CL79' ',X'11D4401D60' DATA / SBA 17,1 SF,P       *AMS*
         DC    CL79' ',X'11D5501D60' DATA / SBA 18,1 SF,P       *AMS*
         DC    CL79' ',X'11D6601D60' DATA / SBA 19,1 SF,P       *AMS*
CR4LINL  DC    CL79' '       LAST LINE ON 4341                   84127
CR4BUFL1 EQU   *-CR7BUF      FIRST WRITE CCW LENGTH FOR 4341     84127
         DC    X'11D7F01D60' DATA / SBA 20,1 SF,P                84127
         DC    CL79' ',X'11D9401D60' DATA / SBA 21,1 SF,P       *AMS*
         DC    CL79' ',X'115A501D60' DATA / SBA 22,1 SF,P       *AMS*
         DC    CL79' ',X'115B601DE8' DATA / SBA 23,1 SF,(P,I)   *AMS*
CR7LINL  DC    CL79' ',C'>',X'115CF11D4013' DATA/SBA 24,2 SF,U IC *AMS*
CR7BUFL  EQU   *-CR7BUF                                         *AMS*
         DC    C'HIT ENTER TO PROCEED'  WAIT MESSAGE            *AMS*
CR7BUFW  EQU   *-CR7BUF      WAIT MESSAGE LENGTH                *AMS*
         SPACE 1                                                 84127
CR4BUF   DC    C'>',X'11D7F11D4013' DATA/SBA 20,2 SF,U IC        84127
CR4BUFL2 EQU   *-CR4BUF                                          84127
         DC    C'HIT ENTER TO PROCEED'  WAIT MESSAGE            *
CR4BUFW  EQU   *-CR4BUF      WAIT MESSAGE LENGTH                 84127
         SPACE 2                                                *AMS*
*        3066 BUFFER                                            *AMS*
CR6BUF   DS    0D            3066 SCREEN BUFFER                 *AMS*
CR6LIN1  DC    CL80' '       FIRST DATA LINE                    *AMS*
CR6LIN2  DC    32CL80' '     INTERMEDIATE DATA LINES            *AMS*
CR6LINL  DC    CL80' '       CURRENT/LAST LINE                  *AMS*
         DC    C'>'          INPUT LINE POINTER                 *AMS*
CR6BUFL  EQU   *-CR6BUF      LENGTH OF BUFFER                   *AMS*
         DC    C' ***  HIT ENTER TO PROCEED'                    *AMS*
CR6BUFW  EQU   *-CR6BUF      WAIT MESSAGE LENGTH                *AMS*
         SPACE 2
         END   STARTUP
