UCSNONE  TITLE '''NONE'' PRINT IMAGE FOR NO TRANSLATION AT ALL'
*
*   USED TO BYPASS TRANSLATION FOR MVS 3.8J UNDER HERCULES      GP08114
*
UCS1NONE CSECT
         DC    X'00'
         DC    AL1(02)
         DC    AL1(128,128)
CHARS    DC    256AL1(*-CHARS)    ALL VALID
         END
