OCRA     TITLE 'U C S 2 O 1 1  ***  3211 DEFINITION FOR OCR-A TRAIN'
UCS2O11  START 0             (EXTRN ALIAS UCS2ON)       ADDED ON 88271
         DC    X'40',AL1(9),9AL1(48)  FOLD / 9 LINES
         DC    9C'@ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789-&&ö.,*/Öó$#'
*        UNPRINTABLE CHARACTERS IN ABOVE DC FOR HOOK, FORK AND CHAIR
         DC    15X'0'        RESERVED - 433-447
         SPACE 1
*        NOTE THAT DUELING IS ILLEGAL, AS SHOULD BE DUALING
*
         DC    X'C0101010101010101010004010001000'  448-463
         DC    X'40101010101010101010004060000000'  464-479
         DC    X'40401010101010101010004010000000'  480-495
         DC    X'10101010101010101010004040000000'  496-511
         DC    X'00'         RESERVED 512
         SPACE 1
         END   ,
