)BODY EXPAND(\\)
%\-\ DASD Space (4 of 4) \-\
%Command ===>_ZCMD
%
%                --------------------------------------------------
                 | Direct Access Storage Device Space Utilization |
                 --------------------------------------------------
+
 The following alternative%sort orders+may be optionally specified for any
 combination of displayed storage volumes in the%"Sort by"+field:%1-Volume
 serial, 2-Device number (i.e. UCB address), 3-Total no. free cylinders, and
 4-Maximum no. of contiguous free cylinders.
+
 The characters%"S" or "B"+may be typed on one or more online storage devices
 to cause the LMDDISP dialog service to be invoked placing the user in an ISPF
 option 3.4 display of all data sets that reside on one or more volumes.  The
 default view for this display is the %data set space+display.

)PROC
  &ZUP = FDSPACH1
)END
