//WSBGCBRT JOB ,'SAM GOLOB',CLASS=S,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//TESTCALL EXEC PGM=CBRTST
//STEPLIB  DD   DISP=SHR,DSN=WSBG.LOAD
//SYSPRINT DD   SYSOUT=*,DCB=RECFM=FBA
//SYSIN    DD   DISP=SHR,DSN=WSBG.EDIT.SPLIT.STATEMTS
