//LIBRARY  EXEC  LIBACS,LIBRARY='?SRCE',
//         ENV='?APID',PLATFORM='?ENVR'
//STEPLIB DD DSN=DATACOM.?APID.?ENVR.DBLOAD,DISP=SHR
//UPDATE.AUXINC1  DD  DSN=HLQ.?APID.SAT.LIBMAST,DISP=SHR
//UPDATE.AUXINC2  DD  DSN=HLQ.?APID.PRD.LIBMAST,DISP=SHR
//UPDATE.AUXINC3  DD  DSN=HLQ.PRD.LIBMAST,DISP=SHR
//UPDATE.SYSIN  DD  *
-SEL ?MEMB,?PSWD,NOLIST,EXEC,COPYDD,VAR
-PGMR ?PGMR
-DESC ?DESC
-REP ALL
-END
//COBOL  EXEC  CICSCOB,AAFX='?APIDDY2AA',
//         INDEX='CICS.APP',
//         PLIST='NOLIST',ULIB='?MAPC',
//         OPT='DATA(?DLEN),?CCOP'
//LINK   EXEC  CICSLNKC,COND=(5,LT,COBOL.COMP),
//         INDEX='CICS.APP',
//         PLATFORM='?ENVR',PPTNAME='?LNAM',
//         MODE='?CMOP',LOPT='?CLOP'
//LKED.SYSLIB  DD
//             DD DSN=HLQ.DVL.ONLLOAD,DISP=SHR
//             DD
//             DD
//             DD DSN=HLQ.DVL.BATLOAD,DISP=SHR
//             DD DSN=HLQ.DVL.BATLOAD,DISP=SHR
//LKED.SYSLMOD DD DSN=?OLNK,DISP=SHR
//LKED.SYSIN DD *
  INCLUDE DBLOAD(DBCSVPR)
  NAME ?LNAM(R)
