         MACRO
&NAME    VAL   &REG,&VAL           GET VALUE INTO REG
         AIF   ('&VAL'(1,1) NE '(').NOTGPR
         AIF   ('&VAL(1)' NE '&REG').DOLR
         AIF   ('&NAME' EQ '').MEND NO USELESS STATEMENTS, PLEASE...
&NAME    DC    0H'0'               TARGET AND SOURCE REGS IDENTICAL
         MEXIT
.DOLR    ANOP
&NAME    LR    &REG,&VAL(1)        COPY VALUE TO CORRECT REGISTER
         MEXIT
.NOTGPR  AIF   (T'&VAL EQ 'H').DOHALF
         AIF   ('&VAL'(1,1) GE '0').SELFDEF GO IF SELF-DEFINING
&NAME    L     &REG,&VAL(1)        LOAD VALUE INTO REGISTER
         MEXIT
.DOHALF  LH    &REG,&VAL(1)        LOAD VALUE INTO REGISTER
         MEXIT
.SELFDEF ANOP
&NAME    LA    &REG,&VAL           LOAD VALUE INTO REGISTER
.MEND    MEND
