jobcard
//*
//HLASMC  PROC
//ASSEM   EXEC PGM=ASMA90,REGION=1024K,
//             PARM='DECK,NOOBJECT'
//SYSLIB  DD  DSN=SYS1.MACLIB,DISP=SHR
//        DD  DSN=SYS1.MODGEN,DISP=SHR
//        DD  DSN=SYS1.AMODGEN,DISP=SHR
//        DD  DSN=SYS1.SIATMAC,DISP=SHR
//        DD  DSN=SDMVS.USERMOD.MACLIB,DISP=SHR
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(CYL,(20,5))
//SYSUT2   DD  UNIT=SYSALLDA,SPACE=(CYL,(10,1))
//SYSUT3   DD  UNIT=SYSALLDA,SPACE=(CYL,(2,1))
//SYSPRINT DD  SYSOUT=*
// PEND
//ASM1 EXEC HLASMC
//ASSEM.SYSIN    DD  DSN=USERMOD.SOURCE(USYNC),DISP=SHR
//ASSEM.SYSPUNCH DD  DSN=USERMOD.OBJ(USYNC),DISP=SHR
//LKED EXEC PGM=IEWL,PARM='RENT,REUS,AC=1'
//SYSPRINT DD  SYSOUT=*
//EXITOBJ  DD  DSN=USERMOD.OBJ,DISP=SHR
//SYSLMOD  DD  DSN=USERMOD.LOADLIB,DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(4096,(50,50))
//SYSLIN   DD  *
 INCLUDE EXITOBJ(USYNC)
 ENTRY USYNC
 NAME USYNC(R)
/*
