//SBGOLOBM JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//*  Cut a "real tape" from a FLEX-ES Faketape virtual
//*  tape image, which has been folded over on MVS into
//*  FB (fixed blocked) LRECL=80 format.
//*
//AWSREAD  EXEC PGM=VTT2FK2T PARM=READ
//STEPLIB   DD  DISP=SHR,DSN=SBGOLOB.LOAD
//FAKEIN    DD  DISP=SHR,DSN=SBGOLOB.V467MU.FAKE
//TAPOUT    DD  DISP=OLD,UNIT=562,VOL=SER=V467TV,
//          LABEL=(1,BLP,EXPDT=98000)
//SYSIN     DD  *
NEWVOL=V467MT
//SYSPRINT  DD  SYSOUT=*
//SYSFILES  DD  SYSOUT=*
//SYSTRACE  DD  SYSOUT=*
//SYSMOVED  DD  SYSOUT=*
//SYSUDUMP  DD  SYSOUT=*
