//SBGOLOBM JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//AWSCNVT  EXEC PGM=VTT2CNVU
//STEPLIB   DD  DISP=SHR,DSN=SBGOLOB.LOAD
//AWSVBIN   DD  DISP=SHR,DSN=SBGOLOB.TST440.AWSIMAGE
//AWSFBOUT  DD  DISP=SHR,DSN=SBGOLOB.AWSFB80
//*WSFBOUT  DD  DISP=(NEW,CATLG,DELETE),DSN=SBGOLOB.AWSFB80,
//*         DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920),
//*         UNIT=SYSALLDA,SPACE=(TRK,(5,5),RLSE)
//SYSPRINT  DD  SYSOUT=*
//SYSFILES  DD  SYSOUT=*
//SYSTRACE  DD  SYSOUT=*
//SYSMOVED  DD  SYSOUT=*
//SYSUDUMP  DD  SYSOUT=*
