       ID DIVISION.
       PROGRAM-ID. DM210PRP.
       AUTHOR. PAT RUSSELL.
       REMARKS.
      *
      *    DISK MANAGMENT CONTROL REPORTS
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       OBJECT-COMPUTER. IBM-370.
       SOURCE-COMPUTER. IBM-370.
       SPECIAL-NAMES.
           C01 IS TO-TOP.
           EJECT
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT VOLSERIN ASSIGN TO UT-S-VOLSERIN.
           SELECT OUTFIXC  ASSIGN TO UT-S-OUTFIXC.
           SELECT MASTER   ASSIGN TO UT-S-MASTER.
           SELECT RPTVDET  ASSIGN TO UT-S-RPTVDET.
           SELECT RPTVSUM  ASSIGN TO UT-S-RPTVSUM.
           SELECT RPTXTNT  ASSIGN TO UT-S-RPTXTNT.
           SELECT RPTVTNT  ASSIGN TO UT-S-RPTVTNT.
           SELECT RPTOVER  ASSIGN TO UT-S-RPTOVER.
           SELECT RPTEOLD  ASSIGN TO UT-S-RPTEOLD.
           SELECT RPTRGDG  ASSIGN TO UT-S-RPTRGDG.
           SELECT RPTPERM  ASSIGN TO UT-S-RPTPERM.
           SELECT RPTMPTY  ASSIGN TO UT-S-RPTMPTY.
           SELECT RPTSUMY  ASSIGN TO UT-S-RPTSUMY.
           SELECT SORTVOL  ASSIGN TO UT-S-SORTWK01.
           SELECT SORTAAM  ASSIGN TO UT-S-SORTWK01.
           SKIP2
       DATA DIVISION.
       FILE SECTION.
           SKIP2
       FD  RPTVDET
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 133 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS VDET-REC.
       01  VDET-REC                PIC X(133).
           SKIP2
       FD  RPTVSUM
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 133 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS VSUM-REC.
       01  VSUM-REC                PIC X(133).
           SKIP2
       FD  RPTXTNT
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 133 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS XTNT-REC.
       01  XTNT-REC                PIC X(133).
           SKIP2
       FD  RPTVTNT
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 133 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS VTNT-REC.
       01  VTNT-REC                PIC X(133).
           SKIP2
       FD  RPTOVER
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 133 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS OVER-REC.
       01  OVER-REC                PIC X(133).
           SKIP2
       FD  RPTEOLD
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 133 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS EOLD-REC.
       01  EOLD-REC                PIC X(133).
           SKIP2
       FD  RPTRGDG
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 133 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS RGDG-REC.
       01  RGDG-REC                PIC X(133).
           SKIP2
       FD  RPTPERM
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 133 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS PERM-REC.
       01  PERM-REC                PIC X(133).
           SKIP2
       FD  RPTMPTY
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 133 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS MPTY-REC.
       01  MPTY-REC                PIC X(133).
           SKIP2
       FD  RPTSUMY
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 133 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS SUMY-REC.
       01  SUMY-REC                PIC X(133).
           SKIP2
       FD  OUTFIXC
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 80 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS FIXC-REC.
       01  FIXC-REC                PIC X(80).
       FD  VOLSERIN
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 80 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS VOL-REC.
       01  VOL-REC.
           COPY CDMFD020.
           SKIP2
       FD  MASTER
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 150 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS FILE-OUT.
       01  FILE-OUT.
           COPY CDMFD000.
           SKIP2
       SD  SORTVOL
           RECORDING MODE IS F
           DATA RECORD IS SVOL-REC.
       01  SVOL-REC.
           02  SVOL-AAM            PIC X(3).
           02  SVOL-SW.
               03  SVOL-SW-1       PIC X.
               03  SVOL-SW-2       PIC X.
               03  SVOL-SW-3       PIC X.
           02  SVOL-DSNAME         PIC X(44).
           02  SVOL-ALLOC          PIC 9(5).
           02  SVOL-USED-CUR       PIC 9(5).
           02  SVOL-DSORG          PIC X(3).
           02  SVOL-RECFM          PIC X(3).
           02  SVOL-BLKSIZE        PIC 9(5).
           02  SVOL-LRECL          PIC 9(5).
           02  SVOL-VOLSER         PIC X(6).
           02  SVOL-USED-HI        PIC 9(5).
           02  SVOL-DT-CREATE      PIC 9(5).
           02  SVOL-DT-REF         PIC 9(5).
           02  SVOL-EXTENT-CT      PIC 9(2).
           02  SVOL-USED-LO        PIC 9(5).
           SKIP2
       SD  SORTAAM
           RECORDING MODE IS F
           DATA RECORD IS SAAM-REC.
       01  SAAM-REC.
           02  SAAM-AAM            PIC X(3).
           02  SAAM-SW.
               03  SAAM-SW-1       PIC X.
               03  SAAM-SW-2       PIC X.
               03  SAAM-SW-3       PIC X.
           02  SAAM-DSNAME         PIC X(44).
           02  SAAM-VOLSER         PIC X(6).
           02  SAAM-ALLOC          PIC 9(5).
           02  SAAM-DSORG          PIC X(3).
           02  SAAM-DT-REF         PIC 9(5).
           02  SAAM-DIFFDAY        PIC 9(5).
           EJECT
       WORKING-STORAGE SECTION.
       01  WS-MISC-CHAR.
           02  WS-FIXC-SW          PIC X      VALUE 'N'.
           02  WS-XTNT-SW          PIC X      VALUE 'N'.
           02  MASTER-EOF-SW       PIC X      VALUE 'N'.
               88  MASTER-EOF      VALUE 'Y'.
           02  SORTFILE-EOF-SW     PIC X      VALUE 'N'.
               88  SORTFILE-EOF    VALUE 'Y'.
           02  WS-XTNT-1           PIC S9(6)V9 COMP-3 VALUE +0.
           02  WS-XTNT-SB          PIC S9(5) COMP-3 VALUE +0.
           02  WS-XTNT-2           PIC S9(5) COMP-3 VALUE +0.
           02  WS-VOL-ALLOC        PIC S9(5) COMP-3 VALUE +0.
           02  WS-VOL-USED-CUR     PIC S9(5) COMP-3 VALUE +0.
           02  WS-VOL-USED-LO      PIC S9(5) COMP-3 VALUE +0.
           02  WS-VOL-USED-HI      PIC S9(5) COMP-3 VALUE +0.
           02  WS-VOL-VOLSER       PIC X(6)   VALUE LOW-VALUES.
           02  WS-VOL-BYTES        PIC 9999999.
           02  WS-VOL-TRK-CYL      PIC 999.
           02  WS-VOL-CYL-VOL      PIC 99999.
           02  WS-VOL-POOL         PIC XXX.
           02  WS-VOL-SW-DUP       PIC X.
           02  WS-VOL-TRK-VOL      PIC 9999999.
           02  WS-VOL-PCT          PIC S999V9  VALUE +0.
           02  WS-VOL-HI-PCT       PIC S999V9  VALUE +0.
           02  WS-VOL-CUR-PCT      PIC S999V9  VALUE +0.
       01  VOLTAB-TABLE.
           02  VOLTAB              OCCURS 1 TO 201
                                   DEPENDING ON WS-VOLSER-HI
                                   ASCENDING KEY IS VOLTAB-VOLSER
                                   INDEXED BY VOL-INDEX.
               03  VOLTAB-VOLSER   PIC X(6).
               03  VOLTAB-BYTES    PIC 9999999.
               03  VOLTAB-TRK-CYL  PIC 999.
               03  VOLTAB-CYL-VOL  PIC 99999.
               03  VOLTAB-POOL     PIC XXX.
               03  VOLTAB-SW-DUP   PIC X.
           02  WS-DATE.
               03  WS-DATE-MM      PIC 99.
               03  FILLER          PIC X.
               03  WS-DATE-DD      PIC 99.
               03  FILLER          PIC X.
               03  WS-DATE-YY      PIC 99.
           02  WS-YYDDD.
               03  WS-YYDDD-YY     PIC 99.
               03  WS-YYDDD-DDD    PIC 999.
           02  WS-DAY-TABLE.
               03  WS-DAY          OCCURS 10.
                   04  WS-DAY-YY   PIC 99.
                   04  WS-DAY-DDD  PIC 999.
       01  WS-MISC-COMP-SYNC       COMP SYNC.
           02  D-C-YEAR            PIC S9(8).
           02  D-C-MONTH           PIC S9(8).
           02  D-C-DOM             PIC S9(8).
           02  D-C-DOY             PIC S9(8).
           02  D-C-DOW             PIC S9(8).
           02  D-C-JDAY            PIC S9(8).
           02  WS-TODAY-JDAY       PIC S9(8).
           02  WS-90-AGO-JDAY      PIC S9(8).
           02  WS-DIFFDAY          PIC S9(8).
           02  I                   PIC S9(4).
           02  VDET-LINE-CT        PIC S9(4)  VALUE +0.
           02  VDET-PAGE-CT        PIC S9(4)  VALUE +0.
           02  VSUM-LINE-CT        PIC S9(4)  VALUE +0.
           02  VSUM-PAGE-CT        PIC S9(4)  VALUE +0.
           02  XTNT-LINE-CT        PIC S9(4)  VALUE +0.
           02  XTNT-PAGE-CT        PIC S9(4)  VALUE +0.
           02  VTNT-LINE-CT        PIC S9(4)  VALUE +0.
           02  VTNT-PAGE-CT        PIC S9(4)  VALUE +0.
           02  OVER-LINE-CT        PIC S9(4)  VALUE +0.
           02  OVER-PAGE-CT        PIC S9(4)  VALUE +0.
           02  EOLD-LINE-CT        PIC S9(4)  VALUE +0.
           02  EOLD-PAGE-CT        PIC S9(4)  VALUE +0.
           02  RGDG-LINE-CT        PIC S9(4)  VALUE +0.
           02  RGDG-PAGE-CT        PIC S9(4)  VALUE +0.
           02  PERM-LINE-CT        PIC S9(4)  VALUE +0.
           02  PERM-PAGE-CT        PIC S9(4)  VALUE +0.
           02  MPTY-LINE-CT        PIC S9(4)  VALUE +0.
           02  MPTY-PAGE-CT        PIC S9(4)  VALUE +0.
           02  SUMY-LINE-CT        PIC S9(4)  VALUE +0.
           02  SUMY-PAGE-CT        PIC S9(4)  VALUE +0.
           02  SUMY-VU-PRD         PIC S9999V9  VALUE +0.
           02  SUMY-VU-ONL         PIC S9999V9  VALUE +0.
           02  SUMY-VU-SYS         PIC S9999V9  VALUE +0.
           02  SUMY-VU-IPO         PIC S9999V9  VALUE +0.
           02  SUMY-VT-PRD         PIC S9999V9  VALUE +0.
           02  SUMY-VT-PRD-CT      PIC S9(2)  VALUE +0.
           02  SUMY-VT-ONL         PIC S9999V9  VALUE +0.
           02  SUMY-VT-ONL-CT      PIC S9(2)  VALUE +0.
           02  SUMY-VT-SYS         PIC S9999V9  VALUE +0.
           02  SUMY-VT-SYS-CT      PIC S9(2)  VALUE +0.
           02  SUMY-VT-IPO         PIC S9999V9  VALUE +0.
           02  SUMY-VT-IPO-CT      PIC S9(2)  VALUE +0.
           02  SUMY-XCP-CT         PIC S9(4)  VALUE +0.
           02  SUMY-XCS-CT         PIC S9(4)  VALUE +0.
           02  SUMY-XCI-CT         PIC S9(4)  VALUE +0.
           02  SUMY-XCP-ALLOC      PIC S9(6)  VALUE +0.
           02  SUMY-XCS-ALLOC      PIC S9(6)  VALUE +0.
           02  SUMY-XCI-ALLOC      PIC S9(6)  VALUE +0.
           02  SUMY-XHP-CT         PIC S9(4)  VALUE +0.
           02  SUMY-XHS-CT         PIC S9(4)  VALUE +0.
           02  SUMY-XHI-CT         PIC S9(4)  VALUE +0.
           02  SUMY-XHPV-CT        PIC S9(4)  VALUE +0.
           02  SUMY-XHSV-CT        PIC S9(4)  VALUE +0.
           02  SUMY-XHIV-CT        PIC S9(4)  VALUE +0.
           02  SUMY-XHP-NET        PIC S9(6)  VALUE +0.
           02  SUMY-XHS-NET        PIC S9(6)  VALUE +0.
           02  SUMY-XHI-NET        PIC S9(6)  VALUE +0.
           02  SUMY-XHP-NET-VS     PIC S9(6)  VALUE +0.
           02  SUMY-XHS-NET-VS     PIC S9(6)  VALUE +0.
           02  SUMY-XHI-NET-VS     PIC S9(6)  VALUE +0.
           02  SUMY-XHP-CT-TOTAL   PIC S9(7)  VALUE +0.
           02  SUMY-XHS-CT-TOTAL   PIC S9(7)  VALUE +0.
           02  SUMY-XHI-CT-TOTAL   PIC S9(7)  VALUE +0.
           02  SUMY-XHP-NET-TOTAL  PIC S9(7)  VALUE +0.
           02  SUMY-XHS-NET-TOTAL  PIC S9(7)  VALUE +0.
           02  SUMY-XHI-NET-TOTAL  PIC S9(7)  VALUE +0.
           02  SUMY-XVP-CT         PIC S9(4)  VALUE +0.
           02  SUMY-XVS-CT         PIC S9(4)  VALUE +0.
           02  SUMY-XVI-CT         PIC S9(4)  VALUE +0.
           02  SUMY-XVP-ALLOC      PIC S9(6)  VALUE +0.
           02  SUMY-XVS-ALLOC      PIC S9(6)  VALUE +0.
           02  SUMY-XVI-ALLOC      PIC S9(6)  VALUE +0.
           02  SUMY-XCPV-CT        PIC S9(4)  VALUE +0.
           02  SUMY-XCSV-CT        PIC S9(4)  VALUE +0.
           02  SUMY-XCIV-CT        PIC S9(4)  VALUE +0.
           02  SUMY-XCPV-TOTAL     PIC S9(7)  VALUE +0.
           02  SUMY-XCSV-TOTAL     PIC S9(7)  VALUE +0.
           02  SUMY-XCIV-TOTAL     PIC S9(7)  VALUE +0.
           02  SUMY-MTP-CT         PIC S9(4)  VALUE +0.
           02  SUMY-MTS-CT         PIC S9(4)  VALUE +0.
           02  SUMY-MTI-CT         PIC S9(4)  VALUE +0.
           02  SUMY-MTP-ALLOC      PIC S9(5)  VALUE +0.
           02  SUMY-MTS-ALLOC      PIC S9(5)  VALUE +0.
           02  SUMY-MTI-ALLOC      PIC S9(5)  VALUE +0.
           02  SUMY-GGP-CT         PIC S9(4)  VALUE +0.
           02  SUMY-GGS-CT         PIC S9(4)  VALUE +0.
           02  SUMY-GGI-CT         PIC S9(4)  VALUE +0.
           02  SUMY-PMP-CT         PIC S9(4)  VALUE +0.
           02  SUMY-PMS-CT         PIC S9(4)  VALUE +0.
           02  SUMY-PMI-CT         PIC S9(4)  VALUE +0.
           02  SUMY-PMP-ALLOC      PIC S9(5)  VALUE +0.
           02  SUMY-PMS-ALLOC      PIC S9(5)  VALUE +0.
           02  SUMY-PMI-ALLOC      PIC S9(5)  VALUE +0.
           02  SUMY-EOP-CT         PIC S9(4)  VALUE +0.
           02  SUMY-EOS-CT         PIC S9(4)  VALUE +0.
           02  SUMY-EOI-CT         PIC S9(4)  VALUE +0.
           02  SUMY-EOP-ALLOC      PIC S9(5)  VALUE +0.
           02  SUMY-EOS-ALLOC      PIC S9(5)  VALUE +0.
           02  SUMY-EOI-ALLOC      PIC S9(5)  VALUE +0.
           02  SUMY-LMP-CT         PIC S9(4)  VALUE +0.
           02  SUMY-LMS-CT         PIC S9(4)  VALUE +0.
           02  SUMY-LMI-CT         PIC S9(4)  VALUE +0.
           02  SUMY-LMP-ALLOC      PIC S9(7)  VALUE +0.
           02  SUMY-LMS-ALLOC      PIC S9(7)  VALUE +0.
           02  SUMY-LMI-ALLOC      PIC S9(7)  VALUE +0.
           02  SUMY-LMP-ALLOC-CUR  PIC S9(7)  VALUE +0.
           02  SUMY-LMS-ALLOC-CUR  PIC S9(7)  VALUE +0.
           02  SUMY-LMI-ALLOC-CUR  PIC S9(7)  VALUE +0.
           02  SUMY-LM-TOTAL       PIC S9(4)  VALUE +0.
           02  SUMY-LM-ALLC-TOTAL  PIC S9(7)  VALUE +0.
           02  SUMY-LM-CUR-TOTAL   PIC S9(7)  VALUE +0.
           02  SUMY-SPACE          PIC S9(1)  VALUE +0.
           02  LINE-MAX            PIC S9(4)  VALUE +55.
           02  ABEND-CODE          PIC S9(4)  VALUE +1000.
           02  WS-VOLSER-HI        PIC S9(4)  VALUE +0.
           02  DM-XH-NET           PIC S9(5)  VALUE +0.
       01  HEADING-1.
           02  FILLER              PIC X(10)  VALUE ' DM210-01'.
           02  H-1-DATE            PIC X(8)   VALUE SPACES.
           02  FILLER              PIC X(15)  VALUE SPACES.
           02  FILLER              PIC X(44)
             VALUE 'STORAGE MANAGEMENT VOLUME DETAIL REPORT FOR '.
           02  H-1-VOLSER          PIC X(6).
           02  FILLER              PIC X(15)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'PAGE '.
           02  H-1-PAGE            PIC ZZZ9   VALUE ZEROES.
       01  HEADING-2.
           02  FILLER              PIC X(10)  VALUE ' DM210-02'.
           02  H-2-DATE            PIC X(8)   VALUE SPACES.
           02  FILLER              PIC X(20)  VALUE SPACES.
           02  FILLER              PIC X(40)
             VALUE 'STORAGE MANAGEMENT VOLUME SUMMARY REPORT'.
           02  FILLER              PIC X(25)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'PAGE '.
           02  H-2-PAGE            PIC ZZZ9   VALUE ZEROES.
       01  HEADING-3.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'AAM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'IND'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(44)  VALUE 'DSNAME'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'ALLOC'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE ' USED'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '   HI'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'DT-CR'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'DT-RF'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'DSO'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'RFM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'LRECL'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'BLKSI'.
       01  HEADING-4.
           02  FILLER              PIC X(10)  VALUE ' DM210-04'.
           02  H-4-DATE            PIC X(8)   VALUE SPACES.
           02  FILLER              PIC X(15)  VALUE SPACES.
           02  FILLER              PIC X(48)
             VALUE 'STORAGE MANAGEMENT NONVSAM EXTENT CONTROL REPORT'.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'PAGE '.
           02  H-4-PAGE            PIC ZZZ9   VALUE ZEROES.
       01  HEADING-5.
           02  FILLER              PIC X(10)  VALUE ' DM210-05'.
           02  H-5-DATE            PIC X(8)   VALUE SPACES.
           02  FILLER              PIC X(15)  VALUE SPACES.
           02  FILLER              PIC X(41)
             VALUE 'STORAGE MANAGEMENT EXPIRED DATASET REPORT'.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'PAGE '.
           02  H-5-PAGE            PIC ZZZ9   VALUE ZEROES.
       01  HEADING-6.
           02  FILLER              PIC X(10)  VALUE ' DM210-06'.
           02  H-6-DATE            PIC X(8)   VALUE SPACES.
           02  FILLER              PIC X(15)  VALUE SPACES.
           02  FILLER              PIC X(45)
             VALUE 'STORAGE MANAGEMENT OVER ALLOCATION REPORT'.
           02  FILLER              PIC X(10)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'PAGE '.
           02  H-6-PAGE            PIC ZZZ9   VALUE ZEROES.
       01  HEADING-7.
           02  FILLER              PIC X(10)  VALUE ' DM210-07'.
           02  H-7-DATE            PIC X(8)   VALUE SPACES.
           02  FILLER              PIC X(15)  VALUE SPACES.
           02  FILLER              PIC X(40)
             VALUE 'STORAGE MANAGEMENT GDG REPORT'.
           02  FILLER              PIC X(15)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'PAGE '.
           02  H-7-PAGE            PIC ZZZ9   VALUE ZEROES.
       01  HEADING-8.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'AAM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'IND'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(44)  VALUE 'DSNAME'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'VOLSER'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'ALLOC'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE ' USED'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '   HI'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'DT-CR'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'DT-RF'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'RFM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'LRECL'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'BLKSI'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(7)   VALUE 'EXTENTS'.
       01  HEADING-9.
           02  FILLER              PIC X(10)  VALUE ' DM210-09'.
           02  H-9-DATE            PIC X(8)   VALUE SPACES.
           02  FILLER              PIC X(15)  VALUE SPACES.
           02  FILLER              PIC X(44)
             VALUE 'STORAGE MANAGEMENT PERMAMENT FILE REPORT'.
           02  FILLER              PIC X(21)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'PAGE '.
           02  H-9-PAGE            PIC ZZZ9   VALUE ZEROES.
       01  HEADING-10.
           02  FILLER              PIC X(10)  VALUE ' DM210-10'.
           02  H-10-DATE           PIC X(8)   VALUE SPACES.
           02  FILLER              PIC X(25)  VALUE SPACES.
           02  FILLER              PIC X(45)
             VALUE 'STORAGE MANAGEMENT FINAL SUMMARY REPORT  '.
           02  FILLER              PIC X(30)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'PAGE '.
           02  H-10-PAGE           PIC ZZZ9   VALUE ZEROES.
       01  HEADING-11.
           02  FILLER              PIC X(10)  VALUE ' DM210-11'.
           02  H-11-DATE           PIC X(8)   VALUE SPACES.
           02  FILLER              PIC X(15)  VALUE SPACES.
           02  FILLER              PIC X(45)
             VALUE 'STORAGE MANAGEMENT VSAM EXTENT DATASET REPORT'.
           02  FILLER              PIC X(10)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'PAGE '.
           02  H-11-PAGE           PIC ZZZ9   VALUE ZEROES.
       01  HEADING-A.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'AAM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'IND'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(44)  VALUE 'DSNAME'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'VOLSER'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'ALLOC'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE ' USED'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '   HI'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'DT-CR'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'DT-RF'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'RFM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'LRECL'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'BLKSI'.
       01  HEADING-B.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'AAM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(44)  VALUE 'DSNAME'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'VOLSER'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'SWS'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '   HI'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'ALLOC'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '  S/B'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '  NET'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'DT-CR'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'DT-RF'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(7)   VALUE 'EXTENTS'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'DSO'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'RFM'.
       01  HEADING-C.
           02  FILLER              PIC X(10)  VALUE ' DM210-12'.
           02  H-C-DATE            PIC X(8)   VALUE SPACES.
           02  FILLER              PIC X(15)  VALUE SPACES.
           02  FILLER              PIC X(44)
             VALUE 'STORAGE MANAGEMENT EMPTY FILE REPORT'.
           02  FILLER              PIC X(21)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'PAGE '.
           02  H-C-PAGE            PIC ZZZ9   VALUE ZEROES.
       01  HEADING-D.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'AAM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'IND'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(44)  VALUE 'DSNAME'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'VOLSER'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'ALLOC'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '   HI'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'DT-CR'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'DT-RF'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'DSO'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'RFM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'LRECL'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'BLKSI'.
           02  FILLER              PIC X(2)   VALUE SPACES.
           02  FILLER              PIC X(7)   VALUE 'EXTENTS'.
       01  HEADING-E.
           02  FILLER              PIC X(2)   VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'AAM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(44)  VALUE 'DSNAME'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'VOLSER'.
           02  FILLER              PIC X(2)   VALUE SPACES.
           02  FILLER              PIC X(9)   VALUE 'EXTENT-SW'.
           02  FILLER              PIC X(3)   VALUE SPACES.
           02  FILLER              PIC X(17)  VALUE 'NUMBER-OF-EXTENTS'.
           02  FILLER              PIC X(2)   VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'ALLOC'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE ' USED'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '   HI'.
           02  FILLER              PIC X(2)   VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'DSO'.
       01  HEADING-F.
           02  FILLER              PIC X(3)   VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'AAM'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(44)  VALUE 'DSNAME'.
           02  FILLER              PIC X      VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'VOLSER'.
           02  FILLER              PIC X(2)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'REF-SW'.
           02  FILLER              PIC X(3)   VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'DSO'.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'ALLOC'.
           02  FILLER              PIC X(4)   VALUE SPACES.
           02  FILLER              PIC X(11)  VALUE 'DAYS-UNUSED'.
       01  HEADING-G.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'VOLSER'.
           02  FILLER              PIC X(2)   VALUE SPACES.
           02  FILLER              PIC X(4)   VALUE 'POOL'.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'ALLOC'.
           02  FILLER              PIC X(4)   VALUE SPACES.
           02  FILLER              PIC X(4)   VALUE '-OF-'.
           02  FILLER              PIC X(4)   VALUE SPACES.
           02  FILLER              PIC X(7)   VALUE '%-ALLOC'.
           02  FILLER              PIC X(9)   VALUE SPACES.
           02  FILLER              PIC X(8)   VALUE 'CUR-USED'.
           02  FILLER              PIC X(4)   VALUE SPACES.
           02  FILLER              PIC X(7)   VALUE '%-ALLOC'.
           02  FILLER              PIC X(9)   VALUE SPACES.
           02  FILLER              PIC X(7)   VALUE 'HI-USED'.
           02  FILLER              PIC X(4)   VALUE SPACES.
           02  FILLER              PIC X(7)   VALUE '%-ALLOC'.
       01  DETAIL-LINE.
           02  DETAIL-CC           PIC X      VALUE SPACES.
           02  DETAIL-TEXT         PIC X(132) VALUE SPACES.
       01  DET-LM.
           02  DET-LM-AAM          PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-SW           PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-DSNAME       PIC X(44).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-ALLOC        PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-USED-CUR     PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-USED-HI      PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-DT-CREATE    PIC 9(5).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-DT-REF       PIC 9(5).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-DSORG        PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-RECFM        PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-LRECL        PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-LM-BLKSIZE      PIC ZZZZ9.
       01  DET-PM.
           02  DET-PM-AAM          PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-SW           PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-DSNAME       PIC X(44).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-VOLSER       PIC X(6).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-ALLOC        PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-USED-CUR     PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-USED-HI      PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-DT-CREATE    PIC 9(5).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-DT-REF       PIC 9(5).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-RECFM        PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-LRECL        PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-PM-BLKSIZE      PIC ZZZZ9.
       01  DET-GG.
           02  DET-GG-AAM          PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-SW           PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-DSNAME       PIC X(44).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-VOLSER       PIC X(6).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-ALLOC        PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-USED-CUR     PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-USED-HI      PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-DT-CREATE    PIC 9(5).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-DT-REF       PIC 9(5).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-RECFM        PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-LRECL        PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-GG-BLKSIZE      PIC ZZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  DET-GG-EXTENT-CT    PIC 99.
       01  DET-VT.
           02  FILLER              PIC X(4)  VALUE SPACES.
           02  DET-VT-VOLSER       PIC X(6).
           02  FILLER              PIC X(2)  VALUE SPACES.
           02 DET-VT-POOL          PIC XXX.
           02  FILLER              PIC X(7)  VALUE SPACES.
           02 DET-VT-ALLOC         PIC ZZZZ9.
           02  FILLER              PIC X(4)  VALUE SPACES.
           02 DET-VT-OF            PIC ZZZZ9.
           02  FILLER              PIC X(3)  VALUE SPACES.
           02 DET-VT-PCT           PIC ZZ9.9.
           02  FILLER              PIC X     VALUE '%'.
           02  FILLER              PIC X(12) VALUE  SPACES.
           02 DET-VT-USED-CUR      PIC ZZZZ9.
           02  FILLER              PIC X(5)  VALUE SPACES.
           02 DET-VT-CUR-PCT       PIC ZZ9.9.
           02  FILLER              PIC X     VALUE '%'.
           02  FILLER              PIC X(11) VALUE SPACES.
           02 DET-VT-USED-HI       PIC ZZZZ9.
           02  FILLER              PIC X(5)  VALUE SPACES.
           02 DET-VT-HI-PCT        PIC ZZ9.9.
           02  FILLER              PIC X     VALUE '%'.
       01  DET-XC.
           02  FILLER              PIC X     VALUE SPACES.
           02  DET-XC-AAM          PIC X(3).
           02  FILLER              PIC X     VALUE SPACES.
           02  DET-XC-DSNAME       PIC X(44).
           02  FILLER              PIC X     VALUE SPACES.
           02  DET-XC-VOLSER       PIC X(6).
           02  FILLER              PIC X(6)  VALUE SPACES.
           02  DET-XC-SW-1         PIC X.
           02  FILLER              PIC X(14) VALUE SPACES.
           02  DET-XC-EXTENT-CT    PIC Z9.
           02  FILLER              PIC X(10)  VALUE SPACES.
           02  DET-XC-ALLOC        PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-XC-USED-CUR     PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-XC-USED-HI      PIC ZZZZ9.
           02  FILLER              PIC X(2)   VALUE SPACES.
           02  DET-XC-DSORG        PIC X(3).
       01  DET-XV.
           02  FILLER              PIC X     VALUE SPACES.
           02  DET-XV-AAM          PIC X(3).
           02  FILLER              PIC X     VALUE SPACES.
           02  DET-XV-DSNAME       PIC X(44).
           02  FILLER              PIC X     VALUE SPACES.
           02  DET-XV-VOLSER       PIC X(6).
           02  FILLER              PIC X(6)  VALUE SPACES.
           02  DET-XV-SW-1         PIC X.
           02  FILLER              PIC X(14) VALUE SPACES.
           02  DET-XV-EXTENT-CT    PIC Z9.
           02  FILLER              PIC X(10)  VALUE SPACES.
           02  DET-XV-ALLOC        PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-XV-USED-CUR     PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-XV-USED-HI      PIC ZZZZ9.
           02  FILLER              PIC X(2)   VALUE SPACES.
           02  DET-XV-DSORG        PIC X(3).
       01  DET-XH.
           02  DET-XH-AAM          PIC X(3).
           02  FILLER              PIC X VALUE SPACES.
           02  DET-XH-DSNAME       PIC X(44).
           02  FILLER              PIC X VALUE SPACES.
           02  DET-XH-VOLSER       PIC X(6).
           02  FILLER              PIC X VALUE SPACES.
           02  DET-XH-SW           PIC X(3).
           02  FILLER              PIC X VALUE SPACES.
           02  DET-XH-USED-HI      PIC ZZZZ9.
           02  FILLER              PIC X VALUE SPACES.
           02  DET-XH-ALLOC        PIC ZZZZ9.
           02  FILLER              PIC X VALUE SPACES.
           02  DET-XH-SB           PIC ZZZZ9.
           02  FILLER              PIC X VALUE SPACES.
           02  DET-XH-NET          PIC ZZZZ9.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-XH-DT-CREATE    PIC 9(5).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-XH-DT-REF       PIC 9(5).
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  DET-XH-EXTENT-CT    PIC 99.
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-XH-DSORG        PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-XH-RECFM        PIC X(3).
       01  DET-MT.
           02  DET-MT-AAM          PIC X(3).
           02  FILLER              PIC X VALUE SPACES.
           02  DET-MT-SW           PIC X(3).
           02  FILLER              PIC X VALUE SPACES.
           02  DET-MT-DSNAME       PIC X(44).
           02  FILLER              PIC X VALUE SPACES.
           02  DET-MT-VOLSER       PIC X(6).
           02  FILLER              PIC X VALUE SPACES.
           02  DET-MT-ALLOC        PIC ZZZZ9.
           02  FILLER              PIC X VALUE SPACES.
           02  DET-MT-USED-HI      PIC ZZZZ9.
           02  FILLER              PIC X VALUE SPACES.
           02  DET-MT-DT-CREATE    PIC 9(5).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-MT-DT-REF       PIC 9(5).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-MT-DSORG        PIC X(3).
           02  FILLER              PIC X      VALUE SPACES.
           02  DET-MT-RECFM        PIC X(3).
           02  FILLER              PIC X VALUE SPACES.
           02  DET-MT-LRECL        PIC ZZZZ9.
           02  FILLER              PIC X VALUE SPACES.
           02  DET-MT-BLKSIZE      PIC ZZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  DET-MT-EXTENT-CT    PIC 99.
       01  DET-EO.
           02  FILLER              PIC X(2)  VALUE SPACES.
           02  DET-EO-AAM          PIC X(3).
           02  FILLER              PIC X     VALUE SPACES.
           02  DET-EO-DSNAME       PIC X(44).
           02  FILLER              PIC X     VALUE SPACES.
           02  DET-EO-VOLSER       PIC X(6).
           02  FILLER              PIC X(5)  VALUE SPACES.
           02  DET-EO-SW-3         PIC X.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  DET-EO-DSORG        PIC X(3).
           02  FILLER              PIC X(5)  VALUE SPACES.
           02  DET-EO-ALLOC        PIC ZZZZ9.
           02  FILLER              PIC X(7)  VALUE SPACES.
           02  DET-EO-DIFFDAY      PIC ZZZZ9.
       01  SUM-TITLE0.
           02  FILLER              PIC X(132) VALUE SPACES.
       01  SUM-TITLE1.
           02  FILLER              PIC X(34)  VALUE SPACES.
           02  FILLER              PIC X(7)   VALUE 'PRD/ONL'.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'TOTAL'.
           02  FILLER              PIC X(16)  VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'SYS'.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'TOTAL'.
           02  FILLER              PIC X(16)  VALUE SPACES.
           02  FILLER              PIC X(3)   VALUE 'IPO'.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'TOTAL'.
       01  SUM-TITLE2.
           02  FILLER              PIC X(35)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'COUNT'.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'TRACKS'.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'COUNT'.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'TRACKS'.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE 'COUNT'.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE 'TRACKS'.
       01  SUM-TITLE3.
           02  FILLER              PIC X(35)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '-----'.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE '------'.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '-----'.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE '------'.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  FILLER              PIC X(5)   VALUE '-----'.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE '------'.
       01  SUM-XC.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           'NONVSAM EXTENT CONTROL ------ '.
           02  SUM-XCP-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XCP-ALLOC       PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XCS-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XCS-ALLOC       PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XCI-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XCI-ALLOC       PIC ZZZZZ9.
       01  SUM-XV.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           'VSAM EXTENT CONTROL --------- '.
           02  SUM-XVP-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XVP-ALLOC       PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XVS-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XVS-ALLOC       PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XVI-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XVI-ALLOC       PIC ZZZZZ9.
       01  SUM-XCV.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           '       "      "      TOTALS = '.
           02  SUM-XCPV-CT         PIC ZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-XCPV-TOTAL      PIC ZZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XCSV-CT         PIC ZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-XCSV-TOTAL      PIC ZZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XCIV-CT         PIC ZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-XCIV-TOTAL      PIC ZZZZZZ9.
       01  SUM-XH1.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           'OVER ALLOCATION (NONVSAM) --- '.
           02  SUM-XHP-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XHP-NET         PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XHS-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XHS-NET         PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XHI-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XHI-NET         PIC ZZZZZ9.
       01  SUM-XH2.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           '  "       "     (VSAM) ------ '.
           02  SUM-XHPV-CT         PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XHP-NET-VS      PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XHSV-CT         PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XHS-NET-VS      PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XHIV-CT         PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-XHI-NET-VS      PIC ZZZZZ9.
       01  SUM-XH3.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           '  "       "          TOTALS = '.
           02  SUM-XHP-CT-TOTAL    PIC ZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-XHP-NET-TOTAL   PIC ZZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XHS-CT-TOTAL    PIC ZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-XHS-NET-TOTAL   PIC ZZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-XHI-CT-TOTAL    PIC ZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-XHI-NET-TOTAL   PIC ZZZZZZ9.
       01  SUM-MT.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           'EMPTY FILE ------------------ '.
           02  SUM-MTP-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-MTP-ALLOC       PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-MTS-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-MTS-ALLOC       PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-MTI-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-MTI-ALLOC       PIC ZZZZZ9.
       01  SUM-GG.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           'GDG FILE -------------------- '.
           02  SUM-GGP-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE '-****-'.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-GGS-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE '-****-'.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-GGI-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  FILLER              PIC X(6)   VALUE '-****-'.
       01  SUM-PM.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           'PERMAMENT FILE -------------- '.
           02  SUM-PMP-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-PMP-ALLOC       PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-PMS-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-PMS-ALLOC       PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-PMI-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-PMI-ALLOC       PIC ZZZZZ9.
       01  SUM-EO.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           'EXPIRED DATASET ------------- '.
           02  SUM-EOP-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-EOP-ALLOC       PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-EOS-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-EOS-ALLOC       PIC ZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-EOI-CT          PIC ZZZ9.
           02  FILLER              PIC X(7)   VALUE SPACES.
           02  SUM-EOI-ALLOC       PIC ZZZZZ9.
       01  SUM-LM1.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(30)  VALUE
                           'VOLUME DETAIL (ALLOCATED) --- '.
           02  SUM-LMP-CT          PIC ZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-LMP-ALLOC       PIC ZZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-LMS-CT          PIC ZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-LMS-ALLOC       PIC ZZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  SUM-LMI-CT          PIC ZZZ9.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-LMI-ALLOC       PIC ZZZZZZ9.
       01  SUM-LM2.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(35)  VALUE
                           '   "      "   (CUR-USED) ---- -**-'.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  SUM-LMP-ALLOC-CUR   PIC ZZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  FILLER              PIC X(4)   VALUE '-**-'.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-LMS-ALLOC-CUR   PIC ZZZZZZ9.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  FILLER              PIC X(4)   VALUE '-**-'.
           02  FILLER              PIC X(6)   VALUE SPACES.
           02  SUM-LMI-ALLOC-CUR   PIC ZZZZZZ9.
       01  SUM-LM3.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(29)  VALUE
                           '*** TOTAL ALLOCATED TRACKS = '.
           02  SUM-LM-ALLC-TOTAL   PIC Z,ZZZ,ZZ9.
           02  FILLER              PIC X(16)  VALUE '     DATASETS = '.
           02  SUM-LM-TOTAL        PIC Z,ZZ9.
       01  SUM-LM4.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(29)  VALUE
                           '*** TOTAL CUR-USED TRACKS  = '.
           02  SUM-LM-CUR-TOTAL    PIC Z,ZZZ,ZZ9.
       01  SUM-VT.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(29)  VALUE
                          'AVERAGE % VOLUME ALLOCATED --'.
           02  FILLER              PIC X(1)   VALUE '('.
           02  SUM-VT-PRD-CT       PIC Z9.
           02  FILLER              PIC X(1)   VALUE '/'.
           02  SUM-VT-ONL-CT       PIC Z9.
           02  FILLER              PIC X(2)   VALUE ') '.
           02  SUM-VT-PRD-PCT      PIC ZZ9.9.
           02  FILLER              PIC X(3)   VALUE '% /'.
           02  SUM-VT-ONL-PCT      PIC ZZ9.9.
           02  FILLER              PIC X      VALUE '%'.
           02  FILLER              PIC X(10)  VALUE SPACES.
           02  FILLER              PIC X(1)   VALUE '('.
           02  SUM-VT-SYS-CT       PIC Z9.
           02  FILLER              PIC X(8)   VALUE ')       '.
           02  SUM-VT-SYS-PCT      PIC ZZ9.9.
           02  FILLER              PIC X      VALUE '%'.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  FILLER              PIC X(1)   VALUE '('.
           02  SUM-VT-IPO-CT       PIC Z9.
           02  FILLER              PIC X(8)   VALUE ')       '.
           02  SUM-VT-IPO-PCT      PIC ZZ9.9.
           02  FILLER              PIC X      VALUE '%'.
       01  SUM-VU.
           02  FILLER              PIC X(5)   VALUE SPACES.
           02  FILLER              PIC X(29)  VALUE
                          'AVERAGE % VOLUME CUR-USED ---'.
           02  FILLER              PIC X(1)   VALUE '('.
           02  SUM-VU-PRD-CT       PIC Z9.
           02  FILLER              PIC X(1)   VALUE '/'.
           02  SUM-VU-ONL-CT       PIC Z9.
           02  FILLER              PIC X(2)   VALUE ') '.
           02  SUM-VU-PRD-PCT      PIC ZZ9.9.
           02  FILLER              PIC X(3)   VALUE '% /'.
           02  SUM-VU-ONL-PCT      PIC ZZ9.9.
           02  FILLER              PIC X      VALUE '%'.
           02  FILLER              PIC X(10)  VALUE SPACES.
           02  FILLER              PIC X(1)   VALUE '('.
           02  SUM-VU-SYS-CT       PIC Z9.
           02  FILLER              PIC X(8)   VALUE ')       '.
           02  SUM-VU-SYS-PCT      PIC ZZ9.9.
           02  FILLER              PIC X      VALUE '%'.
           02  FILLER              PIC X(14)  VALUE SPACES.
           02  FILLER              PIC X(1)   VALUE '('.
           02  SUM-VU-IPO-CT       PIC Z9.
           02  FILLER              PIC X(8)   VALUE ')       '.
           02  SUM-VU-IPO-PCT      PIC ZZ9.9.
           02  FILLER              PIC X      VALUE '%'.
       01  WS-FIXC.
           COPY CDMFD030.
       PROCEDURE DIVISION.
           MOVE LINE-MAX TO VDET-LINE-CT
                            VSUM-LINE-CT
                            XTNT-LINE-CT
                            VTNT-LINE-CT
                            OVER-LINE-CT
                            EOLD-LINE-CT
                            PERM-LINE-CT
                            MPTY-LINE-CT
                            SUMY-LINE-CT
                            RGDG-LINE-CT.
           MOVE CURRENT-DATE TO H-1-DATE
                                H-2-DATE
                                H-4-DATE
                                H-5-DATE
                                H-6-DATE
                                H-7-DATE
                                H-C-DATE
                                H-9-DATE
                                H-10-DATE
                                H-11-DATE
                                WS-DATE.
           MOVE WS-DATE-MM TO D-C-MONTH.
           MOVE WS-DATE-DD TO D-C-DOM.
           MOVE WS-DATE-YY TO D-C-YEAR.
           MOVE ZERO TO D-C-DOY
                        D-C-DOW
                        D-C-JDAY.
           CALL 'DATCNVRT' USING
                        D-C-YEAR
                        D-C-MONTH
                        D-C-DOM
                        D-C-DOY
                        D-C-DOW
                        D-C-JDAY.
           MOVE D-C-JDAY TO WS-TODAY-JDAY.
           SUBTRACT +90 FROM WS-TODAY-JDAY GIVING WS-90-AGO-JDAY.
           MOVE D-C-YEAR TO WS-DAY-YY(1).
           MOVE D-C-DOY  TO WS-DAY-DDD(1).
           PERFORM BLD-VOLSER.
           SORT SORTVOL
               ASCENDING KEY SVOL-VOLSER SVOL-DSNAME
           INPUT  PROCEDURE IS SVOL-IN  THRU SVOL-IN-EXIT
           OUTPUT PROCEDURE IS SVOL-OUT THRU SVOL-OUT-EXIT.
           SKIP2
           SORT SORTAAM
               ASCENDING KEY SAAM-AAM SAAM-DSNAME
           INPUT  PROCEDURE IS SAAM-IN  THRU SAAM-IN-EXIT
           OUTPUT PROCEDURE IS SAAM-OUT THRU SAAM-OUT-EXIT.
           GO TO E-O-J.
       SVOL-IN SECTION.
           OPEN INPUT MASTER.
           OPEN OUTPUT RPTRGDG RPTXTNT RPTOVER RPTPERM RPTMPTY.
           OPEN OUTPUT RPTSUMY RPTVTNT OUTFIXC.
           MOVE 'M' TO FIXC-CMD.
           MOVE SPACES TO FIXC-FILL.
       SVOL-IN-READ-MASTER.
           READ MASTER
               AT END GO TO SVOL-IN-END.
           IF DM-MST-DT-CREATE EQUAL 00000 THEN
               GO TO SVOL-IN-READ-MASTER.
           MOVE DM-MST-AAM       TO SVOL-AAM.
           MOVE DM-MST-SW        TO SVOL-SW.
           MOVE DM-MST-DSNAME    TO SVOL-DSNAME.
           MOVE DM-MST-VOLSER    TO SVOL-VOLSER.
           MOVE DM-MST-ALLOC     TO SVOL-ALLOC.
           MOVE DM-MST-USED-CUR  TO SVOL-USED-CUR.
           MOVE DM-MST-USED-HI   TO SVOL-USED-HI.
           MOVE DM-MST-DT-CREATE TO SVOL-DT-CREATE.
           MOVE DM-MST-DT-REF    TO SVOL-DT-REF.
           MOVE DM-MST-DSORG     TO SVOL-DSORG.
           MOVE DM-MST-RECFM     TO SVOL-RECFM.
           MOVE DM-MST-LRECL     TO SVOL-LRECL.
           MOVE DM-MST-BLKSIZE   TO SVOL-BLKSIZE.
           MOVE DM-MST-EXTENT-CT TO SVOL-EXTENT-CT.
           MOVE DM-MST-USED-LO   TO SVOL-USED-LO.
           RELEASE SVOL-REC.
           IF SVOL-SW-3 EQUAL 'T' THEN
               GO TO SVOL-IN-READ-MASTER.
           MOVE 'N' TO WS-FIXC-SW.
           MOVE 'N' TO WS-XTNT-SW.
           PERFORM RPT-RGDG.
           PERFORM RPT-PERM.
           PERFORM RPT-XTNT.
           PERFORM RPT-VTNT.
           PERFORM RPT-OVER.
           PERFORM RPT-MPTY.
           PERFORM GEN-FIXC.
           GO TO SVOL-IN-READ-MASTER.
       SVOL-IN-END.
           ADD SUMY-XCP-CT TO SUMY-XCPV-CT.
           ADD SUMY-XCS-CT TO SUMY-XCSV-CT.
           ADD SUMY-XCI-CT TO SUMY-XCIV-CT.
           ADD SUMY-XVP-CT TO SUMY-XCPV-CT.
           ADD SUMY-XVS-CT TO SUMY-XCSV-CT.
           ADD SUMY-XVI-CT TO SUMY-XCIV-CT.
           CLOSE MASTER.
           CLOSE RPTRGDG RPTXTNT RPTOVER RPTPERM RPTMPTY.
           CLOSE RPTVTNT OUTFIXC.
       SVOL-IN-EXIT.
           EXIT.
       SVOL-OUT SECTION.
           OPEN OUTPUT RPTVDET RPTVSUM.
           PERFORM SVOL-OUT-READ THRU SVOL-OUT-READ-EXIT.
           IF SORTFILE-EOF THEN
               GO TO SVOL-OUT-EXIT.
           MOVE SVOL-VOLSER TO WS-VOL-VOLSER H-1-VOLSER.
           PERFORM SVOL-OUT-RPT-VDET
              THRU SVOL-OUT-RPT-VDET-EXIT.
       SVOL-OUT-NEXT.
           PERFORM SVOL-OUT-READ THRU SVOL-OUT-READ-EXIT.
           IF SORTFILE-EOF THEN
               PERFORM SVOL-OUT-RPT-VSUM
               GO TO SVOL-OUT-END.
           IF SVOL-VOLSER NOT EQUAL WS-VOL-VOLSER THEN
               MOVE LINE-MAX TO VDET-LINE-CT
               PERFORM SVOL-OUT-RPT-VSUM.
           MOVE SVOL-VOLSER TO WS-VOL-VOLSER H-1-VOLSER.
           PERFORM SVOL-OUT-RPT-VDET
              THRU SVOL-OUT-RPT-VDET-EXIT.
           GO TO SVOL-OUT-NEXT.
       SVOL-OUT-RPT-VDET.
           MOVE SVOL-AAM           TO DET-LM-AAM.
           MOVE SVOL-SW            TO DET-LM-SW.
           MOVE SVOL-DSNAME        TO DET-LM-DSNAME.
           MOVE SVOL-ALLOC         TO DET-LM-ALLOC.
           MOVE SVOL-USED-CUR      TO DET-LM-USED-CUR
           MOVE SVOL-USED-HI       TO DET-LM-USED-HI.
           MOVE SVOL-DT-CREATE     TO DET-LM-DT-CREATE.
           MOVE SVOL-DT-REF        TO DET-LM-DT-REF.
           MOVE SVOL-DSORG         TO DET-LM-DSORG.
           MOVE SVOL-RECFM         TO DET-LM-RECFM.
           MOVE SVOL-LRECL         TO DET-LM-LRECL.
           MOVE SVOL-BLKSIZE       TO DET-LM-BLKSIZE.
           MOVE SVOL-VOLSER        TO WS-VOL-POOL.
           MOVE DET-LM TO DETAIL-TEXT.
           IF WS-VOL-POOL EQUAL 'PRD' THEN
              ADD +1 TO SUMY-LMP-CT
              ADD SVOL-ALLOC TO SUMY-LMP-ALLOC
              ADD SVOL-USED-CUR TO SUMY-LMP-ALLOC-CUR.
           IF WS-VOL-POOL EQUAL 'SYS' OR 'SRE' THEN
              ADD +1 TO SUMY-LMS-CT
              ADD SVOL-ALLOC TO SUMY-LMS-ALLOC
              ADD SVOL-USED-CUR TO SUMY-LMS-ALLOC-CUR.
           IF WS-VOL-POOL EQUAL 'IPO' THEN
              ADD +1 TO SUMY-LMI-CT
              ADD SVOL-ALLOC TO SUMY-LMI-ALLOC
              ADD SVOL-USED-CUR TO SUMY-LMI-ALLOC-CUR.
           PERFORM VDET-A-LINE.
           ADD SVOL-ALLOC          TO WS-VOL-ALLOC.
           ADD SVOL-USED-CUR       TO WS-VOL-USED-CUR.
           ADD SVOL-USED-HI        TO WS-VOL-USED-HI.
           ADD SVOL-USED-LO        TO WS-VOL-USED-LO.
       SVOL-OUT-RPT-VDET-EXIT.
           EXIT.
       SVOL-OUT-RPT-VSUM.
           IF NOT (WS-VOL-VOLSER EQUAL LOW-VALUES) THEN
               PERFORM LOC-VOLSER
               COMPUTE WS-VOL-PCT ROUNDED =
                       (100 * WS-VOL-ALLOC) / WS-VOL-TRK-VOL
               COMPUTE WS-VOL-HI-PCT ROUNDED =
                       (100 * WS-VOL-USED-HI) / WS-VOL-ALLOC
               COMPUTE WS-VOL-CUR-PCT ROUNDED =
                       (100 * WS-VOL-USED-CUR) / WS-VOL-ALLOC
               PERFORM SVOL-OUT-PCT THRU SVOL-OUT-PCT-EXIT
               MOVE WS-VOL-VOLSER   TO DET-VT-VOLSER
               MOVE WS-VOL-POOL     TO DET-VT-POOL
               MOVE WS-VOL-ALLOC    TO DET-VT-ALLOC
               MOVE WS-VOL-TRK-VOL  TO DET-VT-OF
               MOVE WS-VOL-PCT      TO DET-VT-PCT
               MOVE WS-VOL-HI-PCT   TO DET-VT-HI-PCT
               MOVE WS-VOL-CUR-PCT  TO DET-VT-CUR-PCT
               MOVE WS-VOL-USED-CUR TO DET-VT-USED-CUR
               MOVE WS-VOL-USED-HI  TO DET-VT-USED-HI
               MOVE DET-VT TO DETAIL-TEXT
               PERFORM VSUM-A-LINE.
           MOVE LOW-VALUES TO WS-VOL-VOLSER.
           MOVE ZERO TO WS-VOL-ALLOC
                        WS-VOL-USED-CUR
                        WS-VOL-USED-HI
                        WS-VOL-USED-LO.
       SVOL-OUT-READ.
           RETURN SORTVOL
               AT END MOVE 'Y' TO SORTFILE-EOF-SW.
       SVOL-OUT-READ-EXIT.
           EXIT.
       SVOL-OUT-END.
           PERFORM VOL-VT-PERCENT THRU VOL-VT-PERCENT-EXIT.
           CLOSE RPTVDET RPTVSUM.
       SVOL-OUT-EXIT.
           EXIT.
       SVOL-OUT-PCT.
           IF WS-VOL-POOL EQUAL 'PRD' THEN
              ADD WS-VOL-PCT     TO SUMY-VT-PRD
              ADD WS-VOL-CUR-PCT TO SUMY-VU-PRD
              ADD +1 TO SUMY-VT-PRD-CT.
           IF WS-VOL-POOL EQUAL 'ONL' THEN
              ADD WS-VOL-PCT     TO SUMY-VT-ONL
              ADD WS-VOL-CUR-PCT TO SUMY-VU-ONL
              ADD +1 TO SUMY-VT-ONL-CT.
           IF WS-VOL-POOL EQUAL 'SYS' THEN
              ADD WS-VOL-PCT     TO SUMY-VT-SYS
              ADD WS-VOL-CUR-PCT TO SUMY-VU-SYS
              ADD +1 TO SUMY-VT-SYS-CT.
           IF WS-VOL-POOL EQUAL 'IPO' THEN
              ADD WS-VOL-PCT     TO SUMY-VT-IPO
              ADD WS-VOL-CUR-PCT TO SUMY-VU-IPO
              ADD +1 TO SUMY-VT-IPO-CT.
       SVOL-OUT-PCT-EXIT.
       SAAM-IN SECTION.
           OPEN INPUT MASTER.
           MOVE +1 TO I.
           MOVE WS-TODAY-JDAY TO D-C-JDAY.
           PERFORM SAAM-IN-FILL-DAY 9 TIMES.
       SAAM-IN-READ-MASTER.
           READ MASTER
               AT END GO TO SAAM-IN-END.
           IF DM-MST-DT-CREATE EQUAL 00000 THEN
               GO TO SAAM-IN-READ-MASTER.
           IF DM-MST-SW-3 EQUAL 'T' OR 'I' THEN
               GO TO SAAM-IN-READ-MASTER.
           PERFORM SAAM-IN-DIFFDAY THRU SAAM-IN-DIFFDAY-EXIT.
           IF (DM-MST-SW-3 EQUAL 'D' AND
               WS-DIFFDAY GREATER THAN +10) THEN
               GO TO SAAM-IN-WRITE-SORTFILE.
           IF (DM-MST-SW-3 EQUAL 'M' AND
               WS-DIFFDAY GREATER THAN +70) THEN
               GO TO SAAM-IN-WRITE-SORTFILE.
           IF (DM-MST-SW-3 EQUAL 'Q' AND
               WS-DIFFDAY GREATER THAN +193) THEN
               GO TO SAAM-IN-WRITE-SORTFILE.
           IF (DM-MST-SW-3 EQUAL 'A' AND
               WS-DIFFDAY GREATER THAN +376) THEN
               GO TO SAAM-IN-WRITE-SORTFILE.
           GO TO SAAM-IN-READ-MASTER.
       SAAM-IN-WRITE-SORTFILE.
           MOVE DM-MST-AAM       TO SAAM-AAM.
           MOVE DM-MST-SW        TO SAAM-SW.
           MOVE DM-MST-DSNAME    TO SAAM-DSNAME.
           MOVE DM-MST-VOLSER    TO SAAM-VOLSER.
           MOVE DM-MST-ALLOC     TO SAAM-ALLOC.
           MOVE DM-MST-DSORG     TO SAAM-DSORG.
           MOVE DM-MST-DT-REF    TO SAAM-DT-REF.
           MOVE WS-DIFFDAY       TO SAAM-DIFFDAY.
           RELEASE SAAM-REC.
           GO TO SAAM-IN-READ-MASTER.
       SAAM-IN-FILL-DAY.
           MOVE ZERO TO D-C-YEAR
                        D-C-MONTH
                        D-C-DOM
                        D-C-DOY
                        D-C-DOW.
           SUBTRACT +1 FROM D-C-JDAY.
           CALL 'DATCNVRT' USING
                        D-C-YEAR
                        D-C-MONTH
                        D-C-DOM
                        D-C-DOY
                        D-C-DOW
                        D-C-JDAY.
           ADD +1 TO I.
           MOVE D-C-YEAR TO WS-DAY-YY(I).
           MOVE D-C-DOY  TO WS-DAY-DDD(I).
       SAAM-IN-DIFFDAY.
           IF DM-MST-DT-REF EQUAL WS-DAY(1) THEN
               MOVE +0 TO WS-DIFFDAY
               GO TO SAAM-IN-DIFFDAY-EXIT.
           IF DM-MST-DT-REF EQUAL WS-DAY(2) THEN
               MOVE +1 TO WS-DIFFDAY
               GO TO SAAM-IN-DIFFDAY-EXIT.
           IF DM-MST-DT-REF EQUAL WS-DAY(3) THEN
               MOVE +2 TO WS-DIFFDAY
               GO TO SAAM-IN-DIFFDAY-EXIT.
           IF DM-MST-DT-REF EQUAL WS-DAY(4) THEN
               MOVE +3 TO WS-DIFFDAY
               GO TO SAAM-IN-DIFFDAY-EXIT.
           IF DM-MST-DT-REF EQUAL WS-DAY(5) THEN
               MOVE +4 TO WS-DIFFDAY
               GO TO SAAM-IN-DIFFDAY-EXIT.
           IF DM-MST-DT-REF EQUAL WS-DAY(6) THEN
               MOVE +5 TO WS-DIFFDAY
               GO TO SAAM-IN-DIFFDAY-EXIT.
           IF DM-MST-DT-REF EQUAL WS-DAY(7) THEN
               MOVE +6 TO WS-DIFFDAY
               GO TO SAAM-IN-DIFFDAY-EXIT.
           IF DM-MST-DT-REF EQUAL WS-DAY(8) THEN
               MOVE +7 TO WS-DIFFDAY
               GO TO SAAM-IN-DIFFDAY-EXIT.
           IF DM-MST-DT-REF EQUAL WS-DAY(9) THEN
               MOVE +8 TO WS-DIFFDAY
               GO TO SAAM-IN-DIFFDAY-EXIT.
           IF DM-MST-DT-REF EQUAL WS-DAY(10) THEN
               MOVE +9 TO WS-DIFFDAY
               GO TO SAAM-IN-DIFFDAY-EXIT.
           MOVE DM-MST-DT-REF TO WS-YYDDD.
               MOVE WS-YYDDD-YY  TO D-C-YEAR.
               MOVE WS-YYDDD-DDD TO D-C-DOY.
           MOVE ZERO TO D-C-JDAY
                        D-C-MONTH
                        D-C-DOM
                        D-C-DOW.
           CALL 'DATCNVRT' USING
                        D-C-YEAR
                        D-C-MONTH
                        D-C-DOM
                        D-C-DOY
                        D-C-DOW
                        D-C-JDAY.
           SUBTRACT D-C-JDAY FROM WS-TODAY-JDAY GIVING WS-DIFFDAY.
       SAAM-IN-DIFFDAY-EXIT.
           EXIT.
       SAAM-IN-END.
           CLOSE MASTER.
       SAAM-IN-EXIT.
           EXIT.
       SAAM-OUT SECTION.
           MOVE 'N' TO SORTFILE-EOF-SW.
           OPEN OUTPUT RPTEOLD.
           PERFORM SAAM-OUT-READ THRU SAAM-OUT-READ-EXIT.
           IF SORTFILE-EOF THEN
               GO TO SAAM-OUT-END.
           PERFORM SAAM-OUT-RPT-EOLD.
       SAAM-OUT-NEXT.
           PERFORM SAAM-OUT-READ THRU SAAM-OUT-READ-EXIT.
           IF SORTFILE-EOF THEN
               GO TO SAAM-OUT-END.
           PERFORM SAAM-OUT-RPT-EOLD.
           GO TO SAAM-OUT-NEXT.
       SAAM-OUT-RPT-EOLD.
           MOVE SAAM-AAM           TO DET-EO-AAM.
           MOVE SAAM-SW-3          TO DET-EO-SW-3.
           MOVE SAAM-DSNAME        TO DET-EO-DSNAME.
           MOVE SAAM-ALLOC         TO DET-EO-ALLOC.
           MOVE SAAM-DSORG         TO DET-EO-DSORG.
           MOVE SAAM-VOLSER        TO DET-EO-VOLSER.
           MOVE SAAM-DIFFDAY       TO DET-EO-DIFFDAY.
           MOVE SAAM-VOLSER        TO WS-VOL-POOL.
           MOVE DET-EO TO DETAIL-TEXT.
           IF WS-VOL-POOL EQUAL 'PRD' THEN
              ADD +1 TO SUMY-EOP-CT
              ADD SAAM-ALLOC TO SUMY-EOP-ALLOC.
           IF WS-VOL-POOL EQUAL 'SYS' OR 'SRE' THEN
              ADD +1 TO SUMY-EOS-CT
              ADD SAAM-ALLOC TO SUMY-EOS-ALLOC.
           IF WS-VOL-POOL EQUAL 'IPO' THEN
              ADD +1 TO SUMY-EOI-CT
              ADD SAAM-ALLOC TO SUMY-EOI-ALLOC.
           PERFORM EOLD-A-LINE.
       SAAM-OUT-READ.
           RETURN SORTAAM
               AT END MOVE 'Y' TO SORTFILE-EOF-SW.
       SAAM-OUT-READ-EXIT.
           EXIT.
       SAAM-OUT-END.
           CLOSE RPTEOLD.
       SAAM-OUT-EXIT.
           EXIT.
       VOL-VT-PERCENT.
           COMPUTE SUM-VT-PRD-PCT ROUNDED =
             SUMY-VT-PRD / SUMY-VT-PRD-CT.
           COMPUTE SUM-VT-ONL-PCT ROUNDED =
             SUMY-VT-ONL / SUMY-VT-ONL-CT.
           COMPUTE SUM-VT-SYS-PCT ROUNDED =
             SUMY-VT-SYS / SUMY-VT-SYS-CT.
           COMPUTE SUM-VT-IPO-PCT ROUNDED =
             SUMY-VT-IPO / SUMY-VT-IPO-CT.
           MOVE SUMY-VT-PRD-CT  TO  SUM-VT-PRD-CT.
           MOVE SUMY-VT-ONL-CT  TO  SUM-VT-ONL-CT.
           MOVE SUMY-VT-SYS-CT  TO  SUM-VT-SYS-CT.
           MOVE SUMY-VT-IPO-CT  TO  SUM-VT-IPO-CT.
           COMPUTE SUM-VU-PRD-PCT ROUNDED =
             SUMY-VU-PRD / SUMY-VT-PRD-CT.
           COMPUTE SUM-VU-ONL-PCT ROUNDED =
             SUMY-VU-ONL / SUMY-VT-ONL-CT.
           COMPUTE SUM-VU-SYS-PCT ROUNDED =
             SUMY-VU-SYS / SUMY-VT-SYS-CT.
           COMPUTE SUM-VU-IPO-PCT ROUNDED =
             SUMY-VU-IPO / SUMY-VT-IPO-CT.
           MOVE SUMY-VT-PRD-CT  TO  SUM-VU-PRD-CT.
           MOVE SUMY-VT-ONL-CT  TO  SUM-VU-ONL-CT.
           MOVE SUMY-VT-SYS-CT  TO  SUM-VU-SYS-CT.
           MOVE SUMY-VT-IPO-CT  TO  SUM-VU-IPO-CT.
       VOL-VT-PERCENT-EXIT.
           EXIT.
       RPT-RGDG SECTION.
           IF DM-MST-DSORG NOT EQUAL 'GO' THEN
               GO TO RPT-RGDG-EXIT.
           MOVE DM-MST-AAM         TO DET-GG-AAM.
           MOVE DM-MST-SW          TO DET-GG-SW.
           MOVE DM-MST-DSNAME      TO DET-GG-DSNAME.
           MOVE DM-MST-VOLSER      TO DET-GG-VOLSER.
           MOVE DM-MST-ALLOC       TO DET-GG-ALLOC.
           MOVE DM-MST-USED-CUR    TO DET-GG-USED-CUR
           MOVE DM-MST-USED-HI     TO DET-GG-USED-HI.
           MOVE DM-MST-DT-CREATE   TO DET-GG-DT-CREATE.
           MOVE DM-MST-DT-REF      TO DET-GG-DT-REF.
           MOVE DM-MST-RECFM       TO DET-GG-RECFM.
           MOVE DM-MST-LRECL       TO DET-GG-LRECL.
           MOVE DM-MST-BLKSIZE     TO DET-GG-BLKSIZE.
           MOVE DM-MST-EXTENT-CT   TO DET-GG-EXTENT-CT.
           MOVE DM-MST-VOLSER      TO WS-VOL-POOL.
           MOVE DET-GG TO DETAIL-TEXT.
           IF WS-VOL-POOL EQUAL 'PRD' THEN
              ADD +1 TO SUMY-GGP-CT.
           IF WS-VOL-POOL EQUAL 'SYS' OR 'SRE' THEN
              ADD +1 TO SUMY-GGS-CT.
           IF WS-VOL-POOL EQUAL 'IPO' THEN
              ADD +1 TO SUMY-GGI-CT.
           PERFORM RGDG-A-LINE.
       RPT-RGDG-EXIT.
           EXIT.
       RPT-PERM SECTION.
           IF DM-MST-SW-3 NOT EQUAL 'I' THEN
              GO TO RPT-PERM-EXIT.
           MOVE DM-MST-AAM         TO DET-PM-AAM.
           MOVE DM-MST-SW          TO DET-PM-SW.
           MOVE DM-MST-DSNAME      TO DET-PM-DSNAME.
           MOVE DM-MST-VOLSER      TO DET-PM-VOLSER.
           MOVE DM-MST-ALLOC       TO DET-PM-ALLOC.
           MOVE DM-MST-USED-CUR    TO DET-PM-USED-CUR
           MOVE DM-MST-USED-HI     TO DET-PM-USED-HI.
           MOVE DM-MST-DT-CREATE   TO DET-PM-DT-CREATE.
           MOVE DM-MST-DT-REF      TO DET-PM-DT-REF.
           MOVE DM-MST-RECFM       TO DET-PM-RECFM.
           MOVE DM-MST-LRECL       TO DET-PM-LRECL.
           MOVE DM-MST-BLKSIZE     TO DET-PM-BLKSIZE.
           MOVE DM-MST-VOLSER      TO WS-VOL-POOL.
           MOVE DET-PM TO DETAIL-TEXT.
           IF WS-VOL-POOL EQUAL 'PRD' THEN
              ADD +1 TO SUMY-PMP-CT
              ADD DM-MST-ALLOC TO SUMY-PMP-ALLOC.
           IF WS-VOL-POOL EQUAL 'SYS' OR 'SRE' THEN
              ADD +1 TO SUMY-PMS-CT
              ADD DM-MST-ALLOC TO SUMY-PMS-ALLOC.
           IF WS-VOL-POOL EQUAL 'IPO' THEN
              ADD +1 TO SUMY-PMI-CT
              ADD DM-MST-ALLOC TO SUMY-PMI-ALLOC.
           PERFORM PERM-A-LINE.
       RPT-PERM-EXIT.
           EXIT.
       RPT-XTNT SECTION.
           IF DM-MST-EXTENT-CT EQUAL 01 THEN
              GO TO RPT-XTNT-EXIT.
           IF DM-MST-DSORG EQUAL 'GO ' THEN
              GO TO RPT-XTNT-EXIT.
           IF DM-MST-DSORG EQUAL 'VS ' THEN
              GO TO RPT-XTNT-EXIT.
           MOVE DM-MST-AAM       TO DET-XC-AAM.
           MOVE DM-MST-DSNAME    TO DET-XC-DSNAME.
           MOVE DM-MST-VOLSER    TO DET-XC-VOLSER.
           MOVE DM-MST-SW-1      TO DET-XC-SW-1.
           MOVE DM-MST-EXTENT-CT TO DET-XC-EXTENT-CT.
           MOVE DM-MST-ALLOC     TO DET-XC-ALLOC.
           MOVE DM-MST-USED-CUR  TO DET-XC-USED-CUR.
           MOVE DM-MST-USED-HI   TO DET-XC-USED-HI.
           MOVE DM-MST-DSORG     TO DET-XC-DSORG.
           MOVE DM-MST-VOLSER    TO WS-VOL-POOL.
           MOVE DET-XC TO DETAIL-TEXT.
           IF WS-VOL-POOL EQUAL 'PRD' THEN
              ADD +1 TO SUMY-XCP-CT
              ADD DM-MST-ALLOC TO SUMY-XCP-ALLOC.
           IF WS-VOL-POOL EQUAL 'SYS' OR 'SRE' THEN
              ADD +1 TO SUMY-XCS-CT
              ADD DM-MST-ALLOC TO SUMY-XCS-ALLOC.
           IF WS-VOL-POOL EQUAL 'IPO' THEN
              ADD +1 TO SUMY-XCI-CT
              ADD DM-MST-ALLOC TO SUMY-XCI-ALLOC.
           PERFORM XTNT-A-LINE.
           MOVE 'Y' TO WS-FIXC-SW.
       RPT-XTNT-EXIT.
           EXIT.
       RPT-VTNT SECTION.
           IF DM-MST-EXTENT-CT EQUAL 01 THEN
              GO TO RPT-VTNT-EXIT.
           IF DM-MST-DSORG EQUAL 'GO ' THEN
              GO TO RPT-VTNT-EXIT.
           IF DM-MST-DSORG NOT EQUAL 'VS ' THEN
              GO TO RPT-VTNT-EXIT.
           MOVE DM-MST-AAM       TO DET-XV-AAM.
           MOVE DM-MST-DSNAME    TO DET-XV-DSNAME.
           MOVE DM-MST-VOLSER    TO DET-XV-VOLSER.
           MOVE DM-MST-SW-1      TO DET-XV-SW-1.
           MOVE DM-MST-EXTENT-CT TO DET-XV-EXTENT-CT.
           MOVE DM-MST-ALLOC     TO DET-XV-ALLOC.
           MOVE DM-MST-USED-CUR  TO DET-XV-USED-CUR.
           MOVE DM-MST-USED-HI   TO DET-XV-USED-HI.
           MOVE DM-MST-DSORG     TO DET-XV-DSORG.
           MOVE DM-MST-VOLSER    TO WS-VOL-POOL.
           MOVE DET-XV TO DETAIL-TEXT.
           IF WS-VOL-POOL EQUAL 'PRD' THEN
              ADD +1 TO SUMY-XVP-CT
              ADD DM-MST-ALLOC TO SUMY-XVP-ALLOC.
           IF WS-VOL-POOL EQUAL 'SYS' OR 'SRE' THEN
              ADD +1 TO SUMY-XVS-CT
              ADD DM-MST-ALLOC TO SUMY-XVS-ALLOC.
           IF WS-VOL-POOL EQUAL 'IPO' THEN
              ADD +1 TO SUMY-XVI-CT
              ADD DM-MST-ALLOC TO SUMY-XVI-ALLOC.
           PERFORM VTNT-A-LINE.
           MOVE 'Y' TO WS-FIXC-SW.
       RPT-VTNT-EXIT.
           EXIT.
       RPT-OVER SECTION.
           IF DM-MST-SW-1 EQUAL 'N' THEN
               GO TO RPT-OVER-EXIT.
           IF DM-MST-DSORG EQUAL 'GO ' THEN
               GO TO RPT-OVER-EXIT.
           IF DM-MST-USED-HI EQUAL +0 THEN
               GO TO RPT-OVER-EXIT.
           PERFORM XTNT-SB.
           IF DM-MST-ALLOC NOT GREATER WS-XTNT-SB THEN
              GO TO RPT-OVER-EXIT.
           MOVE DM-MST-DT-CREATE TO WS-YYDDD.
           MOVE WS-YYDDD-YY TO D-C-YEAR.
           MOVE WS-YYDDD-DDD TO D-C-DOY.
           MOVE ZERO TO D-C-MONTH
                        D-C-DOM
                        D-C-DOW
                        D-C-JDAY.
           CALL 'DATCNVRT' USING D-C-YEAR
                                 D-C-MONTH
                                 D-C-DOM
                                 D-C-DOY
                                 D-C-DOW
                                 D-C-JDAY.
           IF D-C-JDAY GREATER THAN WS-90-AGO-JDAY THEN
               GO TO RPT-OVER-EXIT.
           MOVE DM-MST-AAM     TO DET-XH-AAM.
           MOVE DM-MST-DSNAME  TO DET-XH-DSNAME.
           MOVE DM-MST-VOLSER  TO DET-XH-VOLSER.
           MOVE DM-MST-SW      TO DET-XH-SW.
           MOVE DM-MST-ALLOC   TO DET-XH-ALLOC.
           MOVE DM-MST-USED-HI TO DET-XH-USED-HI.
           MOVE WS-XTNT-SB     TO DET-XH-SB.
           SUBTRACT WS-XTNT-SB FROM DM-MST-ALLOC
                           GIVING DM-XH-NET.
           MOVE DM-MST-DT-CREATE TO DET-XH-DT-CREATE.
           MOVE DM-MST-DT-REF    TO DET-XH-DT-REF.
           MOVE DM-MST-EXTENT-CT TO DET-XH-EXTENT-CT.
           MOVE DM-MST-DSORG     TO DET-XH-DSORG.
           MOVE DM-MST-RECFM     TO DET-XH-RECFM.
           MOVE DM-XH-NET        TO DET-XH-NET.
           MOVE DM-MST-VOLSER    TO WS-VOL-POOL.
           MOVE DET-XH TO DETAIL-TEXT.
           IF WS-VOL-POOL EQUAL 'PRD' THEN
              ADD +1 TO SUMY-XHP-CT
           IF DM-MST-DSORG EQUAL 'VS ' THEN
               ADD DM-XH-NET TO SUMY-XHP-NET-VS
               ADD +1 TO SUMY-XHPV-CT
               SUBTRACT +1 FROM SUMY-XHP-CT
            ELSE ADD DM-XH-NET TO SUMY-XHP-NET.
           IF WS-VOL-POOL EQUAL 'SYS' OR 'SRE' THEN
              ADD +1 TO SUMY-XHS-CT
           IF DM-MST-DSORG EQUAL 'VS ' THEN
               ADD DM-XH-NET TO SUMY-XHS-NET-VS
               ADD +1 TO SUMY-XHSV-CT
               SUBTRACT +1 FROM SUMY-XHS-CT
            ELSE ADD DM-XH-NET TO SUMY-XHS-NET.
           IF WS-VOL-POOL EQUAL 'IPO' THEN
              ADD +1 TO SUMY-XHI-CT
           IF DM-MST-DSORG EQUAL 'VS ' THEN
               ADD DM-XH-NET TO SUMY-XHI-NET-VS
               ADD +1 TO SUMY-XHIV-CT
               SUBTRACT +1 FROM SUMY-XHI-CT
            ELSE ADD DM-XH-NET TO SUMY-XHI-NET.
           PERFORM OVER-A-LINE.
           MOVE 'Y' TO WS-FIXC-SW.
       RPT-OVER-EXIT.
           EXIT.
       RPT-MPTY SECTION.
           IF DM-MST-USED-HI NOT EQUAL +0 THEN
               GO TO RPT-MPTY-EXIT.
           IF DM-MST-SW-1 EQUAL 'N' THEN
               GO TO RPT-MPTY-EXIT.
           MOVE DM-MST-DT-CREATE TO WS-YYDDD.
           MOVE WS-YYDDD-YY TO D-C-YEAR.
           MOVE WS-YYDDD-DDD TO D-C-DOY.
           MOVE ZERO TO D-C-MONTH
                        D-C-DOM
                        D-C-DOW
                        D-C-JDAY.
           CALL 'DATCNVRT' USING D-C-YEAR
                                 D-C-MONTH
                                 D-C-DOM
                                 D-C-DOY
                                 D-C-DOW
                                 D-C-JDAY.
           IF D-C-JDAY GREATER THAN WS-90-AGO-JDAY THEN
               GO TO RPT-MPTY-EXIT.
           MOVE DM-MST-AAM     TO DET-MT-AAM.
           MOVE DM-MST-SW      TO DET-MT-SW.
           MOVE DM-MST-DSNAME  TO DET-MT-DSNAME.
           MOVE DM-MST-VOLSER  TO DET-MT-VOLSER.
           MOVE DM-MST-ALLOC   TO DET-MT-ALLOC.
           MOVE DM-MST-USED-HI TO DET-MT-USED-HI.
           MOVE DM-MST-DT-CREATE TO DET-MT-DT-CREATE.
           MOVE DM-MST-DT-REF  TO DET-MT-DT-REF.
           MOVE DM-MST-DSORG   TO DET-MT-DSORG.
           MOVE DM-MST-RECFM   TO DET-MT-RECFM.
           MOVE DM-MST-LRECL   TO DET-MT-LRECL.
           MOVE DM-MST-BLKSIZE TO DET-MT-BLKSIZE.
           MOVE DM-MST-EXTENT-CT TO DET-MT-EXTENT-CT.
           MOVE DM-MST-VOLSER    TO WS-VOL-POOL.
           MOVE DET-MT TO DETAIL-TEXT.
           IF WS-VOL-POOL EQUAL 'PRD' THEN
              ADD +1 TO SUMY-MTP-CT
              ADD DM-MST-ALLOC TO SUMY-MTP-ALLOC.
           IF WS-VOL-POOL EQUAL 'SYS' OR 'SRE' THEN
              ADD +1 TO SUMY-MTS-CT
              ADD DM-MST-ALLOC TO SUMY-MTS-ALLOC.
           IF WS-VOL-POOL EQUAL 'IPO' THEN
              ADD +1 TO SUMY-MTI-CT
              ADD DM-MST-ALLOC TO SUMY-MTI-ALLOC.
           PERFORM MPTY-A-LINE.
       RPT-MPTY-EXIT.
           EXIT.
       RPT-SUMY SECTION.
           MOVE SUM-TITLE0 TO DETAIL-TEXT.
           PERFORM SUMT-A-LINE.
           MOVE SUM-TITLE1 TO DETAIL-TEXT.
           PERFORM SUMT-A-LINE.
           MOVE SUM-TITLE2 TO DETAIL-TEXT.
           PERFORM SUMT-A-LINE.
           MOVE SUM-TITLE3 TO DETAIL-TEXT.
           PERFORM SUMT-A-LINE.
           MOVE SUMY-XCP-CT     TO SUM-XCP-CT.
           MOVE SUMY-XCS-CT     TO SUM-XCS-CT.
           MOVE SUMY-XCI-CT     TO SUM-XCI-CT.
           MOVE SUMY-XCP-ALLOC  TO SUM-XCP-ALLOC.
           MOVE SUMY-XCS-ALLOC  TO SUM-XCS-ALLOC.
           MOVE SUMY-XCI-ALLOC  TO SUM-XCI-ALLOC.
           MOVE SUM-XC TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUMY-XVP-CT     TO SUM-XVP-CT.
           MOVE SUMY-XVS-CT     TO SUM-XVS-CT.
           MOVE SUMY-XVI-CT     TO SUM-XVI-CT.
           MOVE SUMY-XVP-ALLOC  TO SUM-XVP-ALLOC.
           MOVE SUMY-XVS-ALLOC  TO SUM-XVS-ALLOC.
           MOVE SUMY-XVI-ALLOC  TO SUM-XVI-ALLOC.
           MOVE SUM-XV TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUMY-XCPV-CT    TO SUM-XCPV-CT.
           MOVE SUMY-XCSV-CT    TO SUM-XCSV-CT.
           MOVE SUMY-XCIV-CT    TO SUM-XCIV-CT.
           ADD SUMY-XCP-ALLOC  SUMY-XVP-ALLOC GIVING SUMY-XCPV-TOTAL.
           ADD SUMY-XCS-ALLOC  SUMY-XVS-ALLOC GIVING SUMY-XCSV-TOTAL.
           ADD SUMY-XCI-ALLOC  SUMY-XVI-ALLOC GIVING SUMY-XCIV-TOTAL.
           MOVE SUMY-XCPV-TOTAL TO SUM-XCPV-TOTAL.
           MOVE SUMY-XCSV-TOTAL TO SUM-XCSV-TOTAL.
           MOVE SUMY-XCIV-TOTAL TO SUM-XCIV-TOTAL.
           MOVE SUM-XCV TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE +2 TO SUMY-SPACE.
           MOVE SUM-TITLE0 TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE +0 TO SUMY-SPACE.
           MOVE SUMY-XHP-CT     TO SUM-XHP-CT.
           MOVE SUMY-XHS-CT     TO SUM-XHS-CT.
           MOVE SUMY-XHI-CT     TO SUM-XHI-CT.
           MOVE SUMY-XHP-NET    TO SUM-XHP-NET.
           MOVE SUMY-XHS-NET    TO SUM-XHS-NET.
           MOVE SUMY-XHI-NET    TO SUM-XHI-NET.
           MOVE SUM-XH1 TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUMY-XHPV-CT    TO SUM-XHPV-CT.
           MOVE SUMY-XHSV-CT    TO SUM-XHSV-CT.
           MOVE SUMY-XHIV-CT    TO SUM-XHIV-CT.
           MOVE SUMY-XHP-NET-VS TO SUM-XHP-NET-VS.
           MOVE SUMY-XHS-NET-VS TO SUM-XHS-NET-VS.
           MOVE SUMY-XHI-NET-VS TO SUM-XHI-NET-VS.
           MOVE SUM-XH2 TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           ADD  SUMY-XHP-CT     TO SUMY-XHP-CT-TOTAL.
           ADD  SUMY-XHPV-CT    TO SUMY-XHP-CT-TOTAL.
           ADD  SUMY-XHS-CT     TO SUMY-XHS-CT-TOTAL.
           ADD  SUMY-XHSV-CT    TO SUMY-XHS-CT-TOTAL.
           ADD  SUMY-XHI-CT     TO SUMY-XHI-CT-TOTAL.
           ADD  SUMY-XHIV-CT    TO SUMY-XHI-CT-TOTAL.
           ADD  SUMY-XHP-NET    TO SUMY-XHP-NET-TOTAL.
           ADD  SUMY-XHP-NET-VS TO SUMY-XHP-NET-TOTAL.
           ADD  SUMY-XHS-NET    TO SUMY-XHS-NET-TOTAL.
           ADD  SUMY-XHS-NET-VS TO SUMY-XHS-NET-TOTAL.
           ADD  SUMY-XHI-NET    TO SUMY-XHI-NET-TOTAL.
           ADD  SUMY-XHI-NET-VS TO SUMY-XHI-NET-TOTAL.
           MOVE SUMY-XHP-CT-TOTAL  TO SUM-XHP-CT-TOTAL.
           MOVE SUMY-XHS-CT-TOTAL  TO SUM-XHS-CT-TOTAL.
           MOVE SUMY-XHI-CT-TOTAL  TO SUM-XHI-CT-TOTAL.
           MOVE SUMY-XHP-NET-TOTAL TO SUM-XHP-NET-TOTAL.
           MOVE SUMY-XHS-NET-TOTAL TO SUM-XHS-NET-TOTAL.
           MOVE SUMY-XHI-NET-TOTAL TO SUM-XHI-NET-TOTAL.
           MOVE SUM-XH3 TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE +2 TO SUMY-SPACE.
           MOVE SUM-TITLE0 TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE +0 TO SUMY-SPACE.
           MOVE SUMY-MTP-CT     TO SUM-MTP-CT.
           MOVE SUMY-MTS-CT     TO SUM-MTS-CT.
           MOVE SUMY-MTI-CT     TO SUM-MTI-CT.
           MOVE SUMY-MTP-ALLOC  TO SUM-MTP-ALLOC.
           MOVE SUMY-MTS-ALLOC  TO SUM-MTS-ALLOC.
           MOVE SUMY-MTI-ALLOC  TO SUM-MTI-ALLOC.
           MOVE SUM-MT TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUMY-GGP-CT     TO SUM-GGP-CT.
           MOVE SUMY-GGS-CT     TO SUM-GGS-CT.
           MOVE SUMY-GGI-CT     TO SUM-GGI-CT.
           MOVE SUM-GG TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUMY-PMP-CT     TO SUM-PMP-CT.
           MOVE SUMY-PMS-CT     TO SUM-PMS-CT.
           MOVE SUMY-PMI-CT     TO SUM-PMI-CT.
           MOVE SUMY-PMP-ALLOC  TO SUM-PMP-ALLOC.
           MOVE SUMY-PMS-ALLOC  TO SUM-PMS-ALLOC.
           MOVE SUMY-PMI-ALLOC  TO SUM-PMI-ALLOC.
           MOVE SUM-PM TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUMY-EOP-CT     TO SUM-EOP-CT.
           MOVE SUMY-EOS-CT     TO SUM-EOS-CT.
           MOVE SUMY-EOI-CT     TO SUM-EOI-CT.
           MOVE SUMY-EOP-ALLOC  TO SUM-EOP-ALLOC.
           MOVE SUMY-EOS-ALLOC  TO SUM-EOS-ALLOC.
           MOVE SUMY-EOI-ALLOC  TO SUM-EOI-ALLOC.
           MOVE SUM-EO TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUMY-LMP-CT         TO SUM-LMP-CT.
           MOVE SUMY-LMS-CT         TO SUM-LMS-CT.
           MOVE SUMY-LMI-CT         TO SUM-LMI-CT.
           MOVE SUMY-LMP-ALLOC      TO SUM-LMP-ALLOC.
           MOVE SUMY-LMS-ALLOC      TO SUM-LMS-ALLOC.
           MOVE SUMY-LMI-ALLOC      TO SUM-LMI-ALLOC.
           MOVE SUM-LM1 TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUMY-LMP-ALLOC-CUR  TO SUM-LMP-ALLOC-CUR.
           MOVE SUMY-LMS-ALLOC-CUR  TO SUM-LMS-ALLOC-CUR.
           MOVE SUMY-LMI-ALLOC-CUR  TO SUM-LMI-ALLOC-CUR.
           MOVE SUM-LM2 TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUM-VT TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUM-VU TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           ADD SUMY-LMP-CT          TO  SUMY-LM-TOTAL.
           ADD SUMY-LMS-CT          TO  SUMY-LM-TOTAL.
           ADD SUMY-LMI-CT          TO  SUMY-LM-TOTAL.
           ADD SUMY-LMP-ALLOC       TO  SUMY-LM-ALLC-TOTAL.
           ADD SUMY-LMS-ALLOC       TO  SUMY-LM-ALLC-TOTAL.
           ADD SUMY-LMI-ALLOC       TO  SUMY-LM-ALLC-TOTAL.
           ADD SUMY-LMP-ALLOC-CUR   TO  SUMY-LM-CUR-TOTAL.
           ADD SUMY-LMS-ALLOC-CUR   TO  SUMY-LM-CUR-TOTAL.
           ADD SUMY-LMI-ALLOC-CUR   TO  SUMY-LM-CUR-TOTAL.
           MOVE SUMY-LM-TOTAL       TO  SUM-LM-TOTAL.
           MOVE SUMY-LM-ALLC-TOTAL  TO  SUM-LM-ALLC-TOTAL.
           MOVE +1 TO SUMY-SPACE.
           MOVE SUM-LM3 TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
           MOVE SUMY-LM-CUR-TOTAL   TO  SUM-LM-CUR-TOTAL.
           MOVE +0 TO SUMY-SPACE.
           MOVE SUM-LM4 TO DETAIL-TEXT.
           PERFORM SUMY-A-LINE.
       RPT-SUMY-EXIT.
           EXIT.
       GEN-FIXC SECTION.
           IF WS-FIXC-SW EQUAL 'N' THEN
              GO TO GEN-FIXC-EXIT.
           IF DM-MST-SW-1 EQUAL 'N' THEN
              GO TO GEN-FIXC-EXIT.
           IF WS-XTNT-SW EQUAL 'N' THEN
              PERFORM XTNT-SB.
           MOVE DM-MST-DSNAME  TO FIXC-DSNAME.
           MOVE DM-MST-VOLSER  TO FIXC-VOLSER.
           MOVE WS-XTNT-SB     TO FIXC-ALLOC.
           MOVE DM-MST-DSORG   TO FIXC-DSORG.
           MOVE DM-MST-RECFM   TO FIXC-RECFM.
           MOVE DM-MST-LRECL   TO FIXC-LRECL.
           MOVE DM-MST-BLKSIZE TO FIXC-BLKSI.
           WRITE FIXC-REC FROM WS-FIXC.
       GEN-FIXC-EXIT.
           EXIT.
       XTNT-SB SECTION.
           MULTIPLY DM-MST-USED-HI BY +1.1 GIVING WS-XTNT-1.
           ADD      WS-XTNT-1       +0.9 GIVING WS-XTNT-SB.
           IF WS-XTNT-SB EQUAL +0 THEN MOVE +1 TO WS-XTNT-SB.
           MOVE DM-MST-VOLSER TO WS-VOL-VOLSER.
           PERFORM LOC-VOLSER.
           MULTIPLY WS-VOL-TRK-CYL BY +10 GIVING WS-XTNT-2.
           IF WS-XTNT-SB GREATER THAN WS-XTNT-2 THEN
               DIVIDE WS-XTNT-SB BY WS-VOL-TRK-CYL
                            GIVING WS-XTNT-1
               ADD  WS-XTNT-1 +0.9 GIVING WS-XTNT-2
               MULTIPLY WS-XTNT-2 BY WS-VOL-TRK-CYL
                            GIVING WS-XTNT-SB.
           MOVE 'Y' TO WS-XTNT-SW.
       XTNT-SB-EXIT.
           EXIT.
       VSUM-A-LINE SECTION.
           ADD +2 TO VSUM-LINE-CT.
           IF VSUM-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +3 TO VSUM-LINE-CT
               ADD +1 TO VSUM-PAGE-CT
               MOVE VSUM-PAGE-CT TO H-2-PAGE
               WRITE VSUM-REC FROM HEADING-2
                   AFTER ADVANCING TO-TOP
               WRITE VSUM-REC FROM HEADING-G
                   AFTER ADVANCING 2.
           WRITE VSUM-REC FROM DETAIL-LINE AFTER ADVANCING 2.
       XTNT-A-LINE SECTION.
           ADD +1 TO XTNT-LINE-CT.
           IF XTNT-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +3 TO XTNT-LINE-CT
               ADD +1 TO XTNT-PAGE-CT
               MOVE XTNT-PAGE-CT TO H-4-PAGE
               WRITE XTNT-REC FROM HEADING-4
                   AFTER ADVANCING TO-TOP
               WRITE XTNT-REC FROM HEADING-E
                   AFTER ADVANCING 2.
           WRITE XTNT-REC FROM DETAIL-LINE AFTER ADVANCING 1.
       VTNT-A-LINE SECTION.
           ADD +1 TO VTNT-LINE-CT.
           IF VTNT-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +3 TO VTNT-LINE-CT
               ADD +1 TO VTNT-PAGE-CT
               MOVE VTNT-PAGE-CT TO H-11-PAGE
               WRITE VTNT-REC FROM HEADING-11
                   AFTER ADVANCING TO-TOP
               WRITE VTNT-REC FROM HEADING-E
                   AFTER ADVANCING 2.
           WRITE VTNT-REC FROM DETAIL-LINE AFTER ADVANCING 1.
       OVER-A-LINE SECTION.
           ADD +1 TO OVER-LINE-CT.
           IF OVER-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +3 TO OVER-LINE-CT
               ADD +1 TO OVER-PAGE-CT
               MOVE OVER-PAGE-CT TO H-6-PAGE
               WRITE OVER-REC FROM HEADING-6
                   AFTER ADVANCING TO-TOP
               WRITE OVER-REC FROM HEADING-B
                   AFTER ADVANCING 2.
           WRITE OVER-REC FROM DETAIL-LINE AFTER ADVANCING 1.
       MPTY-A-LINE SECTION.
           ADD +1 TO MPTY-LINE-CT.
           IF MPTY-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +3 TO MPTY-LINE-CT
               ADD +1 TO MPTY-PAGE-CT
               MOVE MPTY-PAGE-CT TO H-C-PAGE
               WRITE MPTY-REC FROM HEADING-C
                   AFTER ADVANCING TO-TOP
               WRITE MPTY-REC FROM HEADING-D
                   AFTER ADVANCING 2.
           WRITE MPTY-REC FROM DETAIL-LINE AFTER ADVANCING 1.
       EOLD-A-LINE SECTION.
           ADD +1 TO EOLD-LINE-CT.
           IF EOLD-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +3 TO EOLD-LINE-CT
               ADD +1 TO EOLD-PAGE-CT
               MOVE EOLD-PAGE-CT TO H-5-PAGE
               WRITE EOLD-REC FROM HEADING-5
                   AFTER ADVANCING TO-TOP
               WRITE EOLD-REC FROM HEADING-F
                   AFTER ADVANCING 2.
           WRITE EOLD-REC FROM DETAIL-LINE AFTER ADVANCING 1.
       VDET-A-LINE SECTION.
           ADD +1 TO VDET-LINE-CT.
           IF VDET-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +3 TO VDET-LINE-CT
               ADD +1 TO VDET-PAGE-CT
               MOVE VDET-PAGE-CT TO H-1-PAGE
               WRITE VDET-REC FROM HEADING-1
                   AFTER ADVANCING TO-TOP
               WRITE VDET-REC FROM HEADING-3
                   AFTER ADVANCING 2.
           WRITE VDET-REC FROM DETAIL-LINE AFTER ADVANCING 1.
       RGDG-A-LINE SECTION.
           ADD +1 TO RGDG-LINE-CT.
           IF RGDG-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +3 TO RGDG-LINE-CT
               ADD +1 TO RGDG-PAGE-CT
               MOVE RGDG-PAGE-CT TO H-7-PAGE
               WRITE RGDG-REC FROM HEADING-7
                   AFTER ADVANCING TO-TOP
               WRITE RGDG-REC FROM HEADING-8
                   AFTER ADVANCING 2.
           WRITE RGDG-REC FROM DETAIL-LINE AFTER ADVANCING 1.
       PERM-A-LINE SECTION.
           ADD +1 TO PERM-LINE-CT.
           IF PERM-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +3 TO PERM-LINE-CT
               ADD +1 TO PERM-PAGE-CT
               MOVE PERM-PAGE-CT TO H-9-PAGE
               WRITE PERM-REC FROM HEADING-9
                   AFTER ADVANCING TO-TOP
               WRITE PERM-REC FROM HEADING-A
                   AFTER ADVANCING 2.
           WRITE PERM-REC FROM DETAIL-LINE AFTER ADVANCING 1.
       SUMY-A-LINE SECTION.
           IF SUMY-SPACE EQUAL +0 THEN
             ADD +3 TO SUMY-LINE-CT.
           IF SUMY-SPACE EQUAL +1 THEN
             ADD +4 TO SUMY-LINE-CT.
           IF SUMY-SPACE EQUAL +2 THEN
             ADD +1 TO SUMY-LINE-CT.
           IF SUMY-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +1 TO SUMY-LINE-CT
               ADD +1 TO SUMY-PAGE-CT
               MOVE SUMY-PAGE-CT TO H-10-PAGE
               WRITE SUMY-REC FROM HEADING-10
                   AFTER ADVANCING TO-TOP.
           IF SUMY-SPACE EQUAL +0 THEN
             WRITE SUMY-REC FROM DETAIL-LINE AFTER ADVANCING 3.
           IF SUMY-SPACE EQUAL +1 THEN
             WRITE SUMY-REC FROM DETAIL-LINE AFTER ADVANCING 4.
           IF SUMY-SPACE EQUAL +2 THEN
             WRITE SUMY-REC FROM DETAIL-LINE AFTER ADVANCING 1.
       SUMT-A-LINE SECTION.
           ADD +1 TO SUMY-LINE-CT.
           IF SUMY-LINE-CT GREATER THAN LINE-MAX THEN
               MOVE +1 TO SUMY-LINE-CT
               ADD +1 TO SUMY-PAGE-CT
               MOVE SUMY-PAGE-CT TO H-10-PAGE
               WRITE SUMY-REC FROM HEADING-10
                   AFTER ADVANCING TO-TOP.
             WRITE SUMY-REC FROM DETAIL-LINE AFTER ADVANCING 1.
       BLD-VOLSER SECTION.
           OPEN INPUT VOLSERIN.
           SET VOL-INDEX TO +1.
       BLD-VOLSER-LOOP.
           READ VOLSERIN AT END
               GO TO BLD-VOLSER-END.
           IF DM-VOL-VOLSER NOT GREATER THAN WS-VOL-VOLSER
               THEN
               DISPLAY 'VOLSER TABLE OUT OF SEQUENCE'
                       ' OLD ENTRY = ' WS-VOL-VOLSER
                       ' NEW ENTRY = ' DM-VOL-VOLSER
                       UPON SYSOUT
               MOVE +1000 TO ABEND-CODE
               CALL 'USERDUMP' USING ABEND-CODE.
           IF VOL-INDEX GREATER THAN +200 THEN
               DISPLAY 'VOLSER TABLE OVERFLOW'
                   UPON SYSOUT
               MOVE +1000 TO ABEND-CODE
               CALL 'USERDUMP' USING ABEND-CODE.
           ADD +1 TO WS-VOLSER-HI.
           MOVE DM-VOL-VOLSER   TO WS-VOL-VOLSER
                                   VOLTAB-VOLSER (VOL-INDEX).
           MOVE DM-VOL-BYTES    TO VOLTAB-BYTES (VOL-INDEX).
           MOVE DM-VOL-TRK-CYL  TO VOLTAB-TRK-CYL (VOL-INDEX).
           MOVE DM-VOL-CYL-VOL  TO VOLTAB-CYL-VOL (VOL-INDEX).
           MOVE DM-VOL-POOL     TO VOLTAB-POOL (VOL-INDEX).
           MOVE DM-VOL-SW-DUP   TO VOLTAB-SW-DUP (VOL-INDEX).
           SET VOL-INDEX UP BY +1.
           GO TO BLD-VOLSER-LOOP.
       BLD-VOLSER-END.
           CLOSE VOLSERIN.
           MOVE LOW-VALUES TO WS-VOL-VOLSER.
       BLD-VOLSER-EXIT.
           EXIT.
       LOC-VOLSER SECTION.
           SEARCH ALL VOLTAB
               WHEN VOLTAB-VOLSER (VOL-INDEX) EQUAL WS-VOL-VOLSER
                   GO TO LOC-VOLSER-HIT.
           DISPLAY 'VOLSER = ' WS-VOL-VOLSER
                   ' NOT FOUND IN VOLUME TABLE'
                   UPON SYSOUT.
           MOVE +1000 TO ABEND-CODE.
           CALL 'USERDUMP' USING ABEND-CODE.
       LOC-VOLSER-HIT.
           MOVE VOLTAB-VOLSER (VOL-INDEX)   TO WS-VOL-VOLSER.
           MOVE VOLTAB-BYTES (VOL-INDEX)    TO WS-VOL-BYTES.
           MOVE VOLTAB-TRK-CYL (VOL-INDEX)  TO WS-VOL-TRK-CYL.
           MOVE VOLTAB-CYL-VOL (VOL-INDEX)  TO WS-VOL-CYL-VOL.
           MOVE VOLTAB-POOL (VOL-INDEX)     TO WS-VOL-POOL.
           MOVE VOLTAB-SW-DUP (VOL-INDEX)   TO WS-VOL-SW-DUP.
           MULTIPLY WS-VOL-TRK-CYL BY WS-VOL-CYL-VOL
                                        GIVING WS-VOL-TRK-VOL.
       LOC-VOLSER-EXIT.
           EXIT.
       E-O-J SECTION.
           PERFORM RPT-SUMY.
           CLOSE RPTSUMY.
           STOP RUN.
