*
*         RECORD LAYOUT FOR THE HSM MCDS - SEE LY35 0026
*
*
*         'K' SECTION - COMMON FIELDS
*
MCK      DS    XL44           RECORD KEY
MCH      DS    0CL20          HEADER
MCHLEN   DS    H              RECORD LENGTH INCLUDING KEY AND HEADER
MCHTYPE  DS    X              RECORD TYPE
MCHTYPED EQU   X'00'          DATA SET (MIGRATE)
MCHTYPEU EQU   X'01'          USER
MCHTYPE1 EQU   X'02'          FREESPACE ON MIGRATION LEVEL 1
MCHTYPEV EQU   X'04'          VOLUME
MCHTYPEN EQU   X'07'          JES3 VOLUME ALLOC COUNT
MCHTYPES EQU   X'10'          STATISTICS OR CONTROL
MCHTYPEA EQU   X'11'          MIGRATED COPY NAME
MCHTYPEO EQU   X'12'          VSAM DATA SET ASSOCIATIONS
*
MCHTYPEB EQU   X'20'          DATASET (BACKUP)
MCHTYPEC EQU   X'24'          BACKUP VERSION ENTRY
MCHTYPEM EQU   X'26'          MOVE BACKUP COPY
MCHTYPEL EQU   X'27'          BACKUP MIGRATED DATASET
MCHTYPEP EQU   X'28'          VOLUME THAT HAS BEEN BACKED UP
MCHTYPEX EQU   X'2C'          BACKUP VOLUME
MCHTYPER EQU   X'30'          CONTROL
*
MCHTYPET EQU   X'32'          TAPE TABLE OF CONTENTS
         DS    X              RESERVED
MCHTSLU  DS    XL8            RECORD UPDATE TIME STAMP (STCK FORMAT)
MCHSTCR  DS    XL8            RECORD CREATE TIME STAMP (STCK FORMAT)
MCKEND   DS    0X             END OF STANDARD HEADER
*
*         'A' SECTION - ALIAS ENTRY RECORD
*
         ORG   MCKEND         BACK TO END OF COMMON SECTION
MCAINTTP DS    C              RECALL INTERCEPT TYPE
MCAINTTD EQU   C'D'           DATA OBJECT
MCAINTTI EQU   C'I'           INDEX OBJECT
MCAINTTR EQU   C'R'           PATH OBJECT
MCAINTTG EQU   C'G'           AIX OBJECT
MCAINTTM EQU   C'M'           GENERATED NAME OF MIGRATION DATA SET
MCAVSATP DS    C              VSAM ASSOCIATION TYPE
MCAVSATC EQU   C'C'           CLUSTER
MCAVSATG EQU   C'G'           AIX
         DS    XL2            RESERVED
MCAINTNM DS    CL44           DATA SET RECORD KEY
*
*         'D' SECTION - DATA SET RECORD
*
         ORG   MCKEND         BACK TO END OF COMMON SECTION
MCDVSN   DS    CL6            VOL SER OF MIGRATION VOLUME
MCDFLGS  DS    0XL2           FLAGS
MCDFLG1  DS    X
MCDFLASN EQU   B'10000000'    MIGRATED COPY EXISTS
MCDFLMIG EQU   B'01000000'    DATA SET IS TO BE MIGRATED
MCDFNOMG EQU   B'00100000'    RETAINED FROM MIGRATION
MCDFDEL  EQU   B'00010000'    DATA SET WAS DELETED
MCDFSDP  EQU   B'00001000'    VSAM SMALL DATASET PACKING
MCDFL2   EQU   B'00000100'    DATA SET IS ON LEVEL 2
MCDFNSCR EQU   B'00000010'    RECALLED BUT MIG COPY NOT YER SCRATCHED
MCDJES3  EQU   B'00000001'    RECORD PROCESSED DURING JES3 SETUP
MCDFLG2  DS    X
MCDFMCO  EQU   B'10000000'    MCO RECORD EXISTS
MCDFMIGP EQU   B'01000000'    VSAM MIGRATION IN PROGRESS
MCDNOUPD EQU   B'00100000'    RACF PROFILE NOT UPDATED
MCDRACND EQU   B'00010000'    RACF INDICATED
*        EQU   B'00001000'    RESERVED
MCDFSMVL EQU   B'00000100'    SPACE MANAGMENT FLAGS VALID
MCDFDUMD EQU   B'00000010'    DUMMY RECORD
MCDFR3   EQU   B'00000001'    RECORD CREATED BY HSM REL 3
MCDCOMPR DS    X              PER CENT SAVED BY COMPACTION
         DS    XL3            RESERVED
MCDDLC   DS    XL4            DATE CREATED           00YYDDDF
MCDTLR   DS    XL4            TIME LAST REF'D        HHMMSSTH
MCDDLR   DS    XL4            DATE LAST REF'D        00YYDDDF
MCDTLU   DS    XL4            TIME LAST UPDATED      HHMMSSTH
MCDDLU   DS    XL4            DATE LAST UPDATED      00YYDDDF
MCDTMIG  DS    XL4            TIME LAST MIGRATE      HHMMSSTH
MCDDMIG  DS    XL4            DATE LAST MIGRATE      00YYDDDF
MCDDSORG DS    XL2            DATA SET ORGANIZATION FROM DSCB
MCDBLKSZ DS    H              BLOCK SIZE
MCDKEYLN DS    X              KEY LENGTH
MCDRECFM DS    X              RECORD FORMAT FROM DSCB
MCDDSIND DS    X              DATA SET INDICATORS FROM FMT1
MCDHID   DS    X              PROCESSOR ID OF PROCESSOR USING REC
MCDSIZE  DS    F              USER SIZE ALLOCATED IN TRACKS
MCDSIZEB DS    F              USER SIZE USED      IN BYTES
MCDCSZ   DS    F              SIZE IN 2K BLOCKS ON MIG VOL
MCDNMIG  DS    H              NUMBER OF TIMES MIGRATED
MCDDAYS  DS    H              DAYS BEFORE FILE ELIGIBLE FOR MIG
MCDFRVSN DS    0CL6           MIG FROM VOL SER
MCDOVSN  DS    CL6            RECALLED TO VOL SER
MDCFLG3  DS    X              FLAGS
MCDFMCL  EQU   B'10000000'    MCL RECORD EXISTS
MCDMCL43 DS    X              CHAR 43 FOR MCL RECORD KEY
MCDCTID  DS    XL4            COMPACTION TABLE ID
MCDUCBTY DS    XL4            UCBTYPE OF DATA SET FROM DSCB
MCDTRES  DS    XL4            TIME DATA SET REC/DEL  HHMMSSTH
MCDDRES  DS    XL4            DATE DATA SET REC/DEL  00YYDDDF
MCDMDEVT DS    0XL4           DEVT OF MIGRAT VOL
         DS    X              RESERVED
         DS    X
MCDFMVRT EQU   X'08'          VOLUME IS A VIRTUAL VOLUME
         DS    X
MCDTPDEV EQU   X'80'          USING TAPE DEVICE
MCDFMVDA EQU   X'20'          USING DASD DEVICE
         DS    X              RESERVED
MCDJDAYS DS    X              USED TO CHANGE DEF # DAYS TO MIG
MCDJDATE DS    XL3            LAST DATE THAT HSM WILL DELAY MIG
MCDJVEXD DS    XL3            LAST DATE HSM WILL HOLD VAL IN MCDJVOLS
MCDPDEP  DS    X              SWITCH
*              X'01'          VOLUMES IN MCDJVOLS FROM GENERAL POOL
*              X'02'          VOLUMES IN MCDJVOLS FROM USER    POOL
MCDJCT   DS    X              NUMBER OF ELIG VOLS FOR DIRECTED RECALL
MCDJVOLS DS    0XL10          FIRST ENTRY
MCDJVSN1 DS    CL6            FIRST    VOL SER
MCDJCT1  DS    XL4            FIRST    DEVT
MCDJVSN2 DS    CL6            SECOND   VOL SER
MCDJCT2  DS    XL4            SECOND   DEVT
MCDJVSN3 DS    CL6            THIRD    VOL SER
MCDJCT3  DS    XL4            THIRD    DEVT
MCDJVSN4 DS    CL6            FOURTH   VOL SER
MCDJCT4  DS    XL4            FOURTH   DEVT
MCDJVSN5 DS    CL6            FIFTH    VOL SER
MCDJCT5  DS    XL4            FIFTH    DEVT
MCDRECAK DS    X              FLAGS
MCDFDBA  EQU   B'10000000'    DATA SET MUST BE RECALLED IF 0
MCDFRBU  EQU   B'01000000'    1 = FROM VOL WITH DEL IF BKU FLAG SET
*                             0 = FROM VOL WITH DEL BY AGE FLAG SET
*                             SWITCH VALID ONLY IF MCDFDBA = 1
MCDFBDCS EQU   B'00100000'    MIG FROM VOL WITH BKP DEV CAT SPEC
MCDFBDCT EQU   B'00010000'    1 = FR VOL WITH BKP DEV CAT = TAPE
*                             0 = FR VOL WITH BKP DEV CAT = DASD
*                             SWITCH VALID ONLY IF MCDFDCS = 1
MCDFAM   EQU   B'00001000'    RECALL TO VOL AUTO SPC MGMT THIS CPU
MCDFAB   EQU   B'00000100'    RECALL TO VOL AUTO BACKUP   THIS CPU
*        EQU   B'00000010'    RESERVED
*        EQU   B'00000001'    RESERVED
MCDEXPDT DS    XL4            EXPDT FROM USER VOL
MCDMCANM DS    CL44           KEY OF MCA REC
         ORG   ,              TO THE END
