//DM370WUM JOB  (OPP,N,40),DISK-MANAGEMENT, DELETES FOR HSM-MCDS
//         USER=PRODJCL,PASSWORD=PRODJCL,
//           MSGCLASS=J,CLASS=C
//S1      EXEC  DM370P10
//
