//TTS000PR JOB (TST,T,04,220,TTSM0000,OS),RUSSELL,
// CLASS=J,MSGCLASS=A
//*
//*  REF:  U220PJR.PDS.CNTL(PDSLIST)
//*
//*  DOC:  LIST PDS.CNTL
//*
//S1 EXEC PDSPDS,OUT='*',DSN='U220PJR.SHAREDM.DATA'
//SYSIN DD *
-OPT EJECT=Y
-LIST ALL.ALL
/*
