//DM370P10 PROC
//S1UP190 EXEC PGM=DM190PUP
//SYSPRINT DD SYSOUT=J
//SYSUDUMP DD SYSOUT=H
//SYSIN    DD DSN=PBDS.DM350WUM.AREC.DEL,DISP=SHR
//         DD DSN=PBDS.DM350WUM.DREC.DEL,DISP=SHR
//         DD DSN=PBDS.DM360WUM.LVL2.DEL,DISP=SHR
//*
