//DM380P10 PROC
//S1RP170 EXEC PGM=DM170PRP,REGION=2048K
//MASTER   DD  DSN=PBDS.DM360WUM.TST.MST,DISP=SHR
//AAMIN    DD  DSN=U220PJR.SHAREDM.DATA(CTLMEAAM),DISP=SHR
//GRPIN    DD  DSN=U220PJE.SHAREDM.DATA(CTLMEGRP),DISP=SHR
//HISTORY  DD  DSN=PBDS.DM380MUM.HST.FIL,DISP=OLD
//BILLOUT  DD  DSN=PBDS.DM380MUM.BIL.FIL,DISP=OLD
//WORKHIST DD  UNIT=SYSDA,SPACE=(CYL,(1,1)),
//             DCB=PBDS.DM380MUM.HST.FIL
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,5)
//RPTDET   DD  SYSOUT=M
//RPTBILL  DD  SYSOUT=M,COPIES=2
//RPTSUM   DD  SYSOUT=M,COPIES=2
//SYSOUT   DD  SYSOUT=J
//SYSUDUMP DD  SYSOUT=H
//CTRLCTRL DD  DSN=U220PJR.SHAREDM.DATA(CTLDM380),DISP=SHR
//*
