//DM300P10 PROC GEN='0'
//S1RS999 EXEC PGM=DM999DSU
//SYSPRINT DD  SYSOUT=J
//SYSIN    DD  UNIT=SYSDA,SPACE=(TRK,(1,1)),DCB=BLKSIZE=800
//TAPE1    DD  DSN=PBTP.DM390WTM.FIL.BKP(&GEN),DISP=OLD
//RST0001  DD  DISP=SHR,DSN=PBDS.DM310WDM.VTC.FIL
//RST0002  DD  DISP=SHR,DSN=PBDS.DM310WDM.VTC.SRT
//RST0003  DD  DISP=SHR,DSN=PBDS.DM315WDM.VVDS.FIL
//RST0004  DD  DISP=SHR,DSN=PBDS.DM315WDM.VVDS.SRT
//RST0005  DD  DISP=SHR,DSN=PBDS.DM320WUM.TST.FIL
//RST0006  DD  DISP=SHR,DSN=PBDS.DM330WDM.HSM.FIL
//RST0007  DD  DISP=SHR,DSN=PBDS.DM330WDM.HSM.SRT
//RST0008  DD  DISP=SHR,DSN=PBDS.DM340WDM.AREC.FIL
//RST0009  DD  DISP=SHR,DSN=PBDS.DM340WDM.DREC.FIL
//RST0010  DD  DISP=SHR,DSN=PBDS.DM350WUM.AREC.DEL
//RST0011  DD  DISP=SHR,DSN=PBDS.DM350WUM.AREC.MRG
//RST0012  DD  DISP=SHR,DSN=PBDS.DM350WUM.AREC.SRT
//RST0013  DD  DISP=SHR,DSN=PBDS.DM350WUM.DREC.DEL
//RST0014  DD  DISP=SHR,DSN=PBDS.DM350WUM.MCDS.FIL
//RST0015  DD  DISP=SHR,DSN=PBDS.DM360WUM.LVL2.DEL
//RST0016  DD  DISP=SHR,DSN=PBDS.DM360WUM.TST.MST
//RST0017  DD  DISP=SHR,DSN=PBDS.DM380MUM.BIL.FIL
//RST0018  DD  DISP=SHR,DSN=PBDS.DM380MUM.HST.FIL
//*
