*---------------------------------------------------------------------
*-- RSA KEY - 1024 BITS
*------------------------------------------------------------
KEYVSL   DC    F'267'
KEYVSEST DS    0CL267
         DC    X'0400'
         DC    X'0080'
         DC    X'0003'
         DC    X'0080'
         DC    X'E0684CCB19A0F768516438C4A5706428'
         DC    X'CC7F6D84DD640FB670874289F958CE7B'
         DC    X'6FA6F129FC6B783523BA08E47D7364DF'
         DC    X'79697B782C782EB71451A0CAA8102B6D'
         DC    X'FE9E88B7B7283FA2A97A3FFAC8AE4520'
         DC    X'D4A9787F190CAC5827C6BCC3C9B373D6'
         DC    X'647EE1B5354020575ADC69FB9B52507B'
         DC    X'98AE2E994D28B119A71A17CBEB64E41D'
         DC    X'010001'
         DC    X'4838C91E446D4DB2C11F243605989A63'
         DC    X'970D1BCE3B024D1C463301F32DD0AB03'
         DC    X'86F78F7E17C2EEB90B7A800A2965CDFD'
         DC    X'2E32088EB0A12D47B6BE5EA55A5979E0'
         DC    X'1E1B7EDA0923E873E13720BCEF992F5F'
         DC    X'1D066576584F9B1BA535181313A183D0'
         DC    X'A84E6CC33E5FBC24BB30656F48F7F51E'
         DC    X'AAEBEF987F6FAD157E57B04A65944271'
*------------------------------------------------------------
