)BODY EXPAND(//)
%TUTORIAL-/-/- Online Tasks-List -/-/-TUTORIAL
%COMMAND ===>_ZCMD                                                             +
%+
%Updating your tasks list+

%Adding a new task+
 To add a new task to your tasks list, enter the%INPUT+command in the command
 area at the top of the screen. This will take you to a panel where you may
 enter information about the new task. Press%ENTER+to return to the tasks list
 and add the task to the list. Use the%END+command if you change your mind and
 don't want to add the task.

%Updating a task+
 You can update any of the fields for a task (e.g. task description, status,
 target date, etc.)  by entering%U+in the "action" area (at the left margin) for
 the task. This will take you to a panel showing the current field values.
 Overtype any that you want to change, then hit%ENTER+to return to the tasks
 list with the task's information updated. Use the%END+command if you change
 your mind and don't want to update the task.

+Enter%&EPF+to exit tutorial and return to tasks list
+Hit%ENTER+to continue on next tutorial panel
)INIT
  &EPF = PFK(END)
  IF (&EPF = &Z)
    &EPF = 'END'
  &D = TRUNC(&EPF,2)
  &DT = .TRAIL
  &D = TRUNC(&DT,1)
  IF (&D = '0')
    &DT = .TRAIL
    &EPF = 'PF&DT'
)PROC
  /******************************************************************/
  /* Panelid: TASKTUPD                                              */
  /* Author:  Joe Veilleux, MIS Tech Support                        */
  /* History: 27Feb85-JJV-1.00-Original experimental release        */
  /* Purpose: Online Tasks-List tutorial: Updating the tasks list   */
  /******************************************************************/
  &ZCONT = TASKTUP2
)END
