//SYS326  JOB (90,0031),'MVS-PERFORMANCE',
// CLASS=B,
// MSGCLASS=8,
// TIME=9,
// COND=(0,LT),  ===> FAILSAFE?
//*RESTART=TRYIT,
// MSGLEVEL=(1,1),NOTIFY=SYS326
/*JOBPARM S=ANY,R=432
//* TITLE MAKE SHARE TAPE
//*--DUMP MEMBERS TO TAPE ------------------------------------------*
//UNLOAD EXEC PGM=TSPDSUNL
//STEPLIB  DD DSN=ISTA.SH.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//I1       DD DSN=SYS326.X.ASM,DISP=SHR
//O1 DD  DSN=SYS326.T.PDSUNL,DISP=(,CATLG,DELETE),
// LABEL=(,NL),UNIT=TAPE,VOL=(,RETAIN,SER=IBMDTR), $
//*UNIT=DISK,VOL=SER=ISTSO1,SPACE=(TRK,(30,30)),
// DCB=(LRECL=80,BLKSIZE=6160,RECFM=FB)
 O I=I1,O=O1,T=IEBUPDTE
//UNUSED   DD  DATA,DLM=$$ JCL TO RESTORE/SAMPLE ASMS
//*--RELOAD JCL--------------------------------------------------------
//RELOADPD EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD  SYSOUT=*
//SYSIN   DD   DSN=SYS326.T.PDSUNL,DISP=(OLD,DELETE),
//           UNIT=TAPE,VOL=SER=IBMDTR,LABEL=(1,NL),  $
//           DCB=*.UNLOAD.O1
//SYSUT2  DD   DSN=&&PDS,DISP=(,PASS),
//           UNIT=WORK,SPACE=(CYL,(1,1,15)),
//           DCB=(LRECL=80,RECFM=FB,BLKSIZE=6160)
//*--ASSEMBLY OF A PROGRAM----------------------------------------
//ASMXX   PROC MEM=,DSNI='&&PDS',MAC1='SYS1.MACLIB'
//*SMXX   PROC MEM=,DSNI='SYS326.X.ASM',MAC1='SYS1.MACLIB' $TEST
//ASM     EXEC PGM=IEV90,PARM='NOLOAD,DECK,XREF(SHORT),BATCH'
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DSN=&DSNI(&MEM),DISP=(SHR,PASS)
//SYSUT1   DD  UNIT=WVIO,SPACE=(1024,(250,250))
//SYSUT2   DD  UNIT=WVIO,SPACE=(1024,(250,250))
//SYSUT3   DD  UNIT=WVIO,SPACE=(1024,(250,250))
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR,DCB=BLKSIZE=19040
//         DD  DSN=SYSX.AMODGEN,DISP=SHR
//         DD  DSN=*.SYSIN,DISP=(SHR,PASS),VOL=REF=*.SYSIN
//         DD  DSN=&MAC1,DISP=SHR
//SYSPUNCH DD  DSN=&OBJ,DISP=(,PASS),
//           UNIT=WVIO,SPACE=(CYL,(1,1)),
//           DCB=(LRECL=80,RECFM=FB,BLKSIZE=2960)
//*--
//LKED    EXEC PGM=IEWL,PARM=(NCAL)
//SYSPRINT DD  SYSOUT=*
//SYSLMOD  DD  DSN=&X(&MEM),UNIT=WVIO,SPACE=(TRK,(2,2,1)) $$FIX
//SYSLIN   DD  DSN=&OBJ,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSIN    DD  DUMMY
//   PEND
//TS0      EXEC ASMXX,MEM=TSCALL
//TS1      EXEC ASMXX,MEM=TSCVDAT
//LKED.SYSIN DD *
 ALIAS TSCVDATE
//TS2      EXEC ASMXX,MEM=TSENQSP3
//LKED.SYSIN DD *
 ALIAS $DENQ
//TS3      EXEC ASMXX,MEM=TSDYNLXA
//TS4      EXEC ASMXX,MEM=TSGTFMAP
//TS5      EXEC ASMXX,MEM=TSSPACE
//LKED.SYSIN DD *
 ALIAS SPACE
//TS6      EXEC ASMXX,MEM=TSSYSTEM
//TS7      EXEC ASMXX,MEM=VTOC,
// MAC1='SYS326.SPF.MACLIB' - VTOC FREE/ALLOC MACROS
//LKED.SYSIN DD *
 ALIAS VTOCEXCP
$$
