MVS JCLLIB, SET, and INCLUDE


EXAMPLES

//PRODJOB  JOB (Accounting info),'programmer name',MSGCLASS=M,CLASS=P
//S50BTCHP EXEC PROC=S50BTCHP,
//              HLQ=PROD,          
//              PROJ=PRODPJ,          
//              LPRE=SAP.PROD.LOAD,    
//              RPRE=SAP.LOAD,    
//              RUN=PRODPLAN,  
//              WORK=WORK,        
//              DISK=PDISK,        
//              CASS=CASS        


Test symbolics

//********************************************************************* 
//* INCLUDE MEMBER - SAPTEST - TEST SYMBOLIC VALUES                       
//********************************************************************* 
//HLQ    SET HLQ=TEST              HIGH LEVEL QUALIFIER             
//PROJ   SET PROJ=TESTPJ           PROJECT CODE                     
//LPRE   SET LPRE=SAP.TEST.LOAD    SAP IN-HOUSE LOAD LIBRARY  (CONCAT 1) 
//RPRE   SET RPRE=SAP.LOAD         SAP-SUPPLIED LOAD LIB (CONCAT 2) 
//RUN    SET RUN=TESTPLAN          DB2 RUNTIME PARAMETERS           
//WORK   SET WORK=WORK             WORK UNIT GENERIC                
//DISK   SET DISK=TDISK            DISK UNIT GENERIC       
//CASS   SET CASS=CASS             CASSETTE UNIT GENERIC           


Quality assurance symbolics

//********************************************************************* 
//* INCLUDE MEMBER - SAPQUAL - QUALITY ASSURANCE SYMBOLIC VALUES                       
//********************************************************************* 
//HLQ    SET HLQ=QUAL              HIGH LEVEL QUALIFIER             
//PROJ   SET PROJ=QUALPJ           PROJECT CODE                     
//LPRE   SET LPRE=SAP.QUAL.LOAD    SAP IN-HOUSE LOAD LIBRARY  (CONCAT 1) 
//RPRE   SET RPRE=SAP.LOAD         SAP SUPPLIED LOAD LIB (CONCAT 2) 
//RUN    SET RUN=QUALPLAN          DB2 RUNTIME PARAMETERS           
//WORK   SET WORK=WORK             WORK UNIT GENERIC                
//DISK   SET DISK=QDISK            DISK UNIT GENERIC       
//CASS   SET CASS=CASS             CASSETTE UNIT GENERIC            


Production symbolics

//********************************************************************* 
//* INCLUDE MEMBER - SAPPROD - PRODUCTION SYMBOLIC VALUES                       
//********************************************************************* 
//HLQ    SET HLQ=PROD              HIGH LEVEL QUALIFIER             
//PROJ   SET PROJ=PRODPJ           PROJECT CODE                     
//LPRE   SET LPRE=SAP.PROD.LOAD    SAP IN-HOUSE LOAD LIBRARY  (CONCAT 1) 
//RPRE   SET RPRE=SAP.LOAD         SAP SUPPLIED LOAD LIB (CONCAT 2) 
//RUN    SET RUN=PRODPLAN          DB2 RUNTIME PARAMETERS           
//WORK   SET WORK=WORK             WORK UNIT GENERIC                
//DISK   SET DISK=PDISK            DISK UNIT GENERIC       
//CASS   SET CASS=CASS             CASSETTE UNIT GENERIC            


the JCL would look like this:

//PRODJOB  JOB (Accounting info),'programmer name',MSGCLASS=M,CLASS=T
//INCLUDE  INCLUDE MEMBER=SAPPROD
//S50BTCHP EXEC PROC=S50BTCHP
//APLZ     DD  DSN=PROD.APLZ,DISP=SHR                                       
//TRAC     DD  DSN=PROD.TRAC,DISP=SHR                                       
//PRIVATE  DD  DSN=PRIVATE.DSN,DISP=OLD                                       
//SAPV01O  DD  DSN=&&SAPV01,DISP=(NEW,PASS),UNIT=WORK,SPACE=(CYL,(10,5))       //SAPV01I  DD  DSN=&&SAPV01,DISP=(OLD,PASS),VOL=REF=*.SAPV01O                      
//SAPV02O  DD  DSN=&&SAPV02,DISP=(NEW,PASS),UNIT=WORK,SPACE=(CYL,(10,5))
//SAPV02I  DD  DSN=&&SAPV02,DISP=(OLD,PASS),VOL=REF=*.SAPV02O             
//ABAT1SO  DD  DSN=&&ABAT1S,DISP=(NEW,PASS),UNIT=WORK,SPACE=(CYL,(10,5))
//SORTIN   DD  DSN=&&ABAT1S,DISP=(OLD,PASS),VOL=REF=*.ABAT1SO
//SORTOUT  DD  DSN=&&ABAT1S,DISP=(OLD,PASS),VOL=REF=*.ABAT1SO,
//             DCB=(*.SORTIN)                                 
//ABAT1SI  DD  DSN=&&ABAT1S,DISP=(OLD,PASS),VOL=REF=*.ABAT1SO               
//ABAT2SO  DD  DSN=&&ABAT2S,DISP=(NEW,PASS),UNIT=WORK,SPACE=(CYL,(10,5))
//ABAT2SI  DD  DSN=&&ABAT2S,DISP=(OLD,PASS),VOL=REF=*.ABAT2SO            
//SYSOUT   DD  SYSOUT=*                                       
//SORTWK01 DD  UNIT=WORK,SPACE=(CYL,(10,5))                             
//SORTWK02 DD  UNIT=WORK,SPACE=(CYL,(10,5))                             
//LIST1SO  DD  SYSOUT=*                                      
//SYSIN    DD  *                                              


The started task JCL would look like this:
//IDMS     PROC                                                              
//**********************************************************************     
//* OVERRIDE VARIABLES FOLLOW                                                
//**********************************************************************     
//         SET VER=CV1                      VERSION NUMBER            
//**********************************************************************
//* IDMSCVV  - RUN CENTRAL VERSION                                      
//**********************************************************************
//IDMSCVV  EXEC PGM=IDMSCVV                                             
//**********************************************************************
//* STANDARD LIBRARIES / FILES FOLLOW                                   
//**********************************************************************
//         INCLUDE MEMBER=CVSTPLIB          STEPLIB LIBRARIES   
//         INCLUDE MEMBER=CVCDMLIB          CDMS LIBRARIES       
//         INCLUDE MEMBER=CVJNFILE          JOURNAL FILES     
//         INCLUDE MEMBER=CVDTPRIM          PRIMARY DICTIONARY FILES     
//         INCLUDE MEMBER=CVDTSECN          SECONDARY DICTIONARY FILES
//**********************************************************************        
//* DATABASE FILES FOLLOW                                            
//**********************************************************************        
//         INCLUDE MEMBER=CVDB1             DATABASE 1                  
//         INCLUDE MEMBER=CVDB2             DATABASE 2         
//         INCLUDE MEMBER=CVDB3             DATABASE 3
//********************************************************************** 
//* ADDITIONAL JCL STEPS FOLLOW                                       
//********************************************************************** 
//         INCLUDE MEMBER=CVSUBJCL          JOURNAL & LOG JOB SUBMISSION      


An include member for a database (eg DB1) would look like this:

//**********************************************************************    
//* CVDB1  - INCLUDE MEMBER - CENTRAL VERSION DATABASE 1                             
//**********************************************************************    
//DB1INDEX   DD  DSN=IDMS.&CV..DB1INDEX,DISP=SHR                                                 
//DB1DTAIL   DD  DSN=IDMS.&CV..DB1DTAIL, DISP=SHR                                                


The JCL to perform CA-IDMS back-up would look something like this:

//CVBACKUP   JOB (Accounting info),'programmer name',MSGCLASS=M,CLASS=P
//IDMSDUMP   EXEC PGM=IDMSDUMP                                            
//STEPLIB    DD  DSN=IDMS.LOAD.LIBRARY,DISP=SHR                             
//********************************************************************* 
//* INCLUDE THE CVDB1 DDNAMES
//********************************************************************* 
//           INCLUDE MEMBER=CVDB1                                         
//           SET CV=CV1
//SYSJRNL    DD  DUMMY                                                    
//SYS001     DD  DSN=IDMS.&CV..DB1.BACKUP.FILE ETC.                            
//SYSLST     DD  SYSOUT=*                                                 
//SYSIPT     DD  DSN=IDMS.&CV..PARMLIB(IDMSDUMP),DISP=SHR                                                 


Andy Nixon
Operations Support Projects Manager (UK)                 c Xephon 1996

