A dynamically reconfigurable ISPF environment

I have found it desirable in several installations to use, and
sometimes to provide for others to use, a form of ISPF menu
panel that can be reconfigurable dynamically, without recourse
to the TEST option.  The method employed to provide such an
environment is technically simple, and is illustrated in the
examples below.


THE DRD@ CLIST

The function of the DRD@ CLIST is to provide the means of
resetting the variables holding descriptions and commands in
the panels themselves.  Thus, in the examples it is invoked by
option 'Z'.

PROC 0 S()
CONTROL ASIS
IF &S = OPTA THEN GOTO LOPTA
IF &S = OPTB THEN GOTO LOPTB
IF &S = INIT THEN GOTO LINIT
EXIT CODE(0)
LOPTA: +
 ISPEXEC DISPLAY PANEL(DRD@CDSC)
 ISPEXEC DISPLAY PANEL(DRD@CCMD)
EXIT CODE(0)
LOPTB: +
 ISPEXEC DISPLAY PANEL(DRD#CDSC)
 ISPEXEC DISPLAY PANEL(DRD#CCMD)
EXIT CODE(0)
LINIT: +
 SET &ADU = &STR(Change definitions)
 SET &AAU = &STR(CMD(%DRD@ S(OPTA)))
 SET &BU = &STR(Z)
 SET &BDU = &STR(Change definitions)
 SET &BAU = &STR(CMD(%DRD@ S(OPTB)))
 ISPEXEC VPUT (ADU,AAU,BU,BDU,BAU) PROFILE
EXIT CODE(0)
L999: +
END


THE DRD@MSTR PANEL

This is invoked by an option in a higher-level panel, or, should
you so wish, it may be made a primary option menu (see
Figure 1) and invoked via the ISPSTART command.  It will be
seen that the )BODY section consists almost entirely of
variables.  These are the description variables set up by use of
the DRD@ CLIST.  Again, the )PROC section consists of
variables.  These are also set up using the DRD@ CLIST, and
it is, of course, here that an OPTION variable is associated
with its ACTION command.  This panel is the one used
normally to select an option, and in use is indistinguishable
from any other selection menu.

)ATTR
  # TYPE(TEXT) COLOR(PINK)
  ! TYPE(TEXT) COLOR(YELLOW)
  $ TYPE(TEXT) COLOR(RED)
)BODY Expand()
+Applid =!&ZAPPLID/&STATUS +-  Master Option Panel -
%Select Option ===>_OPT
%+/---------------------------------------------------------------------------\
%+|!&A1$&X1#&AD1                        +|!&AG$&XG#&ADG                      +|
%+|!&A2$&X2#&AD2                        +|!&AH$&XH#&ADH                      +|
%+|!&A3$&X3#&AD3                        +|!&AI$&XI#&ADI                      +|
%+|!&A4$&X4#&AD4                        +|!&AJ$&XJ#&ADJ                      +|
%+|!&A5$&X5#&AD5                        +|!&AK$&XK#&ADK                      +|
%+|!&A6$&X6#&AD6                        +|!&AL$&XL#&ADL                      +|
%+|!&A7$&X7#&AD7                        +|!&AM$&XM#&ADM                      +|
%+|!&A8$&X8#&AD8                        +|!&AN$&XN#&ADN                      +|
%+|!&A9$&X9#&AD9                        +|!&AO$&XO#&ADO                      +|
%+|!&AA$&XA#&ADA                        +|!&AP$&XP#&ADP                      +|
%+|!&AB$&XB#&ADB                        +|!&AQ$&XQ#&ADQ                      +|
%+|!&AC$&XC#&ADC                        +|!&AR$&XR#&ADR                      +|
%+|!&AD$&XD#&ADD                        +|!&AS$&XS#&ADS                      +|
%+|!&AE$&XE#&ADE                        +|!&AT$&XT#&ADT                      +|
%+|!&AF$&XF#&ADF                        +|!&AU$&XU#&ADU                      +|
%+\---------------------------------------------------------------------------/
+Depress%END+key to terminate.+                              +Lastcmd%&LASTCMD
+Userid  %&ZUSER    +Date     %&D&M&Y    +Time     %&ZTIME    +Keys   %&ZKEYS
+Prefix  %&ZPREFIX  +Jdate    %&ZJDATE   +System   %&SYSTEM   +Envir  %&ZENVIR
+IPL time%&IPLT     +IPL dat  %&IPLD     +Prodname %&PRODN    +Prodi  %&PRODI
)INIT
   &ZPRIM = YES
)PROC
  &LASTCMD = &OPT
  VPUT (LASTCMD)
  &SEL = TRANS( TRUNC (&OPT,'.')
            '&A1','&AA1'
            '&A2','&AA2'
            '&A3','&AA3'
            '&A4','&AA4'
            '&A5','&AA5'
            '&A6','&AA6'
            '&A7','&AA7'
            '&A8','&AA8'
            '&A9','&AA9'
            '&AA','&AAA'
            '&AB','&AAB'
            '&AC','&AAC'
            '&AD','&AAD'
            '&AE','&AAE'
            '&AF','&AAF'
            '&AG','&AAG'
            '&AH','&AAH'
            '&AI','&AAI'
            '&AJ','&AAJ'
            '&AK','&AAK'
            '&AL','&AAL'
            '&AM','&AAM'
            '&AN','&AAN'
            '&AO','&AAO'
            '&AP','&AAP'
            '&AQ','&AAQ'
            '&AR','&AAR'
            '&AS','&AAS'
            '&AT','&AAT'
            '&AU','&AAU'
            '&AV','&AAV'
            '&AW','&AAW'
            '&AX','&AAX'
            '&AY','&AAY'
            '&AZ','&AAZ'
            '&X1','&AA1'
            '&X2','&AA2'
            '&X3','&AA3'
            '&X4','&AA4'
            '&X5','&AA5'
            '&X6','&AA6'
            '&X7','&AA7'
            '&X8','&AA8'
            '&X9','&AA9'
            '&XA','&AAA'
            '&XB','&AAB'
            '&XC','&AAC'
            '&XD','&AAD'
            '&XE','&AAE'
            '&XF','&AAF'
            '&XG','&AAG'
            '&XH','&AAH'
            '&XI','&AAI'
            '&XJ','&AAJ'
            '&XK','&AAK'
            '&XL','&AAL'
            '&XM','&AAM'
            '&XN','&AAN'
            '&XO','&AAO'
            '&XP','&AAP'
            '&XQ','&AAQ'
            '&XR','&AAR'
            '&XS','&AAS'
            '&XT','&AAT'
            '&XU','&AAU'
            '&XV','&AAV'
            '&XW','&AAW'
            '&XX','&AAX'
            '&XY','&AAY'
            '&XZ','&AAZ'
                X,'EXIT'
              ' ',' '    )
)END


THE DRD@CDSC PANEL

This is the first panel displayed by the DRD@ command, and
serves to accept as input, descriptions and option identifiers
that will be displayed by the DRD@MSTR panel in normal
use.  This panel allows those descriptions to be entered in the
same positions that they will occupy on the DRD@MSTR
panel.  The option identifiers and descriptors are, obviously,
saved in the PROFILE variable pool so that they are
maintained across log-off/log-on sequences.  Figure 2
illustrates how the panel would appear to a user.

)ATTR
  # TYPE(INPUT) CAPS(OFF) JUST(LEFT) PAD(NULLS) COLOR(YELLOW) HILITE(REVERSE)
  ! TYPE(INPUT) CAPS(ON) JUST(LEFT) PAD(NULLS) COLOR(TURQ) HILITE(REVERSE)
  _ TYPE(INPUT) CAPS(ON) JUST(LEFT) PAD(NULLS) COLOR(RED) HILITE(REVERSE)
)BODY
+------------------------- Master Option Panel (Change Descriptors) -----------+
%Select Option ===>_OPT
%+/---------------------------------------------------------------------------\
%+|_Al!X1#AD1                           +|_AG!XG#ADG                         +|
%+|_A2!X2#AD2                           +|_AH!XH#ADH                         +|
%+|_A3!X3#AD3                           +|_AI!XI#ADI                         +|
%+|_A4!X4#AD4                           +|_AJ!XJ#ADJ                         +|
%+|_A5!X5#AD5                           +|_AK!XK#ADK                         +|
%+|_A6!X6#AD6                           +|_AL!XL#ADL                         +|
%+|_A7!X7#AD7                           +|_AM!XM#ADM                         +|
%+|_A8!X8#AD8                           +|_AN!XN#ADN                         +|
%+|_A9!X9#AD9                           +|_AO!XO#ADO                         +|
%+|_AA!XA#ADA                           +|_AP!XP#ADP                         +|
%+|_AB!XB#ADB                           +|_AQ!XQ#ADQ                         +|
%+|_AC!XC#ADC                           +|_AR!XR#ADR                         +|
%+|_AD!XD#ADD                           +|_AS!XS#ADS                         +|
%+|_AE!XE#ADE                           +|_AT!XT#ADT                         +|
%+|_AF!XF#ADF                           +|_AU!XU#ADU                         +|
%+\---------------------------------------------------------------------------/
+Depress%END+key to terminate+
+Userid  %&ZUSER    +Date      %&D&M&Y    +Time     %&ZTIME    +Keys  %&ZKEYS
+Prefix  %&ZPREFIX  +Jdate     %&ZJDATE   +System   %&SYSTEM   +Envir %&ZENVIR
)PROC
  VPUT (A1,A2,A3,A4,A5,A6,A7,A8,A9) PROFILE
  VPUT (AA,AB,AC,AD,AE,AF,AG,AH,AI) PROFILE
  VPUT (AJ,AK,AL,AM,AN,AO,AP,AQ,AR) PROFILE
  VPUT (AS,AT,AU,AV,AW,AX,AY,AZ) PROFILE
  VPUT (X1,X2,X3,X4,X5,X6,X7,X8,X9) PROFILE
  VPUT (XA,XB,XC,XD,XE,XF,XG,XH,XI) PROFILE
  VPUT (XJ,XK,XL,XM,XN,XO,XP,XQ,XR) PROFILE
  VPUT (XS,XT,XU,XV,XW,XX,XY,XZ) PROFILE
  VPUT (AD1,AD2,AD3,AD4,AD5,AD6,AD7,AD8,AD9) PROFILE
  VPUT (ADA,ADB,ADC,ADD,ADE,ADF,ADG,ADH,ADI) PROFILE
  VPUT (ADJ,ADK,ADL,ADM,ADN,ADO,ADP,ADQ,ADR) PROFILE
  VPUT (ADS,ADT,ADV,ADW,ADX,ADY,ADZ) PROFILE
)END


THE DRD@CCMD PANEL

This is similar to the DRD@CDSC panel and has the function
of allowing the user to enter ISPF action commands (eg
CMD(%IST) or PGM(ISRBRO) PARM(ISRBR001) etc) as
they would be specified in the )PROC section of a normal
panel.  The user is expected to enter these commands in the
same position on the panel that their associated descriptions
occupy on the DRD@CDSC and DRD@MSTR panels.  Figure
3 illustrates how the panel would appear to a user.

)ATTR
  # TYPE(INPUT) CAPS(ON) JUST(LEFT) PAD(NULLS) COLOR(TURQ) HILITE(REVERSE)
  ! TYPE(TEXT) COLOR(PINK)
)BODY
+------------------------- Master Option Panel (Change Commands) --------------+
%Select Option ===>_OPT
%+/---------------------------------------------------------------------------\
%+|!&A1#AA1                             +|!&AG#AAG                           +|
%+|!&A2#AA2                             +|!&AH#AAH                           +|
%+|!&A3#AA3                             +|!&AI#AAI                           +|
%+|!&A4#AA4                             +|!&AJ#AAJ                           +|
%+|!&A5#AA5                             +|!&AK#AAK                           +|
%+|!&A6#AA6                             +|!&AL#AAL                           +|
%+|!&A7#AA7                             +|!&AM#AAM                           +|
%+|!&A8#AA8                             +|!&AN#AAN                           +|
%+|!&A9#AA9                             +|!&AO#AAO                           +|
%+|!&AA#AAA                             +|!&AP#AAP                           +|
%+|!&AB#AAB                             +|!&AQ#AAQ                           +|
%+|!&AC#AAC                             +|!&AR#AAR                           +|
%+|!&AD#AAD                             +|!&AS#AAS                           +|
%+|!&AE#AAE                             +|!&AT#AAT                           +|
%+|!&AF#AAF                             +|!&AU  +*** Unchangeable ***        +|
%+\---------------------------------------------------------------------------/
+Depress%END+key to terminate+
+Userid  %&ZUSER    +Date      %&D&M&Y    +Time     %&ZTIME    +Keys  %&ZKEYS
+Prefix  %&ZPREFIX  +Jdate     %&ZJDATE   +System   %&SYSTEM   +Envir %&ZENVIR
)PROC
  VPUT (AA1,AA2,AA3,AA4,AA5,AA6,AA7,AA8,AA9) PROFILE
  VPUT (AAA,AAB,AAC,AAD,AAE,AAF,AAG,AAH,AAI) PROFILE
  VPUT (AAJ,AAK,AAL,AAM,AAN,AAO,AAP,AAQ,AAR) PROFILE
  VPUT (AAS,AAT,AAV,AAW,AAX,AAY,AAZ) PROFILE
)END


CONCLUSION

I have used this technique in several installations and have
found it to be very useful for myself.  In those installations
where use of this has been extended to other TSO users, I have
found it to be positively welcomed.

It is possible, should an installation desire it, to cause the
DRD@ CLIST to pre-process the DRD@MSTR panel.

The use of the DRD@ CLIST could, if so desired, be restricted
only to certain user-ids to provide a neat means of allowing,
say, a group leader to define the options available to his group,
without members of the group having the means easily to alter
those options.  Security in this area could be further improved
by altering the DRD@ CLIST, perhaps to invoke a process
whereby descriptors and definitions are held in a central ISPF
table rather than in each user's profile dataset.


David R J Dewar
Consultant Systems Programmer (UK)                         c Xephon 1990

