PROC 0 JOB()
CONTROL NOPROMPT
/*   COLLECT JOB STATUS MESSAGES FULLSCREEN DISPLAY BY RFE.   */
/*   LINE LIMIT OF 300 IS ARBITRARY - INCREASE IF REQUIRED.   */
SET SYSOUTTRAP = 300
ST &JOB
SET SYSOUTTRAP = 0
SET JOBLINES = &SYSOUTLINE
SET N = 0
LOOP: SET N = &N + 1
IF &N > &JOBLINES THEN END
SET STATMSG = &&SYSOUTLINE&N
REVOUTST &STR(&STATMSG)
GOTO LOOP
