PROC 3 SUBCMD PROGRAM DSNAME
CONTROL NOPROMPT
/*   COLLECT PDS SUBCOMMAND OUTPUT FOR FULLSCREEN DISPLAY   */
/*   BY RFE.  THE LINE COUNT LIMIT OF 2000 IS ARBITRARY -   */
/*   LARGE ENOUGH TO MAP IEANUC01 - INCREASE IF REQUIRED.   */
SET SYSOUTTRAP = 2000
PDS '&DSNAME' &STR(&SUBCMD) &STR(&PROGRAM)
SET SYSOUTTRAP = 0
SET PDSLINES = &SYSOUTLINE
SET N = 0
LOOP: SET N = &N + 1
IF &N > &PDSLINES THEN END
SET PDSMSG = &&SYSOUTLINE&N
REVCATCH &STR(&PDSMSG)
GOTO LOOP
