//SDJRGASS JOB (0),'PROCSTEM ASS     ',MSGCLASS=H,
//             MSGLEVEL=(1,1),CLASS=A,NOTIFY=SDJRG
//ASM     EXEC PGM=ASMA90
//SYSLIB   DD  DISP=SHR,DSN=SDJRG.C14.MACRO
//         DD  DISP=SHR,DSN=SYS1.MACLIB
//         DD  DISP=SHR,DSN=SYS1.MODGEN
//SYSIN    DD  DISP=SHR,DSN=SDJRG.ASM(PROCSTEM)
//SYSLIN   DD  DISP=SHR,DSN=SDJRG.OBJLIB(PROCSTEM)
//SYSPRINT DD  DISP=SHR,DSN=SDJRG.LISTING.ASM(PROCSTEM)
