//SBGOLOBU JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//****************************************************
//*                                                  *
//*     ASM LINKEDIT FROM SOURCE ASM                 *
//*                                                  *
//****************************************************
//ASMH EXEC PGM=ASMA90,PARM=(OBJECT,NODECK,NOESD,RLD)
//SYSLIB   DD  DISP=SHR,DSN=SBGOLOB.GATELEY.MACLIB
//         DD  DISP=SHR,DSN=SYS1.MACLIB
//         DD  DISP=SHR,DSN=SYS1.MODGEN
//SYSIN    DD  DISP=SHR,DSN=SBGOLOB.CBT496.FILE953(VOLUMES)
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,20)
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  UNIT=SYSDA,SPACE=(TRK,30),DISP=(,PASS),DCB=BLKSIZE=3200,
//             DSN=&&TEMP
//*
//LKED   EXEC  PGM=IEWL,
//       PARM='CALL,MAP,LIST,XREF,LET,RENT'
//SYSUT1   DD  UNIT=SYSDA,SPACE=(2048,(200,20))
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=(OLD,PASS),DSN=&&TEMP
//SYSLMOD  DD  DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSLIN   DD  *
 INCLUDE SYSLIB
 ORDER   VOLUMES
 SETSSI  CB496953
 ENTRY   VOLUMES
 NAME    VOLUMES(R)
