         TITLE 'IBM 3990-3 SUBSYSTEM STATISTICS RECORD'
***********************************************************************
*        PDSDOC *IBM 3990-3 SUBSYSTEM STATISTICS RECORD...............* SEREC
*                                                                     *
*        FORMAT OF STATISTICS RECORD FOR ONE DEVICE                   *
*                                                                     *
*                                                                     *
***********************************************************************
         SPACE 2
SEREC    DSECT ,              OFF. SUBSYSTEM STATISTICS RECORD
SEFLAG1  DS    XL1             0   FLAG BYTE
SEFALSE  EQU   B'10000000'         WHEN SET CACHE NOT AVAILABLE
SEDEVADD DS    XL1             1   DEVICE UNIT ADDRESS
SESENSE1 DS    0XL2            2   DEVICE STATUS SENSE BYTES GROUP1
SESENSEA DS    XL1             2   DEVICE STATUS BYTE 26
SES1ACX  EQU   B'11000000'         CACHING DEACTIVATED
SES1A8X  EQU   B'10000000'         CACHING DEACTIVATE PENDING
SES1A3X  EQU   B'00110000'         DASD FAST WRITE DEACTIVATED
SES1A2X  EQU   B'00100000'         DASD FAST WRITE DEACTIVATE PENDING
SES1AX8  EQU   B'00001000'         DEVICE IS DUPLEX PRIMARY
SES1AX4  EQU   B'00000100'         DEVICE IS DUPLEX SECONDARY
SESENSEB DS    XL1             3   DEVICE STATUS BYTE 27 - DUPLEX
SES1BCX  EQU   B'11000000'         PINNED DATA - FAST WRITE SUSPENDED
SES1B4X  EQU   B'01000000'         PINNED DATA - FAST WRITE NOT SUSP.
         SPACE 1
SEIORDRQ DS    XL4             4   NO. READ NORMAL I/O REQUESTS
SEIORDHT DS    XL4             8   NO. READ NORMAL HITS
SEIOWTRQ DS    XL4            12   NO. WRITE NORMAL I/O REQUESTS
SEIOFWHT DS    XL4            16   NO. DASD FAST WRITE I/O HITS
SEIORSRQ DS    XL4            20   NO. READ SEQUENTIAL I/O REQUESTS
SEIORSHT DS    XL4            24   NO. READ SEQUENTIAL HITS
SEIOWSRQ DS    XL4            28   NO. WRITE SEQUENTIAL I/O REQUESTS
SEIOWSHT DS    XL4            32   NO. WRITE SEQUENTIAL HITS
SERDCWRQ DS    XL4            36   NO. CACHE WRITE SEARCH OR READ REQ.
SERDCWHT DS    XL4            40   NO. CACHE WRITE SEARCH OR READ HITS
SEIOCWRQ DS    XL4            44   NO. CACHE WRITE I/O REQUESTS
SEIOCWHT DS    XL4            48   NO. CACHE WRITE I/O HITS
SEICLRQ  DS    XL4            52   NO. INHIBIT CACHE LOADING REQUESTS
SEBYCRQ  DS    XL4            56   NO. BYPASS CACHE REQUESTS
SESQDCTR DS    XL4            60   NO. SEQUENTIAL DASD-CACHE TRACK XFER
SEDCTR   DS    XL4            64   NO. DASD-CACHE TRACK XFER
SECDTR   DS    XL4            68   NO. CACHE-DASD TRACK XFER
SEDFFAIL DS    XL4            72   NO. DASD FAST WRITE NVS CONSTRAINED
SEDFNW   DS    XL4            76   NO. DASD FAST WRITE NORMAL WRITE
SEDFSQ   DS    XL4            80   NO. DASD FAST WRITE SEQUENTIAL WRITE
         DS    XL4            84   RESERVED. SET TO ZEROES
SESQSQ   DS    XL4            88   NO. SEQUENTIAL-DETECTED READ SEQ.
SESENSE2 DS    0XL1           92   DEVICE STATUS SENSE BYTES GROUP1
SESENSEC DS    XL1            92   DEVICE STATUS BYTE 36 - NVS
SES2C4X  EQU   B'01000000'         DATA EXISTS IN FAILED NVS
         SPACE 1
         DS    XL1            93   RESERVED. SET TO ZEROES
SESEID   DS    XL2            94   SUBSYSTEM IDENTIFIER (SSID)
         SPACE 2
SELENTH  EQU   *-SEREC             LENGTH OF DEVICE ENTRY
         SPACE 2
