         MACRO
         TSGINNRA  &P
.*
.*       PDSDOC *PREFORMATTING MACRO...............(GUIDE UK M56042AS)* TSGINNRA
.*
         GBLC  &GSS(5)
         LCLA  &A
         AIF   ('&P'(K'&P,1) EQ ')').C1
&GSS(2)  SETC  '+'
&GSS(4)  SETC  ''
&GSS(5)  SETC  ''
.C4      AIF   (&A GE K'&P).C2
&A       SETA  &A+1
         AIF   ('&P'(&A,1) EQ '+').C3
         AGO   .C4
.C2      ANOP
&GSS(1)  SETC  '&P'
&GSS(3)  SETC  '0'
         MEXIT
.C3      ANOP
&GSS(1)  SETC  '&P'(1,&A-1)
&GSS(3)  SETC  '&P'(&A+1,K'&P-&A)
         MEXIT
.C1      ANOP
&GSS(1)  SETC  ''
&GSS(2)  SETC  ''
&GSS(3)  SETC  '0'
.C6      ANOP
&A       SETA  &A+1
         AIF   ('&P'(&A,1) EQ '(').C5
         AGO   .C6
.C5      AIF   (&A EQ 1).C7
&GSS(3)  SETC  '&P'(1,&A-1)
.C7      ANOP
&GSS(4)  SETC  ','
&GSS(5)  SETC  '&P'(&A+1,K'&P-&A-1)
         MEND
