         COPY  PDPTOP
         CSECT
* Program text area
         DS    0F
* Function basic_block_freq,F1 prologue
@@F1     PDPPRLG CINDEX=0,FRAME=88,BASER=12,ENTRY=NO
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function basic_block_freq code
         L     2,0(11)
         L     15,76(2)
* Function basic_block_freq epilogue
         PDPEPIL
* Function basic_block_freq literal pool
         DS    0F
         LTORG
* Function basic_block_freq page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         DS    0F
* Function find_btr_reference,F2 prologue
@@F2     PDPPRLG CINDEX=1,FRAME=88,BASER=12,ENTRY=NO
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function find_btr_reference code
         L     5,0(11)
         L     15,=F'-1'
         CL    5,4(11)
         BE    L2
         L     3,0(5)
         LH    2,0(3)
         SLR   15,15
         CH    2,=H'74'
         BNE   L2
         L     4,4(3)
         L     15,=V(MODE@SIZ)
         L     2,0(3)
         LA    3,15(0,0)
         CR    4,3
         BNH   L5
         SRL   2,8
         N     2,=F'255'
         SLR   3,3
         IC    3,0(15,2)
         LR    15,3
         A     15,=F'7'
         SRA   15,3
         B     L17
L16      EQU   *
         L     2,=A(@@V2)
         ST    5,0(2)
         LA    15,1(0,0)
         B     L2
L5       EQU   *
         SRL   2,8
         N     2,=F'255'
         SLR   3,3
         IC    3,0(15,2)
         LR    15,3
         A     15,=F'3'
         SRA   15,2
L17      EQU   *
         BCTR  15,0
         LTR   15,15
         BL    L15
L13      EQU   *
         LR    3,4
         AR    3,15
         L     2,=A(@@V1)
         L     2,0(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L16
         BCTR  15,0
         LTR   15,15
         BNL   L13
L15      EQU   *
         L     15,=F'-1'
L2       EQU   *
* Function find_btr_reference epilogue
         PDPEPIL
* Function find_btr_reference literal pool
         DS    0F
         LTORG
* Function find_btr_reference page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* Function btr_referenced_p,F3 prologue
@@F3     PDPPRLG CINDEX=2,FRAME=104,BASER=12,ENTRY=NO
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function btr_referenced_p code
         ST    11,88(13)
         MVC   92(4,13),=A(@@F2)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@856)
         BALR  14,15
* Function btr_referenced_p epilogue
         PDPEPIL
* Function btr_referenced_p literal pool
         DS    0F
         LTORG
* Function btr_referenced_p page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
LC0      EQU   *
         DC    C'<stdin>'
         DC    X'0'
LC1      EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* Function insn_sets_btr_p,F4 prologue
@@F4     PDPPRLG CINDEX=3,FRAME=104,BASER=12,ENTRY=NO
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function insn_sets_btr_p code
         L     4,0(11)
         L     5,8(11)
         LH    2,0(4)
         CLM   2,3,=H'45'
         BNE   L20
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L20
         L     3,24(4)
         LH    2,0(3)
         LR    15,3
         CLM   2,3,=H'60'
         BE    L22
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
L22      EQU   *
         LTR   15,15
         BE    L20
         L     3,4(15)
         L     4,8(15)
         LH    2,0(3)
         CLM   2,3,=H'76'
         BNE   L25
         L     3,4(3)
L25      EQU   *
         LH    2,0(3)
         CLM   2,3,=H'74'
         BNE   L20
         L     2,=A(@@V1)
         L     2,0(2)
         L     6,4(3)
         SRL   2,0(6)
         N     2,=F'1'
         LTR   2,2
         BE    L20
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         LTR   15,15
         BE    L27
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'237'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L27      EQU   *
         L     2,4(11)
         LTR   2,2
         BE    L29
         LH    15,0(4)
         LR    2,15
         AH    2,=H'-80'
         CLM   2,3,=H'1'
         BNH   L29
         CLM   15,3,=H'67'
         BE    L29
         CLM   15,3,=H'68'
         BE    L29
         CLM   15,3,=H'71'
         BE    L29
         CLM   15,3,=H'151'
         BE    L29
         CLM   15,3,=H'69'
         BE    L29
         CLM   15,3,=H'157'
         BNE   L20
L29      EQU   *
         LTR   5,5
         BE    L30
         MVC   0(4,5),4(3)
L30      EQU   *
         LA    15,1(0,0)
         B     L19
L20      EQU   *
         SLR   15,15
L19      EQU   *
* Function insn_sets_btr_p epilogue
         PDPEPIL
* Function insn_sets_btr_p literal pool
         DS    0F
         LTORG
* Function insn_sets_btr_p page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
LC2      EQU   *
         DC    C' %d'
         DC    X'0'
         DS    0F
* Function dump_hard_reg_set,F9 prologue
@@F9     PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=NO
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function dump_hard_reg_set code
         L     4,0(11)
         SLR   3,3
L36      EQU   *
         LR    2,4
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L34
         L     2,=V(ZZZ@1844)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(LC2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L34      EQU   *
         A     3,=F'1'
         LA    2,19(0,0)
         CR    3,2
         BNH   L36
* Function dump_hard_reg_set epilogue
         PDPEPIL
* Function dump_hard_reg_set literal pool
         DS    0F
         LTORG
* Function dump_hard_reg_set page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
LC3      EQU   *
         DC    C'BB%d live:'
         DC    X'0'
LC4      EQU   *
         DC    X'15'
         DC    X'0'
         DS    0F
* Function dump_btrs_live,F10 prologue
@@F10    PDPPRLG CINDEX=5,FRAME=104,BASER=12,ENTRY=NO
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function dump_btrs_live code
         L     3,0(11)
         L     4,=V(ZZZ@1844)
         MVC   88(4,13),0(4)
         MVC   92(4,13),=A(LC3)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,=A(@@V3)
         L     2,0(2)
         SLL   3,2
         L     3,0(3,2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         MVC   88(4,13),0(4)
         MVC   92(4,13),=A(LC4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
* Function dump_btrs_live epilogue
         PDPEPIL
* Function dump_btrs_live literal pool
         DS    0F
         LTORG
* Function dump_btrs_live page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
         DS    0F
* Function note_other_use_this_block,F11 prologue
@@F11    PDPPRLG CINDEX=6,FRAME=88,BASER=12,ENTRY=NO
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function note_other_use_this_block code
         L     3,0(11)
         L     15,4(11)
         LTR   15,15
         BE    L47
L45      EQU   *
         L     2,16(15)
         LTR   2,2
         BE    L43
         L     2,4(2)
         CLR   2,3
         BNE   L43
         MVI   28(15),1
L43      EQU   *
         L     15,0(15)
         LTR   15,15
         BNE   L45
L47      EQU   *
* Function note_other_use_this_block epilogue
         PDPEPIL
* Function note_other_use_this_block literal pool
         DS    0F
         LTORG
* Function note_other_use_this_block page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
         DS    0F
* Function note_btr_set,F12 prologue
@@F12    PDPPRLG CINDEX=7,FRAME=104,BASER=12,ENTRY=NO
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function note_btr_set code
         L     3,0(11)
         L     6,8(11)
         LH    2,0(3)
         CH    2,=H'74'
         BNE   L48
         L     5,4(3)
         L     4,=V(MODE@SIZ)
         L     2,0(3)
         LA    3,15(0,0)
         CR    5,3
         BNH   L50
         SRL   2,8
         N     2,=F'255'
         SLR   3,3
         IC    3,0(4,2)
         LR    4,3
         A     4,=F'7'
         SRA   4,3
         B     L60
L50      EQU   *
         SRL   2,8
         N     2,=F'255'
         SLR   3,3
         IC    3,0(4,2)
         LR    4,3
         A     4,=F'3'
         SRA   4,2
L60      EQU   *
         AR    4,5
         CR    5,4
         BNL   L48
L58      EQU   *
         L     2,=A(@@V1)
         L     2,0(2)
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BE    L56
         ST    5,88(13)
         MVC   92(4,13),0(6)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         LA    2,1(0,0)
         SLL   2,0(5)
         L     3,4(6)
         OR    3,2
         ST    3,4(6)
         O     2,8(6)
         ST    2,8(6)
         MVC   88(4,13),12(6)
         MVC   92(4,13),88(13)
         L     2,=A(@@V4)
         LR    3,5
         S     3,0(2)
         LR    2,3
         L     3,16(6)
         SLL   2,2
         L     2,0(2,3)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1865)
         BALR  14,15
L56      EQU   *
         A     5,=F'1'
         CR    5,4
         BL    L58
L48      EQU   *
* Function note_btr_set epilogue
         PDPEPIL
* Function note_btr_set literal pool
         DS    0F
         LTORG
* Function note_btr_set page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
         DS    0F
* Function clear_btr_from_live_range,F19 prologue
@@F19    PDPPRLG CINDEX=8,FRAME=112,BASER=12,ENTRY=NO
         B     FEN8
         LTORG
FEN8     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         LR    11,1
         L     10,=A(PGT8)
* Function clear_btr_from_live_range code
         L     8,0(11)
         L     2,40(8)
         L     5,0(2)
         SLR   7,7
         ST    7,96(13)
         LTR   5,5
         BE    L96
L93      EQU   *
         LR    9,5
         A     9,=F'12'
L92      EQU   *
         L     6,0(9)
         LTR   6,6
         BE    L73
L91      EQU   *
         LA    3,1(0,0)
         L     2,96(13)
         SLL   3,0(2)
         LR    2,6
         NR    2,3
         LTR   2,2
         BE    L76
         X     3,=F'-1'
         NR    6,3
         L     15,8(5)
         SLL   15,2
         AR    15,7
         SLL   15,5
         A     15,96(13)
         L     2,36(8)
         N     2,=F'16776960'
         LTR   2,2
         BE    L79
         IC    2,37(8)
         CLM   2,1,=XL1'00'
         BE    L80
         LR    2,15
         SLL   2,2
         L     3,=V(BASIC@BL)
         A     2,0(3)
         L     2,16(2)
         CL    2,8(8)
         BE    L78
L80      EQU   *
         IC    2,38(8)
         CLM   2,1,=XL1'00'
         BE    L79
         L     4,32(8)
L102     EQU   *
         LTR   4,4
         BE    L79
         LR    2,15
         SLL   2,2
         L     3,=V(BASIC@BL)
         A     2,0(3)
         L     2,16(2)
         CL    2,4(4)
         BE    L78
         L     4,0(4)
         B     L102
L79      EQU   *
         L     2,=A(@@V3)
         L     4,0(2)
         LR    3,15
         SLL   3,2
         ST    3,104(13)
         LA    2,1(0,0)
         L     3,20(8)
         SLL   2,0(3)
         X     2,=F'-1'
         L     3,104(13)
         N     2,0(3,4)
         ST    2,0(3,4)
         L     2,=V(ZZZ@1844)
         L     2,0(2)
         LTR   2,2
         BE    L78
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
L78      EQU   *
         LTR   6,6
         BE    L73
L76      EQU   *
         L     2,96(13)
         A     2,=F'1'
         ST    2,96(13)
         LA    3,31(0,0)
         CLR   2,3
         BNH   L91
L73      EQU   *
         MVC   96(4,13),=F'0'
         A     7,=F'1'
         A     9,=F'4'
         LA    2,3(0,0)
         CLR   7,2
         BNH   L92
         SLR   7,7
         L     5,0(5)
         LTR   5,5
         BNE   L93
L96      EQU   *
* Function clear_btr_from_live_range epilogue
         PDPEPIL
* Function clear_btr_from_live_range literal pool
         DS    0F
         LTORG
* Function clear_btr_from_live_range page table
         DS    0F
PGT8     EQU   *
         DC    A(PG8)
LC5      EQU   *
         DC    C'Adding block %d to live range'
         DC    X'15'
         DC    X'0'
LC6      EQU   *
         DC    C'Now live btrs are '
         DC    X'0'
         DS    0F
* Function augment_live_range,F21 prologue
@@F21    PDPPRLG CINDEX=9,FRAME=104,BASER=12,ENTRY=NO
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function augment_live_range code
         L     9,0(11)
         L     8,4(11)
         L     7,8(11)
         L     3,12(11)
         L     2,=V(N@BASIC@)
         L     2,0(2)
         SLL   2,2
         A     2,=F'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    6,15
         LR    5,15
         MVC   88(4,13),=F'0'
         ST    3,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(DOMINATE)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L104
         ST    3,0(6)
         A     5,=F'4'
         B     L130
L104     EQU   *
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(DOMINATE)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L106
         L     4,44(3)
         ST    9,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     2,=A(@@V3)
         L     3,0(2)
         LR    2,4
         SLL   2,2
         L     15,0(8)
         O     15,0(2,3)
         ST    15,0(8)
         L     3,=V(ZZZ@1844)
         L     2,0(3)
         LTR   2,2
         BE    L107
         ST    2,88(13)
         MVC   92(4,13),=A(LC5)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(8)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(LC4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L107     EQU   *
         L     2,16(7)
L128     EQU   *
         LTR   2,2
         BE    L130
         MVC   0(4,5),8(2)
         A     5,=F'4'
         L     2,0(2)
         B     L128
L106     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'861'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L130     EQU   *
         CLR   5,6
         BE    L126
         A     5,=F'-4'
         L     4,0(5)
         ST    9,88(13)
         MVC   92(4,13),44(4)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   L130
         ST    9,88(13)
         MVC   92(4,13),44(4)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     2,=A(@@V3)
         L     3,0(2)
         L     2,44(4)
         SLL   2,2
         L     7,0(8)
         O     7,0(2,3)
         ST    7,0(8)
         L     3,=V(ZZZ@1844)
         L     2,0(3)
         LTR   2,2
         BE    L116
         ST    2,88(13)
         MVC   92(4,13),=A(LC5)
         MVC   96(4,13),44(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(8)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(LC4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L116     EQU   *
         L     2,16(4)
L129     EQU   *
         LTR   2,2
         BE    L130
         L     3,8(2)
         ST    9,88(13)
         MVC   92(4,13),44(3)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   L119
         ST    3,0(5)
         A     5,=F'4'
L119     EQU   *
         L     2,0(2)
         B     L129
L126     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function augment_live_range epilogue
         PDPEPIL
* Function augment_live_range literal pool
         DS    0F
         LTORG
* Function augment_live_range page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
         DS    0F
* Function choose_btr,F22 prologue
@@F22    PDPPRLG CINDEX=10,FRAME=88,BASER=12,ENTRY=NO
         B     FEN10
         LTORG
FEN10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         LR    11,1
         L     10,=A(PGT10)
* Function choose_btr code
         L     6,0(11)
         L     5,=A(@@V1)
         LR    2,6
         X     2,=F'-1'
         N     2,0(5)
         LTR   2,2
         BE    L133
         SLR   4,4
L138     EQU   *
         LR    3,4
         SLL   3,2
         L     2,=V(ZZZ@1779)
         L     15,0(3,2)
         L     2,0(5)
         SRL   2,0(15)
         N     2,=F'1'
         LTR   2,2
         BE    L136
         LR    2,6
         SRL   2,0(15)
         N     2,=F'1'
         LTR   2,2
         BE    L131
L136     EQU   *
         A     4,=F'1'
         LA    2,19(0,0)
         CR    4,2
         BNH   L138
L133     EQU   *
         L     15,=F'-1'
L131     EQU   *
* Function choose_btr epilogue
         PDPEPIL
* Function choose_btr literal pool
         DS    0F
         LTORG
* Function choose_btr page table
         DS    0F
PGT10    EQU   *
         DC    A(PG10)
         DS    0F
* Function btr_def_live_range,F23 prologue
@@F23    PDPPRLG CINDEX=11,FRAME=120,BASER=12,ENTRY=NO
         B     FEN11
         LTORG
FEN11    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         LR    11,1
         L     10,=A(PGT11)
* Function btr_def_live_range code
         L     7,0(11)
         L     9,4(11)
         L     2,40(7)
         LTR   2,2
         BNE   L141
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         ST    15,40(7)
         ST    15,88(13)
         L     2,8(7)
         MVC   92(4,13),44(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     4,8(7)
         L     2,=A(@@V3)
         L     3,0(2)
         L     2,44(4)
         SLL   2,2
         L     3,0(2,3)
         ST    3,0(9)
         L     2,32(7)
L175     EQU   *
         LTR   2,2
         BE    L146
         MVC   88(4,13),40(7)
         ST    9,92(13)
         MVC   96(4,13),8(7)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=A(@@F21)
         BALR  14,15
         L     2,0(2)
         B     L175
L141     EQU   *
         MVC   0(4,9),=F'0'
         L     4,0(2)
         SLR   5,5
         LR    8,5
L176     EQU   *
         LTR   4,4
         BE    L146
         LR    2,4
         A     2,=F'12'
         ST    2,112(13)
L165     EQU   *
         L     3,112(13)
         L     15,0(3)
         LTR   15,15
         BE    L158
L164     EQU   *
         LA    3,1(0,0)
         SLL   3,0(8)
         LR    2,15
         NR    2,3
         LTR   2,2
         BE    L161
         X     3,=F'-1'
         NR    15,3
         L     2,8(4)
         SLL   2,2
         AR    2,5
         SLL   2,5
         AR    2,8
         L     3,=A(@@V3)
         MVC   104(4,13),0(3)
         SLL   2,2
         L     3,0(9)
         L     6,104(13)
         O     3,0(2,6)
         ST    3,0(9)
         LTR   15,15
         BE    L158
L161     EQU   *
         A     8,=F'1'
         LA    6,31(0,0)
         CLR   8,6
         BNH   L164
L158     EQU   *
         SLR   8,8
         A     5,=F'1'
         L     2,112(13)
         A     2,=F'4'
         ST    2,112(13)
         LA    3,3(0,0)
         CLR   5,3
         BNH   L165
         LR    5,8
         L     4,0(4)
         B     L176
L146     EQU   *
         L     2,36(7)
         N     2,=F'16776960'
         LTR   2,2
         BNE   L140
         LA    2,1(0,0)
         L     7,20(7)
         SLL   2,0(7)
         X     2,=F'-1'
         N     2,0(9)
         ST    2,0(9)
L140     EQU   *
* Function btr_def_live_range epilogue
         PDPEPIL
* Function btr_def_live_range literal pool
         DS    0F
         LTORG
* Function btr_def_live_range page table
         DS    0F
PGT11    EQU   *
         DC    A(PG11)
LC7      EQU   *
         DC    C'Basic block %d: count = %ld loop-depth = %d idom'
         DC    C' = %d'
         DC    X'15'
         DC    X'0'
LC8      EQU   *
         DC    C'Found target reg definition: sets %u { bb %d, in'
         DC    C'sn %d }%s priority %d'
         DC    X'15'
         DC    X'0'
LC9      EQU   *
         DC    X'0'
LC10     EQU   *
         DC    C':not const'
         DC    X'0'
LC11     EQU   *
         DC    C'Uses target reg: { bb %d, insn %d }'
         DC    X'0'
LC12     EQU   *
         DC    C': unambiguous use of reg %d'
         DC    X'15'
         DC    X'0'
LC13     EQU   *
         DC    C'Def in insn %d reaches use in insn %d'
         DC    X'15'
         DC    X'0'
LC14     EQU   *
         DC    C'(use %d has multiple reaching defs)'
         DC    X'15'
         DC    X'0'
LC15     EQU   *
         DC    C'Attempting to migrate pt from insn %d (cost = %d'
         DC    C', min_cost = %d) ... '
         DC    X'0'
LC16     EQU   *
         DC    C'it''s not migratable'
         DC    X'15'
         DC    X'0'
LC17     EQU   *
         DC    C'it''s already combined with another pt'
         DC    X'15'
         DC    X'0'
LC18     EQU   *
         DC    C'trying block %d ...'
         DC    X'0'
LC19     EQU   *
         DC    C'Now btrs live in range are: '
         DC    X'0'
LC20     EQU   *
         DC    C'migrating to basic block %d, using reg %d'
         DC    X'15'
         DC    X'0'
LC21     EQU   *
         DC    C'Combining def in insn %d with def in insn %d'
         DC    X'15'
         DC    X'0'
LC22     EQU   *
         DC    C'New pt is insn %d, inserted after insn %d'
         DC    X'15'
         DC    X'0'
LC23     EQU   *
         DC    C'giving up because there are no free target regis'
         DC    C'ters'
         DC    X'15'
         DC    X'0'
LC24     EQU   *
         DC    C'failed to move'
         DC    X'15'
         DC    X'0'
LC25     EQU   *
         DC    C'Putting insn %d back on queue with priority %d'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func branch_target_load_optimize prologue
BRANCH@T PDPPRLG CINDEX=12,FRAME=320,BASER=12,ENTRY=YES
         B     FEN12
         LTORG
FEN12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         LR    11,1
         L     10,=A(PGT12)
* Function branch_target_load_optimize code
         IC    5,7(11)
         L     4,=V(TARGETM)
         L     2,264(4)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    7,15
         LTR   15,15
         L     14,=A(L177)
         BER   14
         L     2,136(4)
         L     3,=A(@@V5)
         LTR   2,2
         BE    L179
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         ST    15,0(3)
         B     L180
L179     EQU   *
         MVC   0(4,3),=F'1'
L180     EQU   *
         SLR   3,3
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BE    L181
         LA    3,1(0,0)
L181     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@161)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(LIFE@ANA)
         BALR  14,15
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(CALCULAT)
         BALR  14,15
         N     5,=XL4'000000FF'
         ST    5,88(13)
         L     2,268(4)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    8,15
         N     8,=XL4'000000FF'
         LA    1,88(,13)
         L     15,=V(ZZZ@690)
         BALR  14,15
         ST    15,168(13)
         MVC   88(4,13),=A(@@V6)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=V(XMALLOC)
         MVC   104(4,13),=V(FREE)
         LA    1,88(,13)
         L     15,=V(ZZZ@2090)
         BALR  14,15
         L     6,=V(ZZZ@1844)
         L     2,0(6)
         LTR   2,2
         BE    L182
         SLR   4,4
         L     5,=V(N@BASIC@)
L502     EQU   *
         C     4,0(5)
         BNL   L182
         LR    2,4
         SLL   2,2
         L     3,=V(BASIC@BL)
         A     2,0(3)
         L     2,16(2)
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GET@IMME)
         BALR  14,15
         MVC   88(4,13),0(6)
         MVC   92(4,13),=A(LC7)
         ST    4,96(13)
         MVC   100(4,13),72(2)
         MVC   104(4,13),56(2)
         MVC   108(4,13),44(15)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         A     4,=F'1'
         B     L502
L182     EQU   *
         L     6,=A(@@V1)
         MVC   0(4,6),=F'0'
         L     5,=A(@@V4)
         MVC   0(4,5),=F'-1'
         SLR   4,4
L193     EQU   *
         LR    3,7
         SLL   3,2
         L     2,=V(ZZZ@1781)
         L     2,0(3,2)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L189
         LTR   8,8
         BNE   L191
         L     2,=V(ZZZ@108)
         IC    2,0(2,4)
         CLM   2,1,=XL1'00'
         BNE   L191
         L     2,=V(REGS@EVE)
         IC    2,0(2,4)
         SLL   2,24
         SRA   2,24
         C     2,=F'0'
         BE    L189
L191     EQU   *
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,0(6)
         ST    2,0(6)
         L     2,=A(@@V7)
         ST    4,0(2)
         L     2,0(5)
         LTR   2,2
         BNL   L189
         ST    4,0(5)
L189     EQU   *
         A     4,=F'1'
         LA    2,19(0,0)
         CR    4,2
         BNH   L193
         L     3,=V(N@BASIC@)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     4,=A(@@V3)
         ST    15,0(4)
         LA    1,88(,13)
         L     15,=V(GET@MAX@)
         BALR  14,15
         ST    15,172(13)
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,176(13)
         MVC   88(4,13),172(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,180(13)
         L     4,=A(@@V7)
         L     3,=A(@@V4)
         L     2,0(4)
         S     2,0(3)
         A     2,=F'1'
         ST    2,88(13)
         MVC   92(4,13),172(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1878)
         BALR  14,15
         ST    15,184(13)
         L     5,=V(N@BASIC@)
         MVC   88(4,13),0(5)
         MVC   92(4,13),172(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1878)
         BALR  14,15
         ST    15,188(13)
         MVC   88(4,13),0(5)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,192(13)
         MVC   88(4,13),184(13)
         L     2,0(4)
         S     2,0(3)
         A     2,=F'1'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1880)
         BALR  14,15
         MVC   204(4,13),=F'0'
         MVC   148(4,13),204(13)
         MVC   88(4,13),188(13)
         MVC   92(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1880)
         BALR  14,15
         MVC   200(4,13),204(13)
         L     6,200(13)
         C     6,0(5)
         L     14,=A(L445)
         BNLR  14
         ST    6,296(13)
         MVC   300(4,13),188(13)
L267     EQU   *
         L     12,0(,10)
         L     2,=V(BASIC@BL)
         L     2,0(2)
         A     2,296(13)
         MVC   208(4,13),16(2)
         MVC   212(4,13),=F'0'
         MVC   120(4,13),212(13)
         L     7,300(13)
         MVC   132(4,13),0(7)
         MVC   136(4,13),184(13)
         MVC   128(4,13),212(13)
         MVC   124(4,13),212(13)
         L     2,=A(@@V4)
         L     3,0(2)
         L     4,=A(@@V7)
L503     EQU   *
         C     3,0(4)
         BH    L447
         L     2,=A(@@V1)
         L     2,0(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L199
         L     8,208(13)
         MVC   88(4,13),32(8)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BE    L199
         LA    2,1(0,0)
         SLL   2,0(3)
         O     2,128(13)
         ST    2,128(13)
L199     EQU   *
         A     3,=F'1'
         B     L503
L447     EQU   *
         L     15,208(13)
         L     7,0(15)
         L     2,4(15)
         MVC   216(4,13),12(2)
L504     EQU   *
         L     12,0(,10)
         CL    7,216(13)
         L     14,=A(L449)
         BER   14
         LH    2,0(7)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(L204)
         BNER  14
         L     9,4(7)
         ST    7,88(13)
         MVC   92(4,13),=F'0'
         LR    4,13
         A     4,=F'144'
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(L206)
         BER   14
         MVC   220(4,13),144(13)
         L     8,128(13)
         L     5,220(13)
         SRL   8,0(5)
         N     8,=F'1'
         L     6,=A(@@V6)
         L     2,16(6)
         S     2,12(6)
         LA    15,44(0,0)
         CR    2,15
         BNL   L207
         ST    6,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2094)
         BALR  14,15
L207     EQU   *
         L     2,12(6)
         A     2,=F'44'
         ST    2,12(6)
         L     5,8(6)
         CR    2,5
         BNE   L208
         OC    40(4,6),=F'1073741824'
L208     EQU   *
         L     2,24(6)
         L     3,12(6)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(6)
         L     2,4(6)
         SR    3,2
         L     4,16(6)
         LR    15,4
         SR    15,2
         CR    3,15
         BNH   L209
         ST    4,12(6)
L209     EQU   *
         MVC   8(4,6),12(6)
         MVC   8(4,5),208(13)
         MVC   12(4,5),204(13)
         ST    7,16(5)
         MVC   20(4,5),220(13)
         MVC   88(4,13),208(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         ST    15,24(5)
         MVI   36(5),0
         STC   8,37(5)
         MVI   38(5),0
         MVC   0(4,5),=F'0'
         MVC   4(4,5),=F'0'
         MVC   32(4,5),=F'0'
         MVC   40(4,5),=F'0'
         ST    7,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         LTR   15,15
         BE    L210
         L     4,16(5)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         SLR   15,15
         CLM   2,1,=XL1'89'
         BNE   L212
         L     2,24(4)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'60'
         BE    L212
         ST    4,88(13)
         L     2,16(5)
         MVC   92(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
L212     EQU   *
         MVC   224(4,13),8(15)
         L     2,148(13)
L505     EQU   *
         LTR   2,2
         BE    L216
         MVC   88(4,13),224(13)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1849)
         BALR  14,15
         LTR   15,15
         BNE   L216
         L     2,0(2)
         B     L505
L216     EQU   *
         LTR   2,2
         BNE   L220
         L     4,=A(@@V6)
         L     2,16(6)
         S     2,12(6)
         LA    6,12(0,0)
         CR    2,6
         BNL   L221
         ST    4,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2094)
         BALR  14,15
L221     EQU   *
         L     2,12(4)
         A     2,=F'12'
         ST    2,12(4)
         L     8,8(4)
         CR    2,8
         BNE   L222
         OC    40(4,4),=F'1073741824'
L222     EQU   *
         L     2,24(4)
         L     3,12(4)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(4)
         L     2,4(4)
         SR    3,2
         L     6,16(4)
         LR    15,6
         SR    15,2
         CR    3,15
         BNH   L223
         ST    6,12(4)
L223     EQU   *
         MVC   8(4,4),12(4)
         LR    2,8
         MVC   4(4,8),224(13)
         MVC   8(4,8),=F'0'
         MVC   0(4,8),148(13)
         ST    8,148(13)
L220     EQU   *
         ST    2,28(5)
         MVC   4(4,5),8(2)
         ST    5,8(2)
         B     L225
L210     EQU   *
         ST    15,28(5)
L225     EQU   *
         MVC   88(4,13),168(13)
         L     2,24(5)
         LCR   2,2
         ST    2,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@687)
         BALR  14,15
         L     2,=V(ZZZ@1844)
         L     2,0(2)
         LTR   2,2
         BE    L226
         ST    2,88(13)
         MVC   92(4,13),=A(LC8)
         MVC   96(4,13),220(13)
         L     3,208(13)
         MVC   100(4,13),44(3)
         MVC   104(4,13),4(7)
         L     2,28(5)
         L     3,=A(LC9)
         LTR   2,2
         BNE   L228
         L     3,=A(LC10)
L228     EQU   *
         ST    3,108(13)
         MVC   112(4,13),24(5)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L226     EQU   *
         LR    2,9
         SLL   2,2
         L     4,176(13)
         ST    5,0(2,4)
         L     3,144(13)
         LA    2,1(0,0)
         SLL   2,0(3)
         L     6,124(13)
         OR    6,2
         ST    6,124(13)
         O     2,128(13)
         ST    2,128(13)
         L     8,300(13)
         MVC   88(4,13),0(8)
         MVC   92(4,13),0(8)
         L     6,=A(@@V4)
         S     3,0(6)
         SLL   3,2
         L     15,184(13)
         L     3,0(3,15)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1865)
         BALR  14,15
         LR    3,9
         SRL   3,5
         SLL   3,2
         LR    2,3
         A     2,0(8)
         N     9,=F'31'
         LA    4,1(0,0)
         SLL   4,0(9)
         L     8,12(2)
         OR    8,4
         ST    8,12(2)
         MVC   0(4,5),212(13)
         ST    5,212(13)
         L     5,144(13)
         LR    2,5
         S     2,0(6)
         SLL   2,2
         L     15,184(13)
         A     3,0(2,15)
         O     4,12(3)
         ST    4,12(3)
         ST    5,88(13)
         MVC   92(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         L     14,=A(L204)
         BR    14
L206     EQU   *
         MVC   88(4,13),24(7)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         LTR   15,15
         L     14,=A(L231)
         BER   14
         MVC   88(4,13),24(7)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         LTR   15,15
         BE    L234
         L     2,=A(@@V2)
         L     15,0(2)
L234     EQU   *
         LR    2,15
         LTR   15,15
         BE    L235
         MVC   88(4,13),24(7)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         LTR   15,15
         BE    L235
         SLR   2,2
         B     L238
L235     EQU   *
         LTR   2,2
         BE    L238
         L     8,0(2)
         B     L239
L238     EQU   *
         LR    8,2
L239     EQU   *
         L     4,=A(@@V6)
         L     2,16(4)
         S     2,12(4)
         LA    3,32(0,0)
         CR    2,3
         BNL   L240
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2094)
         BALR  14,15
L240     EQU   *
         L     2,12(4)
         A     2,=F'32'
         ST    2,12(4)
         L     5,8(4)
         CR    2,5
         BNE   L241
         OC    40(4,4),=F'1073741824'
L241     EQU   *
         L     2,24(4)
         L     3,12(4)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(4)
         L     2,4(4)
         SR    3,2
         L     6,16(4)
         LR    15,6
         SR    15,2
         CR    3,15
         BNH   L242
         ST    6,12(4)
L242     EQU   *
         MVC   8(4,4),12(4)
         MVC   4(4,5),208(13)
         MVC   8(4,5),204(13)
         ST    7,12(5)
         ST    8,16(5)
         MVI   28(5),0
         MVC   0(4,5),=F'0'
         MVC   20(4,5),=F'0'
         MVC   24(4,5),=F'-1'
         L     3,=V(ZZZ@1844)
         L     2,0(3)
         LTR   2,2
         BE    L243
         ST    2,88(13)
         MVC   92(4,13),=A(LC11)
         L     2,208(13)
         MVC   96(4,13),44(2)
         MVC   100(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,16(5)
         LTR   2,2
         BE    L243
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(LC12)
         L     2,16(5)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L243     EQU   *
         SLL   9,2
         L     3,180(13)
         ST    5,0(9,3)
         L     3,16(5)
         LTR   3,3
         BE    L246
         LA    2,1(0,0)
         L     3,4(3)
         SLL   2,0(3)
         O     2,128(13)
         ST    2,128(13)
         B     L247
L246     EQU   *
         L     2,=A(@@V4)
         L     3,0(2)
         L     4,=A(@@V7)
L506     EQU   *
         C     3,0(4)
         BH    L452
         L     2,=A(@@V1)
         L     2,0(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L250
         ST    3,88(13)
         LR    6,3
         A     6,=F'1'
         ST    6,92(13)
         MVC   96(4,13),12(5)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1771)
         BALR  14,15
         LTR   15,15
         BE    L250
         ST    3,88(13)
         MVC   92(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         LA    2,1(0,0)
         SLL   2,0(3)
         O     2,128(13)
         ST    2,128(13)
L250     EQU   *
         A     3,=F'1'
         B     L506
L452     EQU   *
         MVC   88(4,13),24(7)
         MVC   92(4,13),=A(@@F12)
         LR    8,13
         A     8,=F'120'
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(NOTE@STO)
         BALR  14,15
L247     EQU   *
         MVC   0(4,5),120(13)
         ST    5,120(13)
L231     EQU   *
         LH    2,0(7)
         CLM   2,3,=H'47'
         BNE   L204
         L     8,=V(ZZZ@109)
         LR    9,8
         L     5,24(7)
         LH    2,0(5)
         CH    2,=H'52'
         BNE   L254
         L     2,4(5)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    L254
         L     6,152(13)
L259     EQU   *
         L     3,4(5)
         LR    2,4
         SLL   2,2
         L     2,4(2,3)
         LH    2,0(2)
         CH    2,=H'64'
         BNE   L257
         L     6,0(9)
         X     6,=F'-1'
         LA    8,152(,13)
L257     EQU   *
         BCTR  4,0
         LTR   4,4
         BNL   L259
         ST    6,152(13)
L254     EQU   *
         L     2,=A(@@V4)
         MVC   144(4,13),0(2)
         L     4,=A(@@V7)
         L     3,0(2)
L507     EQU   *
         C     3,0(4)
         BH    L204
         L     2,0(8)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L262
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         SLL   3,2
         L     2,0(3,2)
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LR    15,13
         A     15,=F'120'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
L262     EQU   *
         L     2,144(13)
         A     2,=F'1'
         ST    2,144(13)
         LR    3,2
         B     L507
L204     EQU   *
         L     7,12(7)
         L     3,204(13)
         A     3,=F'1'
         ST    3,204(13)
         B     L504
L449     EQU   *
         L     4,=A(@@V3)
         L     2,0(4)
         L     6,128(13)
         L     5,296(13)
         ST    6,0(5,2)
         L     8,124(13)
         L     7,192(13)
         ST    8,0(7,5)
         L     2,=V(ZZZ@1844)
         L     2,0(2)
         LTR   2,2
         BE    L196
         MVC   88(4,13),200(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
L196     EQU   *
         L     15,200(13)
         A     15,=F'1'
         ST    15,200(13)
         L     2,296(13)
         A     2,=F'4'
         ST    2,296(13)
         L     3,300(13)
         A     3,=F'4'
         ST    3,300(13)
         L     4,=V(N@BASIC@)
         C     15,0(4)
         BL    L267
L445     EQU   *
         L     7,=V(N@BASIC@)
         MVC   88(4,13),0(7)
         MVC   92(4,13),172(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1878)
         BALR  14,15
         LR    6,15
         ST    15,88(13)
         MVC   92(4,13),0(7)
         LA    1,88(,13)
         L     15,=V(ZZZ@1880)
         BALR  14,15
         SLR   5,5
L508     EQU   *
         L     12,0(,10)
         C     5,0(7)
         L     14,=A(L456)
         BNLR  14
         L     9,=A(@@V4)
         L     4,0(9)
         L     8,=A(@@V7)
L509     EQU   *
         L     12,0(,10)
         C     4,0(8)
         L     14,=A(L458)
         BHR   14
         L     2,=A(@@V1)
         L     2,0(2)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L274)
         BER   14
         LR    3,5
         SLL   3,2
         L     15,192(13)
         L     2,0(3,15)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L274)
         BER   14
         L     2,0(3,6)
         ST    2,88(13)
         L     3,0(3,6)
         ST    3,92(13)
         LR    2,4
         S     2,0(9)
         SLL   2,2
         L     3,184(13)
         L     2,0(2,3)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1857)
         BALR  14,15
L274     EQU   *
         A     4,=F'1'
         B     L509
L458     EQU   *
         A     5,=F'1'
         B     L508
L456     EQU   *
         MVC   88(4,13),192(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     4,=V(N@BASIC@)
         MVC   88(4,13),0(4)
         MVC   92(4,13),172(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1878)
         BALR  14,15
         ST    15,196(13)
         MVC   88(4,13),172(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         LR    5,15
         SLR   3,3
L510     EQU   *
         L     12,0(,10)
         C     3,0(4)
         B     PGE12
         DS    0F
         LTORG
         DS    0F
PGE12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         L     14,=A(L289)
         BNLR  14
         LR    2,3
         SLL   2,2
         L     7,196(13)
         L     7,0(2,7)
         ST    7,88(13)
         L     8,188(13)
         L     2,0(2,8)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1864)
         BALR  14,15
         A     3,=F'1'
         L     14,=A(L510)
         BR    14
L289     EQU   *
         L     12,4(,10)
         SLR   4,4
         LR    3,4
         L     7,=V(N@BASIC@)
         C     4,0(7)
         BNL   L496
L288     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),196(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1876)
         BALR  14,15
         LR    2,3
         SLL   2,2
         L     15,196(13)
         L     15,0(2,15)
         ST    15,88(13)
         L     8,188(13)
         L     8,0(2,8)
         ST    8,92(13)
         ST    5,96(13)
         L     2,0(2,6)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1875)
         BALR  14,15
         N     15,=XL4'000000FF'
         OR    4,15
         A     3,=F'1'
         C     3,0(7)
         BL    L288
         LTR   4,4
         BNE   L289
L496     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),188(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),172(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         LR    9,15
         MVC   228(4,13),=F'0'
         SLR   2,2
         L     15,=V(N@BASIC@)
         C     2,0(15)
         BNL   L466
L332     EQU   *
         L     12,4(,10)
         L     2,228(13)
         SLL   2,2
         L     3,=V(BASIC@BL)
         A     2,0(3)
         L     2,16(2)
         ST    9,88(13)
         MVC   92(4,13),196(13)
         MVC   96(4,13),228(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1876)
         BALR  14,15
         MVC   232(4,13),0(2)
         L     2,4(2)
         MVC   236(4,13),12(2)
         L     3,232(13)
         CL    3,236(13)
         BE    L468
L331     EQU   *
         L     12,4(,10)
         L     4,232(13)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L296
         MVC   240(4,13),4(4)
         L     2,240(13)
         SLL   2,2
         L     5,176(13)
         L     3,0(2,5)
         L     6,180(13)
         L     5,0(2,6)
         LTR   3,3
         BE    L298
         ST    9,88(13)
         ST    9,92(13)
         L     2,=A(@@V4)
         L     3,20(3)
         S     3,0(2)
         LR    2,3
         SLL   2,2
         L     7,184(13)
         L     2,0(2,7)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1865)
         BALR  14,15
         L     3,240(13)
         SRL   3,5
         SLL   3,2
         L     4,240(13)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(9,3)
         ST    2,12(9,3)
L298     EQU   *
         L     12,4(,10)
         LTR   5,5
         BE    L299
         MVC   88(4,13),172(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         LR    6,15
         L     2,16(5)
         L     3,=A(@@V4)
         LTR   2,2
         BE    L300
         ST    15,88(13)
         ST    9,92(13)
         L     2,16(5)
         L     2,4(2)
         S     2,0(3)
         SLL   2,2
         L     8,184(13)
         L     2,0(2,8)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1853)
         BALR  14,15
         B     L301
L300     EQU   *
         L     12,4(,10)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         LR    7,3
         L     3,0(3)
         L     4,=A(@@V7)
L511     EQU   *
         L     12,4(,10)
         C     3,0(4)
         BH    L301
         L     2,=A(@@V1)
         L     2,0(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L304
         ST    3,88(13)
         LR    15,3
         A     15,=F'1'
         ST    15,92(13)
         MVC   96(4,13),12(5)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1771)
         BALR  14,15
         LTR   15,15
         BE    L304
         ST    6,88(13)
         ST    6,92(13)
         ST    9,96(13)
         LR    2,3
         S     2,0(7)
         SLL   2,2
         L     8,184(13)
         L     2,0(2,8)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1858)
         BALR  14,15
L304     EQU   *
         L     12,4(,10)
         A     3,=F'1'
         B     L511
L301     EQU   *
         L     12,4(,10)
         SLR   8,8
         MVC   248(4,13),4(6)
         LR    2,6
         A     2,=F'12'
         ST    8,244(13)
         CL    8,248(13)
         BNL   L471
         ST    2,292(13)
L324     EQU   *
         L     12,4(,10)
         L     15,292(13)
         L     7,0(15)
         LTR   7,7
         BE    L310
L323     EQU   *
         L     12,4(,10)
         LA    3,1(0,0)
         SLL   3,0(8)
         LR    2,7
         NR    2,3
         LTR   2,2
         BE    L314
         X     3,=F'-1'
         NR    7,3
         L     3,244(13)
         SLL   3,5
         AR    3,8
         LR    2,3
         SLL   2,2
         L     15,176(13)
         L     4,0(2,15)
         L     15,=V(ZZZ@1844)
         L     2,0(15)
         LTR   2,2
         BE    L316
         ST    2,88(13)
         MVC   92(4,13),=A(LC13)
         ST    3,96(13)
         MVC   100(4,13),240(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L316     EQU   *
         L     12,4(,10)
         L     2,20(5)
         A     2,=F'1'
         ST    2,20(5)
         L     2,16(5)
         LTR   2,2
         BNE   L317
         MVI   36(4),1
L317     EQU   *
         L     12,4(,10)
         L     2,24(5)
         L     15,=F'-1'
         CLR   2,15
         BE    L318
         MVI   36(4),1
         L     2,24(5)
         SLL   2,2
         L     3,176(13)
         L     2,0(2,3)
         MVI   36(2),1
         L     15,=V(ZZZ@1844)
         L     2,0(15)
         LTR   2,2
         BE    L320
         ST    2,88(13)
         MVC   92(4,13),=A(LC14)
         MVC   96(4,13),240(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     L320
L318     EQU   *
         L     12,4(,10)
         ST    3,24(5)
L320     EQU   *
         L     12,4(,10)
         IC    2,28(5)
         CLM   2,1,=XL1'00'
         BE    L321
         MVI   38(4),1
L321     EQU   *
         L     12,4(,10)
         MVC   0(4,5),32(4)
         ST    5,32(4)
         LTR   7,7
         BE    L310
L314     EQU   *
         L     12,4(,10)
         A     8,=F'1'
         LA    2,31(0,0)
         CLR   8,2
         BNH   L323
L310     EQU   *
         L     12,4(,10)
         L     3,244(13)
         A     3,=F'1'
         ST    3,244(13)
         L     4,292(13)
         A     4,=F'4'
         ST    4,292(13)
         SLR   8,8
         CL    3,248(13)
         BL    L324
L471     EQU   *
         L     12,4(,10)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L299     EQU   *
         L     12,4(,10)
         L     5,232(13)
         LH    2,0(5)
         CH    2,=H'47'
         BNE   L296
         L     5,=A(@@V4)
         L     3,0(5)
         L     4,=A(@@V7)
L512     EQU   *
         L     12,4(,10)
         C     3,0(4)
         BH    L296
         L     2,=A(@@V1)
         L     2,0(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L328
         L     2,=V(ZZZ@109)
         L     2,0(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L328
         ST    9,88(13)
         ST    9,92(13)
         LR    2,3
         S     2,0(5)
         SLL   2,2
         L     6,184(13)
         L     2,0(2,6)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1865)
         BALR  14,15
L328     EQU   *
         L     12,4(,10)
         A     3,=F'1'
         B     L512
L296     EQU   *
         L     12,4(,10)
         L     7,232(13)
         MVC   232(4,13),12(7)
         L     8,232(13)
         C     8,236(13)
         BNE   L331
L468     EQU   *
         L     12,4(,10)
         L     15,228(13)
         A     15,=F'1'
         ST    15,228(13)
         L     2,=V(N@BASIC@)
         C     15,0(2)
         BL    L332
L466     EQU   *
         L     12,4(,10)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),196(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),184(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),180(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),176(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     14,=A(L523)
         BR    14
L437     EQU   *
         L     12,4(,10)
         MVC   88(4,13),168(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@686)
         BALR  14,15
         LR    6,15
         MVC   88(4,13),168(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@689)
         BALR  14,15
         LCR   15,15
         ST    15,252(13)
         ST    2,268(13)
         ST    2,260(13)
         ST    2,272(13)
         L     3,=V(ZZZ@1844)
         L     2,0(3)
         LTR   2,2
         BE    L338
         ST    2,88(13)
         MVC   92(4,13),=A(LC15)
         L     2,16(6)
         MVC   96(4,13),4(2)
         MVC   100(4,13),24(6)
         ST    15,104(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L338     EQU   *
         L     12,4(,10)
         L     2,28(6)
         LTR   2,2
         BE    L340
         IC    2,36(6)
         CLM   2,1,=XL1'00'
         BE    L339
L340     EQU   *
         L     12,4(,10)
         L     2,0(3)
         LTR   2,2
         L     14,=A(L337)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC16)
         B     L521
L339     EQU   *
         L     12,4(,10)
         L     2,32(6)
         LTR   2,2
         BNE   L343
         L     2,0(3)
         LTR   2,2
         L     14,=A(L337)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC17)
L521     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(L337)
         BR    14
L493     EQU   *
         L     12,4(,10)
         MVC   260(4,13),=F'1'
         B     L346
L343     EQU   *
         L     12,4(,10)
         ST    6,88(13)
         LR    3,13
         A     3,=F'156'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         ST    15,256(13)
         ST    15,88(13)
         MVC   92(4,13),40(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@56)
         BALR  14,15
         L     2,=A(@@V5)
         L     9,0(2)
         L     7,32(6)
L513     EQU   *
         L     12,4(,10)
         LTR   7,7
         BE    L346
         L     8,4(7)
         C     8,8(6)
         BNE   L347
         L     2,8(7)
         L     3,12(6)
         CR    2,3
         BNH   L347
         AR    3,9
         CR    3,2
         BNH   L347
         L     4,16(6)
         LR    5,3
         SR    5,2
         L     8,0(8)
         B     L522
L514     EQU   *
         L     12,4(,10)
         LTR   5,5
         BNH   L350
         L     4,8(4)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L522
         BCTR  5,0
L522     EQU   *
         L     12,4(,10)
         CR    4,8
         BNE   L514
L350     EQU   *
         L     12,4(,10)
         LTR   5,5
         BH    L493
L347     EQU   *
         L     12,4(,10)
         L     7,0(7)
         B     L513
L346     EQU   *
         L     12,4(,10)
         MVC   88(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(GET@IMME)
         BALR  14,15
         ST    15,264(13)
         LTR   15,15
         L     14,=A(L497)
         BER   14
         L     5,=V(ENTRY@EX)
         CR    15,5
         L     14,=A(L497)
         BER   14
         L     2,24(6)
         C     2,252(13)
         L     14,=A(L497)
         BLR   14
L426     EQU   *
         L     12,4(,10)
         MVC   88(4,13),264(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    3,15
         L     7,=V(ZZZ@1844)
         L     2,0(7)
         LTR   2,2
         BE    L359
         ST    2,88(13)
         MVC   92(4,13),=A(LC18)
         L     8,264(13)
         MVC   96(4,13),44(8)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L359     EQU   *
         L     12,4(,10)
         CR    3,4
         BL    L361
         L     14,=A(L358)
         BNER  14
         L     15,260(13)
         LTR   15,15
         L     14,=A(L358)
         BER   14
L361     EQU   *
         L     12,4(,10)
         MVC   88(4,13),256(13)
         LR    2,13
         A     2,=F'156'
         ST    2,92(13)
         MVC   96(4,13),8(6)
         MVC   100(4,13),264(13)
         LA    1,88(,13)
         L     15,=A(@@F21)
         BALR  14,15
         L     2,0(7)
         LTR   2,2
         BE    L362
         ST    2,88(13)
         MVC   92(4,13),=A(LC19)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),156(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         MVC   88(4,13),0(7)
         MVC   92(4,13),=A(LC4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L362     EQU   *
         L     12,4(,10)
         MVC   88(4,13),156(13)
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         L     2,0(7)
         L     3,=F'-1'
         CLR   15,3
         L     14,=A(L363)
         BER   14
         ST    15,276(13)
         LA    8,156(,13)
         L     4,264(13)
         MVC   280(4,13),0(4)
         MVC   284(4,13),16(6)
         LTR   2,2
         BE    L364
         ST    2,88(13)
         MVC   92(4,13),=A(LC20)
         MVC   96(4,13),44(4)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L364     EQU   *
         L     12,4(,10)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         MVC   20(4,6),276(13)
         MVC   8(4,6),264(13)
         MVC   12(4,6),=F'0'
         MVC   88(4,13),264(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         ST    15,24(6)
         MVI   37(6),0
         MVC   88(4,13),40(6)
         MVC   92(4,13),256(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@56)
         BALR  14,15
         L     2,28(6)
         L     4,8(2)
L515     EQU   *
         L     12,4(,10)
         LTR   4,4
         L     14,=A(L478)
         BER   14
         CLR   4,6
         L     14,=A(L367)
         BER   14
         L     2,32(4)
         LTR   2,2
         L     14,=A(L367)
         BER   14
         IC    2,36(4)
         CLM   2,1,=XL1'00'
         L     14,=A(L367)
         BNER  14
         MVC   88(4,13),=F'0'
         MVC   92(4,13),8(4)
         MVC   96(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(DOMINATE)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(L367)
         BER   14
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         LR    5,15
         L     2,40(4)
         LTR   2,2
         BNE   L369
         ST    4,88(13)
         LR    15,13
         A     15,=F'160'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
L369     EQU   *
         L     12,4(,10)
         MVC   164(4,13),0(8)
         ST    5,88(13)
         MVC   92(4,13),40(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@56)
         BALR  14,15
         L     3,32(4)
L516     EQU   *
         L     12,4(,10)
         LTR   3,3
         BE    L480
         ST    5,88(13)
         LR    2,13
         A     2,=F'164'
         ST    2,92(13)
         MVC   96(4,13),8(6)
         MVC   100(4,13),4(3)
         LA    1,88(,13)
         L     15,=A(@@F21)
         BALR  14,15
         L     3,0(3)
         B     L516
L480     EQU   *
         L     12,4(,10)
         MVC   88(4,13),164(13)
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         LR    3,15
         L     15,=F'-1'
         CLR   3,15
         L     14,=A(L374)
         BER   14
         L     2,0(7)
         LTR   2,2
         BE    L375
         ST    2,88(13)
         MVC   92(4,13),=A(LC21)
         L     2,16(4)
         MVC   96(4,13),4(2)
         L     2,16(6)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L375     EQU   *
         L     12,4(,10)
         ST    3,20(6)
         L     3,32(4)
L517     EQU   *
         L     12,4(,10)
         LTR   3,3
         BE    L482
         L     2,0(3)
         MVC   0(4,3),32(6)
         ST    3,32(6)
         LR    3,2
         B     L517
L482     EQU   *
         L     12,4(,10)
         L     3,32(6)
L518     EQU   *
         L     12,4(,10)
         LTR   3,3
         BE    L484
         MVC   88(4,13),12(3)
         MVC   92(4,13),=F'1'
         L     2,16(3)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@698)
         BALR  14,15
         MVC   88(4,13),12(3)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1817)
         BALR  14,15
         L     3,0(3)
         B     L518
L484     EQU   *
         L     12,4(,10)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         MVC   32(4,4),=F'0'
         MVC   88(4,13),40(6)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@56)
         BALR  14,15
         IC    2,38(4)
         CLM   2,1,=XL1'00'
         BE    L383
         MVI   38(6),1
L383     EQU   *
         L     12,4(,10)
         MVC   0(4,8),164(13)
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@451)
         BALR  14,15
L374     EQU   *
         L     12,4(,10)
         LTR   5,5
         BE    L367
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L367     EQU   *
         L     12,4(,10)
         L     4,4(4)
         B     L515
L478     EQU   *
         L     12,4(,10)
         MVC   276(4,13),20(6)
         L     2,40(6)
         L     7,0(2)
         SLR   9,9
         LR    15,9
L519     EQU   *
         L     12,4(,10)
         LTR   7,7
         L     14,=A(L487)
         BER   14
         LR    2,7
         A     2,=F'12'
         ST    2,288(13)
L407     EQU   *
         L     12,4(,10)
         L     3,288(13)
         L     8,0(3)
         LTR   8,8
         L     14,=A(L399)
         BER   14
L406     EQU   *
         L     12,4(,10)
         LA    3,1(0,0)
         SLL   3,0(15)
         LR    2,8
         NR    2,3
         LTR   2,2
         L     14,=A(L402)
         BER   14
         X     3,=F'-1'
         NR    8,3
         L     5,8(7)
         SLL   5,2
         AR    5,9
         SLL   5,5
         AR    5,15
         L     2,=A(@@V3)
         L     4,0(2)
         LR    2,5
         SLL   2,2
         ST    2,312(13)
         LA    2,1(0,0)
         L     3,20(6)
         SLL   2,0(3)
         L     3,312(13)
         O     2,0(3,4)
         ST    2,0(3,4)
         L     2,=V(ZZZ@1844)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L404)
         BER   14
         ST    5,88(13)
         ST    15,304(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         L     15,304(13)
L404     EQU   *
         L     12,4(,10)
         LTR   8,8
         BE    L399
L402     EQU   *
         L     12,4(,10)
         A     15,=F'1'
         LA    4,31(0,0)
         CLR   15,4
         BNH   L406
L399     EQU   *
         L     12,4(,10)
         SLR   15,15
         A     9,=F'1'
         L     5,288(13)
         A     5,=F'4'
         ST    5,288(13)
         LA    8,3(0,0)
         CLR   9,8
         BNH   L407
         LR    9,15
         B     PGE13
         DS    0F
         LTORG
         DS    0F
PGE13    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG14     EQU   *
         L     7,0(7)
         L     14,=A(L519)
         BR    14
L487     EQU   *
         L     12,8(,10)
         L     15,280(13)
         LH    2,0(15)
         CLM   2,3,=H'49'
         BNE   L410
         MVC   280(4,13),12(15)
L410     EQU   *
         L     12,8(,10)
         L     3,284(13)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         SLR   15,15
         CLM   2,1,=XL1'89'
         BNE   L412
         L     4,284(13)
         L     2,24(4)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'60'
         BE    L412
         ST    4,88(13)
         MVC   92(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
L412     EQU   *
         L     12,8(,10)
         L     3,8(15)
         L     2,4(15)
         SLR   5,5
         IC    5,2(2)
         MVC   88(4,13),=F'74'
         ST    5,92(13)
         MVC   96(4,13),276(13)
         LA    1,88(,13)
         L     15,=V(GEN@RTX)
         BALR  14,15
         LR    4,15
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),280(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@546)
         BALR  14,15
         ST    15,16(6)
         L     2,=V(REGS@EVE)
         LA    8,1(0,0)
         L     7,276(13)
         STC   8,0(2,7)
         L     2,=V(ZZZ@1844)
         L     2,0(2)
         LTR   2,2
         BE    L415
         ST    2,88(13)
         MVC   92(4,13),=A(LC22)
         L     2,16(6)
         MVC   96(4,13),4(2)
         L     15,280(13)
         MVC   100(4,13),4(15)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L415     EQU   *
         L     12,8(,10)
         MVC   88(4,13),284(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@451)
         BALR  14,15
         L     3,32(6)
L520     EQU   *
         L     12,8(,10)
         LTR   3,3
         BE    L492
         L     2,16(3)
         IC    2,2(2)
         CLM   2,1,2(4)
         BE    L420
         CLM   2,1,=XL1'00'
         BNE   L419
L420     EQU   *
         L     12,8(,10)
         LR    2,4
         B     L421
L419     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'74'
         L     2,16(3)
         SLR   5,5
         IC    5,2(2)
         ST    5,92(13)
         MVC   96(4,13),276(13)
         LA    1,88(,13)
         L     15,=V(GEN@RTX)
         BALR  14,15
         LR    2,15
L421     EQU   *
         L     12,8(,10)
         MVC   88(4,13),12(3)
         MVC   92(4,13),16(3)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1828)
         BALR  14,15
         ST    2,16(3)
         L     3,0(3)
         B     L520
L492     EQU   *
         L     12,8(,10)
         MVC   88(4,13),256(13)
         MVC   92(4,13),40(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@56)
         BALR  14,15
         MVC   260(4,13),=F'0'
         MVC   272(4,13),=F'1'
         MVC   88(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    4,15
         B     L358
L363     EQU   *
         L     12,8(,10)
         MVC   268(4,13),=F'1'
         LTR   2,2
         BE    L358
         ST    2,88(13)
         MVC   92(4,13),=A(LC23)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L358     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),264(13)
         LA    1,88(,13)
         L     15,=V(GET@IMME)
         BALR  14,15
         ST    15,264(13)
         L     7,268(13)
         LTR   7,7
         BNE   L357
         LTR   15,15
         BE    L357
         L     8,=V(ENTRY@EX)
         CR    15,8
         BE    L357
         L     2,24(6)
         C     2,252(13)
         L     14,=A(L426)
         BNLR  14
L357     EQU   *
         L     12,8(,10)
         L     15,272(13)
         LTR   15,15
         BNE   L427
L497     EQU   *
         L     12,8(,10)
         MVC   268(4,13),=F'1'
         L     2,=V(ZZZ@1844)
         L     2,0(2)
         LTR   2,2
         BE    L427
         ST    2,88(13)
         MVC   92(4,13),=A(LC24)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L427     EQU   *
         L     12,8(,10)
         L     2,256(13)
         LTR   2,2
         BE    L429
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   88(4,13),256(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L429     EQU   *
         L     12,8(,10)
         L     3,268(13)
         LTR   3,3
         BNE   L337
         MVC   88(4,13),168(13)
         L     4,24(6)
         LCR   4,4
         ST    4,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@687)
         BALR  14,15
         L     2,=V(ZZZ@1844)
         L     2,0(2)
         LTR   2,2
         BE    L523
         ST    2,88(13)
         MVC   92(4,13),=A(LC25)
         L     2,16(6)
         MVC   96(4,13),4(2)
         MVC   100(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     L523
L337     EQU   *
         L     12,8(,10)
         L     2,40(6)
         LTR   2,2
         BE    L523
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   88(4,13),40(6)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   40(4,6),=F'0'
L523     EQU   *
         L     12,8(,10)
         MVC   88(4,13),168(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@685)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(L437)
         BER   14
         L     2,=A(@@V3)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),=A(@@V6)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(OBSTACK@)
         BALR  14,15
         MVC   88(4,13),168(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@683)
         BALR  14,15
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREE@DOM)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(ZZZ@1998)
         BALR  14,15
L177     EQU   *
         L     12,8(,10)
* Function branch_target_load_optimize epilogue
         PDPEPIL
* Function branch_target_load_optimize literal pool
         DS    0F
         LTORG
* Function branch_target_load_optimize page table
         DS    0F
PGT12    EQU   *
         DC    A(PG12)
         DC    A(PG13)
         DC    A(PG14)
         DS    0F
@@V5     EQU   *
         DC    4X'00'
         DS    0F
@@V6     EQU   *
         DC    44X'00'
         DS    0F
@@V3     EQU   *
         DC    4X'00'
         DS    0F
@@V1     EQU   *
         DC    4X'00'
         DS    0F
@@V4     EQU   *
         DC    4X'00'
         DS    0F
@@V7     EQU   *
         DC    4X'00'
         DS    0F
@@V2     EQU   *
         DC    4X'00'
         END
