         COPY  PDPTOP
         CSECT
* Program text area
LC0      EQU   *
         DC    C'%s="%s"'
         DC    X'0'
LC1      EQU   *
         DC    C'%s=%s'
         DC    X'0'
         DS    0F
* X-func ZZZ_100 prologue
ZZZ@100  PDPPRLG CINDEX=0,FRAME=104,BASER=12,ENTRY=YES
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function ZZZ_100 code
         L     4,0(11)
         L     5,4(11)
         L     6,8(11)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    3,2(0,0)
         LTR   6,6
         BE    L2
         LA    3,4(0,0)
L2       EQU   *
         AR    2,15
         AR    2,3
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    3,15
         LTR   6,6
         BE    L3
         ST    15,88(13)
         MVC   92(4,13),=A(LC0)
         B     L5
L3       EQU   *
         ST    15,88(13)
         MVC   92(4,13),=A(LC1)
L5       EQU   *
         ST    4,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         L     2,=V(ZZZ@1630)
         MVC   88(4,13),0(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
* Function ZZZ_100 epilogue
         PDPEPIL
* Function ZZZ_100 literal pool
         DS    0F
         LTORG
* Function ZZZ_100 page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
LC2      EQU   *
         DC    C'127'
         DC    X'0'
LC3      EQU   *
         DC    C'255'
         DC    X'0'
LC4      EQU   *
         DC    C'32767'
         DC    X'0'
LC5      EQU   *
         DC    C'65535'
         DC    X'0'
LC6      EQU   *
         DC    C'2147483647'
         DC    X'0'
LC7      EQU   *
         DC    C'4294967295'
         DC    X'0'
LC8      EQU   *
         DC    C'9223372036854775807'
         DC    X'0'
LC9      EQU   *
         DC    C'18446744073709551615'
         DC    X'0'
LC10     EQU   *
         DC    C'170141183460469231731687303715884105727'
         DC    X'0'
LC11     EQU   *
         DC    C'340282366920938463463374607431768211455'
         DC    X'0'
         DS    0F
@@V1     EQU   *
         DC    A(LC2)
         DC    A(LC3)
         DC    A(LC4)
         DC    A(LC5)
         DC    A(LC6)
         DC    A(LC7)
         DC    A(LC8)
         DC    A(LC9)
         DC    A(LC10)
         DC    A(LC11)
LC12     EQU   *
         DC    X'0'
LC13     EQU   *
         DC    C'U'
         DC    X'0'
LC14     EQU   *
         DC    C'L'
         DC    X'0'
LC15     EQU   *
         DC    C'UL'
         DC    X'0'
LC16     EQU   *
         DC    C'LL'
         DC    X'0'
LC17     EQU   *
         DC    C'ULL'
         DC    X'0'
         DS    0F
@@V2     EQU   *
         DC    A(LC12)
         DC    A(LC13)
         DC    A(LC14)
         DC    A(LC15)
         DC    A(LC16)
         DC    A(LC17)
LC18     EQU   *
         DC    C'<stdin>'
         DC    X'0'
LC19     EQU   *
         DC    C'?'
         DC    X'0'
LC20     EQU   *
         DC    C'%s=%s%s'
         DC    X'0'
         DS    0F
* Function builtin_define_type_max,F7 prologue
@@F7     PDPPRLG CINDEX=1,FRAME=112,BASER=12,ENTRY=NO
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function builtin_define_type_max code
         L     6,0(11)
         L     3,4(11)
         L     4,8(11)
         L     2,32(3)
         SRL   2,23
         LA    5,4(0,0)
         LA    7,32(0,0)
         CR    2,7
         BE    L7
         BH    L14
         SLR   5,5
         LA    7,8(0,0)
         CLR   2,7
         BE    L7
         LA    5,16(0,0)
         CLR   2,5
         BE    L9
         B     L13
L14      EQU   *
         LA    5,6(0,0)
         LA    7,64(0,0)
         CLR   2,7
         BE    L7
         LA    5,128(0,0)
         CLR   2,5
         BE    L12
         B     L13
L9       EQU   *
         LA    5,2(0,0)
         B     L7
L12      EQU   *
         LA    5,8(0,0)
         B     L7
L13      EQU   *
         MVC   88(4,13),=A(LC18)
         MVC   92(4,13),=F'581'
         MVC   96(4,13),=A(LC19)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L7       EQU   *
         L     3,8(3)
         SRL   3,18
         N     3,=F'1'
         AR    5,3
         SLL   5,2
         L     2,=A(@@V1)
         L     5,0(5,2)
         AR    4,4
         AR    4,3
         SLL   4,2
         L     2,=A(@@V2)
         L     4,0(4,2)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         AR    2,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         AR    2,15
         A     2,=F'2'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),=A(LC20)
         ST    6,96(13)
         ST    5,100(13)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         L     2,=V(ZZZ@1630)
         MVC   88(4,13),0(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
* Function builtin_define_type_max epilogue
         PDPEPIL
* Function builtin_define_type_max literal pool
         DS    0F
         LTORG
* Function builtin_define_type_max page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* X-func ZZZ_99 prologue
ZZZ@99   PDPPRLG CINDEX=2,FRAME=104,BASER=12,ENTRY=YES
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function ZZZ_99 code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         LR    3,15
         A     3,=F'5'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    8,15
         A     8,=F'2'
         ST    8,96(13)
         LR    9,8
         AR    9,2
         A     2,=F'1'
         LR    6,8
         LR    7,2
         L     4,0(11)
         LR    5,2
         MVCL  6,4
         CLI   0(8),109
         BNE   L24
         IC    2,1(8)
         CLM   2,1,=XL1'6D'
         BE    L16
         N     2,=XL4'000000FF'
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'128'
         LTR   2,2
         BNE   L16
         B     L18
L24      EQU   *
         LR    8,15
         A     8,=F'1'
         MVI   0(8),109
L18      EQU   *
         CLI   1(8),109
         BE    L16
         BCTR  8,0
         MVI   0(8),109
L16      EQU   *
         L     3,=V(ZZZ@1630)
         MVC   88(4,13),0(3)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
         CL    8,96(13)
         BE    L15
         L     2,=F'-1'
         IC    2,0(2,9)
         CLM   2,1,=XL1'6D'
         BE    L21
         MVI   0(9),109
         A     9,=F'1'
L21      EQU   *
         L     2,=F'-2'
         IC    2,0(2,9)
         CLM   2,1,=XL1'6D'
         BE    L22
         MVI   0(9),109
         A     9,=F'1'
L22      EQU   *
         MVI   0(9),0
         MVC   88(4,13),0(3)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
         L     2,=V(ZZZ@752)
         L     2,0(2)
         LTR   2,2
         BNE   L15
         MVC   88(4,13),0(3)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L15      EQU   *
* Function ZZZ_99 epilogue
         PDPEPIL
* Function ZZZ_99 literal pool
         DS    0F
         LTORG
* Function ZZZ_99 page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
         DS    0F
* Function builtin_define_with_value_n,F4 prologue
@@F4     PDPPRLG CINDEX=3,FRAME=96,BASER=12,ENTRY=NO
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function builtin_define_with_value_n code
         L     4,0(11)
         L     3,8(11)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         LR    5,15
         AR    5,3
         LR    6,5
         A     6,=F'2'
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    8,15
         LR    9,2
         LR    6,4
         LR    7,2
         MVCL  8,6
         LA    4,126(0,0)
         STC   4,0(15,2)
         AR    2,15
         LR    8,2
         A     8,=F'1'
         LR    9,3
         L     6,4(11)
         LR    7,3
         MVCL  8,6
         SLR   6,6
         STC   6,1(15,5)
         L     2,=V(ZZZ@1630)
         MVC   88(4,13),0(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
* Function builtin_define_with_value_n epilogue
         PDPEPIL
* Function builtin_define_with_value_n literal pool
         DS    0F
         LTORG
* Function builtin_define_with_value_n page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
LC21     EQU   *
         DC    C'%ld'
         DC    X'0'
         DS    0F
* Function builtin_define_with_int_value,F5 prologue
@@F5     PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=NO
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function builtin_define_with_int_value code
         L     4,0(11)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         LR    3,15
         A     3,=F'20'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    3,15
         LR    8,15
         LR    9,2
         LR    6,4
         LR    7,2
         MVCL  8,6
         LA    4,126(0,0)
         STC   4,0(15,2)
         AR    2,15
         A     2,=F'1'
         ST    2,88(13)
         MVC   92(4,13),=A(LC21)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         L     2,=V(ZZZ@1630)
         MVC   88(4,13),0(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
* Function builtin_define_with_int_value epilogue
         PDPEPIL
* Function builtin_define_with_int_value literal pool
         DS    0F
         LTORG
* Function builtin_define_with_int_value page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
         DS    0F
* Function builtin_define_with_hex_fp_value,F6 prologue
@@F6     PDPPRLG CINDEX=5,FRAME=456,BASER=12,ENTRY=NO
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function builtin_define_with_hex_fp_value code
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@1744)
         BALR  14,15
         LA    2,136(,13)
         ST    2,88(13)
         LR    3,13
         A     3,=F'112'
         ST    3,92(13)
         MVC   96(4,13),=F'64'
         MVC   100(4,13),8(11)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1751)
         BALR  14,15
         LA    3,200(,13)
         ST    3,88(13)
         MVC   92(4,13),=A(LC20)
         MVC   96(4,13),0(11)
         ST    2,100(13)
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         L     2,=V(ZZZ@1630)
         MVC   88(4,13),0(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
* Function builtin_define_with_hex_fp_value epilogue
         PDPEPIL
* Function builtin_define_with_hex_fp_value literal pool
         DS    0F
         LTORG
* Function builtin_define_with_hex_fp_value page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
LC22     EQU   *
         DC    C'__FLT_RADIX__'
         DC    X'0'
LC23     EQU   *
         DC    C'__%s_MANT_DIG__'
         DC    X'0'
LC24     EQU   *
         DC    C'__%s_DIG__'
         DC    X'0'
LC25     EQU   *
         DC    C'__%s_MIN_EXP__'
         DC    X'0'
LC26     EQU   *
         DC    C'(%d)'
         DC    X'0'
LC27     EQU   *
         DC    C'__%s_MIN_10_EXP__'
         DC    X'0'
LC28     EQU   *
         DC    C'__%s_MAX_EXP__'
         DC    X'0'
LC29     EQU   *
         DC    C'__%s_MAX_10_EXP__'
         DC    X'0'
LC30     EQU   *
         DC    C'__DECIMAL_DIG__'
         DC    X'0'
LC31     EQU   *
         DC    C'0x0.'
         DC    X'0'
LC32     EQU   *
         DC    C'08ce'
         DC    X'0'
LC33     EQU   *
         DC    C'p%d'
         DC    X'0'
LC34     EQU   *
         DC    C'7bde'
         DC    X'0'
LC35     EQU   *
         DC    C'__%s_MAX__'
         DC    X'0'
LC36     EQU   *
         DC    C'__%s_MIN__'
         DC    X'0'
LC37     EQU   *
         DC    C'0x1p%d'
         DC    X'0'
LC38     EQU   *
         DC    C'__%s_EPSILON__'
         DC    X'0'
LC39     EQU   *
         DC    C'__%s_DENORM_MIN__'
         DC    X'0'
LC40     EQU   *
         DC    C'0.0%s'
         DC    X'0'
LC41     EQU   *
         DC    C'__%s_HAS_INFINITY__'
         DC    X'0'
LC42     EQU   *
         DC    C'__%s_HAS_QUIET_NAN__'
         DC    X'0'
         DS    0F
* Function builtin_define_float_constants,F2 prologue
@@F2     PDPPRLG CINDEX=6,FRAME=336,BASER=12,ENTRY=NO
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function builtin_define_float_constants code
         SLR   8,8
         SLR   9,9
         ST    8,304(13)
         ST    9,4+304(13)
         ST    8,312(13)
         ST    9,4+312(13)
         ST    8,320(13)
         ST    9,4+320(13)
         ST    8,328(13)
         ST    9,4+328(13)
         L     3,8(11)
         LH    2,32(3)
         N     2,=F'127'
         SLL   2,2
         A     2,=V(REAL@FOR)
         A     2,=F'-36'
         L     6,0(2)
         L     3,=V(GLOBAL@T)
         L     7,8(11)
         CL    7,116(3)
         BNE   L29
         MVC   88(4,13),=A(LC22)
         MVC   92(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
L29      EQU   *
         L     15,12(6)
         MVC   80(4,13),=XL8'4E00000080000000'
         ST    15,84(,13)
         XI    84(13),128
         LD    0,80(,13)
         SD    0,=XL8'4E00000080000000'
         MD    0,=D'3.01029995663981198017467E-1'
         STD   0,80(,13)
         LM    4,5,80(13)
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         MVC   92(4,13),=A(LC23)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    7,13
         A     7,=F'112'
         ST    7,88(13)
         MVC   92(4,13),16(6)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         L     2,16(6)
         BCTR  2,0
         MVC   80(4,13),=XL8'4E00000080000000'
         ST    2,84(,13)
         XI    84(13),128
         LD    2,80(,13)
         SD    2,=XL8'4E00000080000000'
         STM   4,5,80(13)
         LD    0,80(,13)
         MDR   2,0
         LDR   0,2
         AD    0,=XL8'4F08000000000000'
         STD   0,80(,13)
         L     2,84(,13)
         LR    7,13
         A     7,=F'112'
         ST    7,88(13)
         MVC   92(4,13),=A(LC24)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         MVC   92(4,13),=A(LC25)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LA    7,176(,13)
         ST    7,88(13)
         MVC   92(4,13),=A(LC26)
         MVC   96(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         ST    7,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@100)
         BALR  14,15
         L     2,24(6)
         BCTR  2,0
         MVC   80(4,13),=XL8'4E00000080000000'
         ST    2,84(,13)
         XI    84(13),128
         LD    2,80(,13)
         SD    2,=XL8'4E00000080000000'
         STM   4,5,80(13)
         LD    0,80(,13)
         MDR   2,0
         LDR   0,2
         AD    0,=XL8'4F08000000000000'
         STD   0,80(,13)
         L     2,84(,13)
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         MVC   92(4,13),=A(LC27)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(LC26)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         ST    7,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@100)
         BALR  14,15
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         MVC   92(4,13),=A(LC28)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         MVC   92(4,13),28(6)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         L     15,28(6)
         MVC   80(4,13),=XL8'4E00000080000000'
         ST    15,84(,13)
         XI    84(13),128
         LD    2,80(,13)
         SD    2,=XL8'4E00000080000000'
         STM   4,5,80(13)
         LD    0,80(,13)
         MDR   2,0
         LDR   0,2
         AD    0,=XL8'4F08000000000000'
         STD   0,80(,13)
         L     2,84(,13)
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         MVC   92(4,13),=A(LC29)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         L     2,16(6)
         MVC   80(4,13),=XL8'4E00000080000000'
         ST    2,84(,13)
         XI    84(13),128
         LD    2,80(,13)
         SD    2,=XL8'4E00000080000000'
         STM   4,5,80(13)
         LD    0,80(,13)
         MDR   2,0
         AD    2,=D'1.0E+0'
         LDR   0,2
         AD    0,=XL8'4F08000000000000'
         STD   0,80(,13)
         L     5,84(,13)
         MVC   80(4,13),=XL8'4E00000080000000'
         ST    5,84(,13)
         XI    84(13),128
         LD    0,80(,13)
         SD    0,=XL8'4E00000080000000'
         CDR   0,2
         BNL   L30
         A     5,=F'1'
L30      EQU   *
         L     2,8(11)
         CL    2,124(3)
         BNE   L32
         MVC   88(4,13),=A(LC30)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
L32      EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(LC31)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         L     9,12(6)
         M     8,16(6)
         LR    3,9
         SLR   15,15
         LA    4,180(,13)
         LA    8,3(0,0)
         CR    9,8
         BNH   L44
L36      EQU   *
         MVI   0(4),134
         A     4,=F'1'
         A     15,=F'4'
         LR    2,15
         A     2,=F'3'
         CR    2,3
         BL    L36
L44      EQU   *
         CR    15,3
         BNL   L37
         LR    2,3
         SR    2,15
         L     3,=A(LC32)
         IC    2,0(3,2)
         STC   2,0(4)
         A     4,=F'1'
L37      EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(LC33)
         L     9,12(6)
         ST    9,308(13)
         L     2,304(13)
         L     3,4+304(13)
         M     2,28(6)
         ST    2,304(13)
         ST    3,4+304(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         L     4,20(6)
         C     4,16(6)
         BNL   L38
         LR    2,4
         LTR   4,4
         BNL   L39
         A     2,=F'3'
L39      EQU   *
         SRA   2,2
         LR    3,2
         SLL   3,2
         SR    4,3
         L     3,=A(LC34)
         IC    4,0(3,4)
         STC   4,180(13,2)
L38      EQU   *
         LR    3,13
         A     3,=F'112'
         ST    3,88(13)
         MVC   92(4,13),=A(LC35)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    8,13
         A     8,=F'112'
         ST    8,88(13)
         MVC   92(4,13),8(11)
         ST    5,96(13)
         ST    7,100(13)
         MVC   104(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         LR    9,13
         A     9,=F'112'
         ST    9,88(13)
         MVC   92(4,13),=A(LC36)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(LC37)
         L     2,24(6)
         BCTR  2,0
         L     15,12(6)
         ST    15,316(13)
         L     8,312(13)
         L     9,4+312(13)
         MR    8,2
         ST    8,312(13)
         ST    9,4+312(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    9,13
         A     9,=F'112'
         ST    9,88(13)
         MVC   92(4,13),8(11)
         ST    5,96(13)
         ST    7,100(13)
         MVC   104(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         MVC   92(4,13),=A(LC38)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(LC37)
         LA    2,1(0,0)
         S     2,16(6)
         L     3,12(6)
         ST    3,324(13)
         L     8,320(13)
         L     9,4+320(13)
         MR    8,2
         ST    8,320(13)
         ST    9,4+320(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    9,13
         A     9,=F'112'
         ST    9,88(13)
         MVC   92(4,13),8(11)
         ST    5,96(13)
         ST    7,100(13)
         MVC   104(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         MVC   92(4,13),=A(LC39)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         IC    2,38(6)
         CLM   2,1,=XL1'00'
         BE    L41
         ST    7,88(13)
         MVC   92(4,13),=A(LC37)
         L     2,24(6)
         S     2,16(6)
         L     6,12(6)
         ST    6,332(13)
         L     8,328(13)
         L     9,4+328(13)
         MR    8,2
         ST    8,328(13)
         ST    9,4+328(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    9,13
         A     9,=F'112'
         ST    9,88(13)
         MVC   92(4,13),8(11)
         ST    5,96(13)
         ST    7,100(13)
         MVC   104(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         B     L42
L41      EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(LC40)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         ST    7,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@100)
         BALR  14,15
L42      EQU   *
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         MVC   92(4,13),=A(LC41)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    3,13
         A     3,=F'112'
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         LR    7,13
         A     7,=F'112'
         ST    7,88(13)
         MVC   92(4,13),=A(LC42)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         LR    8,13
         A     8,=F'112'
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
* Function builtin_define_float_constants epilogue
         PDPEPIL
* Function builtin_define_float_constants literal pool
         DS    0F
         LTORG
* Function builtin_define_float_constants page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
LC43     EQU   *
         DC    C'__GNUC__'
         DC    X'0'
LC44     EQU   *
         DC    C'__GNUG__'
         DC    X'0'
LC45     EQU   *
         DC    C'__GNUC_MINOR__'
         DC    X'0'
LC46     EQU   *
         DC    C'__GNUC_PATCHLEVEL__'
         DC    X'0'
LC47     EQU   *
         DC    C'0'
         DC    X'0'
LC48     EQU   *
         DC    C'__GXX_WEAK__=0'
         DC    X'0'
LC49     EQU   *
         DC    C'__DEPRECATED'
         DC    X'0'
LC50     EQU   *
         DC    C'__EXCEPTIONS'
         DC    X'0'
LC51     EQU   *
         DC    C'__GXX_ABI_VERSION'
         DC    X'0'
LC52     EQU   *
         DC    C'__USING_SJLJ_EXCEPTIONS__'
         DC    X'0'
LC53     EQU   *
         DC    C'__SCHAR_MAX__'
         DC    X'0'
LC54     EQU   *
         DC    C'__SHRT_MAX__'
         DC    X'0'
LC55     EQU   *
         DC    C'__INT_MAX__'
         DC    X'0'
LC56     EQU   *
         DC    C'__LONG_MAX__'
         DC    X'0'
LC57     EQU   *
         DC    C'__LONG_LONG_MAX__'
         DC    X'0'
LC58     EQU   *
         DC    C'__WCHAR_MAX__'
         DC    X'0'
LC59     EQU   *
         DC    C'__CHAR_BIT__'
         DC    X'0'
LC60     EQU   *
         DC    C'__FLT_EVAL_METHOD__'
         DC    X'0'
LC61     EQU   *
         DC    C'FLT'
         DC    X'0'
LC62     EQU   *
         DC    C'F'
         DC    X'0'
LC63     EQU   *
         DC    C'DBL'
         DC    X'0'
LC64     EQU   *
         DC    C'LDBL'
         DC    X'0'
LC65     EQU   *
         DC    C'__REGISTER_PREFIX__'
         DC    X'0'
LC66     EQU   *
         DC    C'__USER_LABEL_PREFIX__'
         DC    X'0'
LC67     EQU   *
         DC    C'__VERSION__'
         DC    X'0'
LC68     EQU   *
         DC    C'__OPTIMIZE_SIZE__'
         DC    X'0'
LC69     EQU   *
         DC    C'__OPTIMIZE__'
         DC    X'0'
LC70     EQU   *
         DC    C'__FAST_MATH__'
         DC    X'0'
LC71     EQU   *
         DC    C'__NO_INLINE__'
         DC    X'0'
LC72     EQU   *
         DC    C'__SUPPORT_SNAN__'
         DC    X'0'
LC73     EQU   *
         DC    C'__FINITE_MATH_ONLY__=1'
         DC    X'0'
LC74     EQU   *
         DC    C'__FINITE_MATH_ONLY__=0'
         DC    X'0'
LC75     EQU   *
         DC    C'__STRICT_ANSI__'
         DC    X'0'
LC76     EQU   *
         DC    C'__CHAR_UNSIGNED__'
         DC    X'0'
LC77     EQU   *
         DC    C'__WCHAR_UNSIGNED__'
         DC    X'0'
LC78     EQU   *
         DC    C'__NEXT_RUNTIME__'
         DC    X'0'
LC79     EQU   *
         DC    C'GCC'
         DC    X'0'
LC80     EQU   *
         DC    C'gcc'
         DC    X'0'
LC81     EQU   *
         DC    C'machine=i370'
         DC    X'0'
LC82     EQU   *
         DC    C'cpu=i370'
         DC    X'0'
LC83     EQU   *
         DC    C'PDPMAC'
         DC    X'0'
LC84     EQU   *
         DC    C'pdpmac'
         DC    X'0'
LC85     EQU   *
         DC    C'MVS'
         DC    X'0'
LC86     EQU   *
         DC    C'mvs'
         DC    X'0'
LC87     EQU   *
         DC    C'system=mvs'
         DC    X'0'
         DS    0F
* X-func c_cpp_builtins prologue
C@CPP@BU PDPPRLG CINDEX=7,FRAME=104,BASER=12,ENTRY=YES
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function c_cpp_builtins code
         L     6,0(11)
         L     2,=V(FLAG@UND)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L45)
         BNER  14
         L     4,=V(VERSION@)
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BE    L48
         L     3,=V(ZZZ@2096)
L101     EQU   *
         N     2,=XL4'000000FF'
         AR    2,2
         LH    2,0(2,3)
         N     2,=F'4'
         LTR   2,2
         BNE   L48
         A     4,=F'1'
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BNE   L101
L48      EQU   *
         IC    3,0(4)
         CLM   3,1,=XL1'00'
         BE    L51
         L     2,=V(VERSION@)
         CLR   4,2
         BNH   L50
         L     2,=F'-1'
         IC    2,0(2,4)
         CLM   2,1,=XL1'60'
         BE    L50
L51      EQU   *
         MVC   88(4,13),=A(LC18)
         MVC   92(4,13),=F'262'
         B     L108
L50      EQU   *
         LR    5,4
         L     7,=V(ZZZ@2096)
         LR    2,3
         N     2,=XL4'000000FF'
L102     EQU   *
         AR    2,2
         LH    2,0(2,7)
         N     2,=F'4'
         LTR   2,2
         BE    L96
         A     4,=F'1'
         SLR   2,2
         IC    2,0(4)
         B     L102
L96      EQU   *
         MVC   88(4,13),=A(LC43)
         ST    5,92(13)
         LR    3,4
         SR    3,5
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         L     8,=V(C@LANGUA)
         L     2,0(8)
         N     2,=F'2'
         LTR   2,2
         BE    L55
         MVC   88(4,13),=A(LC44)
         ST    5,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
L55      EQU   *
         CLI   0(4),75
         BNE   L57
         SLR   2,2
         IC    2,1(4)
         AR    2,2
         LH    2,0(2,7)
         N     2,=F'4'
         LTR   2,2
         BNE   L56
L57      EQU   *
         MVC   88(4,13),=A(LC18)
         MVC   92(4,13),=F'272'
         B     L108
L56      EQU   *
         A     4,=F'1'
         LR    5,4
         SLR   2,2
         IC    2,0(4)
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
L103     EQU   *
         N     2,=F'4'
         LTR   2,2
         BE    L98
         A     4,=F'1'
         SLR   2,2
         IC    2,0(4)
         AR    2,2
         LH    2,0(2,7)
         B     L103
L98      EQU   *
         MVC   88(4,13),=A(LC45)
         ST    5,92(13)
         LR    3,4
         SR    3,5
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         CLI   0(4),75
         BNE   L61
         L     3,=V(ZZZ@2096)
         SLR   2,2
         IC    2,1(4)
         AR    2,2
         LH    2,0(2,3)
         N     2,=F'4'
         LTR   2,2
         BNE   L62
         MVC   88(4,13),=A(LC18)
         MVC   92(4,13),=F'281'
         B     L108
L62      EQU   *
         A     4,=F'1'
         LR    5,4
L104     EQU   *
         SLR   2,2
         IC    2,0(4)
         AR    2,2
         LH    2,0(2,3)
         N     2,=F'4'
         LTR   2,2
         BE    L100
         A     4,=F'1'
         B     L104
L100     EQU   *
         MVC   88(4,13),=A(LC46)
         ST    5,92(13)
         LR    2,4
         SR    2,5
         ST    2,96(13)
         B     L105
L61      EQU   *
         MVC   88(4,13),=A(LC46)
         MVC   92(4,13),=A(LC47)
         MVC   96(4,13),=F'1'
L105     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BE    L68
         CLM   2,1,=XL1'40'
         BE    L68
         CLM   2,1,=XL1'60'
         BE    L68
         MVC   88(4,13),=A(LC18)
         MVC   92(4,13),=F'291'
L108     EQU   *
         MVC   96(4,13),=A(LC19)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L68      EQU   *
         LA    1,88(,13)
         L     15,=V(C@STDDEF)
         BALR  14,15
         L     2,0(8)
         N     2,=F'2'
         LTR   2,2
         BE    L69
         ST    6,88(13)
         MVC   92(4,13),=A(LC48)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
         L     2,=V(ZZZ@2017)
         L     2,0(2)
         LTR   2,2
         BE    L69
         ST    6,88(13)
         MVC   92(4,13),=A(LC49)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L69      EQU   *
         L     2,=V(FLAG@EXC)
         L     2,0(2)
         LTR   2,2
         BE    L73
         ST    6,88(13)
         MVC   92(4,13),=A(LC50)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L73      EQU   *
         L     2,=V(FLAG@ABI)
         L     2,0(2)
         LTR   2,2
         BNE   L74
         MVC   88(4,13),=A(LC51)
         MVC   92(4,13),=F'999999'
         B     L106
L74      EQU   *
         LA    3,1(0,0)
         CLR   2,3
         BNE   L76
         MVC   88(4,13),=A(LC51)
         MVC   92(4,13),=F'102'
         B     L106
L76      EQU   *
         MVC   88(4,13),=A(LC51)
         A     2,=F'1000'
         ST    2,92(13)
L106     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),=A(LC52)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
         MVC   88(4,13),=A(LC53)
         L     2,=V(ZZZ@1483)
         MVC   92(4,13),4(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         MVC   88(4,13),=A(LC54)
         MVC   92(4,13),12(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         MVC   88(4,13),=A(LC55)
         MVC   92(4,13),20(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         MVC   88(4,13),=A(LC56)
         MVC   92(4,13),28(2)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         MVC   88(4,13),=A(LC57)
         MVC   92(4,13),36(2)
         MVC   96(4,13),=F'2'
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         MVC   88(4,13),=A(LC58)
         L     3,=V(C@GLOBAL)
         MVC   92(4,13),0(3)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         L     2,0(2)
         MVC   88(4,13),=A(LC59)
         L     2,32(2)
         SRL   2,23
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         MVC   88(4,13),=A(LC60)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         MVC   88(4,13),=A(LC61)
         MVC   92(4,13),=A(LC62)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),116(2)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         MVC   88(4,13),=A(LC63)
         MVC   92(4,13),=A(LC12)
         MVC   96(4,13),120(2)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         MVC   88(4,13),=A(LC64)
         MVC   92(4,13),=A(LC14)
         MVC   96(4,13),124(2)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         MVC   88(4,13),=A(LC65)
         MVC   92(4,13),=A(LC12)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@100)
         BALR  14,15
         MVC   88(4,13),=A(LC66)
         L     2,=V(USER@LAB)
         MVC   92(4,13),0(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@100)
         BALR  14,15
         MVC   88(4,13),=A(LC67)
         MVC   92(4,13),=V(VERSION@)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(ZZZ@100)
         BALR  14,15
         L     2,=V(ZZZ@1619)
         L     2,0(2)
         LTR   2,2
         BE    L81
         ST    6,88(13)
         MVC   92(4,13),=A(LC68)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L81      EQU   *
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BE    L82
         ST    6,88(13)
         MVC   92(4,13),=A(LC69)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L82      EQU   *
         LA    1,88(,13)
         L     15,=V(FAST@MAT)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L83
         ST    6,88(13)
         MVC   92(4,13),=A(LC70)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L83      EQU   *
         L     2,=V(FLAG@REA)
         L     2,0(2)
         LTR   2,2
         BE    L84
         ST    6,88(13)
         MVC   92(4,13),=A(LC71)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L84      EQU   *
         L     2,=V(ZZZ@805)
         L     2,0(2)
         LTR   2,2
         BE    L85
         ST    6,88(13)
         MVC   92(4,13),=A(LC72)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L85      EQU   *
         L     2,=V(FLAG@FIN)
         L     2,0(2)
         LTR   2,2
         BE    L86
         ST    6,88(13)
         MVC   92(4,13),=A(LC73)
         B     L107
L86      EQU   *
         ST    6,88(13)
         MVC   92(4,13),=A(LC74)
L107     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
         L     2,=V(ZZZ@752)
         L     2,0(2)
         LTR   2,2
         BE    L88
         ST    6,88(13)
         MVC   92(4,13),=A(LC75)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L88      EQU   *
         L     2,=V(ZZZ@807)
         L     2,0(2)
         LTR   2,2
         BNE   L89
         ST    6,88(13)
         MVC   92(4,13),=A(LC76)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L89      EQU   *
         L     2,0(8)
         N     2,=F'2'
         LTR   2,2
         BE    L90
         L     2,0(3)
         L     2,8(2)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BE    L90
         ST    6,88(13)
         MVC   92(4,13),=A(LC77)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L90      EQU   *
         L     2,0(8)
         N     2,=F'1'
         LTR   2,2
         BE    L91
         L     2,=V(FLAG@NEX)
         L     2,0(2)
         LTR   2,2
         BE    L91
         ST    6,88(13)
         MVC   92(4,13),=A(LC78)
         LA    1,88(,13)
         L     15,=V(ZZZ@253)
         BALR  14,15
L91      EQU   *
         MVC   88(4,13),=A(LC79)
         LA    1,88(,13)
         L     15,=A(ZZZ@99)
         BALR  14,15
         MVC   88(4,13),=A(LC80)
         LA    1,88(,13)
         L     15,=A(ZZZ@99)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),=A(LC81)
         LA    1,88(,13)
         L     15,=V(CPP@ASSE)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),=A(LC82)
         LA    1,88(,13)
         L     15,=V(CPP@ASSE)
         BALR  14,15
         MVC   88(4,13),=A(LC83)
         LA    1,88(,13)
         L     15,=A(ZZZ@99)
         BALR  14,15
         MVC   88(4,13),=A(LC84)
         LA    1,88(,13)
         L     15,=A(ZZZ@99)
         BALR  14,15
         MVC   88(4,13),=A(LC85)
         LA    1,88(,13)
         L     15,=A(ZZZ@99)
         BALR  14,15
         MVC   88(4,13),=A(LC86)
         LA    1,88(,13)
         L     15,=A(ZZZ@99)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),=A(LC87)
         LA    1,88(,13)
         L     15,=V(CPP@ASSE)
         BALR  14,15
L45      EQU   *
* Function c_cpp_builtins epilogue
         PDPEPIL
* Function c_cpp_builtins literal pool
         DS    0F
         LTORG
* Function c_cpp_builtins page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
         END
