         COPY  PDPTOP
         CSECT
* X-var ZZZ_200
         ENTRY ZZZ@200
* Program data area
         DS    0F
ZZZ@200  EQU   *
         DC    F'0'
* Program text area
LC0      EQU   *
         DC    C'`%s'' has an incomplete type'
         DC    X'0'
LC1      EQU   *
         DC    C'struct'
         DC    X'0'
LC2      EQU   *
         DC    C'union'
         DC    X'0'
LC3      EQU   *
         DC    C'enum'
         DC    X'0'
LC4      EQU   *
         DC    C'invalid use of void expression'
         DC    X'0'
LC5      EQU   *
         DC    C'invalid use of flexible array member'
         DC    X'0'
LC6      EQU   *
         DC    C'invalid use of array with unspecified bounds'
         DC    X'0'
LC7      EQU   *
         DC    C'<stdin>'
         DC    X'0'
LC8      EQU   *
         DC    C'?'
         DC    X'0'
LC9      EQU   *
         DC    C'invalid use of undefined type `%s %s'''
         DC    X'0'
LC10     EQU   *
         DC    C'invalid use of incomplete typedef `%s'''
         DC    X'0'
         DS    0F
* X-func c_incomplete_type_error prologue
C@INCOMP PDPPRLG CINDEX=0,FRAME=104,BASER=12,ENTRY=YES
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function c_incomplete_type_error code
         L     3,0(11)
         L     15,4(11)
         IC    2,8(15)
         CLM   2,1,=XL1'00'
         BE    L1
         LTR   3,3
         BE    L5
         IC    4,8(3)
         LA    2,222(,4)
         CLM   2,1,=XL1'01'
         BH    L5
         MVC   88(4,13),=A(LC0)
         L     2,44(3)
         B     L19
L5       EQU   *
         SLR   2,2
         IC    2,8(15)
         LA    3,18(0,0)
         CLR   2,3
         BE    L11
         BH    L15
         LA    4,5(0,0)
         CLR   2,4
         BE    L10
         LA    3,10(0,0)
         CLR   2,3
         BE    L9
         B     L14
L15      EQU   *
         L     3,=A(LC1)
         LA    4,20(0,0)
         CLR   2,4
         BE    L6
         LA    3,21(0,0)
         CLR   2,3
         BNE   L14
         L     3,=A(LC2)
         B     L6
L9       EQU   *
         L     3,=A(LC3)
         B     L6
L10      EQU   *
         MVC   88(4,13),=A(LC4)
         B     L18
L11      EQU   *
         L     2,12(15)
         LTR   2,2
         BE    L12
         L     2,60(2)
         LTR   2,2
         BNE   L13
         MVC   88(4,13),=A(LC5)
         B     L18
L13      EQU   *
         L     15,4(15)
         B     L5
L12      EQU   *
         MVC   88(4,13),=A(LC6)
         B     L18
L14      EQU   *
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'163'
         MVC   96(4,13),=A(LC8)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L6       EQU   *
         L     2,52(15)
         CLI   8(2),1
         BNE   L16
         MVC   88(4,13),=A(LC9)
         ST    3,92(13)
         L     2,52(15)
         MVC   96(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L1
L16      EQU   *
         MVC   88(4,13),=A(LC10)
         L     2,52(15)
         L     2,44(2)
L19      EQU   *
         MVC   92(4,13),12(2)
L18      EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L1       EQU   *
* Function c_incomplete_type_error epilogue
         PDPEPIL
* Function c_incomplete_type_error literal pool
         DS    0F
         LTORG
* Function c_incomplete_type_error page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         DS    0F
* X-func require_complete_type prologue
REQUIRE@ PDPPRLG CINDEX=1,FRAME=96,BASER=12,ENTRY=YES
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function require_complete_type code
         L     4,0(11)
         L     3,4(4)
         L     5,=V(GLOBAL@T)
         L     15,0(5)
         CLR   4,15
         BE    L20
         CLR   3,15
         BE    L20
         L     2,16(3)
         LR    15,4
         LTR   2,2
         BNE   L20
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(C@INCOMP)
         BALR  14,15
         L     15,0(5)
L20      EQU   *
* Function require_complete_type epilogue
         PDPEPIL
* Function require_complete_type literal pool
         DS    0F
         LTORG
* Function require_complete_type page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* X-func c_type_promotes_to prologue
C@TYPE@P PDPPRLG CINDEX=2,FRAME=96,BASER=12,ENTRY=YES
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function c_type_promotes_to code
         L     3,0(11)
         L     15,=V(GLOBAL@T)
         L     2,68(3)
         CL    2,116(15)
         BNE   L25
         L     2,120(15)
         B     L24
L25      EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(C@PROMOT)
         BALR  14,15
         LR    2,3
         CLM   15,1,=XL1'00'
         BE    L24
         L     2,8(3)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BE    L27
         L     2,32(3)
         SRL   2,23
         L     15,=V(ZZZ@1483)
         L     3,20(15)
         L     3,32(3)
         SRL   3,23
         CLR   2,3
         BNE   L27
         L     2,24(15)
         B     L24
L27      EQU   *
         L     2,=V(ZZZ@1483)
         L     2,20(2)
L24      EQU   *
         LR    15,2
* Function c_type_promotes_to epilogue
         PDPEPIL
* Function c_type_promotes_to literal pool
         DS    0F
         LTORG
* Function c_type_promotes_to page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
         DS    0F
* Function qualify_type,F1 prologue
@@F1     PDPPRLG CINDEX=3,FRAME=96,BASER=12,ENTRY=NO
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function qualify_type code
         L     3,0(11)
         L     5,4(11)
         ST    3,88(13)
         L     4,8(3)
         SRL   4,19
         LR    2,4
         SRL   2,0
         N     2,=F'2'
         N     4,=F'1'
         OR    4,2
         L     2,32(3)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         L     3,8(5)
         SRL   3,19
         LR    2,3
         SRL   2,0
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         OR    4,3
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(C@BUILD@)
         BALR  14,15
* Function qualify_type epilogue
         PDPEPIL
* Function qualify_type literal pool
         DS    0F
         LTORG
* Function qualify_type page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
         DS    0F
* Function type_lists_compatible_p,F6 prologue
@@F6     PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=NO
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function type_lists_compatible_p code
         L     6,0(11)
         L     5,4(11)
         L     8,8(11)
         LA    9,1(0,0)
         SLR   7,7
L30      EQU   *
         LTR   6,6
         BNE   L66
         LR    15,9
         LTR   5,5
         BE    L29
         B     L54
L66      EQU   *
         LTR   5,5
         BE    L54
         L     4,16(6)
         LTR   4,4
         BNE   L35
         MVC   88(4,13),16(5)
         LA    1,88(,13)
         L     15,=A(C@TYPE@P)
         BALR  14,15
         CL    15,16(5)
         BE    L37
         LR    15,4
         B     L29
L35      EQU   *
         L     3,16(5)
         LTR   3,3
         BNE   L38
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(C@TYPE@P)
         BALR  14,15
         CL    15,16(6)
         BE    L37
         LR    15,3
         B     L29
L38      EQU   *
         IC    2,8(4)
         CLM   2,1,=XL1'00'
         BE    L37
         IC    2,8(3)
         CLM   2,1,=XL1'00'
         BE    L37
         MVC   88(4,13),68(4)
         L     2,16(5)
         MVC   92(4,13),68(2)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNE   L37
         L     15,16(6)
         CLI   8(15),21
         BNE   L45
         L     2,52(15)
         LTR   2,2
         BE    L46
         L     2,32(15)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         BE    L45
L46      EQU   *
         L     2,16(15)
         CLI   8(2),25
         BNE   L45
         ST    2,88(13)
         L     2,16(5)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L45
         L     2,16(6)
         L     2,12(2)
L67      EQU   *
         LTR   2,2
         BE    L57
         MVC   88(4,13),4(2)
         MVC   92(4,13),16(5)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BNE   L57
         L     2,0(2)
         B     L67
L45      EQU   *
         L     15,16(5)
         CLI   8(15),21
         BNE   L54
         L     2,52(15)
         LTR   2,2
         BE    L55
         L     2,32(15)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         BE    L54
L55      EQU   *
         L     2,16(15)
         CLI   8(2),25
         BNE   L54
         ST    2,88(13)
         L     2,16(6)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L54
         L     2,16(5)
         L     2,12(2)
L68      EQU   *
         LTR   2,2
         BE    L57
         MVC   88(4,13),4(2)
         MVC   92(4,13),16(6)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BNE   L57
         L     2,0(2)
         B     L68
L57      EQU   *
         LTR   2,2
         BNE   L37
         LR    15,2
         B     L29
L54      EQU   *
         SLR   15,15
         B     L29
L37      EQU   *
         CR    7,9
         BNH   L63
         LR    9,7
L63      EQU   *
         L     6,0(6)
         L     5,0(5)
         B     L30
L29      EQU   *
* Function type_lists_compatible_p epilogue
         PDPEPIL
* Function type_lists_compatible_p literal pool
         DS    0F
         LTORG
* Function type_lists_compatible_p page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
LC11     EQU   *
         DC    C'function return types not compatible due to `vol'
         DC    C'atile'''
         DC    X'0'
         DS    0F
* X-func comptypes prologue
COMPTYPE PDPPRLG CINDEX=5,FRAME=144,BASER=12,ENTRY=YES
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function comptypes code
         L     4,4(11)
         L     9,8(11)
         L     5,0(11)
         LR    7,4
         CLR   5,4
         BE    L72
         LTR   5,5
         BE    L72
         LTR   4,4
         BE    L72
         IC    2,8(5)
         CLM   2,1,=XL1'00'
         BE    L72
         IC    3,8(4)
         CLM   3,1,=XL1'00'
         BNE   L71
L72      EQU   *
         LA    15,1(0,0)
         L     14,=A(L70)
         BR    14
L71      EQU   *
         CLM   2,1,=XL1'06'
         BNE   L73
         L     2,32(5)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         BE    L73
         L     2,12(5)
         LTR   2,2
         BE    L73
         LR    5,2
L73      EQU   *
         CLM   3,1,=XL1'06'
         BNE   L74
         L     2,32(4)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         BE    L74
         L     2,12(4)
         LTR   2,2
         BE    L74
         LR    7,2
L74      EQU   *
         IC    2,8(5)
         CLM   2,1,=XL1'0A'
         BNE   L75
         CLI   8(7),10
         BE    L75
         L     2,32(5)
         SRL   2,23
         ST    2,88(13)
         L     2,8(5)
         SRL   2,18
         N     2,=F'1'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@325)
         BALR  14,15
         LR    5,15
         B     L76
L75      EQU   *
         CLI   8(7),10
         BNE   L76
         CLM   2,1,=XL1'0A'
         BE    L76
         L     3,32(7)
         SRL   3,23
         ST    3,88(13)
         L     2,8(7)
         SRL   2,18
         N     2,=F'1'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@325)
         BALR  14,15
         LR    7,15
L76      EQU   *
         LA    15,1(0,0)
         CLR   5,7
         L     14,=A(L70)
         BER   14
         SLR   15,15
         CLC   8(1,5),8(7)
         L     14,=A(L70)
         BNER  14
         L     4,8(5)
         SRL   4,19
         LR    2,4
         SRL   2,0(15)
         N     2,=F'2'
         N     4,=F'1'
         OR    4,2
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         L     3,8(7)
         SRL   3,19
         LR    2,3
         SRL   2,0(15)
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(7)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         CLR   4,3
         L     14,=A(L70)
         BNER  14
         L     2,68(5)
         LA    15,1(0,0)
         CL    2,68(7)
         L     14,=A(L70)
         BER   14
         L     4,=V(TARGETM)
         ST    5,88(13)
         ST    7,92(13)
         L     2,220(4)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         ST    15,136(13)
         LTR   15,15
         L     14,=A(L70)
         BER   14
         SLR   8,8
         SLR   3,3
         IC    3,8(5)
         A     3,=F'-9'
         LA    15,14(0,0)
         CLR   3,15
         L     14,=A(L83)
         BHR   14
         SLL   3,2
         L     2,=A(L204)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
L204     EQU   *
         DC    A(L200)
         DC    A(L222)
         DC    A(L83)
         DC    A(L83)
         DC    A(L84)
         DC    A(L83)
         DC    A(L83)
         DC    A(L83)
         DC    A(L83)
         DC    A(L103)
         DC    A(L83)
         DC    A(L118)
         DC    A(L222)
         DC    A(L83)
         DC    A(L89)
L84      EQU   *
         L     2,=V(C@LANGUA)
         L     2,0(2)
         N     2,=F'1'
         LTR   2,2
         BE    L85
         ST    5,88(13)
         ST    7,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(OBJC@COM)
         BALR  14,15
         LR    8,15
         LTR   15,15
         L     14,=A(L83)
         BNLR  14
L85      EQU   *
         L     15,4(5)
         LA    8,1(0,0)
         CL    15,4(7)
         L     14,=A(L83)
         BER   14
         ST    15,88(13)
         MVC   92(4,13),4(7)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         B     L233
L89      EQU   *
         L     4,4(5)
         L     6,4(7)
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L90
         L     3,8(4)
         SRL   3,20
         N     3,=F'1'
         L     2,8(6)
         SRL   2,20
         N     2,=F'1'
         CLR   3,2
         BE    L90
         MVC   88(4,13),=A(LC11)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L90      EQU   *
         L     2,8(4)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BE    L91
         MVC   88(4,13),68(4)
         L     3,8(4)
         SRL   3,19
         N     3,=F'1'
         L     2,32(4)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(BUILD@QU)
         BALR  14,15
         LR    4,15
L91      EQU   *
         L     2,8(6)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BE    L92
         MVC   88(4,13),68(6)
         L     3,8(6)
         SRL   3,19
         N     3,=F'1'
         L     2,32(6)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(BUILD@QU)
         BALR  14,15
         LR    6,15
L92      EQU   *
         ST    4,88(13)
         ST    6,92(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LR    6,15
         LR    2,15
         LTR   15,15
         BE    L94
         L     3,12(5)
         L     4,12(7)
         LTR   3,3
         BNE   L95
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SELF@PRO)
         BALR  14,15
         LR    2,3
         LTR   15,15
         BE    L94
         L     2,72(5)
         LTR   2,2
         BE    L224
         ST    4,88(13)
         MVC   92(4,13),72(5)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BE    L224
         B     L235
L95      EQU   *
         LTR   4,4
         BNE   L98
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SELF@PRO)
         BALR  14,15
         LR    2,4
         LTR   15,15
         BE    L94
         L     2,72(7)
         LTR   2,2
         BE    L224
         ST    3,88(13)
         MVC   92(4,13),72(7)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         LA    3,1(0,0)
         CLR   15,3
         BE    L224
L235     EQU   *
         LA    6,2(0,0)
         B     L224
L98      EQU   *
         ST    3,88(13)
         ST    4,92(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         LR    2,15
         LA    15,1(0,0)
         CLR   2,15
         BNE   L94
L224     EQU   *
         LR    2,6
L94      EQU   *
         LR    8,2
         L     14,=A(L83)
         BR    14
L103     EQU   *
         L     3,12(5)
         L     4,12(7)
         LA    8,1(0,0)
         L     15,4(5)
         CL    15,4(7)
         BE    L104
         ST    15,88(13)
         MVC   92(4,13),4(7)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LR    8,15
         LTR   8,8
         L     14,=A(L70)
         BER   14
L104     EQU   *
         LTR   3,3
         L     14,=A(L83)
         BER   14
         LTR   4,4
         L     14,=A(L83)
         BER   14
         CLR   3,4
         L     14,=A(L83)
         BER   14
         SLR   15,15
         L     5,60(3)
         LTR   5,5
         BNE   L107
         LA    15,1(0,0)
L107     EQU   *
         SLR   7,7
         L     6,60(4)
         LTR   6,6
         BNE   L108
         LA    7,1(0,0)
L108     EQU   *
         SLR   9,9
         STC   9,80(,13)
         CLM   15,1,80(13)
         BNE   L109
         L     2,56(3)
         CLI   8(2),25
         BNE   L110
         CLI   8(5),25
         BE    L109
L110     EQU   *
         LA    9,1(0,0)
L109     EQU   *
         SLR   5,5
         STC   5,80(,13)
         CLM   7,1,80(13)
         BNE   L111
         L     2,56(4)
         CLI   8(2),25
         BNE   L112
         CLI   8(6),25
         BE    L111
L112     EQU   *
         LA    5,1(0,0)
L111     EQU   *
         CLM   9,1,=XL1'00'
         L     14,=A(L83)
         BNER  14
         CLM   5,1,=XL1'00'
         L     14,=A(L83)
         BNER  14
         CLM   15,1,=XL1'00'
         BE    L115
         CLM   7,1,=XL1'00'
         L     14,=A(L83)
         BNER  14
L115     EQU   *
         CLM   15,1,=XL1'00'
         BNE   L117
         CLM   7,1,=XL1'00'
         BNE   L117
         MVC   88(4,13),56(3)
         MVC   92(4,13),56(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L117
         MVC   88(4,13),60(3)
         MVC   92(4,13),60(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         L     14,=A(L83)
         BNER  14
L117     EQU   *
         SLR   8,8
         L     14,=A(L83)
         BR    14
L118     EQU   *
         L     2,=V(C@LANGUA)
         L     2,0(2)
         N     2,=F'1'
         LTR   2,2
         BE    L222
         ST    5,88(13)
         ST    7,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(OBJC@COM)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BNE   L222
L233     EQU   *
         LR    8,15
         L     14,=A(L83)
         BR    14
L222     EQU   *
         LR    6,5
         LR    4,7
         LTR   5,5
         BE    L124
         CLI   8(5),39
         BE    L124
L131     EQU   *
         SLR   3,3
         IC    3,8(6)
         L     2,=V(ZZZ@1978)
         SLR   15,15
         IC    15,0(2,3)
         LR    2,15
         LA    3,132(0,0)
         CR    15,3
         BE    L126
         BH    L130
         LA    15,130(0,0)
         CLR   2,15
         BE    L128
         B     L129
L130     EQU   *
         LA    3,163(0,0)
         CLR   15,3
         BE    L127
         B     L129
L126     EQU   *
         L     6,48(6)
         B     L123
L127     EQU   *
         L     6,76(6)
         B     L123
L128     EQU   *
         L     6,24(6)
         B     L123
L129     EQU   *
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'644'
         L     14,=A(L234)
         BR    14
L123     EQU   *
         LTR   6,6
         BE    L124
         CLI   8(6),39
         BNE   L131
L124     EQU   *
         LTR   7,7
         BE    L133
         CLI   8(7),39
         BE    L133
L140     EQU   *
         SLR   3,3
         IC    3,8(4)
         L     2,=V(ZZZ@1978)
         SLR   15,15
         IC    15,0(2,3)
         LR    2,15
         LA    3,132(0,0)
         CR    15,3
         BE    L135
         BH    L139
         LA    15,130(0,0)
         CLR   2,15
         BE    L137
         B     L138
L139     EQU   *
         LA    3,163(0,0)
         CLR   15,3
         BE    L136
         B     L138
L135     EQU   *
         L     4,48(4)
         B     L132
L136     EQU   *
         L     4,76(4)
         B     L132
L137     EQU   *
         L     4,24(4)
         B     L132
L138     EQU   *
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'653'
         L     14,=A(L234)
         BR    14
L132     EQU   *
         LTR   4,4
         BE    L133
         CLI   8(4),39
         BNE   L140
L133     EQU   *
         CLR   6,4
         L     14,=A(L83)
         BER   14
         LR    6,7
         MVI   140(13),0
         B     L236
L225     EQU   *
         L     2,56(2)
         LTR   2,2
         BE    L144
         L     2,52(5)
         L     5,56(2)
L236     EQU   *
         L     2,52(5)
         LTR   2,2
         BE    L144
         CLI   8(2),33
         BE    L225
L144     EQU   *
         L     15,52(7)
         LTR   15,15
         BE    L147
         CLI   8(15),33
         BNE   L147
         L     2,56(15)
L227     EQU   *
         LTR   2,2
         BE    L147
         L     2,52(6)
         L     6,56(2)
         L     2,52(6)
         LTR   2,2
         BE    L147
         CLI   8(2),33
         BNE   L147
         L     2,56(2)
         B     L227
L147     EQU   *
         L     2,=V(ZZZ@754)
         L     2,0(2)
         LTR   2,2
         BE    L149
         L     2,52(5)
         SLR   4,4
         CL    2,52(6)
         L     14,=A(L150)
         BNER  14
L149     EQU   *
         L     2,16(5)
         LTR   2,2
         L     14,=A(L220)
         BER   14
         L     2,16(6)
         LTR   2,2
         L     14,=A(L220)
         BER   14
         L     7,=A(@@V1)
         L     3,0(7)
L228     EQU   *
         LTR   3,3
         BE    L213
         L     2,4(3)
         CLR   2,5
         BNE   L155
         L     2,8(3)
         CLR   2,6
         L     14,=A(L220)
         BER   14
L155     EQU   *
         L     3,0(3)
         B     L228
L213     EQU   *
         SLR   2,2
         IC    2,8(5)
         LA    15,20(0,0)
         CLR   2,15
         BE    L185
         BH    L199
         LA    3,10(0,0)
         CLR   2,3
         BE    L159
         L     14,=A(L198)
         BR    14
L199     EQU   *
         LA    15,21(0,0)
         CLR   2,15
         BE    L167
         L     14,=A(L198)
         BR    14
L159     EQU   *
         MVC   88(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(LIST@LEN)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),12(6)
         LA    1,88(,13)
         L     15,=V(LIST@LEN)
         BALR  14,15
         SLR   4,4
         CLR   2,15
         L     14,=A(L150)
         BNER  14
         L     4,12(5)
L229     EQU   *
         LTR   4,4
         L     14,=A(L220)
         BER   14
         MVC   88(4,13),12(4)
         MVC   92(4,13),12(6)
         LA    1,88(,13)
         L     15,=V(PURPOSE@)
         BALR  14,15
         LTR   15,15
         L     14,=A(L221)
         BER   14
         MVC   88(4,13),16(4)
         MVC   92(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         L     14,=A(L221)
         BNER  14
         L     4,0(4)
         B     L229
L167     EQU   *
         MVC   88(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(LIST@LEN)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),12(6)
         LA    1,88(,13)
         L     15,=V(LIST@LEN)
         BALR  14,15
         SLR   4,4
         CLR   2,15
         L     14,=A(L150)
         BNER  14
         L     4,12(5)
         LTR   4,4
         L     14,=A(L220)
         BER   14
L182     EQU   *
         SLR   8,8
         L     7,=A(@@V1)
         MVC   104(4,13),0(7)
         ST    5,108(13)
         ST    6,112(13)
         LR    3,13
         A     3,=F'104'
         ST    3,0(7)
         L     2,44(4)
         LTR   2,2
         BE    L172
         L     3,12(6)
L230     EQU   *
         LTR   3,3
         BE    L172
         CL    2,44(3)
         BNE   L175
         MVC   88(4,13),4(4)
         MVC   92(4,13),4(3)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BE    L172
         LA    2,2(0,0)
         CLR   15,2
         BNE   L178
         MVI   140(13),1
L178     EQU   *
         CLI   8(4),37
         BNE   L179
         MVC   88(4,13),84(4)
         MVC   92(4,13),84(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LA    3,1(0,0)
         CLR   15,3
         BNE   L172
L179     EQU   *
         LA    8,1(0,0)
         B     L172
L175     EQU   *
         L     3,0(3)
         B     L230
L172     EQU   *
         MVC   0(4,7),104(13)
         CLM   8,1,=XL1'00'
         BE    L221
         L     4,0(4)
         LTR   4,4
         BNE   L182
         LA    4,2(0,0)
         IC    15,140(13)
         CLM   15,1,=XL1'00'
         BNE   L150
         B     L220
L185     EQU   *
         MVC   120(4,13),0(7)
         ST    5,124(13)
         ST    6,128(13)
         LR    2,13
         A     2,=F'120'
         ST    2,0(7)
         L     4,12(5)
         L     3,12(6)
         B     L232
L231     EQU   *
         LTR   3,3
         BE    L187
         CLC   8(1,4),8(3)
         BNE   L187
         L     2,44(4)
         CL    2,44(3)
         BNE   L187
         MVC   88(4,13),4(4)
         MVC   92(4,13),4(3)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BE    L187
         LA    2,2(0,0)
         CLR   15,2
         BNE   L192
         MVI   140(13),1
L192     EQU   *
         CLI   8(4),37
         BNE   L188
         MVC   88(4,13),84(4)
         MVC   92(4,13),84(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BNE   L187
L188     EQU   *
         L     4,0(4)
         L     3,0(3)
L232     EQU   *
         LTR   4,4
         BNE   L231
L187     EQU   *
         MVC   0(4,7),120(13)
         LTR   4,4
         BE    L195
         SLR   4,4
         LTR   3,3
         BNE   L150
L195     EQU   *
         SLR   4,4
         IC    4,140(13)
         X     4,=F'1'
         LA    3,2(0,0)
         SR    3,4
         LR    4,3
         B     L150
L198     EQU   *
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'812'
L234     EQU   *
         MVC   96(4,13),=A(LC8)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L221     EQU   *
         SLR   4,4
         B     L150
L220     EQU   *
         LA    4,1(0,0)
L150     EQU   *
         LR    8,4
         B     L83
L200     EQU   *
         SLR   8,8
         ST    5,88(13)
         L     2,308(4)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L202
         ST    7,88(13)
         L     2,308(4)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L83
L202     EQU   *
         LA    8,1(0,0)
L83      EQU   *
         L     2,136(13)
         LA    15,2(0,0)
         CLR   2,15
         BNE   L207
         LR    15,2
         LA    3,1(0,0)
         CLR   8,3
         BE    L70
L207     EQU   *
         LR    15,8
L70      EQU   *
* Function comptypes epilogue
         PDPEPIL
* Function comptypes literal pool
         DS    0F
         LTORG
* Function comptypes page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
LC12     EQU   *
         DC    C'types are not quite compatible'
         DC    X'0'
         DS    0F
* Function comp_target_types,F2 prologue
@@F2     PDPPRLG CINDEX=6,FRAME=104,BASER=12,ENTRY=NO
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function comp_target_types code
         L     2,0(11)
         L     4,4(11)
         ST    2,88(13)
         ST    4,92(13)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(OBJC@COM)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNL   L237
         L     2,4(2)
         MVC   88(4,13),68(2)
         L     2,4(4)
         MVC   92(4,13),68(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LR    3,15
         LA    2,2(0,0)
         CLR   15,2
         BNE   L237
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L237
         MVC   88(4,13),=A(LC12)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L237     EQU   *
         LR    15,3
* Function comp_target_types epilogue
         PDPEPIL
* Function comp_target_types literal pool
         DS    0F
         LTORG
* Function comp_target_types page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
LC13     EQU   *
         DC    C'function types not truly compatible in ISO C'
         DC    X'0'
         DS    0F
* X-func common_type prologue
COMMON@T PDPPRLG CINDEX=7,FRAME=104,BASER=12,ENTRY=YES
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function common_type code
         L     4,0(11)
         L     5,4(11)
         LR    15,4
         CLR   4,5
         L     14,=A(L240)
         BER   14
         L     3,=V(GLOBAL@T)
         L     2,0(3)
         LR    15,5
         CLR   4,2
         L     14,=A(L240)
         BER   14
         LR    15,4
         CLR   5,2
         L     14,=A(L240)
         BER   14
         ST    4,88(13)
         ST    5,92(13)
         L     2,=V(TARGETM)
         L     2,212(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    9,15
         CLI   8(4),10
         BNE   L244
         L     4,32(4)
         SRL   4,23
         ST    4,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@325)
         BALR  14,15
         LR    4,15
L244     EQU   *
         CLI   8(5),10
         BNE   L245
         L     5,32(5)
         SRL   5,23
         ST    5,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@325)
         BALR  14,15
         LR    5,15
L245     EQU   *
         L     15,8(4)
         LR    3,15
         SRL   3,24
         L     8,8(5)
         LR    6,8
         SRL   6,24
         LA    7,8(0,0)
         CLR   3,7
         BE    L247
         CLR   6,7
         BNE   L246
L247     EQU   *
         LR    7,4
         LA    8,8(0,0)
         CLR   3,8
         BNE   L249
         L     7,4(4)
L249     EQU   *
         LR    2,5
         LA    8,8(0,0)
         CLR   6,8
         BNE   L251
         L     2,4(5)
L251     EQU   *
         ST    7,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         LA    2,8(0,0)
         CLR   3,2
         BNE   L253
         L     2,4(4)
         CLR   2,15
         L     14,=A(L312)
         BER   14
L253     EQU   *
         LA    3,8(0,0)
         CLR   6,3
         BNE   L255
         L     2,4(5)
         CLR   2,15
         BNE   L255
         ST    5,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@96)
         BALR  14,15
         L     14,=A(L240)
         BR    14
L255     EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@65)
         BALR  14,15
         B     L326
L246     EQU   *
         LA    7,13(0,0)
         CLR   3,7
         BE    L276
         BH    L313
         LR    2,3
         A     2,=F'-6'
         LA    7,1(0,0)
         CLR   2,7
         L     14,=A(L312)
         BHR   14
         B     L259
L313     EQU   *
         LA    8,18(0,0)
         CLR   3,8
         BE    L277
         LA    2,23(0,0)
         CLR   3,2
         BE    L282
         L     14,=A(L312)
         BR    14
L259     EQU   *
         LA    7,7(0,0)
         CLR   3,7
         BNE   L260
         CLR   6,7
         BNE   L312
L260     EQU   *
         LA    2,7(0,0)
         CLR   6,2
         BNE   L261
         CR    3,2
         BNE   L329
L261     EQU   *
         L     3,32(4)
         SRL   3,23
         L     2,32(5)
         SRL   2,23
         CR    3,2
         BH    L312
         CR    2,3
         BH    L329
         L     2,=V(ZZZ@1483)
         L     6,68(4)
         L     7,32(2)
         CLR   6,7
         BE    L266
         L     3,68(5)
         CLR   3,7
         BNE   L265
L266     EQU   *
         ST    7,88(13)
L331     EQU   *
         L     2,8(4)
         SRL   2,19
         LR    3,2
         SRL   3,0
         N     3,=F'2'
         N     2,=F'1'
         OR    2,3
         L     3,32(4)
         SRL   3,8
         N     3,=F'4'
         OR    2,3
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(BUILD@QU)
         BALR  14,15
L326     EQU   *
         ST    15,88(13)
         B     L324
L265     EQU   *
         L     2,28(2)
         CLR   6,2
         BE    L268
         CLR   3,2
         BNE   L267
L268     EQU   *
         SRL   15,18
         N     15,=F'1'
         LTR   15,15
         BNE   L270
         SRL   8,18
         N     8,=F'1'
         LTR   8,8
         BE    L273
L270     EQU   *
         LR    2,7
         B     L273
L267     EQU   *
         L     7,=V(GLOBAL@T)
         L     2,124(7)
         CLR   6,2
         BE    L273
         CLR   3,2
         BNE   L272
L273     EQU   *
         ST    2,88(13)
         B     L331
L272     EQU   *
         SRL   15,18
         N     15,=F'1'
         LTR   15,15
         BNE   L312
         B     L329
L276     EQU   *
         L     3,4(4)
         L     5,4(5)
         MVC   88(4,13),68(3)
         MVC   92(4,13),68(5)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         ST    15,88(13)
         L     4,8(3)
         SRL   4,19
         LR    2,4
         SRL   2,0
         N     2,=F'2'
         N     4,=F'1'
         OR    4,2
         L     2,32(3)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         L     3,8(5)
         SRL   3,19
         LR    2,3
         SRL   2,0
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         OR    4,3
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(C@BUILD@)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@87)
         BALR  14,15
         B     L326
L277     EQU   *
         MVC   88(4,13),4(4)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         CL    15,4(4)
         BNE   L278
         L     2,12(4)
         LTR   2,2
         BNE   L312
L278     EQU   *
         CL    15,4(5)
         BNE   L279
         L     2,12(5)
         LTR   2,2
         BNE   L329
L279     EQU   *
         ST    15,88(13)
         L     2,12(4)
         LR    15,4
         LTR   2,2
         BNE   L281
         LR    15,5
L281     EQU   *
         MVC   92(4,13),12(15)
         LA    1,88(,13)
         L     15,=V(ZZZ@61)
         BALR  14,15
         B     L326
L282     EQU   *
         MVC   88(4,13),4(4)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         LR    8,15
         L     6,12(4)
         L     7,12(5)
         CL    15,4(4)
         BNE   L283
         LTR   7,7
         BE    L312
L283     EQU   *
         CL    8,4(5)
         BNE   L284
         LTR   6,6
         BNE   L284
L329     EQU   *
         ST    5,88(13)
         B     L324
L284     EQU   *
         L     2,12(4)
         LTR   2,2
         BNE   L285
         ST    8,88(13)
         MVC   92(4,13),12(5)
         B     L330
L285     EQU   *
         LTR   7,7
         BNE   L286
         ST    8,88(13)
         MVC   92(4,13),12(4)
L330     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@78)
         BALR  14,15
         B     L326
L286     EQU   *
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PUSHLEVE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@396)
         BALR  14,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(LIST@LEN)
         BALR  14,15
         LR    3,15
         SLR   5,5
         LR    2,5
         CR    5,15
         BNL   L315
L290     EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'0'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         LR    5,15
         A     2,=F'1'
         CR    2,3
         BL    L290
L315     EQU   *
         LR    4,5
L320     EQU   *
         LTR   6,6
         BE    L317
         L     2,16(6)
         LTR   2,2
         BNE   L294
         MVC   16(4,4),16(7)
         B     L293
L294     EQU   *
         L     3,16(7)
         LTR   3,3
         BNE   L296
         ST    2,16(4)
         B     L293
L296     EQU   *
         CLI   8(2),21
         BNE   L297
         CLR   2,3
         BE    L297
         L     2,12(2)
L321     EQU   *
         LTR   2,2
         BE    L297
         MVC   88(4,13),4(2)
         MVC   92(4,13),16(7)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BE    L300
         MVC   16(4,4),16(7)
         B     L325
L300     EQU   *
         L     2,0(2)
         B     L321
L297     EQU   *
         L     2,16(7)
         CLI   8(2),21
         BNE   L304
         CL    2,16(6)
         BE    L304
         L     2,12(2)
L322     EQU   *
         LTR   2,2
         BE    L304
         MVC   88(4,13),4(2)
         MVC   92(4,13),16(6)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BE    L307
         MVC   16(4,4),16(6)
L325     EQU   *
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L293
         MVC   88(4,13),=A(LC13)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
         B     L293
L307     EQU   *
         L     2,0(2)
         B     L322
L304     EQU   *
         MVC   88(4,13),16(6)
         MVC   92(4,13),16(7)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         ST    15,16(4)
L295     EQU   *
L293     EQU   *
         L     6,0(6)
         L     7,0(7)
         L     4,0(4)
         B     L320
L317     EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(POPLEVEL)
         BALR  14,15
         ST    8,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@78)
         BALR  14,15
         LR    4,15
L312     EQU   *
         ST    4,88(13)
L324     EQU   *
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@96)
         BALR  14,15
L240     EQU   *
* Function common_type epilogue
         PDPEPIL
* Function common_type literal pool
         DS    0F
         LTORG
* Function common_type page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
LC14     EQU   *
         DC    C'arithmetic on pointer to an incomplete type'
         DC    X'0'
         DS    0F
* X-func c_size_in_bytes prologue
C@SIZE@I PDPPRLG CINDEX=8,FRAME=104,BASER=12,ENTRY=YES
         B     FEN8
         LTORG
FEN8     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         LR    11,1
         L     10,=A(PGT8)
* Function c_size_in_bytes code
         L     3,0(11)
         SLR   2,2
         IC    2,8(3)
         LA    4,23(0,0)
         CLR   2,4
         BE    L337
         LA    4,5(0,0)
         CLR   2,4
         BE    L337
         LTR   2,2
         BE    L337
         L     2,16(3)
         LTR   2,2
         BNE   L335
         CLI   8(3),5
         BE    L335
         MVC   88(4,13),=A(LC14)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L337     EQU   *
         L     2,=V(GLOBAL@T)
         L     15,64(2)
         B     L332
L335     EQU   *
         L     2,=V(ZZZ@1483)
         L     2,0(2)
         L     2,32(2)
         SRL   2,23
         SRL   2,3
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         MVC   88(4,13),=F'63'
         MVC   92(4,13),20(3)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
L332     EQU   *
* Function c_size_in_bytes epilogue
         PDPEPIL
* Function c_size_in_bytes literal pool
         DS    0F
         LTORG
* Function c_size_in_bytes page table
         DS    0F
PGT8     EQU   *
         DC    A(PG8)
         DS    0F
* X-func decl_constant_value prologue
DECL@CON PDPPRLG CINDEX=9,FRAME=88,BASER=12,ENTRY=YES
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function decl_constant_value code
         L     4,0(11)
         L     2,=V(ZZZ@289)
         L     2,0(2)
         LTR   2,2
         BE    L339
         L     2,8(4)
         N     2,=F'1572864'
         L     3,=F'524288'
         CLR   2,3
         BNE   L339
         L     15,60(4)
         LTR   15,15
         BE    L339
         IC    3,8(15)
         CLM   3,1,=XL1'00'
         BE    L339
         L     2,8(15)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BE    L339
         CLM   3,1,=XL1'2F'
         BNE   L338
L339     EQU   *
         LR    15,4
L338     EQU   *
* Function decl_constant_value epilogue
         PDPEPIL
* Function decl_constant_value literal pool
         DS    0F
         LTORG
* Function decl_constant_value page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
         DS    0F
* Function decl_constant_value_for_broken_optimization,F7 prologue
@@F7     PDPPRLG CINDEX=10,FRAME=96,BASER=12,ENTRY=NO
         B     FEN10
         LTORG
FEN10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         LR    11,1
         L     10,=A(PGT10)
* Function decl_constant_value_for_broken_optimization code
         L     15,0(11)
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BNE   L340
         CLI   28(15),1
         BE    L340
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(DECL@CON)
         BALR  14,15
L340     EQU   *
* Function decl_constant_value_for_broken_optimization epilogue
         PDPEPIL
* Function decl_constant_value_for_broken_optimization literal pool
         DS    0F
         LTORG
* Function decl_constant_value_for_broken_optimization page table
         DS    0F
PGT10    EQU   *
         DC    A(PG10)
         DS    0F
* X-func lvalue_p prologue
LVALUE@P PDPPRLG CINDEX=11,FRAME=96,BASER=12,ENTRY=YES
         B     FEN11
         LTORG
FEN11    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         LR    11,1
         L     10,=A(PGT11)
* Function lvalue_p code
         L     3,0(11)
L349     EQU   *
         SLR   2,2
         IC    2,8(3)
         LA    4,42(0,0)
         CLR   2,4
         BE    L357
         BH    L363
         LA    4,36(0,0)
         CLR   2,4
         BH    L364
         LA    4,34(0,0)
         CLR   2,4
         BNL   L357
         LTR   2,2
         BE    L357
         LA    3,29(0,0)
         B     L366
L364     EQU   *
         LA    4,40(0,0)
         CLR   2,4
         BE    L348
         B     L362
L363     EQU   *
         LA    4,118(0,0)
         CLR   2,4
         BE    L360
         BH    L365
         LA    4,44(0,0)
         CLR   2,4
         BE    L357
         LA    4,53(0,0)
         CLR   2,4
         BE    L360
         B     L362
L365     EQU   *
         LA    4,125(0,0)
         CLR   2,4
         BL    L362
         LA    4,126(0,0)
         CLR   2,4
         BNH   L348
         LA    3,167(0,0)
L366     EQU   *
         CLR   2,3
         BE    L367
         B     L362
L348     EQU   *
         L     3,16(3)
         B     L349
L357     EQU   *
         SLR   15,15
         L     2,4(3)
         IC    2,8(2)
         CLM   2,1,=XL1'17'
         BE    L344
         CLM   2,1,=XL1'10'
         BE    L344
         B     L367
L360     EQU   *
         SLR   15,15
         L     2,4(3)
         CLI   8(2),18
         BNE   L344
L367     EQU   *
         LA    15,1(0,0)
         B     L344
L362     EQU   *
         SLR   15,15
L344     EQU   *
* Function lvalue_p epilogue
         PDPEPIL
* Function lvalue_p literal pool
         DS    0F
         LTORG
* Function lvalue_p page table
         DS    0F
PGT11    EQU   *
         DC    A(PG11)
         DS    0F
* Function lookup_field,F9 prologue
@@F9     PDPPRLG CINDEX=12,FRAME=104,BASER=12,ENTRY=NO
         B     FEN12
         LTORG
FEN12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         LR    11,1
         L     10,=A(PGT12)
* Function lookup_field code
         L     8,4(11)
         L     2,0(11)
         L     2,4(2)
         L     3,84(2)
         L     4,12(2)
         LTR   3,3
         BE    L369
         L     2,0(3)
         LR    7,2
         A     7,=F'4'
         LR    3,4
         SLR   5,5
         L     6,0(2)
         LA    2,1(0,0)
         CR    6,2
         BNH   L371
L383     EQU   *
         LR    15,6
         SR    15,5
         A     15,=F'1'
         SRA   15,1
         AR    15,5
         LR    2,15
         SLL   2,2
         L     3,0(2,7)
         L     2,44(3)
         LTR   2,2
         BNE   L372
         LR    4,5
         SLL   4,2
         L     15,0(4,7)
         L     2,44(15)
         LTR   2,2
         BNE   L398
         AR    4,7
L378     EQU   *
         A     5,=F'1'
         A     4,=F'4'
         LR    3,15
         L     2,4(15)
         IC    2,8(2)
         LA    2,236(,2)
         CLM   2,1,=XL1'01'
         BH    L373
         ST    15,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         LTR   15,15
         BNE   L400
L373     EQU   *
         L     15,0(4)
         L     2,44(15)
         LTR   2,2
         BE    L378
L398     EQU   *
         CR    5,6
         BNH   L370
         SLR   15,15
         B     L368
L372     EQU   *
         CLR   2,8
         BE    L371
         BNL   L381
         LR    5,15
         B     L370
L381     EQU   *
         LR    6,15
L370     EQU   *
         LR    2,6
         SR    2,5
         LA    4,1(0,0)
         CR    2,4
         BH    L383
L371     EQU   *
         SLL   5,2
         L     15,0(5,7)
         L     2,44(15)
         CLR   2,8
         BNE   L384
         LR    3,15
         B     L387
L384     EQU   *
         L     2,44(3)
         SLR   15,15
         CLR   2,8
         BNE   L368
         B     L387
L369     EQU   *
         LR    3,4
L402     EQU   *
         LTR   3,3
         BE    L389
         L     4,44(3)
         LTR   4,4
         BNE   L391
         L     2,4(3)
         IC    2,8(2)
         LA    2,236(,2)
         CLM   2,1,=XL1'01'
         BH    L391
         ST    3,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         LTR   15,15
         BNE   L401
L391     EQU   *
         L     2,44(3)
         CLR   2,8
         BE    L389
         L     3,0(3)
         B     L402
L389     EQU   *
         LR    15,3
         LTR   3,3
         BE    L368
         B     L387
L400     EQU   *
         MVC   88(4,13),=F'0'
         B     L404
L401     EQU   *
         ST    4,88(13)
L404     EQU   *
         ST    3,92(13)
         ST    15,96(13)
         B     L403
L387     EQU   *
         MVC   88(4,13),=F'0'
         ST    3,92(13)
         MVC   96(4,13),=F'0'
L403     EQU   *
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
L368     EQU   *
* Function lookup_field epilogue
         PDPEPIL
* Function lookup_field literal pool
         DS    0F
         LTORG
* Function lookup_field page table
         DS    0F
PGT12    EQU   *
         DC    A(PG12)
LC15     EQU   *
         DC    C'%s has no member named `%s'''
         DC    X'0'
LC16     EQU   *
         DC    C'structure'
         DC    X'0'
LC17     EQU   *
         DC    C'request for member `%s'' in something not a stru'
         DC    C'cture or union'
         DC    X'0'
         DS    0F
* X-func ZZZ_66 prologue
ZZZ@66   PDPPRLG CINDEX=13,FRAME=104,BASER=12,ENTRY=YES
         B     FEN13
         LTORG
FEN13    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         LR    11,1
         L     10,=A(PGT13)
* Function ZZZ_66 code
         L     5,0(11)
         L     4,4(11)
         L     15,4(5)
         SLR   3,3
         IC    3,8(15)
         SLR   6,6
         LR    2,3
         A     2,=F'-20'
         LA    7,1(0,0)
         CLR   2,7
         BH    L406
         L     2,16(15)
         LTR   2,2
         BNE   L407
         ST    6,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(C@INCOMP)
         BALR  14,15
         B     L420
L407     EQU   *
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BNE   L411
         MVC   88(4,13),=A(LC15)
         L     2,=A(LC16)
         LA    5,20(0,0)
         CLR   3,5
         BE    L410
         L     2,=A(LC2)
L410     EQU   *
         ST    2,92(13)
         MVC   96(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L420
L411     EQU   *
         L     3,16(6)
         L     15,4(3)
         L     2,=V(GLOBAL@T)
         CL    15,0(2)
         BE    L405
         MVC   88(4,13),=F'40'
         MVC   92(4,13),4(3)
         ST    5,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         LR    4,15
         L     2,8(5)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BNE   L416
         L     2,8(3)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    L415
L416     EQU   *
         OC    8(4,4),=F'524288'
L415     EQU   *
         L     2,8(5)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BNE   L418
         L     2,8(3)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BE    L417
L418     EQU   *
         OC    8(4,4),=F'1048576'
L417     EQU   *
         L     2,8(3)
         SRL   2,9
         N     2,=F'1'
         LTR   2,2
         BE    L419
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2019)
         BALR  14,15
L419     EQU   *
         LR    5,4
         L     6,0(6)
         LTR   6,6
         BNE   L411
         LR    15,4
         B     L405
L406     EQU   *
         LTR   3,3
         BE    L420
         MVC   88(4,13),=A(LC17)
         MVC   92(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L420     EQU   *
         L     2,=V(GLOBAL@T)
         L     15,0(2)
L405     EQU   *
* Function ZZZ_66 epilogue
         PDPEPIL
* Function ZZZ_66 literal pool
         DS    0F
         LTORG
* Function ZZZ_66 page table
         DS    0F
PGT13    EQU   *
         DC    A(PG13)
LC18     EQU   *
         DC    C'local declaration of `%s'' hides instance variab'
         DC    C'le'
         DC    X'0'
         DS    0F
* X-func ZZZ_75 prologue
ZZZ@75   PDPPRLG CINDEX=14,FRAME=96,BASER=12,ENTRY=YES
         B     FEN14
         LTORG
FEN14    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG14     EQU   *
         LR    11,1
         L     10,=A(PGT14)
* Function ZZZ_75 code
         L     5,0(11)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(LOOKUP@N)
         BALR  14,15
         LR    4,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(LOOKUP@O)
         BALR  14,15
         LTR   4,4
         BE    L424
         L     2,=V(GLOBAL@T)
         CL    4,0(2)
         BE    L424
         LR    3,4
         LTR   15,15
         BE    L429
         CLR   4,15
         BE    L444
         L     2,48(4)
         LTR   2,2
         BE    L444
         CLI   8(2),39
         BE    L444
         MVC   88(4,13),=A(LC18)
         MVC   92(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     L429
L424     EQU   *
         LR    3,15
         LTR   15,15
         BNE   L429
         L     2,4(11)
         LTR   2,2
         BE    L432
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1440)
         BALR  14,15
L444     EQU   *
         LR    3,15
         B     L429
L432     EQU   *
         L     2,=V(GLOBAL@T)
         LR    15,4
         CL    4,0(2)
         BE    L423
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(UNDECLAR)
         BALR  14,15
         L     15,0(2)
         B     L423
L429     EQU   *
         L     2,4(3)
         LR    15,2
         L     2,=V(GLOBAL@T)
         CL    15,0(2)
         BE    L423
         L     2,8(3)
         SRL   2,9
         N     2,=F'1'
         LTR   2,2
         BE    L437
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2019)
         BALR  14,15
L437     EQU   *
         L     2,=V(SKIP@EVA)
         L     2,0(2)
         LTR   2,2
         BNE   L438
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@33)
         BALR  14,15
L438     EQU   *
         OC    8(4,3),=F'32768'
         IC    4,8(3)
         CLM   4,1,=XL1'20'
         BNE   L439
         L     3,60(3)
         OC    8(4,3),=F'4194304'
         B     L440
L439     EQU   *
         L     5,=V(ZZZ@289)
         L     2,0(5)
         LTR   2,2
         BE    L440
         L     2,48(2)
         LTR   2,2
         BE    L440
         CLI   8(2),39
         BE    L440
         LA    2,222(,4)
         CLM   2,1,=XL1'01'
         BNH   L442
         CLM   4,1,=XL1'1E'
         BNE   L440
L442     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(DECL@FUN)
         BALR  14,15
         LTR   15,15
         BE    L440
         CL    15,0(5)
         BE    L440
         OC    28(4,3),=F'4194304'
L440     EQU   *
         LR    15,3
L423     EQU   *
* Function ZZZ_75 epilogue
         PDPEPIL
* Function ZZZ_75 literal pool
         DS    0F
         LTORG
* Function ZZZ_75 page table
         DS    0F
PGT14    EQU   *
         DC    A(PG14)
         DS    0F
* X-func c_tree_expr_nonnegative_p prologue
C@TREE@E PDPPRLG CINDEX=15,FRAME=96,BASER=12,ENTRY=YES
         B     FEN15
         LTORG
FEN15    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG15     EQU   *
         LR    11,1
         L     10,=A(PGT15)
* Function c_tree_expr_nonnegative_p code
         L     2,0(11)
         CLI   8(2),166
         BNE   L446
         L     2,16(2)
         L     2,16(2)
         B     L452
L451     EQU   *
         CLI   8(15),163
         BE    L448
         LR    2,15
L452     EQU   *
         L     15,0(2)
         LTR   15,15
         BNE   L451
L448     EQU   *
         MVC   88(4,13),16(2)
         B     L453
L446     EQU   *
         ST    2,88(13)
L453     EQU   *
         LA    1,88(,13)
         L     15,=V(TREE@EXP)
         BALR  14,15
* Function c_tree_expr_nonnegative_p epilogue
         PDPEPIL
* Function c_tree_expr_nonnegative_p literal pool
         DS    0F
         LTORG
* Function c_tree_expr_nonnegative_p page table
         DS    0F
PGT15    EQU   *
         DC    A(PG15)
LC19     EQU   *
         DC    C'use of conditional expressions as lvalues is dep'
         DC    C'recated'
         DC    X'0'
LC20     EQU   *
         DC    C'use of compound expressions as lvalues is deprec'
         DC    C'ated'
         DC    X'0'
LC21     EQU   *
         DC    C'use of cast expressions as lvalues is deprecated'
         DC    X'0'
         DS    0F
* Function pedantic_lvalue_warning,F13 prologue
@@F13    PDPPRLG CINDEX=16,FRAME=96,BASER=12,ENTRY=NO
         B     FEN16
         LTORG
FEN16    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG16     EQU   *
         LR    11,1
         L     10,=A(PGT16)
* Function pedantic_lvalue_warning code
         L     15,0(11)
         LA    2,48(0,0)
         CLR   15,2
         BE    L457
         LA    2,52(0,0)
         CLR   15,2
         BNE   L458
         MVC   88(4,13),=A(LC19)
         B     L459
L457     EQU   *
         MVC   88(4,13),=A(LC20)
         B     L459
L458     EQU   *
         MVC   88(4,13),=A(LC21)
L459     EQU   *
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
* Function pedantic_lvalue_warning epilogue
         PDPEPIL
* Function pedantic_lvalue_warning literal pool
         DS    0F
         LTORG
* Function pedantic_lvalue_warning page table
         DS    0F
PGT16    EQU   *
         DC    A(PG16)
LC22     EQU   *
         DC    C'%s'
         DC    X'0'
         DS    0F
* X-func lvalue_or_else prologue
LVALUE@O PDPPRLG CINDEX=17,FRAME=96,BASER=12,ENTRY=YES
         B     FEN17
         LTORG
FEN17    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG17     EQU   *
         LR    11,1
         L     10,=A(PGT17)
* Function lvalue_or_else code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(LVALUE@P)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   L461
         MVC   88(4,13),=A(LC22)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L461     EQU   *
         LR    15,2
* Function lvalue_or_else epilogue
         PDPEPIL
* Function lvalue_or_else literal pool
         DS    0F
         LTORG
* Function lvalue_or_else page table
         DS    0F
PGT17    EQU   *
         DC    A(PG17)
LC23     EQU   *
         DC    C'%s of read-only member `%s'''
         DC    X'0'
LC24     EQU   *
         DC    C'%s of read-only variable `%s'''
         DC    X'0'
LC25     EQU   *
         DC    C'%s of read-only location'
         DC    X'0'
         DS    0F
* X-func ZZZ_1739 prologue
ZZZ@1739 PDPPRLG CINDEX=18,FRAME=104,BASER=12,ENTRY=YES
         B     FEN18
         LTORG
FEN18    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG18     EQU   *
         LR    11,1
         L     10,=A(PGT18)
* Function ZZZ_1739 code
         L     15,0(11)
         L     4,4(11)
L465     EQU   *
         IC    2,8(15)
         CLM   2,1,=XL1'28'
         BNE   L463
         L     3,16(15)
         L     2,4(3)
         L     2,8(2)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    L464
         LR    15,3
         B     L465
L464     EQU   *
         MVC   88(4,13),=A(LC23)
         ST    4,92(13)
         L     2,20(15)
         L     2,44(2)
         B     L470
L463     EQU   *
         CLM   2,1,=XL1'22'
         BNE   L468
         MVC   88(4,13),=A(LC24)
         ST    4,92(13)
         L     2,44(15)
L470     EQU   *
         MVC   96(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L462
L468     EQU   *
         MVC   88(4,13),=A(LC25)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L462     EQU   *
* Function ZZZ_1739 epilogue
         PDPEPIL
* Function ZZZ_1739 literal pool
         DS    0F
         LTORG
* Function ZZZ_1739 page table
         DS    0F
PGT18    EQU   *
         DC    A(PG18)
LC26     EQU   *
         DC    C'cannot take address of bit-field `%s'''
         DC    X'0'
LC27     EQU   *
         DC    C'global register variable `%s'' used in nested fu'
         DC    C'nction'
         DC    X'0'
LC28     EQU   *
         DC    C'register variable `%s'' used in nested function'
         DC    X'0'
LC29     EQU   *
         DC    C'address of global register variable `%s'' reques'
         DC    C'ted'
         DC    X'0'
LC30     EQU   *
         DC    C'cannot put object with volatile field into regis'
         DC    C'ter'
         DC    X'0'
LC31     EQU   *
         DC    C'address of register variable `%s'' requested'
         DC    X'0'
         DS    0F
* X-func c_mark_addressable prologue
C@MARK@A PDPPRLG CINDEX=19,FRAME=96,BASER=12,ENTRY=YES
         B     FEN19
         LTORG
FEN19    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG19     EQU   *
         LR    11,1
         L     10,=A(PGT19)
* Function c_mark_addressable code
         L     4,0(11)
L472     EQU   *
         L     5,8(4)
         LR    2,5
         SRL   2,24
         LA    3,44(0,0)
         CLR   2,3
         BE    L480
         BH    L498
         LA    3,36(0,0)
         CLR   2,3
         BH    L499
         LA    3,34(0,0)
         CLR   2,3
         BNL   L486
         LA    3,30(0,0)
         CLR   2,3
         BE    L496
         LA    3,32(0,0)
         CLR   2,3
         BE    L486
         B     L497
L499     EQU   *
         LA    3,40(0,0)
         CLR   2,3
         BE    L475
         B     L497
L498     EQU   *
         LA    3,126(0,0)
         CLR   2,3
         BH    L500
         LA    3,125(0,0)
         CLR   2,3
         BNL   L480
         LA    3,47(0,0)
         CLR   2,3
         BE    L496
         LA    3,119(0,0)
         CLR   2,3
         BE    L480
         B     L497
L500     EQU   *
         LA    3,167(0,0)
         CLR   2,3
         BE    L496
         B     L497
L475     EQU   *
         L     2,20(4)
         L     2,32(2)
         SRL   2,19
         N     2,=F'1'
         LA    3,1(0,0)
         CLR   2,3
         BNE   L480
         MVC   88(4,13),=A(LC26)
         L     2,20(4)
         L     2,44(2)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   15,15
         B     L471
L480     EQU   *
         L     4,16(4)
         B     L472
L486     EQU   *
         L     15,28(4)
         LR    2,15
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    L487
         LR    3,5
         SRL   3,21
         N     3,=F'1'
         LTR   3,3
         BNE   L487
         LR    2,15
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BE    L487
         N     5,=F'12288'
         LTR   5,5
         BNE   L489
         SRL   15,23
         N     15,=F'1'
         LTR   15,15
         BE    L488
L489     EQU   *
         MVC   88(4,13),=A(LC27)
         L     2,44(4)
         MVC   92(4,13),12(2)
         B     L502
L488     EQU   *
         MVC   88(4,13),=A(LC28)
         B     L501
L487     EQU   *
         LR    2,15
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    L490
         L     2,8(4)
         LR    5,2
         SRL   5,21
         N     5,=F'1'
         LTR   5,5
         BNE   L490
         N     2,=F'12288'
         LTR   2,2
         BNE   L493
         LR    3,15
         SRL   3,23
         N     3,=F'1'
         LTR   3,3
         BE    L492
L493     EQU   *
         MVC   88(4,13),=A(LC29)
         L     2,44(4)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         LR    15,5
         B     L471
L492     EQU   *
         L     2,4(4)
         L     2,8(2)
         SRL   2,5
         N     2,=F'1'
         LTR   2,2
         BE    L494
         MVC   88(4,13),=A(LC30)
L502     EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         LR    15,3
         B     L471
L494     EQU   *
         MVC   88(4,13),=A(LC31)
L501     EQU   *
         L     2,44(4)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L490     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(PUT@VAR@)
         BALR  14,15
L496     EQU   *
         OC    8(4,4),=F'2097152'
L497     EQU   *
         LA    15,1(0,0)
L471     EQU   *
* Function c_mark_addressable epilogue
         PDPEPIL
* Function c_mark_addressable literal pool
         DS    0F
         LTORG
* Function c_mark_addressable page table
         DS    0F
PGT19    EQU   *
         DC    A(PG19)
LC32     EQU   *
         DC    C'passing arg of `%s'''
         DC    X'0'
LC33     EQU   *
         DC    C'passing arg of pointer to function'
         DC    X'0'
LC34     EQU   *
         DC    C'passing arg %d of `%s'''
         DC    X'0'
LC35     EQU   *
         DC    C'passing arg %d of pointer to function'
         DC    X'0'
         DS    0F
* Function warn_for_assignment,F16 prologue
@@F16    PDPPRLG CINDEX=20,FRAME=104,BASER=12,ENTRY=NO
         B     FEN20
         LTORG
FEN20    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG20     EQU   *
         LR    11,1
         L     10,=A(PGT20)
* Function warn_for_assignment code
         L     15,4(11)
         L     3,8(11)
         L     4,12(11)
         LTR   15,15
         BNE   L504
         LA    1,88(,13)
         L     15,=V(OBJC@MES)
         BALR  14,15
         LTR   15,15
         BE    L505
         LA    2,2(0,0)
         CR    4,2
         BNH   L505
         LR    3,15
         A     4,=F'-2'
L505     EQU   *
         LTR   4,4
         BNE   L506
         LTR   3,3
         BE    L507
         MVC   88(4,13),=A(LC32)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         L     2,16(3)
         AR    2,15
         A     2,=F'2'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         MVC   92(4,13),=A(LC32)
         MVC   96(4,13),12(3)
         B     L512
L507     EQU   *
         MVC   88(4,13),=A(LC33)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         A     15,=F'2'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         MVC   92(4,13),=A(LC33)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         B     L509
L506     EQU   *
         LTR   3,3
         BE    L510
         MVC   88(4,13),=A(LC34)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         L     2,16(3)
         AR    2,15
         A     2,=F'27'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         MVC   92(4,13),=A(LC34)
         ST    4,96(13)
         MVC   100(4,13),12(3)
         B     L512
L510     EQU   *
         MVC   88(4,13),=A(LC35)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         A     15,=F'27'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         MVC   92(4,13),=A(LC35)
         ST    4,96(13)
L512     EQU   *
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
L509     EQU   *
         LR    15,2
L504     EQU   *
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
* Function warn_for_assignment epilogue
         PDPEPIL
* Function warn_for_assignment literal pool
         DS    0F
         LTORG
* Function warn_for_assignment page table
         DS    0F
PGT20    EQU   *
         DC    A(PG20)
         DS    0F
* Function valid_compound_expr_initializer,F17 prologue
@@F17    PDPPRLG CINDEX=21,FRAME=96,BASER=12,ENTRY=NO
         B     FEN21
         LTORG
FEN21    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG21     EQU   *
         LR    11,1
         L     10,=A(PGT21)
* Function valid_compound_expr_initializer code
         L     3,0(11)
         L     4,4(11)
L516     EQU   *
         CLI   8(3),48
         BNE   L514
         MVC   88(4,13),16(3)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         L     2,=V(GLOBAL@T)
         CL    15,0(2)
         BE    L513
         L     3,20(3)
         B     L516
L514     EQU   *
         L     2,8(3)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BNE   L518
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1444)
         BALR  14,15
         LTR   15,15
         BNE   L518
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         B     L513
L518     EQU   *
         LR    15,3
L513     EQU   *
* Function valid_compound_expr_initializer epilogue
         PDPEPIL
* Function valid_compound_expr_initializer literal pool
         DS    0F
         LTORG
* Function valid_compound_expr_initializer page table
         DS    0F
PGT21    EQU   *
         DC    A(PG21)
LC36     EQU   *
         DC    C'<anonymous>'
         DC    X'0'
         DS    0F
* Function push_member_name,F19 prologue
@@F19    PDPPRLG CINDEX=22,FRAME=96,BASER=12,ENTRY=NO
         B     FEN22
         LTORG
FEN22    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG22     EQU   *
         LR    11,1
         L     10,=A(PGT22)
* Function push_member_name code
         L     2,0(11)
         L     2,44(2)
         L     7,=A(LC36)
         LTR   2,2
         BE    L522
         L     7,12(2)
L522     EQU   *
         L     6,=A(@@V2)
         L     5,=A(@@V3)
         L     15,0(5)
         L     3,0(6)
         SR    3,15
         SRA   3,3
         L     4,=A(@@V4)
         L     2,0(4)
         CR    3,2
         BL    L523
         A     2,=F'10'
         ST    2,0(4)
         SLL   2,3
         LTR   15,15
         BNE   L524
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         B     L526
L524     EQU   *
         ST    15,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
L526     EQU   *
         ST    15,0(5)
         SLL   3,3
         A     3,0(5)
         ST    3,0(6)
L523     EQU   *
         L     3,=A(@@V2)
         L     2,0(3)
         MVC   0(4,2),=F'2'
         ST    7,4(2)
         A     2,=F'8'
         ST    2,0(3)
* Function push_member_name epilogue
         PDPEPIL
* Function push_member_name literal pool
         DS    0F
         LTORG
* Function push_member_name page table
         DS    0F
PGT22    EQU   *
         DC    A(PG22)
         DS    0F
* Function push_array_bounds,F20 prologue
@@F20    PDPPRLG CINDEX=23,FRAME=96,BASER=12,ENTRY=NO
         B     FEN23
         LTORG
FEN23    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG23     EQU   *
         LR    11,1
         L     10,=A(PGT23)
* Function push_array_bounds code
         L     6,=A(@@V2)
         L     5,=A(@@V3)
         L     15,0(5)
         L     3,0(6)
         SR    3,15
         SRA   3,3
         L     4,=A(@@V4)
         L     2,0(4)
         CR    3,2
         BL    L528
         A     2,=F'10'
         ST    2,0(4)
         SLL   2,3
         LTR   15,15
         BNE   L529
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         B     L531
L529     EQU   *
         ST    15,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
L531     EQU   *
         ST    15,0(5)
         SLL   3,3
         A     3,0(5)
         ST    3,0(6)
L528     EQU   *
         L     3,=A(@@V2)
         L     2,0(3)
         MVC   0(4,2),=F'3'
         MVC   4(4,2),0(11)
         A     2,=F'8'
         ST    2,0(3)
* Function push_array_bounds epilogue
         PDPEPIL
* Function push_array_bounds literal pool
         DS    0F
         LTORG
* Function push_array_bounds page table
         DS    0F
PGT23    EQU   *
         DC    A(PG23)
         DS    0F
* Function spelling_length,F21 prologue
@@F21    PDPPRLG CINDEX=24,FRAME=96,BASER=12,ENTRY=NO
         B     FEN24
         LTORG
FEN24    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG24     EQU   *
         LR    11,1
         L     10,=A(PGT24)
* Function spelling_length code
         SLR   4,4
         L     2,=A(@@V3)
         L     3,0(2)
         L     5,=A(@@V2)
L541     EQU   *
         CL    3,0(5)
         BNL   L540
         L     2,0(3)
         LA    6,3(0,0)
         CLR   2,6
         BNE   L536
         A     4,=F'25'
         B     L535
L536     EQU   *
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         AR    4,15
         A     4,=F'1'
L535     EQU   *
         A     3,=F'8'
         B     L541
L540     EQU   *
         LR    15,4
* Function spelling_length epilogue
         PDPEPIL
* Function spelling_length literal pool
         DS    0F
         LTORG
* Function spelling_length page table
         DS    0F
PGT24    EQU   *
         DC    A(PG24)
LC37     EQU   *
         DC    C'Ý%d¨'
         DC    X'0'
         DS    0F
* Function print_spelling,F22 prologue
@@F22    PDPPRLG CINDEX=25,FRAME=104,BASER=12,ENTRY=NO
         B     FEN25
         LTORG
FEN25    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG25     EQU   *
         LR    11,1
         L     10,=A(PGT25)
* Function print_spelling code
         L     6,0(11)
         LR    3,6
         L     2,=A(@@V3)
         L     4,0(2)
         L     5,=A(@@V2)
L557     EQU   *
         CL    4,0(5)
         BNL   L555
         L     2,0(4)
         LA    7,3(0,0)
         CLR   2,7
         BNE   L546
         ST    3,88(13)
         MVC   92(4,13),=A(LC37)
         MVC   96(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         AR    3,15
         B     L545
L546     EQU   *
         LA    7,2(0,0)
         CLR   2,7
         BNE   L548
         MVI   0(3),75
         A     3,=F'1'
L548     EQU   *
         L     15,4(4)
L558     EQU   *
         IC    2,0(15)
         A     15,=F'1'
         STC   2,0(3)
         CLM   2,1,=XL1'00'
         BE    L545
         A     3,=F'1'
         B     L558
L545     EQU   *
         A     4,=F'8'
         B     L557
L555     EQU   *
         MVI   0(3),0
         LR    15,6
* Function print_spelling epilogue
         PDPEPIL
* Function print_spelling literal pool
         DS    0F
         LTORG
* Function print_spelling page table
         DS    0F
PGT25    EQU   *
         DC    A(PG25)
LC38     EQU   *
         DC    C'(near initialization for `%s'')'
         DC    X'0'
         DS    0F
* X-func ZZZ_1641 prologue
ZZZ@1641 PDPPRLG CINDEX=26,FRAME=96,BASER=12,ENTRY=YES
         B     FEN26
         LTORG
FEN26    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG26     EQU   *
         LR    11,1
         L     10,=A(PGT26)
* Function ZZZ_1641 code
         MVC   88(4,13),=A(LC22)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@F21)
         BALR  14,15
         A     15,=F'1'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BE    L559
         MVC   88(4,13),=A(LC38)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L559     EQU   *
* Function ZZZ_1641 epilogue
         PDPEPIL
* Function ZZZ_1641 literal pool
         DS    0F
         LTORG
* Function ZZZ_1641 page table
         DS    0F
PGT26    EQU   *
         DC    A(PG26)
         DS    0F
* X-func error_init prologue
ERROR@IN PDPPRLG CINDEX=27,FRAME=96,BASER=12,ENTRY=YES
         B     FEN27
         LTORG
FEN27    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG27     EQU   *
         LR    11,1
         L     10,=A(PGT27)
* Function error_init code
         MVC   88(4,13),=A(LC22)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@F21)
         BALR  14,15
         A     15,=F'1'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BE    L561
         MVC   88(4,13),=A(LC38)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L561     EQU   *
* Function error_init epilogue
         PDPEPIL
* Function error_init literal pool
         DS    0F
         LTORG
* Function error_init page table
         DS    0F
PGT27    EQU   *
         DC    A(PG27)
         DS    0F
* Function warning_init,F23 prologue
@@F23    PDPPRLG CINDEX=28,FRAME=96,BASER=12,ENTRY=NO
         B     FEN28
         LTORG
FEN28    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG28     EQU   *
         LR    11,1
         L     10,=A(PGT28)
* Function warning_init code
         MVC   88(4,13),=A(LC22)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@F21)
         BALR  14,15
         A     15,=F'1'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BE    L563
         MVC   88(4,13),=A(LC38)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L563     EQU   *
* Function warning_init epilogue
         PDPEPIL
* Function warning_init literal pool
         DS    0F
         LTORG
* Function warning_init page table
         DS    0F
PGT28    EQU   *
         DC    A(PG28)
LC39     EQU   *
         DC    C'(anonymous)'
         DC    X'0'
         DS    0F
* X-func start_init prologue
START@IN PDPPRLG CINDEX=29,FRAME=104,BASER=12,ENTRY=YES
         B     FEN29
         LTORG
FEN29    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG29     EQU   *
         LR    11,1
         L     10,=A(PGT29)
* Function start_init code
         L     6,0(11)
         L     2,4(11)
         MVC   88(4,13),=F'40'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         MVC   96(4,13),=F'0'
         LTR   2,2
         BE    L566
         MVC   96(4,13),16(2)
L566     EQU   *
         L     5,=A(@@V5)
         MVC   4(4,15),0(5)
         L     4,=A(@@V6)
         MVC   8(4,15),0(4)
         L     7,=A(@@V7)
         MVC   37(1,15),3(7)
         L     8,=A(@@V8)
         MVC   38(1,15),3(8)
         L     2,=A(ZZZ@202)
         MVC   12(4,15),0(2)
         L     2,=A(ZZZ@201)
         MVC   16(4,15),0(2)
         L     2,=A(@@V9)
         MVC   20(4,15),0(2)
         L     2,=A(@@V2)
         MVC   24(4,15),0(2)
         L     2,=A(@@V3)
         MVC   28(4,15),0(2)
         L     9,=A(@@V4)
         MVC   32(4,15),0(9)
         L     3,=A(@@V10)
         MVC   36(1,15),3(3)
         L     2,=A(ZZZ@1445)
         MVC   0(4,15),0(2)
         ST    15,0(2)
         ST    6,0(5)
         MVC   0(4,4),96(13)
         L     2,=A(@@V11)
         MVC   0(4,2),=F'0'
         MVC   0(4,3),8(11)
         LTR   6,6
         BE    L567
         L     2,8(6)
         SRL   2,13
         N     2,=F'1'
         ST    2,0(7)
         LR    4,8
         SLR   3,3
         LTR   2,2
         BNE   L569
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L568
         L     2,=V(ZZZ@754)
         L     2,0(2)
         LTR   2,2
         BNE   L568
L569     EQU   *
         L     2,4(6)
         IC    2,8(2)
         CLM   2,1,=XL1'12'
         BE    L570
         CLM   2,1,=XL1'14'
         BE    L570
         CLM   2,1,=XL1'15'
         BE    L570
         CLM   2,1,=XL1'16'
         BNE   L568
L570     EQU   *
         LA    3,1(0,0)
L568     EQU   *
         ST    3,0(4)
         L     2,44(6)
         L     3,12(2)
         B     L571
L567     EQU   *
         ST    6,0(7)
         ST    6,0(8)
         L     3,=A(LC39)
L571     EQU   *
         L     2,=A(ZZZ@202)
         MVC   0(4,2),=F'0'
         L     2,=A(ZZZ@201)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V12)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V3)
         MVC   0(4,2),=F'0'
         MVC   0(4,9),=F'0'
         L     2,=A(@@V2)
         MVC   0(4,2),=F'0'
         LTR   3,3
         BE    L565
         MVC   0(4,9),=F'10'
         MVC   88(4,13),=F'80'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@V3)
         ST    15,0(2)
         MVC   0(4,15),=F'1'
         ST    3,4(15)
         A     15,=F'8'
         L     2,=A(@@V2)
         ST    15,0(2)
L565     EQU   *
* Function start_init epilogue
         PDPEPIL
* Function start_init literal pool
         DS    0F
         LTORG
* Function start_init page table
         DS    0F
PGT29    EQU   *
         DC    A(PG29)
         DS    0F
* X-func finish_init prologue
FINISH@I PDPPRLG CINDEX=30,FRAME=104,BASER=12,ENTRY=YES
         B     FEN30
         LTORG
FEN30    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG30     EQU   *
         LR    11,1
         L     10,=A(PGT30)
* Function finish_init code
         L     6,=A(ZZZ@1445)
         L     4,0(6)
L584     EQU   *
         L     3,=A(ZZZ@202)
         L     2,0(3)
         LTR   2,2
         BE    L583
         L     2,0(3)
         MVC   0(4,3),0(2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     L584
L583     EQU   *
         L     5,=A(ZZZ@201)
         L     2,0(5)
         LTR   2,2
         BE    L581
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'4499'
         MVC   96(4,13),=A(LC8)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L581     EQU   *
         L     3,=A(@@V3)
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@V5)
         MVC   0(4,2),4(4)
         L     2,=A(@@V6)
         MVC   0(4,2),8(4)
         L     2,=A(@@V7)
         SLR   7,7
         IC    7,37(4)
         ST    7,0(2)
         L     2,=A(@@V8)
         SLR   7,7
         IC    7,38(4)
         ST    7,0(2)
         L     2,=A(ZZZ@202)
         MVC   0(4,2),12(4)
         MVC   0(4,5),16(4)
         L     2,=A(@@V9)
         MVC   0(4,2),20(4)
         L     2,=A(@@V2)
         MVC   0(4,2),24(4)
         MVC   0(4,3),28(4)
         L     2,=A(@@V4)
         MVC   0(4,2),32(4)
         L     2,=A(@@V10)
         SLR   3,3
         IC    3,36(4)
         ST    3,0(2)
         MVC   0(4,6),0(4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function finish_init epilogue
         PDPEPIL
* Function finish_init literal pool
         DS    0F
         LTORG
* Function finish_init page table
         DS    0F
PGT30    EQU   *
         DC    A(PG30)
LC40     EQU   *
         DC    C'opaque vector types cannot be initialized'
         DC    X'0'
         DS    0F
* X-func really_start_incremental_init prologue
REALLY@S PDPPRLG CINDEX=31,FRAME=96,BASER=12,ENTRY=YES
         B     FEN31
         LTORG
FEN31    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG31     EQU   *
         LR    11,1
         L     10,=A(PGT31)
* Function really_start_incremental_init code
         L     8,0(11)
         MVC   88(4,13),=F'64'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    9,15
         LTR   8,8
         BNE   L586
         L     2,=A(@@V5)
         L     2,0(2)
         L     8,4(2)
L586     EQU   *
         ST    8,88(13)
         L     2,=V(TARGETM)
         L     2,308(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L587
         MVC   88(4,13),=A(LC40)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L587     EQU   *
         L     2,=A(@@V13)
         MVC   4(4,9),0(2)
         L     15,=A(@@V14)
         MVC   8(4,9),0(15)
         L     3,=A(@@V15)
         MVC   12(4,9),0(3)
         L     4,=A(@@V16)
         MVC   16(4,9),0(4)
         L     2,=A(@@V17)
         MVC   20(4,9),0(2)
         L     3,=A(@@V18)
         MVC   24(4,9),0(3)
         L     4,=A(@@V19)
         MVC   28(4,9),0(4)
         L     2,=A(@@V9)
         MVC   32(4,9),0(2)
         L     7,=A(@@V20)
         MVC   56(1,9),3(7)
         L     3,=A(@@V21)
         MVC   57(1,9),3(3)
         L     2,=A(@@V22)
         MVC   59(1,9),3(2)
         L     4,=A(@@V23)
         MVC   36(4,9),0(4)
         L     6,=A(@@V24)
         MVC   44(4,9),0(6)
         MVC   48(4,9),=F'0'
         MVI   58(9),0
         MVC   52(4,9),=F'0'
         MVI   60(9),0
         L     5,=A(@@V25)
         MVC   61(1,9),3(5)
         L     4,=A(@@V11)
         MVC   62(1,9),3(4)
         MVC   0(4,9),=F'0'
         L     2,=A(ZZZ@202)
         ST    9,0(2)
         MVC   0(4,7),=F'1'
         MVC   0(4,3),=F'1'
         L     3,=A(@@V3)
         L     2,=A(@@V2)
         L     2,0(2)
         S     2,0(3)
         SRA   2,3
         ST    2,0(6)
         L     2,=A(@@V9)
         MVC   0(4,2),=F'0'
         L     3,=A(@@V23)
         MVC   0(4,3),=F'0'
         L     2,=A(@@V13)
         ST    8,0(2)
         MVC   0(4,5),=F'1'
         MVC   0(4,4),=F'0'
         L     2,=A(@@V26)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V27)
         MVC   0(4,2),=F'0'
         IC    3,8(8)
         LA    2,236(,3)
         CLM   2,1,=XL1'01'
         BH    L588
         MVC   0(4,15),12(8)
         L     3,0(15)
         B     L604
L602     EQU   *
         L     2,44(3)
         LTR   2,2
         BNE   L590
         L     3,=A(@@V14)
         L     2,0(3)
         MVC   0(4,3),0(2)
         L     3,0(2)
L604     EQU   *
         LTR   3,3
         BE    L590
         L     2,32(3)
         SRL   2,19
         N     2,=F'1'
         LA    4,1(0,0)
         CLR   2,4
         BE    L602
L590     EQU   *
         L     2,=A(@@V14)
         L     3,=A(@@V18)
         MVC   0(4,3),0(2)
         L     2,=V(GLOBAL@T)
         L     4,=A(@@V19)
         MVC   0(4,4),68(2)
         B     L585
L588     EQU   *
         CLM   3,1,=XL1'12'
         BNE   L593
         L     2,12(8)
         LTR   2,2
         BE    L594
         L     3,=A(@@V16)
         MVC   0(4,3),60(2)
         L     2,0(3)
         LTR   2,2
         BNE   L595
         L     2,16(8)
         LTR   2,2
         BE    L595
         MVC   88(4,13),=F'-1'
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    15,0(3)
L595     EQU   *
         L     4,=A(@@V16)
         L     2,0(4)
         LTR   2,2
         BE    L596
         CLI   8(2),25
         BE    L596
         MVC   88(4,13),=F'-1'
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    15,0(4)
L596     EQU   *
         L     2,=V(SIZETYPE)
         MVC   88(4,13),12(2)
         L     3,=A(@@V13)
         L     2,0(3)
         L     2,12(2)
         MVC   92(4,13),56(2)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         L     4,=A(@@V15)
         ST    15,0(4)
         B     L597
L594     EQU   *
         L     2,=V(GLOBAL@T)
         L     3,=A(@@V15)
         MVC   0(4,3),68(2)
L597     EQU   *
         L     2,=A(@@V15)
         L     4,=A(@@V17)
         MVC   0(4,4),0(2)
         B     L585
L593     EQU   *
         CLM   3,1,=XL1'09'
         BNE   L599
         LH    3,32(8)
         N     3,=F'127'
         L     2,=V(MODE@NUN)
         SLR   4,4
         IC    4,0(2,3)
         LR    2,4
         BCTR  2,0
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         L     2,=A(@@V16)
         ST    15,0(2)
         L     2,=V(SIZETYPE)
         MVC   88(4,13),12(2)
         L     2,=V(GLOBAL@T)
         MVC   92(4,13),68(2)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         L     3,=A(@@V15)
         ST    15,0(3)
         L     4,=A(@@V17)
         ST    15,0(4)
         B     L585
L599     EQU   *
         ST    8,0(15)
         L     2,=A(@@V18)
         ST    8,0(2)
L585     EQU   *
* Function really_start_incremental_init epilogue
         PDPEPIL
* Function really_start_incremental_init literal pool
         DS    0F
         LTORG
* Function really_start_incremental_init page table
         DS    0F
PGT31    EQU   *
         DC    A(PG31)
         DS    0F
* Function push_range_stack,F26 prologue
@@F26    PDPPRLG CINDEX=32,FRAME=96,BASER=12,ENTRY=NO
         B     FEN32
         LTORG
FEN32    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG32     EQU   *
         LR    11,1
         L     10,=A(PGT32)
* Function push_range_stack code
         MVC   88(4,13),=F'28'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         L     3,=A(ZZZ@201)
         MVC   4(4,15),0(3)
         MVC   0(4,15),=F'0'
         L     2,=A(@@V14)
         MVC   24(4,15),0(2)
         L     2,=A(@@V15)
         MVC   12(4,15),0(2)
         MVC   16(4,15),0(2)
         L     2,=A(ZZZ@202)
         MVC   8(4,15),0(2)
         MVC   20(4,15),0(11)
         L     2,0(3)
         LTR   2,2
         BE    L606
         ST    15,0(2)
L606     EQU   *
         ST    15,0(3)
* Function push_range_stack epilogue
         PDPEPIL
* Function push_range_stack literal pool
         DS    0F
         LTORG
* Function push_range_stack page table
         DS    0F
PGT32    EQU   *
         DC    A(PG32)
LC41     EQU   *
         DC    C'initialized field with side-effects overwritten'
         DC    X'0'
         DS    0F
* Function add_pending_init,F27 prologue
@@F27    PDPPRLG CINDEX=33,FRAME=96,BASER=12,ENTRY=NO
         B     FEN33
         LTORG
FEN33    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG33     EQU   *
         LR    11,1
         L     10,=A(PGT33)
* Function add_pending_init code
         L     4,0(11)
         L     8,4(11)
         L     6,=A(@@V23)
         LR    3,6
         LR    9,6
         SLR   5,5
         L     2,=A(@@V13)
         L     2,0(2)
         CLI   8(2),18
         BNE   L608
         L     2,0(6)
L679     EQU   *
         LTR   2,2
         BE    L617
         L     5,0(3)
         ST    4,88(13)
         MVC   92(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LR    3,5
         LTR   15,15
         BNE   L609
         MVC   88(4,13),16(5)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L622
         A     3,=F'4'
L609     EQU   *
         L     2,0(3)
         B     L679
L677     EQU   *
         ST    15,0(3)
         B     L607
L678     EQU   *
         ST    4,0(3)
         B     L607
L608     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         LR    7,15
         L     2,0(6)
L680     EQU   *
         LTR   2,2
         BE    L617
         L     5,0(3)
         MVC   88(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LR    3,5
         LTR   15,15
         BNE   L618
         L     2,16(5)
         CLR   2,4
         BE    L622
         A     3,=F'4'
         B     L618
L622     EQU   *
         L     2,20(5)
         L     2,8(2)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         BE    L624
         MVC   88(4,13),=A(LC41)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
L624     EQU   *
         ST    8,20(5)
         B     L607
L618     EQU   *
         L     2,0(3)
         B     L680
L617     EQU   *
         MVC   88(4,13),=F'24'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         ST    4,16(15)
         ST    8,20(15)
         ST    15,0(3)
         ST    5,8(15)
         MVC   0(4,15),=F'0'
         MVC   4(4,15),=F'0'
         MVC   12(4,15),=F'0'
         LTR   5,5
         BE    L607
L670     EQU   *
         L     2,12(5)
         CL    15,0(5)
         BNE   L628
         LTR   2,2
         BNE   L629
         MVC   12(4,5),=F'-1'
         B     L649
L629     EQU   *
         LTR   2,2
         BNL   L652
         L     2,12(15)
         LTR   2,2
         BNL   L632
         MVC   0(4,5),4(15)
         L     2,0(5)
         LTR   2,2
         BE    L633
         ST    5,8(2)
L633     EQU   *
         ST    5,4(15)
         MVC   12(4,5),=F'0'
         MVC   12(4,15),=F'0'
         L     3,8(5)
         ST    15,8(5)
         ST    3,8(15)
         LTR   3,3
         BNE   L684
         ST    15,0(9)
         B     L607
L632     EQU   *
         L     4,4(15)
         MVC   4(4,15),0(4)
         L     2,0(4)
         LTR   2,2
         BE    L639
         ST    15,8(2)
L639     EQU   *
         ST    15,0(4)
         MVC   0(4,5),4(4)
         L     2,0(5)
         LTR   2,2
         BE    L640
         ST    5,8(2)
L640     EQU   *
         ST    5,4(4)
         SLR   3,3
         L     2,12(4)
         LTR   2,2
         BNL   L641
         LA    3,1(0,0)
L641     EQU   *
         ST    3,12(5)
         L     2,12(4)
         L     3,=F'-1'
         LTR   2,2
         BH    L643
         SLR   3,3
L643     EQU   *
         ST    3,12(15)
         MVC   12(4,4),=F'0'
         L     3,8(5)
         ST    4,8(5)
         ST    4,8(15)
         ST    3,8(4)
         LTR   3,3
         BNE   L685
         L     2,=A(@@V23)
         ST    4,0(2)
         B     L607
L628     EQU   *
         LTR   2,2
         BNE   L650
         MVC   12(4,5),=F'1'
         B     L649
L650     EQU   *
         LTR   2,2
         BNH   L652
         L     2,12(15)
         L     4,0(15)
         LTR   2,2
         BNH   L653
         ST    4,4(5)
         LTR   4,4
         BE    L654
         ST    5,8(4)
L654     EQU   *
         ST    5,0(15)
         MVC   12(4,5),=F'0'
         MVC   12(4,15),=F'0'
         L     3,8(5)
         ST    15,8(5)
         ST    3,8(15)
         LTR   3,3
         BE    L655
L684     EQU   *
         L     2,0(3)
         CLR   2,5
         BE    L677
         ST    15,4(3)
         B     L607
L655     EQU   *
         L     2,=A(@@V23)
         ST    15,0(2)
         B     L607
L653     EQU   *
         MVC   0(4,15),4(4)
         L     2,0(15)
         LTR   2,2
         BE    L660
         ST    15,8(2)
L660     EQU   *
         ST    15,4(4)
         MVC   4(4,5),0(4)
         L     2,0(4)
         LTR   2,2
         BE    L661
         ST    5,8(2)
L661     EQU   *
         ST    5,0(4)
         SLR   3,3
         L     2,12(4)
         LTR   2,2
         BNL   L662
         LA    3,1(0,0)
L662     EQU   *
         ST    3,12(15)
         L     2,12(4)
         L     3,=F'-1'
         LTR   2,2
         BH    L664
         SLR   3,3
L664     EQU   *
         ST    3,12(5)
         MVC   12(4,4),=F'0'
         L     3,8(5)
         ST    4,8(5)
         ST    4,8(15)
         ST    3,8(4)
         LTR   3,3
         BE    L665
L685     EQU   *
         L     2,0(3)
         CLR   2,5
         BE    L678
         ST    4,4(3)
         B     L607
L665     EQU   *
         ST    4,0(6)
         B     L607
L652     EQU   *
         MVC   12(4,5),=F'0'
         B     L607
L649     EQU   *
         LR    15,5
         L     5,8(5)
         LTR   5,5
         BNE   L670
L607     EQU   *
* Function add_pending_init epilogue
         PDPEPIL
* Function add_pending_init literal pool
         DS    0F
         LTORG
* Function add_pending_init page table
         DS    0F
PGT33    EQU   *
         DC    A(PG33)
         DS    0F
* Function set_nonincremental_init,F28 prologue
@@F28    PDPPRLG CINDEX=34,FRAME=96,BASER=12,ENTRY=NO
         B     FEN34
         LTORG
FEN34    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG34     EQU   *
         LR    11,1
         L     10,=A(PGT34)
* Function set_nonincremental_init code
         L     4,=A(@@V13)
         L     2,0(4)
         IC    2,8(2)
         CLM   2,1,=XL1'14'
         BE    L687
         CLM   2,1,=XL1'12'
         BNE   L686
L687     EQU   *
         L     3,=A(@@V9)
         L     2,0(3)
L703     EQU   *
         LTR   2,2
         BE    L701
         MVC   88(4,13),12(2)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=A(@@F27)
         BALR  14,15
         L     2,0(2)
         B     L703
L701     EQU   *
         MVC   0(4,3),=F'0'
         L     15,0(4)
         IC    2,8(15)
         CLM   2,1,=XL1'14'
         BNE   L692
         L     3,=A(@@V18)
         MVC   0(4,3),12(15)
         L     15,0(3)
L706     EQU   *
         LTR   15,15
         BE    L696
         L     2,32(15)
         SRL   2,19
         N     2,=F'1'
         LA    4,1(0,0)
         CLR   2,4
         BNE   L696
         L     2,44(15)
         LTR   2,2
         BNE   L696
         L     2,0(3)
         MVC   0(4,3),0(2)
         L     15,0(2)
         B     L706
L692     EQU   *
         CLM   2,1,=XL1'12'
         BNE   L696
         L     2,12(15)
         L     3,=A(@@V17)
         LTR   2,2
         BE    L698
         L     2,=V(SIZETYPE)
         MVC   88(4,13),12(2)
         L     2,12(15)
         MVC   92(4,13),56(2)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    15,0(3)
         B     L696
L698     EQU   *
         L     2,=V(GLOBAL@T)
         MVC   0(4,3),68(2)
L696     EQU   *
         L     2,=A(@@V25)
         MVC   0(4,2),=F'0'
L686     EQU   *
* Function set_nonincremental_init epilogue
         PDPEPIL
* Function set_nonincremental_init literal pool
         DS    0F
         LTORG
* Function set_nonincremental_init page table
         DS    0F
PGT34    EQU   *
         DC    A(PG34)
         DS    0F
* Function find_init_member,F30 prologue
@@F30    PDPPRLG CINDEX=35,FRAME=96,BASER=12,ENTRY=NO
         B     FEN35
         LTORG
FEN35    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG35     EQU   *
         LR    11,1
         L     10,=A(PGT35)
* Function find_init_member code
         L     4,0(11)
         L     2,=A(@@V13)
         L     2,0(2)
         IC    2,8(2)
         CLM   2,1,=XL1'12'
         BNE   L708
         L     2,=A(@@V25)
         L     2,0(2)
         LTR   2,2
         BE    L709
         ST    4,88(13)
         L     2,=A(@@V17)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L709
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
L709     EQU   *
         L     2,=A(@@V23)
L738     EQU   *
         L     2,0(2)
L736     EQU   *
         LTR   2,2
         BE    L717
         ST    4,88(13)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BNE   L738
         MVC   88(4,13),16(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L735
         L     2,4(2)
         B     L736
L708     EQU   *
         CLM   2,1,=XL1'14'
         BNE   L718
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         LR    3,15
         L     2,=A(@@V25)
         L     2,0(2)
         LTR   2,2
         BE    L719
         L     2,=A(@@V18)
         L     2,0(2)
         LTR   2,2
         BE    L720
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L719
L720     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
L719     EQU   *
         L     2,=A(@@V23)
L739     EQU   *
         L     2,0(2)
L737     EQU   *
         LTR   2,2
         BE    L717
         L     15,16(2)
         CLR   4,15
         BE    L735
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BNE   L739
         L     2,4(2)
         B     L737
L718     EQU   *
         CLM   2,1,=XL1'15'
         BNE   L717
         L     2,=A(@@V9)
         L     15,0(2)
         LTR   15,15
         BE    L717
         L     2,12(15)
         CLR   2,4
         BNE   L717
         L     15,16(15)
         B     L707
L735     EQU   *
         L     15,20(2)
         B     L707
L717     EQU   *
         SLR   15,15
L707     EQU   *
* Function find_init_member epilogue
         PDPEPIL
* Function find_init_member literal pool
         DS    0F
         LTORG
* Function find_init_member page table
         DS    0F
PGT35    EQU   *
         DC    A(PG35)
LC42     EQU   *
         DC    C'argument of `asm'' is not a constant string'
         DC    X'0'
         DS    0F
* X-func simple_asm_stmt prologue
SIMPLE@A PDPPRLG CINDEX=36,FRAME=112,BASER=12,ENTRY=YES
         B     FEN36
         LTORG
FEN36    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG36     EQU   *
         LR    11,1
         L     10,=A(PGT36)
* Function simple_asm_stmt code
         L     15,0(11)
         IC    3,8(15)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L742
         L     4,16(15)
         L     2,=V(GLOBAL@T)
         L     5,0(2)
         B     L748
L747     EQU   *
         L     2,4(15)
         L     3,32(2)
         N     3,=F'8323072'
         L     2,4(4)
         L     2,32(2)
         N     2,=F'8323072'
         CLR   3,2
         BNE   L742
         LR    15,4
         IC    3,8(4)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L742
         L     4,16(4)
L748     EQU   *
         CLR   4,5
         BNE   L747
L742     EQU   *
         CLI   8(15),119
         BNE   L744
         L     15,16(15)
L744     EQU   *
         CLI   8(15),29
         BNE   L745
         MVC   88(4,13),=F'162'
         L     2,=V(RIDPOINT)
         L     2,0(2)
         MVC   92(4,13),36(2)
         ST    15,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@94)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ADD@STMT)
         BALR  14,15
         OC    8(4,15),=F'128'
         B     L740
L745     EQU   *
         MVC   88(4,13),=A(LC42)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   15,15
L740     EQU   *
* Function simple_asm_stmt epilogue
         PDPEPIL
* Function simple_asm_stmt literal pool
         DS    0F
         LTORG
* Function simple_asm_stmt page table
         DS    0F
PGT36    EQU   *
         DC    A(PG36)
LC43     EQU   *
         DC    C'case label not within a switch statement'
         DC    X'0'
LC44     EQU   *
         DC    C'`default'' label not within a switch statement'
         DC    X'0'
         DS    0F
* X-func do_case prologue
DO@CASE  PDPPRLG CINDEX=37,FRAME=104,BASER=12,ENTRY=YES
         B     FEN37
         LTORG
FEN37    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG37     EQU   *
         LR    11,1
         L     10,=A(PGT37)
* Function do_case code
         L     15,0(11)
         SLR   4,4
         L     6,=A(@@V28)
         L     3,0(6)
         LTR   3,3
         BE    L750
         LR    5,4
         L     2,0(3)
         L     2,20(2)
         LTR   2,2
         BNE   L751
         LA    5,1(0,0)
L751     EQU   *
         MVC   88(4,13),4(3)
         L     2,0(3)
         MVC   92(4,13),16(2)
         ST    15,96(13)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(C@ADD@CA)
         BALR  14,15
         LR    4,15
         L     2,=V(GLOBAL@T)
         CL    15,0(2)
         BNE   L752
         SLR   4,4
         B     L755
L752     EQU   *
         CLM   5,1,=XL1'00'
         BE    L755
         L     2,0(6)
         L     3,0(2)
         MVC   20(4,3),0(3)
         L     2,0(2)
         MVC   0(4,2),=F'0'
         B     L755
L750     EQU   *
         LTR   15,15
         BE    L756
         MVC   88(4,13),=A(LC43)
         B     L758
L756     EQU   *
         MVC   88(4,13),=A(LC44)
L758     EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L755     EQU   *
         LR    15,4
* Function do_case epilogue
         PDPEPIL
* Function do_case literal pool
         DS    0F
         LTORG
* Function do_case page table
         DS    0F
PGT37    EQU   *
         DC    A(PG37)
         DS    0F
* X-func ZZZ_340 prologue
ZZZ@340  PDPPRLG CINDEX=38,FRAME=96,BASER=12,ENTRY=YES
         B     FEN38
         LTORG
FEN38    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG38     EQU   *
         LR    11,1
         L     10,=A(PGT38)
* Function ZZZ_340 code
         L     4,=A(@@V28)
         L     3,0(4)
         L     2,0(3)
         L     15,20(2)
         LTR   15,15
         BNE   L760
         MVC   20(4,2),0(2)
         L     2,0(3)
         ST    15,0(2)
L760     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@304)
         BALR  14,15
         MVC   0(4,15),0(3)
         L     2,0(4)
         MVC   0(4,4),8(2)
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1927)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function ZZZ_340 epilogue
         PDPEPIL
* Function ZZZ_340 literal pool
         DS    0F
         LTORG
* Function ZZZ_340 page table
         DS    0F
PGT38    EQU   *
         DC    A(PG38)
LC45     EQU   *
         DC    C'pointer of type `void *'' used in subtraction'
         DC    X'0'
LC46     EQU   *
         DC    C'pointer to a function used in subtraction'
         DC    X'0'
LC47     EQU   *
         DC    C'division by zero'
         DC    X'0'
LC48     EQU   *
         DC    C'right shift count is negative'
         DC    X'0'
LC49     EQU   *
         DC    C'right shift count >= width of type'
         DC    X'0'
LC50     EQU   *
         DC    C'left shift count is negative'
         DC    X'0'
LC51     EQU   *
         DC    C'left shift count >= width of type'
         DC    X'0'
LC52     EQU   *
         DC    C'shift count is negative'
         DC    X'0'
LC53     EQU   *
         DC    C'shift count >= width of type'
         DC    X'0'
LC54     EQU   *
         DC    C'comparing floating point with == or != is unsafe'
         DC    X'0'
LC55     EQU   *
         DC    C'ISO C forbids comparison of `void *'' with funct'
         DC    C'ion pointer'
         DC    X'0'
LC56     EQU   *
         DC    C'comparison of distinct pointer types lacks a cas'
         DC    C't'
         DC    X'0'
LC59     EQU   *
         DC    C'comparison of complete and incomplete pointers'
         DC    X'0'
LC58     EQU   *
         DC    C'ISO C forbids ordered comparisons of pointers to'
         DC    C' functions'
         DC    X'0'
LC60     EQU   *
         DC    C'ordered comparison of pointer with integer zero'
         DC    X'0'
LC57     EQU   *
         DC    C'comparison between pointer and integer'
         DC    X'0'
LC61     EQU   *
         DC    C'unordered comparison on non-floating point argum'
         DC    C'ent'
         DC    X'0'
LC62     EQU   *
         DC    C'comparison between signed and unsigned'
         DC    X'0'
LC63     EQU   *
         DC    C'comparison of promoted ~unsigned with constant'
         DC    X'0'
LC64     EQU   *
         DC    C'comparison of promoted ~unsigned with unsigned'
         DC    X'0'
         DS    0F
* X-func build_binary_op prologue
BUILD@BI PDPPRLG CINDEX=39,FRAME=208,BASER=12,ENTRY=YES
         B     FEN39
         LTORG
FEN39    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG39     EQU   *
         LR    11,1
         L     10,=A(PGT39)
* Function build_binary_op code
         MVC   144(4,13),0(11)
         MVC   148(4,13),=F'0'
         MVC   152(4,13),148(13)
         MVC   160(4,13),148(13)
         MVC   156(4,13),160(13)
         MVC   164(4,13),160(13)
         MVC   168(4,13),160(13)
         MVC   172(4,13),160(13)
         MVC   176(4,13),160(13)
         L     2,12(11)
         LTR   2,2
         BE    L762
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    7,15
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    6,15
         B     L763
L762     EQU   *
         L     7,4(11)
         L     6,8(11)
L763     EQU   *
         L     9,4(7)
         MVC   140(4,13),4(6)
         SLR   5,5
         IC    5,8(9)
         L     2,140(13)
         SLR   4,4
         IC    4,8(2)
         IC    3,8(7)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L765
         L     3,16(7)
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         CLR   3,15
         BE    L765
         CL    9,4(3)
         BNE   L765
L766     EQU   *
         LR    7,3
         IC    8,8(3)
         LA    2,144(,8)
         CLM   2,1,=XL1'02'
         BH    L765
         L     3,16(3)
         CLR   3,15
         BE    L765
         L     2,4(7)
         CL    2,4(3)
         BE    L766
L765     EQU   *
         IC    3,8(6)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L768
         L     3,16(6)
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         CLR   3,15
         BE    L768
         L     8,140(13)
         CL    8,4(3)
         BNE   L768
L769     EQU   *
         LR    6,3
         IC    3,8(3)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L768
         L     3,16(6)
         CLR   3,15
         BE    L768
         L     2,4(6)
         CL    2,4(3)
         BE    L769
L768     EQU   *
         LTR   5,5
         L     14,=A(L1014)
         BER   14
         LTR   4,4
         L     14,=A(L1014)
         BER   14
         L     3,0(11)
         A     3,=F'-59'
         LA    8,48(0,0)
         CLR   3,8
         L     14,=A(L772)
         BHR   14
         SLL   3,2
         L     2,=A(L925)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
L925     EQU   *
         DC    A(L773)
         DC    A(L778)
         DC    A(L922)
         DC    A(L805)
         DC    A(L805)
         DC    A(L805)
         DC    A(L805)
         DC    A(L820)
         DC    A(L772)
         DC    A(L820)
         DC    A(L772)
         DC    A(L772)
         DC    A(L805)
         DC    A(L772)
         DC    A(L772)
         DC    A(L772)
         DC    A(L772)
         DC    A(L772)
         DC    A(L772)
         DC    A(L883)
         DC    A(L883)
         DC    A(L772)
         DC    A(L841)
         DC    A(L833)
         DC    A(L849)
         DC    A(L849)
         DC    A(L815)
         DC    A(L815)
         DC    A(L815)
         DC    A(L772)
         DC    A(L829)
         DC    A(L829)
         DC    A(L829)
         DC    A(L829)
         DC    A(L829)
         DC    A(L772)
         DC    A(L893)
         DC    A(L893)
         DC    A(L893)
         DC    A(L893)
         DC    A(L857)
         DC    A(L857)
         DC    A(L921)
         DC    A(L921)
         DC    A(L921)
         DC    A(L921)
         DC    A(L921)
         DC    A(L921)
         DC    A(L921)
L773     EQU   *
         LA    2,13(0,0)
         CLR   5,2
         BNE   L774
         LA    3,6(0,0)
         CLR   4,3
         BNE   L774
         MVC   88(4,13),=F'59'
         B     L1016
L774     EQU   *
         LA    8,13(0,0)
         CLR   4,8
         L     14,=A(L922)
         BNER  14
         LA    2,6(0,0)
         CLR   5,2
         L     14,=A(L922)
         BNER  14
         MVC   88(4,13),=F'59'
         ST    6,92(13)
         ST    7,96(13)
         B     L1015
L778     EQU   *
         LA    3,13(0,0)
         CLR   5,3
         L     14,=A(L922)
         BNER  14
         CLR   4,3
         BNE   L998
         ST    9,88(13)
         MVC   92(4,13),140(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         LTR   15,15
         L     14,=A(L922)
         BER   14
         LR    8,7
         LR    5,6
         L     4,=V(GLOBAL@T)
         L     9,160(4)
         L     2,4(7)
         MVC   180(4,13),4(2)
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BNE   L781
         L     2,=V(WARN@POI)
         L     2,0(2)
         LTR   2,2
         BE    L780
L781     EQU   *
         L     2,180(13)
         CLI   8(2),5
         BNE   L782
         MVC   88(4,13),=A(LC45)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L782     EQU   *
         L     3,180(13)
         CLI   8(3),23
         BNE   L780
         MVC   88(4,13),=A(LC46)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L780     EQU   *
         LR    4,7
         CLI   8(7),113
         BNE   L785
         L     4,16(7)
L785     EQU   *
         LR    3,6
         CLI   8(6),113
         BNE   L787
         L     3,16(6)
L787     EQU   *
         CLI   8(4),59
         BNE   L788
         L     7,20(4)
         L     4,16(4)
         B     L789
L788     EQU   *
         L     2,=V(GLOBAL@T)
         L     7,44(2)
L789     EQU   *
         CLI   8(3),59
         BNE   L790
         L     2,20(3)
         L     3,16(3)
         B     L791
L790     EQU   *
         L     2,=V(GLOBAL@T)
         L     2,44(2)
L791     EQU   *
         ST    4,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1613)
         BALR  14,15
         LTR   15,15
         BE    L792
         LR    8,7
         LR    5,2
L792     EQU   *
         ST    9,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    2,15
         ST    9,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'60'
         ST    2,92(13)
         ST    15,96(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(BUILD@BI)
         BALR  14,15
         LR    8,15
         L     2,4(6)
         L     15,4(2)
         L     2,16(15)
         LTR   2,2
         BNE   L794
         CLI   8(15),5
         BE    L794
         MVC   88(4,13),=A(LC14)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L794     EQU   *
         MVC   88(4,13),180(13)
         LA    1,88(,13)
         L     15,=A(C@SIZE@I)
         BALR  14,15
         LR    5,15
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'71'
         ST    9,92(13)
         ST    8,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         CLR   15,2
         L     14,=A(L761)
         BNER  14
         L     2,8(5)
         N     2,=F'4194304'
         N     2,8(8)
         L     3,8(15)
         N     3,=F'-4194305'
         OR    3,2
         ST    3,8(15)
         L     14,=A(L761)
         BR    14
L998     EQU   *
         LA    3,6(0,0)
         CLR   4,3
         L     14,=A(L922)
         BNER  14
         MVC   88(4,13),=F'60'
L1016    EQU   *
         ST    7,92(13)
         ST    6,96(13)
L1015    EQU   *
         LA    1,88(,13)
         L     15,=V(POINTER@)
         BALR  14,15
         L     14,=A(L761)
         BR    14
L805     EQU   *
         L     2,=V(WARN@DIV)
         L     2,0(2)
         LTR   2,2
         BE    L806
         L     2,=V(SKIP@EVA)
         L     2,0(2)
         LTR   2,2
         BNE   L806
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L806
         MVC   88(4,13),=A(LC47)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L806     EQU   *
         LR    2,5
         A     2,=F'-6'
         LA    8,3(0,0)
         CLR   2,8
         L     14,=A(L772)
         BHR   14
         LR    2,4
         A     2,=F'-6'
         CLR   2,8
         L     14,=A(L772)
         BHR   14
         LA    2,6(0,0)
         CLR   5,2
         BNE   L809
         CLR   4,2
         BE    L808
L809     EQU   *
         MVC   144(4,13),=F'70'
         L     14,=A(L922)
         BR    14
L808     EQU   *
         MVC   164(4,13),=F'0'
         L     3,4(11)
         L     2,4(3)
         B     L1027
L815     EQU   *
         LA    8,6(0,0)
         CLR   5,8
         BNE   L816
         CLR   4,8
         L     14,=A(L772)
         BNER  14
         MVC   164(4,13),=F'-1'
         L     14,=A(L772)
         BR    14
L816     EQU   *
         LA    2,9(0,0)
         CLR   5,2
         L     14,=A(L772)
         BNER  14
         CLR   4,2
         L     14,=A(L772)
         BNER  14
         L     14,=A(L922)
         BR    14
L820     EQU   *
         L     2,=V(WARN@DIV)
         L     2,0(2)
         LTR   2,2
         BE    L821
         L     2,=V(SKIP@EVA)
         L     2,0(2)
         LTR   2,2
         BNE   L821
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L821
         MVC   88(4,13),=A(LC47)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L821     EQU   *
         LA    3,6(0,0)
         CLR   5,3
         L     14,=A(L772)
         BNER  14
         CLR   4,3
         L     14,=A(L772)
         BNER  14
         MVC   164(4,13),=F'0'
         L     8,4(11)
         L     2,4(8)
L1027    EQU   *
         L     2,8(2)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BNE   L824
         CLI   8(6),25
         L     14,=A(L922)
         BNER  14
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1478)
         BALR  14,15
         LTR   15,15
         L     14,=A(L922)
         BNER  14
L824     EQU   *
         MVC   164(4,13),=F'1'
         L     14,=A(L922)
         BR    14
L829     EQU   *
         LA    2,6(0,0)
         CLR   5,2
         BE    L831
         LA    3,13(0,0)
         CLR   5,3
         BE    L831
         LA    8,7(0,0)
         CLR   5,8
         BE    L831
         LA    2,8(0,0)
         CLR   5,2
         L     14,=A(L772)
         BNER  14
L831     EQU   *
         LA    3,6(0,0)
         CLR   4,3
         BE    L832
         LA    8,13(0,0)
         CLR   4,8
         BE    L832
         LA    2,7(0,0)
         CLR   4,2
         BE    L832
         LA    3,8(0,0)
         CLR   4,3
         L     14,=A(L772)
         BNER  14
L832     EQU   *
         L     2,=V(ZZZ@1483)
         MVC   148(4,13),20(2)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@323)
         BALR  14,15
         LR    7,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@323)
         BALR  14,15
         B     L1017
L833     EQU   *
         LA    8,6(0,0)
         CLR   5,8
         L     14,=A(L772)
         BNER  14
         CLR   4,8
         L     14,=A(L772)
         BNER  14
         CLI   8(6),25
         BNE   L851
         L     2,=V(SKIP@EVA)
         L     2,0(2)
         LTR   2,2
         BNE   L851
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1983)
         BALR  14,15
         LTR   15,15
         BNL   L836
         MVC   88(4,13),=A(LC48)
         B     L1005
L836     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L838
         MVC   172(4,13),=F'1'
L838     EQU   *
         ST    6,88(13)
         L     2,32(9)
         SRL   2,23
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BL    L851
         MVC   88(4,13),=A(LC49)
         B     L1005
L841     EQU   *
         LA    3,6(0,0)
         CLR   5,3
         L     14,=A(L772)
         BNER  14
         CLR   4,3
         L     14,=A(L772)
         BNER  14
         CLI   8(6),25
         BNE   L851
         L     2,=V(SKIP@EVA)
         L     2,0(2)
         LTR   2,2
         BNE   L851
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1983)
         BALR  14,15
         LTR   15,15
         BNL   L844
         MVC   88(4,13),=A(LC50)
         B     L1005
L844     EQU   *
         ST    6,88(13)
         L     8,32(9)
         SRL   8,23
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BL    L851
         MVC   88(4,13),=A(LC51)
         B     L1005
L849     EQU   *
         LA    2,6(0,0)
         CLR   5,2
         L     14,=A(L772)
         BNER  14
         CLR   4,2
         L     14,=A(L772)
         BNER  14
         CLI   8(6),25
         BNE   L851
         L     2,=V(SKIP@EVA)
         L     2,0(2)
         LTR   2,2
         BNE   L851
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1983)
         BALR  14,15
         LTR   15,15
         BNL   L852
         MVC   88(4,13),=A(LC52)
         B     L1005
L852     EQU   *
         ST    6,88(13)
         L     3,32(9)
         SRL   3,23
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BL    L851
         MVC   88(4,13),=A(LC53)
L1005    EQU   *
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L851     EQU   *
         ST    9,148(13)
         L     2,4(6)
         L     3,68(2)
         L     2,=V(ZZZ@1483)
         L     2,20(2)
         CLR   3,2
         BE    L855
         ST    2,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
L1017    EQU   *
         LR    6,15
L855     EQU   *
         MVC   152(4,13),=F'1'
         L     14,=A(L772)
         BR    14
L857     EQU   *
         L     2,=V(WARN@FLO)
         L     2,0(2)
         LTR   2,2
         BE    L858
         LA    8,7(0,0)
         CLR   5,8
         BE    L859
         CLR   4,8
         BNE   L858
L859     EQU   *
         MVC   88(4,13),=A(LC54)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L858     EQU   *
         L     2,=V(ZZZ@1483)
         MVC   156(4,13),20(2)
         LR    2,5
         A     2,=F'-6'
         LA    3,2(0,0)
         CLR   2,3
         BH    L860
         LR    2,4
         A     2,=F'-6'
         CLR   2,3
         BH    L860
         MVC   168(4,13),=F'1'
         L     14,=A(L772)
         BR    14
L860     EQU   *
         LA    8,13(0,0)
         CLR   5,8
         BNE   L875
         CLR   4,8
         BNE   L1000
         L     8,4(9)
         L     2,140(13)
         L     3,4(2)
         ST    9,88(13)
         ST    2,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         LTR   15,15
         BNE   L1002
         CLI   8(8),5
         BNE   L865
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L999
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L867
         CL    7,4(11)
         BE    L999
L867     EQU   *
         CLI   8(3),23
         BNE   L999
         B     L1006
L865     EQU   *
         CLI   8(3),5
         BNE   L869
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L999
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L871
         CL    6,8(11)
         BE    L999
L871     EQU   *
         CLI   8(8),23
         BNE   L999
L1006    EQU   *
         MVC   88(4,13),=A(LC55)
         B     L1007
L869     EQU   *
         MVC   88(4,13),=A(LC56)
L1007    EQU   *
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
         B     L999
L1002    EQU   *
         ST    9,88(13)
         MVC   92(4,13),140(13)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         ST    15,148(13)
         LTR   15,15
         L     14,=A(L772)
         BNER  14
L999     EQU   *
         L     2,=V(GLOBAL@T)
         MVC   148(4,13),148(2)
         L     14,=A(L772)
         BR    14
L1000    EQU   *
         CLI   8(6),25
         BNE   L875
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L875
         ST    9,148(13)
         L     14,=A(L772)
         BR    14
L875     EQU   *
         LA    3,13(0,0)
         CLR   4,3
         L     14,=A(L909)
         BNER  14
         CLI   8(7),25
         L     14,=A(L909)
         BNER  14
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         L     14,=A(L909)
         BER   14
         MVC   148(4,13),140(13)
         L     14,=A(L772)
         BR    14
L883     EQU   *
         LR    2,5
         A     2,=F'-6'
         LA    3,1(0,0)
         CLR   2,3
         BH    L884
         LR    2,4
         A     2,=F'-6'
         CLR   2,3
         BH    L884
         ST    3,164(13)
         L     14,=A(L772)
         BR    14
L884     EQU   *
         LA    8,13(0,0)
         CLR   5,8
         L     14,=A(L772)
         BNER  14
         CLR   4,8
         L     14,=A(L772)
         BNER  14
         ST    9,88(13)
         MVC   92(4,13),140(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         LTR   15,15
         L     14,=A(L897)
         BER   14
         ST    9,88(13)
         MVC   92(4,13),140(13)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         ST    15,148(13)
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L772)
         BER   14
         L     2,4(9)
         CLI   8(2),23
         L     14,=A(L772)
         BNER  14
         L     14,=A(L1018)
         BR    14
L893     EQU   *
         L     2,=V(ZZZ@1483)
         MVC   156(4,13),20(2)
         LR    2,5
         A     2,=F'-6'
         LA    3,1(0,0)
         CLR   2,3
         BH    L894
         LR    2,4
         A     2,=F'-6'
         CLR   2,3
         BH    L894
         ST    3,168(13)
         L     14,=A(L772)
         BR    14
L894     EQU   *
         LA    8,13(0,0)
         CLR   5,8
         L     14,=A(L905)
         BNER  14
         CLR   4,8
         L     14,=A(L1001)
         BNER  14
         ST    9,88(13)
         MVC   92(4,13),140(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         LTR   15,15
         L     14,=A(L897)
         BER   14
         ST    9,88(13)
         MVC   92(4,13),140(13)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         ST    15,148(13)
         SLR   15,15
         L     8,4(9)
         L     2,16(8)
         LTR   2,2
         BNE   L899
         LA    15,1(0,0)
L899     EQU   *
         SLR   3,3
         L     2,140(13)
         L     2,4(2)
         L     2,16(2)
         LTR   2,2
         BNE   L900
         LA    3,1(0,0)
L900     EQU   *
         CLR   15,3
         BE    L898
         MVC   88(4,13),=A(LC59)
         L     14,=A(L1009)
         BR    14
L898     EQU   *
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L772)
         BER   14
         CLI   8(8),23
         L     14,=A(L772)
         BNER  14
L1018    EQU   *
         MVC   88(4,13),=A(LC58)
         L     14,=A(L1009)
         BR    14
L897     EQU   *
         L     2,=V(GLOBAL@T)
         MVC   148(4,13),148(2)
         MVC   88(4,13),=A(LC56)
         L     14,=A(L1009)
         BR    14
L1001    EQU   *
         CLI   8(6),25
         L     14,=A(L905)
         BNER  14
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L905
         ST    9,148(13)
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L1019)
         BNER  14
         L     2,=V(EXTRA@WA)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         L     14,=A(L772)
         BER   14
         L     14,=A(L1019)
         BR    14
L905     EQU   *
         LA    3,13(0,0)
         CLR   4,3
         L     14,=A(L909)
         BNER  14
         CLI   8(7),25
         L     14,=A(L909)
         BNER  14
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         L     14,=A(L909)
         BER   14
         MVC   148(4,13),140(13)
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L772)
         BER   14
L1019    EQU   *
         MVC   88(4,13),=A(LC60)
         L     14,=A(L1009)
         BR    14
L909     EQU   *
         LA    8,13(0,0)
         CLR   5,8
         B     PGE39
         DS    0F
         LTORG
         DS    0F
PGE39    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG40     EQU   *
         L     14,=A(L912)
         BNER  14
         LA    2,6(0,0)
         CLR   4,2
         BNE   L772
         ST    9,148(13)
         B     L1008
L912     EQU   *
         L     12,4(,10)
         LA    3,6(0,0)
         CLR   5,3
         BNE   L772
         LA    8,13(0,0)
         CLR   4,8
         BNE   L772
         MVC   148(4,13),140(13)
L1008    EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(LC57)
L1009    EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
         B     L772
L921     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@1483)
         MVC   156(4,13),20(2)
         LA    2,7(0,0)
         CLR   5,2
         BNE   L923
         CLR   4,2
         BE    L922
L923     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(LC61)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     14,=A(L1014)
         BR    14
L922     EQU   *
         L     12,4(,10)
         MVC   176(4,13),=F'1'
L772     EQU   *
         L     12,4(,10)
         LR    2,5
         A     2,=F'-6'
         LA    3,3(0,0)
         CLR   2,3
         L     14,=A(L926)
         BHR   14
         LR    2,4
         A     2,=F'-6'
         CLR   2,3
         L     14,=A(L926)
         BHR   14
         SLR   2,2
         LA    8,8(0,0)
         CLR   5,8
         BE    L927
         CLR   4,8
         BE    L927
         LA    2,1(0,0)
L927     EQU   *
         L     12,4(,10)
         L     3,164(13)
         LTR   3,3
         BNE   L929
         L     4,176(13)
         LTR   4,4
         BNE   L929
         L     5,168(13)
         LTR   5,5
         BE    L930
L929     EQU   *
         L     12,4(,10)
         ST    9,88(13)
         MVC   92(4,13),140(13)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         ST    15,148(13)
         L     8,164(13)
         LTR   8,8
         BE    L930
         LTR   2,2
         BE    L930
         ST    7,88(13)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GET@NARR)
         BALR  14,15
         LR    9,15
         ST    6,88(13)
         LR    3,13
         A     3,=F'108'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GET@NARR)
         BALR  14,15
         LR    5,15
         L     4,148(13)
         L     8,8(4)
         SRL   8,18
         N     8,=F'1'
         ST    4,160(13)
         L     4,4(7)
         L     2,32(4)
         SRL   2,23
         L     3,4(9)
         L     3,32(3)
         SRL   3,23
         CLR   2,3
         BNE   L931
         CL    4,160(13)
         BE    L931
         L     2,8(4)
         SRL   2,18
         N     2,=F'1'
         ST    2,104(13)
L931     EQU   *
         L     12,4(,10)
         L     4,4(6)
         L     2,32(4)
         SRL   2,23
         L     3,4(5)
         L     3,32(3)
         SRL   3,23
         CLR   2,3
         BNE   L932
         CL    4,148(13)
         BE    L932
         L     2,8(4)
         SRL   2,18
         N     2,=F'1'
         ST    2,108(13)
L932     EQU   *
         L     12,4(,10)
         L     3,164(13)
         L     2,=F'-1'
         CR    3,2
         BNE   L933
         L     8,104(13)
L933     EQU   *
         L     12,4(,10)
         L     15,4(9)
         L     3,32(15)
         SRL   3,23
         L     2,148(13)
         L     4,32(2)
         LR    2,4
         SRL   2,23
         CR    3,2
         BNL   L934
         L     2,4(5)
         L     2,32(2)
         SRL   2,23
         CLR   2,3
         BNE   L934
         L     2,104(13)
         CL    2,108(13)
         BNE   L934
         LTR   2,2
         BNE   L935
         LTR   8,8
         BNE   L934
L935     EQU   *
         L     12,4(,10)
         ST    15,88(13)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         MVC   88(4,13),104(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@321)
         BALR  14,15
         ST    15,148(13)
         B     L930
L934     EQU   *
         L     12,4(,10)
         CLI   8(9),25
         BNE   L937
         L     3,108(13)
         LTR   3,3
         BNE   L938
         LTR   8,8
         BNE   L937
L938     EQU   *
         L     12,4(,10)
         L     2,4(5)
         L     2,32(2)
         SRL   2,23
         SRL   4,23
         CR    2,4
         BNL   L937
         ST    3,88(13)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@321)
         BALR  14,15
         LR    2,15
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BNE   L1010
L937     EQU   *
         L     12,4(,10)
         CLI   8(5),25
         BNE   L930
         L     4,104(13)
         LTR   4,4
         BNE   L941
         LTR   8,8
         BNE   L930
L941     EQU   *
         L     12,4(,10)
         L     2,4(9)
         L     3,32(2)
         SRL   3,23
         L     8,148(13)
         L     2,32(8)
         SRL   2,23
         CR    3,2
         BNL   L930
         ST    4,88(13)
         MVC   92(4,13),4(9)
         LA    1,88(,13)
         L     15,=V(ZZZ@321)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BE    L930
L1010    EQU   *
         L     12,4(,10)
         ST    2,148(13)
L930     EQU   *
         L     12,4(,10)
         L     2,172(13)
         LTR   2,2
         BE    L942
         ST    7,88(13)
         LR    3,13
         A     3,=F'112'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GET@NARR)
         BALR  14,15
         LR    4,15
         MVC   160(4,13),148(13)
         CLR   15,7
         BNE   L943
         L     5,160(13)
         C     5,4(7)
         BNE   L943
         L     2,8(5)
         SRL   2,18
         N     2,=F'1'
         ST    2,112(13)
L943     EQU   *
         L     12,4(,10)
         L     2,4(4)
         L     3,32(2)
         SRL   3,23
         L     8,148(13)
         L     2,32(8)
         SRL   2,23
         CR    3,2
         BNL   L942
         ST    6,88(13)
         L     2,4(4)
         L     2,32(2)
         SRL   2,23
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BNL   L942
         L     2,8(8)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BE    L945
         L     2,112(13)
         LTR   2,2
         BE    L942
L945     EQU   *
         L     12,4(,10)
         MVC   88(4,13),112(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@321)
         BALR  14,15
         ST    15,148(13)
         L     2,4(7)
         CLR   2,15
         BE    L946
         ST    15,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    7,15
L946     EQU   *
         L     12,4(,10)
         MVC   152(4,13),=F'1'
L942     EQU   *
         L     12,4(,10)
         L     2,168(13)
         LTR   2,2
         L     14,=A(L926)
         BER   14
         ST    7,116(13)
         ST    6,120(13)
         MVC   124(4,13),148(13)
         MVC   128(4,13),144(13)
         LR    3,13
         A     3,=F'116'
         ST    3,88(13)
         LR    4,13
         A     4,=F'120'
         ST    4,92(13)
         LR    5,13
         A     5,=F'124'
         ST    5,96(13)
         LR    8,13
         A     8,=F'128'
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1904)
         BALR  14,15
         LTR   15,15
         L     14,=A(L761)
         BNER  14
         L     7,116(13)
         L     6,120(13)
         MVC   152(4,13),=F'1'
         MVC   144(4,13),128(13)
         L     2,=V(ZZZ@2038)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L926)
         BER   14
         L     2,=V(SKIP@EVA)
         L     3,0(2)
         LTR   3,3
         L     14,=A(L926)
         BNER  14
         ST    3,184(13)
         L     4,4(11)
         L     2,4(4)
         L     2,8(2)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BNE   L950
         MVC   184(4,13),152(13)
L950     EQU   *
         L     12,4(,10)
         ST    3,188(13)
         L     5,8(11)
         L     2,4(5)
         L     2,8(2)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BNE   L951
         MVC   188(4,13),152(13)
L951     EQU   *
         L     12,4(,10)
         ST    7,88(13)
         LR    8,13
         A     8,=F'132'
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(GET@NARR)
         BALR  14,15
         LR    8,15
         ST    6,88(13)
         LR    2,13
         A     2,=F'136'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GET@NARR)
         BALR  14,15
         LR    9,15
         MVC   116(4,13),4(11)
         MVC   120(4,13),8(11)
         L     3,4(11)
         IC    3,8(3)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L953
         L     4,4(11)
         L     3,16(4)
         L     2,=V(GLOBAL@T)
         L     5,0(2)
         CLR   3,5
         BE    L953
         L     2,4(4)
         CL    2,4(3)
         BNE   L953
L954     EQU   *
         L     12,4(,10)
         LR    4,3
         IC    3,8(3)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L997
         L     3,16(4)
         CLR   3,5
         BE    L997
         L     2,4(4)
         CL    2,4(3)
         BE    L954
L997     EQU   *
         L     12,4(,10)
         ST    4,116(13)
L953     EQU   *
         L     12,4(,10)
         L     4,120(13)
         IC    5,8(4)
         LA    2,144(,5)
         CLM   2,1,=XL1'02'
         BH    L956
         L     3,16(4)
         L     2,=V(GLOBAL@T)
         L     5,0(2)
         CLR   3,5
         BE    L956
         L     2,4(4)
         CL    2,4(3)
         BNE   L956
L957     EQU   *
         L     12,4(,10)
         LR    4,3
         IC    3,8(3)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L996
         L     3,16(4)
         CLR   3,5
         BE    L996
         L     2,4(4)
         CL    2,4(3)
         BE    L957
L996     EQU   *
         L     12,4(,10)
         ST    4,120(13)
L956     EQU   *
         L     12,4(,10)
         L     4,148(13)
         L     2,8(4)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BE    L959
         L     5,184(13)
         CL    5,188(13)
         BE    L959
         L     4,116(13)
         L     3,120(13)
         LR    2,4
         LTR   5,5
         BNE   L963
         LR    2,3
         LR    3,4
L963     EQU   *
         L     12,4(,10)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(C@TREE@E)
         BALR  14,15
         LTR   15,15
         BNE   L959
         CLI   8(3),25
         BNE   L966
         L     2,144(13)
         A     2,=F'-99'
         LA    4,1(0,0)
         CLR   2,4
         BH    L966
         MVC   88(4,13),148(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@322)
         BALR  14,15
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BNE   L959
L966     EQU   *
         L     12,4(,10)
         CLI   8(3),25
         BNE   L968
         L     2,4(3)
         CLI   8(2),10
         BNE   L968
         MVC   88(4,13),148(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@322)
         BALR  14,15
         L     2,4(3)
         MVC   88(4,13),60(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BNE   L959
L968     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(LC62)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L959     EQU   *
         L     12,4(,10)
         SLR   4,4
         IC    3,8(8)
         CLM   3,1,=XL1'58'
         BNE   L971
         LA    4,1(0,0)
L971     EQU   *
         L     12,4(,10)
         IC    2,8(9)
         X     2,=F'88'
         N     2,=XL4'000000FF'
         BCTR  2,0
         SRL   2,31
         CLR   4,2
         BE    L926
         CLM   3,1,=XL1'58'
         BNE   L973
         MVC   88(4,13),16(8)
         LR    5,13
         A     5,=F'132'
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(GET@NARR)
         BALR  14,15
         LR    8,15
         B     L974
L973     EQU   *
         L     12,4(,10)
         MVC   88(4,13),16(9)
         LR    2,13
         A     2,=F'136'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GET@NARR)
         BALR  14,15
         LR    9,15
L974     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BNE   L976
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L975
L976     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L977
         LR    2,9
         L     4,136(13)
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         B     L1011
L977     EQU   *
         L     12,4(,10)
         LR    2,8
         L     4,132(13)
         ST    9,88(13)
         ST    15,92(13)
L1011    EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         L     2,4(2)
         L     3,32(2)
         SRL   3,23
         L     5,148(13)
         L     2,32(5)
         SRL   2,23
         CR    3,2
         BNL   L926
         LA    8,31(0,0)
         CR    3,8
         BH    L926
         LTR   4,4
         BE    L926
         L     2,=F'-1'
         SLL   2,0(3)
         NR    15,2
         CLR   15,2
         BE    L926
         MVC   88(4,13),=A(LC63)
         B     L1012
L975     EQU   *
         L     12,4(,10)
         L     2,132(13)
         LTR   2,2
         BE    L926
         L     2,136(13)
         LTR   2,2
         BE    L926
         L     2,4(8)
         L     2,32(2)
         SRL   2,23
         L     4,148(13)
         L     3,32(4)
         SRL   3,23
         CR    2,3
         BNL   L926
         L     2,4(9)
         L     2,32(2)
         SRL   2,23
         CR    2,3
         BNL   L926
         MVC   88(4,13),=A(LC64)
L1012    EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L926     EQU   *
         L     12,4(,10)
         L     5,148(13)
         LTR   5,5
         BNE   L983
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(BINARY@O)
         BALR  14,15
L1014    EQU   *
         L     12,4(,10)
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         B     L761
L983     EQU   *
         L     12,4(,10)
         L     8,152(13)
         LTR   8,8
         BNE   L984
         L     2,4(7)
         CL    2,148(13)
         BE    L985
         MVC   88(4,13),148(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    7,15
L985     EQU   *
         L     12,4(,10)
         L     2,4(6)
         CL    2,148(13)
         BE    L984
         MVC   88(4,13),148(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    6,15
L984     EQU   *
         L     12,4(,10)
         L     2,156(13)
         LTR   2,2
         BNE   L987
         MVC   156(4,13),148(13)
L987     EQU   *
         L     12,4(,10)
         MVC   88(4,13),144(13)
         MVC   92(4,13),156(13)
         ST    7,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         LR    3,15
         L     2,=A(@@V7)
         L     2,0(2)
         LTR   2,2
         BE    L988
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD@INI)
         BALR  14,15
         B     L1013
L988     EQU   *
         L     12,4(,10)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
L1013    EQU   *
         L     12,4(,10)
         LR    4,15
         CLR   15,3
         BNE   L990
         L     2,8(6)
         N     2,=F'4194304'
         N     2,8(7)
         L     3,8(15)
         N     3,=F'-4194305'
         OR    3,2
         ST    3,8(15)
L990     EQU   *
         L     12,4(,10)
         LR    15,4
         L     3,160(13)
         LTR   3,3
         BE    L761
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
L761     EQU   *
         L     12,4(,10)
* Function build_binary_op epilogue
         PDPEPIL
* Function build_binary_op literal pool
         DS    0F
         LTORG
* Function build_binary_op page table
         DS    0F
PGT39    EQU   *
         DC    A(PG39)
         DC    A(PG40)
LC65     EQU   *
         DC    C'wrong type argument to unary plus'
         DC    X'0'
LC66     EQU   *
         DC    C'wrong type argument to unary minus'
         DC    X'0'
LC67     EQU   *
         DC    C'ISO C does not support `~'' for complex conjugat'
         DC    C'ion'
         DC    X'0'
LC68     EQU   *
         DC    C'wrong type argument to bit-complement'
         DC    X'0'
LC69     EQU   *
         DC    C'wrong type argument to abs'
         DC    X'0'
LC70     EQU   *
         DC    C'wrong type argument to conjugation'
         DC    X'0'
LC71     EQU   *
         DC    C'wrong type argument to unary exclamation mark'
         DC    X'0'
LC72     EQU   *
         DC    C'ISO C does not support `++'' and `--'' on comple'
         DC    C'x types'
         DC    X'0'
LC73     EQU   *
         DC    C'wrong type argument to increment'
         DC    X'0'
LC74     EQU   *
         DC    C'wrong type argument to decrement'
         DC    X'0'
LC75     EQU   *
         DC    C'increment of pointer to unknown structure'
         DC    X'0'
LC76     EQU   *
         DC    C'decrement of pointer to unknown structure'
         DC    X'0'
LC78     EQU   *
         DC    C'invalid lvalue in decrement'
         DC    X'0'
LC77     EQU   *
         DC    C'invalid lvalue in increment'
         DC    X'0'
LC80     EQU   *
         DC    C'decrement'
         DC    X'0'
LC79     EQU   *
         DC    C'increment'
         DC    X'0'
LC81     EQU   *
         DC    C'invalid lvalue in unary `'
         DC    X'50'
         DC    C''''
         DC    X'0'
LC82     EQU   *
         DC    C'attempt to take address of bit-field structure m'
         DC    C'ember `%s'''
         DC    X'0'
         DS    0F
* X-func build_unary_op prologue
BUILD@UN PDPPRLG CINDEX=41,FRAME=104,BASER=12,ENTRY=YES
         B     FEN41
         LTORG
FEN41    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG41     EQU   *
         LR    11,1
         L     10,=A(PGT41)
* Function build_unary_op code
         L     5,0(11)
         L     8,4(11)
         L     9,8(11)
         LR    4,8
         L     6,4(8)
         SLR   3,3
         IC    3,8(6)
         LTR   3,3
         L     14,=A(L1159)
         BER   14
         LR    2,3
         A     2,=F'-10'
         LA    7,1(0,0)
         CLR   2,7
         BH    L1030
         LA    3,6(0,0)
L1030    EQU   *
         LA    2,119(0,0)
         CLR   5,2
         L     14,=A(L1127)
         BER   14
         BH    L1146
         LA    6,88(0,0)
         CLR   5,6
         BE    L1040
         BH    L1147
         LA    7,77(0,0)
         CLR   5,7
         BE    L1036
         LA    2,80(0,0)
         CLR   5,2
         BE    L1049
         L     14,=A(L1151)
         BR    14
L1147    EQU   *
         LA    6,94(0,0)
         CLR   5,6
         BE    L1057
         LA    7,112(0,0)
         CLR   5,7
         BE    L1032
         L     14,=A(L1151)
         BR    14
L1146    EQU   *
         LA    2,126(0,0)
         CLR   5,2
         BE    L1065
         BH    L1148
         LA    7,124(0,0)
         CLR   5,7
         BE    L1053
         LA    2,125(0,0)
         CLR   5,2
         BE    L1060
         L     14,=A(L1151)
         BR    14
L1148    EQU   *
         LA    6,130(0,0)
         CLR   5,6
         L     14,=A(L1151)
         BHR   14
         B     L1073
L1032    EQU   *
         A     3,=F'-6'
         LA    7,2(0,0)
         CLR   3,7
         BNH   L1033
         MVC   88(4,13),=A(LC65)
         L     14,=A(L1160)
         BR    14
L1033    EQU   *
         LTR   9,9
         BNE   L1034
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    4,15
L1034    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(NON@LVAL)
         BALR  14,15
         B     L1158
L1036    EQU   *
         A     3,=F'-6'
         LA    2,3(0,0)
         CLR   3,2
         BNH   L1054
         MVC   88(4,13),=A(LC66)
         L     14,=A(L1160)
         BR    14
L1040    EQU   *
         LA    6,6(0,0)
         CLR   3,6
         BE    L1054
         LA    7,9(0,0)
         CLR   3,7
         BE    L1054
         LA    2,8(0,0)
         CLR   3,2
         BNE   L1045
         LA    5,124(0,0)
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L1054
         MVC   88(4,13),=A(LC67)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
         B     L1054
L1045    EQU   *
         MVC   88(4,13),=A(LC68)
         L     14,=A(L1160)
         BR    14
L1049    EQU   *
         A     3,=F'-6'
         LA    6,1(0,0)
         CLR   3,6
         BNH   L1054
         MVC   88(4,13),=A(LC69)
         L     14,=A(L1160)
         BR    14
L1053    EQU   *
         A     3,=F'-6'
         LA    7,2(0,0)
         CLR   3,7
         BNH   L1054
         MVC   88(4,13),=A(LC70)
         L     14,=A(L1160)
         BR    14
L1054    EQU   *
         LTR   9,9
         L     14,=A(L1151)
         BNER  14
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
L1158    EQU   *
         LR    4,15
         L     14,=A(L1151)
         BR    14
L1057    EQU   *
         LR    2,3
         A     2,=F'-6'
         LA    4,1(0,0)
         CLR   2,4
         BNH   L1058
         LA    5,13(0,0)
         CLR   3,5
         BE    L1058
         LA    6,8(0,0)
         CLR   3,6
         BE    L1058
         LA    7,18(0,0)
         CLR   3,7
         BE    L1058
         LA    2,23(0,0)
         CLR   3,2
         BE    L1058
         MVC   88(4,13),=A(LC71)
         L     14,=A(L1160)
         BR    14
L1058    EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@323)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(INVERT@T)
         BALR  14,15
         L     14,=A(L1028)
         BR    14
L1060    EQU   *
         CLI   8(4),27
         BNE   L1061
         L     15,12(4)
         L     14,=A(L1028)
         BR    14
L1061    EQU   *
         LR    15,8
         CLI   8(6),8
         L     14,=A(L1028)
         BNER  14
         B     L1161
L1065    EQU   *
         CLI   8(4),27
         L     14,=A(L1129)
         BER   14
         CLI   8(6),8
         BNE   L1068
L1161    EQU   *
         ST    5,88(13)
         L     2,4(4)
         MVC   92(4,13),4(2)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         L     14,=A(L1150)
         BR    14
L1068    EQU   *
         ST    6,88(13)
         L     2,=V(GLOBAL@T)
         MVC   92(4,13),44(2)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         L     14,=A(L1028)
         BR    14
L1073    EQU   *
         ST    5,88(13)
         ST    8,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
         LTR   15,15
         L     14,=A(L1028)
         BNER  14
         LA    4,8(0,0)
         CLR   3,4
         BNE   L1075
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L1076
         MVC   88(4,13),=A(LC72)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L1076    EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1943)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'125'
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(BUILD@UN)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'126'
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(BUILD@UN)
         BALR  14,15
         LR    3,15
         ST    5,88(13)
         ST    2,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(BUILD@UN)
         BALR  14,15
         MVC   88(4,13),=F'123'
         MVC   92(4,13),4(4)
         ST    15,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         L     14,=A(L1028)
         BR    14
L1075    EQU   *
         LA    6,13(0,0)
         CLR   3,6
         BE    L1078
         LA    7,6(0,0)
         CLR   3,7
         BE    L1078
         LA    2,7(0,0)
         CLR   3,2
         BE    L1078
         LA    3,128(0,0)
         CLR   5,3
         BE    L1080
         LA    4,130(0,0)
         CLR   5,4
         BNE   L1079
L1080    EQU   *
         MVC   88(4,13),=A(LC73)
         L     14,=A(L1160)
         BR    14
L1079    EQU   *
         MVC   88(4,13),=A(LC74)
         L     14,=A(L1160)
         BR    14
L1078    EQU   *
         L     9,4(8)
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GET@UNWI)
         BALR  14,15
         LR    4,15
         L     7,4(15)
         LA    6,13(0,0)
         CLR   3,6
         BNE   L1082
         L     3,4(9)
         L     2,16(3)
         LTR   2,2
         BNE   L1083
         CLI   8(3),5
         BE    L1083
         LA    2,128(0,0)
         CLR   5,2
         BE    L1085
         LA    3,130(0,0)
         CLR   5,3
         BNE   L1084
L1085    EQU   *
         MVC   88(4,13),=A(LC75)
         B     L1154
L1084    EQU   *
         MVC   88(4,13),=A(LC76)
L1154    EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L1087
L1083    EQU   *
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BNE   L1089
         L     2,=V(WARN@POI)
         L     2,0(2)
         LTR   2,2
         BE    L1087
L1089    EQU   *
         IC    2,8(3)
         CLM   2,1,=XL1'17'
         BE    L1090
         CLM   2,1,=XL1'05'
         BNE   L1087
L1090    EQU   *
         LA    6,128(0,0)
         CLR   5,6
         BE    L1092
         LA    2,130(0,0)
         CLR   5,2
         BNE   L1091
L1092    EQU   *
         MVC   88(4,13),=A(LC73)
         B     L1153
L1091    EQU   *
         MVC   88(4,13),=A(LC74)
L1153    EQU   *
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L1087    EQU   *
         MVC   88(4,13),4(9)
         LA    1,88(,13)
         L     15,=A(C@SIZE@I)
         BALR  14,15
         LR    8,15
         B     L1094
L1082    EQU   *
         L     2,=V(GLOBAL@T)
         L     8,48(2)
L1094    EQU   *
         ST    7,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    8,15
L1095    EQU   *
         SLR   2,2
         IC    2,8(4)
         LA    3,72(0,0)
         CLR   2,3
         BL    L1115
         LA    6,76(0,0)
         CLR   2,6
         BNH   L1104
         A     2,=F'-112'
         LA    3,1(0,0)
         CLR   2,3
         BH    L1115
L1104    EQU   *
         MVC   88(4,13),=F'112'
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         L     15,4(4)
         L     6,16(4)
         L     2,4(6)
         CLC   8(1,15),8(2)
         BNE   L1105
         L     3,32(15)
         N     3,=F'8323072'
         L     2,32(2)
         N     2,=F'8323072'
         CLR   3,2
         BNE   L1105
         LR    4,6
         B     L1095
L1105    EQU   *
         CLI   8(15),11
         BNE   L1107
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BOOLEAN@)
         BALR  14,15
         B     L1155
L1107    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1943)
         BALR  14,15
         LR    4,15
         LR    2,5
         A     2,=F'-127'
         LR    3,15
         LA    6,1(0,0)
         CLR   2,6
         BNH   L1110
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(SAVE@EXP)
         BALR  14,15
         LR    3,15
L1110    EQU   *
         LA    2,128(0,0)
         CLR   5,2
         BE    L1113
         LA    2,60(0,0)
         LA    6,130(0,0)
         CLR   5,6
         BNE   L1112
L1113    EQU   *
         LA    2,59(0,0)
L1112    EQU   *
         ST    2,88(13)
         ST    7,92(13)
         ST    3,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         OC    8(4,15),=F'8388608'
         ST    4,88(13)
         MVC   92(4,13),=F'113'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(BUILD@MO)
         BALR  14,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),4(4)
         ST    15,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
L1155    EQU   *
         LR    3,15
         OC    8(4,15),=F'32768'
         L     14,=A(L1143)
         BR    14
L1115    EQU   *
         ST    4,88(13)
         LA    7,128(0,0)
         CLR   5,7
         BE    L1119
         L     2,=A(LC78)
         LA    3,130(0,0)
         CLR   5,3
         BNE   L1118
L1119    EQU   *
         L     2,=A(LC77)
L1118    EQU   *
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(LVALUE@O)
         BALR  14,15
         LTR   15,15
         L     14,=A(L1159)
         BER   14
         L     2,8(4)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    L1120
         ST    4,88(13)
         LA    6,128(0,0)
         CLR   5,6
         BE    L1123
         L     2,=A(LC80)
         LA    7,130(0,0)
         CLR   5,7
         BNE   L1122
L1123    EQU   *
         L     2,=A(LC79)
L1122    EQU   *
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1739)
         BALR  14,15
L1120    EQU   *
         L     2,4(4)
         CLI   8(2),11
         BNE   L1124
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BOOLEAN@)
         BALR  14,15
         B     L1125
L1124    EQU   *
         ST    5,88(13)
         MVC   92(4,13),4(4)
         ST    4,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
L1125    EQU   *
         OC    8(4,15),=F'8388608'
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         L     3,8(15)
         LR    2,3
         SRL   2,24
         CLR   2,5
         L     14,=A(L1028)
         BER   14
         O     3,=F'8192'
         ST    3,8(15)
         L     14,=A(L1028)
         BR    14
L1127    EQU   *
         IC    2,8(4)
         CLM   2,1,=XL1'2A'
         BNE   L1128
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=A(LVALUE@P)
         BALR  14,15
         LTR   15,15
         BE    L1129
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(NON@LVAL)
         BALR  14,15
         L     14,=A(L1028)
         BR    14
L1129    EQU   *
         L     15,16(4)
         L     14,=A(L1028)
         BR    14
L1128    EQU   *
         CLM   2,1,=XL1'2C'
         BNE   L1130
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=A(C@MARK@A)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L1159
         MVC   88(4,13),=F'59'
         MVC   92(4,13),16(4)
         MVC   96(4,13),20(4)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(BUILD@BI)
         BALR  14,15
         L     14,=A(L1028)
         BR    14
L1130    EQU   *
         ST    5,88(13)
         ST    4,92(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
         LTR   15,15
         L     14,=A(L1028)
         BNER  14
         LA    2,23(0,0)
         CLR   3,2
         BE    L1133
         LTR   9,9
         BNE   L1133
         ST    4,88(13)
         MVC   92(4,13),=A(LC81)
         LA    1,88(,13)
         L     15,=A(LVALUE@O)
         BALR  14,15
         LTR   15,15
         BE    L1159
L1133    EQU   *
         L     7,4(8)
         L     15,8(8)
         LR    3,15
         SRL   3,24
         L     2,=V(ZZZ@1978)
         IC    2,0(2,3)
         CLM   2,1,=XL1'84'
         BE    L1136
         CLM   2,1,=XL1'99'
         BNE   L1135
L1136    EQU   *
         LR    2,15
         N     2,=F'1572864'
         LTR   2,2
         BE    L1135
         ST    7,88(13)
         LR    2,15
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    L1137
         LA    2,1(0,0)
L1137    EQU   *
         SRL   15,20
         N     15,=F'1'
         LTR   15,15
         BE    L1138
         O     2,=F'2'
L1138    EQU   *
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(C@BUILD@)
         BALR  14,15
         LR    7,15
L1135    EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@87)
         BALR  14,15
         LR    7,15
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(C@MARK@A)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L1159
         CLI   8(8),40
         BNE   L1140
         L     4,20(8)
         MVC   88(4,13),=F'119'
         MVC   92(4,13),16(8)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(BUILD@UN)
         BALR  14,15
         L     2,32(4)
         SRL   2,19
         N     2,=F'1'
         LA    5,1(0,0)
         CLR   2,5
         BNE   L1141
         MVC   88(4,13),=A(LC82)
         L     2,44(4)
         MVC   92(4,13),12(2)
L1160    EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L1159    EQU   *
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         B     L1028
L1141    EQU   *
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    2,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(BYTE@POS)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'59'
         ST    7,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         B     L1156
L1140    EQU   *
         MVC   88(4,13),=F'119'
         ST    7,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
L1156    EQU   *
         LR    3,15
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(STATICP)
         BALR  14,15
         LTR   15,15
         BE    L1143
         CLI   8(8),30
         BNE   L1144
         L     2,48(8)
         LTR   2,2
         BE    L1144
         CLI   8(2),39
         BNE   L1143
L1144    EQU   *
         OC    8(4,3),=F'4194304'
L1143    EQU   *
         LR    15,3
         B     L1028
L1151    EQU   *
         L     7,4(4)
         ST    5,88(13)
         ST    7,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         L     2,=A(@@V7)
         L     2,0(2)
         LTR   2,2
         BE    L1150
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD@INI)
         BALR  14,15
         B     L1028
L1150    EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
L1028    EQU   *
* Function build_unary_op epilogue
         PDPEPIL
* Function build_unary_op literal pool
         DS    0F
         LTORG
* Function build_unary_op page table
         DS    0F
PGT41    EQU   *
         DC    A(PG41)
LC83     EQU   *
         DC    C'<12ers'
         DC    X'0'
         DS    0F
* Function default_function_array_conversion,F8 prologue
@@F8     PDPPRLG CINDEX=42,FRAME=104,BASER=12,ENTRY=NO
         B     FEN42
         LTORG
FEN42    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG42     EQU   *
         LR    11,1
         L     10,=A(PGT42)
* Function default_function_array_conversion code
         L     4,0(11)
         L     5,4(4)
         SLR   3,3
         IC    3,8(5)
         SLR   9,9
         LR    6,4
         IC    2,8(4)
         CLM   2,1,=XL1'72'
         BE    L1186
         CLM   2,1,=XL1'71'
         BNE   L1164
         L     2,16(4)
         L     2,4(2)
         CLR   2,5
         BNE   L1164
L1186    EQU   *
         CLI   8(4),114
         BNE   L1166
         LA    9,1(0,0)
L1166    EQU   *
         L     4,16(4)
         IC    2,8(4)
         CLM   2,1,=XL1'72'
         BE    L1186
         CLM   2,1,=XL1'71'
         BNE   L1164
         L     2,16(4)
         L     2,4(2)
         CL    2,4(4)
         BE    L1186
L1164    EQU   *
         MVC   88(4,13),=A(LC83)
         L     8,=V(ZZZ@1978)
         SLR   2,2
         IC    2,8(4)
         SLR   7,7
         IC    7,0(8,2)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L1168
         MVC   12(4,4),12(6)
L1168    EQU   *
         LA    2,23(0,0)
         CLR   3,2
         BNE   L1169
         MVC   88(4,13),=F'119'
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(BUILD@UN)
         BALR  14,15
         B     L1162
L1169    EQU   *
         LR    15,4
         LA    7,18(0,0)
         CLR   3,7
         BNE   L1162
         L     6,4(5)
         SLR   15,15
         LR    7,15
         L     3,8(4)
         LR    2,3
         SRL   2,24
         IC    2,0(8,2)
         CLM   2,1,=XL1'99'
         BE    L1172
         CLM   2,1,=XL1'84'
         BNE   L1171
L1172    EQU   *
         LR    7,3
         SRL   7,19
         N     7,=F'1'
         LR    15,3
         SRL   15,20
         N     15,=F'1'
L1171    EQU   *
         L     2,8(5)
         SRL   2,19
         LR    3,2
         SRL   3,0
         N     3,=F'2'
         N     2,=F'1'
         OR    2,3
         L     3,32(5)
         SRL   3,8
         N     3,=F'4'
         OR    2,3
         LTR   2,2
         BNE   L1174
         LTR   7,7
         BNE   L1174
         LTR   15,15
         BE    L1173
L1174    EQU   *
         ST    6,88(13)
         L     2,8(5)
         SRL   2,19
         LR    3,2
         SRL   3,0
         N     3,=F'2'
         N     2,=F'1'
         OR    2,3
         L     3,32(5)
         SRL   3,8
         N     3,=F'4'
         OR    2,3
         OR    2,7
         AR    15,15
         OR    2,15
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(C@BUILD@)
         BALR  14,15
         LR    6,15
L1173    EQU   *
         IC    2,8(4)
         CLM   2,1,=XL1'2A'
         BNE   L1175
         MVC   88(4,13),40(6)
         MVC   92(4,13),16(4)
         B     L1185
L1175    EQU   *
         CLM   2,1,=XL1'30'
         BNE   L1176
         MVC   88(4,13),20(4)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),4(15)
         MVC   96(4,13),16(4)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         B     L1162
L1176    EQU   *
         SLR   3,3
         LTR   9,9
         BNE   L1177
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(LVALUE@P)
         BALR  14,15
         LTR   15,15
         BE    L1177
         LA    3,1(0,0)
L1177    EQU   *
         L     2,=V(ZZZ@754)
         L     2,0(2)
         LTR   2,2
         BNE   L1178
         LR    15,4
         LTR   3,3
         BE    L1162
L1178    EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@87)
         BALR  14,15
         LR    2,15
         CLI   8(4),34
         BNE   L1179
         MVC   88(4,13),=F'119'
         ST    15,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    3,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(C@MARK@A)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L1180
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         B     L1162
L1180    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STATICP)
         BALR  14,15
         N     15,=F'1'
         SLL   15,22
         L     2,8(3)
         N     2,=F'-12582913'
         OR    2,15
         ST    2,8(3)
         LR    15,3
         B     L1162
L1179    EQU   *
         MVC   88(4,13),=F'119'
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(BUILD@UN)
         BALR  14,15
         ST    2,88(13)
         ST    15,92(13)
L1185    EQU   *
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
L1162    EQU   *
* Function default_function_array_conversion epilogue
         PDPEPIL
* Function default_function_array_conversion literal pool
         DS    0F
         LTORG
* Function default_function_array_conversion page table
         DS    0F
PGT42    EQU   *
         DC    A(PG42)
LC84     EQU   *
         DC    C'asm template is not a string constant'
         DC    X'0'
LC85     EQU   *
         DC    C'%s qualifier ignored on asm'
         DC    X'0'
LC86     EQU   *
         DC    C'invalid lvalue in asm statement'
         DC    X'0'
         DS    0F
* X-func build_asm_stmt prologue
BUILD@AS PDPPRLG CINDEX=43,FRAME=112,BASER=12,ENTRY=YES
         B     FEN43
         LTORG
FEN43    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG43     EQU   *
         LR    11,1
         L     10,=A(PGT43)
* Function build_asm_stmt code
         L     7,0(11)
         L     8,8(11)
         L     9,12(11)
         L     2,4(11)
         CLI   8(2),29
         BE    L1188
         MVC   88(4,13),=A(LC84)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   15,15
         B     L1187
L1188    EQU   *
         LTR   7,7
         BE    L1189
         L     2,=V(RIDPOINT)
         L     2,0(2)
         CL    7,36(2)
         BE    L1189
         MVC   88(4,13),=A(LC85)
         MVC   92(4,13),12(7)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         SLR   7,7
L1189    EQU   *
         LR    5,8
         LTR   8,8
         BE    L1213
L1200    EQU   *
         L     4,16(5)
         IC    3,8(4)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L1194
         L     15,16(4)
         L     2,=V(GLOBAL@T)
         L     6,0(2)
         B     L1226
L1225    EQU   *
         L     2,4(4)
         L     3,32(2)
         N     3,=F'8323072'
         L     2,4(15)
         L     2,32(2)
         N     2,=F'8323072'
         CLR   3,2
         BNE   L1194
         LR    4,15
         IC    3,8(15)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L1194
         L     15,16(15)
L1226    EQU   *
         CLR   15,6
         BNE   L1225
L1194    EQU   *
         ST    4,16(5)
L1234    EQU   *
         IC    3,8(4)
         LA    2,144(,3)
         CLM   2,1,=XL1'01'
         BNH   L1224
         CLM   3,1,=XL1'4C'
         BE    L1224
         CLM   3,1,=XL1'48'
         BE    L1224
         CLM   3,1,=XL1'4A'
         BE    L1224
         CLM   3,1,=XL1'4B'
         BE    L1224
         CLM   3,1,=XL1'49'
         BNE   L1216
L1224    EQU   *
         L     4,16(4)
         B     L1234
L1216    EQU   *
         MVC   88(4,13),16(5)
         MVC   92(4,13),=A(LC86)
         LA    1,88(,13)
         L     15,=A(LVALUE@O)
         BALR  14,15
         L     5,0(5)
         LTR   5,5
         BNE   L1200
L1213    EQU   *
         LR    5,8
         LTR   8,8
         BE    L1218
L1207    EQU   *
         L     15,16(5)
         IC    3,8(15)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L1205
         L     4,16(15)
         L     2,=V(GLOBAL@T)
         L     6,0(2)
         B     L1229
L1228    EQU   *
         L     2,4(15)
         L     3,32(2)
         N     3,=F'8323072'
         L     2,4(4)
         L     2,32(2)
         N     2,=F'8323072'
         CLR   3,2
         BNE   L1205
         LR    15,4
         IC    3,8(4)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L1205
         L     4,16(4)
L1229    EQU   *
         CLR   4,6
         BNE   L1228
L1205    EQU   *
         ST    15,16(5)
         L     5,0(5)
         LTR   5,5
         BNE   L1207
L1218    EQU   *
         LR    5,9
         LTR   9,9
         BE    L1221
L1211    EQU   *
         MVC   88(4,13),16(5)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         ST    15,16(5)
         L     5,0(5)
         LTR   5,5
         BNE   L1211
L1221    EQU   *
         MVC   88(4,13),=F'162'
         ST    7,92(13)
         MVC   96(4,13),4(11)
         ST    8,100(13)
         ST    9,104(13)
         MVC   108(4,13),16(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@94)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ADD@STMT)
         BALR  14,15
L1187    EQU   *
* Function build_asm_stmt epilogue
         PDPEPIL
* Function build_asm_stmt literal pool
         DS    0F
         LTORG
* Function build_asm_stmt page table
         DS    0F
PGT43    EQU   *
         DC    A(PG43)
LC87     EQU   *
         DC    C'left-hand operand of comma expression has no eff'
         DC    C'ect'
         DC    X'0'
         DS    0F
* Function internal_build_compound_expr,F14 prologue
@@F14    PDPPRLG CINDEX=44,FRAME=104,BASER=12,ENTRY=NO
         B     FEN44
         LTORG
FEN44    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG44     EQU   *
         LR    11,1
         L     10,=A(PGT44)
* Function internal_build_compound_expr code
         L     3,0(11)
         L     2,0(3)
         LTR   2,2
         BNE   L1236
         L     2,4(11)
         LTR   2,2
         BNE   L1238
         MVC   88(4,13),16(3)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         ST    15,16(3)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L1238
         MVC   88(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(NON@LVAL)
         BALR  14,15
         B     L1235
L1238    EQU   *
         L     15,16(3)
         B     L1235
L1236    EQU   *
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         LR    5,15
         L     15,16(3)
         L     2,8(15)
         SRL   2,23
         N     2,=F'1'
         L     4,=V(ZZZ@2048)
         LTR   2,2
         BNE   L1240
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BE    L1243
         CLI   8(15),112
         BNE   L1242
         L     2,4(15)
         CLI   8(2),5
         BE    L1243
L1242    EQU   *
         MVC   88(4,13),=A(LC87)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     L1243
L1240    EQU   *
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BE    L1243
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(WARN@IF@)
         BALR  14,15
L1243    EQU   *
         MVC   88(4,13),=F'48'
         MVC   92(4,13),4(5)
         MVC   96(4,13),16(3)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
L1235    EQU   *
* Function internal_build_compound_expr epilogue
         PDPEPIL
* Function internal_build_compound_expr literal pool
         DS    0F
         LTORG
* Function internal_build_compound_expr page table
         DS    0F
PGT44    EQU   *
         DC    A(PG44)
         DS    0F
* X-func ZZZ_67 prologue
ZZZ@67   PDPPRLG CINDEX=45,FRAME=96,BASER=12,ENTRY=YES
         B     FEN45
         LTORG
FEN45    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG45     EQU   *
         LR    11,1
         L     10,=A(PGT45)
* Function ZZZ_67 code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
* Function ZZZ_67 epilogue
         PDPEPIL
* Function ZZZ_67 literal pool
         DS    0F
         LTORG
* Function ZZZ_67 page table
         DS    0F
PGT45    EQU   *
         DC    A(PG45)
LC88     EQU   *
         DC    C'void value not ignored as it ought to be'
         DC    X'0'
         DS    0F
* X-func ZZZ_408 prologue
ZZZ@408  PDPPRLG CINDEX=46,FRAME=96,BASER=12,ENTRY=YES
         B     FEN46
         LTORG
FEN46    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG46     EQU   *
         LR    11,1
         L     10,=A(PGT46)
* Function ZZZ_408 code
         L     4,0(11)
         L     5,4(4)
         SLR   6,6
         IC    6,8(5)
         LA    2,23(0,0)
         CLR   6,2
         BE    L1250
         LA    7,18(0,0)
         CLR   6,7
         BNE   L1249
L1250    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         B     L1248
L1249    EQU   *
         IC    3,8(4)
         CLM   3,1,=XL1'20'
         BNE   L1251
         L     4,60(4)
         B     L1252
L1251    EQU   *
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BE    L1252
         CLM   3,1,=XL1'22'
         BNE   L1252
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         LR    4,15
         L     5,4(15)
L1252    EQU   *
         LR    7,4
         B     L1273
L1270    EQU   *
         L     2,16(4)
         L     2,4(2)
         CL    2,4(4)
         BNE   L1255
L1269    EQU   *
         L     4,16(4)
L1273    EQU   *
         IC    2,8(4)
         CLM   2,1,=XL1'72'
         BE    L1269
         CLM   2,1,=XL1'71'
         BE    L1270
L1255    EQU   *
         MVC   88(4,13),=A(LC83)
         SLR   3,3
         IC    3,8(4)
         L     2,=V(ZZZ@1978)
         SLR   8,8
         IC    8,0(2,3)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L1258
         MVC   12(4,4),12(7)
L1258    EQU   *
         LA    2,10(0,0)
         CR    6,2
         BNE   L1259
         L     2,=V(ZZZ@1483)
         L     15,20(2)
         L     2,32(15)
         SRL   2,23
         L     3,32(5)
         SRL   3,23
         CR    2,3
         BNL   L1260
         LR    2,3
L1260    EQU   *
         ST    2,88(13)
         SLR   6,6
         L     3,32(5)
         SRL   3,23
         L     2,32(15)
         SRL   2,23
         CR    3,2
         BL    L1261
         L     2,8(5)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BE    L1261
         LA    6,1(0,0)
L1261    EQU   *
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@325)
         BALR  14,15
         ST    15,88(13)
         B     L1272
L1259    EQU   *
         CLI   8(4),40
         BNE   L1262
         L     3,20(4)
         L     2,32(3)
         SRL   2,19
         N     2,=F'1'
         LA    7,1(0,0)
         CLR   2,7
         BNE   L1262
         MVC   88(4,13),24(3)
         L     3,=V(ZZZ@1483)
         L     2,20(3)
         L     2,32(2)
         SRL   2,23
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BNL   L1262
         MVC   88(4,13),20(3)
         B     L1272
L1262    EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(C@PROMOT)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L1263
         L     2,8(5)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BE    L1264
         L     2,32(5)
         SRL   2,23
         L     5,=V(ZZZ@1483)
         L     3,20(5)
         L     3,32(3)
         SRL   3,23
         CLR   2,3
         BNE   L1264
         MVC   88(4,13),24(5)
         B     L1272
L1264    EQU   *
         L     2,=V(ZZZ@1483)
         MVC   88(4,13),20(2)
L1272    EQU   *
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         B     L1248
L1263    EQU   *
         LR    15,4
         LA    8,5(0,0)
         CLR   6,8
         BNE   L1248
         MVC   88(4,13),=A(LC88)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     2,=V(GLOBAL@T)
         L     15,0(2)
L1248    EQU   *
* Function ZZZ_408 epilogue
         PDPEPIL
* Function ZZZ_408 literal pool
         DS    0F
         LTORG
* Function ZZZ_408 page table
         DS    0F
PGT46    EQU   *
         DC    A(PG46)
LC89     EQU   *
         DC    C'switch quantity not an integer'
         DC    X'0'
LC90     EQU   *
         DC    C'`long'' switch expression not converted to `int'
         DC    C''' in ISO C'
         DC    X'0'
         DS    0F
* X-func c_start_case prologue
C@START@ PDPPRLG CINDEX=47,FRAME=104,BASER=12,ENTRY=YES
         B     FEN47
         LTORG
FEN47    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG47     EQU   *
         LR    11,1
         L     10,=A(PGT47)
* Function c_start_case code
         L     4,0(11)
         L     6,=V(GLOBAL@T)
         L     5,0(6)
         CLR   4,5
         BE    L1275
         L     3,4(4)
         SLR   15,15
         IC    15,8(3)
         LR    5,3
         IC    2,8(3)
         CLM   2,1,=XL1'06'
         BE    L1276
         CLM   2,1,=XL1'0A'
         BE    L1276
         CLM   2,1,=XL1'0B'
         BE    L1276
         CLM   2,1,=XL1'0C'
         BE    L1276
         LTR   15,15
         BE    L1276
         MVC   88(4,13),=A(LC89)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     4,44(6)
         B     L1275
L1276    EQU   *
         L     3,68(3)
         L     2,=V(WARN@TRA)
         L     2,0(2)
         LTR   2,2
         BE    L1278
         L     2,=V(IN@SYSTE)
         L     2,0(2)
         LTR   2,2
         BNE   L1278
         L     2,=V(ZZZ@1483)
         CL    3,28(2)
         BE    L1279
         CL    3,32(2)
         BNE   L1278
L1279    EQU   *
         MVC   88(4,13),=A(LC90)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1278    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    4,15
L1275    EQU   *
         MVC   88(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'159'
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@94)
         BALR  14,15
         ST    15,0(3)
         MVC   88(4,13),=V(CASE@COM)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1933)
         BALR  14,15
         ST    15,4(3)
         L     2,=A(@@V28)
         MVC   8(4,3),0(2)
         ST    3,0(2)
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(ADD@STMT)
         BALR  14,15
* Function c_start_case epilogue
         PDPEPIL
* Function c_start_case literal pool
         DS    0F
         LTORG
* Function c_start_case page table
         DS    0F
PGT47    EQU   *
         DC    A(PG47)
LC91     EQU   *
         DC    C'cannot pass rvalue to reference parameter'
         DC    X'0'
LC92     EQU   *
         DC    C'%s makes qualified function pointer from unquali'
         DC    C'fied'
         DC    X'0'
LC93     EQU   *
         DC    C'%s discards qualifiers from pointer target type'
         DC    X'0'
LC94     EQU   *
         DC    C'ISO C prohibits argument conversion to union typ'
         DC    C'e'
         DC    X'0'
LC95     EQU   *
         DC    C'ISO C forbids %s between function pointer and `v'
         DC    C'oid *'''
         DC    X'0'
LC96     EQU   *
         DC    C'pointer targets in %s differ in signedness'
         DC    X'0'
LC97     EQU   *
         DC    C'%s from incompatible pointer type'
         DC    X'0'
LC98     EQU   *
         DC    C'invalid use of non-lvalue array'
         DC    X'0'
LC99     EQU   *
         DC    C'%s makes pointer from integer without a cast'
         DC    X'0'
LC100    EQU   *
         DC    C'%s makes integer from pointer without a cast'
         DC    X'0'
LC101    EQU   *
         DC    C'incompatible type for argument %d of `%s'''
         DC    X'0'
LC102    EQU   *
         DC    C'incompatible type for argument %d of indirect fu'
         DC    C'nction call'
         DC    X'0'
LC103    EQU   *
         DC    C'incompatible types in %s'
         DC    X'0'
         DS    0F
* Function convert_for_assignment,F15 prologue
@@F15    PDPPRLG CINDEX=48,FRAME=136,BASER=12,ENTRY=NO
         B     FEN48
         LTORG
FEN48    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG48     EQU   *
         LR    11,1
         L     10,=A(PGT48)
* Function convert_for_assignment code
         L     8,4(11)
         L     2,0(11)
         SLR   3,3
         IC    3,8(2)
         CLI   8(8),114
         BNE   L1281
         L     8,16(8)
L1281    EQU   *
         L     2,4(8)
         IC    2,8(2)
         CLM   2,1,=XL1'12'
         BE    L1283
         CLM   2,1,=XL1'17'
         BNE   L1282
L1283    EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         B     L1372
L1282    EQU   *
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BE    L1284
         CLI   8(8),34
         BNE   L1284
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
L1372    EQU   *
         LR    8,15
L1284    EQU   *
         MVC   104(4,13),4(8)
         L     4,104(13)
         SLR   2,2
         IC    2,8(4)
         ST    2,108(13)
         LTR   2,2
         L     14,=A(L1366)
         BER   14
         L     4,0(11)
         L     2,68(4)
         L     4,104(13)
         CL    2,68(4)
         BNE   L1287
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(OVERFLOW)
         BALR  14,15
         L     2,=V(C@LANGUA)
         L     2,0(2)
         N     2,=F'1'
         LTR   2,2
         BE    L1288
         MVC   88(4,13),0(11)
         MVC   92(4,13),104(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(OBJC@COM)
         BALR  14,15
L1288    EQU   *
         LR    15,8
         L     14,=A(L1280)
         BR    14
L1287    EQU   *
         L     4,108(13)
         LA    2,5(0,0)
         CLR   4,2
         BNE   L1289
         MVC   88(4,13),=A(LC88)
         L     14,=A(L1376)
         BR    14
L1289    EQU   *
         LA    2,15(0,0)
         CLR   3,2
         BNE   L1290
         L     4,0(11)
         MVC   88(4,13),4(4)
         MVC   92(4,13),4(8)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BNE   L1295
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(LVALUE@P)
         BALR  14,15
         LTR   15,15
         BNE   L1291
         MVC   88(4,13),=A(LC91)
         L     14,=A(L1376)
         BR    14
L1291    EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(C@MARK@A)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(L1366)
         BER   14
         MVC   88(4,13),4(8)
         LA    1,88(,13)
         L     15,=V(ZZZ@87)
         BALR  14,15
         MVC   88(4,13),=F'119'
         ST    15,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    8,15
         L     2,4(15)
         L     2,4(2)
         L     4,0(11)
         L     3,4(4)
         CLR   2,3
         L     14,=A(L1326)
         BER   14
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@87)
         BALR  14,15
         MVC   88(4,13),=F'113'
         ST    15,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    8,15
         L     14,=A(L1326)
         BR    14
L1290    EQU   *
         LA    2,9(0,0)
         CLR   3,2
         BNE   L1295
         L     4,108(13)
         CLR   4,2
         BNE   L1295
         L     4,=V(TARGETM)
         MVC   88(4,13),0(11)
         L     2,308(4)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(L1378)
         BNER  14
         MVC   88(4,13),104(13)
         L     2,308(4)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(L1378)
         BNER  14
L1295    EQU   *
         LR    2,3
         A     2,=F'-6'
         LA    4,1(0,0)
         CLR   2,4
         BNH   L1299
         LA    2,10(0,0)
         CLR   3,2
         BE    L1299
         LA    4,8(0,0)
         CLR   3,4
         BE    L1299
         LA    2,11(0,0)
         CLR   3,2
         BNE   L1298
L1299    EQU   *
         L     2,108(13)
         A     2,=F'-6'
         LA    4,1(0,0)
         CLR   2,4
         BNH   L1300
         L     4,108(13)
         LA    2,10(0,0)
         CLR   4,2
         BE    L1300
         LA    2,8(0,0)
         CLR   4,2
         BE    L1300
         LA    2,11(0,0)
         CLR   4,2
         BNE   L1298
L1300    EQU   *
         MVC   88(4,13),0(11)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@207)
         BALR  14,15
         L     14,=A(L1280)
         BR    14
L1298    EQU   *
         LA    4,21(0,0)
         CLR   3,4
         BNE   L1302
         L     3,0(11)
         L     2,32(3)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L1294)
         BER   14
         L     4,8(11)
         LTR   4,4
         L     14,=A(L1294)
         BNER  14
         ST    4,116(13)
         MVC   112(4,13),12(3)
L1373    EQU   *
         L     2,112(13)
         LTR   2,2
         BE    L1304
         L     3,112(13)
         MVC   120(4,13),4(3)
         L     4,120(13)
         MVC   88(4,13),68(4)
         L     2,104(13)
         MVC   92(4,13),68(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BNE   L1304
         CLI   8(4),13
         BNE   L1305
         L     4,108(13)
         LA    3,13(0,0)
         CLR   4,3
         BNE   L1308
         L     2,120(13)
         MVC   124(4,13),4(2)
         L     3,104(13)
         L     9,4(3)
         L     4,124(13)
         CLI   8(4),5
         BE    L1310
         CLI   8(9),5
         BE    L1310
         ST    2,88(13)
         ST    3,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         LTR   15,15
         BE    L1308
L1310    EQU   *
         L     2,124(13)
         L     7,8(2)
         LR    3,7
         SRL   3,19
         N     3,=F'1'
         LR    2,7
         SRL   2,19
         N     2,=F'2'
         OR    3,2
         L     4,124(13)
         L     6,32(4)
         LR    2,6
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         L     15,8(9)
         LR    4,15
         SRL   4,19
         N     4,=F'1'
         LR    2,15
         SRL   2,19
         N     2,=F'2'
         OR    4,2
         L     5,32(9)
         LR    2,5
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         CLR   3,4
         BE    L1304
         CLI   8(9),23
         BNE   L1313
         L     2,124(13)
         CLI   8(2),23
         BNE   L1313
         OR    3,4
         CLR   3,4
         BE    L1304
         B     L1311
L1313    EQU   *
         SRL   7,19
         LR    2,7
         SRL   2,0
         N     2,=F'2'
         LR    3,7
         N     3,=F'1'
         OR    3,2
         SRL   6,8
         N     6,=F'4'
         OR    3,6
         SRL   15,19
         LR    2,15
         SRL   2,0
         N     2,=F'2'
         N     15,=F'1'
         OR    15,2
         SRL   5,8
         N     5,=F'4'
         OR    15,5
         OR    15,3
         CLR   15,3
         BE    L1304
L1311    EQU   *
         L     3,116(13)
         LTR   3,3
         BNE   L1308
         MVC   116(4,13),120(13)
L1308    EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L1317
         CLI   8(8),113
         BNE   L1305
         MVC   88(4,13),16(8)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L1305
L1317    EQU   *
         L     2,=V(GLOBAL@T)
         L     8,56(2)
         B     L1304
L1305    EQU   *
         L     4,112(13)
         MVC   112(4,13),0(4)
         B     L1373
L1304    EQU   *
         L     3,112(13)
         LTR   3,3
         BNE   L1321
         L     4,116(13)
         LTR   4,4
         L     14,=A(L1371)
         BER   14
         L     6,4(4)
         L     2,104(13)
         L     5,4(2)
         CLI   8(5),23
         BNE   L1322
         CLI   8(6),23
         BNE   L1322
         L     4,8(6)
         SRL   4,19
         LR    2,4
         SRL   2,0
         N     2,=F'2'
         N     4,=F'1'
         OR    4,2
         L     2,32(6)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         L     3,8(5)
         SRL   3,19
         LR    2,3
         SRL   2,0
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         X     3,=F'-1'
         NR    4,3
         LTR   4,4
         BE    L1321
         MVC   88(4,13),=A(LC92)
         B     L1374
L1322    EQU   *
         L     4,8(5)
         SRL   4,19
         LR    2,4
         SRL   2,0
         N     2,=F'2'
         N     4,=F'1'
         OR    4,2
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         L     3,8(6)
         SRL   3,19
         LR    2,3
         SRL   2,0
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(6)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         X     3,=F'-1'
         NR    4,3
         LTR   4,4
         BE    L1321
         MVC   88(4,13),=A(LC93)
L1374    EQU   *
         MVC   92(4,13),=F'0'
         MVC   96(4,13),16(11)
         MVC   100(4,13),20(11)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
L1321    EQU   *
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L1326
         L     2,12(11)
         L     2,28(2)
         SRL   2,15
         N     2,=F'1'
         LTR   2,2
         BNE   L1326
         MVC   88(4,13),=A(LC94)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L1326    EQU   *
         MVC   88(4,13),=F'113'
         MVC   92(4,13),0(11)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         L     14,=A(L1280)
         BR    14
L1302    EQU   *
         LA    4,13(0,0)
         CLR   3,4
         BE    L1329
         LA    2,15(0,0)
         CLR   3,2
         L     14,=A(L1328)
         BNER  14
L1329    EQU   *
         L     4,108(13)
         CLR   4,3
         L     14,=A(L1328)
         BNER  14
         L     2,0(11)
         L     5,4(2)
         L     3,104(13)
         L     6,4(3)
         MVC   128(4,13),=F'0'
         IC    4,131(13)
         L     3,=V(TARGETM)
         ST    2,88(13)
         L     2,308(3)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L1331
         MVC   88(4,13),104(13)
         L     2,308(3)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L1330
L1331    EQU   *
         CLI   8(5),9
         BNE   L1330
         CLI   8(6),9
         BNE   L1330
         LA    4,1(0,0)
L1330    EQU   *
         CLI   8(5),5
         BE    L1333
         CLI   8(6),5
         BE    L1333
         MVC   88(4,13),0(11)
         MVC   92(4,13),104(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         ST    15,128(13)
         LTR   15,15
         BNE   L1333
         CLM   4,1,=XL1'00'
         BNE   L1333
         MVC   88(4,13),68(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@327)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),68(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@327)
         BALR  14,15
         CLR   2,15
         BNE   L1332
L1333    EQU   *
         L     4,=V(ZZZ@1636)
         L     2,0(4)
         LTR   2,2
         BE    L1334
         CLI   8(5),5
         BNE   L1336
         CLI   8(6),23
         BE    L1335
L1336    EQU   *
         CLI   8(6),5
         BNE   L1334
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L1337
         CLI   8(8),113
         BNE   L1334
L1337    EQU   *
         CLI   8(5),23
         BNE   L1334
L1335    EQU   *
         MVC   88(4,13),=A(LC95)
         B     L1375
L1334    EQU   *
         IC    7,8(6)
         CLM   7,1,=XL1'17'
         BE    L1339
         IC    9,8(5)
         CLM   9,1,=XL1'17'
         BE    L1339
         L     4,8(6)
         SRL   4,19
         LR    2,4
         SRL   2,0
         N     2,=F'2'
         N     4,=F'1'
         OR    4,2
         L     2,32(6)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         L     3,8(5)
         SRL   3,19
         LR    2,3
         SRL   2,0
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         X     3,=F'-1'
         NR    4,3
         LTR   4,4
         BE    L1340
         MVC   88(4,13),=A(LC93)
         B     L1375
L1340    EQU   *
         CLM   9,1,=XL1'05'
         BE    L1378
         CLM   7,1,=XL1'05'
         BE    L1378
         L     2,128(13)
         LTR   2,2
         BNE   L1378
         L     3,=V(ZZZ@1636)
         L     2,0(3)
         LTR   2,2
         BE    L1378
         MVC   88(4,13),=A(LC96)
         B     L1375
L1339    EQU   *
         CLI   8(5),23
         BNE   L1378
         CLM   7,1,=XL1'17'
         BNE   L1378
         L     4,8(5)
         SRL   4,19
         LR    2,4
         SRL   2,0
         N     2,=F'2'
         N     4,=F'1'
         OR    4,2
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         L     3,8(6)
         SRL   3,19
         LR    2,3
         SRL   2,0
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(6)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         X     3,=F'-1'
         NR    4,3
         LTR   4,4
         BE    L1378
         MVC   88(4,13),=A(LC92)
         B     L1375
L1332    EQU   *
         MVC   88(4,13),=A(LC97)
L1375    EQU   *
         MVC   92(4,13),8(11)
         MVC   96(4,13),16(11)
         MVC   100(4,13),20(11)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
         B     L1378
L1328    EQU   *
         LA    4,13(0,0)
         CLR   3,4
         BNE   L1353
         L     3,108(13)
         LA    2,18(0,0)
         CLR   3,2
         BNE   L1370
         MVC   88(4,13),=A(LC98)
         B     L1376
L1370    EQU   *
         L     2,108(13)
         LA    4,6(0,0)
         CLR   2,4
         BNE   L1294
         CLI   8(8),25
         BNE   L1355
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L1378
L1355    EQU   *
         CLI   8(8),113
         BNE   L1356
         L     2,4(8)
         CLI   8(2),6
         BNE   L1356
         L     2,16(8)
         CLI   8(2),25
         BNE   L1356
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L1378
L1356    EQU   *
         MVC   88(4,13),=A(LC99)
         B     L1375
L1353    EQU   *
         LA    4,6(0,0)
         CLR   3,4
         BNE   L1358
         L     3,108(13)
         LA    2,13(0,0)
         CLR   3,2
         BNE   L1294
         MVC   88(4,13),=A(LC100)
         B     L1375
L1358    EQU   *
         LA    4,11(0,0)
         CLR   3,4
         BNE   L1294
         L     3,108(13)
         LA    2,13(0,0)
         CLR   3,2
         BNE   L1294
L1378    EQU   *
         MVC   88(4,13),0(11)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         B     L1280
L1294    EQU   *
         L     4,8(11)
         LTR   4,4
         BNE   L1361
L1371    EQU   *
         L     2,16(11)
         LTR   2,2
         BE    L1362
         LA    1,88(,13)
         L     15,=V(OBJC@MES)
         BALR  14,15
         LTR   15,15
         BE    L1363
         L     4,20(11)
         LA    3,2(0,0)
         CR    4,3
         BNH   L1363
         MVC   88(4,13),=A(LC101)
         A     4,=F'-2'
         ST    4,92(13)
         MVC   96(4,13),12(15)
         B     L1377
L1363    EQU   *
         MVC   88(4,13),=A(LC101)
         MVC   92(4,13),20(11)
         L     2,16(11)
         MVC   96(4,13),12(2)
L1377    EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L1366
L1362    EQU   *
         MVC   88(4,13),=A(LC102)
         MVC   92(4,13),20(11)
         B     L1376
L1361    EQU   *
         MVC   88(4,13),=A(LC103)
         MVC   92(4,13),8(11)
L1376    EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L1366    EQU   *
         L     2,=V(GLOBAL@T)
         L     15,0(2)
L1280    EQU   *
* Function convert_for_assignment epilogue
         PDPEPIL
* Function convert_for_assignment literal pool
         DS    0F
         LTORG
* Function convert_for_assignment page table
         DS    0F
PGT48    EQU   *
         DC    A(PG48)
LC104    EQU   *
         DC    C'function declared `noreturn'' has a `return'' st'
         DC    C'atement'
         DC    X'0'
LC105    EQU   *
         DC    C'`return'' with no value, in function returning n'
         DC    C'on-void'
         DC    X'0'
LC106    EQU   *
         DC    C'`return'' with a value, in function returning vo'
         DC    C'id'
         DC    X'0'
LC107    EQU   *
         DC    C'return'
         DC    X'0'
LC108    EQU   *
         DC    C'function returns address of local variable'
         DC    X'0'
         DS    0F
* X-func ZZZ_337 prologue
ZZZ@337  PDPPRLG CINDEX=49,FRAME=112,BASER=12,ENTRY=YES
         B     FEN49
         LTORG
FEN49    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG49     EQU   *
         LR    11,1
         L     10,=A(PGT49)
* Function ZZZ_337 code
         L     5,0(11)
         L     6,=V(ZZZ@289)
         L     3,0(6)
         L     2,4(3)
         L     4,4(2)
         L     2,8(3)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BE    L1380
         MVC   88(4,13),=A(LC104)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1380    EQU   *
         LTR   5,5
         BNE   L1381
         L     2,=V(ZZZ@296)
         MVC   0(4,2),=F'1'
         L     2,=V(WARN@RET)
         L     2,0(2)
         LTR   2,2
         BNE   L1383
         L     2,=V(ZZZ@754)
         L     2,0(2)
         LTR   2,2
         BE    L1384
L1383    EQU   *
         LTR   4,4
         BE    L1384
         CLI   8(4),5
         BE    L1384
         MVC   88(4,13),=A(LC105)
         LA    1,88(,13)
         L     15,=V(ZZZ@1640)
         BALR  14,15
         B     L1384
L1381    EQU   *
         LTR   4,4
         BE    L1386
         CLI   8(4),5
         BNE   L1385
L1386    EQU   *
         L     2,=V(ZZZ@296)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BNE   L1388
         L     2,4(5)
         CLI   8(2),5
         BE    L1384
L1388    EQU   *
         MVC   88(4,13),=A(LC106)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
         B     L1384
L1385    EQU   *
         ST    4,88(13)
         ST    5,92(13)
         MVC   96(4,13),=A(LC107)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         LR    4,15
         L     2,0(6)
         L     5,56(2)
         L     2,=V(ZZZ@297)
         MVC   0(4,2),=F'1'
         SLR   15,15
         L     2,=V(GLOBAL@T)
         CL    4,0(2)
         BE    L1379
         MVC   88(4,13),4(5)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    4,15
L1416    EQU   *
         SLR   2,2
         IC    2,8(15)
         LA    3,114(0,0)
         CLR   2,3
         BH    L1410
         LA    7,112(0,0)
         CLR   2,7
         BNL   L1417
         LA    3,59(0,0)
         CLR   2,3
         BE    L1417
         LA    7,60(0,0)
         CLR   2,7
         BE    L1398
         B     L1392
L1410    EQU   *
         LA    3,119(0,0)
         CLR   2,3
         BE    L1404
         B     L1392
L1398    EQU   *
         L     3,20(15)
         B     L1421
L1418    EQU   *
         IC    7,8(3)
         LA    2,144(,7)
         CLM   2,1,=XL1'02'
         BH    L1400
         L     3,16(3)
L1421    EQU   *
         L     2,4(3)
         IC    2,8(2)
         CLM   2,1,=XL1'0D'
         BE    L1400
         CLM   2,1,=XL1'0F'
         BNE   L1418
L1400    EQU   *
         L     2,4(3)
         IC    2,8(2)
         CLM   2,1,=XL1'0D'
         BE    L1392
         CLM   2,1,=XL1'0F'
         BE    L1392
L1417    EQU   *
         L     15,16(15)
         B     L1416
L1404    EQU   *
         L     15,16(15)
         L     3,=V(ZZZ@1978)
L1420    EQU   *
         SLR   2,2
         IC    2,8(15)
         IC    2,0(3,2)
         CLM   2,1,=XL1'99'
         BNE   L1413
         L     15,16(15)
         B     L1420
L1413    EQU   *
         CLI   8(15),34
         BNE   L1392
         L     2,28(15)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         BNE   L1392
         L     2,8(15)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BNE   L1392
         L     2,48(15)
         CL    2,0(6)
         BNE   L1392
         MVC   88(4,13),=A(LC108)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1392    EQU   *
         MVC   88(4,13),=F'49'
         MVC   92(4,13),4(5)
         ST    5,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         LR    5,15
L1384    EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@93)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ADD@STMT)
         BALR  14,15
L1379    EQU   *
* Function ZZZ_337 epilogue
         PDPEPIL
* Function ZZZ_337 literal pool
         DS    0F
         LTORG
* Function ZZZ_337 page table
         DS    0F
PGT49    EQU   *
         DC    A(PG49)
LC109    EQU   *
         DC    C'char-array initialized from wide string'
         DC    X'0'
LC110    EQU   *
         DC    C'int-array initialized from non-wide string'
         DC    X'0'
LC111    EQU   *
         DC    C'initializer-string for array of chars is too lon'
         DC    C'g'
         DC    X'0'
LC112    EQU   *
         DC    C'array initialized from non-constant array expres'
         DC    C'sion'
         DC    X'0'
LC113    EQU   *
         DC    C'initializer element is not constant'
         DC    X'0'
LC114    EQU   *
         DC    C'initialization'
         DC    X'0'
LC115    EQU   *
         DC    C'initializer element is not computable at load ti'
         DC    C'me'
         DC    X'0'
LC116    EQU   *
         DC    C'variable-sized object may not be initialized'
         DC    X'0'
LC117    EQU   *
         DC    C'invalid initializer'
         DC    X'0'
         DS    0F
* Function digest_init,F24 prologue
@@F24    PDPPRLG CINDEX=50,FRAME=112,BASER=12,ENTRY=NO
         B     FEN50
         LTORG
FEN50    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG50     EQU   *
         LR    11,1
         L     10,=A(PGT50)
* Function digest_init code
         L     7,0(11)
         SLR   6,6
         IC    6,8(7)
         L     4,4(11)
         L     9,=V(GLOBAL@T)
         L     3,0(9)
         CLR   7,3
         L     14,=A(L1477)
         BER   14
         CLR   4,3
         L     14,=A(L1477)
         BER   14
         L     2,4(4)
         CLR   2,3
         L     14,=A(L1477)
         BER   14
         CLI   8(4),114
         BNE   L1425
         L     4,16(4)
L1425    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    4,15
         LA    2,18(0,0)
         CLR   6,2
         BNE   L1426
         L     2,4(7)
         L     5,68(2)
         L     8,=V(ZZZ@1483)
         CL    5,0(8)
         BE    L1428
         CL    5,4(8)
         BE    L1428
         CL    5,8(8)
         BE    L1428
         L     2,=V(C@GLOBAL)
         CL    5,8(2)
         BE    L1428
         CL    5,4(2)
         BNE   L1436
L1428    EQU   *
         LTR   4,4
         BE    L1436
         CLI   8(4),29
         BNE   L1436
         L     2,4(4)
         MVC   88(4,13),68(2)
         MVC   92(4,13),68(7)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LR    2,4
         LTR   15,15
         L     14,=A(L1422)
         BNER  14
         L     6,4(4)
         L     2,4(6)
         L     2,68(2)
         L     15,0(8)
         CLR   2,15
         BE    L1430
         L     3,32(5)
         SRL   3,23
         L     2,32(15)
         SRL   2,23
         CLR   3,2
         BNE   L1430
         MVC   88(4,13),=A(LC109)
         L     14,=A(L1476)
         BR    14
L1430    EQU   *
         L     2,4(6)
         L     2,68(2)
         CL    2,0(8)
         BNE   L1431
         L     3,32(5)
         SRL   3,23
         L     2,32(2)
         SRL   2,23
         CLR   3,2
         BE    L1431
         MVC   88(4,13),=A(LC110)
         L     14,=A(L1476)
         BR    14
L1431    EQU   *
         ST    7,4(4)
         L     2,12(7)
         LTR   2,2
         L     14,=A(L1466)
         BER   14
         L     2,16(7)
         LTR   2,2
         L     14,=A(L1466)
         BER   14
         CLI   8(2),25
         L     14,=A(L1466)
         BNER  14
         MVC   88(4,13),20(7)
         L     6,12(4)
         L     2,32(5)
         SRL   2,23
         L     3,0(8)
         L     3,32(3)
         SRL   3,23
         LR    15,6
         BCTR  15,0
         CLR   2,3
         BE    L1434
         L     2,=V(C@GLOBAL)
         L     2,0(2)
         L     2,32(2)
         SRL   2,23
         SRA   2,3
         LR    15,6
         SR    15,2
L1434    EQU   *
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         L     14,=A(L1466)
         BNLR  14
         MVC   88(4,13),=A(LC111)
         LA    1,88(,13)
         L     15,=A(ZZZ@1641)
         BALR  14,15
         L     14,=A(L1466)
         BR    14
L1426    EQU   *
         LA    3,9(0,0)
         CLR   6,3
         BNE   L1436
         L     2,4(15)
         CLI   8(2),9
         BNE   L1436
         ST    2,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(VECTOR@T)
         BALR  14,15
         LTR   15,15
         BE    L1436
         L     2,8(4)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BE    L1436
         CLI   8(4),28
         BNE   L1437
         L     2,4(4)
         MVC   88(4,13),68(2)
         MVC   92(4,13),68(7)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LR    2,4
         LTR   15,15
         L     14,=A(L1422)
         BNER  14
L1437    EQU   *
         CLI   8(4),47
         BNE   L1436
         L     15,16(4)
L1473    EQU   *
         LTR   15,15
         BE    L1440
         L     2,16(15)
         SLR   3,3
         IC    3,8(2)
         L     2,=V(ZZZ@1978)
         IC    2,0(2,3)
         CLM   2,1,=XL1'83'
         BNE   L1440
         L     15,0(15)
         B     L1473
L1440    EQU   *
         LTR   15,15
         BNE   L1436
         ST    7,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(BUILD@VE)
         BALR  14,15
         LR    2,15
         B     L1422
L1436    EQU   *
         LTR   4,4
         BE    L1445
         L     2,4(4)
         LTR   2,2
         BE    L1445
         MVC   88(4,13),68(2)
         MVC   92(4,13),68(7)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BNE   L1446
         LA    2,18(0,0)
         CLR   6,2
         BNE   L1447
         MVC   88(4,13),4(4)
         ST    7,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BNE   L1452
         B     L1448
L1447    EQU   *
         LA    3,9(0,0)
         CLR   6,3
         BNE   L1448
         MVC   88(4,13),4(4)
         ST    7,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BNE   L1472
         B     L1449
L1448    EQU   *
         LA    2,13(0,0)
         CLR   6,2
         BNE   L1449
         L     2,4(4)
         CLI   8(2),18
         BNE   L1470
         MVC   88(4,13),4(2)
         MVC   92(4,13),4(7)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BNE   L1471
         B     L1470
L1449    EQU   *
         LA    3,13(0,0)
         CLR   6,3
         BNE   L1445
L1470    EQU   *
         L     2,4(4)
         CLI   8(2),23
         BNE   L1445
         ST    2,88(13)
         MVC   92(4,13),4(7)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BE    L1445
         B     L1471
L1446    EQU   *
         LA    2,13(0,0)
         CLR   6,2
         BNE   L1450
L1471    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         LR    4,15
         L     2,4(15)
         CLI   8(2),18
         BNE   L1452
         MVC   88(4,13),=A(LC98)
         B     L1476
L1450    EQU   *
         LA    3,9(0,0)
         CLR   6,3
         BNE   L1452
L1472    EQU   *
         ST    7,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    4,15
L1452    EQU   *
         L     2,8(11)
         LTR   2,2
         BE    L1453
         L     2,=V(ZZZ@754)
         L     2,0(2)
         LTR   2,2
         BNE   L1453
         CLI   8(4),167
         BNE   L1453
         L     2,16(4)
         L     2,16(2)
         L     4,60(2)
L1453    EQU   *
         LA    3,18(0,0)
         CLR   6,3
         BNE   L1454
         IC    2,8(4)
         CLM   2,1,=XL1'1D'
         BE    L1454
         CLM   2,1,=XL1'2F'
         BE    L1454
         MVC   88(4,13),=A(LC112)
         B     L1476
L1454    EQU   *
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BE    L1455
         CLI   8(4),34
         BNE   L1455
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         LR    4,15
L1455    EQU   *
         L     2,8(11)
         LTR   2,2
         BE    L1456
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L1456
         CLI   8(4),48
         BNE   L1456
         ST    4,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         LR    4,15
         CL    15,0(9)
         BNE   L1457
         MVC   88(4,13),=A(LC113)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         B     L1458
L1457    EQU   *
         MVC   88(4,13),=A(LC113)
         LA    1,88(,13)
         L     15,=A(ZZZ@1641)
         BALR  14,15
L1458    EQU   *
         L     2,=V(FLAG@PED)
         L     2,0(2)
         LTR   2,2
         BE    L1466
         B     L1478
L1456    EQU   *
         L     3,8(11)
         LTR   3,3
         BE    L1466
         L     2,8(4)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BE    L1479
         ST    4,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1444)
         BALR  14,15
         LTR   15,15
         BNE   L1466
         B     L1479
L1445    EQU   *
         LR    2,6
         A     2,=F'-6'
         LA    3,1(0,0)
         CLR   2,3
         BNH   L1464
         LA    2,13(0,0)
         CLR   6,2
         BE    L1464
         LA    3,10(0,0)
         CLR   6,3
         BE    L1464
         LA    2,11(0,0)
         CLR   6,2
         BE    L1464
         LA    3,8(0,0)
         CLR   6,3
         BNE   L1463
L1464    EQU   *
         ST    7,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),=A(LC114)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         LR    4,15
         L     2,8(11)
         LTR   2,2
         BE    L1465
         L     2,8(15)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BNE   L1465
L1479    EQU   *
         MVC   88(4,13),=A(LC113)
         B     L1475
L1465    EQU   *
         L     3,8(11)
         LTR   3,3
         BE    L1466
         ST    4,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1444)
         BALR  14,15
         LTR   15,15
         BNE   L1466
         MVC   88(4,13),=A(LC115)
L1475    EQU   *
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
L1478    EQU   *
         L     4,0(9)
L1466    EQU   *
         LR    2,4
         B     L1422
L1463    EQU   *
         L     2,16(7)
         LTR   2,2
         BE    L1468
         CLI   8(2),25
         BE    L1468
         MVC   88(4,13),=A(LC116)
         B     L1476
L1468    EQU   *
         MVC   88(4,13),=A(LC117)
L1476    EQU   *
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
L1477    EQU   *
         L     2,0(9)
L1422    EQU   *
         LR    15,2
* Function digest_init epilogue
         PDPEPIL
* Function digest_init literal pool
         DS    0F
         LTORG
* Function digest_init page table
         DS    0F
PGT50    EQU   *
         DC    A(PG50)
LC118    EQU   *
         DC    C'traditional C rejects automatic aggregate initia'
         DC    C'lization'
         DC    X'0'
         DS    0F
* X-func store_init_value prologue
STORE@IN PDPPRLG CINDEX=51,FRAME=104,BASER=12,ENTRY=YES
         B     FEN51
         LTORG
FEN51    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG51     EQU   *
         LR    11,1
         L     10,=A(PGT51)
* Function store_init_value code
         L     4,0(11)
         L     6,4(11)
         L     5,4(4)
         IC    2,8(5)
         CLM   2,1,=XL1'00'
         BE    L1480
         ST    5,88(13)
         ST    6,92(13)
         L     2,8(4)
         SRL   2,13
         N     2,=F'1'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F24)
         BALR  14,15
         LR    3,15
         L     2,=V(WARN@TRA)
         L     2,0(2)
         LTR   2,2
         BE    L1482
         L     2,=V(IN@SYSTE)
         L     2,0(2)
         LTR   2,2
         BNE   L1482
         L     2,4(4)
         IC    2,8(2)
         CLM   2,1,=XL1'12'
         BE    L1483
         CLM   2,1,=XL1'14'
         BE    L1483
         CLM   2,1,=XL1'15'
         BE    L1483
         CLM   2,1,=XL1'16'
         BE    L1483
         CLM   2,1,=XL1'13'
         BNE   L1482
L1483    EQU   *
         L     2,8(4)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BNE   L1482
         MVC   88(4,13),=A(LC118)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1482    EQU   *
         ST    3,60(4)
         IC    4,8(3)
         LA    2,144(,4)
         CLM   2,1,=XL1'02'
         BH    L1485
         L     15,16(3)
         L     2,=V(GLOBAL@T)
         L     4,0(2)
         B     L1493
L1492    EQU   *
         L     2,4(3)
         CL    2,4(15)
         BNE   L1485
         LR    3,15
         IC    7,8(15)
         LA    2,144(,7)
         CLM   2,1,=XL1'02'
         BH    L1485
         L     15,16(15)
L1493    EQU   *
         CLR   15,4
         BNE   L1492
L1485    EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@195)
         BALR  14,15
         CLI   8(5),18
         BNE   L1480
         L     4,12(5)
         LTR   4,4
         BNE   L1480
         L     2,=V(GLOBAL@T)
         CL    3,0(2)
         BE    L1480
         LR    15,6
         CLI   8(6),114
         BNE   L1488
         L     15,16(6)
L1488    EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         CLI   8(15),167
         BNE   L1480
         L     2,16(15)
         L     3,16(2)
         L     2,4(3)
         L     2,12(2)
         LTR   2,2
         BE    L1480
         ST    2,12(5)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(LAYOUT@T)
         BALR  14,15
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(LAYOUT@D)
         BALR  14,15
L1480    EQU   *
* Function store_init_value epilogue
         PDPEPIL
* Function store_init_value literal pool
         DS    0F
         LTORG
* Function store_init_value page table
         DS    0F
PGT51    EQU   *
         DC    A(PG51)
LC119    EQU   *
         DC    C'cast specifies array type'
         DC    X'0'
LC120    EQU   *
         DC    C'cast specifies function type'
         DC    X'0'
LC121    EQU   *
         DC    C'ISO C forbids casting nonscalar to the same type'
         DC    X'0'
LC122    EQU   *
         DC    C'ISO C forbids casts to union type'
         DC    X'0'
LC123    EQU   *
         DC    C'cast to union type from type not present in unio'
         DC    C'n'
         DC    X'0'
LC124    EQU   *
         DC    C'cast adds new qualifiers to function type'
         DC    X'0'
LC125    EQU   *
         DC    C'cast discards qualifiers from pointer target typ'
         DC    C'e'
         DC    X'0'
LC126    EQU   *
         DC    C'cast from pointer to integer of different size'
         DC    X'0'
LC127    EQU   *
         DC    C'cast does not match function type'
         DC    X'0'
LC128    EQU   *
         DC    C'cast to pointer from integer of different size'
         DC    X'0'
LC129    EQU   *
         DC    C'type-punning to incomplete type might break stri'
         DC    C'ct-aliasing rules'
         DC    X'0'
LC130    EQU   *
         DC    C'dereferencing type-punned pointer will break str'
         DC    C'ict-aliasing rules'
         DC    X'0'
LC131    EQU   *
         DC    C'ISO C forbids conversion of function pointer to '
         DC    C'object pointer type'
         DC    X'0'
LC132    EQU   *
         DC    C'ISO C forbids conversion of object pointer to fu'
         DC    C'nction pointer type'
         DC    X'0'
         DS    0F
* X-func build_c_cast prologue
BUILD@C@ PDPPRLG CINDEX=52,FRAME=112,BASER=12,ENTRY=YES
         B     FEN52
         LTORG
FEN52    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG52     EQU   *
         LR    11,1
         L     10,=A(PGT52)
* Function build_c_cast code
         L     6,0(11)
         L     7,4(11)
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         CLR   6,15
         L     14,=A(L1494)
         BER   14
         CLR   7,15
         L     14,=A(L1494)
         BER   14
         L     2,=V(C@LANGUA)
         L     2,0(2)
         N     2,=F'1'
         LTR   2,2
         BE    L1498
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(OBJC@IS@)
         BALR  14,15
         LTR   15,15
         BNE   L1497
L1498    EQU   *
         L     6,68(6)
L1497    EQU   *
         IC    3,8(6)
         CLM   3,1,=XL1'12'
         BNE   L1499
         MVC   88(4,13),=A(LC119)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     3,=V(GLOBAL@T)
         L     15,0(3)
         L     14,=A(L1494)
         BR    14
L1499    EQU   *
         CLM   3,1,=XL1'17'
         BNE   L1500
         MVC   88(4,13),=A(LC120)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     4,=V(GLOBAL@T)
         L     15,0(4)
         L     14,=A(L1494)
         BR    14
L1500    EQU   *
         L     4,4(11)
         L     2,4(4)
         CL    6,68(2)
         BNE   L1501
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L1504)
         BER   14
         LA    2,236(,3)
         CLM   2,1,=XL1'01'
         L     14,=A(L1504)
         BHR   14
         MVC   88(4,13),=A(LC121)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
         L     14,=A(L1504)
         BR    14
L1501    EQU   *
         CLM   3,1,=XL1'15'
         BNE   L1505
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         LR    7,15
         L     3,12(6)
L1539    EQU   *
         LTR   3,3
         BE    L1507
         L     2,4(3)
         MVC   88(4,13),68(2)
         L     2,4(7)
         MVC   92(4,13),68(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BNE   L1507
         L     3,0(3)
         B     L1539
L1507    EQU   *
         LTR   3,3
         BE    L1511
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L1512
         MVC   88(4,13),=A(LC122)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L1512    EQU   *
         ST    3,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(BUILD@TR)
         BALR  14,15
         ST    6,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@70)
         BALR  14,15
         ST    6,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F24)
         BALR  14,15
         L     3,8(7)
         N     3,=F'4194304'
         L     2,8(15)
         N     2,=F'-4194305'
         OR    2,3
         ST    2,8(15)
         L     14,=A(L1494)
         BR    14
L1511    EQU   *
         MVC   88(4,13),=A(LC123)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         L     14,=A(L1494)
         BR    14
L1505    EQU   *
         L     3,=V(GLOBAL@T)
         CL    6,144(3)
         BNE   L1514
         MVC   88(4,13),=F'112'
         ST    6,92(13)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         L     14,=A(L1494)
         BR    14
L1514    EQU   *
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         LR    7,15
         L     8,4(15)
         L     2,=V(ZZZ@2016)
         L     2,0(2)
         LTR   2,2
         BE    L1523
         CLI   8(6),13
         BNE   L1523
         CLI   8(8),13
         BNE   L1523
         LR    15,6
         LR    5,8
         SLR   9,9
         ST    9,104(13)
L1516    EQU   *
         L     5,4(5)
         L     15,4(15)
         MVC   108(1,13),8(5)
         IC    4,108(13)
         CLM   4,1,=XL1'17'
         BNE   L1519
         CLI   8(15),23
         BNE   L1519
         L     4,8(15)
         SRL   4,19
         LR    2,4
         SRL   2,0
         N     2,=F'2'
         N     4,=F'1'
         OR    4,2
         L     2,32(15)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         L     3,8(5)
         SRL   3,19
         LR    2,3
         SRL   2,0
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         X     3,=F'-1'
         NR    4,3
         O     4,104(13)
         ST    4,104(13)
         B     L1518
L1519    EQU   *
         L     4,8(5)
         SRL   4,19
         LR    2,4
         SRL   2,0
         N     2,=F'2'
         N     4,=F'1'
         OR    4,2
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         L     3,8(15)
         SRL   3,19
         LR    2,3
         SRL   2,0
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(15)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         X     3,=F'-1'
         NR    4,3
         OR    9,4
L1518    EQU   *
         CLI   8(15),13
         BNE   L1517
         IC    2,108(13)
         CLM   2,1,=XL1'0D'
         BE    L1516
L1517    EQU   *
         L     3,104(13)
         LTR   3,3
         BE    L1521
         MVC   88(4,13),=A(LC124)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1521    EQU   *
         LTR   9,9
         BE    L1523
         MVC   88(4,13),=A(LC125)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1523    EQU   *
         CLI   8(6),6
         BNE   L1524
         CLI   8(8),13
         BNE   L1524
         L     3,32(6)
         SRL   3,23
         L     2,32(8)
         SRL   2,23
         CLR   3,2
         BE    L1524
         L     2,8(7)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BNE   L1524
         MVC   88(4,13),=A(LC126)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1524    EQU   *
         L     2,=V(WARN@BAD)
         L     2,0(2)
         LTR   2,2
         BE    L1525
         CLI   8(7),54
         BNE   L1525
         CLC   8(1,6),8(8)
         BE    L1525
         MVC   88(4,13),=A(LC127)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1525    EQU   *
         CLI   8(6),13
         BNE   L1526
         CLI   8(8),6
         BNE   L1526
         L     3,32(6)
         SRL   3,23
         L     2,32(8)
         SRL   2,23
         CLR   3,2
         BE    L1526
         L     2,8(7)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BNE   L1526
         MVC   88(4,13),=A(LC128)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1526    EQU   *
         CLI   8(6),13
         BNE   L1527
         CLI   8(8),13
         BNE   L1527
         L     4,4(11)
         CLI   8(4),119
         BNE   L1527
         L     4,16(4)
         SLR   2,2
         IC    2,8(4)
         L     3,=V(ZZZ@1978)
         IC    2,0(3,2)
         CLM   2,1,=XL1'84'
         BNE   L1527
         L     2,=V(ZZZ@809)
         L     2,0(2)
         LTR   2,2
         BE    L1527
         L     2,=V(ZZZ@2040)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L1527
         L     2,4(6)
         CLI   8(2),5
         BE    L1527
         L     2,16(2)
         LTR   2,2
         BNE   L1528
         MVC   88(4,13),=A(LC129)
         B     L1540
L1528    EQU   *
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(GET@ALIA)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(GET@ALIA)
         BALR  14,15
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ALIAS@SE)
         BALR  14,15
         LTR   15,15
         BNE   L1527
         MVC   88(4,13),=A(LC130)
L1540    EQU   *
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1527    EQU   *
         L     3,=V(ZZZ@1636)
         L     2,0(3)
         LTR   2,2
         BE    L1531
         CLI   8(6),13
         BNE   L1531
         CLI   8(8),13
         BNE   L1531
         L     2,4(8)
         CLI   8(2),23
         BNE   L1531
         L     2,4(6)
         CLI   8(2),23
         BE    L1531
         MVC   88(4,13),=A(LC131)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L1531    EQU   *
         L     2,0(3)
         LTR   2,2
         BE    L1532
         CLI   8(6),13
         BNE   L1532
         CLI   8(8),13
         BNE   L1532
         L     2,4(6)
         CLI   8(2),23
         BNE   L1532
         L     2,4(8)
         CLI   8(2),23
         BE    L1532
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L1533
         L     2,4(8)
         L     3,=V(GLOBAL@T)
         CL    2,144(3)
         BNE   L1533
         L     4,4(11)
         CLI   8(4),113
         BNE   L1532
L1533    EQU   *
         MVC   88(4,13),=A(LC132)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L1532    EQU   *
         LR    4,7
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BE    L1534
         CLI   8(7),34
         BNE   L1534
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(DECL@CON)
         BALR  14,15
         LR    7,15
L1534    EQU   *
         ST    6,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    7,15
         CLI   8(15),25
         BNE   L1504
         L     2,8(4)
         N     2,=F'4096'
         L     3,8(15)
         N     3,=F'-4097'
         OR    3,2
         ST    3,8(15)
         L     2,8(4)
         N     2,=F'8192'
         N     3,=F'-8193'
         OR    3,2
         ST    3,8(15)
L1504    EQU   *
         L     3,=V(ZZZ@1636)
         L     2,0(3)
         LTR   2,2
         BE    L1536
         CLI   8(7),25
         BNE   L1536
         L     2,4(11)
         CLI   8(2),25
         BNE   L1536
         L     2,4(2)
         CLI   8(2),6
         BE    L1536
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(NON@LVAL)
         BALR  14,15
         LR    7,15
L1536    EQU   *
         CL    7,4(11)
         BNE   L1537
         L     2,0(3)
         LTR   2,2
         BE    L1537
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(NON@LVAL)
         BALR  14,15
         LR    7,15
L1537    EQU   *
         LR    15,7
L1494    EQU   *
* Function build_c_cast epilogue
         PDPEPIL
* Function build_c_cast literal pool
         DS    0F
         LTORG
* Function build_c_cast page table
         DS    0F
PGT52    EQU   *
         DC    A(PG52)
         DS    0F
* X-func c_cast_expr prologue
C@CAST@E PDPPRLG CINDEX=53,FRAME=96,BASER=12,ENTRY=YES
         B     FEN53
         LTORG
FEN53    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG53     EQU   *
         LR    11,1
         L     10,=A(PGT53)
* Function c_cast_expr code
         L     4,4(11)
         L     2,=V(ZZZ@2041)
         L     3,0(2)
         CLI   8(4),25
         BNE   L1542
         MVC   0(4,2),=F'0'
L1542    EQU   *
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@1075)
         BALR  14,15
         ST    3,0(2)
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(BUILD@C@)
         BALR  14,15
* Function c_cast_expr epilogue
         PDPEPIL
* Function c_cast_expr literal pool
         DS    0F
         LTORG
* Function c_cast_expr page table
         DS    0F
PGT53    EQU   *
         DC    A(PG53)
         DS    0F
* Function output_init_element,F31 prologue
@@F31    PDPPRLG CINDEX=54,FRAME=104,BASER=12,ENTRY=NO
         B     FEN54
         LTORG
FEN54    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG54     EQU   *
         LR    11,1
         L     10,=A(PGT54)
* Function output_init_element code
         L     3,0(11)
         L     5,4(11)
         L     4,8(11)
         L     8,12(11)
         L     6,=V(GLOBAL@T)
         CL    5,0(6)
         BE    L1587
         L     15,4(3)
         IC    2,8(15)
         CLM   2,1,=XL1'17'
         BE    L1546
         CLM   2,1,=XL1'12'
         BNE   L1545
         CLI   8(3),29
         BNE   L1547
         CLI   8(5),18
         BNE   L1547
         L     2,4(5)
         CLI   8(2),6
         BE    L1545
L1547    EQU   *
         MVC   88(4,13),68(15)
         MVC   92(4,13),68(5)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BNE   L1545
L1546    EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    3,15
L1545    EQU   *
         CLI   8(3),167
         BNE   L1548
         L     2,=A(@@V7)
         L     2,0(2)
         LTR   2,2
         BE    L1548
         L     2,=V(ZZZ@754)
         L     2,0(2)
         LTR   2,2
         BNE   L1548
         LTR   8,8
         BE    L1548
         L     2,16(3)
         L     2,16(2)
         L     3,60(2)
L1548    EQU   *
         CL    3,0(6)
         BNE   L1549
         L     2,=A(@@V22)
         MVC   0(4,2),=F'1'
         B     L1550
L1549    EQU   *
         L     15,8(3)
         SRL   15,22
         N     15,=F'1'
         LTR   15,15
         BNE   L1551
         L     2,=A(@@V20)
         ST    15,0(2)
         B     L1550
L1551    EQU   *
         ST    3,88(13)
         MVC   92(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1444)
         BALR  14,15
         LTR   15,15
         BE    L1554
         L     2,=A(@@V13)
         L     2,0(2)
         IC    2,8(2)
         LA    2,236(,2)
         CLM   2,1,=XL1'01'
         BH    L1550
         L     2,32(4)
         SRL   2,19
         N     2,=F'1'
         LA    7,1(0,0)
         CLR   2,7
         BNE   L1550
         CLI   8(3),25
         BE    L1550
L1554    EQU   *
         L     2,=A(@@V21)
         MVC   0(4,2),=F'0'
L1550    EQU   *
         L     7,=A(@@V7)
         L     2,0(7)
         LTR   2,2
         BE    L1555
         L     2,8(3)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BNE   L1555
         MVC   88(4,13),=A(LC113)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         L     3,0(6)
         B     L1556
L1555    EQU   *
         L     2,=A(@@V8)
         L     2,0(2)
         LTR   2,2
         BE    L1556
         ST    3,88(13)
         MVC   92(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1444)
         BALR  14,15
         LTR   15,15
         BNE   L1556
         MVC   88(4,13),=A(LC115)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L1556    EQU   *
         LTR   4,4
         BE    L1558
         L     15,4(4)
         L     2,=V(GLOBAL@T)
         CL    15,0(2)
         BE    L1543
         L     2,16(15)
         LTR   2,2
         BE    L1558
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L1558
         L     2,=A(@@V13)
         L     2,0(2)
         CLI   8(2),18
         BE    L1543
         L     2,0(4)
         LTR   2,2
         BNE   L1543
L1558    EQU   *
         ST    5,88(13)
         ST    3,92(13)
         MVC   96(4,13),0(7)
         LA    1,88(,13)
         L     15,=A(@@F24)
         BALR  14,15
         LR    3,15
         L     7,=V(GLOBAL@T)
         CL    15,0(7)
         BNE   L1560
L1587    EQU   *
         L     2,=A(@@V22)
         MVC   0(4,2),=F'1'
         B     L1543
L1560    EQU   *
         L     6,=A(@@V13)
         L     2,0(6)
         CLI   8(2),18
         BNE   L1561
         L     5,=A(@@V25)
         L     2,0(5)
         LTR   2,2
         BE    L1562
         ST    4,88(13)
         L     2,=A(@@V17)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1561
L1562    EQU   *
         L     2,0(5)
         LTR   2,2
         BE    L1567
         ST    4,88(13)
         L     2,=A(@@V17)
         MVC   92(4,13),0(2)
         B     L1588
L1561    EQU   *
         L     2,0(6)
         CLI   8(2),20
         BNE   L1565
         L     2,=A(@@V25)
         L     15,0(2)
         LTR   15,15
         BE    L1566
         L     2,=A(@@V18)
         CL    4,0(2)
         BE    L1565
L1566    EQU   *
         LTR   15,15
         BE    L1567
         L     5,=A(@@V18)
         L     2,0(5)
         LTR   2,2
         BE    L1585
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         ST    2,88(13)
         ST    15,92(13)
L1588    EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1567
L1585    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
L1567    EQU   *
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F27)
         BALR  14,15
         B     L1543
L1565    EQU   *
         L     2,0(6)
         CLI   8(2),21
         BNE   L1564
         L     5,=A(@@V9)
         L     2,0(5)
         LTR   2,2
         BE    L1564
         L     2,16(2)
         L     2,8(2)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         BE    L1573
         MVC   88(4,13),=A(LC41)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
L1573    EQU   *
         MVC   0(4,5),=F'0'
L1564    EQU   *
         LTR   4,4
         BE    L1574
         CLI   8(4),25
         BNE   L1574
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(COPY@NOD)
         BALR  14,15
         LR    4,15
L1574    EQU   *
         ST    4,88(13)
         ST    3,92(13)
         L     2,=A(@@V9)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,0(2)
         L     2,0(6)
         IC    2,8(2)
         CLM   2,1,=XL1'12'
         BNE   L1575
         MVC   88(4,13),=F'59'
         L     2,=A(@@V17)
         MVC   92(4,13),0(2)
         MVC   96(4,13),72(7)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,0(2)
         B     L1576
L1575    EQU   *
         CLM   2,1,=XL1'14'
         BNE   L1577
         L     3,=A(@@V18)
         L     2,0(3)
         MVC   0(4,3),0(2)
         L     15,0(2)
         LTR   15,15
         BE    L1576
         L     2,32(15)
         SRL   2,19
         N     2,=F'1'
         LA    4,1(0,0)
         CLR   2,4
         BNE   L1576
L1586    EQU   *
         L     2,44(15)
         LTR   2,2
         BNE   L1576
         L     2,0(3)
         MVC   0(4,3),0(2)
         L     15,0(2)
         LTR   15,15
         BE    L1576
         L     2,32(15)
         SRL   2,19
         N     2,=F'1'
         LA    7,1(0,0)
         CLR   2,7
         BNE   L1576
         B     L1586
L1577    EQU   *
         CLM   2,1,=XL1'15'
         BNE   L1576
         L     2,=A(@@V18)
         MVC   0(4,2),=F'0'
L1576    EQU   *
         LTR   8,8
         BE    L1543
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
L1543    EQU   *
* Function output_init_element epilogue
         PDPEPIL
* Function output_init_element literal pool
         DS    0F
         LTORG
* Function output_init_element page table
         DS    0F
PGT54    EQU   *
         DC    A(PG54)
         DS    0F
* Function output_pending_init_elements,F32 prologue
@@F32    PDPPRLG CINDEX=55,FRAME=104,BASER=12,ENTRY=NO
         B     FEN55
         LTORG
FEN55    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG55     EQU   *
         LR    11,1
         L     10,=A(PGT55)
* Function output_pending_init_elements code
         L     7,0(11)
         L     2,=A(@@V23)
         L     3,0(2)
L1590    EQU   *
L1644    EQU   *
         SLR   6,6
L1645    EQU   *
         LTR   3,3
         BE    L1592
         L     5,=A(@@V13)
         L     2,0(5)
         IC    2,8(2)
         CLM   2,1,=XL1'12'
         BNE   L1593
         MVC   88(4,13),16(3)
         L     4,=A(@@V17)
         MVC   92(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L1594
         MVC   88(4,13),20(3)
         L     2,0(5)
         MVC   92(4,13),4(2)
         MVC   96(4,13),0(4)
         B     L1642
L1594    EQU   *
         MVC   88(4,13),0(4)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BNE   L1643
         L     2,4(3)
         LTR   2,2
         BNE   L1641
         B     L1637
L1636    EQU   *
         L     2,4(15)
         CLR   2,3
         BNE   L1603
         LR    3,15
L1637    EQU   *
         L     15,8(3)
         LTR   15,15
         BNE   L1636
L1603    EQU   *
         L     3,8(3)
         LTR   3,3
         BE    L1645
         MVC   88(4,13),0(4)
         MVC   92(4,13),16(3)
         B     L1640
L1593    EQU   *
         LA    2,236(,2)
         CLM   2,1,=XL1'01'
         BH    L1645
         L     5,=A(@@V18)
         L     2,0(5)
         LTR   2,2
         BE    L1592
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L1609
         MVC   0(4,5),16(3)
         MVC   88(4,13),20(3)
         L     2,16(3)
         MVC   92(4,13),4(2)
         MVC   96(4,13),16(3)
L1642    EQU   *
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         B     L1645
L1609    EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1611
L1643    EQU   *
         L     2,0(3)
         LTR   2,2
         BNE   L1641
         B     L1630
L1611    EQU   *
         L     2,4(3)
         LTR   2,2
         BE    L1639
L1641    EQU   *
         LR    3,2
         B     L1645
L1638    EQU   *
         L     2,4(15)
         CLR   2,3
         BNE   L1618
         LR    3,15
L1639    EQU   *
         L     15,8(3)
         LTR   15,15
         BNE   L1638
L1618    EQU   *
         L     3,8(3)
         LTR   3,3
         BE    L1645
         MVC   88(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         ST    4,88(13)
         ST    15,92(13)
L1640    EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BNE   L1630
         B     L1645
L1592    EQU   *
         LTR   7,7
         BE    L1589
         LTR   6,6
         BE    L1589
         L     2,=A(@@V13)
         L     2,0(2)
         IC    15,8(2)
         LA    2,236(,15)
         CLM   2,1,=XL1'01'
         BH    L1624
         L     2,=A(@@V18)
         B     L1634
L1630    EQU   *
         L     6,16(3)
         B     L1592
L1624    EQU   *
         CLM   15,1,=XL1'12'
         BNE   L1644
         L     2,=A(@@V17)
L1634    EQU   *
         ST    6,0(2)
         B     L1644
L1589    EQU   *
* Function output_pending_init_elements epilogue
         PDPEPIL
* Function output_pending_init_elements literal pool
         DS    0F
         LTORG
* Function output_pending_init_elements page table
         DS    0F
PGT55    EQU   *
         DC    A(PG55)
LC133    EQU   *
         DC    C'initialization of flexible array member in a nes'
         DC    C'ted context'
         DC    X'0'
LC134    EQU   *
         DC    C'initialization of a flexible array member'
         DC    X'0'
LC135    EQU   *
         DC    C'missing initializer'
         DC    X'0'
LC136    EQU   *
         DC    C'empty scalar initializer'
         DC    X'0'
LC137    EQU   *
         DC    C'extra elements in scalar initializer'
         DC    X'0'
         DS    0F
* X-func pop_init_level prologue
POP@INIT PDPPRLG CINDEX=56,FRAME=104,BASER=12,ENTRY=YES
         B     FEN56
         LTORG
FEN56    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG56     EQU   *
         LR    11,1
         L     10,=A(PGT56)
* Function pop_init_level code
         SLR   6,6
         L     2,0(11)
         LTR   2,2
         BNE   L1647
         L     3,=A(ZZZ@202)
L1687    EQU   *
         L     2,0(3)
         IC    2,58(2)
         CLM   2,1,=XL1'00'
         BE    L1686
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(POP@INIT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1704)
         BALR  14,15
         B     L1687
L1686    EQU   *
         L     2,=A(ZZZ@201)
         L     2,0(2)
         LTR   2,2
         BE    L1647
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'4845'
         B     L1689
L1647    EQU   *
         L     9,=A(@@V25)
         MVC   0(4,9),=F'1'
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         L     8,=A(ZZZ@202)
         L     5,0(8)
         L     4,=A(@@V13)
         L     3,0(4)
         LTR   3,3
         BE    L1652
         L     7,=A(@@V14)
         L     2,0(7)
         LTR   2,2
         BE    L1652
         CLI   8(3),18
         BNE   L1652
         L     2,12(3)
         LTR   2,2
         BE    L1652
         L     3,60(2)
         LTR   3,3
         BNE   L1652
         L     2,=A(@@V17)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L1653
         ST    3,0(4)
         B     L1652
L1653    EQU   *
         L     2,0(4)
         L     2,16(2)
         LTR   2,2
         BNE   L1655
         L     2,=A(@@V24)
         L     2,0(2)
         LA    3,2(0,0)
         CR    2,3
         BNH   L1656
         MVC   88(4,13),=A(LC133)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         B     L1657
L1656    EQU   *
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L1657
         MVC   88(4,13),=A(LC134)
         LA    1,88(,13)
         L     15,=A(ZZZ@1641)
         BALR  14,15
L1657    EQU   *
         L     2,0(7)
         L     2,0(2)
         LTR   2,2
         BE    L1652
         MVC   0(4,4),=F'0'
         B     L1652
L1655    EQU   *
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'4881'
L1689    EQU   *
         MVC   96(4,13),=A(LC8)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L1652    EQU   *
         L     2,=V(EXTRA@WA)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L1661
         L     2,=A(@@V13)
         L     2,0(2)
         LTR   2,2
         BE    L1661
         CLI   8(2),20
         BNE   L1661
         L     2,=A(@@V18)
         L     2,0(2)
         LTR   2,2
         BE    L1661
         B     L1662
L1665    EQU   *
         L     2,0(3)
         MVC   0(4,3),0(2)
L1662    EQU   *
         L     3,=A(@@V18)
         L     2,0(3)
         LTR   2,2
         BE    L1663
         L     2,24(2)
         LTR   2,2
         BE    L1665
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L1665
L1663    EQU   *
         L     3,0(3)
         LTR   3,3
         BE    L1661
         L     2,=A(@@V11)
         L     2,0(2)
         LTR   2,2
         BNE   L1661
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         MVC   88(4,13),=A(LC135)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         L     2,=A(@@V24)
         L     4,0(2)
         SLL   4,3
         L     3,=A(@@V3)
         L     2,=A(@@V2)
         A     4,0(3)
         ST    4,0(2)
L1661    EQU   *
         L     2,48(5)
         LTR   2,2
         BE    L1667
         LR    6,2
         B     L1668
L1667    EQU   *
         L     4,=A(@@V13)
         L     2,0(4)
         LTR   2,2
         BE    L1668
         IC    3,8(2)
         LA    2,236(,3)
         CLM   2,1,=XL1'01'
         BNH   L1671
         CLM   3,1,=XL1'12'
         BE    L1671
         CLM   3,1,=XL1'09'
         BE    L1671
         L     3,=A(@@V9)
         L     15,0(3)
         LTR   15,15
         BNE   L1672
         L     2,=A(@@V22)
         L     2,0(2)
         LTR   2,2
         BNE   L1688
         MVC   88(4,13),=A(LC136)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         B     L1688
L1672    EQU   *
         L     2,0(15)
         LTR   2,2
         BE    L1675
         MVC   88(4,13),=A(LC137)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         L     2,0(3)
         L     6,16(2)
         B     L1668
L1675    EQU   *
         L     6,16(15)
         B     L1668
L1671    EQU   *
         L     2,=A(@@V22)
         L     2,0(2)
         LTR   2,2
         BE    L1678
L1688    EQU   *
         L     2,=V(GLOBAL@T)
         L     6,0(2)
         B     L1668
L1678    EQU   *
         L     2,=A(@@V9)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(NREVERSE)
         BALR  14,15
         MVC   88(4,13),0(4)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@70)
         BALR  14,15
         LR    6,15
         L     3,=A(@@V20)
         L     2,0(3)
         LTR   2,2
         BE    L1680
         OC    8(4,15),=F'4194304'
L1680    EQU   *
         L     2,0(3)
         LTR   2,2
         BE    L1668
         L     2,=A(@@V21)
         L     2,0(2)
         LTR   2,2
         BE    L1668
         OC    8(4,6),=F'8192'
L1668    EQU   *
         L     2,=A(@@V13)
         MVC   0(4,2),4(5)
         L     2,=A(@@V14)
         MVC   0(4,2),8(5)
         L     2,=A(@@V15)
         MVC   0(4,2),12(5)
         L     2,=A(@@V16)
         MVC   0(4,2),16(5)
         L     2,=A(@@V17)
         MVC   0(4,2),20(5)
         L     2,=A(@@V18)
         MVC   0(4,2),24(5)
         L     2,=A(@@V19)
         MVC   0(4,2),28(5)
         L     2,=A(@@V9)
         MVC   0(4,2),32(5)
         L     2,=A(@@V20)
         SLR   3,3
         IC    3,56(5)
         ST    3,0(2)
         L     2,=A(@@V21)
         SLR   3,3
         IC    3,57(5)
         ST    3,0(2)
         L     2,=A(@@V22)
         SLR   3,3
         IC    3,59(5)
         ST    3,0(2)
         SLR   2,2
         IC    2,61(5)
         ST    2,0(9)
         L     2,=A(@@V11)
         SLR   3,3
         IC    3,62(5)
         ST    3,0(2)
         L     2,=A(@@V23)
         MVC   0(4,2),36(5)
         L     3,=A(@@V24)
         MVC   0(4,3),44(5)
         IC    2,58(5)
         CLM   2,1,=XL1'00'
         BNE   L1682
         L     2,=A(ZZZ@201)
         MVC   0(4,2),52(5)
L1682    EQU   *
         L     4,0(3)
         SLL   4,3
         L     3,=A(@@V3)
         L     2,=A(@@V2)
         A     4,0(3)
         ST    4,0(2)
         MVC   0(4,8),0(5)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    15,6
         LTR   6,6
         BNE   L1646
         L     2,0(8)
         LTR   2,2
         BNE   L1646
         L     2,=V(GLOBAL@T)
         L     15,0(2)
L1646    EQU   *
* Function pop_init_level epilogue
         PDPEPIL
* Function pop_init_level literal pool
         DS    0F
         LTORG
* Function pop_init_level page table
         DS    0F
PGT56    EQU   *
         DC    A(PG56)
LC138    EQU   *
         DC    C'extra brace group at end of initializer'
         DC    X'0'
LC139    EQU   *
         DC    C'missing braces around initializer'
         DC    X'0'
LC140    EQU   *
         DC    C'braces around scalar initializer'
         DC    X'0'
         DS    0F
* X-func push_init_level prologue
PUSH@INI PDPPRLG CINDEX=57,FRAME=152,BASER=12,ENTRY=YES
         B     FEN57
         LTORG
FEN57    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG57     EQU   *
         LR    11,1
         L     10,=A(PGT57)
* Function push_init_level code
         SLR   2,2
         SLR   3,3
         ST    2,128(13)
         ST    3,4+128(13)
         ST    2,136(13)
         ST    3,4+136(13)
         L     8,0(11)
         MVC   112(4,13),=F'0'
         LA    3,1(0,0)
         CLR   8,3
         BE    L1691
         L     4,=A(ZZZ@202)
L1765    EQU   *
         L     2,0(4)
         IC    2,58(2)
         CLM   2,1,=XL1'00'
         BE    L1691
         L     3,=A(@@V13)
         L     2,0(3)
         IC    2,8(2)
         LA    2,236(,2)
         CLM   2,1,=XL1'01'
         BH    L1694
         L     2,=A(@@V14)
         L     2,0(2)
         LTR   2,2
         BE    L1770
L1694    EQU   *
         L     2,0(3)
         CLI   8(2),18
         BNE   L1691
         L     2,=A(@@V16)
         L     2,0(2)
         LTR   2,2
         BE    L1691
         ST    2,88(13)
         L     2,=A(@@V15)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1691
L1770    EQU   *
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(POP@INIT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1704)
         BALR  14,15
         B     L1765
L1691    EQU   *
         LTR   8,8
         BE    L1699
         L     3,=A(@@V13)
         L     2,0(3)
         IC    2,8(2)
         LA    2,236(,2)
         CLM   2,1,=XL1'01'
         BH    L1700
         L     2,=A(@@V14)
         L     2,0(2)
         LTR   2,2
         BE    L1700
         ST    2,88(13)
         B     L1766
L1700    EQU   *
         L     2,0(3)
         CLI   8(2),18
         BNE   L1699
         L     2,=A(@@V15)
         MVC   88(4,13),0(2)
L1766    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         ST    15,112(13)
L1699    EQU   *
         MVC   88(4,13),=F'64'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     7,=A(@@V13)
         MVC   4(4,15),0(7)
         L     4,=A(@@V14)
         MVC   8(4,15),0(4)
         L     5,=A(@@V15)
         MVC   12(4,15),0(5)
         L     9,=A(@@V16)
         MVC   16(4,15),0(9)
         L     2,=A(@@V17)
         MVC   20(4,15),0(2)
         L     3,=A(@@V18)
         MVC   24(4,15),0(3)
         L     4,=A(@@V19)
         MVC   28(4,15),0(4)
         L     5,=A(@@V9)
         MVC   32(4,15),0(5)
         L     2,=A(@@V20)
         MVC   56(1,15),3(2)
         L     3,=A(@@V21)
         MVC   57(1,15),3(3)
         L     2,=A(@@V22)
         MVC   59(1,15),3(2)
         L     5,=A(@@V23)
         MVC   36(4,15),0(5)
         L     6,=A(@@V24)
         MVC   44(4,15),0(6)
         MVC   48(4,15),=F'0'
         STC   8,58(15)
         MVI   60(15),0
         L     4,=A(@@V25)
         MVC   61(1,15),3(4)
         L     4,=A(@@V11)
         MVC   62(1,15),3(4)
         L     2,=A(ZZZ@202)
         MVC   0(4,15),0(2)
         MVC   52(4,15),=F'0'
         ST    15,0(2)
         L     2,=A(@@V20)
         MVC   0(4,2),=F'1'
         MVC   0(4,3),=F'1'
         L     3,=A(@@V2)
         L     2,=A(@@V3)
         L     3,0(3)
         S     3,0(2)
         LR    2,3
         SRA   2,3
         ST    2,0(6)
         L     3,=A(@@V9)
         MVC   0(4,3),=F'0'
         L     2,=A(@@V25)
         MVC   0(4,2),=F'1'
         MVC   0(4,4),=F'0'
         MVC   0(4,5),=F'0'
         LTR   8,8
         BNE   L1703
         L     2,=A(ZZZ@201)
         MVC   52(4,15),0(2)
         ST    8,0(2)
         L     2,=A(@@V26)
         ST    8,0(2)
         L     2,=A(@@V27)
         ST    8,0(2)
L1703    EQU   *
         L     3,0(7)
         LTR   3,3
         BE    L1705
         IC    4,8(3)
         LA    2,236(,4)
         CLM   2,1,=XL1'01'
         BH    L1706
         L     3,=A(@@V14)
         L     2,0(3)
         LTR   2,2
         BNE   L1707
         ST    2,0(7)
         B     L1705
L1707    EQU   *
         MVC   0(4,7),4(2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         L     4,0(6)
         A     4,=F'1'
         ST    4,0(6)
         B     L1705
L1706    EQU   *
         CLM   4,1,=XL1'12'
         BNE   L1705
         MVC   0(4,7),4(3)
         L     5,=A(@@V15)
         MVC   88(4,13),0(5)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
         L     2,0(6)
         A     2,=F'1'
         ST    2,0(6)
L1705    EQU   *
         L     4,0(7)
         LTR   4,4
         BNE   L1711
         MVC   88(4,13),=A(LC138)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         L     3,=A(@@V14)
         ST    4,0(3)
         L     5,=A(@@V18)
         ST    4,0(5)
         L     14,=A(L1690)
         BR    14
L1711    EQU   *
         L     2,112(13)
         LTR   2,2
         BE    L1712
         CLI   8(2),47
         BNE   L1712
         L     2,8(2)
         LR    3,2
         SRL   3,22
         N     3,=F'1'
         L     5,=A(@@V20)
         ST    3,0(5)
         SRL   2,13
         N     2,=F'1'
         L     3,=A(@@V21)
         ST    2,0(3)
         L     5,=A(@@V9)
         L     2,112(13)
         MVC   0(4,5),16(2)
         L     2,0(5)
         LTR   2,2
         BE    L1712
         IC    2,8(4)
         CLM   2,1,=XL1'14'
         BE    L1714
         CLM   2,1,=XL1'12'
         BNE   L1712
L1714    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
L1712    EQU   *
         LA    3,1(0,0)
         CLR   8,3
         BNE   L1715
         L     2,=V(ZZZ@2028)
         L     2,0(2)
         LTR   2,2
         BE    L1715
         L     3,=A(@@V12)
         L     2,0(3)
         LTR   2,2
         BNE   L1715
         ST    8,0(3)
         MVC   88(4,13),=A(LC139)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
L1715    EQU   *
         L     5,=A(@@V13)
         L     4,0(7)
         IC    3,8(4)
         LA    2,236(,3)
         CLM   2,1,=XL1'01'
         BH    L1716
         L     5,=A(@@V14)
         MVC   0(4,5),12(4)
         L     3,0(5)
         LTR   3,3
         BE    L1718
         L     2,32(3)
         SRL   2,19
         N     2,=F'1'
         LA    4,1(0,0)
         CLR   2,4
         BNE   L1718
L1767    EQU   *
         L     2,44(3)
         LTR   2,2
         BNE   L1718
         L     2,0(5)
         MVC   0(4,5),0(2)
         L     3,0(2)
         LTR   3,3
         BE    L1718
         L     2,32(3)
         SRL   2,19
         N     2,=F'1'
         LA    7,1(0,0)
         CLR   2,7
         BE    L1767
L1718    EQU   *
         L     2,=A(@@V14)
         L     8,=A(@@V18)
         MVC   0(4,8),0(2)
         L     2,=V(GLOBAL@T)
         L     3,=A(@@V19)
         MVC   0(4,3),68(2)
         L     14,=A(L1690)
         BR    14
L1716    EQU   *
         CLM   3,1,=XL1'09'
         BNE   L1721
         LH    3,32(4)
         N     3,=F'127'
         L     2,=V(MODE@NUN)
         SLR   4,4
         IC    4,0(2,3)
         LR    2,4
         BCTR  2,0
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    15,0(9)
         L     2,=V(SIZETYPE)
         MVC   88(4,13),12(2)
         L     2,=V(GLOBAL@T)
         MVC   92(4,13),44(2)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         L     5,=A(@@V15)
         ST    15,0(5)
         L     7,=A(@@V17)
         ST    15,0(7)
         L     14,=A(L1690)
         BR    14
L1721    EQU   *
         CLM   3,1,=XL1'12'
         L     14,=A(L1723)
         BNER  14
         L     2,12(4)
         LTR   2,2
         BE    L1724
         MVC   0(4,9),60(2)
         L     2,0(9)
         LTR   2,2
         BNE   L1725
         L     2,16(4)
         LTR   2,2
         BE    L1725
         MVC   88(4,13),=F'-1'
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    15,0(9)
L1725    EQU   *
         L     2,0(9)
         LTR   2,2
         BE    L1726
         CLI   8(2),25
         BE    L1726
         MVC   88(4,13),=F'-1'
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    15,0(9)
L1726    EQU   *
         L     2,=V(SIZETYPE)
         MVC   88(4,13),12(2)
         L     2,0(7)
         L     2,12(2)
         MVC   92(4,13),56(2)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         L     8,=A(@@V15)
         ST    15,0(8)
         B     L1727
L1724    EQU   *
         L     2,=V(GLOBAL@T)
         L     3,=A(@@V15)
         MVC   0(4,3),68(2)
L1727    EQU   *
         L     2,=A(@@V15)
         L     4,=A(@@V17)
         MVC   0(4,4),0(2)
         L     5,112(13)
         LTR   5,5
         L     14,=A(L1690)
         BER   14
         CLI   8(5),29
         L     14,=A(L1690)
         BNER  14
         L     6,=A(@@V13)
         L     2,0(6)
         CLI   8(2),18
         BE    L1729
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'5443'
         B     L1769
L1729    EQU   *
         L     7,112(13)
         L     2,4(7)
         L     2,4(2)
         L     3,32(2)
         SRL   3,23
         L     4,=V(ZZZ@1483)
         L     2,0(4)
         L     2,32(2)
         SRL   2,23
         LA    5,1(0,0)
         CLR   3,2
         BE    L1731
         L     2,=V(C@GLOBAL)
         L     2,0(2)
         L     2,32(2)
         SRL   2,23
         CLR   3,2
         BNE   L1732
         LR    5,3
         SRA   5,3
         B     L1731
L1732    EQU   *
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'5452'
L1769    EQU   *
         MVC   96(4,13),=A(LC8)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L1731    EQU   *
         L     2,0(4)
         L     2,32(2)
         SRL   2,23
         ST    2,124(13)
         L     2,0(6)
         MVC   116(4,13),4(2)
         L     8,112(13)
         L     6,16(8)
         LR    2,6
         A     2,12(8)
         ST    2,120(13)
         L     3,=V(GLOBAL@T)
         L     9,68(3)
         B     L1735
L1759    EQU   *
         LA    4,1(0,0)
         CLR   5,4
         BNE   L1738
         SLR   2,2
         IC    2,0(6)
         AR    6,4
         ST    2,108(13)
         ST    15,104(13)
         B     L1739
L1738    EQU   *
         ST    15,104(13)
         ST    15,108(13)
         CR    15,5
         BNL   L1739
         BCTR  5,0
         L     7,124(13)
         ST    7,140(13)
         L     2,136(13)
         L     3,4+136(13)
         MR    2,5
         ST    2,136(13)
         ST    3,4+136(13)
         A     5,=F'1'
         L     3,140(13)
L1750    EQU   *
         LA    2,4(0,0)
         LA    4,31(0,0)
         CR    3,4
         BNH   L1746
         SLR   2,2
L1746    EQU   *
         LA    4,104(,13)
         LR    8,2
         AR    8,4
         LA    2,4(0,0)
         LA    7,31(0,0)
         CR    3,7
         BNH   L1748
         SLR   2,2
L1748    EQU   *
         AR    2,4
         ST    2,144(13)
         SLR   4,4
         IC    4,0(6)
         LR    2,3
         A     6,=F'1'
         LTR   3,3
         BNL   L1749
         A     2,=F'31'
L1749    EQU   *
         N     2,=F'-32'
         LR    7,3
         SR    7,2
         SLL   4,0(7)
         L     2,144(13)
         O     4,0(2)
         ST    4,0(8)
         A     15,=F'1'
         S     3,124(13)
         CR    15,5
         BL    L1750
L1739    EQU   *
         L     3,116(13)
         L     2,8(3)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BNE   L1751
         BCTR  5,0
         L     4,124(13)
         ST    4,132(13)
         L     2,128(13)
         L     3,4+128(13)
         MR    2,5
         ST    2,128(13)
         ST    3,4+128(13)
         A     5,=F'1'
         L     3,132(13)
         LR    4,3
         A     4,=F'8'
         LA    7,31(0,0)
         CR    4,7
         BH    L1752
         LA    7,108(,13)
         LR    2,3
         A     2,=F'7'
         L     3,0(7)
         LR    8,3
         SRA   8,0(2)
         LR    2,8
         N     2,=F'1'
         LTR   2,2
         BE    L1751
         L     2,=F'-1'
         SLL   2,0(4)
         OR    3,2
         ST    3,0(7)
         B     L1768
L1752    EQU   *
         LA    2,32(0,0)
         CR    4,2
         BNE   L1755
         L     2,108(13)
         LTR   2,2
         BNL   L1751
L1768    EQU   *
         MVC   104(4,13),=F'-1'
         B     L1751
L1755    EQU   *
         LR    2,3
         A     2,=F'-25'
         L     4,104(13)
         LR    7,4
         SRA   7,0(2)
         LR    2,7
         N     2,=F'1'
         LTR   2,2
         BE    L1751
         A     3,=F'-24'
         L     2,=F'-1'
         SLL   2,0(3)
         OR    4,2
         ST    4,104(13)
L1751    EQU   *
         MVC   88(4,13),108(13)
         MVC   92(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         MVC   4(4,15),116(13)
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F27)
         BALR  14,15
         MVC   88(4,13),=F'59'
         ST    9,92(13)
         L     8,=V(GLOBAL@T)
         MVC   96(4,13),72(8)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         LR    9,15
L1735    EQU   *
         CL    6,120(13)
         BNL   L1736
         L     2,=A(@@V16)
         MVC   88(4,13),0(2)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1759
L1736    EQU   *
         L     2,=A(@@V25)
         MVC   0(4,2),=F'0'
         B     L1690
L1723    EQU   *
         MVC   88(4,13),=A(LC140)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         L     3,=A(@@V14)
         MVC   0(4,3),0(5)
         L     4,=A(@@V18)
         MVC   0(4,4),0(5)
L1690    EQU   *
* Function push_init_level epilogue
         PDPEPIL
* Function push_init_level literal pool
         DS    0F
         LTORG
* Function push_init_level page table
         DS    0F
PGT57    EQU   *
         DC    A(PG57)
LC141    EQU   *
         DC    C'excess elements in char array initializer'
         DC    X'0'
LC142    EQU   *
         DC    C'excess elements in struct initializer'
         DC    X'0'
LC143    EQU   *
         DC    C'non-static initialization of a flexible array me'
         DC    C'mber'
         DC    X'0'
LC144    EQU   *
         DC    C'excess elements in union initializer'
         DC    X'0'
LC147    EQU   *
         DC    C'excess elements in vector initializer'
         DC    X'0'
LC148    EQU   *
         DC    C'excess elements in scalar initializer'
         DC    X'0'
LC145    EQU   *
         DC    C'traditional C rejects initialization of unions'
         DC    X'0'
LC146    EQU   *
         DC    C'excess elements in array initializer'
         DC    X'0'
         DS    0F
* X-func ZZZ_1704 prologue
ZZZ@1704 PDPPRLG CINDEX=58,FRAME=112,BASER=12,ENTRY=YES
         B     FEN58
         LTORG
FEN58    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG58     EQU   *
         LR    11,1
         L     10,=A(PGT58)
* Function ZZZ_1704 code
         L     5,0(11)
         LR    9,5
         MVC   104(4,13),=F'0'
         LTR   5,5
         BE    L1772
         CLI   8(5),29
         BNE   L1772
         MVC   104(4,13),=F'1'
L1772    EQU   *
         L     2,=A(@@V26)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V27)
         MVC   0(4,2),=F'0'
         L     2,104(13)
         LTR   2,2
         BE    L1773
         L     2,=A(@@V13)
         L     2,0(2)
         LTR   2,2
         BE    L1773
         CLI   8(2),18
         BNE   L1773
         L     2,4(2)
         CLI   8(2),6
         BNE   L1773
         L     2,=A(@@V17)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L1773
         L     3,=A(ZZZ@202)
         L     2,0(3)
         L     2,48(2)
         LTR   2,2
         BE    L1774
         MVC   88(4,13),=A(LC141)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
L1774    EQU   *
         L     2,0(3)
         ST    5,48(2)
         L     14,=A(L1771)
         BR    14
L1773    EQU   *
         L     4,=A(ZZZ@202)
         L     3,0(4)
         L     2,48(3)
         LTR   2,2
         BE    L1775
         MVC   88(4,13),=A(LC142)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         L     14,=A(L1771)
         BR    14
L1863    EQU   *
         MVC   88(4,13),=A(LC142)
         L     14,=A(L1880)
         BR    14
L1864    EQU   *
         MVC   88(4,13),=A(LC143)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         L     14,=A(L1790)
         BR    14
L1865    EQU   *
         MVC   88(4,13),=A(LC144)
         L     14,=A(L1880)
         BR    14
L1866    EQU   *
         L     12,0(,10)
         MVC   88(4,13),=A(LC147)
         L     14,=A(L1880)
         BR    14
L1867    EQU   *
         L     12,0(,10)
         MVC   88(4,13),=A(LC148)
         L     14,=A(L1880)
         BR    14
L1775    EQU   *
         L     2,=A(@@V13)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L1771)
         BER   14
         IC    2,58(3)
L1874    EQU   *
         CLM   2,1,=XL1'00'
         BE    L1778
         L     3,=A(@@V13)
         L     2,0(3)
         IC    2,8(2)
         LA    2,236(,2)
         CLM   2,1,=XL1'01'
         BH    L1779
         L     2,=A(@@V14)
         L     2,0(2)
         LTR   2,2
         BE    L1783
L1779    EQU   *
         L     2,0(3)
         CLI   8(2),18
         BNE   L1778
         L     2,=A(@@V16)
         L     2,0(2)
         LTR   2,2
         BE    L1783
         ST    2,88(13)
         L     2,=A(@@V15)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1778
L1783    EQU   *
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(POP@INIT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1704)
         BALR  14,15
         L     2,0(4)
         IC    2,58(2)
         B     L1874
L1778    EQU   *
         L     2,=A(ZZZ@201)
         L     2,0(2)
         LTR   2,2
         BE    L1886
         CLI   8(5),167
         BNE   L1788
         L     2,=A(@@V7)
         L     2,0(2)
         LTR   2,2
         BE    L1788
         L     2,=V(ZZZ@754)
         L     2,0(2)
         LTR   2,2
         BE    L1886
L1788    EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(SAVE@EXP)
         BALR  14,15
         LR    5,15
L1886    EQU   *
         L     12,0(,10)
         L     2,=A(@@V13)
         L     3,0(2)
         IC    2,8(3)
         CLM   2,1,=XL1'14'
         BNE   L1791
         L     6,=A(@@V14)
         L     4,0(6)
         LTR   4,4
         BE    L1863
         L     3,4(4)
         L     7,=V(GLOBAL@T)
         CL    3,0(7)
         BE    L1793
         L     3,68(3)
L1793    EQU   *
         SLR   15,15
         IC    15,8(3)
         LA    2,18(0,0)
         CLR   15,2
         BNE   L1794
         L     2,=A(@@V7)
         L     2,0(2)
         LTR   2,2
         BNE   L1794
         L     2,16(3)
         LTR   2,2
         BNE   L1794
         L     2,0(4)
         LTR   2,2
         BE    L1864
L1794    EQU   *
         LTR   5,5
         BE    L1795
         LA    2,18(0,0)
         CLR   15,2
         BNE   L1795
         L     2,4(3)
         CLI   8(2),6
         BNE   L1795
         L     2,104(13)
         LTR   2,2
         BE    L1795
         LR    5,9
         B     L1796
L1795    EQU   *
         LTR   5,5
         BE    L1796
         L     2,=A(ZZZ@200)
         L     2,0(2)
         LTR   2,2
         BNE   L1796
         CL    5,0(7)
         BE    L1796
         L     2,4(5)
         L     2,68(2)
         CLR   2,3
         BE    L1796
         LA    2,20(0,0)
         CLR   15,2
         BE    L1826
         LA    2,18(0,0)
         CLR   15,2
         BE    L1826
         LA    2,21(0,0)
         CLR   15,2
         BE    L1826
L1796    EQU   *
         LTR   5,5
         BE    L1799
         MVC   88(4,13),0(6)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         ST    5,88(13)
         ST    3,92(13)
         MVC   96(4,13),0(6)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         L     2,=A(@@V24)
         L     4,0(2)
         SLL   4,3
         L     3,=A(@@V3)
         L     2,=A(@@V2)
         A     4,0(3)
         ST    4,0(2)
         B     L1800
L1799    EQU   *
         L     3,0(6)
         L     2,24(3)
         LTR   2,2
         BE    L1801
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         MVC   88(4,13),=F'59'
         ST    15,92(13)
         L     2,0(6)
         MVC   96(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         L     2,=A(@@V19)
         ST    15,0(2)
L1801    EQU   *
         L     4,=A(@@V18)
         L     3,0(4)
         L     2,=A(@@V14)
         CL    3,0(2)
         BNE   L1800
         MVC   0(4,4),0(3)
         L     3,0(3)
         B     L1882
L1875    EQU   *
         L     2,44(3)
         LTR   2,2
         BNE   L1800
         L     2,0(4)
         MVC   0(4,4),0(2)
         L     3,0(2)
L1882    EQU   *
         LTR   3,3
         BE    L1800
         L     2,32(3)
         SRL   2,19
         N     2,=F'1'
         LA    6,1(0,0)
         CLR   2,6
         BE    L1875
L1800    EQU   *
         L     4,=A(@@V14)
L1885    EQU   *
         L     2,0(4)
         MVC   0(4,4),0(2)
         L     3,0(2)
         LTR   3,3
         L     14,=A(L1809)
         BER   14
         L     2,32(3)
         SRL   2,19
         N     2,=F'1'
         LA    6,1(0,0)
         CLR   2,6
         L     14,=A(L1809)
         BNER  14
         L     2,44(3)
         LTR   2,2
         L     14,=A(L1809)
         BNER  14
         B     L1885
L1791    EQU   *
         CLM   2,1,=XL1'15'
         BNE   L1810
         L     6,=A(@@V14)
         L     2,0(6)
         LTR   2,2
         BE    L1865
         L     3,4(2)
         L     7,=V(GLOBAL@T)
         CL    3,0(7)
         BE    L1812
         L     3,68(3)
L1812    EQU   *
         SLR   4,4
         IC    4,8(3)
         L     2,=V(WARN@TRA)
         L     2,0(2)
         LTR   2,2
         BE    L1813
         L     2,=V(IN@SYSTE)
         L     2,0(2)
         LTR   2,2
         BNE   L1813
         L     2,=A(@@V11)
         L     2,0(2)
         LTR   2,2
         BNE   L1813
         LTR   5,5
         BE    L1814
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L1813
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(REAL@ZER)
         BALR  14,15
         LTR   15,15
         BNE   L1813
L1814    EQU   *
         MVC   88(4,13),=A(LC145)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1813    EQU   *
         LTR   5,5
         BE    L1815
         LA    2,18(0,0)
         CLR   4,2
         BNE   L1815
         L     2,4(3)
         CLI   8(2),6
         BNE   L1815
         L     2,104(13)
         LTR   2,2
         BE    L1815
         LR    5,9
         B     L1816
L1815    EQU   *
         LTR   5,5
         BE    L1816
         L     2,=A(ZZZ@200)
         L     2,0(2)
         LTR   2,2
         BNE   L1816
         CL    5,0(7)
         BE    L1816
         L     2,4(5)
         L     2,68(2)
         CLR   2,3
         BE    L1816
         LA    2,20(0,0)
         CLR   4,2
         BE    L1826
         LA    2,18(0,0)
         CLR   4,2
         BE    L1826
         LA    2,21(0,0)
         CLR   4,2
         BE    L1826
L1816    EQU   *
         LTR   5,5
         BE    L1819
         MVC   88(4,13),0(6)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         ST    5,88(13)
         ST    3,92(13)
         MVC   96(4,13),0(6)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         L     2,=A(@@V24)
         L     4,0(2)
         SLL   4,3
         L     3,=A(@@V3)
         L     2,=A(@@V2)
         A     4,0(3)
         ST    4,0(2)
         B     L1820
L1819    EQU   *
         L     2,0(6)
         L     3,=A(@@V19)
         MVC   0(4,3),24(2)
         L     3,=A(@@V18)
         MVC   0(4,3),0(2)
L1820    EQU   *
         L     2,=A(@@V14)
         MVC   0(4,2),=F'0'
         B     L1809
L1810    EQU   *
         CLM   2,1,=XL1'12'
         BNE   L1822
         L     2,4(3)
         L     4,68(2)
         SLR   3,3
         IC    3,8(4)
         LTR   5,5
         BE    L1823
         LA    6,18(0,0)
         CLR   3,6
         BNE   L1823
         L     2,4(4)
         CLI   8(2),6
         BNE   L1823
         L     2,104(13)
         LTR   2,2
         BE    L1823
         LR    5,9
         B     L1824
L1823    EQU   *
         LTR   5,5
         BE    L1824
         L     2,=A(ZZZ@200)
         L     2,0(2)
         LTR   2,2
         BNE   L1824
         L     2,=V(GLOBAL@T)
         CL    5,0(2)
         BE    L1824
         L     2,4(5)
         L     2,68(2)
         CLR   2,4
         BE    L1824
         LA    6,20(0,0)
         CLR   3,6
         BE    L1826
         LA    2,18(0,0)
         CLR   3,2
         BE    L1826
         LA    6,21(0,0)
         CLR   3,6
         BNE   L1824
L1826    EQU   *
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(PUSH@INI)
         BALR  14,15
         B     L1886
L1824    EQU   *
         L     3,=A(@@V16)
         L     2,0(3)
         LTR   2,2
         BE    L1827
         ST    2,88(13)
         L     2,=A(@@V15)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BNE   L1828
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1478)
         BALR  14,15
         LTR   15,15
         BE    L1827
L1828    EQU   *
         MVC   88(4,13),=A(LC146)
L1880    EQU   *
         LA    1,88(,13)
         L     15,=A(ZZZ@1641)
         BALR  14,15
         L     14,=A(L1790)
         BR    14
L1827    EQU   *
         LTR   5,5
         BE    L1829
         L     2,=A(@@V15)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         L     2,=A(@@V24)
         L     4,0(2)
         SLL   4,3
         L     3,=A(@@V3)
         L     2,=A(@@V2)
         A     4,0(3)
         ST    4,0(2)
L1829    EQU   *
         MVC   88(4,13),=F'59'
         L     3,=A(@@V15)
         B     L1884
L1822    EQU   *
         CLM   2,1,=XL1'09'
         BNE   L1832
         L     2,4(3)
         L     4,68(2)
         L     2,=A(@@V16)
         MVC   88(4,13),0(2)
         L     3,=A(@@V15)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BNE   L1866
         LTR   5,5
         BE    L1834
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),0(3)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
L1834    EQU   *
         MVC   88(4,13),=F'59'
L1884    EQU   *
         MVC   92(4,13),0(3)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),72(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,0(3)
         LTR   5,5
         BNE   L1809
         L     2,=A(@@V17)
         ST    15,0(2)
         B     L1809
L1832    EQU   *
         L     4,=A(@@V14)
         L     2,0(4)
         LTR   2,2
         BE    L1867
         LTR   5,5
         BE    L1839
         ST    5,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
L1839    EQU   *
         MVC   0(4,4),=F'0'
L1809    EQU   *
         L     8,=A(ZZZ@201)
         L     6,0(8)
         LTR   6,6
         L     14,=A(L1790)
         BER   14
         SLR   7,7
         ST    7,0(8)
L1879    EQU   *
         L     3,=A(ZZZ@202)
         L     2,0(3)
         CL    2,8(6)
         BE    L1862
         L     2,0(3)
         IC    2,58(2)
         CLM   2,1,=XL1'00'
         BNE   L1843
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'6186'
         B     L1881
L1843    EQU   *
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(POP@INIT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1704)
         BALR  14,15
         B     L1879
L1862    EQU   *
         LR    3,6
         B     L1845
L1850    EQU   *
         L     2,=A(ZZZ@202)
         L     2,0(2)
         IC    2,58(2)
         CLM   2,1,=XL1'00'
         BNE   L1849
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'6194'
L1881    EQU   *
         MVC   96(4,13),=A(LC8)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L1849    EQU   *
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(POP@INIT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1704)
         BALR  14,15
         L     3,4(3)
L1845    EQU   *
         L     2,20(3)
         LTR   2,2
         BE    L1850
         MVC   88(4,13),16(3)
         MVC   92(4,13),20(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1850
         MVC   88(4,13),=F'59'
         MVC   92(4,13),16(3)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),72(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,16(3)
         ST    15,88(13)
         MVC   92(4,13),20(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L1887
         L     2,4(3)
         LTR   2,2
         BNE   L1887
         LA    7,1(0,0)
L1887    EQU   *
         L     4,=A(@@V15)
         MVC   0(4,4),16(3)
         L     2,=A(@@V14)
         MVC   0(4,2),24(3)
         LTR   7,7
         BE    L1854
         L     2,20(3)
         LTR   2,2
         BE    L1854
         L     2,0(4)
         CL    2,12(3)
         BNE   L1854
         SLR   7,7
         ST    7,4(3)
L1854    EQU   *
         L     3,0(3)
         LTR   3,3
         BE    L1853
         MVC   88(4,13),=F'2'
         LA    1,88(,13)
         L     15,=A(PUSH@INI)
         BALR  14,15
         L     2,=A(ZZZ@202)
         MVC   8(4,3),0(2)
         L     2,20(3)
         LTR   2,2
         BE    L1887
         MVC   88(4,13),16(3)
         MVC   92(4,13),20(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L1887
         MVC   16(4,3),12(3)
         B     L1887
L1853    EQU   *
         LTR   7,7
         BNE   L1886
         ST    6,0(8)
         B     L1886
L1790    EQU   *
         L     2,=A(ZZZ@201)
         MVC   0(4,2),=F'0'
L1771    EQU   *
* Function ZZZ_1704 epilogue
         PDPEPIL
* Function ZZZ_1704 literal pool
         DS    0F
         LTORG
* Function ZZZ_1704 page table
         DS    0F
PGT58    EQU   *
         DC    A(PG58)
LC149    EQU   *
         DC    C'initialization designators may not nest'
         DC    X'0'
LC150    EQU   *
         DC    C'array index in non-array initializer'
         DC    X'0'
LC151    EQU   *
         DC    C'field name not in record or union initializer'
         DC    X'0'
         DS    0F
* Function set_designator,F25 prologue
@@F25    PDPPRLG CINDEX=59,FRAME=104,BASER=12,ENTRY=NO
         B     FEN59
         LTORG
FEN59    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG59     EQU   *
         LR    11,1
         L     10,=A(PGT59)
* Function set_designator code
         L     4,0(11)
         L     2,=A(@@V13)
         L     3,0(2)
         LA    15,1(0,0)
         LTR   3,3
         BE    L1888
         L     2,=A(@@V27)
         L     2,0(2)
         LTR   2,2
         BNE   L1888
         L     2,=A(@@V26)
         L     2,0(2)
         LTR   2,2
         BNE   L1891
         L     2,=A(ZZZ@201)
         L     2,0(2)
         L     3,=A(ZZZ@202)
         LTR   2,2
         BE    L1907
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'5001'
         B     L1910
L1907    EQU   *
         L     2,0(3)
         IC    2,58(2)
         CLM   2,1,=XL1'00'
         BE    L1906
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(POP@INIT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1704)
         BALR  14,15
         B     L1907
L1906    EQU   *
         L     2,=A(@@V11)
         MVC   0(4,2),=F'1'
         B     L1909
L1891    EQU   *
         L     2,=A(ZZZ@200)
         L     2,0(2)
         LTR   2,2
         BE    L1896
         MVC   88(4,13),=A(LC149)
         B     L1908
L1896    EQU   *
         IC    15,8(3)
         LA    2,236(,15)
         CLM   2,1,=XL1'01'
         BH    L1897
         L     2,=A(@@V14)
         L     2,0(2)
         L     15,4(2)
         L     2,=V(GLOBAL@T)
         CL    15,0(2)
         BE    L1899
         L     15,68(15)
         B     L1899
L1897    EQU   *
         CLM   15,1,=XL1'12'
         BNE   L1900
         L     2,4(3)
         L     15,68(2)
         B     L1899
L1900    EQU   *
         MVC   88(4,13),=A(LC7)
         MVC   92(4,13),=F'5029'
L1910    EQU   *
         MVC   96(4,13),=A(LC8)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L1899    EQU   *
         SLR   2,2
         IC    2,8(15)
         LTR   4,4
         BE    L1902
         LA    3,18(0,0)
         CLR   2,3
         BE    L1902
         MVC   88(4,13),=A(LC150)
         B     L1908
L1902    EQU   *
         LTR   4,4
         BNE   L1903
         LA    3,20(0,0)
         CLR   2,3
         BE    L1903
         LA    3,21(0,0)
         CLR   2,3
         BE    L1903
         MVC   88(4,13),=A(LC151)
L1908    EQU   *
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         LA    15,1(0,0)
         B     L1888
L1903    EQU   *
         L     2,=A(@@V11)
         MVC   0(4,2),=F'1'
         MVC   88(4,13),=F'2'
         LA    1,88(,13)
         L     15,=A(PUSH@INI)
         BALR  14,15
L1909    EQU   *
         SLR   15,15
L1888    EQU   *
* Function set_designator epilogue
         PDPEPIL
* Function set_designator literal pool
         DS    0F
         LTORG
* Function set_designator page table
         DS    0F
PGT59    EQU   *
         DC    A(PG59)
LC152    EQU   *
         DC    C'unknown field `%s'' specified in initializer'
         DC    X'0'
         DS    0F
* X-func ZZZ_1888 prologue
ZZZ@1888 PDPPRLG CINDEX=60,FRAME=96,BASER=12,ENTRY=YES
         B     FEN60
         LTORG
FEN60    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG60     EQU   *
         LR    11,1
         L     10,=A(PGT60)
* Function ZZZ_1888 code
         L     4,0(11)
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F25)
         BALR  14,15
         LTR   15,15
         BNE   L1911
         L     3,=A(@@V27)
         MVC   0(4,3),=F'1'
         L     2,=A(@@V13)
         L     15,0(2)
         IC    5,8(15)
         LA    2,236(,5)
         CLM   2,1,=XL1'01'
         BNH   L1913
         MVC   88(4,13),=A(LC151)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         B     L1911
L1913    EQU   *
         L     15,12(15)
L1923    EQU   *
         LTR   15,15
         BE    L1915
         L     2,44(15)
         CLR   2,4
         BE    L1915
         L     15,0(15)
         B     L1923
L1915    EQU   *
         LTR   15,15
         BNE   L1919
         MVC   88(4,13),=A(LC152)
         MVC   92(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L1911
L1919    EQU   *
         L     2,=A(@@V14)
         ST    15,0(2)
         L     2,=A(@@V26)
         L     4,0(2)
         A     4,=F'1'
         ST    4,0(2)
         MVC   0(4,3),=F'0'
         L     2,=A(ZZZ@201)
         L     2,0(2)
         LTR   2,2
         BE    L1911
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F26)
         BALR  14,15
L1911    EQU   *
* Function ZZZ_1888 epilogue
         PDPEPIL
* Function ZZZ_1888 literal pool
         DS    0F
         LTORG
* Function ZZZ_1888 page table
         DS    0F
PGT60    EQU   *
         DC    A(PG60)
LC153    EQU   *
         DC    C'nonconstant array index in initializer'
         DC    X'0'
LC154    EQU   *
         DC    C'array index in initializer exceeds array bounds'
         DC    X'0'
LC155    EQU   *
         DC    C'empty index range in initializer'
         DC    X'0'
LC156    EQU   *
         DC    C'array index range in initializer exceeds array b'
         DC    C'ounds'
         DC    X'0'
         DS    0F
* X-func ZZZ_1887 prologue
ZZZ@1887 PDPPRLG CINDEX=61,FRAME=96,BASER=12,ENTRY=YES
         B     FEN61
         LTORG
FEN61    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG61     EQU   *
         LR    11,1
         L     10,=A(PGT61)
* Function ZZZ_1887 code
         L     5,0(11)
         L     4,4(11)
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F25)
         BALR  14,15
         LTR   15,15
         BNE   L1924
         L     8,=A(@@V27)
         MVC   0(4,8),=F'1'
         B     L1954
L1953    EQU   *
         L     2,4(5)
         L     3,32(2)
         N     3,=F'8323072'
         L     15,16(5)
         L     2,4(15)
         L     2,32(2)
         N     2,=F'8323072'
         CLR   3,2
         BNE   L1927
         LR    5,15
L1954    EQU   *
         IC    3,8(5)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BNH   L1953
L1927    EQU   *
         LTR   4,4
         BE    L1929
         B     L1956
L1955    EQU   *
         L     2,4(4)
         L     3,32(2)
         N     3,=F'8323072'
         L     15,16(4)
         L     2,4(15)
         L     2,32(2)
         N     2,=F'8323072'
         CLR   3,2
         BNE   L1929
         LR    4,15
L1956    EQU   *
         IC    3,8(4)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BNH   L1955
L1929    EQU   *
         CLI   8(5),25
         BNE   L1959
         LTR   4,4
         BE    L1935
         CLI   8(4),25
         BE    L1935
L1959    EQU   *
         MVC   88(4,13),=A(LC153)
         B     L1958
L1935    EQU   *
         L     2,=A(@@V13)
         L     2,0(2)
         CLI   8(2),18
         BE    L1937
         MVC   88(4,13),=A(LC150)
         B     L1958
L1937    EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1983)
         BALR  14,15
         L     2,=F'-1'
         CLR   15,2
         BE    L1957
         L     7,=A(@@V16)
         L     2,0(7)
         LTR   2,2
         BE    L1941
         ST    2,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1941
L1957    EQU   *
         MVC   88(4,13),=A(LC154)
L1958    EQU   *
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         B     L1924
L1941    EQU   *
         L     6,=V(SIZETYPE)
         MVC   88(4,13),12(6)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         L     2,=A(@@V15)
         ST    15,0(2)
         LTR   4,4
         BE    L1943
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    L1944
         SLR   4,4
         B     L1943
L1944    EQU   *
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L1946
         MVC   88(4,13),=A(LC155)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         LR    4,2
         B     L1943
L1946    EQU   *
         MVC   88(4,13),12(6)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    4,15
         L     2,0(7)
         LTR   2,2
         BE    L1943
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1943
         MVC   88(4,13),=A(LC156)
         LA    1,88(,13)
         L     15,=A(ERROR@IN)
         BALR  14,15
         LR    4,3
L1943    EQU   *
         L     2,=A(@@V26)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         MVC   0(4,8),=F'0'
         L     2,=A(ZZZ@201)
         L     2,0(2)
         LTR   2,2
         BNE   L1950
         LTR   4,4
         BE    L1924
L1950    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F26)
         BALR  14,15
L1924    EQU   *
* Function ZZZ_1887 epilogue
         PDPEPIL
* Function ZZZ_1887 literal pool
         DS    0F
         LTORG
* Function ZZZ_1887 page table
         DS    0F
PGT61    EQU   *
         DC    A(PG61)
         DS    0F
* X-func c_convert_parm_for_inlining prologue
C@CONVER PDPPRLG CINDEX=62,FRAME=112,BASER=12,ENTRY=YES
         B     FEN62
         LTORG
FEN62    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG62     EQU   *
         LR    11,1
         L     10,=A(PGT62)
* Function c_convert_parm_for_inlining code
         L     15,4(11)
         L     6,8(11)
         LTR   15,15
         BE    L1960
         L     2,4(6)
         L     3,12(2)
         LTR   3,3
         BNE   L1960
         L     2,0(11)
         L     5,4(2)
         ST    5,88(13)
         ST    15,92(13)
         ST    3,96(13)
         ST    6,100(13)
         MVC   104(4,13),44(6)
         MVC   108(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),4(6)
         L     2,=V(TARGETM)
         L     2,356(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L1963
         IC    2,8(5)
         CLM   2,1,=XL1'06'
         BE    L1964
         CLM   2,1,=XL1'0A'
         BE    L1964
         CLM   2,1,=XL1'0B'
         BE    L1964
         SLL   2,24
         SRA   2,24
         C     2,=F'12'
         BNE   L1963
L1964    EQU   *
         L     3,32(5)
         SRL   3,23
         L     2,=V(ZZZ@1483)
         L     2,20(2)
         L     2,32(2)
         SRL   2,23
         CR    3,2
         BNL   L1963
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    4,15
L1963    EQU   *
         LR    15,4
L1960    EQU   *
* Function c_convert_parm_for_inlining epilogue
         PDPEPIL
* Function c_convert_parm_for_inlining literal pool
         DS    0F
         LTORG
* Function c_convert_parm_for_inlining page table
         DS    0F
PGT62    EQU   *
         DC    A(PG62)
LC157    EQU   *
         DC    C'signed and unsigned type in conditional expressi'
         DC    C'on'
         DC    X'0'
LC158    EQU   *
         DC    C'ISO C forbids conditional expr with only one voi'
         DC    C'd side'
         DC    X'0'
LC159    EQU   *
         DC    C'ISO C forbids conditional expr between `void *'''
         DC    C' and function pointer'
         DC    X'0'
LC160    EQU   *
         DC    C'pointer type mismatch in conditional expression'
         DC    X'0'
LC161    EQU   *
         DC    C'pointer/integer type mismatch in conditional exp'
         DC    C'ression'
         DC    X'0'
LC162    EQU   *
         DC    C'type mismatch in conditional expression'
         DC    X'0'
         DS    0F
* X-func ZZZ_69 prologue
ZZZ@69   PDPPRLG CINDEX=63,FRAME=136,BASER=12,ENTRY=YES
         B     FEN63
         LTORG
FEN63    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG63     EQU   *
         LR    11,1
         L     10,=A(PGT63)
* Function ZZZ_69 code
         L     7,4(11)
         L     6,8(11)
         ST    7,128(13)
         ST    6,112(13)
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@323)
         BALR  14,15
         LR    9,15
         L     2,4(7)
         CLI   8(2),5
         BE    L1966
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    7,15
L1966    EQU   *
         L     2,4(6)
         CLI   8(2),5
         BE    L1967
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    6,15
L1967    EQU   *
         IC    2,8(9)
         CLM   2,1,=XL1'00'
         BE    L1969
         L     5,4(7)
         IC    2,8(5)
         CLM   2,1,=XL1'00'
         BE    L1969
         L     4,4(6)
         IC    2,8(4)
         CLM   2,1,=XL1'00'
         BNE   L1968
L1969    EQU   *
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         L     14,=A(L1965)
         BR    14
L1968    EQU   *
         SLR   15,15
         IC    15,8(5)
         SLR   3,3
         IC    3,8(4)
         L     2,68(5)
         CL    2,68(4)
         BNE   L1970
         LR    3,4
         CLR   5,4
         BE    L1973
         LR    3,2
         B     L1973
L1970    EQU   *
         LR    2,15
         A     2,=F'-6'
         LA    8,2(0,0)
         CLR   2,8
         BH    L1974
         LR    2,3
         A     2,=F'-6'
         CLR   2,8
         BH    L1974
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         LR    3,15
         L     2,=V(ZZZ@2038)
         L     2,0(2)
         LTR   2,2
         BE    L1973
         L     2,=V(SKIP@EVA)
         L     2,0(2)
         LTR   2,2
         BNE   L1973
         L     4,128(13)
         L     2,4(4)
         L     4,8(2)
         SRL   4,18
         N     4,=F'1'
         L     5,112(13)
         L     2,4(5)
         L     15,8(2)
         SRL   15,18
         N     15,=F'1'
         CLR   4,15
         BE    L1973
         L     2,8(3)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BE    L1973
         LTR   15,15
         BE    L1981
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(C@TREE@E)
         BALR  14,15
         LTR   15,15
         BNE   L1973
L1981    EQU   *
         LTR   4,4
         BE    L1979
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(C@TREE@E)
         BALR  14,15
         LTR   15,15
         BNE   L1973
L1979    EQU   *
         MVC   88(4,13),=A(LC157)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     L1973
L1974    EQU   *
         LA    8,5(0,0)
         CLR   15,8
         BE    L1985
         CLR   3,8
         BNE   L1984
L1985    EQU   *
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L1986
         LA    2,5(0,0)
         CLR   15,2
         BNE   L1987
         CLR   3,2
         BE    L1986
L1987    EQU   *
         MVC   88(4,13),=A(LC158)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L1986    EQU   *
         L     2,=V(GLOBAL@T)
         L     3,144(2)
         B     L1973
L1984    EQU   *
         LA    8,13(0,0)
         CLR   15,8
         BNE   L2003
         CLR   3,8
         BNE   L2022
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         LTR   15,15
         BE    L1990
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(COMMON@T)
         BALR  14,15
         B     L2025
L1990    EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L1992
         L     3,4(5)
         L     2,=V(GLOBAL@T)
         CL    3,144(2)
         BNE   L1992
         L     2,128(13)
         CLI   8(2),113
         BE    L1992
         ST    4,88(13)
         ST    5,92(13)
         B     L2027
L1992    EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L1994
         L     3,4(4)
         L     2,=V(GLOBAL@T)
         CL    3,144(2)
         BNE   L1994
         L     8,112(13)
         CLI   8(8),113
         BE    L1994
         ST    5,88(13)
         ST    4,92(13)
L2027    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         B     L2025
L1994    EQU   *
         L     2,4(5)
         IC    3,8(2)
         CLM   3,1,=XL1'05'
         BNE   L1996
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L1997
         L     2,4(4)
         CLI   8(2),23
         BNE   L1997
         MVC   88(4,13),=A(LC159)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L1997    EQU   *
         MVC   88(4,13),4(5)
         MVC   92(4,13),4(4)
         B     L2026
L1996    EQU   *
         L     2,4(4)
         CLI   8(2),5
         BNE   L1999
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L2000
         CLM   3,1,=XL1'17'
         BNE   L2000
         MVC   88(4,13),=A(LC159)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L2000    EQU   *
         MVC   88(4,13),4(4)
         MVC   92(4,13),4(5)
L2026    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         ST    15,88(13)
         B     L2024
L1999    EQU   *
         MVC   88(4,13),=A(LC160)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
         L     2,=V(GLOBAL@T)
         MVC   88(4,13),144(2)
L2024    EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@87)
         BALR  14,15
L2025    EQU   *
         LR    3,15
         B     L1973
L2022    EQU   *
         LA    2,6(0,0)
         CLR   3,2
         BNE   L2003
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L2004
         MVC   88(4,13),=A(LC161)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
         B     L2005
L2004    EQU   *
         L     2,=V(GLOBAL@T)
         L     6,56(2)
L2005    EQU   *
         LR    3,5
         B     L1973
L2003    EQU   *
         LA    5,13(0,0)
         CLR   3,5
         BNE   L2023
         LA    8,6(0,0)
         CLR   15,8
         BNE   L2023
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L2008
         MVC   88(4,13),=A(LC161)
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
         B     L2009
L2008    EQU   *
         L     2,=V(GLOBAL@T)
         L     7,56(2)
L2009    EQU   *
         LR    3,4
L1973    EQU   *
         LTR   3,3
         BNE   L2010
L2023    EQU   *
         L     2,=V(ZZZ@719)
         L     2,0(2)
         L     3,=V(GLOBAL@T)
         LTR   2,2
         BE    L2011
         L     3,144(3)
         B     L2010
L2011    EQU   *
         MVC   88(4,13),=A(LC162)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     15,0(3)
         B     L1965
L2010    EQU   *
         ST    3,88(13)
         SLR   4,4
         L     3,8(7)
         LR    2,3
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BNE   L2014
         L     2,8(6)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    L2013
L2014    EQU   *
         LA    4,1(0,0)
L2013    EQU   *
         LR    15,4
         SRL   3,20
         N     3,=F'1'
         LTR   3,3
         BNE   L2016
         L     2,8(6)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BE    L2015
L2016    EQU   *
         O     15,=F'2'
L2015    EQU   *
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(BUILD@QU)
         BALR  14,15
         LR    3,15
         CL    15,4(7)
         BE    L2017
         ST    15,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@207)
         BALR  14,15
         LR    7,15
L2017    EQU   *
         CL    3,4(6)
         BE    L2018
         ST    3,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@207)
         BALR  14,15
         LR    6,15
L2018    EQU   *
         CLI   8(9),25
         BNE   L2019
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LR    2,6
         LTR   15,15
         BNE   L2021
         LR    2,7
L2021    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1638)
         BALR  14,15
         B     L1965
L2019    EQU   *
         MVC   88(4,13),=F'52'
         ST    3,92(13)
         ST    9,96(13)
         ST    7,100(13)
         ST    6,104(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
L1965    EQU   *
* Function ZZZ_69 epilogue
         PDPEPIL
* Function ZZZ_69 literal pool
         DS    0F
         LTORG
* Function ZZZ_69 page table
         DS    0F
PGT63    EQU   *
         DC    A(PG63)
LC163    EQU   *
         DC    C'invalid lvalue in assignment'
         DC    X'0'
LC164    EQU   *
         DC    C'assignment'
         DC    X'0'
         DS    0F
* X-func build_modify_expr prologue
BUILD@MO PDPPRLG CINDEX=64,FRAME=112,BASER=12,ENTRY=YES
         B     FEN64
         LTORG
FEN64    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG64     EQU   *
         LR    11,1
         L     10,=A(PGT64)
* Function build_modify_expr code
         L     5,0(11)
         L     8,4(11)
         L     6,8(11)
         L     7,4(5)
         LR    9,7
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(REQUIRE@)
         BALR  14,15
         LR    5,15
         IC    2,8(15)
         CLM   2,1,=XL1'00'
         BE    L2058
         IC    2,8(6)
         CLM   2,1,=XL1'00'
         BE    L2058
         CLM   2,1,=XL1'72'
         BNE   L2031
         L     6,16(6)
L2031    EQU   *
         LR    4,6
         SLR   3,3
         IC    3,8(5)
         LA    2,48(0,0)
         CLR   3,2
         BE    L2033
         LA    2,52(0,0)
         CLR   3,2
         BE    L2036
         B     L2032
L2033    EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         MVC   88(4,13),20(5)
         ST    8,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(BUILD@MO)
         BALR  14,15
         LR    4,15
         IC    2,8(15)
         CLM   2,1,=XL1'00'
         BE    L2058
         ST    3,88(13)
         ST    7,92(13)
         MVC   96(4,13),16(5)
         B     L2060
L2036    EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SAVE@EXP)
         BALR  14,15
         LR    6,15
         MVC   88(4,13),20(5)
         ST    8,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(BUILD@MO)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),24(5)
         ST    8,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(BUILD@MO)
         BALR  14,15
         MVC   88(4,13),16(5)
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@69)
         BALR  14,15
         LR    4,15
         IC    2,8(15)
         LR    3,15
         CLM   2,1,=XL1'00'
         BE    L2028
         L     2,=V(GLOBAL@T)
         MVC   88(4,13),144(2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),4(5)
         ST    15,96(13)
L2060    EQU   *
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         B     L2059
L2032    EQU   *
         LA    3,113(0,0)
         CLR   8,3
         BE    L2039
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1943)
         BALR  14,15
         LR    5,15
         ST    8,88(13)
         ST    15,92(13)
         ST    6,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(BUILD@BI)
         BALR  14,15
         LR    4,15
L2039    EQU   *
         SLR   2,2
         IC    2,8(5)
         LA    6,72(0,0)
         CLR   2,6
         BL    L2040
         LA    3,76(0,0)
         CLR   2,3
         BNH   L2047
         A     2,=F'-112'
         LA    6,1(0,0)
         CLR   2,6
         BH    L2040
L2047    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         L     2,16(5)
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),4(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),=F'113'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(BUILD@MO)
         BALR  14,15
         LR    4,15
         IC    2,8(15)
         LR    3,15
         CLM   2,1,=XL1'00'
         BE    L2028
         MVC   88(4,13),=F'112'
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         MVC   88(4,13),4(5)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         B     L2059
L2040    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(LC163)
         LA    1,88(,13)
         L     15,=A(LVALUE@O)
         BALR  14,15
         LTR   15,15
         BE    L2058
         L     2,8(5)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BNE   L2052
         L     3,8(7)
         LR    2,3
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BNE   L2052
         IC    6,8(7)
         LA    2,236(,6)
         CLM   2,1,=XL1'01'
         BH    L2051
         SRL   3,6
         N     3,=F'1'
         LTR   3,3
         BE    L2051
L2052    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(LC164)
         LA    1,88(,13)
         L     15,=A(ZZZ@1739)
         BALR  14,15
L2051    EQU   *
         CLI   8(5),40
         BNE   L2053
         IC    2,8(7)
         CLM   2,1,=XL1'06'
         BE    L2054
         CLM   2,1,=XL1'0B'
         BE    L2054
         CLM   2,1,=XL1'07'
         BE    L2054
         CLM   2,1,=XL1'0A'
         BNE   L2053
L2054    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GET@UNWI)
         BALR  14,15
         L     9,4(15)
L2053    EQU   *
         CL    9,4(5)
         BE    L2055
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(COPY@NOD)
         BALR  14,15
         LR    5,15
         ST    9,4(15)
L2055    EQU   *
         ST    9,88(13)
         ST    4,92(13)
         MVC   96(4,13),=A(LC164)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         IC    2,8(15)
         CLM   2,1,=XL1'00'
         BNE   L2056
L2058    EQU   *
         L     2,=V(GLOBAL@T)
         L     3,0(2)
         B     L2028
L2056    EQU   *
         MVC   88(4,13),=F'49'
         ST    9,92(13)
         ST    5,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         OC    8(4,15),=F'8388608'
         LR    3,15
         CL    7,4(15)
         BE    L2028
         ST    7,88(13)
         ST    15,92(13)
         MVC   96(4,13),=A(LC164)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
L2059    EQU   *
         LR    3,15
L2028    EQU   *
         LR    15,3
* Function build_modify_expr epilogue
         PDPEPIL
* Function build_modify_expr literal pool
         DS    0F
         LTORG
* Function build_modify_expr page table
         DS    0F
PGT64    EQU   *
         DC    A(PG64)
LC165    EQU   *
         DC    C'modification by `asm'''
         DC    X'0'
         DS    0F
* X-func ZZZ_330 prologue
ZZZ@330  PDPPRLG CINDEX=65,FRAME=120,BASER=12,ENTRY=YES
         B     FEN65
         LTORG
FEN65    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG65     EQU   *
         LR    11,1
         L     10,=A(PGT65)
* Function ZZZ_330 code
         L     5,4(11)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(LIST@LEN)
         BALR  14,15
         SLL   15,2
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    7,15
         SLR   6,6
         LR    4,5
L2079    EQU   *
         LTR   4,4
         BE    L2076
         LR    2,6
         SLL   2,2
         L     3,16(4)
         ST    3,0(2,7)
         L     2,=V(GLOBAL@T)
         CL    3,0(2)
         BE    L2061
         L     4,0(4)
         A     6,=F'1'
         B     L2079
L2076    EQU   *
         MVC   88(4,13),0(11)
         ST    5,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         MVC   104(4,13),16(11)
         MVC   108(8,13),20(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@587)
         BALR  14,15
         SLR   6,6
         LR    4,5
L2080    EQU   *
         LTR   4,4
         BE    L2078
         LR    5,6
         SLL   5,2
         L     2,0(5,7)
         CL    2,16(4)
         BE    L2070
         ST    2,88(13)
         MVC   92(4,13),=F'113'
         MVC   96(4,13),16(4)
         LA    1,88(,13)
         L     15,=A(BUILD@MO)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@868)
         BALR  14,15
         L     5,0(5,7)
         ST    5,16(4)
         B     L2069
L2070    EQU   *
         L     15,4(2)
         L     2,8(2)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BNE   L2073
         L     3,8(15)
         LR    2,3
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BNE   L2073
         IC    15,8(15)
         LA    2,236(,15)
         CLM   2,1,=XL1'01'
         BH    L2069
         SRL   3,6
         N     3,=F'1'
         LTR   3,3
         BE    L2069
L2073    EQU   *
         L     5,0(5,7)
         ST    5,88(13)
         MVC   92(4,13),=A(LC165)
         LA    1,88(,13)
         L     15,=A(ZZZ@1739)
         BALR  14,15
L2069    EQU   *
         L     4,0(4)
         A     6,=F'1'
         B     L2080
L2078    EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
L2061    EQU   *
* Function ZZZ_330 epilogue
         PDPEPIL
* Function ZZZ_330 literal pool
         DS    0F
         LTORG
* Function ZZZ_330 page table
         DS    0F
PGT65    EQU   *
         DC    A(PG65)
LC166    EQU   *
         DC    C'called object is not a function'
         DC    X'0'
LC167    EQU   *
         DC    C'function called through a non-compatible type'
         DC    X'0'
LC168    EQU   *
         DC    C'if this code is reached, the program will abort'
         DC    X'0'
LC169    EQU   *
         DC    C'too many arguments to function `%s'''
         DC    X'0'
LC170    EQU   *
         DC    C'too many arguments to function'
         DC    X'0'
LC171    EQU   *
         DC    C'type of formal parameter %d is incomplete'
         DC    X'0'
LC172    EQU   *
         DC    C'%s as integer rather than floating due to protot'
         DC    C'ype'
         DC    X'0'
LC173    EQU   *
         DC    C'%s as integer rather than complex due to prototy'
         DC    C'pe'
         DC    X'0'
LC174    EQU   *
         DC    C'%s as complex rather than floating due to protot'
         DC    C'ype'
         DC    X'0'
LC175    EQU   *
         DC    C'%s as floating rather than integer due to protot'
         DC    C'ype'
         DC    X'0'
LC176    EQU   *
         DC    C'%s as complex rather than integer due to prototy'
         DC    C'pe'
         DC    X'0'
LC177    EQU   *
         DC    C'%s as floating rather than complex due to protot'
         DC    C'ype'
         DC    X'0'
LC178    EQU   *
         DC    C'%s as `float'' rather than `double'' due to prot'
         DC    C'otype'
         DC    X'0'
LC179    EQU   *
         DC    C'%s with different width due to prototype'
         DC    X'0'
LC180    EQU   *
         DC    C'%s as unsigned due to prototype'
         DC    X'0'
LC181    EQU   *
         DC    C'%s as signed due to prototype'
         DC    X'0'
LC182    EQU   *
         DC    C'too few arguments to function `%s'''
         DC    X'0'
LC183    EQU   *
         DC    C'too few arguments to function'
         DC    X'0'
LC184    EQU   *
         DC    C'__builtin_'
         DC    X'0'
         DS    0F
* X-func ZZZ_76 prologue
ZZZ@76   PDPPRLG CINDEX=66,FRAME=136,BASER=12,ENTRY=YES
         B     FEN66
         LTORG
FEN66    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG66     EQU   *
         LR    11,1
         L     10,=A(PGT66)
* Function ZZZ_76 code
         L     5,0(11)
         SLR   8,8
         ST    8,116(13)
         IC    3,8(5)
         LA    2,144(,3)
         CLM   2,1,=XL1'02'
         BH    L2083
         L     3,16(5)
         L     2,=V(GLOBAL@T)
         L     4,0(2)
         B     L2178
L2177    EQU   *
         L     2,4(5)
         CL    2,4(3)
         BNE   L2083
         LR    5,3
         IC    6,8(3)
         LA    2,144(,6)
         CLM   2,1,=XL1'02'
         BH    L2083
         L     3,16(3)
L2178    EQU   *
         CLR   3,4
         BNE   L2177
L2083    EQU   *
         CLI   8(5),30
         BNE   L2085
         L     8,44(5)
         MVC   88(4,13),4(5)
         L     3,8(5)
         LR    2,3
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    L2086
         LA    2,1(0,0)
L2086    EQU   *
         SRL   3,20
         N     3,=F'1'
         LTR   3,3
         BE    L2087
         O     2,=F'2'
L2087    EQU   *
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(BUILD@QU)
         BALR  14,15
         ST    5,116(13)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@87)
         BALR  14,15
         MVC   88(4,13),=F'119'
         ST    15,92(13)
         MVC   96(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         B     L2179
L2085    EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
L2179    EQU   *
         LR    5,15
         MVC   112(4,13),4(15)
         L     3,112(13)
         IC    2,8(3)
         CLM   2,1,=XL1'00'
         BE    L2185
         CLM   2,1,=XL1'0D'
         BNE   L2091
         L     6,112(13)
         L     2,4(6)
         CLI   8(2),23
         BE    L2090
L2091    EQU   *
         MVC   88(4,13),=A(LC166)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L2185    EQU   *
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         L     14,=A(L2081)
         BR    14
L2090    EQU   *
         L     2,116(13)
         LTR   2,2
         BE    L2092
         L     2,8(2)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BE    L2092
         L     2,=V(ZZZ@295)
         MVC   0(4,2),=F'1'
L2092    EQU   *
         L     6,112(13)
         MVC   112(4,13),4(6)
         L     2,=V(C@LANGUA)
         L     3,0(2)
         N     3,=F'1'
         LTR   3,3
         BNE   L2093
         CLI   8(5),113
         BNE   L2093
         L     2,16(5)
         CLI   8(2),119
         BNE   L2093
         L     2,16(2)
         CLI   8(2),30
         BNE   L2093
         MVC   88(4,13),112(13)
         MVC   92(4,13),4(2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(COMPTYPE)
         BALR  14,15
         LTR   15,15
         BNE   L2093
         L     2,112(13)
         L     3,4(2)
         L     2,=V(ZZZ@104)
         MVC   88(4,13),1568(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@76)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=A(LC167)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         MVC   88(4,13),=A(LC168)
         LA    1,88(,13)
         L     15,=V(INFORM)
         BALR  14,15
         IC    2,8(3)
         LR    15,4
         CLM   2,1,=XL1'05'
         L     14,=A(L2081)
         BER   14
         CLM   2,1,=XL1'12'
         BE    L2098
         CLM   2,1,=XL1'14'
         BE    L2098
         CLM   2,1,=XL1'15'
         BE    L2098
         CLM   2,1,=XL1'16'
         BE    L2098
         CLM   2,1,=XL1'13'
         BNE   L2097
L2098    EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@70)
         BALR  14,15
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@68)
         BALR  14,15
         B     L2099
L2097    EQU   *
         MVC   88(4,13),=F'113'
         ST    3,92(13)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),44(2)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
L2099    EQU   *
         MVC   88(4,13),=F'48'
         ST    3,92(13)
         ST    4,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         L     14,=A(L2081)
         BR    14
L2173    EQU   *
         MVC   88(4,13),=A(LC169)
         MVC   92(4,13),12(8)
         B     L2183
L2093    EQU   *
         MVC   124(4,13),=F'0'
         MVC   120(4,13),4(11)
         L     3,112(13)
         L     9,12(3)
         L     6,4(11)
         LTR   6,6
         L     14,=A(L2101)
         BER   14
         MVC   132(4,13),=F'1'
L2159    EQU   *
         L     12,0(,10)
         LR    7,9
         LTR   9,9
         BE    L2104
         L     7,16(9)
L2104    EQU   *
         L     2,120(13)
         L     4,16(2)
         L     6,=V(GLOBAL@T)
         CL    7,144(6)
         BNE   L2105
         LTR   8,8
         BNE   L2173
         MVC   88(4,13),=A(LC170)
L2183    EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     14,=A(L2101)
         BR    14
L2105    EQU   *
         CLI   8(4),114
         BNE   L2108
         L     4,16(4)
L2108    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(REQUIRE@)
         BALR  14,15
         LR    4,15
         LTR   7,7
         L     14,=A(L2109)
         BER   14
         L     2,16(7)
         LTR   2,2
         BNE   L2110
         MVC   88(4,13),=A(LC171)
         MVC   92(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     14,=A(L2111)
         BR    14
L2110    EQU   *
         L     3,=V(WARN@CON)
         L     2,0(3)
         LTR   2,2
         BNE   L2113
         L     2,=V(WARN@TRA)
         L     2,0(2)
         LTR   2,2
         BE    L2112
L2113    EQU   *
         L     2,32(7)
         SRL   2,23
         ST    2,128(13)
         IC    2,8(7)
         CLM   2,1,=XL1'06'
         BE    L2115
         CLM   2,1,=XL1'0A'
         BE    L2115
         CLM   2,1,=XL1'0B'
         BE    L2115
         CLM   2,1,=XL1'0C'
         BNE   L2114
L2115    EQU   *
         L     2,4(4)
         CLI   8(2),7
         BNE   L2114
         MVC   88(4,13),=A(LC172)
         MVC   92(4,13),=F'0'
         ST    8,96(13)
         MVC   100(4,13),132(13)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
L2114    EQU   *
         IC    3,8(7)
         CLM   3,1,=XL1'06'
         BE    L2117
         CLM   3,1,=XL1'0A'
         BE    L2117
         CLM   3,1,=XL1'0B'
         BE    L2117
         CLM   3,1,=XL1'0C'
         BNE   L2116
L2117    EQU   *
         L     2,4(4)
         CLI   8(2),8
         BNE   L2116
         MVC   88(4,13),=A(LC173)
         B     L2186
L2116    EQU   *
         CLM   3,1,=XL1'08'
         BNE   L2119
         L     2,4(4)
         CLI   8(2),7
         BNE   L2174
         MVC   88(4,13),=A(LC174)
L2186    EQU   *
         MVC   92(4,13),=F'0'
         B     L2180
L2119    EQU   *
         CLM   3,1,=XL1'07'
         BNE   L2121
         L     2,4(4)
         IC    2,8(2)
         CLM   2,1,=XL1'06'
         BE    L2122
         CLM   2,1,=XL1'0A'
         BE    L2122
         CLM   2,1,=XL1'0B'
         BE    L2122
         CLM   2,1,=XL1'0C'
         BNE   L2175
L2122    EQU   *
         MVC   88(4,13),=A(LC175)
         B     L2186
L2121    EQU   *
         CLM   3,1,=XL1'08'
         BNE   L2124
L2174    EQU   *
         L     2,4(4)
         IC    2,8(2)
         CLM   2,1,=XL1'06'
         BE    L2125
         CLM   2,1,=XL1'0A'
         BE    L2125
         CLM   2,1,=XL1'0B'
         BE    L2125
         CLM   2,1,=XL1'0C'
         BNE   L2129
L2125    EQU   *
         MVC   88(4,13),=A(LC176)
         B     L2186
L2124    EQU   *
         CLM   3,1,=XL1'07'
         BNE   L2129
L2175    EQU   *
         L     2,4(4)
         IC    2,8(2)
         CLM   2,1,=XL1'08'
         BNE   L2176
         MVC   88(4,13),=A(LC177)
         B     L2186
L2176    EQU   *
         CLM   2,1,=XL1'07'
         BNE   L2129
         L     2,116(6)
         L     2,32(2)
         SRL   2,23
         L     3,128(13)
         CLR   3,2
         BNE   L2112
         MVC   88(4,13),=A(LC178)
         B     L2186
L2129    EQU   *
         L     6,=V(WARN@CON)
         L     2,0(6)
         LTR   2,2
         BE    L2112
         CLM   3,1,=XL1'06'
         BE    L2133
         CLM   3,1,=XL1'0A'
         BE    L2133
         CLM   3,1,=XL1'0B'
         BE    L2133
         CLM   3,1,=XL1'0C'
         BNE   L2112
L2133    EQU   *
         L     2,4(4)
         IC    2,8(2)
         CLM   2,1,=XL1'06'
         BE    L2134
         CLM   2,1,=XL1'0A'
         BE    L2134
         CLM   2,1,=XL1'0B'
         BE    L2134
         CLM   2,1,=XL1'0C'
         BNE   L2112
L2134    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         L     15,4(15)
         IC    6,8(7)
         CLM   6,1,=XL1'0A'
         BNE   L2135
         L     3,4(4)
         L     2,68(7)
         CL    2,68(3)
         BE    L2112
L2135    EQU   *
         L     2,32(15)
         SRL   2,23
         L     3,128(13)
         CLR   3,2
         BE    L2137
         MVC   88(4,13),=A(LC179)
         B     L2186
L2137    EQU   *
         L     3,8(7)
         SRL   3,18
         N     3,=F'1'
         L     2,8(15)
         SRL   2,18
         N     2,=F'1'
         CLR   3,2
         BE    L2112
         CLM   6,1,=XL1'0A'
         BE    L2112
         CLI   8(4),25
         BNE   L2143
         ST    4,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BNE   L2112
L2143    EQU   *
         CLI   8(4),113
         BNE   L2145
         L     2,16(4)
         CLI   8(2),25
         BNE   L2145
         ST    2,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BNE   L2112
L2145    EQU   *
         L     15,4(4)
         L     3,32(15)
         SRL   3,23
         L     2,32(7)
         SRL   2,23
         CR    3,2
         BNL   L2147
         L     2,8(15)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BNE   L2112
L2147    EQU   *
         L     2,8(7)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BE    L2149
         MVC   88(4,13),=A(LC180)
         B     L2186
L2149    EQU   *
         MVC   88(4,13),=A(LC181)
         ST    2,92(13)
L2180    EQU   *
         ST    8,96(13)
         MVC   100(4,13),132(13)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
L2112    EQU   *
         ST    7,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),116(13)
         ST    8,104(13)
         MVC   108(4,13),132(13)
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         LR    4,15
         L     2,116(13)
         LTR   2,2
         BE    L2153
         L     2,4(2)
L2153    EQU   *
         ST    2,88(13)
         L     2,=V(TARGETM)
         L     2,356(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L2111
         IC    2,8(7)
         CLM   2,1,=XL1'06'
         BE    L2154
         CLM   2,1,=XL1'0A'
         BE    L2154
         CLM   2,1,=XL1'0B'
         BE    L2154
         SLL   2,24
         SRA   2,24
         C     2,=F'12'
         BNE   L2111
L2154    EQU   *
         L     3,32(7)
         SRL   3,23
         L     2,=V(ZZZ@1483)
         L     2,20(2)
         L     2,32(2)
         SRL   2,23
         CR    3,2
         BNL   L2111
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    4,15
L2111    EQU   *
         MVC   88(4,13),=F'0'
         ST    4,92(13)
         B     L2182
L2109    EQU   *
         L     3,4(15)
         IC    2,8(3)
         SLL   2,24
         SRA   2,24
         C     2,=F'7'
         BNE   L2156
         L     3,32(3)
         SRL   3,23
         L     15,120(6)
         L     2,32(15)
         SRL   2,23
         CR    3,2
         BNL   L2156
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    7,88(13)
         B     L2181
L2156    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         MVC   88(4,13),=F'0'
L2181    EQU   *
         ST    15,92(13)
L2182    EQU   *
         MVC   96(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,124(13)
         LTR   9,9
         BE    L2102
         L     9,0(9)
L2102    EQU   *
         L     2,120(13)
         MVC   120(4,13),0(2)
         L     3,132(13)
         A     3,=F'1'
         ST    3,132(13)
         L     6,120(13)
         LTR   6,6
         BNE   L2159
L2101    EQU   *
         LTR   9,9
         BE    L2160
         L     3,16(9)
         L     2,=V(GLOBAL@T)
         CL    3,144(2)
         BE    L2160
         LTR   8,8
         BE    L2161
         MVC   88(4,13),=A(LC182)
         MVC   92(4,13),12(8)
         B     L2184
L2161    EQU   *
         MVC   88(4,13),=A(LC183)
L2184    EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L2160    EQU   *
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(NREVERSE)
         BALR  14,15
         LR    4,15
         L     2,112(13)
         MVC   88(4,13),24(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@156)
         BALR  14,15
         CLI   8(5),119
         BNE   L2164
         L     3,16(5)
         CLI   8(3),30
         BNE   L2164
         L     2,28(3)
         N     2,=F'6'
         LTR   2,2
         BE    L2164
         ST    3,88(13)
         MVC   92(4,13),4(11)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@674)
         BALR  14,15
         LTR   15,15
         BNE   L2081
L2164    EQU   *
         MVC   88(4,13),=F'54'
         L     3,112(13)
         MVC   92(4,13),4(3)
         ST    5,96(13)
         ST    4,100(13)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         OC    8(4,15),=F'8388608'
         L     2,=A(@@V7)
         L     2,0(2)
         LTR   2,2
         BE    L2166
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD@INI)
         BALR  14,15
         LR    3,15
         L     2,8(15)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BE    L2169
         LTR   8,8
         BE    L2168
         MVC   88(4,13),12(8)
         MVC   92(4,13),=A(LC184)
         MVC   96(4,13),=F'10'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BE    L2169
L2168    EQU   *
         MVC   88(4,13),=A(LC113)
         LA    1,88(,13)
         L     15,=A(ZZZ@1641)
         BALR  14,15
         B     L2169
L2166    EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    3,15
L2169    EQU   *
         L     2,4(3)
         LR    15,3
         CLI   8(2),5
         BE    L2081
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(REQUIRE@)
         BALR  14,15
L2081    EQU   *
* Function ZZZ_76 epilogue
         PDPEPIL
* Function ZZZ_76 literal pool
         DS    0F
         LTORG
* Function ZZZ_76 page table
         DS    0F
PGT66    EQU   *
         DC    A(PG66)
LC185    EQU   *
         DC    C'dereferencing pointer to incomplete type'
         DC    X'0'
LC186    EQU   *
         DC    C'dereferencing `void *'' pointer'
         DC    X'0'
LC187    EQU   *
         DC    C'invalid type argument of `%s'''
         DC    X'0'
         DS    0F
* X-func ZZZ_82 prologue
ZZZ@82   PDPPRLG CINDEX=67,FRAME=104,BASER=12,ENTRY=YES
         B     FEN67
         LTORG
FEN67    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG67     EQU   *
         LR    11,1
         L     10,=A(PGT67)
* Function ZZZ_82 code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    6,15
         L     4,4(15)
         IC    2,8(15)
         CLI   8(4),13
         BNE   L2188
         CLM   2,1,=XL1'77'
         BNE   L2189
         L     2,16(15)
         L     3,4(2)
         CL    3,4(4)
         BE    L2187
L2189    EQU   *
         L     4,4(4)
         MVC   88(4,13),=F'42'
         MVC   92(4,13),68(4)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    5,15
         L     2,16(4)
         LTR   2,2
         BNE   L2191
         IC    2,8(4)
         CLM   2,1,=XL1'05'
         BE    L2191
         CLM   2,1,=XL1'12'
         BE    L2191
         MVC   88(4,13),=A(LC185)
         B     L2197
L2191    EQU   *
         CLI   8(4),5
         BNE   L2192
         L     2,=V(SKIP@EVA)
         L     2,0(2)
         LTR   2,2
         BNE   L2192
         MVC   88(4,13),=A(LC186)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L2192    EQU   *
         L     3,8(4)
         N     3,=F'524288'
         L     2,8(5)
         N     2,=F'-524289'
         OR    2,3
         ST    2,8(5)
         SLR   3,3
         L     2,8(4)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BNE   L2194
         L     2,8(6)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         BE    L2193
L2194    EQU   *
         LA    3,1(0,0)
L2193    EQU   *
         SLL   3,23
         L     2,8(5)
         N     2,=F'-8388609'
         OR    2,3
         ST    2,8(5)
         L     3,8(4)
         N     3,=F'1048576'
         N     2,=F'-1048577'
         OR    2,3
         ST    2,8(5)
         LR    2,5
         B     L2187
L2188    EQU   *
         CLM   2,1,=XL1'00'
         BE    L2195
         MVC   88(4,13),=A(LC187)
         MVC   92(4,13),4(11)
L2197    EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L2195    EQU   *
         L     2,=V(GLOBAL@T)
         L     2,0(2)
L2187    EQU   *
         LR    15,2
* Function ZZZ_82 epilogue
         PDPEPIL
* Function ZZZ_82 literal pool
         DS    0F
         LTORG
* Function ZZZ_82 page table
         DS    0F
PGT67    EQU   *
         DC    A(PG67)
         DS    0F
* Function unary_complex_lvalue,F12 prologue
@@F12    PDPPRLG CINDEX=68,FRAME=104,BASER=12,ENTRY=NO
         B     FEN68
         LTORG
FEN68    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG68     EQU   *
         LR    11,1
         L     10,=A(PGT68)
* Function unary_complex_lvalue code
         L     4,0(11)
         L     3,4(11)
         L     5,8(11)
         IC    2,8(3)
         CLM   2,1,=XL1'30'
         BNE   L2199
         ST    4,88(13)
         MVC   92(4,13),20(3)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(BUILD@UN)
         BALR  14,15
         LR    4,15
         L     2,4(3)
         CLI   8(2),23
         BE    L2200
         LTR   5,5
         BNE   L2200
         MVC   88(4,13),=F'48'
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
L2200    EQU   *
         MVC   88(4,13),=F'48'
         MVC   92(4,13),4(4)
         MVC   96(4,13),16(3)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         B     L2198
L2199    EQU   *
         SLR   15,15
         CLM   2,1,=XL1'34'
         BNE   L2198
         LTR   5,5
         BNE   L2202
         MVC   88(4,13),=F'52'
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
L2202    EQU   *
         L     2,4(3)
         CLI   8(2),23
         BE    L2203
         LTR   5,5
         BNE   L2203
         MVC   88(4,13),=F'48'
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
L2203    EQU   *
         ST    4,88(13)
         MVC   92(4,13),20(3)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(BUILD@UN)
         BALR  14,15
         LR    2,15
         ST    4,88(13)
         MVC   92(4,13),24(3)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(BUILD@UN)
         BALR  14,15
         MVC   88(4,13),16(3)
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@69)
         BALR  14,15
L2198    EQU   *
* Function unary_complex_lvalue epilogue
         PDPEPIL
* Function unary_complex_lvalue literal pool
         DS    0F
         LTORG
* Function unary_complex_lvalue page table
         DS    0F
PGT68    EQU   *
         DC    A(PG68)
LC188    EQU   *
         DC    C'suggest parentheses around + or - inside shift'
         DC    X'0'
LC189    EQU   *
         DC    C'suggest parentheses around '
         DC    X'50'
         DC    X'50'
         DC    C' within ||'
         DC    X'0'
LC190    EQU   *
         DC    C'suggest parentheses around arithmetic in operand'
         DC    C' of |'
         DC    X'0'
LC191    EQU   *
         DC    C'suggest parentheses around comparison in operand'
         DC    C' of |'
         DC    X'0'
LC192    EQU   *
         DC    C'suggest parentheses around arithmetic in operand'
         DC    C' of ¬'
         DC    X'0'
LC193    EQU   *
         DC    C'suggest parentheses around comparison in operand'
         DC    C' of ¬'
         DC    X'0'
LC194    EQU   *
         DC    C'suggest parentheses around + or - in operand of '
         DC    X'50'
         DC    X'0'
LC195    EQU   *
         DC    C'suggest parentheses around comparison in operand'
         DC    C' of '
         DC    X'50'
         DC    X'0'
LC196    EQU   *
         DC    C'comparisons like X<=Y<=Z do not have their mathe'
         DC    C'matical meaning'
         DC    X'0'
         DS    0F
* X-func parser_build_binary_op prologue
PARSER@B PDPPRLG CINDEX=69,FRAME=104,BASER=12,ENTRY=YES
         B     FEN69
         LTORG
FEN69    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG69     EQU   *
         LR    11,1
         L     10,=A(PGT69)
* Function parser_build_binary_op code
         L     8,0(11)
         ST    8,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(BUILD@BI)
         BALR  14,15
         LR    5,15
         L     9,=V(ZZZ@1978)
         L     3,4(11)
         SLR   2,2
         IC    2,8(3)
         IC    3,0(9,2)
         L     4,8(11)
         SLR   2,2
         IC    2,8(4)
         IC    7,0(9,2)
         SLR   4,4
         LR    6,4
         IC    2,8(15)
         CLM   2,1,=XL1'00'
         BNE   L2205
         L     2,=V(GLOBAL@T)
         L     15,0(2)
         B     L2204
L2205    EQU   *
         MVC   88(4,13),=A(LC83)
         N     3,=XL4'000000FF'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L2206
         L     2,4(11)
         L     6,12(2)
L2206    EQU   *
         MVC   88(4,13),=A(LC83)
         N     7,=XL4'000000FF'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L2207
         L     3,8(11)
         L     4,12(3)
L2207    EQU   *
         L     2,=V(WARN@PAR)
         L     2,0(2)
         LTR   2,2
         BE    L2208
         LR    2,8
         A     2,=F'-81'
         LA    3,1(0,0)
         CLR   2,3
         BH    L2209
         LR    2,6
         A     2,=F'-59'
         CLR   2,3
         BNH   L2211
         LA    2,59(0,0)
         CLR   4,2
         BE    L2211
         LA    3,60(0,0)
         CLR   4,3
         BNE   L2209
L2211    EQU   *
         MVC   88(4,13),=A(LC188)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L2209    EQU   *
         LA    2,90(0,0)
         CLR   8,2
         BNE   L2212
         LA    3,89(0,0)
         CLR   6,3
         BE    L2214
         CLR   4,3
         BNE   L2208
L2214    EQU   *
         MVC   88(4,13),=A(LC189)
         B     L2234
L2212    EQU   *
         LA    2,85(0,0)
         CLR   8,2
         BNE   L2215
         LR    2,6
         A     2,=F'-86'
         LA    3,1(0,0)
         CLR   2,3
         BNH   L2217
         LA    2,59(0,0)
         CLR   6,2
         BE    L2217
         LA    3,60(0,0)
         CLR   6,3
         BE    L2217
         LA    2,87(0,0)
         CLR   4,2
         BE    L2217
         LA    3,86(0,0)
         CLR   4,3
         BE    L2217
         LA    2,59(0,0)
         CLR   4,2
         BE    L2217
         LA    3,60(0,0)
         CLR   4,3
         BNE   L2216
L2217    EQU   *
         MVC   88(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L2216    EQU   *
         IC    2,0(9,6)
         CLM   2,1,=XL1'4C'
         BE    L2219
         IC    2,0(9,4)
         CLM   2,1,=XL1'4C'
         BNE   L2208
L2219    EQU   *
         MVC   88(4,13),=A(LC191)
         B     L2234
L2215    EQU   *
         LA    2,86(0,0)
         CLR   8,2
         BNE   L2220
         LA    3,87(0,0)
         CLR   6,3
         BE    L2222
         LA    2,59(0,0)
         CLR   6,2
         BE    L2222
         LA    3,60(0,0)
         CLR   6,3
         BE    L2222
         LA    2,87(0,0)
         CLR   4,2
         BE    L2222
         LA    3,59(0,0)
         CLR   4,3
         BE    L2222
         LA    2,60(0,0)
         CLR   4,2
         BNE   L2221
L2222    EQU   *
         MVC   88(4,13),=A(LC192)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L2221    EQU   *
         L     3,=V(ZZZ@1978)
         IC    2,0(3,6)
         CLM   2,1,=XL1'4C'
         BE    L2224
         IC    2,0(3,4)
         CLM   2,1,=XL1'4C'
         BNE   L2208
L2224    EQU   *
         MVC   88(4,13),=A(LC193)
         B     L2234
L2220    EQU   *
         LA    3,87(0,0)
         CLR   8,3
         BNE   L2208
         LR    2,6
         A     2,=F'-59'
         LA    3,1(0,0)
         CLR   2,3
         BNH   L2227
         LA    2,59(0,0)
         CLR   4,2
         BE    L2227
         LA    3,60(0,0)
         CLR   4,3
         BNE   L2226
L2227    EQU   *
         MVC   88(4,13),=A(LC194)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L2226    EQU   *
         L     3,=V(ZZZ@1978)
         IC    2,0(3,6)
         CLM   2,1,=XL1'4C'
         BE    L2229
         IC    2,0(3,4)
         CLM   2,1,=XL1'4C'
         BNE   L2208
L2229    EQU   *
         MVC   88(4,13),=A(LC195)
L2234    EQU   *
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L2208    EQU   *
         L     3,=V(ZZZ@1978)
         IC    2,0(3,8)
         CLM   2,1,=XL1'4C'
         BNE   L2230
         L     2,=V(EXTRA@WA)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L2230
         IC    2,0(3,6)
         CLM   2,1,=XL1'4C'
         BE    L2231
         IC    2,0(3,4)
         CLM   2,1,=XL1'4C'
         BNE   L2230
L2231    EQU   *
         MVC   88(4,13),=A(LC196)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L2230    EQU   *
         ST    5,88(13)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@1994)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@1994)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(OVERFLOW)
         BALR  14,15
         SLR   2,2
         IC    2,8(5)
         IC    2,0(3,2)
         MVC   88(4,13),=A(LC83)
         N     2,=XL4'000000FF'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L2232
         ST    8,12(5)
         B     L2233
L2232    EQU   *
         L     3,8(5)
         SRL   3,22
         N     3,=F'1'
         MVC   88(4,13),=F'114'
         MVC   92(4,13),4(5)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    5,15
         ST    8,12(15)
         SLL   3,22
         L     2,8(15)
         N     2,=F'-4194305'
         OR    2,3
         ST    2,8(15)
L2233    EQU   *
         LR    15,5
L2204    EQU   *
* Function parser_build_binary_op epilogue
         PDPEPIL
* Function parser_build_binary_op literal pool
         DS    0F
         LTORG
* Function parser_build_binary_op page table
         DS    0F
PGT69    EQU   *
         DC    A(PG69)
LC197    EQU   *
         DC    C'subscript missing in array reference'
         DC    X'0'
LC198    EQU   *
         DC    C'array subscript has type `char'''
         DC    X'0'
LC199    EQU   *
         DC    C'array subscript is not an integer'
         DC    X'0'
LC200    EQU   *
         DC    C'ISO C forbids subscripting `register'' array'
         DC    X'0'
LC201    EQU   *
         DC    C'ISO C90 forbids subscripting non-lvalue array'
         DC    X'0'
LC202    EQU   *
         DC    C'subscript has type `char'''
         DC    X'0'
LC203    EQU   *
         DC    C'subscripted value is neither array nor pointer'
         DC    X'0'
LC204    EQU   *
         DC    C'array indexing'
         DC    X'0'
         DS    0F
* X-func ZZZ_60 prologue
ZZZ@60   PDPPRLG CINDEX=70,FRAME=104,BASER=12,ENTRY=YES
         B     FEN70
         LTORG
FEN70    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG70     EQU   *
         LR    11,1
         L     10,=A(PGT70)
* Function ZZZ_60 code
         L     6,0(11)
         L     5,4(11)
         L     2,=V(GLOBAL@T)
         LTR   5,5
         BNE   L2236
         MVC   88(4,13),=A(LC197)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     15,0(2)
         B     L2235
L2236    EQU   *
         LR    7,2
         L     2,4(6)
         L     15,0(7)
         CLR   2,15
         BE    L2235
         L     3,4(5)
         CLR   3,15
         BE    L2235
         CLI   8(2),18
         BNE   L2239
         CLI   8(6),42
         BE    L2239
         L     2,=V(WARN@CHA)
         L     2,0(2)
         LTR   2,2
         BE    L2240
         L     3,68(3)
         L     2,=V(ZZZ@1483)
         CL    3,0(2)
         BNE   L2240
         MVC   88(4,13),=A(LC198)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L2240    EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    5,15
         L     2,4(15)
         CLI   8(2),6
         BE    L2241
         MVC   88(4,13),=A(LC199)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L2264
L2241    EQU   *
         CLI   8(15),25
         BNE   L2243
         L     2,4(6)
         L     2,4(2)
         L     2,16(2)
         LTR   2,2
         BE    L2242
         CLI   8(2),25
         BE    L2242
L2243    EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(C@MARK@A)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L2264
L2242    EQU   *
         CLI   8(5),25
         BNE   L2245
         L     3,4(6)
         L     2,12(3)
         LTR   2,2
         BE    L2245
         ST    5,88(13)
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BNE   L2245
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(C@MARK@A)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L2245
L2264    EQU   *
         L     15,0(7)
         B     L2235
L2245    EQU   *
         L     2,=V(ZZZ@1636)
         L     2,0(2)
         LTR   2,2
         BE    L2247
         LR    3,6
         CLI   8(6),40
         BNE   L2261
L2250    EQU   *
         L     3,16(3)
         CLI   8(3),40
         BE    L2250
L2261    EQU   *
         CLI   8(3),34
         BNE   L2251
         L     2,28(3)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    L2251
         MVC   88(4,13),=A(LC200)
         B     L2262
L2251    EQU   *
         L     2,=V(ZZZ@754)
         L     2,0(2)
         LTR   2,2
         BNE   L2247
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(LVALUE@P)
         BALR  14,15
         LTR   15,15
         BNE   L2247
         MVC   88(4,13),=A(LC201)
L2262    EQU   *
         LA    1,88(,13)
         L     15,=V(PEDWARN)
         BALR  14,15
L2247    EQU   *
         L     2,4(6)
         L     2,4(2)
         L     2,68(2)
         MVC   88(4,13),=F'44'
         ST    2,92(13)
         ST    6,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         L     3,8(15)
         L     2,4(6)
         L     2,4(2)
         L     2,8(2)
         O     2,8(6)
         OR    2,3
         N     2,=F'524288'
         N     3,=F'-524289'
         OR    3,2
         ST    3,8(15)
         LR    5,3
         SRL   5,23
         L     2,4(6)
         L     2,4(2)
         L     4,8(2)
         SRL   4,20
         L     2,8(6)
         SRL   2,23
         OR    2,4
         OR    2,5
         N     2,=F'1'
         SLL   2,23
         N     3,=F'-8388609'
         OR    3,2
         ST    3,8(15)
         L     2,4(6)
         L     2,4(2)
         L     2,8(2)
         O     2,8(6)
         OR    2,3
         N     2,=F'1048576'
         N     3,=F'-1048577'
         OR    3,2
         ST    3,8(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(REQUIRE@)
         BALR  14,15
         B     L2235
L2239    EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    4,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@408)
         BALR  14,15
         LR    6,15
         L     2,=V(WARN@CHA)
         L     2,0(2)
         LTR   2,2
         BE    L2254
         L     15,4(5)
         CLI   8(15),6
         BNE   L2254
         L     3,68(15)
         L     2,=V(ZZZ@1483)
         CL    3,0(2)
         BNE   L2254
         MVC   88(4,13),=A(LC202)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L2254    EQU   *
         L     2,4(4)
         CLI   8(2),6
         BNE   L2255
         LR    2,4
         LR    4,6
         LR    6,2
L2255    EQU   *
         L     3,=V(GLOBAL@T)
         LR    15,4
         CL    4,0(7)
         BE    L2235
         L     2,4(4)
         CLI   8(2),13
         BNE   L2258
         L     2,4(2)
         CLI   8(2),23
         BNE   L2257
L2258    EQU   *
         MVC   88(4,13),=A(LC203)
         B     L2263
L2257    EQU   *
         L     2,4(6)
         CLI   8(2),6
         BE    L2259
         MVC   88(4,13),=A(LC199)
L2263    EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     15,0(3)
         B     L2235
L2259    EQU   *
         MVC   88(4,13),=F'59'
         ST    4,92(13)
         ST    6,96(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(BUILD@BI)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=A(LC204)
         LA    1,88(,13)
         L     15,=A(ZZZ@82)
         BALR  14,15
L2235    EQU   *
* Function ZZZ_60 epilogue
         PDPEPIL
* Function ZZZ_60 literal pool
         DS    0F
         LTORG
* Function ZZZ_60 page table
         DS    0F
PGT70    EQU   *
         DC    A(PG70)
         DS    0F
@@V12    EQU   *
         DC    4X'00'
         DS    0F
@@V7     EQU   *
         DC    4X'00'
         DS    0F
@@V8     EQU   *
         DC    4X'00'
         DS    0F
@@V1     EQU   *
         DC    4X'00'
         DS    0F
@@V2     EQU   *
         DC    4X'00'
         DS    0F
@@V3     EQU   *
         DC    4X'00'
         DS    0F
@@V4     EQU   *
         DC    4X'00'
         DS    0F
@@V13    EQU   *
         DC    4X'00'
         DS    0F
@@V14    EQU   *
         DC    4X'00'
         DS    0F
@@V15    EQU   *
         DC    4X'00'
         DS    0F
@@V16    EQU   *
         DC    4X'00'
         DS    0F
@@V18    EQU   *
         DC    4X'00'
         DS    0F
@@V17    EQU   *
         DC    4X'00'
         DS    0F
@@V19    EQU   *
         DC    4X'00'
         DS    0F
@@V9     EQU   *
         DC    4X'00'
         DS    0F
@@V25    EQU   *
         DC    4X'00'
         DS    0F
@@V20    EQU   *
         DC    4X'00'
         DS    0F
@@V21    EQU   *
         DC    4X'00'
         DS    0F
@@V22    EQU   *
         DC    4X'00'
         DS    0F
@@V23    EQU   *
         DC    4X'00'
         DS    0F
@@V24    EQU   *
         DC    4X'00'
         DS    0F
@@V5     EQU   *
         DC    4X'00'
         DS    0F
@@V6     EQU   *
         DC    4X'00'
         DS    0F
@@V10    EQU   *
         DC    4X'00'
         DS    0F
@@V11    EQU   *
         DC    4X'00'
         DS    0F
@@V26    EQU   *
         DC    4X'00'
         DS    0F
@@V27    EQU   *
         DC    4X'00'
* X-var ZZZ_202
         ENTRY ZZZ@202
         DS    0F
ZZZ@202  EQU   *
         DC    4X'00'
* X-var ZZZ_201
         ENTRY ZZZ@201
         DS    0F
ZZZ@201  EQU   *
         DC    4X'00'
* X-var ZZZ_1445
         ENTRY ZZZ@1445
         DS    0F
ZZZ@1445 EQU   *
         DC    4X'00'
         DS    0F
@@V28    EQU   *
         DC    4X'00'
         END
