         COPY  PDPTOP
         CSECT
* Program text area
         DS    0F
* X-func split_loop_bb prologue
SPLIT@LO PDPPRLG CINDEX=0,FRAME=104,BASER=12,ENTRY=YES
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function split_loop_bb code
         L     2,=V(CFG@HOOK)
         L     2,0(2)
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         L     2,24(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),12(15)
         L     2,8(15)
         MVC   92(4,13),60(2)
         LA    1,88(,13)
         L     15,=V(ADD@BB@T)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(ADD@TO@D)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),8(3)
         MVC   96(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1766)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),12(3)
         MVC   96(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
         LR    15,3
* Function split_loop_bb epilogue
         PDPEPIL
* Function split_loop_bb literal pool
         DS    0F
         LTORG
* Function split_loop_bb page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         DS    0F
* Function rpe_enum_p,F1 prologue
@@F1     PDPPRLG CINDEX=1,FRAME=104,BASER=12,ENTRY=NO
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function rpe_enum_p code
         MVC   88(4,13),=F'0'
         MVC   92(4,13),0(11)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(DOMINATE)
         BALR  14,15
         N     15,=XL4'000000FF'
* Function rpe_enum_p epilogue
         PDPEPIL
* Function rpe_enum_p literal pool
         DS    0F
         LTORG
* Function rpe_enum_p page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* Function alp_enum_p,F7 prologue
@@F7     PDPPRLG CINDEX=2,FRAME=88,BASER=12,ENTRY=NO
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function alp_enum_p code
         L     15,0(11)
         X     15,4(11)
         LPR   15,15
         LCR   15,15
         SRL   15,31
* Function alp_enum_p epilogue
         PDPEPIL
* Function alp_enum_p literal pool
         DS    0F
         LTORG
* Function alp_enum_p page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
         DS    0F
* Function scale_bbs_frequencies,F9 prologue
@@F9     PDPPRLG CINDEX=3,FRAME=128,BASER=12,ENTRY=NO
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function scale_bbs_frequencies code
         SLR   2,2
         SLR   3,3
         ST    2,88(13)
         ST    3,4+88(13)
         LR    8,2
         LR    9,3
         ST    2,96(13)
         ST    3,4+96(13)
         LR    6,2
         LR    7,3
         ST    2,104(13)
         ST    3,4+104(13)
         ST    2,112(13)
         ST    3,4+112(13)
         SLR   3,3
         C     3,4(11)
         BNL   L15
         MVC   120(4,13),0(11)
L13      EQU   *
         L     4,120(13)
         L     2,0(4)
         L     5,8(11)
         ST    5,92(13)
         L     4,88(13)
         L     5,4+88(13)
         M     4,76(2)
         ST    4,88(13)
         ST    5,4+88(13)
         LR    8,5
         SRDA  8,32
         D     8,12(11)
         ST    9,76(2)
         L     5,8(11)
         ST    5,100(13)
         L     4,96(13)
         L     5,4+96(13)
         M     4,72(2)
         ST    4,96(13)
         ST    5,4+96(13)
         LR    6,5
         SRDA  6,32
         D     6,12(11)
         ST    7,72(2)
         L     2,20(2)
L18      EQU   *
         LTR   2,2
         BE    L17
         L     5,8(11)
         ST    5,108(13)
         L     4,104(13)
         L     5,4+104(13)
         M     4,32(2)
         ST    4,104(13)
         ST    5,4+104(13)
         ST    5,112(13)
         L     4,112(13)
         L     5,4+112(13)
         SRDA  4,32
         D     4,12(11)
         ST    4,112(13)
         ST    5,4+112(13)
         ST    5,32(2)
         L     2,4(2)
         B     L18
L17      EQU   *
         A     3,=F'1'
         L     5,120(13)
         A     5,=F'4'
         ST    5,120(13)
         C     3,4(11)
         BL    L13
L15      EQU   *
* Function scale_bbs_frequencies epilogue
         PDPEPIL
* Function scale_bbs_frequencies literal pool
         DS    0F
         LTORG
* Function scale_bbs_frequencies page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
         DS    0F
* Function scale_loop_frequencies,F10 prologue
@@F10    PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=NO
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function scale_loop_frequencies code
         L     2,0(11)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1037)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),124(2)
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function scale_loop_frequencies epilogue
         PDPEPIL
* Function scale_loop_frequencies literal pool
         DS    0F
         LTORG
* Function scale_loop_frequencies page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
         DS    0F
* Function loop_redirect_edge,F16 prologue
@@F16    PDPPRLG CINDEX=5,FRAME=96,BASER=12,ENTRY=NO
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function loop_redirect_edge code
         L     15,0(11)
         L     3,4(11)
         L     2,12(15)
         CLR   2,3
         BE    L20
         L     2,=V(CFG@HOOK)
         L     2,0(2)
         ST    15,88(13)
         ST    3,92(13)
         L     2,16(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L20      EQU   *
* Function loop_redirect_edge epilogue
         PDPEPIL
* Function loop_redirect_edge literal pool
         DS    0F
         LTORG
* Function loop_redirect_edge page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
         DS    0F
* X-func fix_loop_placement prologue
FIX@LOOP PDPPRLG CINDEX=6,FRAME=96,BASER=12,ENTRY=YES
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function fix_loop_placement code
         L     4,0(11)
         L     2,152(4)
         L     5,0(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1037)
         BALR  14,15
         LR    8,15
         SLR   7,7
         CL    7,124(4)
         BNL   L39
         LR    6,15
L32      EQU   *
         L     2,0(6)
         L     3,20(2)
L44      EQU   *
         LTR   3,3
         BE    L41
         ST    4,88(13)
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(FLOW@BB@)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L28
         ST    4,88(13)
         L     2,12(3)
         MVC   92(4,13),60(2)
         LA    1,88(,13)
         L     15,=V(FIND@COM)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@846)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L28
         LR    5,2
L28      EQU   *
         L     3,4(3)
         B     L44
L41      EQU   *
         A     7,=F'1'
         A     6,=F'4'
         CL    7,124(4)
         BL    L32
L39      EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     15,160(4)
         SLR   2,2
         CLR   5,15
         BE    L22
         LR    2,15
L45      EQU   *
         CLR   2,5
         BE    L43
         L     3,124(2)
         S     3,124(4)
         ST    3,124(2)
         L     2,160(2)
         B     L45
L43      EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@850)
         BALR  14,15
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@849)
         BALR  14,15
         LA    2,1(0,0)
L22      EQU   *
         LR    15,2
* Function fix_loop_placement epilogue
         PDPEPIL
* Function fix_loop_placement literal pool
         DS    0F
         LTORG
* Function fix_loop_placement page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
         DS    0F
* Function fix_bb_placements,F5 prologue
@@F5     PDPPRLG CINDEX=7,FRAME=120,BASER=12,ENTRY=NO
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function fix_bb_placements code
         L     7,4(11)
         MVC   112(4,13),60(7)
         L     3,112(13)
         L     2,0(11)
         CL    3,16(2)
         BE    L46
         L     2,=V(LAST@BAS)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         LR    8,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         L     3,44(7)
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         O     2,12(8,4)
         ST    2,12(8,4)
         L     3,112(13)
         L     2,4(3)
         L     3,44(2)
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         O     2,12(8,4)
         ST    2,12(8,4)
         L     3,112(13)
         L     2,124(3)
         SLL   2,2
         A     2,=F'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,96(13)
         L     2,124(3)
         SLL   2,2
         LR    3,15
         AR    3,2
         A     3,=F'4'
         ST    3,100(13)
         ST    15,104(13)
         LR    2,15
         ST    7,0(15)
         A     2,=F'4'
         ST    2,108(13)
L75      EQU   *
         L     3,104(13)
         L     7,0(3)
         A     3,=F'4'
         ST    3,104(13)
         CL    3,100(13)
         BNE   L50
         MVC   104(4,13),96(13)
L50      EQU   *
         L     3,44(7)
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         X     2,=F'-1'
         N     2,12(8,4)
         ST    2,12(8,4)
         L     3,60(7)
         L     2,4(3)
         CLR   2,7
         BNE   L51
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(FIX@LOOP)
         BALR  14,15
         LTR   15,15
         BNE   L53
         B     L48
L51      EQU   *
         L     2,0(11)
         L     6,16(2)
         L     5,20(7)
L81      EQU   *
         LTR   5,5
         BE    L79
         L     3,12(5)
         L     2,=V(ENTRY@EX)
         LA    2,88(0,2)
         CLR   3,2
         BE    L57
         L     4,60(3)
         L     2,4(4)
         CLR   2,3
         BNE   L59
         L     4,160(4)
L59      EQU   *
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@846)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L57
         LR    6,4
L57      EQU   *
         L     5,4(5)
         B     L81
L79      EQU   *
         SLR   2,2
         CL    6,60(7)
         BE    L63
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(REMOVE@B)
         BALR  14,15
         ST    7,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ADD@BB@T)
         BALR  14,15
         LA    2,1(0,0)
L63      EQU   *
         LTR   2,2
         BE    L48
L53      EQU   *
         L     9,16(7)
L82      EQU   *
         LTR   9,9
         BE    L48
         L     4,8(9)
         L     3,44(4)
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(8,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L66
         MVC   88(4,13),60(4)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(FIND@COM)
         BALR  14,15
         L     2,60(4)
         CL    2,112(13)
         BE    L68
         CL    15,112(13)
         BE    L69
         CLR   15,2
         BE    L68
L69      EQU   *
         L     4,4(2)
         B     L70
L68      EQU   *
         MVC   88(4,13),60(7)
         MVC   92(4,13),60(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@846)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L66
L70      EQU   *
         L     2,44(4)
         LR    3,2
         SRL   3,5
         SLL   3,2
         AR    3,8
         A     3,=F'12'
         LR    5,2
         N     5,=F'31'
         L     6,0(3)
         LR    2,6
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BNE   L66
         L     2,108(13)
         ST    4,0(2)
         A     2,=F'4'
         ST    2,108(13)
         CL    2,100(13)
         BNE   L73
         MVC   108(4,13),96(13)
L73      EQU   *
         LA    2,1(0,0)
         SLL   2,0(5)
         OR    6,2
         ST    6,0(3)
L66      EQU   *
         L     9,0(9)
         B     L82
L48      EQU   *
         L     3,104(13)
         CL    3,108(13)
         BNE   L75
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),96(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L46      EQU   *
* Function fix_bb_placements epilogue
         PDPEPIL
* Function fix_bb_placements literal pool
         DS    0F
         LTORG
* Function fix_bb_placements page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
         DS    0F
* X-func unloop prologue
UNLOOP   PDPPRLG CINDEX=8,FRAME=104,BASER=12,ENTRY=YES
         B     FEN8
         LTORG
FEN8     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         LR    11,1
         L     10,=A(PGT8)
* Function unloop code
         L     5,4(11)
         L     9,8(5)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1037)
         BALR  14,15
         LR    7,15
         ST    5,88(13)
         LR    2,13
         A     2,=F'96'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1038)
         BALR  14,15
         ST    15,100(13)
         L     8,124(5)
         SLR   4,4
L103     EQU   *
         CLR   4,8
         BNL   L99
         LR    6,4
         SLL   6,2
         L     3,0(6,7)
         L     2,60(3)
         CLR   2,5
         BNE   L86
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(REMOVE@B)
         BALR  14,15
         L     6,0(6,7)
         ST    6,88(13)
         MVC   92(4,13),160(5)
         LA    1,88(,13)
         L     15,=V(ADD@BB@T)
         BALR  14,15
L86      EQU   *
         A     4,=F'1'
         B     L103
L99      EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L104     EQU   *
         L     2,164(5)
         LTR   2,2
         BE    L101
         L     2,164(5)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@850)
         BALR  14,15
         MVC   88(4,13),160(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@849)
         BALR  14,15
         B     L104
L101     EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@850)
         BALR  14,15
         L     4,0(11)
         L     3,12(4)
         L     2,0(5)
         SLL   2,2
         SLR   4,4
         ST    4,0(2,3)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@845)
         BALR  14,15
         MVC   88(4,13),20(9)
         LA    1,88(,13)
         L     15,=V(REMOVE@E)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         L     15,96(13)
         CLR   4,15
         BNL   L93
         L     3,100(13)
L96      EQU   *
         L     2,0(3)
         L     2,24(2)
         N     2,=F'128'
         LTR   2,2
         BNE   L93
         A     4,=F'1'
         A     3,=F'4'
         CLR   4,15
         BL    L96
L93      EQU   *
         CLR   4,15
         BE    L97
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(MARK@IRR)
         BALR  14,15
L97      EQU   *
         MVC   88(4,13),100(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function unloop epilogue
         PDPEPIL
* Function unloop literal pool
         DS    0F
         LTORG
* Function unloop page table
         DS    0F
PGT8     EQU   *
         DC    A(PG8)
         DS    0F
* Function place_new_loop,F12 prologue
@@F12    PDPPRLG CINDEX=9,FRAME=96,BASER=12,ENTRY=NO
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function place_new_loop code
         L     3,0(11)
         L     5,4(11)
         MVC   88(4,13),12(3)
         L     2,0(3)
         SLL   2,2
         A     2,=F'4'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
         ST    15,12(3)
         L     4,0(3)
         LR    2,4
         SLL   2,2
         ST    5,0(2,15)
         LR    2,4
         A     2,=F'1'
         ST    2,0(3)
         ST    4,0(5)
* Function place_new_loop epilogue
         PDPEPIL
* Function place_new_loop literal pool
         DS    0F
         LTORG
* Function place_new_loop page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
         DS    0F
* X-func loopify prologue
LOOPIFY  PDPPRLG CINDEX=10,FRAME=168,BASER=12,ENTRY=YES
         B     FEN10
         LTORG
FEN10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         LR    11,1
         L     10,=A(PGT10)
* Function loopify code
         SLR   6,6
         SLR   7,7
         LR    2,6
         LR    3,7
         ST    6,152(13)
         ST    7,4+152(13)
         ST    6,160(13)
         ST    7,4+160(13)
         L     5,8(11)
         L     9,12(11)
         L     4,4(11)
         MVC   112(4,13),12(4)
         MVC   116(4,13),8(5)
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'224'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         LR    8,15
         L     15,112(13)
         L     4,60(15)
         MVC   136(4,13),160(4)
         MVC   4(4,8),12(5)
         L     4,4(11)
         MVC   8(4,8),8(4)
         L     4,8(5)
         L     7,28(5)
         M     6,76(4)
         LR    2,7
         A     2,=F'5000'
         SRDA  2,32
         L     6,=F'10000'
         DR    2,6
         ST    3,140(13)
         MVC   144(4,13),32(5)
         L     2,20(9)
         L     3,28(2)
         L     2,4(2)
         LR    7,3
         A     7,28(2)
         BNE   L107
         LA    7,1(0,0)
L107     EQU   *
         MVC   88(4,13),4(11)
         MVC   92(4,13),12(5)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
         ST    5,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
         L     2,20(9)
         MVC   88(4,13),4(2)
         MVC   92(4,13),4(8)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
         MVC   88(4,13),20(9)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    9,92(13)
         MVC   96(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),4(8)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),112(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
         MVC   156(4,8),=F'1'
         L     15,=V(N@BASIC@)
         MVC   88(4,13),0(15)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),8(8)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=A(@@F7)
         ST    15,100(13)
         L     2,=V(N@BASIC@)
         MVC   104(4,13),0(2)
         MVC   108(4,13),4(8)
         LA    1,88(,13)
         L     15,=V(DFS@ENUM)
         BALR  14,15
         LR    6,15
         SLR   4,4
         CR    4,15
         BNL   L131
         LR    2,5
L111     EQU   *
         MVC   88(4,13),0(2)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ADD@BB@T)
         BALR  14,15
         A     4,=F'1'
         A     2,=F'4'
         CR    4,6
         BL    L111
L131     EQU   *
         MVC   88(4,13),4(8)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ADD@BB@T)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),136(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@849)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(ADD@BB@T)
         BALR  14,15
         MVC   76(4,9),140(13)
         MVC   72(4,9),144(13)
         L     2,20(9)
L140     EQU   *
         LTR   2,2
         BE    L133
         L     4,28(2)
         ST    4,156(13)
         L     4,152(13)
         L     5,4+152(13)
         M     4,72(9)
         ST    4,152(13)
         ST    5,4+152(13)
         ST    5,160(13)
         L     4,160(13)
         L     5,4+160(13)
         SRDA  4,32
         L     6,=F'10000'
         DR    4,6
         ST    4,160(13)
         ST    5,4+160(13)
         ST    5,32(2)
         L     2,4(2)
         B     L140
L133     EQU   *
         ST    8,88(13)
         ST    3,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         L     15,112(13)
         MVC   88(4,13),60(15)
         LR    2,7
         SR    2,3
         ST    2,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         L     3,=V(N@BASIC@)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,120(13)
         MVC   128(4,13),=F'0'
         L     2,=V(LAST@BAS)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         ST    15,132(13)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1037)
         BALR  14,15
         ST    15,124(13)
         L     7,128(13)
         L     15,124(8)
         CLR   7,15
         BNL   L135
         L     6,124(13)
L120     EQU   *
         L     2,0(6)
         L     3,44(2)
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         L     5,132(13)
         O     2,12(5,4)
         ST    2,12(5,4)
         A     7,=F'1'
         A     6,=F'4'
         CLR   7,15
         BL    L120
L135     EQU   *
         SLR   7,7
         CLR   7,15
         BNL   L137
         L     9,124(13)
L129     EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),0(9)
         LA    1,88(,13)
         L     15,=V(FIRST@DO)
         BALR  14,15
         LTR   15,15
         BE    L139
         L     4,128(13)
         SLL   4,2
         A     4,120(13)
L128     EQU   *
         L     2,44(15)
         LR    3,2
         SRL   3,5
         SLL   3,2
         A     3,132(13)
         A     3,=F'12'
         LR    6,2
         N     6,=F'31'
         L     5,0(3)
         LR    2,5
         SRL   2,0(6)
         N     2,=F'1'
         LTR   2,2
         BNE   L126
         LA    2,1(0,0)
         SLL   2,0(6)
         OR    5,2
         ST    5,0(3)
         ST    15,0(4)
         L     6,128(13)
         A     6,=F'1'
         ST    6,128(13)
         A     4,=F'4'
L126     EQU   *
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(NEXT@DOM)
         BALR  14,15
         LTR   15,15
         BNE   L128
L139     EQU   *
         A     7,=F'1'
         A     9,=F'4'
         CL    7,124(8)
         BL    L129
L137     EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),120(13)
         MVC   96(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(ITERATE@)
         BALR  14,15
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    15,8
* Function loopify epilogue
         PDPEPIL
* Function loopify literal pool
         DS    0F
         LTORG
* Function loopify page table
         DS    0F
PGT10    EQU   *
         DC    A(PG10)
         DS    0F
* Function duplicate_loop,F13 prologue
@@F13    PDPPRLG CINDEX=11,FRAME=96,BASER=12,ENTRY=NO
         B     FEN11
         LTORG
FEN11    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         LR    11,1
         L     10,=A(PGT11)
* Function duplicate_loop code
         L     3,4(11)
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'224'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
         MVC   156(4,2),156(3)
         ST    2,172(3)
         MVC   88(4,13),8(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@849)
         BALR  14,15
         LR    15,2
* Function duplicate_loop epilogue
         PDPEPIL
* Function duplicate_loop literal pool
         DS    0F
         LTORG
* Function duplicate_loop page table
         DS    0F
PGT11    EQU   *
         DC    A(PG11)
         DS    0F
* Function duplicate_subloops,F14 prologue
@@F14    PDPPRLG CINDEX=12,FRAME=104,BASER=12,ENTRY=NO
         B     FEN12
         LTORG
FEN12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         LR    11,1
         L     10,=A(PGT12)
* Function duplicate_subloops code
         L     3,0(11)
         L     4,8(11)
         L     2,4(11)
         L     2,164(2)
         LTR   2,2
         BE    L149
L147     EQU   *
         ST    3,88(13)
         ST    2,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         ST    3,88(13)
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         L     2,168(2)
         LTR   2,2
         BNE   L147
L149     EQU   *
* Function duplicate_subloops epilogue
         PDPEPIL
* Function duplicate_subloops literal pool
         DS    0F
         LTORG
* Function duplicate_subloops page table
         DS    0F
PGT12    EQU   *
         DC    A(PG12)
LC0      EQU   *
         DC    C'<stdin>'
         DC    X'0'
LC1      EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* Function loop_delete_branch_edge,F17 prologue
@@F17    PDPPRLG CINDEX=13,FRAME=104,BASER=12,ENTRY=NO
         B     FEN13
         LTORG
FEN13    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         LR    11,1
         L     10,=A(PGT13)
* Function loop_delete_branch_edge code
         L     6,0(11)
         L     4,8(6)
         L     2,20(4)
         L     2,4(2)
         LTR   2,2
         BE    L151
         L     2,4(2)
         SLR   5,5
         LTR   2,2
         BNE   L150
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    L150
         L     2,20(4)
         LR    3,2
         CLR   6,2
         BNE   L155
         L     3,4(6)
L155     EQU   *
         L     15,12(3)
         SLR   5,5
         L     2,=V(ENTRY@EX)
         LA    2,88(0,2)
         CLR   15,2
         BE    L150
         LA    5,1(0,0)
         L     2,4(11)
         LTR   2,2
         BE    L150
         L     7,24(3)
         N     7,=F'128'
         L     2,=V(CFG@HOOK)
         L     2,0(2)
         ST    6,88(13)
         ST    15,92(13)
         L     2,12(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         SLR   5,5
         CLM   15,1,=XL1'00'
         BE    L150
         L     3,20(4)
         L     2,24(3)
         N     2,=F'-129'
         OR    2,7
         ST    2,24(3)
         LA    5,1(0,0)
         B     L150
L151     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'805'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L150     EQU   *
         LR    15,5
* Function loop_delete_branch_edge epilogue
         PDPEPIL
* Function loop_delete_branch_edge literal pool
         DS    0F
         LTORG
* Function loop_delete_branch_edge page table
         DS    0F
PGT13    EQU   *
         DC    A(PG13)
         DS    0F
* X-func can_duplicate_loop_p prologue
CAN@DUPL PDPPRLG CINDEX=14,FRAME=96,BASER=12,ENTRY=YES
         B     FEN14
         LTORG
FEN14    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG14     EQU   *
         LR    11,1
         L     10,=A(PGT14)
* Function can_duplicate_loop_p code
         L     2,0(11)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1037)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),124(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@112)
         BALR  14,15
         LR    2,15
         N     2,=XL4'000000FF'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LTR   2,2
         BE    L161
         LA    2,1(0,0)
L161     EQU   *
         LR    15,2
* Function can_duplicate_loop_p epilogue
         PDPEPIL
* Function can_duplicate_loop_p literal pool
         DS    0F
         LTORG
* Function can_duplicate_loop_p page table
         DS    0F
PGT14    EQU   *
         DC    A(PG14)
         DS    0F
* X-func ZZZ_497 prologue
ZZZ@497  PDPPRLG CINDEX=15,FRAME=304,BASER=12,ENTRY=YES
         B     FEN15
         LTORG
FEN15    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG15     EQU   *
         LR    11,1
         L     10,=A(PGT15)
* Function ZZZ_497 code
         SLR   2,2
         SLR   3,3
         ST    2,200(13)
         ST    3,4+200(13)
         LR    6,2
         LR    7,3
         ST    2,208(13)
         ST    3,4+208(13)
         LR    8,2
         LR    9,3
         ST    2,216(13)
         ST    3,4+216(13)
         ST    2,224(13)
         ST    3,4+224(13)
         ST    2,232(13)
         ST    3,4+232(13)
         ST    2,240(13)
         ST    3,4+240(13)
         ST    2,248(13)
         ST    3,4+248(13)
         ST    2,256(13)
         ST    3,4+256(13)
         ST    2,264(13)
         ST    3,4+264(13)
         ST    2,272(13)
         ST    3,4+272(13)
         ST    2,280(13)
         ST    3,4+280(13)
         ST    2,288(13)
         ST    3,4+288(13)
         ST    2,296(13)
         ST    3,4+296(13)
         L     4,0(11)
         L     3,4(4)
         MVC   148(4,13),8(4)
         MVC   164(4,13),=F'0'
         MVC   176(4,13),164(13)
         L     2,148(13)
         L     5,4(11)
         CL    2,8(5)
         BNE   L163
         MVC   176(4,13),=F'1'
L163     EQU   *
         MVC   184(4,13),164(13)
         MVC   180(4,13),164(13)
         MVC   188(4,13),164(13)
         L     4,4(11)
         L     2,12(4)
         CLR   2,3
         BE    L164
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'860'
         B     L289
L164     EQU   *
         L     5,12(11)
         LTR   5,5
         BNE   L165
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'862'
         B     L289
L165     EQU   *
         L     2,20(11)
         LTR   2,2
         BE    L166
         MVC   88(4,13),0(11)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(FLOW@BB@)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L167
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'868'
         B     L289
L167     EQU   *
         MVC   88(4,13),0(11)
         L     4,20(11)
         MVC   92(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(FLOW@BB@)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L166
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'870'
         B     L289
L166     EQU   *
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@1037)
         BALR  14,15
         ST    15,156(13)
         ST    15,88(13)
         L     5,0(11)
         MVC   92(4,13),124(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@112)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L169
         MVC   88(4,13),156(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         SLR   15,15
         L     14,=A(L162)
         BR    14
L169     EQU   *
         L     2,0(11)
         L     4,124(2)
         SLL   4,2
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,152(13)
         L     5,4(11)
         L     2,24(5)
         N     2,=F'128'
         ST    2,192(13)
         L     4,176(13)
         LTR   4,4
         BE    L170
         LTR   2,2
         BE    L170
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'887'
         B     L289
L170     EQU   *
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(LOOP@LAT)
         BALR  14,15
         ST    15,168(13)
         L     5,32(11)
         N     5,=F'1'
         ST    5,196(13)
         LTR   5,5
         BE    L171
         L     5,76(3)
         L     4,8(15)
         L     2,28(15)
         ST    2,204(13)
         L     2,200(13)
         L     3,4+200(13)
         M     2,76(4)
         ST    2,200(13)
         ST    3,4+200(13)
         L     6,204(13)
         A     6,=F'5000'
         SRDA  6,32
         L     3,=F'10000'
         DR    6,3
         LR    15,7
         LTR   5,5
         BNE   L172
         LA    5,1(0,0)
L172     EQU   *
         CR    5,15
         BNL   L173
         LR    5,7
L173     EQU   *
         LR    4,5
         SR    4,15
         L     6,20(11)
         LTR   6,6
         BE    L175
         L     2,8(6)
         L     7,28(6)
         ST    7,212(13)
         L     6,208(13)
         L     7,4+208(13)
         M     6,76(2)
         ST    6,208(13)
         ST    7,4+208(13)
         L     8,212(13)
         A     8,=F'5000'
         SRDA  8,32
         L     7,=F'10000'
         DR    8,7
         LR    4,9
L175     EQU   *
         LR    2,5
         SR    2,15
         CR    4,2
         BNH   L176
         LR    4,2
L176     EQU   *
         LR    3,15
         MH    3,=H'10000'
         LR    2,5
         SRL   2,31
         AR    2,5
         SRA   2,1
         AR    3,2
         ST    3,216(13)
         L     8,216(13)
         L     9,4+216(13)
         SRDA  8,32
         DR    8,5
         ST    8,216(13)
         ST    9,4+216(13)
         LR    6,9
         AR    4,15
         MH    4,=H'10000'
         AR    4,2
         ST    4,224(13)
         L     2,224(13)
         L     3,4+224(13)
         SRDA  2,32
         DR    2,5
         ST    2,224(13)
         ST    3,4+224(13)
         LR    7,3
         L     3,12(11)
         SLL   3,2
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,184(13)
         LA    4,1(0,0)
         CL    4,12(11)
         BH    L258
         LR    5,15
L182     EQU   *
         LR    2,4
         SRL   2,5
         SLL   2,2
         LR    3,4
         N     3,=F'31'
         L     8,16(11)
         L     2,12(8,2)
         SRL   2,0(3)
         N     2,=F'1'
         LR    3,7
         LTR   2,2
         BNE   L181
         LR    3,6
L181     EQU   *
         ST    3,0(5)
         A     4,=F'1'
         A     5,=F'4'
         CL    4,12(11)
         BNH   L182
L258     EQU   *
         L     9,176(13)
         LTR   9,9
         BE    L183
         L     3,16(11)
         L     2,12(3)
         N     2,=F'1'
         LR    5,7
         LTR   2,2
         BNE   L185
         LR    5,6
L185     EQU   *
         LR    3,5
         MVC   188(4,13),=F'10000'
         SLR   4,4
         CL    4,12(11)
         BNL   L260
         L     2,184(13)
L189     EQU   *
         L     6,188(13)
         AR    6,3
         ST    6,188(13)
         L     7,0(2)
         ST    7,236(13)
         L     8,232(13)
         L     9,4+232(13)
         MR    8,3
         ST    8,232(13)
         ST    9,4+232(13)
         A     9,=F'5000'
         ST    9,240(13)
         L     6,240(13)
         L     7,4+240(13)
         SRDA  6,32
         L     8,=F'10000'
         DR    6,8
         ST    6,240(13)
         ST    7,4+240(13)
         LR    3,7
         A     4,=F'1'
         A     2,=F'4'
         CL    4,12(11)
         BL    L189
L260     EQU   *
         L     2,188(13)
         SRL   2,31
         A     2,188(13)
         SRA   2,1
         A     2,=F'100000000'
         ST    2,248(13)
         L     2,248(13)
         L     3,4+248(13)
         SRDA  2,32
         D     2,188(13)
         ST    2,248(13)
         ST    3,4+248(13)
         ST    3,188(13)
         ST    5,260(13)
         L     4,256(13)
         L     5,4+256(13)
         MR    4,3
         ST    4,256(13)
         ST    5,4+256(13)
         A     5,=F'5000'
         ST    5,264(13)
         L     6,264(13)
         L     7,4+264(13)
         SRDA  6,32
         L     8,=F'10000'
         DR    6,8
         ST    6,264(13)
         ST    7,4+264(13)
         ST    7,180(13)
         B     L190
L183     EQU   *
         MVC   188(4,13),=F'10000'
         L     4,176(13)
         CL    4,12(11)
         BNL   L262
         L     2,184(13)
L194     EQU   *
         L     9,0(2)
         ST    9,276(13)
         L     8,272(13)
         L     9,4+272(13)
         M     8,188(13)
         ST    8,272(13)
         ST    9,4+272(13)
         A     9,=F'5000'
         ST    9,280(13)
         L     8,280(13)
         L     9,4+280(13)
         SRDA  8,32
         L     3,=F'10000'
         DR    8,3
         ST    8,280(13)
         ST    9,4+280(13)
         ST    9,188(13)
         A     4,=F'1'
         A     2,=F'4'
         CL    4,12(11)
         BL    L194
L262     EQU   *
         L     4,=F'10000'
         SR    4,6
         ST    4,180(13)
L190     EQU   *
         SLR   4,4
         CL    4,12(11)
         BNL   L264
         L     3,184(13)
L199     EQU   *
         L     2,0(3)
         L     5,=F'10000'
         CLR   2,5
         BNH   L197
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'940'
         B     L289
L197     EQU   *
         A     4,=F'1'
         A     3,=F'4'
         CL    4,12(11)
         BL    L199
L264     EQU   *
         L     7,188(13)
         L     6,=F'10000'
         CLR   7,6
         BH    L201
         L     8,180(13)
         LTR   8,8
         BL    L201
         CR    8,6
         BNH   L171
L201     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'943'
L289     EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L171     EQU   *
         L     9,4(11)
         L     2,8(9)
         L     9,60(2)
         MVC   144(4,13),=F'0'
         L     3,0(11)
         L     2,164(3)
L284     EQU   *
         LTR   2,2
         BE    L266
         L     4,144(13)
         A     4,=F'1'
         ST    4,144(13)
         L     2,168(2)
         B     L284
L266     EQU   *
         MVC   88(4,13),144(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,140(13)
         L     5,0(11)
         L     2,164(5)
         LTR   2,2
         BE    L268
         LR    3,15
L209     EQU   *
         ST    2,0(3)
         L     2,168(2)
         A     3,=F'4'
         LTR   2,2
         BNE   L209
L268     EQU   *
         L     6,0(11)
         ST    9,172(6)
         L     7,124(6)
         LR    8,7
         SLL   8,2
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,160(13)
         L     2,176(13)
         LTR   2,2
         BE    L210
         LR    4,15
         LR    5,8
         L     2,156(13)
         LR    3,8
         MVCL  4,2
         MVC   164(4,13),148(13)
L210     EQU   *
         L     3,20(11)
         LTR   3,3
         BE    L211
         L     4,16(11)
         L     2,12(4)
         N     2,=F'1'
         LTR   2,2
         BE    L211
         L     5,28(11)
         L     2,0(5)
         SLL   2,2
         L     6,24(11)
         ST    3,0(2,6)
         L     2,0(5)
         A     2,=F'1'
         ST    2,0(5)
L211     EQU   *
         MVC   124(4,13),20(11)
         MVC   120(4,13),168(13)
         MVC   172(4,13),=F'0'
         SLR   3,3
         CL    3,12(11)
         L     14,=A(L270)
         BNLR  14
L245     EQU   *
         L     12,0(,10)
         SLR   3,3
L285     EQU   *
         C     3,144(13)
         BNL   L272
         MVC   88(4,13),8(11)
         LR    2,3
         SLL   2,2
         L     4,140(13)
         L     4,0(2,4)
         ST    4,92(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         MVC   88(4,13),8(11)
         L     5,140(13)
         L     2,0(2,5)
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         A     3,=F'1'
         B     L285
L272     EQU   *
         MVC   88(4,13),156(13)
         ST    7,92(13)
         MVC   96(4,13),152(13)
         LR    6,13
         A     6,=F'120'
         ST    6,100(13)
         MVC   104(4,13),=F'2'
         LR    2,13
         A     2,=F'128'
         ST    2,108(13)
         MVC   112(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(COPY@BBS)
         BALR  14,15
         L     3,192(13)
         LTR   3,3
         BE    L220
         SLR   4,4
         CLR   4,7
         BNL   L274
         L     3,152(13)
L224     EQU   *
         L     2,0(3)
         L     2,84(2)
         MVC   20(4,2),=F'1'
         A     4,=F'1'
         A     3,=F'4'
         CLR   4,7
         BL    L224
L274     EQU   *
         SLR   4,4
         CLR   4,7
         BNL   L276
         L     6,152(13)
L235     EQU   *
         L     3,0(6)
         L     2,60(3)
         CLR   2,9
         BNE   L228
         OC    80(4,3),=F'16'
L228     EQU   *
         L     3,20(3)
L286     EQU   *
         LTR   3,3
         BE    L278
         L     5,12(3)
         L     2,84(5)
         L     2,20(2)
         LTR   2,2
         BE    L231
         L     2,8(3)
         L     2,60(2)
         CLR   2,9
         BE    L233
         L     2,60(5)
         CLR   2,9
         BNE   L231
L233     EQU   *
         OC    24(4,3),=F'128'
L231     EQU   *
         L     3,4(3)
         B     L286
L278     EQU   *
         A     4,=F'1'
         A     6,=F'4'
         CLR   4,7
         BL    L235
L276     EQU   *
         SLR   4,4
         CLR   4,7
         BNL   L220
         L     3,152(13)
L239     EQU   *
         L     2,0(3)
         L     2,84(2)
         MVC   20(4,2),=F'0'
         A     4,=F'1'
         A     3,=F'4'
         CLR   4,7
         BL    L239
L220     EQU   *
         L     3,=V(CFG@HOOK)
         L     4,176(13)
         LTR   4,4
         BE    L240
         L     2,0(3)
         MVC   88(4,13),168(13)
         L     5,152(13)
         MVC   92(4,13),0(5)
         L     2,16(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     2,0(3)
         MVC   88(4,13),128(13)
         L     6,0(11)
         MVC   92(4,13),4(6)
         L     2,16(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),0(5)
         MVC   96(4,13),148(13)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
         L     2,4(5)
         ST    2,8(6)
         ST    2,148(13)
         MVC   4(4,11),128(13)
         MVC   168(4,13),4(11)
         B     L241
L240     EQU   *
         L     2,0(3)
         MVC   88(4,13),128(13)
         L     4,0(11)
         MVC   92(4,13),4(4)
         L     2,16(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     2,0(3)
         MVC   88(4,13),4(11)
         L     5,152(13)
         MVC   92(4,13),0(5)
         L     2,16(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         MVC   88(4,13),176(13)
         MVC   92(4,13),0(5)
         L     6,4(11)
         MVC   96(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
         MVC   4(4,11),128(13)
L241     EQU   *
         L     2,20(11)
         LTR   2,2
         BE    L242
         L     3,172(13)
         A     3,=F'1'
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     4,16(11)
         L     2,12(4,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L242
         L     5,28(11)
         L     2,0(5)
         SLL   2,2
         L     3,132(13)
         L     6,24(11)
         ST    3,0(2,6)
         L     4,0(5)
         A     4,=F'1'
         ST    4,0(5)
L242     EQU   *
         L     5,164(13)
         LTR   5,5
         BNE   L243
         L     4,160(13)
         LR    5,8
         L     2,152(13)
         LR    3,8
         MVCL  4,2
         L     6,152(13)
         MVC   164(4,13),4(6)
L243     EQU   *
         L     2,196(13)
         LTR   2,2
         BE    L214
         MVC   88(4,13),152(13)
         ST    7,92(13)
         MVC   96(4,13),180(13)
         MVC   100(4,13),=F'10000'
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         L     2,172(13)
         SLL   2,2
         L     3,184(13)
         L     2,0(2,3)
         ST    2,292(13)
         L     4,288(13)
         L     5,4+288(13)
         M     4,180(13)
         ST    4,288(13)
         ST    5,4+288(13)
         A     5,=F'5000'
         ST    5,296(13)
         L     2,296(13)
         L     3,4+296(13)
         SRDA  2,32
         L     4,=F'10000'
         DR    2,4
         ST    2,296(13)
         ST    3,4+296(13)
         ST    3,180(13)
L214     EQU   *
         L     5,172(13)
         A     5,=F'1'
         ST    5,172(13)
         CL    5,12(11)
         BL    L245
L270     EQU   *
         MVC   88(4,13),152(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),140(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     6,176(13)
         LTR   6,6
         BNE   L246
         ST    6,88(13)
         L     8,4(11)
         MVC   92(4,13),12(8)
         MVC   96(4,13),8(8)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
L246     EQU   *
         NC    32(4,11),=F'1'
         L     9,32(11)
         LTR   9,9
         BE    L247
         MVC   88(4,13),156(13)
         ST    7,92(13)
         MVC   96(4,13),188(13)
         MVC   100(4,13),=F'10000'
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         MVC   88(4,13),184(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L247     EQU   *
         SLR   4,4
L287     EQU   *
         CLR   4,7
         BNL   L281
         LR    8,4
         SLL   8,2
         L     3,156(13)
         L     2,0(8,3)
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         LR    5,13
         A     5,=F'136'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(GET@DOMI)
         BALR  14,15
         LR    6,15
         SLR   5,5
L288     EQU   *
         CR    5,6
         BNL   L283
         LR    2,5
         SLL   2,2
         L     3,136(13)
         L     2,0(2,3)
         MVC   88(4,13),0(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(FLOW@BB@)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L253
         MVC   88(4,13),=F'0'
         L     9,160(13)
         L     9,0(8,9)
         ST    9,92(13)
         MVC   96(4,13),164(13)
         LA    1,88(,13)
         L     15,=V(NEAREST@)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
L253     EQU   *
         A     5,=F'1'
         B     L288
L283     EQU   *
         MVC   88(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         A     4,=F'1'
         B     L287
L281     EQU   *
         MVC   88(4,13),160(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),156(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LA    15,1(0,0)
L162     EQU   *
* Function ZZZ_497 epilogue
         PDPEPIL
* Function ZZZ_497 literal pool
         DS    0F
         LTORG
* Function ZZZ_497 page table
         DS    0F
PGT15    EQU   *
         DC    A(PG15)
LC2      EQU   *
         DC    C'Created preheader block for loop %i'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func create_preheaders prologue
CREATE@P PDPPRLG CINDEX=16,FRAME=128,BASER=12,ENTRY=YES
         B     FEN16
         LTORG
FEN16    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG16     EQU   *
         LR    11,1
         L     10,=A(PGT16)
* Function create_preheaders code
         SLR   2,2
         SLR   3,3
         ST    2,112(13)
         ST    3,4+112(13)
         ST    2,120(13)
         ST    3,4+120(13)
         MVC   104(4,13),=F'1'
         LA    5,1(0,0)
         L     3,0(11)
         CL    5,0(3)
         BNL   L326
L324     EQU   *
         L     6,0(11)
         L     3,12(6)
         L     2,104(13)
         SLL   2,2
         L     4,0(2,3)
         SLR   7,7
         LR    5,7
         MVC   108(4,13),160(4)
         L     15,4(4)
         L     3,16(15)
         LTR   3,3
         BE    L334
L298     EQU   *
         L     2,8(3)
         L     6,8(4)
         CLR   2,6
         BE    L296
         A     5,=F'1'
L296     EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   L298
         LTR   5,5
         BNE   L299
L334     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1103'
         B     L337
L299     EQU   *
         LA    8,1(0,0)
         CLR   5,8
         BNE   L300
         L     3,16(15)
         L     2,8(3)
         LR    5,6
L335     EQU   *
         CLR   2,5
         BNE   L330
         L     3,0(3)
         L     2,8(3)
         B     L335
L330     EQU   *
         L     2,4(11)
         N     2,=F'1'
         LTR   2,2
         BE    L293
         L     2,8(3)
         L     2,20(2)
         L     2,4(2)
         LTR   2,2
         BE    L293
L300     EQU   *
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(FIRST@IN)
         BALR  14,15
         LTR   15,15
         BE    L308
         L     3,8(15)
         B     L309
L308     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LR    3,15
L309     EQU   *
         L     2,4(4)
         CL    3,4(2)
         BNE   L310
         MVC   88(4,13),=F'-99'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@570)
         BALR  14,15
L310     EQU   *
         L     9,=V(CFG@HOOK)
         L     2,0(9)
         MVC   88(4,13),4(4)
         ST    3,92(13)
         L     2,24(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    6,15
         L     5,8(15)
         MVC   4(4,4),12(15)
         LR    3,4
         LTR   4,4
         BE    L332
L315     EQU   *
         L     2,8(3)
         CLR   2,5
         BNE   L313
         MVC   8(4,3),12(6)
L313     EQU   *
         L     3,160(3)
         LTR   3,3
         BNE   L315
L332     EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),12(6)
         LA    1,88(,13)
         L     15,=V(ADD@TO@D)
         BALR  14,15
         L     3,16(5)
L336     EQU   *
         LTR   3,3
         BE    L317
         L     7,8(3)
         CL    7,8(4)
         BE    L317
         L     3,0(3)
         B     L336
L317     EQU   *
         LTR   3,3
         BNE   L321
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1142'
L337     EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L321     EQU   *
         L     2,8(3)
         L     15,28(3)
         ST    15,116(13)
         L     8,112(13)
         L     9,4+112(13)
         M     8,76(2)
         ST    8,112(13)
         ST    9,4+112(13)
         A     9,=F'5000'
         ST    9,120(13)
         L     8,120(13)
         L     9,4+120(13)
         SRDA  8,32
         L     15,=F'10000'
         DR    8,15
         ST    8,120(13)
         ST    9,4+120(13)
         L     2,76(5)
         SR    2,9
         ST    2,76(5)
         L     8,72(5)
         S     8,32(3)
         ST    8,72(5)
         L     9,32(6)
         S     9,32(3)
         ST    9,32(6)
         L     15,=V(CFG@HOOK)
         L     2,0(15)
         ST    3,88(13)
         MVC   92(4,13),4(4)
         L     2,16(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    L322
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ADD@TO@D)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ADD@BB@T)
         BALR  14,15
         ST    2,8(4)
L322     EQU   *
         MVC   88(4,13),=F'0'
         ST    5,92(13)
         MVC   96(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1766)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),4(4)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
         L     2,4(4)
         ST    4,60(2)
         ST    5,88(13)
         MVC   92(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(ADD@BB@T)
         BALR  14,15
         L     2,=V(ZZZ@1844)
         L     2,0(2)
         LTR   2,2
         BE    L293
         ST    2,88(13)
         MVC   92(4,13),=A(LC2)
         MVC   96(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L293     EQU   *
         L     2,104(13)
         A     2,=F'1'
         ST    2,104(13)
         L     3,0(11)
         CL    2,0(3)
         BL    L324
L326     EQU   *
         L     5,0(11)
         OC    32(4,5),=F'1'
* Function create_preheaders epilogue
         PDPEPIL
* Function create_preheaders literal pool
         DS    0F
         LTORG
* Function create_preheaders page table
         DS    0F
PGT16    EQU   *
         DC    A(PG16)
         DS    0F
* X-func loop_split_edge_with prologue
LOOP@SPL PDPPRLG CINDEX=17,FRAME=104,BASER=12,ENTRY=YES
         B     FEN17
         LTORG
FEN17    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG17     EQU   *
         LR    11,1
         L     10,=A(PGT17)
* Function loop_split_edge_with code
         L     6,0(11)
         L     8,4(11)
         L     7,8(6)
         L     5,12(6)
         MVC   88(4,13),60(7)
         MVC   92(4,13),60(5)
         LA    1,88(,13)
         L     15,=V(FIND@COM)
         BALR  14,15
         LR    3,15
         L     2,=V(CFG@HOOK)
         L     2,0(2)
         ST    6,88(13)
         L     2,36(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ADD@TO@D)
         BALR  14,15
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ADD@BB@T)
         BALR  14,15
         LA    15,32(0,0)
         LTR   8,8
         BNE   L340
         LR    15,8
L340     EQU   *
         ST    15,80(4)
         L     3,20(4)
         L     2,24(6)
         N     2,=F'128'
         LTR   2,2
         BE    L341
         O     15,=F'16'
         ST    15,80(4)
         OC    24(4,3),=F'128'
L341     EQU   *
         LTR   8,8
         BE    L342
         ST    8,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@546)
         BALR  14,15
L342     EQU   *
         MVC   88(4,13),=F'0'
         ST    4,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RECOUNT@)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    5,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SET@IMME)
         BALR  14,15
         L     3,60(5)
         L     2,8(3)
         CLR   2,7
         BNE   L343
         ST    4,8(3)
L343     EQU   *
         LR    15,4
* Function loop_split_edge_with epilogue
         PDPEPIL
* Function loop_split_edge_with literal pool
         DS    0F
         LTORG
* Function loop_split_edge_with page table
         DS    0F
PGT17    EQU   *
         DC    A(PG17)
         DS    0F
* X-func force_single_succ_latches prologue
FORCE@SI PDPPRLG CINDEX=18,FRAME=96,BASER=12,ENTRY=YES
         B     FEN18
         LTORG
FEN18    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG18     EQU   *
         LR    11,1
         L     10,=A(PGT18)
* Function force_single_succ_latches code
         L     5,0(11)
         LA    4,1(0,0)
L358     EQU   *
         CL    4,0(5)
         BNL   L355
         L     2,12(5)
         LR    3,4
         SLL   3,2
         L     2,0(3,2)
         L     15,8(2)
         L     3,4(2)
         CLR   15,3
         BE    L348
         L     2,20(15)
         L     2,4(2)
         LTR   2,2
         BE    L347
L348     EQU   *
         L     3,16(3)
L359     EQU   *
         L     2,8(3)
         CLR   2,15
         BE    L357
         L     3,0(3)
         B     L359
L357     EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(LOOP@SPL)
         BALR  14,15
L347     EQU   *
         A     4,=F'1'
         B     L358
L355     EQU   *
         OC    32(4,5),=F'2'
* Function force_single_succ_latches epilogue
         PDPEPIL
* Function force_single_succ_latches literal pool
         DS    0F
         LTORG
* Function force_single_succ_latches page table
         DS    0F
PGT18    EQU   *
         DC    A(PG18)
         DS    0F
* X-func remove_path prologue
REMOVE@P PDPPRLG CINDEX=19,FRAME=176,BASER=12,ENTRY=YES
         B     FEN19
         LTORG
FEN19    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG19     EQU   *
         LR    11,1
         L     10,=A(PGT19)
* Function remove_path code
         L     8,4(11)
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         SLR   2,2
         CLM   15,1,=XL1'00'
         L     14,=A(L360)
         BER   14
         L     2,12(8)
         L     2,16(2)
         L     2,0(2)
         LTR   2,2
         BE    L363
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(LOOP@SPL)
         BALR  14,15
         L     8,16(15)
         B     L363
L365     EQU   *
         MVC   88(4,13),0(11)
         L     2,8(8)
         MVC   92(4,13),60(2)
         LA    1,88(,13)
         L     15,=A(UNLOOP)
         BALR  14,15
L363     EQU   *
         L     2,8(8)
         L     2,60(2)
         L     2,160(2)
         LTR   2,2
         BE    L364
         MVC   88(4,13),=F'0'
         L     2,8(8)
         L     2,60(2)
         MVC   92(4,13),8(2)
         MVC   96(4,13),12(8)
         LA    1,88(,13)
         L     15,=V(DOMINATE)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L365
L364     EQU   *
         L     2,12(8)
         L     2,16(2)
         L     2,0(2)
         LTR   2,2
         BE    L366
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'106'
         B     L469
L366     EQU   *
         L     3,=V(N@BASIC@)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,140(13)
         MVC   88(4,13),12(8)
         ST    2,92(13)
         MVC   96(4,13),=A(@@F1)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         MVC   108(4,13),12(8)
         LA    1,88(,13)
         L     15,=V(DFS@ENUM)
         BALR  14,15
         LR    9,15
         ST    2,132(13)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,116(13)
         L     5,=V(LAST@BAS)
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         ST    15,136(13)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         MVC   128(4,13),132(13)
         CR    2,9
         BNL   L440
         L     5,140(13)
L371     EQU   *
         L     2,0(5)
         L     3,44(2)
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         L     3,136(13)
         O     2,12(3,4)
         ST    2,12(3,4)
         L     2,128(13)
         A     2,=F'1'
         ST    2,128(13)
         A     5,=F'4'
         CR    2,9
         BL    L371
L440     EQU   *
         MVC   128(4,13),=F'0'
         SLR   3,3
         CR    3,9
         BNL   L442
         MVC   168(4,13),140(13)
L380     EQU   *
         L     5,168(13)
         L     15,0(5)
         L     15,20(15)
         LTR   15,15
         BE    L444
         L     5,132(13)
         SLL   5,2
         A     5,116(13)
L379     EQU   *
         L     4,12(15)
         L     2,=V(ENTRY@EX)
         LA    2,88(0,2)
         CLR   4,2
         BE    L377
         L     2,44(4)
         LR    3,2
         SRL   3,5
         SLL   3,2
         A     3,136(13)
         A     3,=F'12'
         LR    6,2
         N     6,=F'31'
         L     7,0(3)
         LR    2,7
         SRL   2,0(6)
         N     2,=F'1'
         LTR   2,2
         BNE   L377
         LA    2,1(0,0)
         SLL   2,0(6)
         OR    7,2
         ST    7,0(3)
         ST    4,0(5)
         L     3,132(13)
         A     3,=F'1'
         ST    3,132(13)
         A     5,=F'4'
L377     EQU   *
         L     15,4(15)
         LTR   15,15
         BNE   L379
L444     EQU   *
         L     5,128(13)
         A     5,=F'1'
         ST    5,128(13)
         L     2,168(13)
         A     2,=F'4'
         ST    2,168(13)
         CR    5,9
         BL    L380
L442     EQU   *
         MVC   124(4,13),8(8)
         ST    8,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L381
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'375'
L469     EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L381     EQU   *
         L     3,=V(N@BASIC@)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,120(13)
         MVC   128(4,13),=F'0'
         SLR   5,5
         CR    5,9
         BNL   L446
         L     4,140(13)
L386     EQU   *
         L     3,0(4)
         L     2,60(3)
         L     2,4(2)
         CLR   2,3
         BNE   L384
         MVC   88(4,13),0(11)
         MVC   92(4,13),60(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@111)
         BALR  14,15
L384     EQU   *
         L     2,128(13)
         A     2,=F'1'
         ST    2,128(13)
         A     4,=F'4'
         CR    2,9
         BL    L386
L446     EQU   *
         SLR   4,4
L465     EQU   *
         CR    4,9
         BNL   L448
         LR    3,4
         SLL   3,2
         L     5,140(13)
         L     5,0(3,5)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(REMOVE@B)
         BALR  14,15
         MVC   88(4,13),=F'0'
         L     2,140(13)
         L     2,0(3,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@450)
         BALR  14,15
         L     2,=V(CFG@HOOK)
         L     2,0(2)
         L     5,140(13)
         L     3,0(3,5)
         ST    3,88(13)
         L     2,20(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         A     4,=F'1'
         B     L465
L448     EQU   *
         MVC   88(4,13),140(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         SLR   8,8
         MVC   88(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         ST    8,128(13)
         C     8,132(13)
         BNL   L450
         L     7,116(13)
L401     EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),0(7)
         LA    1,88(,13)
         L     15,=V(GET@IMME)
         BALR  14,15
         L     2,44(15)
         LR    3,2
         SRL   3,5
         SLL   3,2
         A     3,136(13)
         A     3,=F'12'
         LR    5,2
         N     5,=F'31'
         L     6,0(3)
         LR    4,6
         SRL   4,0(5)
         N     4,=F'1'
         LTR   4,4
         BNE   L394
         LA    2,1(0,0)
         SLL   2,0(5)
         OR    6,2
         ST    6,0(3)
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(FIRST@DO)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    L394
         LR    3,8
         SLL   3,2
         A     3,120(13)
L400     EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),124(13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(DOMINATE)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L398
         ST    2,0(3)
         A     8,=F'1'
         A     3,=F'4'
L398     EQU   *
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(NEXT@DOM)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   L400
L394     EQU   *
         L     2,128(13)
         A     2,=F'1'
         ST    2,128(13)
         A     7,=F'4'
         C     2,132(13)
         BL    L401
L450     EQU   *
         MVC   88(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),120(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(ITERATE@)
         BALR  14,15
         MVC   88(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   128(4,13),=F'0'
         SLR   3,3
L466     EQU   *
         L     12,0(,10)
         C     3,132(13)
         L     14,=A(L453)
         BNLR  14
         L     2,128(13)
         SLL   2,2
         L     5,116(13)
         L     2,0(2,5)
         ST    2,144(13)
         L     2,80(2)
         N     2,=F'16'
         LTR   2,2
         BE    L404
         L     5,=V(LAST@BAS)
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         LR    8,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         L     2,144(13)
         L     3,44(2)
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         O     2,12(8,4)
         ST    2,12(8,4)
         L     3,144(13)
         L     2,60(3)
         L     2,124(2)
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,148(13)
         MVC   0(4,15),144(13)
         MVC   152(4,13),=F'1'
         MVC   164(4,13),=F'4'
L432     EQU   *
         L     5,152(13)
         BCTR  5,0
         ST    5,152(13)
         L     2,164(13)
         A     2,=F'-4'
         ST    2,164(13)
         L     3,148(13)
         L     5,0(3,2)
         L     2,44(5)
         LR    4,2
         SRL   4,5
         SLL   4,2
         N     2,=F'31'
         LA    3,1(0,0)
         SLL   3,0(2)
         X     3,=F'-1'
         N     3,12(8,4)
         ST    3,12(8,4)
         L     3,16(5)
L467     EQU   *
         LTR   3,3
         BE    L410
         L     2,24(3)
         N     2,=F'128'
         LTR   2,2
         BNE   L410
         L     3,0(3)
         B     L467
L410     EQU   *
         LTR   3,3
         BNE   L407
         NC    80(4,5),=F'-17'
         L     4,60(5)
         L     2,4(4)
         CLR   2,5
         BNE   L415
         ST    4,88(13)
         LR    5,13
         A     5,=F'112'
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1038)
         BALR  14,15
         ST    15,156(13)
         B     L416
L415     EQU   *
         ST    3,112(13)
         L     3,20(5)
         LTR   3,3
         BE    L458
         SLR   2,2
L420     EQU   *
         A     2,=F'1'
         L     3,4(3)
         LTR   3,3
         BNE   L420
         ST    2,112(13)
L458     EQU   *
         L     2,112(13)
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,156(13)
         MVC   112(4,13),=F'0'
         L     3,20(5)
         LTR   3,3
         BE    L416
         SLR   4,4
         LR    2,15
L424     EQU   *
         ST    3,0(2)
         A     4,=F'1'
         A     2,=F'4'
         L     3,4(3)
         LTR   3,3
         BNE   L424
         ST    4,112(13)
L416     EQU   *
         MVC   160(4,13),=F'0'
         SLR   3,3
         CL    3,112(13)
         BNL   L461
         L     7,156(13)
         L     6,152(13)
         SLL   6,2
         A     6,148(13)
L431     EQU   *
         L     3,0(7)
         L     2,24(3)
         N     2,=F'128'
         LTR   2,2
         BE    L427
         L     5,144(13)
         MVC   88(4,13),60(5)
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(FLOW@BB@)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L427
         NC    24(4,3),=F'-129'
         L     9,12(3)
         L     2,44(9)
         LR    3,2
         SRL   3,5
         SLL   3,2
         AR    3,8
         A     3,=F'12'
         LR    4,2
         N     4,=F'31'
         L     5,0(3)
         LR    2,5
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BNE   L427
         LA    2,1(0,0)
         SLL   2,0(4)
         OR    5,2
         ST    5,0(3)
         ST    9,0(6)
         L     2,152(13)
         A     2,=F'1'
         ST    2,152(13)
         L     3,164(13)
         A     3,=F'4'
         ST    3,164(13)
         A     6,=F'4'
L427     EQU   *
         L     5,160(13)
         A     5,=F'1'
         ST    5,160(13)
         A     7,=F'4'
         CL    5,112(13)
         BL    L431
L461     EQU   *
         MVC   88(4,13),156(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L407     EQU   *
         L     2,152(13)
         LTR   2,2
         BNE   L432
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),148(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L404     EQU   *
         L     3,128(13)
         A     3,=F'1'
         ST    3,128(13)
         B     L466
L453     EQU   *
         MVC   88(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         L     5,124(13)
         L     3,60(5)
L468     EQU   *
         L     2,160(3)
         LTR   2,2
         BE    L435
         L     2,160(3)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(FIX@LOOP)
         BALR  14,15
         LTR   15,15
         BE    L435
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(LOOP@PRE)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),8(15)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         LR    3,2
         B     L468
L435     EQU   *
         LA    2,1(0,0)
L360     EQU   *
         LR    15,2
* Function remove_path epilogue
         PDPEPIL
* Function remove_path literal pool
         DS    0F
         LTORG
* Function remove_path page table
         DS    0F
PGT19    EQU   *
         DC    A(PG19)
         END
