         COPY  PDPTOP
         CSECT
* Program text area
LC0      EQU   *
         DC    C'none'
         DC    X'0'
LC1      EQU   *
         DC    C'Demangling disabled'
         DC    X'0'
LC2      EQU   *
         DC    C'auto'
         DC    X'0'
LC3      EQU   *
         DC    C'Automatic selection based on executable'
         DC    X'0'
LC4      EQU   *
         DC    C'gnu'
         DC    X'0'
LC5      EQU   *
         DC    C'GNU (g++) style demangling'
         DC    X'0'
LC6      EQU   *
         DC    C'lucid'
         DC    X'0'
LC7      EQU   *
         DC    C'Lucid (lcc) style demangling'
         DC    X'0'
LC8      EQU   *
         DC    C'arm'
         DC    X'0'
LC9      EQU   *
         DC    C'ARM style demangling'
         DC    X'0'
LC10     EQU   *
         DC    C'hp'
         DC    X'0'
LC11     EQU   *
         DC    C'HP (aCC) style demangling'
         DC    X'0'
LC12     EQU   *
         DC    C'edg'
         DC    X'0'
LC13     EQU   *
         DC    C'EDG style demangling'
         DC    X'0'
LC14     EQU   *
         DC    C'gnu-v3'
         DC    X'0'
LC15     EQU   *
         DC    C'GNU (g++) V3 ABI-style demangling'
         DC    X'0'
LC16     EQU   *
         DC    C'java'
         DC    X'0'
LC17     EQU   *
         DC    C'Java style demangling'
         DC    X'0'
LC18     EQU   *
         DC    C'gnat'
         DC    X'0'
LC19     EQU   *
         DC    C'GNAT style demangling'
         DC    X'0'
* X-var ZZZ_1534
         ENTRY ZZZ@1534
         DS    0F
ZZZ@1534 EQU   *
         DC    A(LC0)
         DC    F'-1'
         DC    A(LC1)
         DC    A(LC2)
         DC    F'256'
         DC    A(LC3)
         DC    A(LC4)
         DC    F'512'
         DC    A(LC5)
         DC    A(LC6)
         DC    F'1024'
         DC    A(LC7)
         DC    A(LC8)
         DC    F'2048'
         DC    A(LC9)
         DC    A(LC10)
         DC    F'4096'
         DC    A(LC11)
         DC    A(LC12)
         DC    F'8192'
         DC    A(LC13)
         DC    A(LC14)
         DC    F'16384'
         DC    A(LC15)
         DC    A(LC16)
         DC    F'4'
         DC    A(LC17)
         DC    A(LC18)
         DC    F'32768'
         DC    A(LC19)
         DC    F'0'
         DC    F'0'
         DC    F'0'
* X-var ZZZ_288
         ENTRY ZZZ@288
* Program data area
         DS    0F
ZZZ@288  EQU   *
         DC    F'256'
@@V1     EQU   *
         DC    X'5B'
         DC    X'4B'
         DC    X'5B'
         DC    X'00'
* Program text area
LC20     EQU   *
         DC    C'nw'
         DC    X'0'
LC21     EQU   *
         DC    C' new'
         DC    X'0'
LC22     EQU   *
         DC    C'dl'
         DC    X'0'
LC23     EQU   *
         DC    C' delete'
         DC    X'0'
LC24     EQU   *
         DC    C'new'
         DC    X'0'
LC25     EQU   *
         DC    C'delete'
         DC    X'0'
LC26     EQU   *
         DC    C'vn'
         DC    X'0'
LC27     EQU   *
         DC    C' new Ý¨'
         DC    X'0'
LC28     EQU   *
         DC    C'vd'
         DC    X'0'
LC29     EQU   *
         DC    C' delete Ý¨'
         DC    X'0'
LC30     EQU   *
         DC    C'as'
         DC    X'0'
LC31     EQU   *
         DC    C'='
         DC    X'0'
LC32     EQU   *
         DC    C'ne'
         DC    X'0'
LC33     EQU   *
         DC    C'!='
         DC    X'0'
LC34     EQU   *
         DC    C'eq'
         DC    X'0'
LC35     EQU   *
         DC    C'=='
         DC    X'0'
LC36     EQU   *
         DC    C'ge'
         DC    X'0'
LC37     EQU   *
         DC    C'>='
         DC    X'0'
LC38     EQU   *
         DC    C'gt'
         DC    X'0'
LC39     EQU   *
         DC    C'>'
         DC    X'0'
LC40     EQU   *
         DC    C'le'
         DC    X'0'
LC41     EQU   *
         DC    C'<='
         DC    X'0'
LC42     EQU   *
         DC    C'lt'
         DC    X'0'
LC43     EQU   *
         DC    C'<'
         DC    X'0'
LC44     EQU   *
         DC    C'plus'
         DC    X'0'
LC45     EQU   *
         DC    C'+'
         DC    X'0'
LC46     EQU   *
         DC    C'pl'
         DC    X'0'
LC47     EQU   *
         DC    C'apl'
         DC    X'0'
LC48     EQU   *
         DC    C'+='
         DC    X'0'
LC49     EQU   *
         DC    C'minus'
         DC    X'0'
LC50     EQU   *
         DC    C'-'
         DC    X'0'
LC51     EQU   *
         DC    C'mi'
         DC    X'0'
LC52     EQU   *
         DC    C'ami'
         DC    X'0'
LC53     EQU   *
         DC    C'-='
         DC    X'0'
LC54     EQU   *
         DC    C'mult'
         DC    X'0'
LC55     EQU   *
         DC    C'*'
         DC    X'0'
LC56     EQU   *
         DC    C'ml'
         DC    X'0'
LC57     EQU   *
         DC    C'amu'
         DC    X'0'
LC58     EQU   *
         DC    C'*='
         DC    X'0'
LC59     EQU   *
         DC    C'aml'
         DC    X'0'
LC60     EQU   *
         DC    C'convert'
         DC    X'0'
LC61     EQU   *
         DC    C'negate'
         DC    X'0'
LC62     EQU   *
         DC    C'trunc_mod'
         DC    X'0'
LC63     EQU   *
         DC    C'%'
         DC    X'0'
LC64     EQU   *
         DC    C'md'
         DC    X'0'
LC65     EQU   *
         DC    C'amd'
         DC    X'0'
LC66     EQU   *
         DC    C'%='
         DC    X'0'
LC67     EQU   *
         DC    C'trunc_div'
         DC    X'0'
LC68     EQU   *
         DC    C'/'
         DC    X'0'
LC69     EQU   *
         DC    C'dv'
         DC    X'0'
LC70     EQU   *
         DC    C'adv'
         DC    X'0'
LC71     EQU   *
         DC    C'/='
         DC    X'0'
LC72     EQU   *
         DC    C'truth_andif'
         DC    X'0'
LC73     EQU   *
         DC    X'50'
         DC    X'50'
         DC    X'0'
LC74     EQU   *
         DC    C'aa'
         DC    X'0'
LC75     EQU   *
         DC    C'truth_orif'
         DC    X'0'
LC76     EQU   *
         DC    C'||'
         DC    X'0'
LC77     EQU   *
         DC    C'oo'
         DC    X'0'
LC78     EQU   *
         DC    C'truth_not'
         DC    X'0'
LC79     EQU   *
         DC    C'!'
         DC    X'0'
LC80     EQU   *
         DC    C'nt'
         DC    X'0'
LC81     EQU   *
         DC    C'postincrement'
         DC    X'0'
LC82     EQU   *
         DC    C'++'
         DC    X'0'
LC83     EQU   *
         DC    C'pp'
         DC    X'0'
LC84     EQU   *
         DC    C'postdecrement'
         DC    X'0'
LC85     EQU   *
         DC    C'--'
         DC    X'0'
LC86     EQU   *
         DC    C'mm'
         DC    X'0'
LC87     EQU   *
         DC    C'bit_ior'
         DC    X'0'
LC88     EQU   *
         DC    C'|'
         DC    X'0'
LC89     EQU   *
         DC    C'or'
         DC    X'0'
LC90     EQU   *
         DC    C'aor'
         DC    X'0'
LC91     EQU   *
         DC    C'|='
         DC    X'0'
LC92     EQU   *
         DC    C'bit_xor'
         DC    X'0'
LC93     EQU   *
         DC    C'¬'
         DC    X'0'
LC94     EQU   *
         DC    C'er'
         DC    X'0'
LC95     EQU   *
         DC    C'aer'
         DC    X'0'
LC96     EQU   *
         DC    C'¬='
         DC    X'0'
LC97     EQU   *
         DC    C'bit_and'
         DC    X'0'
LC98     EQU   *
         DC    X'50'
         DC    X'0'
LC99     EQU   *
         DC    C'ad'
         DC    X'0'
LC100    EQU   *
         DC    C'aad'
         DC    X'0'
LC101    EQU   *
         DC    X'50'
         DC    C'='
         DC    X'0'
LC102    EQU   *
         DC    C'bit_not'
         DC    X'0'
LC103    EQU   *
         DC    C'~'
         DC    X'0'
LC104    EQU   *
         DC    C'co'
         DC    X'0'
LC105    EQU   *
         DC    C'call'
         DC    X'0'
LC106    EQU   *
         DC    C'()'
         DC    X'0'
LC107    EQU   *
         DC    C'cl'
         DC    X'0'
LC108    EQU   *
         DC    C'alshift'
         DC    X'0'
LC109    EQU   *
         DC    C'<<'
         DC    X'0'
LC110    EQU   *
         DC    C'ls'
         DC    X'0'
LC111    EQU   *
         DC    C'als'
         DC    X'0'
LC112    EQU   *
         DC    C'<<='
         DC    X'0'
LC113    EQU   *
         DC    C'arshift'
         DC    X'0'
LC114    EQU   *
         DC    C'>>'
         DC    X'0'
LC115    EQU   *
         DC    C'rs'
         DC    X'0'
LC116    EQU   *
         DC    C'ars'
         DC    X'0'
LC117    EQU   *
         DC    C'>>='
         DC    X'0'
LC118    EQU   *
         DC    C'component'
         DC    X'0'
LC119    EQU   *
         DC    C'->'
         DC    X'0'
LC120    EQU   *
         DC    C'pt'
         DC    X'0'
LC121    EQU   *
         DC    C'rf'
         DC    X'0'
LC122    EQU   *
         DC    C'indirect'
         DC    X'0'
LC123    EQU   *
         DC    C'method_call'
         DC    X'0'
LC124    EQU   *
         DC    C'->()'
         DC    X'0'
LC125    EQU   *
         DC    C'addr'
         DC    X'0'
LC126    EQU   *
         DC    C'array'
         DC    X'0'
LC127    EQU   *
         DC    C'Ý¨'
         DC    X'0'
LC128    EQU   *
         DC    C'vc'
         DC    X'0'
LC129    EQU   *
         DC    C'compound'
         DC    X'0'
LC130    EQU   *
         DC    C', '
         DC    X'0'
LC131    EQU   *
         DC    C'cm'
         DC    X'0'
LC132    EQU   *
         DC    C'cond'
         DC    X'0'
LC133    EQU   *
         DC    C'?:'
         DC    X'0'
LC134    EQU   *
         DC    C'cn'
         DC    X'0'
LC135    EQU   *
         DC    C'max'
         DC    X'0'
LC136    EQU   *
         DC    C'>?'
         DC    X'0'
LC137    EQU   *
         DC    C'mx'
         DC    X'0'
LC138    EQU   *
         DC    C'min'
         DC    X'0'
LC139    EQU   *
         DC    C'<?'
         DC    X'0'
LC140    EQU   *
         DC    C'mn'
         DC    X'0'
LC141    EQU   *
         DC    C'nop'
         DC    X'0'
LC142    EQU   *
         DC    X'0'
LC143    EQU   *
         DC    C'rm'
         DC    X'0'
LC144    EQU   *
         DC    C'->*'
         DC    X'0'
LC145    EQU   *
         DC    C'sz'
         DC    X'0'
LC146    EQU   *
         DC    C'sizeof '
         DC    X'0'
         DS    0F
@@V2     EQU   *
         DC    A(LC20)
         DC    A(LC21)
         DC    F'2'
         DC    A(LC22)
         DC    A(LC23)
         DC    F'2'
         DC    A(LC24)
         DC    A(LC21)
         DC    F'0'
         DC    A(LC25)
         DC    A(LC23)
         DC    F'0'
         DC    A(LC26)
         DC    A(LC27)
         DC    F'2'
         DC    A(LC28)
         DC    A(LC29)
         DC    F'2'
         DC    A(LC30)
         DC    A(LC31)
         DC    F'2'
         DC    A(LC32)
         DC    A(LC33)
         DC    F'2'
         DC    A(LC34)
         DC    A(LC35)
         DC    F'2'
         DC    A(LC36)
         DC    A(LC37)
         DC    F'2'
         DC    A(LC38)
         DC    A(LC39)
         DC    F'2'
         DC    A(LC40)
         DC    A(LC41)
         DC    F'2'
         DC    A(LC42)
         DC    A(LC43)
         DC    F'2'
         DC    A(LC44)
         DC    A(LC45)
         DC    F'0'
         DC    A(LC46)
         DC    A(LC45)
         DC    F'2'
         DC    A(LC47)
         DC    A(LC48)
         DC    F'2'
         DC    A(LC49)
         DC    A(LC50)
         DC    F'0'
         DC    A(LC51)
         DC    A(LC50)
         DC    F'2'
         DC    A(LC52)
         DC    A(LC53)
         DC    F'2'
         DC    A(LC54)
         DC    A(LC55)
         DC    F'0'
         DC    A(LC56)
         DC    A(LC55)
         DC    F'2'
         DC    A(LC57)
         DC    A(LC58)
         DC    F'2'
         DC    A(LC59)
         DC    A(LC58)
         DC    F'2'
         DC    A(LC60)
         DC    A(LC45)
         DC    F'0'
         DC    A(LC61)
         DC    A(LC50)
         DC    F'0'
         DC    A(LC62)
         DC    A(LC63)
         DC    F'0'
         DC    A(LC64)
         DC    A(LC63)
         DC    F'2'
         DC    A(LC65)
         DC    A(LC66)
         DC    F'2'
         DC    A(LC67)
         DC    A(LC68)
         DC    F'0'
         DC    A(LC69)
         DC    A(LC68)
         DC    F'2'
         DC    A(LC70)
         DC    A(LC71)
         DC    F'2'
         DC    A(LC72)
         DC    A(LC73)
         DC    F'0'
         DC    A(LC74)
         DC    A(LC73)
         DC    F'2'
         DC    A(LC75)
         DC    A(LC76)
         DC    F'0'
         DC    A(LC77)
         DC    A(LC76)
         DC    F'2'
         DC    A(LC78)
         DC    A(LC79)
         DC    F'0'
         DC    A(LC80)
         DC    A(LC79)
         DC    F'2'
         DC    A(LC81)
         DC    A(LC82)
         DC    F'0'
         DC    A(LC83)
         DC    A(LC82)
         DC    F'2'
         DC    A(LC84)
         DC    A(LC85)
         DC    F'0'
         DC    A(LC86)
         DC    A(LC85)
         DC    F'2'
         DC    A(LC87)
         DC    A(LC88)
         DC    F'0'
         DC    A(LC89)
         DC    A(LC88)
         DC    F'2'
         DC    A(LC90)
         DC    A(LC91)
         DC    F'2'
         DC    A(LC92)
         DC    A(LC93)
         DC    F'0'
         DC    A(LC94)
         DC    A(LC93)
         DC    F'2'
         DC    A(LC95)
         DC    A(LC96)
         DC    F'2'
         DC    A(LC97)
         DC    A(LC98)
         DC    F'0'
         DC    A(LC99)
         DC    A(LC98)
         DC    F'2'
         DC    A(LC100)
         DC    A(LC101)
         DC    F'2'
         DC    A(LC102)
         DC    A(LC103)
         DC    F'0'
         DC    A(LC104)
         DC    A(LC103)
         DC    F'2'
         DC    A(LC105)
         DC    A(LC106)
         DC    F'0'
         DC    A(LC107)
         DC    A(LC106)
         DC    F'2'
         DC    A(LC108)
         DC    A(LC109)
         DC    F'0'
         DC    A(LC110)
         DC    A(LC109)
         DC    F'2'
         DC    A(LC111)
         DC    A(LC112)
         DC    F'2'
         DC    A(LC113)
         DC    A(LC114)
         DC    F'0'
         DC    A(LC115)
         DC    A(LC114)
         DC    F'2'
         DC    A(LC116)
         DC    A(LC117)
         DC    F'2'
         DC    A(LC118)
         DC    A(LC119)
         DC    F'0'
         DC    A(LC120)
         DC    A(LC119)
         DC    F'2'
         DC    A(LC121)
         DC    A(LC119)
         DC    F'2'
         DC    A(LC122)
         DC    A(LC55)
         DC    F'0'
         DC    A(LC123)
         DC    A(LC124)
         DC    F'0'
         DC    A(LC125)
         DC    A(LC98)
         DC    F'0'
         DC    A(LC126)
         DC    A(LC127)
         DC    F'0'
         DC    A(LC128)
         DC    A(LC127)
         DC    F'2'
         DC    A(LC129)
         DC    A(LC130)
         DC    F'0'
         DC    A(LC131)
         DC    A(LC130)
         DC    F'2'
         DC    A(LC132)
         DC    A(LC133)
         DC    F'0'
         DC    A(LC134)
         DC    A(LC133)
         DC    F'2'
         DC    A(LC135)
         DC    A(LC136)
         DC    F'0'
         DC    A(LC137)
         DC    A(LC136)
         DC    F'2'
         DC    A(LC138)
         DC    A(LC139)
         DC    F'0'
         DC    A(LC140)
         DC    A(LC139)
         DC    F'2'
         DC    A(LC141)
         DC    A(LC142)
         DC    F'0'
         DC    A(LC143)
         DC    A(LC144)
         DC    F'2'
         DC    A(LC145)
         DC    A(LC146)
         DC    F'2'
         DS    0F
@@V3     EQU   *
         DC    2X'00'
         DS    0F
* X-func set_cplus_marker_for_demangling prologue
SET@CPLU PDPPRLG CINDEX=0,FRAME=88,BASER=12,ENTRY=YES
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function set_cplus_marker_for_demangling code
         L     2,=A(@@V1)
         MVC   0(1,2),3(11)
* Function set_cplus_marker_for_demangling epilogue
         PDPEPIL
* Function set_cplus_marker_for_demangling literal pool
         DS    0F
         LTORG
* Function set_cplus_marker_for_demangling page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         DS    0F
* Function consume_count,F1 prologue
@@F1     PDPPRLG CINDEX=1,FRAME=88,BASER=12,ENTRY=NO
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function consume_count code
         SLR   4,4
         SLR   5,5
         L     6,0(11)
         SLR   3,3
         L     7,=V(ZZZ@2096)
         L     2,0(6)
         SLR   8,8
         IC    8,0(2)
         LR    2,8
         AR    2,8
         LH    2,0(2,7)
         N     2,=F'4'
         L     15,=F'-1'
         LTR   2,2
         BE    L2
L10      EQU   *
         LR    2,3
         SLL   2,3
         AR    2,3
         AR    3,2
         LR    4,3
         SRDA  4,32
         LA    2,10(0,0)
         DR    4,2
         L     15,0(6)
         LTR   4,4
         BE    L6
         L     3,=V(ZZZ@2096)
L16      EQU   *
         SLR   2,2
         IC    2,0(15)
         AR    2,2
         LH    2,0(2,3)
         N     2,=F'4'
         LTR   2,2
         BE    L15
         A     15,=F'1'
         ST    15,0(6)
         B     L16
L15      EQU   *
         L     15,=F'-1'
         B     L2
L6       EQU   *
         SLR   2,2
         IC    2,0(15)
         AR    3,2
         A     3,=F'-240'
         A     15,=F'1'
         ST    15,0(6)
         SLR   8,8
         IC    8,0(15)
         LR    2,8
         AR    2,8
         LH    2,0(2,7)
         N     2,=F'4'
         LTR   2,2
         BNE   L10
         LTR   3,3
         BNL   L11
         L     3,=F'-1'
L11      EQU   *
         LR    15,3
L2       EQU   *
* Function consume_count epilogue
         PDPEPIL
* Function consume_count literal pool
         DS    0F
         LTORG
* Function consume_count page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* Function consume_count_with_underscores,F2 prologue
@@F2     PDPPRLG CINDEX=2,FRAME=96,BASER=12,ENTRY=NO
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function consume_count_with_underscores code
         L     4,0(11)
         L     3,0(4)
         IC    15,0(3)
         CLM   15,1,=XL1'6D'
         BNE   L18
         A     3,=F'1'
         ST    3,0(4)
         LR    2,3
         SLR   3,3
         IC    3,0(2)
         LR    2,3
         AR    2,3
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'4'
         L     5,=F'-1'
         LTR   2,2
         BE    L17
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,0(4)
         CLI   0(2),109
         BNE   L17
         A     2,=F'1'
         ST    2,0(4)
         B     L21
L18      EQU   *
         LA    2,16(,15)
         L     5,=F'-1'
         CLM   2,1,=XL1'09'
         BH    L17
         N     15,=XL4'000000FF'
         A     15,=F'-240'
         A     3,=F'1'
         ST    3,0(4)
L21      EQU   *
         LR    5,15
L17      EQU   *
         LR    15,5
* Function consume_count_with_underscores epilogue
         PDPEPIL
* Function consume_count_with_underscores literal pool
         DS    0F
         LTORG
* Function consume_count_with_underscores page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
         DS    0F
* Function code_for_qualifier,F3 prologue
@@F3     PDPPRLG CINDEX=3,FRAME=88,BASER=12,ENTRY=NO
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function code_for_qualifier code
         L     2,0(11)
         LA    15,1(0,0)
         LA    3,195(0,0)
         CR    2,3
         BE    L23
         BH    L29
         LA    3,164(0,0)
         CLR   2,3
         BE    L27
         B     L24
L29      EQU   *
         LA    3,229(0,0)
         LA    15,2(0,0)
         CLR   2,3
         BE    L23
         B     L24
L27      EQU   *
         LA    15,4(0,0)
         B     L23
L24      EQU   *
         LA    1,88(,13)
         L     15,=V(ABORT)
         BALR  14,15
L23      EQU   *
* Function code_for_qualifier epilogue
         PDPEPIL
* Function code_for_qualifier literal pool
         DS    0F
         LTORG
* Function code_for_qualifier page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
LC147    EQU   *
         DC    C'const'
         DC    X'0'
LC148    EQU   *
         DC    C'volatile'
         DC    X'0'
LC149    EQU   *
         DC    C'__restrict'
         DC    X'0'
LC150    EQU   *
         DC    C'const volatile'
         DC    X'0'
LC151    EQU   *
         DC    C'const __restrict'
         DC    X'0'
LC152    EQU   *
         DC    C'volatile __restrict'
         DC    X'0'
LC153    EQU   *
         DC    C'const volatile __restrict'
         DC    X'0'
         DS    0F
* Function qualifier_string,F4 prologue
@@F4     PDPPRLG CINDEX=4,FRAME=88,BASER=12,ENTRY=NO
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function qualifier_string code
         L     3,0(11)
         LA    2,7(0,0)
         CLR   3,2
         BH    L31
         SLL   3,2
         L     2,=A(L41)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
L41      EQU   *
         DC    A(L32)
         DC    A(L33)
         DC    A(L34)
         DC    A(L36)
         DC    A(L35)
         DC    A(L37)
         DC    A(L38)
         DC    A(L39)
L32      EQU   *
         L     15,=A(LC142)
         B     L30
L33      EQU   *
         L     15,=A(LC147)
         B     L30
L34      EQU   *
         L     15,=A(LC148)
         B     L30
L35      EQU   *
         L     15,=A(LC149)
         B     L30
L36      EQU   *
         L     15,=A(LC150)
         B     L30
L37      EQU   *
         L     15,=A(LC151)
         B     L30
L38      EQU   *
         L     15,=A(LC152)
         B     L30
L39      EQU   *
         L     15,=A(LC153)
         B     L30
L31      EQU   *
         LA    1,88(,13)
         L     15,=V(ABORT)
         BALR  14,15
L30      EQU   *
* Function qualifier_string epilogue
         PDPEPIL
* Function qualifier_string literal pool
         DS    0F
         LTORG
* Function qualifier_string page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
         DS    0F
* Function demangle_qualifier,F5 prologue
@@F5     PDPPRLG CINDEX=5,FRAME=96,BASER=12,ENTRY=NO
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function demangle_qualifier code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
* Function demangle_qualifier epilogue
         PDPEPIL
* Function demangle_qualifier literal pool
         DS    0F
         LTORG
* Function demangle_qualifier page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
         DS    0F
* X-func cplus_mangle_opname prologue
CPLUS@MA PDPPRLG CINDEX=6,FRAME=104,BASER=12,ENTRY=YES
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function cplus_mangle_opname code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    8,15
         MVC   96(4,13),=F'0'
         L     9,=A(@@V2)
L48      EQU   *
         MVC   88(4,13),4(9)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         CLR   15,8
         BNE   L46
         L     3,4(11)
         N     3,=F'2'
         L     2,8(9)
         N     2,=F'2'
         CLR   3,2
         BNE   L46
         L     6,4(9)
         LR    7,8
         L     4,0(11)
         LR    5,8
         LA    2,1(0,0)
         CLCL  6,4
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BNE   L46
         L     15,0(9)
         B     L43
L46      EQU   *
         L     2,96(13)
         A     2,=F'1'
         ST    2,96(13)
         A     9,=F'12'
         LA    3,78(0,0)
         CLR   2,3
         BNH   L48
         SLR   15,15
L43      EQU   *
* Function cplus_mangle_opname epilogue
         PDPEPIL
* Function cplus_mangle_opname literal pool
         DS    0F
         LTORG
* Function cplus_mangle_opname page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
         DS    0F
* X-func ZZZ_249 prologue
ZZZ@249  PDPPRLG CINDEX=7,FRAME=88,BASER=12,ENTRY=YES
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function ZZZ_249 code
         L     15,0(11)
         L     2,=A(ZZZ@1534)
         L     2,4(2)
         LTR   2,2
         BE    L58
         L     3,=A(ZZZ@1534+4)
L56      EQU   *
         CL    15,0(3)
         BNE   L54
         L     2,=A(ZZZ@288)
         ST    15,0(2)
         B     L51
L54      EQU   *
         A     3,=F'12'
         L     2,0(3)
         LTR   2,2
         BNE   L56
L58      EQU   *
         SLR   15,15
L51      EQU   *
* Function ZZZ_249 epilogue
         PDPEPIL
* Function ZZZ_249 literal pool
         DS    0F
         LTORG
* Function ZZZ_249 page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
         DS    0F
* X-func ZZZ_245 prologue
ZZZ@245  PDPPRLG CINDEX=8,FRAME=96,BASER=12,ENTRY=YES
         B     FEN8
         LTORG
FEN8     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         LR    11,1
         L     10,=A(PGT8)
* Function ZZZ_245 code
         L     4,0(11)
         L     3,=A(ZZZ@1534)
L67      EQU   *
         L     2,4(3)
         LTR   2,2
         BE    L66
         ST    4,88(13)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   L62
         L     15,4(3)
         B     L59
L62      EQU   *
         A     3,=F'12'
         B     L67
L66      EQU   *
         SLR   15,15
L59      EQU   *
* Function ZZZ_245 epilogue
         PDPEPIL
* Function ZZZ_245 literal pool
         DS    0F
         LTORG
* Function ZZZ_245 page table
         DS    0F
PGT8     EQU   *
         DC    A(PG8)
         DS    0F
* Function grow_vect,F6 prologue
@@F6     PDPPRLG CINDEX=9,FRAME=96,BASER=12,ENTRY=NO
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function grow_vect code
         SLR   4,4
         SLR   5,5
         L     6,0(11)
         L     3,4(11)
         L     15,8(11)
         L     2,0(3)
         CLR   2,15
         BNL   L68
         AR    2,2
         ST    2,0(3)
         CLR   2,15
         BNL   L70
         ST    15,0(3)
L70      EQU   *
         MVC   88(4,13),0(6)
         L     5,12(11)
         M     4,0(3)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
         ST    15,0(6)
L68      EQU   *
* Function grow_vect epilogue
         PDPEPIL
* Function grow_vect literal pool
         DS    0F
         LTORG
* Function grow_vect page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
         DS    0F
* Function string_init,F49 prologue
@@F49    PDPPRLG CINDEX=10,FRAME=88,BASER=12,ENTRY=NO
         B     FEN10
         LTORG
FEN10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         LR    11,1
         L     10,=A(PGT10)
* Function string_init code
         L     2,0(11)
         MVC   8(4,2),=F'0'
         MVC   4(4,2),=F'0'
         MVC   0(4,2),=F'0'
* Function string_init epilogue
         PDPEPIL
* Function string_init literal pool
         DS    0F
         LTORG
* Function string_init page table
         DS    0F
PGT10    EQU   *
         DC    A(PG10)
         DS    0F
* Function string_delete,F48 prologue
@@F48    PDPPRLG CINDEX=11,FRAME=96,BASER=12,ENTRY=NO
         B     FEN11
         LTORG
FEN11    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         LR    11,1
         L     10,=A(PGT11)
* Function string_delete code
         L     2,0(11)
         L     15,0(2)
         LTR   15,15
         BE    L72
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   4(4,2),=F'0'
         MVC   8(4,2),=F'0'
         MVC   0(4,2),=F'0'
L72      EQU   *
* Function string_delete epilogue
         PDPEPIL
* Function string_delete literal pool
         DS    0F
         LTORG
* Function string_delete page table
         DS    0F
PGT11    EQU   *
         DC    A(PG11)
         DS    0F
* Function squangle_mop_up,F9 prologue
@@F9     PDPPRLG CINDEX=12,FRAME=96,BASER=12,ENTRY=NO
         B     FEN12
         LTORG
FEN12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         LR    11,1
         L     10,=A(PGT12)
* Function squangle_mop_up code
         L     4,0(11)
L91      EQU   *
         L     2,16(4)
         LTR   2,2
         BNH   L92
         LR    3,2
         BCTR  3,0
         ST    3,16(4)
         L     2,8(4)
         SLL   3,2
         L     2,0(3,2)
         LTR   2,2
         BE    L91
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,8(4)
         SLR   5,5
         ST    5,0(3,2)
         B     L91
L92      EQU   *
         L     2,20(4)
         LTR   2,2
         BNH   L89
         LR    3,2
         BCTR  3,0
         ST    3,20(4)
         L     2,12(4)
         SLL   3,2
         L     2,0(3,2)
         LTR   2,2
         BE    L92
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,12(4)
         SLR   5,5
         ST    5,0(3,2)
         B     L92
L89      EQU   *
         L     2,12(4)
         LTR   2,2
         BE    L84
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L84      EQU   *
         L     2,8(4)
         LTR   2,2
         BE    L74
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L74      EQU   *
* Function squangle_mop_up epilogue
         PDPEPIL
* Function squangle_mop_up literal pool
         DS    0F
         LTORG
* Function squangle_mop_up page table
         DS    0F
PGT12    EQU   *
         DC    A(PG12)
         DS    0F
* Function forget_types,F43 prologue
@@F43    PDPPRLG CINDEX=13,FRAME=96,BASER=12,ENTRY=NO
         B     FEN13
         LTORG
FEN13    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         LR    11,1
         L     10,=A(PGT13)
* Function forget_types code
         L     4,0(11)
         L     2,32(4)
         LTR   2,2
         BNH   L99
L97      EQU   *
         LR    3,2
         BCTR  3,0
         ST    3,32(4)
         L     2,4(4)
         SLL   3,2
         L     2,0(3,2)
         LTR   2,2
         BE    L94
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,4(4)
         SLR   5,5
         ST    5,0(3,2)
L94      EQU   *
         L     2,32(4)
         LTR   2,2
         BH    L97
L99      EQU   *
* Function forget_types epilogue
         PDPEPIL
* Function forget_types literal pool
         DS    0F
         LTORG
* Function forget_types page table
         DS    0F
PGT13    EQU   *
         DC    A(PG13)
         DS    0F
* Function delete_non_B_K_work_stuff,F11 prologue
@@F11    PDPPRLG CINDEX=14,FRAME=96,BASER=12,ENTRY=NO
         B     FEN14
         LTORG
FEN14    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG14     EQU   *
         LR    11,1
         L     10,=A(PGT14)
* Function delete_non_B_K_work_stuff code
         L     4,0(11)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F43)
         BALR  14,15
         L     2,4(4)
         LTR   2,2
         BE    L101
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   4(4,4),=F'0'
         MVC   36(4,4),=F'0'
L101     EQU   *
         L     2,64(4)
         LTR   2,2
         BE    L102
         SLR   5,5
L111     EQU   *
         C     5,68(4)
         BNL   L110
         L     3,64(4)
         LR    2,5
         SLL   2,2
         L     2,0(2,3)
         LTR   2,2
         BE    L105
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L105     EQU   *
         A     5,=F'1'
         B     L111
L110     EQU   *
         MVC   88(4,13),64(4)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   64(4,4),=F'0'
L102     EQU   *
         L     2,76(4)
         LTR   2,2
         BE    L100
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         MVC   88(4,13),76(4)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   76(4,4),=F'0'
L100     EQU   *
* Function delete_non_B_K_work_stuff epilogue
         PDPEPIL
* Function delete_non_B_K_work_stuff literal pool
         DS    0F
         LTORG
* Function delete_non_B_K_work_stuff page table
         DS    0F
PGT14    EQU   *
         DC    A(PG14)
         DS    0F
* Function delete_work_stuff,F12 prologue
@@F12    PDPPRLG CINDEX=15,FRAME=96,BASER=12,ENTRY=NO
         B     FEN15
         LTORG
FEN15    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG15     EQU   *
         LR    11,1
         L     10,=A(PGT15)
* Function delete_work_stuff code
         L     2,0(11)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
* Function delete_work_stuff epilogue
         PDPEPIL
* Function delete_work_stuff literal pool
         DS    0F
         LTORG
* Function delete_work_stuff page table
         DS    0F
PGT15    EQU   *
         DC    A(PG15)
         DS    0F
* Function remember_type,F38 prologue
@@F38    PDPPRLG CINDEX=16,FRAME=96,BASER=12,ENTRY=NO
         B     FEN16
         LTORG
FEN16    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG16     EQU   *
         LR    11,1
         L     10,=A(PGT16)
* Function remember_type code
         L     6,0(11)
         L     7,8(11)
         L     2,72(6)
         LTR   2,2
         BNE   L113
         L     2,32(6)
         L     3,36(6)
         CR    2,3
         BL    L115
         LTR   3,3
         BNE   L116
         MVC   36(4,6),=F'3'
         MVC   88(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         B     L118
L116     EQU   *
         LR    2,3
         AR    2,3
         ST    2,36(6)
         MVC   88(4,13),4(6)
         SLL   2,2
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
L118     EQU   *
         ST    15,4(6)
L115     EQU   *
         LR    2,7
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    4,15
         LR    5,7
         L     2,4(11)
         LR    3,7
         MVCL  4,2
         SLR   2,2
         STC   2,0(15,7)
         L     3,4(6)
         L     2,32(6)
         SLL   2,2
         ST    15,0(2,3)
         L     2,32(6)
         A     2,=F'1'
         ST    2,32(6)
L113     EQU   *
* Function remember_type epilogue
         PDPEPIL
* Function remember_type literal pool
         DS    0F
         LTORG
* Function remember_type page table
         DS    0F
PGT16    EQU   *
         DC    A(PG16)
         DS    0F
* Function get_count,F31 prologue
@@F31    PDPPRLG CINDEX=17,FRAME=88,BASER=12,ENTRY=NO
         B     FEN17
         LTORG
FEN17    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG17     EQU   *
         LR    11,1
         L     10,=A(PGT17)
* Function get_count code
         L     5,0(11)
         L     7,4(11)
         L     6,=V(ZZZ@2096)
         L     4,0(5)
         SLR   3,3
         IC    3,0(4)
         LR    2,3
         AR    2,3
         LH    2,0(2,6)
         N     2,=F'4'
         LTR   2,2
         BE    L119
         LR    15,3
         A     15,=F'-240'
         ST    15,0(7)
         A     4,=F'1'
         ST    4,0(5)
         LR    3,4
         SLR   2,2
         IC    2,0(4)
         AR    2,2
         LH    2,0(2,6)
         N     2,=F'4'
         LTR   2,2
         BE    L121
L123     EQU   *
         LR    2,15
         SLL   2,3
         AR    2,15
         AR    15,2
         SLR   2,2
         IC    2,0(3)
         AR    15,2
         A     15,=F'-240'
         A     3,=F'1'
         IC    4,0(3)
         LR    2,4
         N     2,=XL4'000000FF'
         AR    2,2
         LH    2,0(2,6)
         N     2,=F'4'
         LTR   2,2
         BNE   L123
         CLM   4,1,=XL1'6D'
         BNE   L121
         A     3,=F'1'
         ST    3,0(5)
         ST    15,0(7)
L121     EQU   *
         LA    2,1(0,0)
L119     EQU   *
         LR    15,2
* Function get_count epilogue
         PDPEPIL
* Function get_count literal pool
         DS    0F
         LTORG
* Function get_count page table
         DS    0F
PGT17    EQU   *
         DC    A(PG17)
         DS    0F
* Function register_Btype,F40 prologue
@@F40    PDPPRLG CINDEX=18,FRAME=96,BASER=12,ENTRY=NO
         B     FEN18
         LTORG
FEN18    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG18     EQU   *
         LR    11,1
         L     10,=A(PGT18)
* Function register_Btype code
         L     4,0(11)
         L     2,20(4)
         L     3,28(4)
         CR    2,3
         BL    L128
         LTR   3,3
         BNE   L129
         MVC   28(4,4),=F'5'
         MVC   88(4,13),=F'20'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         B     L131
L129     EQU   *
         LR    2,3
         AR    2,3
         ST    2,28(4)
         MVC   88(4,13),12(4)
         SLL   2,2
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
L131     EQU   *
         ST    15,12(4)
L128     EQU   *
         L     15,20(4)
         LR    2,15
         A     2,=F'1'
         ST    2,20(4)
         L     3,12(4)
         LR    2,15
         SLL   2,2
         SLR   4,4
         ST    4,0(2,3)
* Function register_Btype epilogue
         PDPEPIL
* Function register_Btype literal pool
         DS    0F
         LTORG
* Function register_Btype page table
         DS    0F
PGT18    EQU   *
         DC    A(PG18)
         DS    0F
* Function remember_Btype,F41 prologue
@@F41    PDPPRLG CINDEX=19,FRAME=96,BASER=12,ENTRY=NO
         B     FEN19
         LTORG
FEN19    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG19     EQU   *
         LR    11,1
         L     10,=A(PGT19)
* Function remember_Btype code
         L     2,8(11)
         L     3,12(11)
         LR    4,2
         A     4,=F'1'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    6,15
         LR    7,2
         L     4,4(11)
         LR    5,2
         MVCL  6,4
         SLR   4,4
         STC   4,0(15,2)
         L     2,0(11)
         L     2,12(2)
         SLL   3,2
         ST    15,0(3,2)
* Function remember_Btype epilogue
         PDPEPIL
* Function remember_Btype literal pool
         DS    0F
         LTORG
* Function remember_Btype page table
         DS    0F
PGT19    EQU   *
         DC    A(PG19)
         DS    0F
* Function remember_Ktype,F39 prologue
@@F39    PDPPRLG CINDEX=20,FRAME=96,BASER=12,ENTRY=NO
         B     FEN20
         LTORG
FEN20    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG20     EQU   *
         LR    11,1
         L     10,=A(PGT20)
* Function remember_Ktype code
         L     6,0(11)
         L     7,8(11)
         L     2,16(6)
         L     3,24(6)
         CR    2,3
         BL    L134
         LTR   3,3
         BNE   L135
         MVC   24(4,6),=F'5'
         MVC   88(4,13),=F'20'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         B     L137
L135     EQU   *
         LR    2,3
         AR    2,3
         ST    2,24(6)
         MVC   88(4,13),8(6)
         SLL   2,2
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
L137     EQU   *
         ST    15,8(6)
L134     EQU   *
         LR    2,7
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    4,15
         LR    5,7
         L     2,4(11)
         LR    3,7
         MVCL  4,2
         SLR   2,2
         STC   2,0(15,7)
         L     3,8(6)
         L     2,16(6)
         SLL   2,2
         ST    15,0(2,3)
         L     2,16(6)
         A     2,=F'1'
         ST    2,16(6)
* Function remember_Ktype epilogue
         PDPEPIL
* Function remember_Ktype literal pool
         DS    0F
         LTORG
* Function remember_Ktype page table
         DS    0F
PGT20    EQU   *
         DC    A(PG20)
         DS    0F
* Function string_clear,F50 prologue
@@F50    PDPPRLG CINDEX=21,FRAME=88,BASER=12,ENTRY=NO
         B     FEN21
         LTORG
FEN21    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG21     EQU   *
         LR    11,1
         L     10,=A(PGT21)
* Function string_clear code
         L     2,0(11)
         MVC   4(4,2),0(2)
* Function string_clear epilogue
         PDPEPIL
* Function string_clear literal pool
         DS    0F
         LTORG
* Function string_clear page table
         DS    0F
PGT21    EQU   *
         DC    A(PG21)
         DS    0F
* Function string_need,F47 prologue
@@F47    PDPPRLG CINDEX=22,FRAME=96,BASER=12,ENTRY=NO
         B     FEN22
         LTORG
FEN22    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG22     EQU   *
         LR    11,1
         L     10,=A(PGT22)
* Function string_need code
         L     5,0(11)
         L     3,4(11)
         L     15,0(5)
         LTR   15,15
         BNE   L140
         LA    2,31(0,0)
         CR    3,2
         BH    L141
         LA    3,32(0,0)
L141     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,0(5)
         ST    15,4(5)
         B     L144
L140     EQU   *
         L     4,4(5)
         L     2,8(5)
         SR    2,4
         CR    2,3
         BNL   L139
         LR    2,4
         SR    2,15
         AR    3,2
         AR    3,3
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
         ST    15,0(5)
         AR    2,15
         ST    2,4(5)
L144     EQU   *
         AR    15,3
         ST    15,8(5)
L139     EQU   *
* Function string_need epilogue
         PDPEPIL
* Function string_need literal pool
         DS    0F
         LTORG
* Function string_need page table
         DS    0F
PGT22    EQU   *
         DC    A(PG22)
         DS    0F
* Function string_appendn,F53 prologue
@@F53    PDPPRLG CINDEX=23,FRAME=96,BASER=12,ENTRY=NO
         B     FEN23
         LTORG
FEN23    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG23     EQU   *
         LR    11,1
         L     10,=A(PGT23)
* Function string_appendn code
         L     7,0(11)
         L     6,8(11)
         LTR   6,6
         BE    L145
         ST    7,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F47)
         BALR  14,15
         L     4,4(7)
         LR    5,6
         L     2,4(11)
         LR    3,6
         MVCL  4,2
         A     6,4(7)
         ST    6,4(7)
L145     EQU   *
* Function string_appendn epilogue
         PDPEPIL
* Function string_appendn literal pool
         DS    0F
         LTORG
* Function string_appendn page table
         DS    0F
PGT23    EQU   *
         DC    A(PG23)
         DS    0F
* Function string_appends,F52 prologue
@@F52    PDPPRLG CINDEX=24,FRAME=96,BASER=12,ENTRY=NO
         B     FEN24
         LTORG
FEN24    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG24     EQU   *
         LR    11,1
         L     10,=A(PGT24)
* Function string_appends code
         L     8,0(11)
         L     3,4(11)
         L     4,0(3)
         L     2,4(3)
         CLR   4,2
         BE    L147
         SR    2,4
         ST    8,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F47)
         BALR  14,15
         L     6,4(8)
         LR    7,2
         L     4,0(3)
         LR    5,2
         MVCL  6,4
         A     2,4(8)
         ST    2,4(8)
L147     EQU   *
* Function string_appends epilogue
         PDPEPIL
* Function string_appends literal pool
         DS    0F
         LTORG
* Function string_appends page table
         DS    0F
PGT24    EQU   *
         DC    A(PG24)
         DS    0F
* Function work_stuff_copy_to_from,F10 prologue
@@F10    PDPPRLG CINDEX=25,FRAME=104,BASER=12,ENTRY=NO
         B     FEN25
         LTORG
FEN25    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG25     EQU   *
         LR    11,1
         L     10,=A(PGT25)
* Function work_stuff_copy_to_from code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
         L     2,0(11)
         L     3,4(11)
         MVC   0(84,2),0(3)
         L     2,36(3)
         LTR   2,2
         BE    L150
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     5,0(11)
         ST    15,4(5)
L150     EQU   *
         MVC   96(4,13),=F'0'
         SLR   2,2
         L     6,4(11)
         C     2,32(6)
         BNL   L172
L154     EQU   *
         L     3,4(11)
         L     2,4(3)
         L     3,96(13)
         SLL   3,2
         L     2,0(3,2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         A     2,=F'1'
         L     5,0(11)
         L     4,4(5)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,0(3,4)
         L     4,4(5)
         L     6,4(11)
         L     5,4(6)
         L     8,0(3,4)
         LR    9,2
         L     6,0(3,5)
         LR    7,2
         MVCL  8,6
         L     2,96(13)
         A     2,=F'1'
         ST    2,96(13)
         L     3,4(11)
         C     2,32(3)
         BL    L154
L172     EQU   *
         L     5,4(11)
         L     2,24(5)
         LTR   2,2
         BE    L155
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     6,0(11)
         ST    15,8(6)
L155     EQU   *
         MVC   96(4,13),=F'0'
         SLR   3,3
         L     2,4(11)
         C     3,16(2)
         BNL   L174
L159     EQU   *
         L     5,4(11)
         L     2,8(5)
         L     3,96(13)
         SLL   3,2
         L     2,0(3,2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         A     2,=F'1'
         L     6,0(11)
         L     4,8(6)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,0(3,4)
         L     4,8(6)
         L     6,4(11)
         L     5,8(6)
         L     8,0(3,4)
         LR    9,2
         L     6,0(3,5)
         LR    7,2
         MVCL  8,6
         L     2,96(13)
         A     2,=F'1'
         ST    2,96(13)
         L     3,4(11)
         C     2,16(3)
         BL    L159
L174     EQU   *
         L     5,4(11)
         L     2,28(5)
         LTR   2,2
         BE    L160
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     6,0(11)
         ST    15,12(6)
L160     EQU   *
         MVC   96(4,13),=F'0'
         SLR   3,3
         L     2,4(11)
         C     3,20(2)
         BNL   L176
L164     EQU   *
         L     5,4(11)
         L     2,12(5)
         L     3,96(13)
         SLL   3,2
         L     2,0(3,2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         A     2,=F'1'
         L     6,0(11)
         L     4,12(6)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,0(3,4)
         L     4,12(6)
         L     6,4(11)
         L     5,12(6)
         L     8,0(3,4)
         LR    9,2
         L     6,0(3,5)
         LR    7,2
         MVCL  8,6
         L     2,96(13)
         A     2,=F'1'
         ST    2,96(13)
         L     3,4(11)
         C     2,20(3)
         BL    L164
L176     EQU   *
         L     5,4(11)
         L     2,68(5)
         LTR   2,2
         BE    L165
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     6,0(11)
         ST    15,64(6)
L165     EQU   *
         MVC   96(4,13),=F'0'
         SLR   3,3
         L     2,4(11)
         C     3,68(2)
         BNL   L178
L169     EQU   *
         L     5,4(11)
         L     2,64(5)
         L     3,96(13)
         SLL   3,2
         L     2,0(3,2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         A     2,=F'1'
         L     6,0(11)
         L     4,64(6)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,0(3,4)
         L     4,64(6)
         L     6,4(11)
         L     5,64(6)
         L     8,0(3,4)
         LR    9,2
         L     6,0(3,5)
         LR    7,2
         MVCL  8,6
         L     2,96(13)
         A     2,=F'1'
         ST    2,96(13)
         L     3,4(11)
         C     2,68(3)
         BL    L169
L178     EQU   *
         L     5,4(11)
         L     2,76(5)
         LTR   2,2
         BE    L149
         MVC   88(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     6,0(11)
         ST    15,76(6)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         MVC   88(4,13),76(6)
         MVC   92(4,13),76(5)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
L149     EQU   *
* Function work_stuff_copy_to_from epilogue
         PDPEPIL
* Function work_stuff_copy_to_from literal pool
         DS    0F
         LTORG
* Function work_stuff_copy_to_from page table
         DS    0F
PGT25    EQU   *
         DC    A(PG25)
         DS    0F
* Function string_prependn,F56 prologue
@@F56    PDPPRLG CINDEX=26,FRAME=96,BASER=12,ENTRY=NO
         B     FEN26
         LTORG
FEN26    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG26     EQU   *
         LR    11,1
         L     10,=A(PGT26)
* Function string_prependn code
         L     6,0(11)
         L     7,8(11)
         LTR   7,7
         BE    L179
         ST    6,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@F47)
         BALR  14,15
         L     2,4(6)
L187     EQU   *
         BCTR  2,0
         CL    2,0(6)
         BL    L186
         IC    3,0(2)
         STC   3,0(2,7)
         B     L187
L186     EQU   *
         L     4,0(6)
         LR    5,7
         L     2,4(11)
         LR    3,7
         MVCL  4,2
         A     7,4(6)
         ST    7,4(6)
L179     EQU   *
* Function string_prependn epilogue
         PDPEPIL
* Function string_prependn literal pool
         DS    0F
         LTORG
* Function string_prependn page table
         DS    0F
PGT26    EQU   *
         DC    A(PG26)
         DS    0F
* Function string_prepends,F55 prologue
@@F55    PDPPRLG CINDEX=27,FRAME=104,BASER=12,ENTRY=NO
         B     FEN27
         LTORG
FEN27    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG27     EQU   *
         LR    11,1
         L     10,=A(PGT27)
* Function string_prepends code
         L     2,4(11)
         L     15,0(2)
         L     2,4(2)
         CLR   15,2
         BE    L188
         MVC   88(4,13),0(11)
         ST    15,92(13)
         SR    2,15
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F56)
         BALR  14,15
L188     EQU   *
* Function string_prepends epilogue
         PDPEPIL
* Function string_prepends literal pool
         DS    0F
         LTORG
* Function string_prepends page table
         DS    0F
PGT27    EQU   *
         DC    A(PG27)
         DS    0F
* Function string_prepend,F54 prologue
@@F54    PDPPRLG CINDEX=28,FRAME=104,BASER=12,ENTRY=NO
         B     FEN28
         LTORG
FEN28    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG28     EQU   *
         LR    11,1
         L     10,=A(PGT28)
* Function string_prepend code
         L     3,4(11)
         LTR   3,3
         BE    L190
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    L190
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    3,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(@@F56)
         BALR  14,15
L190     EQU   *
* Function string_prepend epilogue
         PDPEPIL
* Function string_prepend literal pool
         DS    0F
         LTORG
* Function string_prepend page table
         DS    0F
PGT28    EQU   *
         DC    A(PG28)
         DS    0F
* Function string_append,F51 prologue
@@F51    PDPPRLG CINDEX=29,FRAME=96,BASER=12,ENTRY=NO
         B     FEN29
         LTORG
FEN29    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG29     EQU   *
         LR    11,1
         L     10,=A(PGT29)
* Function string_append code
         L     8,0(11)
         L     3,4(11)
         LTR   3,3
         BE    L192
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    L192
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         ST    8,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F47)
         BALR  14,15
         L     6,4(8)
         LR    7,2
         LR    4,3
         LR    5,2
         MVCL  6,4
         A     2,4(8)
         ST    2,4(8)
L192     EQU   *
* Function string_append epilogue
         PDPEPIL
* Function string_append literal pool
         DS    0F
         LTORG
* Function string_append page table
         DS    0F
PGT29    EQU   *
         DC    A(PG29)
LC154    EQU   *
         DC    C'T%d'
         DC    X'0'
         DS    0F
* Function string_append_template_idx,F57 prologue
@@F57    PDPPRLG CINDEX=30,FRAME=144,BASER=12,ENTRY=NO
         B     FEN30
         LTORG
FEN30    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG30     EQU   *
         LR    11,1
         L     10,=A(PGT30)
* Function string_append_template_idx code
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         MVC   92(4,13),=A(LC154)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         MVC   88(4,13),0(11)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
* Function string_append_template_idx epilogue
         PDPEPIL
* Function string_append_template_idx literal pool
         DS    0F
         LTORG
* Function string_append_template_idx page table
         DS    0F
PGT30    EQU   *
         DC    A(PG30)
         DS    0F
* Function snarf_numeric_literal,F36 prologue
@@F36    PDPPRLG CINDEX=31,FRAME=96,BASER=12,ENTRY=NO
         B     FEN31
         LTORG
FEN31    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG31     EQU   *
         LR    11,1
         L     10,=A(PGT31)
* Function snarf_numeric_literal code
         L     4,0(11)
         L     6,4(11)
         L     2,0(4)
         IC    3,0(2)
         CLM   3,1,=XL1'60'
         BNE   L197
         L     2,=A(@@V3)
         STC   3,0(2)
         ST    6,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,0(4)
         B     L206
L197     EQU   *
         CLM   3,1,=XL1'4E'
         BNE   L198
L206     EQU   *
         A     2,=F'1'
         ST    2,0(4)
L198     EQU   *
         L     5,=V(ZZZ@2096)
         L     2,0(4)
         SLR   3,3
         IC    3,0(2)
         LR    2,3
         AR    2,3
         LH    2,0(2,5)
         N     2,=F'4'
         LTR   2,2
         BE    L196
L203     EQU   *
         L     3,=A(@@V3)
         L     2,0(4)
         MVC   0(1,3),0(2)
         ST    6,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,0(4)
         A     2,=F'1'
         ST    2,0(4)
         SLR   3,3
         IC    3,0(2)
         LR    2,3
         AR    2,3
         LH    2,0(2,5)
         N     2,=F'4'
         LTR   2,2
         BNE   L203
         LA    2,1(0,0)
L196     EQU   *
         LR    15,2
* Function snarf_numeric_literal epilogue
         PDPEPIL
* Function snarf_numeric_literal literal pool
         DS    0F
         LTORG
* Function snarf_numeric_literal page table
         DS    0F
PGT31    EQU   *
         DC    A(PG31)
LC155    EQU   *
         DC    C'__ct'
         DC    X'0'
LC156    EQU   *
         DC    C'__dt'
         DC    X'0'
LC158    EQU   *
         DC    C'operator'
         DC    X'0'
LC157    EQU   *
         DC    C'assign_'
         DC    X'0'
LC159    EQU   *
         DC    C'type'
         DC    X'0'
LC160    EQU   *
         DC    C'operator '
         DC    X'0'
         DS    0F
* Function demangle_function_name,F46 prologue
@@F46    PDPPRLG CINDEX=32,FRAME=128,BASER=12,ENTRY=NO
         B     FEN32
         LTORG
FEN32    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG32     EQU   *
         LR    11,1
         L     10,=A(PGT32)
* Function demangle_function_name code
         L     5,0(11)
         L     4,4(11)
         L     9,8(11)
         L     2,12(11)
         ST    9,88(13)
         MVC   92(4,13),0(4)
         LR    3,2
         S     3,0(4)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F47)
         BALR  14,15
         L     3,4(9)
         MVI   0(3),0
         LR    3,2
         A     3,=F'2'
         ST    3,0(4)
         L     2,0(5)
         N     2,=F'4096'
         LTR   2,2
         BE    L208
         CLI   0(3),231
         BNE   L208
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
L208     EQU   *
         L     3,0(5)
         LR    2,3
         N     2,=F'1024'
         LTR   2,2
         BNE   L210
         LR    2,3
         N     2,=F'2048'
         LTR   2,2
         BNE   L210
         LR    2,3
         N     2,=F'4096'
         LTR   2,2
         BNE   L210
         N     3,=F'8192'
         LTR   3,3
         BE    L209
L210     EQU   *
         MVC   88(4,13),0(9)
         MVC   92(4,13),=A(LC155)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   L211
         L     4,40(5)
         A     4,=F'1'
         ST    4,40(5)
         B     L258
L211     EQU   *
         MVC   88(4,13),0(9)
         MVC   92(4,13),=A(LC156)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   L209
         L     2,44(5)
         A     2,=F'1'
         ST    2,44(5)
L258     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F50)
         BALR  14,15
         L     14,=A(L207)
         BR    14
L252     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F50)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),=A(LC158)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    9,88(13)
         A     3,=A(@@V2+4)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),=A(LC31)
         B     L256
L209     EQU   *
         L     3,0(9)
         L     2,4(9)
         SR    2,3
         LA    4,2(0,0)
         CR    2,4
         BNH   L214
         CLI   0(3),150
         BNE   L214
         CLI   1(3),151
         BNE   L214
         MVC   88(4,13),=A(@@V1)
         SLR   2,2
         IC    2,2(3)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L214
         L     3,0(9)
         L     2,4(9)
         SR    2,3
         LA    4,9(0,0)
         CR    2,4
         BNH   L215
         L     2,=A(LC157)
         CLC   3(7,3),0(2)
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BNE   L215
         LR    8,2
         LR    3,2
L220     EQU   *
         L     2,4(9)
         S     2,0(9)
         A     2,=F'-10'
         L     4,=A(@@V2)
         L     5,0(3,4)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         CLR   15,2
         BNE   L218
         LR    6,5
         LR    7,15
         L     4,0(9)
         A     4,=F'10'
         LR    5,15
         LA    2,1(0,0)
         CLCL  6,4
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BE    L252
L218     EQU   *
         A     8,=F'1'
         A     3,=F'12'
         LA    2,78(0,0)
         CLR   8,2
         BNH   L220
         B     L207
L253     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F50)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),=A(LC158)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    9,88(13)
         A     3,=A(@@V2+4)
         MVC   92(4,13),0(3)
         B     L256
L215     EQU   *
         SLR   8,8
         LR    3,8
L226     EQU   *
         L     2,4(9)
         S     2,0(9)
         A     2,=F'-3'
         L     4,=A(@@V2)
         L     5,0(3,4)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         CLR   15,2
         BNE   L224
         LR    6,5
         LR    7,15
         L     4,0(9)
         A     4,=F'3'
         LR    5,15
         LA    2,1(0,0)
         CLCL  6,4
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BE    L253
L224     EQU   *
         A     8,=F'1'
         A     3,=F'12'
         LA    2,78(0,0)
         CLR   8,2
         BNH   L226
         B     L207
L214     EQU   *
         L     3,0(9)
         L     2,4(9)
         SR    2,3
         LA    4,4(0,0)
         CR    2,4
         BNH   L228
         L     2,=A(LC159)
         CLC   0(4,3),0(2)
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BNE   L228
         MVC   88(4,13),=A(@@V1)
         SLR   2,2
         IC    2,4(3)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L228
         L     3,0(9)
         A     3,=F'5'
         ST    3,120(13)
         ST    5,88(13)
         LR    4,13
         A     4,=F'120'
         ST    4,92(13)
         LR    5,13
         A     5,=F'104'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LTR   15,15
         BE    L207
         B     L257
L228     EQU   *
         L     3,0(9)
         CLI   0(3),109
         BNE   L231
         CLI   1(3),109
         BNE   L231
         CLI   2(3),150
         BNE   L231
         CLI   3(3),151
         BNE   L231
         A     3,=F'4'
         ST    3,120(13)
         ST    5,88(13)
         LR    4,13
         A     4,=F'120'
         ST    4,92(13)
         LR    5,13
         A     5,=F'104'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LTR   15,15
         BE    L207
L257     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F50)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),=A(LC160)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    9,88(13)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         LR    3,13
         A     3,=F'104'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         B     L207
L231     EQU   *
         CLI   0(3),109
         BNE   L207
         CLI   1(3),109
         BNE   L207
         L     5,=V(ZZZ@2096)
         IC    4,2(3)
         LR    2,4
         N     2,=XL4'000000FF'
         AR    2,2
         LH    2,0(2,5)
         N     2,=F'8'
         LTR   2,2
         BE    L207
         SLR   2,2
         IC    2,3(3)
         AR    2,2
         LH    2,0(2,5)
         N     2,=F'8'
         LTR   2,2
         BE    L207
         IC    2,4(3)
         CLM   2,1,=XL1'00'
         BNE   L235
         SLR   8,8
         LR    4,8
L240     EQU   *
         L     2,=A(@@V2)
         L     5,0(4,2)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    3,2(0,0)
         CLR   15,3
         BNE   L238
         L     3,0(9)
         CLC   0(2,5),2(3)
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BE    L255
L238     EQU   *
         A     8,=F'1'
         A     4,=F'12'
         LA    5,78(0,0)
         CLR   8,5
         BNH   L240
         B     L207
L255     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F50)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),=A(LC158)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    9,88(13)
         A     4,=A(@@V2+4)
         MVC   92(4,13),0(4)
L256     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L207
L235     EQU   *
         CLM   4,1,=XL1'81'
         BNE   L207
         IC    2,5(3)
         CLM   2,1,=XL1'00'
         BNE   L207
         SLR   8,8
         LR    4,8
L247     EQU   *
         L     2,=A(@@V2)
         L     3,0(4,2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    5,3(0,0)
         CLR   15,5
         BNE   L245
         LR    2,3
         L     3,0(9)
         CLC   0(3,2),2(3)
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BE    L255
L245     EQU   *
         A     8,=F'1'
         A     4,=F'12'
         LA    2,78(0,0)
         CLR   8,2
         BNH   L247
L207     EQU   *
* Function demangle_function_name epilogue
         PDPEPIL
* Function demangle_function_name literal pool
         DS    0F
         LTORG
* Function demangle_function_name page table
         DS    0F
PGT32    EQU   *
         DC    A(PG32)
LC161    EQU   *
         DC    C'__'
         DC    X'0'
         DS    0F
* Function iterate_demangle_function,F25 prologue
@@F25    PDPPRLG CINDEX=33,FRAME=208,BASER=12,ENTRY=NO
         B     FEN33
         LTORG
FEN33    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG33     EQU   *
         LR    11,1
         L     10,=A(PGT33)
* Function iterate_demangle_function code
         L     4,0(11)
         L     8,4(11)
         L     5,8(11)
         L     3,12(11)
         L     9,0(8)
         SLR   6,6
         IC    2,2(3)
         LR    15,6
         CLM   2,1,=XL1'00'
         BE    L259
         L     15,0(4)
         LR    2,15
         N     2,=F'2048'
         LTR   2,2
         BNE   L262
         LR    2,15
         N     2,=F'1024'
         LTR   2,2
         BNE   L262
         LR    2,15
         N     2,=F'4096'
         LTR   2,2
         BNE   L262
         N     15,=F'8192'
         LTR   15,15
         BNE   L262
         LR    2,3
         A     2,=F'2'
         ST    2,88(13)
         MVC   92(4,13),=A(LC161)
         LA    1,88(,13)
         L     15,=V(STRSTR)
         BALR  14,15
         LTR   15,15
         BNE   L261
L262     EQU   *
         ST    4,88(13)
         ST    8,92(13)
         ST    5,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@F46)
         BALR  14,15
         LA    15,1(0,0)
         B     L259
L261     EQU   *
         LR    7,13
         A     7,=F'104'
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         LR    7,13
         A     7,=F'104'
         ST    7,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         LA    7,120(,13)
         ST    7,88(13)
         ST    6,92(13)
         MVC   96(4,13),=F'84'
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         ST    7,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         IC    2,0(2)
L281     EQU   *
         CLM   2,1,=XL1'00'
         BE    L264
         ST    4,88(13)
         ST    8,92(13)
         ST    5,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@F46)
         BALR  14,15
         ST    4,88(13)
         ST    8,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BNE   L264
         ST    9,0(8)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F50)
         BALR  14,15
         ST    5,88(13)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         ST    4,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         A     3,=F'2'
L284     EQU   *
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    L267
         CLM   2,1,=XL1'6D'
         BNE   L280
         CLI   1(3),109
         BE    L267
L280     EQU   *
         A     3,=F'1'
         B     L284
L267     EQU   *
         CLI   0(3),109
         BNE   L277
         A     3,=F'1'
         B     L267
L277     EQU   *
         A     3,=F'-2'
         IC    2,2(3)
         B     L281
L264     EQU   *
         LR    7,13
         A     7,=F'120'
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         LR    15,6
L259     EQU   *
* Function iterate_demangle_function epilogue
         PDPEPIL
* Function iterate_demangle_function literal pool
         DS    0F
         LTORG
* Function iterate_demangle_function page table
         DS    0F
PGT33    EQU   *
         DC    A(PG33)
LC162    EQU   *
         DC    C'_imp__'
         DC    X'0'
LC163    EQU   *
         DC    C'__imp_'
         DC    X'0'
LC164    EQU   *
         DC    C'_GLOBAL_'
         DC    X'0'
LC165    EQU   *
         DC    C'__std__'
         DC    X'0'
LC166    EQU   *
         DC    C'__sti__'
         DC    X'0'
LC167    EQU   *
         DC    C'_'
         DC    X'0'
LC168    EQU   *
         DC    C'__vtbl__'
         DC    X'0'
LC169    EQU   *
         DC    C'::'
         DC    X'0'
LC170    EQU   *
         DC    C' virtual table'
         DC    X'0'
LC171    EQU   *
         DC    C'global constructors keyed to '
         DC    X'0'
LC172    EQU   *
         DC    C'global destructors keyed to '
         DC    X'0'
LC173    EQU   *
         DC    C'import stub for '
         DC    X'0'
         DS    0F
* Function internal_cplus_demangle,F8 prologue
@@F8     PDPPRLG CINDEX=34,FRAME=144,BASER=12,ENTRY=NO
         B     FEN34
         LTORG
FEN34    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG34     EQU   *
         LR    11,1
         L     10,=A(PGT34)
* Function internal_cplus_demangle code
         L     7,0(11)
         SLR   15,15
         MVC   124(4,13),40(7)
         MVC   128(4,13),44(7)
         MVC   132(4,13),48(7)
         MVC   136(4,13),56(7)
         ST    15,44(7)
         ST    15,40(7)
         ST    15,56(7)
         ST    15,60(7)
         L     2,4(11)
         LTR   2,2
         L     14,=A(L286)
         BER   14
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         L     14,=A(L286)
         BER   14
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         L     3,0(7)
         LR    2,3
         N     2,=F'256'
         LTR   2,2
         BNE   L288
         N     3,=F'512'
         LTR   3,3
         BE    L377
L288     EQU   *
         ST    7,88(13)
         LR    3,11
         A     3,=F'4'
         ST    3,92(13)
         LR    4,13
         A     4,=F'104'
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F27)
         BALR  14,15
         LR    3,15
         LTR   15,15
         L     14,=A(L289)
         BNER  14
L377     EQU   *
         LA    6,4(,11)
         LA    8,104(,13)
         LA    9,1(0,0)
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    5,6(0,0)
         CLR   15,5
         BNH   L290
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(LC162)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BE    L291
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(LC163)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L290
L291     EQU   *
         L     2,4(11)
         A     2,=F'6'
         ST    2,4(11)
         ST    9,60(7)
         B     L292
L290     EQU   *
         MVC   88(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    3,10(0,0)
         CLR   15,3
         BNH   L293
         MVC   88(4,13),0(6)
         MVC   92(4,13),=A(LC164)
         MVC   96(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L293
         MVC   88(4,13),=A(@@V1)
         L     2,0(6)
         SLR   4,4
         IC    4,8(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L292
         L     2,0(6)
         CLC   0(1,15),10(2)
         BNE   L292
         IC    3,9(2)
         CLM   3,1,=XL1'C4'
         BNE   L295
         A     2,=F'11'
         ST    2,0(6)
         MVC   44(4,7),=F'2'
         B     L380
L295     EQU   *
         CLM   3,1,=XL1'C9'
         BNE   L292
         A     2,=F'11'
         ST    2,0(6)
         MVC   40(4,7),=F'2'
L380     EQU   *
         ST    7,88(13)
         ST    6,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F27)
         BALR  14,15
         LA    2,1(0,0)
         LTR   15,15
         L     14,=A(L297)
         BNER  14
         B     L292
L293     EQU   *
         L     3,0(7)
         LR    2,3
         N     2,=F'2048'
         LTR   2,2
         BNE   L303
         LR    2,3
         N     2,=F'4096'
         LTR   2,2
         BNE   L303
         N     3,=F'8192'
         LTR   3,3
         BE    L302
L303     EQU   *
         MVC   88(4,13),0(6)
         MVC   92(4,13),=A(LC165)
         MVC   96(4,13),=F'7'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L302
         L     5,0(6)
         A     5,=F'7'
         ST    5,0(6)
         MVC   44(4,7),=F'2'
         B     L292
L302     EQU   *
         L     3,0(7)
         LR    2,3
         N     2,=F'2048'
         LTR   2,2
         BNE   L306
         LR    2,3
         N     2,=F'4096'
         LTR   2,2
         BNE   L306
         N     3,=F'8192'
         LTR   3,3
         BE    L292
L306     EQU   *
         MVC   88(4,13),0(6)
         MVC   92(4,13),=A(LC166)
         MVC   96(4,13),=F'7'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L292
         L     2,0(6)
         A     2,=F'7'
         ST    2,0(6)
         MVC   40(4,7),=F'2'
L292     EQU   *
         L     4,0(6)
L307     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'109'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    L308
         A     4,=F'1'
         CLI   0(4),109
         BNE   L307
L308     EQU   *
         LTR   4,4
         BE    L310
         BCTR  4,0
L310     EQU   *
         LTR   4,4
         BE    L311
         ST    4,88(13)
         MVC   92(4,13),=A(LC167)
         LA    1,88(,13)
         L     15,=V(STRSPN)
         BALR  14,15
         LA    3,2(0,0)
         CR    15,3
         BNH   L311
         AR    4,15
         A     4,=F'-2'
L311     EQU   *
         LTR   4,4
         BNE   L313
         LR    9,4
         L     14,=A(L379)
         BR    14
L313     EQU   *
         L     2,48(7)
         LTR   2,2
         BE    L315
         IC    15,0(4)
         LR    2,15
         N     2,=XL4'000000FF'
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'4'
         LTR   2,2
         L     14,=A(L359)
         BNER  14
         CLM   15,1,=XL1'A3'
         L     14,=A(L359)
         BER   14
         LR    9,2
         L     14,=A(L379)
         BR    14
L315     EQU   *
         L     3,0(6)
         CLR   4,3
         BNE   L318
         L     5,=V(ZZZ@2096)
         IC    15,2(4)
         LR    2,15
         N     2,=XL4'000000FF'
         AR    2,2
         LH    2,0(2,5)
         N     2,=F'4'
         LTR   2,2
         BNE   L319
         CLM   15,1,=XL1'D8'
         BE    L319
         CLM   15,1,=XL1'A3'
         BE    L319
         CLM   15,1,=XL1'D2'
         BE    L319
         CLM   15,1,=XL1'C8'
         BNE   L318
L319     EQU   *
         L     3,0(7)
         LR    2,3
         N     2,=F'1024'
         LTR   2,2
         BNE   L321
         LR    2,3
         N     2,=F'2048'
         LTR   2,2
         BNE   L321
         LR    2,3
         N     2,=F'4096'
         LTR   2,2
         BE    L320
L321     EQU   *
         LR    2,15
         N     2,=XL4'000000FF'
         AR    2,2
         LH    2,0(2,5)
         N     2,=F'4'
         LTR   2,2
         BE    L320
         A     4,=F'2'
         ST    4,0(6)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     14,=A(L360)
         BR    14
L320     EQU   *
         LR    2,3
         N     2,=F'1024'
         LTR   2,2
         BNE   L323
         LR    2,3
         N     2,=F'2048'
         LTR   2,2
         BNE   L323
         LR    2,3
         N     2,=F'4096'
         LTR   2,2
         BNE   L323
         N     3,=F'8192'
         LTR   3,3
         BNE   L323
         L     5,40(7)
         A     5,=F'1'
         ST    5,40(7)
L323     EQU   *
         A     4,=F'2'
         ST    4,0(6)
         L     14,=A(L359)
         BR    14
L318     EQU   *
         L     15,0(7)
         LR    2,15
         N     2,=F'2048'
         LTR   2,2
         BE    L325
         CLI   2(4),151
         BNE   L325
         CLI   3(4),163
         BE    L328
L325     EQU   *
         LR    2,15
         N     2,=F'8192'
         LTR   2,2
         BE    L327
         IC    2,2(4)
         CLM   2,1,=XL1'A3'
         BNE   L329
         CLI   3(4),148
         BE    L328
         B     L330
L329     EQU   *
         CLM   2,1,=XL1'97'
         BNE   L330
         CLI   3(4),162
         BE    L328
         B     L378
L330     EQU   *
         CLM   2,1,=XL1'97'
         BNE   L327
L378     EQU   *
         CLI   3(4),163
         BNE   L327
L328     EQU   *
         LA    9,1(0,0)
         MVC   88(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    7,88(13)
         ST    6,92(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         B     L359
L327     EQU   *
         CLR   4,3
         BNE   L332
         IC    5,2(4)
         LR    2,5
         N     2,=XL4'000000FF'
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'4'
         LTR   2,2
         BNE   L332
         CLM   5,1,=XL1'A3'
         BE    L332
         LR    2,15
         N     2,=F'2048'
         LTR   2,2
         BNE   L335
         LR    2,15
         N     2,=F'1024'
         LTR   2,2
         BNE   L335
         LR    2,15
         N     2,=F'4096'
         LTR   2,2
         BNE   L335
         N     15,=F'8192'
         LTR   15,15
         BE    L334
L335     EQU   *
         LA    3,1(0,0)
         MVC   88(4,13),0(6)
         MVC   92(4,13),=A(LC168)
         MVC   96(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L336
         L     2,0(6)
         A     2,=F'8'
         ST    2,120(13)
L381     EQU   *
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L371
         LR    2,13
         A     2,=F'120'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    2,15
         L     5,=F'-1'
         CLR   15,5
         BE    L334
         L     15,120(13)
         AR    15,2
         ST    15,120(13)
         CLI   0(15),109
         BNE   L337
         CLI   1(15),109
         BNE   L337
         A     15,=F'2'
         ST    15,120(13)
L337     EQU   *
         L     2,120(13)
         B     L381
L371     EQU   *
         L     2,0(6)
         A     2,=F'8'
         ST    2,0(6)
L382     EQU   *
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L373
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    2,15
         L     5,=F'-1'
         CLR   15,5
         BE    L334
         MVC   88(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         CR    2,15
         BH    L334
         ST    8,88(13)
         MVC   92(4,13),0(6)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F56)
         BALR  14,15
         L     15,0(6)
         AR    15,2
         ST    15,0(6)
         CLI   0(15),109
         BNE   L343
         CLI   1(15),109
         BNE   L343
         ST    8,88(13)
         MVC   92(4,13),=A(LC169)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         L     2,0(6)
         A     2,=F'2'
         ST    2,0(6)
L343     EQU   *
         L     2,0(6)
         B     L382
L373     EQU   *
         ST    8,88(13)
         MVC   92(4,13),=A(LC170)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L349
L336     EQU   *
         SLR   3,3
L349     EQU   *
         LTR   3,3
         BNE   L359
L334     EQU   *
         CLI   0(4),109
         BNE   L375
         A     4,=F'1'
         B     L334
L375     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(LC161)
         LA    1,88(,13)
         L     15,=V(STRSTR)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    L354
         IC    2,2(15)
         CLM   2,1,=XL1'00'
         BNE   L383
L354     EQU   *
         SLR   9,9
         B     L379
L332     EQU   *
         IC    2,2(4)
         SLR   9,9
         CLM   2,1,=XL1'00'
         BE    L379
L383     EQU   *
         ST    7,88(13)
         ST    6,92(13)
         ST    8,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=A(@@F25)
         BALR  14,15
         LR    2,15
         B     L297
L379     EQU   *
         L     2,40(7)
         LA    3,2(0,0)
         CLR   2,3
         BE    L360
         L     2,44(7)
         CLR   2,3
         BNE   L359
L360     EQU   *
         ST    8,88(13)
         MVC   92(4,13),0(6)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         MVC   88(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         A     15,0(6)
         ST    15,0(6)
         LA    9,1(0,0)
L359     EQU   *
         LR    2,9
L297     EQU   *
         LR    3,2
L289     EQU   *
         LTR   3,3
         BE    L361
         L     2,4(11)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L361
         ST    7,88(13)
         LR    4,11
         A     4,=F'4'
         ST    4,92(13)
         LR    5,13
         A     5,=F'104'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         LR    3,15
L361     EQU   *
         L     2,40(7)
         LA    4,2(0,0)
         CLR   2,4
         BNE   L362
         LR    5,13
         A     5,=F'104'
         ST    5,88(13)
         MVC   92(4,13),=A(LC171)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         MVC   40(4,7),=F'0'
         B     L363
L362     EQU   *
         L     2,44(7)
         LA    4,2(0,0)
         CLR   2,4
         BNE   L364
         LR    5,13
         A     5,=F'104'
         ST    5,88(13)
         MVC   92(4,13),=A(LC172)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         MVC   44(4,7),=F'0'
         B     L363
L364     EQU   *
         L     2,60(7)
         LA    4,1(0,0)
         CLR   2,4
         BNE   L363
         LR    5,13
         A     5,=F'104'
         ST    5,88(13)
         MVC   92(4,13),=A(LC173)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         MVC   60(4,7),=F'0'
L363     EQU   *
         LA    2,104(,13)
         SLR   4,4
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         LTR   3,3
         BNE   L367
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         B     L368
L367     EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(LC142)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     4,0(2)
L368     EQU   *
         LR    15,4
L286     EQU   *
         MVC   40(4,7),124(13)
         MVC   44(4,7),128(13)
         MVC   48(4,7),132(13)
         MVC   56(4,7),136(13)
* Function internal_cplus_demangle epilogue
         PDPEPIL
* Function internal_cplus_demangle literal pool
         DS    0F
         LTORG
* Function internal_cplus_demangle page table
         DS    0F
PGT34    EQU   *
         DC    A(PG34)
LC174    EQU   *
         DC    C'_ada_'
         DC    X'0'
LC175    EQU   *
         DC    C'___'
         DC    X'0'
LC176    EQU   *
         DC    C'<%s>'
         DC    X'0'
         DS    0F
* X-func ZZZ_234 prologue
ZZZ@234  PDPPRLG CINDEX=35,FRAME=200,BASER=12,ENTRY=YES
         B     FEN35
         LTORG
FEN35    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG35     EQU   *
         LR    11,1
         L     10,=A(PGT35)
* Function ZZZ_234 code
         L     5,0(11)
         L     3,4(11)
         L     4,=A(ZZZ@288)
         L     2,0(4)
         L     6,=F'-1'
         CLR   2,6
         BNE   L385
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         B     L384
L385     EQU   *
         LR    7,13
         A     7,=F'104'
         ST    7,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'84'
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         ST    3,104(13)
         LR    2,3
         N     2,=F'65284'
         LTR   2,2
         BNE   L386
         L     2,0(4)
         N     2,=F'65284'
         OR    3,2
         ST    3,104(13)
L386     EQU   *
         L     3,104(13)
         LR    2,3
         N     2,=F'16384'
         LTR   2,2
         BNE   L388
         LR    2,3
         N     2,=F'256'
         LTR   2,2
         BE    L387
L388     EQU   *
         ST    5,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@251)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   L438
         L     2,104(13)
         N     2,=F'16384'
         LTR   2,2
         BNE   L438
L387     EQU   *
         L     2,104(13)
         N     2,=F'4'
         LTR   2,2
         BE    L391
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(JAVA@DEM)
         BALR  14,15
         LTR   15,15
         BNE   L384
L391     EQU   *
         L     2,104(13)
         N     2,=F'32768'
         LTR   2,2
         BE    L393
         LR    4,5
         MVC   192(4,13),=F'0'
         MVC   196(4,13),=F'0'
         SLR   8,8
         ST    5,88(13)
         MVC   92(4,13),=A(LC174)
         MVC   96(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L394
         A     4,=F'5'
         LA    8,1(0,0)
L394     EQU   *
         IC    2,0(4)
         CLM   2,1,=XL1'6D'
         BE    L397
         CLM   2,1,=XL1'4C'
         BE    L397
         ST    4,88(13)
         MVC   92(4,13),=A(LC175)
         LA    1,88(,13)
         L     15,=V(STRSTR)
         BALR  14,15
         LTR   15,15
         BNE   L398
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    5,15
         B     L399
L398     EQU   *
         CLI   3(15),231
         BNE   L397
         LR    5,15
         SR    5,4
         LA    8,1(0,0)
L399     EQU   *
         LR    9,13
         A     9,=F'192'
         ST    9,88(13)
         LR    2,13
         A     2,=F'196'
         ST    2,92(13)
         LR    2,5
         AR    2,5
         A     2,=F'1'
         ST    2,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         L     15,=V(ZZZ@2096)
         LR    2,4
         AR    2,5
         BCTR  2,0
         SLR   3,3
         IC    3,0(2)
         LR    2,3
         AR    2,3
         LH    2,0(2,15)
         N     2,=F'4'
         LTR   2,2
         BE    L402
         LR    3,5
         A     3,=F'-2'
         B     L437
L436     EQU   *
         SLR   2,2
         IC    2,0(4,3)
         AR    2,2
         LH    2,0(2,15)
         N     2,=F'4'
         LTR   2,2
         BE    L404
         BCTR  3,0
L437     EQU   *
         LTR   3,3
         BNL   L436
L404     EQU   *
         LA    6,1(0,0)
         CR    3,6
         BNH   L407
         IC    2,0(4,3)
         CLM   2,1,=XL1'6D'
         BNE   L407
         LR    2,4
         AR    2,3
         BCTR  2,0
         CLI   0(2),109
         BNE   L407
         LR    5,3
         BCTR  5,0
         LR    8,6
         B     L402
L407     EQU   *
         IC    2,0(4,3)
         SLL   2,24
         SRA   2,24
         C     2,=F'91'
         BNE   L402
         LR    5,3
         LA    8,1(0,0)
L402     EQU   *
         SLR   3,3
         LR    6,3
         CR    3,5
         BNL   L411
         L     7,=V(ZZZ@2096)
         SLR   2,2
         IC    2,0(4)
         AR    2,2
         LH    2,0(2,15)
         N     2,=F'136'
         LTR   2,2
         BNE   L411
         LR    15,4
L413     EQU   *
         L     2,192(13)
         IC    9,0(15)
         STC   9,0(2,6)
         A     3,=F'1'
         A     15,=F'1'
         A     6,=F'1'
         CR    3,5
         BNL   L411
         SLR   2,2
         IC    2,0(15)
         AR    2,2
         LH    2,0(2,7)
         N     2,=F'136'
         LTR   2,2
         BE    L413
L411     EQU   *
         CR    3,5
         BNL   L433
         LR    15,3
         AR    15,4
L418     EQU   *
         LR    2,5
         A     2,=F'-2'
         CR    3,2
         BNL   L416
         CLI   0(15),109
         BNE   L416
         CLI   1(15),109
         BNE   L416
         L     2,192(13)
         LA    7,75(0,0)
         STC   7,0(2,6)
         LA    8,1(0,0)
         A     3,=F'2'
         A     15,=F'2'
         AR    6,8
         B     L414
L416     EQU   *
         L     2,192(13)
         IC    9,0(15)
         STC   9,0(2,6)
         A     3,=F'1'
         A     15,=F'1'
         A     6,=F'1'
L414     EQU   *
         CR    3,5
         BL    L418
L433     EQU   *
         L     2,192(13)
         SLR   3,3
         STC   3,0(2,6)
         L     3,192(13)
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    L435
         LR    15,3
L424     EQU   *
         IC    5,0(15)
         LR    2,5
         N     2,=XL4'000000FF'
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'128'
         LTR   2,2
         BNE   L397
         CLM   5,1,=XL1'40'
         BE    L397
         A     15,=F'1'
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BNE   L424
L435     EQU   *
         LR    15,8
         LTR   8,8
         BE    L384
         B     L429
L397     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    6,13
         A     6,=F'192'
         ST    6,88(13)
         LR    7,13
         A     7,=F'196'
         ST    7,92(13)
         A     15,=F'3'
         ST    15,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         CLI   0(4),76
         BNE   L428
         MVC   88(4,13),192(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         B     L429
L428     EQU   *
         MVC   88(4,13),192(13)
         MVC   92(4,13),=A(LC176)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
L429     EQU   *
         L     15,192(13)
         B     L384
L393     EQU   *
         LR    9,13
         A     9,=F'104'
         ST    9,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         LR    3,15
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
L438     EQU   *
         LR    15,3
L384     EQU   *
* Function ZZZ_234 epilogue
         PDPEPIL
* Function ZZZ_234 literal pool
         DS    0F
         LTORG
* Function ZZZ_234 page table
         DS    0F
PGT35    EQU   *
         DC    A(PG35)
LC177    EQU   *
         DC    C'-2147483648'
         DC    X'0'
LC178    EQU   *
         DC    C'U'
         DC    X'0'
LC179    EQU   *
         DC    C','
         DC    X'0'
LC180    EQU   *
         DC    C'__pt__'
         DC    X'0'
LC181    EQU   *
         DC    C'__tm__'
         DC    X'0'
LC182    EQU   *
         DC    C'__ps__'
         DC    X'0'
LC183    EQU   *
         DC    C'__S'
         DC    X'0'
LC184    EQU   *
         DC    C'('
         DC    X'0'
LC185    EQU   *
         DC    C')'
         DC    X'0'
LC186    EQU   *
         DC    C'{anonymous}'
         DC    X'0'
         DS    0F
* Function demangle_arm_hp_template,F22 prologue
@@F22    PDPPRLG CINDEX=36,FRAME=152,BASER=12,ENTRY=NO
         B     FEN36
         LTORG
FEN36    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG36     EQU   *
         LR    11,1
         L     10,=A(PGT36)
* Function demangle_arm_hp_template code
         L     8,4(11)
         L     6,8(11)
         L     4,0(8)
         LR    9,4
         AR    9,6
         L     2,0(11)
         L     3,0(2)
         LR    2,3
         N     2,=F'4096'
         LTR   2,2
         BE    L440
         CLI   0(9),231
         BNE   L440
         ST    4,88(13)
         MVC   92(4,13),=F'76'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L441
         L     2,0(8)
         SR    15,2
         CR    15,6
         BNL   L441
         MVC   88(4,13),12(11)
         ST    2,92(13)
         ST    15,96(13)
         B     L523
L441     EQU   *
         MVC   88(4,13),12(11)
         MVC   92(4,13),0(8)
         ST    6,96(13)
L523     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         A     6,0(8)
         A     6,=F'1'
         ST    6,0(8)
         LR    3,13
         A     3,=F'104'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         L     4,0(11)
         L     2,52(4)
         L     5,=F'-1'
         CLR   2,5
         BNE   L443
         L     2,12(11)
         L     3,4(2)
         S     3,0(2)
         ST    3,52(4)
L443     EQU   *
         L     4,0(11)
         MVC   144(4,13),0(4)
         L     5,144(13)
         O     5,=F'1'
         ST    5,0(4)
         MVC   88(4,13),12(11)
         MVC   92(4,13),=A(LC43)
L524     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         L     3,0(8)
         IC    4,0(3)
         LR    2,4
         N     2,=XL4'000000FF'
         LA    5,226(0,0)
         CR    2,5
         BE    L451
         BH    L475
         LA    5,193(0,0)
         CLR   2,5
         BE    L467
         B     L449
L475     EQU   *
         LA    4,227(0,0)
         CLR   2,4
         BE    L447
         LA    5,228(0,0)
         CLR   2,5
         BE    L451
         B     L449
L447     EQU   *
         A     3,=F'1'
         ST    3,0(8)
         MVC   88(4,13),0(11)
         ST    8,92(13)
         LR    2,13
         A     2,=F'104'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LTR   15,15
         BNE   L446
         B     L449
L451     EQU   *
         LA    4,104(,13)
         IC    2,0(3)
         CLM   2,1,=XL1'E4'
         BE    L453
         CLM   2,1,=XL1'E2'
         BNE   L449
L453     EQU   *
         X     2,=F'-28'
         N     2,=XL4'000000FF'
         BCTR  2,0
         SRL   2,31
         LR    6,2
         A     3,=F'1'
         ST    3,0(8)
         LR    2,3
         SLR   3,3
         IC    3,0(2)
         LR    2,3
         LA    5,213(0,0)
         CR    3,5
         BE    L457
         BH    L461
         LA    3,212(0,0)
         CLR   2,3
         BE    L459
         B     L449
L461     EQU   *
         LA    5,215(0,0)
         CLR   3,5
         BE    L458
         B     L449
L457     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(LC50)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L458
L459     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(LC177)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,0(8)
         A     2,=F'1'
         ST    2,0(8)
         B     L446
L458     EQU   *
         L     3,0(8)
         A     3,=F'1'
         ST    3,0(8)
         L     5,=V(ZZZ@2096)
         LR    2,3
         SLR   3,3
         IC    3,0(2)
         LR    2,3
         AR    2,3
         LH    2,0(2,5)
         N     2,=F'4'
         LTR   2,2
         BE    L449
L465     EQU   *
         L     3,=A(@@V3)
         L     2,0(8)
         MVC   0(1,3),0(2)
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,0(8)
         A     2,=F'1'
         ST    2,0(8)
         SLR   3,3
         IC    3,0(2)
         LR    2,3
         AR    2,3
         LH    2,0(2,5)
         N     2,=F'4'
         LTR   2,2
         BNE   L465
         LTR   6,6
         BE    L446
         ST    4,88(13)
         MVC   92(4,13),=A(LC178)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L446
L467     EQU   *
         LA    9,104(,13)
         CLM   4,1,=XL1'C1'
         BNE   L449
         A     3,=F'1'
         ST    3,0(8)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BNH   L449
         ST    9,88(13)
         MVC   92(4,13),=A(LC98)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         LR    4,6
         A     4,=F'1'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    7,15
         LR    4,15
         LR    5,6
         L     2,0(8)
         LR    3,6
         MVCL  4,2
         SLR   5,5
         STC   5,0(15,6)
         ST    15,88(13)
         L     2,0(11)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=A(ZZZ@234)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    L472
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     L473
L472     EQU   *
         ST    9,88(13)
         MVC   92(4,13),0(8)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
L473     EQU   *
         A     6,0(8)
         ST    6,0(8)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L446     EQU   *
         MVC   88(4,13),12(11)
         LR    3,13
         A     3,=F'104'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         L     2,0(8)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L449
         CLM   2,1,=XL1'6D'
         BE    L449
         MVC   88(4,13),12(11)
         MVC   92(4,13),=A(LC179)
         B     L524
L449     EQU   *
         MVC   88(4,13),12(11)
         MVC   92(4,13),=A(LC39)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         LR    4,13
         A     4,=F'104'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         L     2,0(8)
         CLI   0(2),109
         BNE   L479
         A     2,=F'1'
         ST    2,0(8)
L479     EQU   *
         L     5,0(11)
         MVC   0(4,5),144(13)
         L     14,=A(L439)
         BR    14
L440     EQU   *
         LA    7,136(,13)
         LA    5,140(,13)
         LR    2,3
         N     2,=F'2048'
         LTR   2,2
         BNE   L483
         N     3,=F'4096'
         LTR   3,3
         BE    L482
L483     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(LC180)
         LA    1,88(,13)
         L     15,=V(STRSTR)
         BALR  14,15
         ST    15,136(13)
         LTR   15,15
         BE    L482
         A     15,=F'6'
         ST    15,140(13)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,=F'-1'
         CLR   15,2
         L     14,=A(L481)
         BER   14
         L     3,140(13)
         AR    15,3
         LR    2,4
         AR    2,6
         CLR   15,2
         BNE   L482
         CLI   0(3),109
         BNE   L482
         A     3,=F'1'
         ST    3,140(13)
         B     L522
L482     EQU   *
         L     2,0(11)
         L     3,0(2)
         LR    2,3
         N     2,=F'256'
         LTR   2,2
         BNE   L488
         N     3,=F'8192'
         LTR   3,3
         L     14,=A(L481)
         BER   14
L488     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(LC181)
         LA    1,88(,13)
         L     15,=V(STRSTR)
         BALR  14,15
         ST    15,0(7)
         LTR   15,15
         BNE   L490
         ST    4,88(13)
         MVC   92(4,13),=A(LC182)
         LA    1,88(,13)
         L     15,=V(STRSTR)
         BALR  14,15
         ST    15,0(7)
         LTR   15,15
         BNE   L490
         ST    4,88(13)
         MVC   92(4,13),=A(LC180)
         LA    1,88(,13)
         L     15,=V(STRSTR)
         BALR  14,15
         ST    15,0(7)
         LTR   15,15
         BE    L489
L490     EQU   *
         L     7,0(7)
         A     7,=F'6'
         ST    7,0(5)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     3,=F'-1'
         CLR   15,3
         L     14,=A(L481)
         BER   14
         B     L529
L489     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(LC183)
         LA    1,88(,13)
         L     15,=V(STRSTR)
         BALR  14,15
         ST    15,0(7)
         LTR   15,15
         L     14,=A(L481)
         BER   14
         A     15,=F'3'
         ST    15,0(5)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,=F'-1'
         CLR   15,2
         L     14,=A(L481)
         BER   14
L529     EQU   *
         L     2,0(5)
         AR    15,2
         AR    4,6
         CLR   15,4
         L     14,=A(L481)
         BNER  14
         CLI   0(2),109
         L     14,=A(L481)
         BNER  14
         A     2,=F'1'
         ST    2,0(5)
L522     EQU   *
         LR    3,13
         A     3,=F'104'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         MVC   88(4,13),12(11)
         MVC   92(4,13),0(8)
         L     4,136(13)
         S     4,0(8)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     5,0(11)
         L     2,52(5)
         L     3,=F'-1'
         CLR   2,3
         BNE   L497
         L     4,12(11)
         L     2,4(4)
         S     2,0(4)
         ST    2,52(5)
L497     EQU   *
         L     3,0(11)
         L     4,0(3)
         LR    5,4
         O     5,=F'1'
         ST    5,0(3)
         MVC   88(4,13),12(11)
         MVC   92(4,13),=A(LC43)
L526     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,140(13)
         CLR   2,9
         BNL   L503
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         L     3,140(13)
         SLR   2,2
         IC    2,0(3)
         LA    5,211(0,0)
         CLR   2,5
         BE    L506
         LA    5,231(0,0)
         CLR   2,5
         BNE   L508
         A     3,=F'1'
         ST    3,140(13)
         MVC   88(4,13),0(11)
         LR    2,13
         A     2,=F'140'
         ST    2,92(13)
         LA    2,120(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LTR   15,15
         BE    L503
         LR    3,13
         A     3,=F'104'
         ST    3,88(13)
         MVC   92(4,13),=A(LC184)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         LR    5,13
         A     5,=F'104'
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         MVC   92(4,13),=A(LC185)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,140(13)
         CLI   0(2),211
         BNE   L503
         A     2,=F'1'
         ST    2,140(13)
         LR    3,13
         A     3,=F'140'
         ST    3,88(13)
         LR    5,13
         A     5,=F'104'
         ST    5,92(13)
         B     L527
L506     EQU   *
         A     3,=F'1'
         ST    3,140(13)
         LR    2,13
         A     2,=F'140'
         ST    2,88(13)
         LR    3,13
         A     3,=F'104'
         ST    3,92(13)
L527     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F36)
         BALR  14,15
         LTR   15,15
         BNE   L500
         B     L503
L508     EQU   *
         MVC   88(4,13),0(11)
         LR    5,13
         A     5,=F'140'
         ST    5,92(13)
         LR    2,13
         A     2,=F'104'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LTR   15,15
         BE    L503
         L     2,140(13)
         CLR   2,3
         BE    L520
L500     EQU   *
         MVC   88(4,13),12(11)
         LR    3,13
         A     3,=F'104'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         MVC   88(4,13),12(11)
         MVC   92(4,13),=A(LC179)
         B     L526
L503     EQU   *
         LR    5,13
         A     5,=F'104'
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         L     2,140(13)
         CLR   2,9
         BL    L512
         L     2,12(11)
         L     3,4(2)
         BCTR  3,0
         ST    3,4(2)
L512     EQU   *
         MVC   88(4,13),12(11)
         MVC   92(4,13),=A(LC39)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     5,0(11)
         ST    4,0(5)
         B     L480
L481     EQU   *
         LA    2,10(0,0)
         CR    6,2
         BNH   L514
         MVC   88(4,13),0(8)
         MVC   92(4,13),=A(LC164)
         MVC   96(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L514
         L     2,0(8)
         CLI   9(2),213
         BNE   L514
         CLC   8(1,2),10(2)
         BNE   L514
         MVC   88(4,13),=A(@@V1)
         SLR   3,3
         IC    3,8(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L514
         MVC   88(4,13),12(11)
         MVC   92(4,13),=A(LC186)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L480
L520     EQU   *
         L     5,0(11)
         ST    4,0(5)
         B     L439
L514     EQU   *
         L     3,0(11)
         L     2,52(3)
         L     4,=F'-1'
         CLR   2,4
         BNE   L516
         MVC   52(4,3),=F'0'
L516     EQU   *
         MVC   88(4,13),12(11)
         MVC   92(4,13),0(8)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
L480     EQU   *
         A     6,0(8)
         ST    6,0(8)
L439     EQU   *
* Function demangle_arm_hp_template epilogue
         PDPEPIL
* Function demangle_arm_hp_template literal pool
         DS    0F
         LTORG
* Function demangle_arm_hp_template page table
         DS    0F
PGT36    EQU   *
         DC    A(PG36)
         DS    0F
* Function demangle_class_name,F23 prologue
@@F23    PDPPRLG CINDEX=37,FRAME=104,BASER=12,ENTRY=NO
         B     FEN37
         LTORG
FEN37    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG37     EQU   *
         LR    11,1
         L     10,=A(PGT37)
* Function demangle_class_name code
         L     4,4(11)
         SLR   3,3
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    2,15
         LR    15,3
         L     5,=F'-1'
         CLR   2,5
         BE    L530
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         CR    15,2
         BL    L532
         MVC   88(4,13),0(11)
         ST    4,92(13)
         ST    2,96(13)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         LA    3,1(0,0)
L532     EQU   *
         LR    15,3
L530     EQU   *
* Function demangle_class_name epilogue
         PDPEPIL
* Function demangle_class_name literal pool
         DS    0F
         LTORG
* Function demangle_class_name page table
         DS    0F
PGT37    EQU   *
         DC    A(PG37)
LC187    EQU   *
         DC    C'Ý'
         DC    X'0'
LC188    EQU   *
         DC    C'¨'
         DC    X'0'
LC189    EQU   *
         DC    C'.'
         DC    X'0'
LC190    EQU   *
         DC    C' '
         DC    X'0'
LC191    EQU   *
         DC    C'unsigned'
         DC    X'0'
LC192    EQU   *
         DC    C'signed'
         DC    X'0'
LC193    EQU   *
         DC    C'__complex'
         DC    X'0'
LC194    EQU   *
         DC    C'void'
         DC    X'0'
LC195    EQU   *
         DC    C'long long'
         DC    X'0'
LC196    EQU   *
         DC    C'long'
         DC    X'0'
LC197    EQU   *
         DC    C'int'
         DC    X'0'
LC198    EQU   *
         DC    C'short'
         DC    X'0'
LC199    EQU   *
         DC    C'bool'
         DC    X'0'
LC200    EQU   *
         DC    C'char'
         DC    X'0'
LC201    EQU   *
         DC    C'wchar_t'
         DC    X'0'
LC202    EQU   *
         DC    C'long double'
         DC    X'0'
LC203    EQU   *
         DC    C'double'
         DC    X'0'
LC204    EQU   *
         DC    C'float'
         DC    X'0'
LC205    EQU   *
         DC    C'%x'
         DC    X'0'
LC206    EQU   *
         DC    C'int%u_t'
         DC    X'0'
         DS    0F
* Function do_type,F32 prologue
@@F32    PDPPRLG CINDEX=38,FRAME=200,BASER=12,ENTRY=NO
         B     FEN38
         LTORG
FEN38    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG38     EQU   *
         LR    11,1
         L     10,=A(PGT38)
* Function do_type code
         L     7,0(11)
         L     4,4(11)
         L     5,8(11)
         MVC   192(4,13),=F'0'
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         MVC   188(4,13),192(13)
         LA    6,1(0,0)
L603     EQU   *
         L     12,0(,10)
         L     3,0(4)
         SLR   2,2
         IC    2,0(3)
         LA    8,199(0,0)
         CR    2,8
         L     14,=A(L592)
         BER   14
         BH    L599
         LA    15,193(0,0)
         CR    2,15
         BE    L543
         BH    L600
         LA    8,151(0,0)
         LA    15,164(0,0)
         CLR   2,8
         BNE   L721
         B     L538
L600     EQU   *
         LA    8,195(0,0)
         CLR   2,8
         L     14,=A(L595)
         BER   14
         LA    15,198(0,0)
         CLR   2,15
         BE    L552
         L     14,=A(L598)
         BR    14
L599     EQU   *
         LA    8,215(0,0)
         CR    2,8
         BE    L538
         BH    L601
         LA    15,212(0,0)
         CLR   2,15
         BE    L559
         LA    8,214(0,0)
         CLR   2,8
         BE    L559
         L     14,=A(L598)
         BR    14
L601     EQU   *
         LA    15,227(0,0)
         CR    2,15
         BE    L548
         BH    L602
         LA    8,217(0,0)
         CLR   2,8
         BE    L541
         L     14,=A(L598)
         BR    14
L602     EQU   *
         LA    15,229(0,0)
L721     EQU   *
         CLR   2,15
         L     14,=A(L595)
         BER   14
         L     14,=A(L598)
         BR    14
L538     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(7)
         N     2,=F'4'
         LTR   2,2
         BNE   L539
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         MVC   92(4,13),=A(LC55)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
L539     EQU   *
         L     3,192(13)
         LTR   3,3
         L     14,=A(L534)
         BNER  14
         MVC   192(4,13),=F'1'
         L     14,=A(L534)
         BR    14
L541     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         LR    8,13
         A     8,=F'112'
         ST    8,88(13)
         MVC   92(4,13),=A(LC98)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         L     15,192(13)
         LTR   15,15
         L     14,=A(L534)
         BNER  14
         MVC   192(4,13),=F'2'
         L     14,=A(L534)
         BR    14
L543     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         L     2,112(13)
         CL    2,116(13)
         BE    L544
         IC    2,0(2)
         CLM   2,1,=XL1'5C'
         BE    L545
         CLM   2,1,=XL1'50'
         BNE   L544
L545     EQU   *
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         MVC   92(4,13),=A(LC184)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         LR    3,13
         A     3,=F'112'
         ST    3,88(13)
         MVC   92(4,13),=A(LC185)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L544     EQU   *
         LR    8,13
         A     8,=F'112'
         ST    8,88(13)
         MVC   92(4,13),=A(LC187)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,0(4)
         CLI   0(2),109
         BE    L546
         ST    7,88(13)
         ST    4,92(13)
         LR    15,13
         A     15,=F'112'
         ST    15,96(13)
         MVC   100(4,13),=F'3'
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         LR    6,15
L546     EQU   *
         L     2,0(4)
         CLI   0(2),109
         BNE   L547
         A     2,=F'1'
         ST    2,0(4)
L547     EQU   *
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         MVC   92(4,13),=A(LC188)
         L     14,=A(L722)
         BR    14
L548     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         ST    4,88(13)
         LR    3,13
         A     3,=F'176'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         LTR   15,15
         L     14,=A(L615)
         BER   14
         L     3,176(13)
         C     3,32(7)
         L     14,=A(L615)
         BNLR  14
         L     2,4(7)
         SLL   3,2
         L     2,0(3,2)
         ST    2,180(13)
         LA    4,180(,13)
         L     14,=A(L534)
         BR    14
L552     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         L     2,112(13)
         CL    2,116(13)
         BE    L553
         IC    2,0(2)
         CLM   2,1,=XL1'5C'
         BE    L554
         CLM   2,1,=XL1'50'
         BNE   L553
L554     EQU   *
         LR    8,13
         A     8,=F'112'
         ST    8,88(13)
         MVC   92(4,13),=A(LC184)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         MVC   92(4,13),=A(LC185)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L553     EQU   *
         ST    7,88(13)
         ST    4,92(13)
         LR    2,13
         A     2,=F'112'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F45)
         BALR  14,15
         LTR   15,15
         L     14,=A(L615)
         BER   14
         L     3,0(4)
         IC    2,0(3)
         CLM   2,1,=XL1'6D'
         BE    L555
         CLM   2,1,=XL1'00'
         L     14,=A(L615)
         BNER  14
L555     EQU   *
         LTR   6,6
         L     14,=A(L534)
         BER   14
         CLI   0(3),109
         L     14,=A(L534)
         BNER  14
         L     14,=A(L592)
         BR    14
L559     EQU   *
         SLR   8,8
         LR    9,8
         CLI   0(3),212
         BNE   L560
         LA    9,1(0,0)
L560     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         LR    3,13
         A     3,=F'112'
         ST    3,88(13)
         MVC   92(4,13),=A(LC185)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,0(4)
         CLI   0(2),216
         BE    L561
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         L     2,0(7)
         N     2,=F'4'
         L     3,=A(LC189)
         LTR   2,2
         BNE   L563
         L     3,=A(LC169)
L563     EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
L561     EQU   *
         L     2,0(4)
         IC    15,0(2)
         LR    2,15
         N     2,=XL4'000000FF'
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    3,0(2,3)
         N     3,=F'4'
         LTR   3,3
         BE    L564
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         ST    15,176(13)
         L     2,=F'-1'
         CLR   15,2
         L     14,=A(L615)
         BER   14
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         L     2,176(13)
         CR    15,2
         L     14,=A(L615)
         BLR   14
         LR    3,13
         A     3,=F'112'
         ST    3,88(13)
         MVC   92(4,13),0(4)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F56)
         BALR  14,15
         L     15,0(4)
         A     15,176(13)
         ST    15,0(4)
         B     L567
L564     EQU   *
         LA    2,25(,15)
         CLM   2,1,=XL1'01'
         BH    L568
         ST    7,88(13)
         ST    4,92(13)
         LA    2,128(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LR    3,13
         A     3,=F'112'
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F55)
         BALR  14,15
         B     L719
L568     EQU   *
         CLM   15,1,=XL1'A3'
         BNE   L571
         LA    2,144(,13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         ST    7,88(13)
         ST    4,92(13)
         ST    2,96(13)
         ST    3,100(13)
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BE    L534
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         MVC   92(4,13),144(13)
         L     3,148(13)
         S     3,144(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F56)
         BALR  14,15
L719     EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         B     L567
L571     EQU   *
         CLM   15,1,=XL1'D8'
         BNE   L575
         ST    7,88(13)
         ST    4,92(13)
         LR    6,13
         A     6,=F'112'
         ST    6,96(13)
         ST    3,100(13)
         ST    3,104(13)
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BNE   L567
         L     14,=A(L705)
         BR    14
L575     EQU   *
         LR    6,3
         L     14,=A(L705)
         BR    14
L567     EQU   *
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         MVC   92(4,13),=A(LC184)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         LTR   9,9
         BE    L578
         L     3,0(4)
         SLR   2,2
         IC    2,0(3)
         LA    15,195(0,0)
         CR    2,15
         BE    L582
         BH    L584
         LA    15,164(0,0)
         B     L720
L584     EQU   *
         LA    15,229(0,0)
L720     EQU   *
         CLR   2,15
         BNE   L579
L582     EQU   *
         SLR   2,2
         IC    2,0(3)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         LR    8,15
         L     3,0(4)
         A     3,=F'1'
         ST    3,0(4)
L579     EQU   *
         L     2,0(4)
         LR    15,2
         A     15,=F'1'
         ST    15,0(4)
         CLI   0(2),198
         L     14,=A(L615)
         BNER  14
L578     EQU   *
         LTR   9,9
         BE    L588
         ST    7,88(13)
         ST    4,92(13)
         LR    2,13
         A     2,=F'112'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F45)
         BALR  14,15
         LTR   15,15
         BE    L615
L588     EQU   *
         L     2,0(4)
         CLI   0(2),109
         BNE   L615
         A     2,=F'1'
         ST    2,0(4)
         L     2,0(7)
         N     2,=F'2'
         LTR   2,2
         BE    L534
         LTR   8,8
         BE    L534
         L     2,112(13)
         CL    2,116(13)
         BE    L591
         LR    3,13
         A     3,=F'112'
         ST    3,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L591     EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         LR    8,13
         A     8,=F'112'
         ST    8,88(13)
         ST    15,92(13)
L722     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L534
L592     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         B     L534
L595     EQU   *
         L     2,0(7)
         N     2,=F'2'
         LTR   2,2
         BE    L596
         L     2,112(13)
         CL    2,116(13)
         BE    L597
         LR    15,13
         A     15,=F'112'
         ST    15,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
L597     EQU   *
         L     2,0(4)
         SLR   3,3
         IC    3,0(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         LR    8,13
         A     8,=F'112'
         ST    8,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
L596     EQU   *
         L     15,0(4)
         A     15,=F'1'
         ST    15,0(4)
         B     L534
L598     EQU   *
         MVC   188(4,13),=F'1'
L534     EQU   *
         LTR   6,6
         BE    L535
         L     2,188(13)
         LTR   2,2
         BE    L603
L535     EQU   *
         LTR   6,6
         L     14,=A(L604)
         BER   14
         L     3,0(4)
         SLR   2,2
         IC    2,0(3)
         LA    8,216(0,0)
         CR    2,8
         BE    L607
         BH    L704
         LA    15,194(0,0)
         CLR   2,15
         BE    L608
         LA    3,210(0,0)
         CLR   2,3
         BE    L607
         B     L619
L704     EQU   *
         A     2,=F'-231'
         LA    6,1(0,0)
         CLR   2,6
         BH    L619
         B     L613
L607     EQU   *
         ST    7,88(13)
         ST    4,92(13)
         ST    5,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         LR    6,15
         L     14,=A(L604)
         BR    14
L608     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         ST    4,88(13)
         LR    8,13
         A     8,=F'176'
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         LTR   15,15
         BE    L615
         L     3,176(13)
         C     3,20(7)
         BNL   L615
         ST    5,88(13)
         L     2,12(7)
         SLL   3,2
         L     2,0(3,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     14,=A(L604)
         BR    14
L613     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         LR    3,15
         L     15,=F'-1'
         CLR   3,15
         BE    L615
         L     2,64(7)
         LTR   2,2
         BE    L616
         C     3,68(7)
         BNL   L615
L616     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         L     2,=F'-1'
         CLR   15,2
         BNE   L614
L615     EQU   *
         SLR   6,6
         L     14,=A(L705)
         BR    14
L614     EQU   *
         L     2,64(7)
         LTR   2,2
         BE    L617
         ST    5,88(13)
         SLL   3,2
         L     2,0(3,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L618
L617     EQU   *
         ST    5,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F57)
         BALR  14,15
L618     EQU   *
         LA    6,1(0,0)
         L     14,=A(L718)
         BR    14
L619     EQU   *
         SLR   6,6
         LA    9,1(0,0)
         ST    6,184(13)
         MVC   196(4,13),=F'3'
L637     EQU   *
         L     12,0(,10)
         L     3,0(4)
         SLR   2,2
         IC    2,0(3)
         LA    8,209(0,0)
         CR    2,8
         BE    L632
         BH    L635
         LA    15,164(0,0)
         LA    3,195(0,0)
         CLR   2,15
         BNE   L723
         B     L625
L635     EQU   *
         LA    8,228(0,0)
         CR    2,8
         BE    L628
         BH    L636
         LA    15,226(0,0)
         CLR   2,15
         BE    L630
         B     L716
L636     EQU   *
         LA    3,229(0,0)
L723     EQU   *
         CLR   2,3
         BNE   L716
L625     EQU   *
         L     2,0(7)
         N     2,=F'2'
         LTR   2,2
         BE    L626
         L     2,0(5)
         CL    2,4(5)
         BE    L627
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
L627     EQU   *
         L     2,0(4)
         SLR   8,8
         IC    8,0(2)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
L626     EQU   *
         L     15,0(4)
         A     15,=F'1'
         ST    15,0(4)
         B     L620
L628     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L629
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L629     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(LC191)
         B     L724
L630     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L631
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L631     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(LC192)
         B     L724
L632     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L633
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L633     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(LC193)
L724     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L620     EQU   *
         LTR   6,6
         BE    L637
L716     EQU   *
         L     3,0(4)
         SLR   2,2
         IC    2,0(3)
         LA    6,153(0,0)
         CR    2,6
         L     14,=A(L657)
         BER   14
         BH    L693
         LA    8,131(0,0)
         CR    2,8
         L     14,=A(L653)
         BER   14
         BH    L694
         LA    15,109(0,0)
         CR    2,15
         L     14,=A(L717)
         BER   14
         BH    L695
         LTR   2,2
         L     14,=A(L717)
         BER   14
         L     14,=A(L692)
         BR    14
L695     EQU   *
         LA    6,130(0,0)
         CLR   2,6
         L     14,=A(L651)
         BER   14
         L     14,=A(L692)
         BR    14
L694     EQU   *
         LA    8,134(0,0)
         CR    2,8
         L     14,=A(L661)
         BER   14
         BH    L696
         LA    15,132(0,0)
         CLR   2,15
         L     14,=A(L659)
         BER   14
         L     14,=A(L692)
         BR    14
L696     EQU   *
         LA    6,137(0,0)
         CLR   2,6
         L     14,=A(L647)
         BER   14
         LA    8,147(0,0)
         CLR   2,8
         L     14,=A(L645)
         BER   14
         L     14,=A(L692)
         BR    14
L693     EQU   *
         LA    15,167(0,0)
         CR    2,15
         L     14,=A(L643)
         BER   14
         BH    L697
         LA    6,163(0,0)
         CR    2,6
         L     14,=A(L691)
         BER   14
         BH    L698
         LA    8,162(0,0)
         CLR   2,8
         L     14,=A(L649)
         BER   14
         L     14,=A(L692)
         BR    14
L698     EQU   *
         LA    15,165(0,0)
         CLR   2,15
         BE    L641
         LA    6,166(0,0)
         CLR   2,6
         L     14,=A(L655)
         BER   14
         L     14,=A(L692)
         BR    14
L697     EQU   *
         LA    8,201(0,0)
         CR    2,8
         L     14,=A(L665)
         BER   14
         BH    L699
         LA    15,199(0,0)
         CLR   2,15
         L     14,=A(L663)
         BER   14
         L     14,=A(L692)
         BR    14
L699     EQU   *
         A     2,=F'-240'
         LA    3,9(0,0)
         CLR   2,3
         L     14,=A(L692)
         BHR   14
         L     14,=A(L685)
         BR    14
L641     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L642
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L642     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(LC194)
         B     L728
L643     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L644
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L644     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(LC195)
L728     EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     14,=A(L717)
         BR    14
L645     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         L     14,=A(L646)
         BER   14
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L646     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(LC196)
         B     L728
L647     EQU   *
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         L     14,=A(L648)
         BER   14
         B     PGE38
         DS    0F
         LTORG
         DS    0F
PGE38    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG39     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L648     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),=A(LC197)
         L     14,=A(L728)
         BR    14
L649     EQU   *
         L     12,4(,10)
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L650
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L650     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),=A(LC198)
         L     14,=A(L728)
         BR    14
L651     EQU   *
         L     12,4(,10)
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L652
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L652     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),=A(LC199)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         MVC   196(4,13),=F'4'
         B     L717
L653     EQU   *
         L     12,4(,10)
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L654
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L654     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),=A(LC200)
         B     L729
L655     EQU   *
         L     12,4(,10)
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L656
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L656     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),=A(LC201)
L729     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         MVC   196(4,13),=F'5'
         B     L717
L657     EQU   *
         L     12,4(,10)
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L658
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L658     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),=A(LC202)
         B     L730
L659     EQU   *
         L     12,4(,10)
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L660
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L660     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),=A(LC203)
L730     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         MVC   196(4,13),=F'6'
         B     L717
L661     EQU   *
         L     12,4(,10)
         A     3,=F'1'
         ST    3,0(4)
         L     2,0(5)
         CL    2,4(5)
         BE    L662
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L662     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),=A(LC204)
         B     L730
L663     EQU   *
         L     12,4(,10)
         A     3,=F'1'
         ST    3,0(4)
         SLR   6,6
         IC    6,0(3)
         LR    2,6
         AR    2,6
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'4'
         LR    9,2
         LTR   2,2
         BE    L700
L665     EQU   *
         L     12,4(,10)
         L     3,0(4)
         LR    8,3
         A     8,=F'1'
         ST    8,0(4)
         CLI   0(8),109
         BNE   L666
         A     3,=F'2'
         ST    3,0(4)
         SLR   3,3
         L     2,0(4)
         B     L726
L725     EQU   *
         L     12,4(,10)
         SLL   2,24
         SRA   2,24
         C     2,=F'109'
         BE    L668
         L     2,0(4)
         IC    2,0(2)
         STC   2,160(13,3)
         L     15,0(4)
         A     15,=F'1'
         ST    15,0(4)
         A     3,=F'1'
         LA    2,8(0,0)
         CR    3,2
         BH    L668
         LR    2,15
L726     EQU   *
         L     12,4(,10)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L725
L668     EQU   *
         L     12,4(,10)
         L     2,0(4)
         SLR   9,9
         CLI   0(2),109
         BNE   L700
         SLR   6,6
         STC   6,160(13,3)
         L     8,0(4)
         A     8,=F'1'
         ST    8,0(4)
         B     L672
L666     EQU   *
         L     12,4(,10)
         LR    15,13
         A     15,=F'160'
         ST    15,88(13)
         MVC   92(4,13),0(4)
         MVC   96(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(STRNCPY)
         BALR  14,15
         MVI   162(13),0
         L     2,0(4)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    3,2
         A     3,=F'2'
         LA    6,1(0,0)
         CLR   15,6
         BH    L674
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    3,2
         AR    3,15
L674     EQU   *
         L     12,4(,10)
         ST    3,0(4)
L672     EQU   *
         L     12,4(,10)
         LA    3,160(,13)
         ST    3,88(13)
         MVC   92(4,13),=A(LC205)
         LR    8,13
         A     8,=F'184'
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(SSCANF)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(LC206)
         MVC   96(4,13),184(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         L     2,0(5)
         CL    2,4(5)
         BE    L675
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L675     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    3,92(13)
         L     14,=A(L728)
         BR    14
L685     EQU   *
         L     12,4(,10)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@F40)
         BALR  14,15
         LR    8,15
         LA    6,144(,13)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         ST    7,88(13)
         ST    4,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         LTR   15,15
         BE    L686
         ST    7,88(13)
         MVC   92(4,13),144(13)
         L     3,144(13)
         L     2,148(13)
         LR    4,2
         SR    4,3
         CLR   3,2
         BNE   L688
         SLR   4,4
L688     EQU   *
         L     12,4(,10)
         ST    4,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=A(@@F41)
         BALR  14,15
         L     2,0(5)
         CL    2,4(5)
         BE    L689
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L689     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         B     L690
L686     EQU   *
         L     12,4(,10)
         LR    9,15
L690     EQU   *
         L     12,4(,10)
         LR    15,13
         A     15,=F'144'
         ST    15,88(13)
         B     L727
L691     EQU   *
         L     12,4(,10)
         LA    2,128(,13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         ST    7,88(13)
         ST    4,92(13)
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
         LR    9,15
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         ST    2,88(13)
         B     L727
L692     EQU   *
         L     12,4(,10)
         SLR   9,9
         B     L700
L727     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         LTR   9,9
         BE    L700
L717     EQU   *
         L     12,4(,10)
         L     2,196(13)
         B     L702
L700     EQU   *
         L     12,4(,10)
         LR    2,9
L702     EQU   *
         L     12,4(,10)
         LR    6,2
         L     2,192(13)
         LTR   2,2
         BNE   L604
         ST    6,192(13)
L604     EQU   *
         L     12,4(,10)
         LTR   6,6
         BE    L705
L718     EQU   *
         L     12,4(,10)
         L     2,112(13)
         CL    2,116(13)
         BE    L707
         ST    5,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    5,88(13)
         LR    3,13
         A     3,=F'112'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         B     L707
L705     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
L707     EQU   *
         L     12,4(,10)
         LR    8,13
         A     8,=F'112'
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         LR    2,6
         LTR   6,6
         BE    L533
         L     2,192(13)
         LTR   2,2
         BNE   L533
         LA    2,3(0,0)
L533     EQU   *
         L     12,4(,10)
         LR    15,2
* Function do_type epilogue
         PDPEPIL
* Function do_type literal pool
         DS    0F
         LTORG
* Function do_type page table
         DS    0F
PGT38    EQU   *
         DC    A(PG38)
         DC    A(PG39)
LC207    EQU   *
         DC    C'template <'
         DC    X'0'
LC208    EQU   *
         DC    C'class'
         DC    X'0'
LC209    EQU   *
         DC    C'> class'
         DC    X'0'
         DS    0F
* Function demangle_template_template_parm,F15 prologue
@@F15    PDPPRLG CINDEX=40,FRAME=128,BASER=12,ENTRY=NO
         B     FEN40
         LTORG
FEN40    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG40     EQU   *
         LR    11,1
         L     10,=A(PGT40)
* Function demangle_template_template_parm code
         L     8,0(11)
         L     6,4(11)
         L     4,8(11)
         LA    5,1(0,0)
         ST    4,88(13)
         MVC   92(4,13),=A(LC207)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    6,88(13)
         LR    2,13
         A     2,=F'120'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         LTR   15,15
         BE    L732
         SLR   7,7
         C     7,120(13)
         BNL   L732
         B     L736
L748     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(LC130)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L736     EQU   *
         L     2,0(6)
         IC    3,0(2)
         CLM   3,1,=XL1'E9'
         BNE   L737
         A     2,=F'1'
         ST    2,0(6)
         ST    4,88(13)
         MVC   92(4,13),=A(LC208)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L738
L737     EQU   *
         CLM   3,1,=XL1'A9'
         BNE   L739
         A     2,=F'1'
         ST    2,0(6)
         ST    8,88(13)
         ST    6,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         LR    5,15
         B     L749
L739     EQU   *
         ST    8,88(13)
         ST    6,92(13)
         LR    2,13
         A     2,=F'104'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    L743
         ST    4,88(13)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
L743     EQU   *
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
L749     EQU   *
         LTR   5,5
         BE    L732
L738     EQU   *
         A     7,=F'1'
         C     7,120(13)
         BL    L748
L732     EQU   *
         L     2,4(4)
         L     3,=F'-1'
         IC    2,0(3,2)
         CLM   2,1,=XL1'6E'
         BNE   L746
         ST    4,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L746     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(LC209)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         LR    15,5
* Function demangle_template_template_parm epilogue
         PDPEPIL
* Function demangle_template_template_parm literal pool
         DS    0F
         LTORG
* Function demangle_template_template_parm page table
         DS    0F
PGT40    EQU   *
         DC    A(PG40)
LC210    EQU   *
         DC    C'JArray1Z'
         DC    X'0'
         DS    0F
* Function demangle_template,F20 prologue
@@F20    PDPPRLG CINDEX=41,FRAME=160,BASER=12,ENTRY=NO
         B     FEN41
         LTORG
FEN41    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG41     EQU   *
         LR    11,1
         L     10,=A(PGT41)
* Function demangle_template code
         L     9,4(11)
         L     4,12(11)
         MVC   144(4,13),=F'0'
         SLR   5,5
         ST    5,148(13)
         L     3,0(9)
         LR    2,3
         A     2,=F'1'
         ST    2,0(9)
         L     6,16(11)
         LTR   6,6
         BE    L803
         CLI   0(2),169
         BNE   L752
         A     3,=F'3'
         ST    3,0(9)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         LR    3,15
         L     2,=F'-1'
         CLR   15,2
         BE    L754
         L     6,0(11)
         L     2,64(6)
         LTR   2,2
         BE    L755
         C     15,68(6)
         BNL   L754
L755     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         L     2,=F'-1'
         CLR   15,2
         BNE   L753
L754     EQU   *
         SLR   15,15
         L     14,=A(L750)
         BR    14
L753     EQU   *
         L     6,0(11)
         L     2,64(6)
         LTR   2,2
         BE    L756
         MVC   88(4,13),8(11)
         SLL   3,2
         L     2,0(3,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         LTR   4,4
         BE    L803
         ST    4,88(13)
         L     2,64(6)
         L     2,0(3,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L803
L756     EQU   *
         MVC   88(4,13),8(11)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F57)
         BALR  14,15
         LTR   4,4
         BE    L803
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F57)
         BALR  14,15
         B     L803
L752     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         ST    15,136(13)
         LTR   15,15
         L     14,=A(L797)
         BNHR  14
         MVC   88(4,13),0(9)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         C     15,136(13)
         L     14,=A(L797)
         BLR   14
         MVC   148(4,13),144(13)
         L     3,0(11)
         L     2,0(3)
         N     2,=F'4'
         LTR   2,2
         BE    L802
         MVC   88(4,13),0(9)
         MVC   92(4,13),=A(LC210)
         MVC   96(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L802
         MVC   148(4,13),=F'1'
         B     L764
L802     EQU   *
         MVC   88(4,13),8(11)
         MVC   92(4,13),0(9)
         MVC   96(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
L764     EQU   *
         LTR   4,4
         BE    L765
         ST    4,88(13)
         MVC   92(4,13),0(9)
         MVC   96(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
L765     EQU   *
         L     4,0(9)
         A     4,136(13)
         ST    4,0(9)
         L     6,148(13)
         LTR   6,6
         BNE   L766
L803     EQU   *
         MVC   88(4,13),8(11)
         MVC   92(4,13),=A(LC43)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L766     EQU   *
         ST    9,88(13)
         LR    2,13
         A     2,=F'136'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         LTR   15,15
         L     14,=A(L750)
         BER   14
         L     3,16(11)
         LTR   3,3
         BNE   L768
         L     4,136(13)
         SLL   4,2
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     6,0(11)
         ST    15,64(6)
         MVC   68(4,6),136(13)
         MVC   140(4,13),16(11)
         L     2,136(13)
L805     EQU   *
         CR    3,2
         BNL   L768
         MVC   0(4,15),=F'0'
         L     3,140(13)
         A     3,=F'1'
         ST    3,140(13)
         A     15,=F'4'
         B     L805
L768     EQU   *
         MVC   140(4,13),=F'0'
         SLR   4,4
         C     4,136(13)
         BNL   L774
         ST    4,152(13)
         LTR   5,5
         BE    L776
L804     EQU   *
         MVC   88(4,13),8(11)
         MVC   92(4,13),=A(LC130)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L776     EQU   *
         L     2,0(9)
         IC    3,0(2)
         CLM   3,1,=XL1'E9'
         BNE   L777
         A     2,=F'1'
         ST    2,0(9)
         MVC   88(4,13),0(11)
         ST    9,92(13)
         LR    6,13
         A     6,=F'104'
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         ST    15,144(13)
         LTR   15,15
         BE    L778
         MVC   88(4,13),8(11)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         L     3,16(11)
         LTR   3,3
         BNE   L778
         L     3,108(13)
         S     3,104(13)
         L     4,0(11)
         L     2,64(4)
         LR    6,3
         A     6,=F'1'
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     4,152(13)
         ST    15,0(4,2)
         L     6,0(11)
         L     2,64(6)
         L     6,0(4,2)
         LR    7,3
         L     4,104(13)
         LR    5,3
         MVCL  6,4
         L     4,0(11)
         L     2,64(4)
         L     6,152(13)
         L     2,0(6,2)
         IC    4,19(11)
         STC   4,0(2,3)
L778     EQU   *
         LR    6,13
         A     6,=F'104'
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         L     2,144(13)
         LTR   2,2
         BNE   L781
         B     L774
L777     EQU   *
         CLM   3,1,=XL1'A9'
         BNE   L782
         A     2,=F'1'
         ST    2,0(9)
         MVC   88(4,13),0(11)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         ST    15,144(13)
         LTR   15,15
         BE    L783
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BNH   L783
         MVC   88(4,13),0(9)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         CR    15,6
         BL    L783
         MVC   88(4,13),8(11)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         MVC   88(4,13),8(11)
         MVC   92(4,13),0(9)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     3,16(11)
         LTR   3,3
         BNE   L784
         L     4,0(11)
         L     2,64(4)
         LR    3,6
         A     3,=F'1'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     4,152(13)
         ST    15,0(4,2)
         L     3,0(11)
         L     2,64(3)
         L     4,0(4,2)
         LR    5,6
         L     2,0(9)
         LR    3,6
         MVCL  4,2
         L     4,0(11)
         L     2,64(4)
         L     3,152(13)
         L     2,0(3,2)
         IC    4,19(11)
         STC   4,0(2,6)
L784     EQU   *
         A     6,0(9)
         ST    6,0(9)
L783     EQU   *
         L     6,144(13)
         LTR   6,6
         BNE   L781
         B     L774
L782     EQU   *
         MVC   88(4,13),0(11)
         ST    9,92(13)
         LR    2,13
         A     2,=F'104'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         ST    15,144(13)
         LR    3,13
         A     3,=F'104'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         L     4,144(13)
         LTR   4,4
         BE    L774
         L     8,8(11)
         L     6,16(11)
         LTR   6,6
         BNE   L789
         LA    8,120(,13)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
L789     EQU   *
         MVC   88(4,13),0(11)
         ST    9,92(13)
         ST    8,96(13)
         MVC   100(4,13),144(13)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         ST    15,144(13)
         LTR   15,15
         BNE   L790
         L     2,16(11)
         LTR   2,2
         BNE   L774
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         B     L774
L790     EQU   *
         L     3,16(11)
         LTR   3,3
         BNE   L781
         L     3,4(8)
         S     3,0(8)
         L     4,0(11)
         L     2,64(4)
         LR    6,3
         A     6,=F'1'
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     4,152(13)
         ST    15,0(4,2)
         L     6,0(11)
         L     2,64(6)
         L     6,0(4,2)
         LR    7,3
         L     4,0(8)
         LR    5,3
         MVCL  6,4
         L     4,0(11)
         L     2,64(4)
         L     6,152(13)
         L     2,0(6,2)
         IC    4,19(11)
         STC   4,0(2,3)
         MVC   88(4,13),8(11)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
L781     EQU   *
         L     6,140(13)
         A     6,=F'1'
         ST    6,140(13)
         L     2,152(13)
         A     2,=F'4'
         ST    2,152(13)
         C     6,136(13)
         BL    L804
L774     EQU   *
         L     3,148(13)
         LTR   3,3
         BE    L794
         MVC   88(4,13),8(11)
         MVC   92(4,13),=A(LC127)
         B     L806
L794     EQU   *
         L     4,8(11)
         L     2,4(4)
         L     3,=F'-1'
         IC    2,0(3,2)
         CLM   2,1,=XL1'6E'
         BNE   L796
         ST    4,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L796     EQU   *
         MVC   88(4,13),8(11)
         MVC   92(4,13),=A(LC39)
L806     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     6,16(11)
         LTR   6,6
         BE    L797
         L     2,20(11)
         LTR   2,2
         BE    L797
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@F40)
         BALR  14,15
         MVC   88(4,13),0(11)
         L     2,8(11)
         MVC   92(4,13),0(2)
         L     3,0(2)
         L     2,4(2)
         LR    4,2
         SR    4,3
         CLR   3,2
         BNE   L799
         SLR   4,4
L799     EQU   *
         ST    4,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@F41)
         BALR  14,15
L797     EQU   *
         L     15,144(13)
L750     EQU   *
* Function demangle_template epilogue
         PDPEPIL
* Function demangle_template literal pool
         DS    0F
         LTORG
* Function demangle_template page table
         DS    0F
PGT41    EQU   *
         DC    A(PG41)
         DS    0F
* Function demangle_qualified,F30 prologue
@@F30    PDPPRLG CINDEX=42,FRAME=168,BASER=12,ENTRY=NO
         B     FEN42
         LTORG
FEN42    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG42     EQU   *
         LR    11,1
         L     10,=A(PGT42)
* Function demangle_qualified code
         L     9,0(11)
         L     8,4(11)
         MVC   148(4,13),=F'0'
         MVC   152(4,13),=F'1'
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F40)
         BALR  14,15
         ST    15,156(13)
         MVC   160(4,13),148(13)
         L     2,12(11)
         LTR   2,2
         BE    L808
         L     2,40(9)
         N     2,=F'1'
         LTR   2,2
         BNE   L809
         L     2,44(9)
         N     2,=F'1'
         LTR   2,2
         BE    L808
L809     EQU   *
         MVC   160(4,13),152(13)
L808     EQU   *
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         LA    3,128(,13)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         L     3,0(8)
         CLI   0(3),210
         BNE   L810
         A     3,=F'1'
         ST    3,0(8)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         L     4,=F'-1'
         CR    15,4
         BE    L829
         C     15,16(9)
         BNL   L829
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         L     2,8(9)
         SLL   15,2
         L     15,0(15,2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L830
L810     EQU   *
         SLR   2,2
         IC    2,1(3)
         LA    4,109(0,0)
         CR    2,4
         BE    L816
         BL    L829
         A     2,=F'-241'
         LA    4,8(0,0)
         CLR   2,4
         BH    L829
         B     L826
L816     EQU   *
         A     3,=F'1'
         ST    3,0(8)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         ST    15,148(13)
         L     2,=F'-1'
         CLR   15,2
         BNE   L830
         B     L829
L826     EQU   *
         MVC   144(1,13),1(3)
         MVI   145(13),0
         LR    3,13
         A     3,=F'144'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ATOI)
         BALR  14,15
         ST    15,148(13)
         L     2,0(8)
         CLI   2(2),109
         BNE   L827
         A     2,=F'1'
         ST    2,0(8)
L827     EQU   *
         L     4,0(8)
         A     4,=F'2'
         ST    4,0(8)
         B     L830
L829     EQU   *
         MVC   152(4,13),=F'0'
         L     14,=A(L872)
         BR    14
L869     EQU   *
         MVC   152(4,13),=F'0'
         B     L832
L830     EQU   *
         L     2,148(13)
         LR    3,2
         BCTR  3,0
         ST    3,148(13)
         LTR   2,2
         BNH   L832
L856     EQU   *
         LA    4,128(,13)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F50)
         BALR  14,15
         L     2,0(8)
         CLI   0(2),109
         BNE   L833
         A     2,=F'1'
         ST    2,0(8)
L833     EQU   *
         L     3,0(8)
         IC    2,0(3)
         CLM   2,1,=XL1'A3'
         BNE   L834
         ST    9,88(13)
         ST    8,92(13)
         LR    2,13
         A     2,=F'112'
         ST    2,96(13)
         LA    3,128(,13)
         ST    3,100(13)
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
         ST    15,152(13)
         LTR   15,15
         BNE   L871
         B     L832
L834     EQU   *
         CLM   2,1,=XL1'D2'
         BNE   L837
         A     3,=F'1'
         ST    3,0(8)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         L     4,=F'-1'
         CR    15,4
         BE    L839
         C     15,16(9)
         BL    L838
L839     EQU   *
         MVC   152(4,13),=F'0'
         B     L840
L838     EQU   *
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         L     2,8(9)
         SLL   15,2
         L     15,0(15,2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L840     EQU   *
         L     3,152(13)
         LTR   3,3
         BNE   L850
         B     L832
L837     EQU   *
         L     2,0(9)
         N     2,=F'8192'
         LTR   2,2
         BE    L843
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    6,15
         L     4,=F'-1'
         CLR   15,4
         BE    L869
         LR    2,15
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    7,15
         LR    4,15
         LR    5,6
         L     2,0(8)
         LR    3,6
         MVCL  4,2
         SLR   3,3
         STC   3,0(15,6)
         ST    15,88(13)
         MVC   92(4,13),0(9)
         LA    1,88(,13)
         L     15,=A(ZZZ@234)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    L845
         LA    4,112(,13)
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     L846
L845     EQU   *
         LA    2,112(,13)
         ST    2,88(13)
         MVC   92(4,13),0(8)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
L846     EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         A     6,0(8)
         ST    6,0(8)
         B     L871
L843     EQU   *
         LA    3,128(,13)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         ST    9,88(13)
         ST    8,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         ST    15,152(13)
         LTR   15,15
         BE    L832
         LR    4,13
         A     4,=F'112'
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
L871     EQU   *
         ST    9,88(13)
         MVC   92(4,13),112(13)
         L     3,112(13)
         L     2,116(13)
         LR    4,2
         SR    4,3
         CLR   3,2
         BNE   L852
         SLR   4,4
L852     EQU   *
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F39)
         BALR  14,15
L850     EQU   *
         L     2,148(13)
         LTR   2,2
         BNH   L831
         LR    3,13
         A     3,=F'112'
         ST    3,88(13)
         L     2,0(9)
         N     2,=F'4'
         L     3,=A(LC189)
         LTR   2,2
         BNE   L855
         L     3,=A(LC169)
L855     EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L831     EQU   *
         L     2,148(13)
         LR    4,2
         BCTR  4,0
         ST    4,148(13)
         LTR   2,2
         BH    L856
L832     EQU   *
         ST    9,88(13)
         MVC   92(4,13),112(13)
         L     3,112(13)
         L     2,116(13)
         LR    4,2
         SR    4,3
         CLR   3,2
         BNE   L858
         SLR   4,4
L858     EQU   *
         ST    4,96(13)
         MVC   100(4,13),156(13)
         LA    1,88(,13)
         L     15,=A(@@F41)
         BALR  14,15
         L     2,160(13)
         LTR   2,2
         BE    L859
         LR    3,13
         A     3,=F'112'
         ST    3,88(13)
         L     2,0(9)
         N     2,=F'4'
         L     3,=A(LC189)
         LTR   2,2
         BNE   L861
         L     3,=A(LC169)
L861     EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,44(9)
         N     2,=F'1'
         LTR   2,2
         BE    L862
         LR    4,13
         A     4,=F'112'
         ST    4,88(13)
         MVC   92(4,13),=A(LC103)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L862     EQU   *
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         LR    3,13
         A     3,=F'128'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
L859     EQU   *
         L     2,16(11)
         LTR   2,2
         BE    L863
         MVC   88(4,13),8(11)
         LR    4,13
         A     4,=F'112'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         B     L864
L863     EQU   *
         L     3,8(11)
         L     2,0(3)
         CL    2,4(3)
         BE    L865
         LR    4,13
         A     4,=F'112'
         ST    4,88(13)
         L     2,0(9)
         N     2,=F'4'
         L     3,=A(LC189)
         LTR   2,2
         BNE   L867
         L     3,=A(LC169)
L867     EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L865     EQU   *
         MVC   88(4,13),8(11)
         LR    2,13
         A     2,=F'112'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F55)
         BALR  14,15
L864     EQU   *
         LR    3,13
         A     3,=F'128'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         LR    4,13
         A     4,=F'112'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
L872     EQU   *
         L     15,152(13)
* Function demangle_qualified epilogue
         PDPEPIL
* Function demangle_qualified literal pool
         DS    0F
         LTORG
* Function demangle_qualified page table
         DS    0F
PGT42    EQU   *
         DC    A(PG42)
LC211    EQU   *
         DC    C'%d'
         DC    X'0'
LC212    EQU   *
         DC    C''''
         DC    X'0'
LC213    EQU   *
         DC    C'false'
         DC    X'0'
LC214    EQU   *
         DC    C'true'
         DC    X'0'
LC215    EQU   *
         DC    C'e'
         DC    X'0'
LC216    EQU   *
         DC    C'0'
         DC    X'0'
         DS    0F
* Function demangle_template_value_parm,F19 prologue
@@F19    PDPPRLG CINDEX=43,FRAME=152,BASER=12,ENTRY=NO
         B     FEN43
         LTORG
FEN43    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG43     EQU   *
         LR    11,1
         L     10,=A(PGT43)
* Function demangle_template_value_parm code
         L     9,0(11)
         L     4,4(11)
         L     7,8(11)
         L     6,12(11)
         LA    8,1(0,0)
         L     2,0(4)
         IC    15,0(2)
         CLM   15,1,=XL1'E8'
         BNE   L874
         AR    2,8
         ST    2,0(4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         LR    3,15
         L     2,=F'-1'
         CLR   15,2
         BE    L876
         L     2,64(9)
         LTR   2,2
         BE    L877
         C     15,68(9)
         BNL   L876
L877     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         L     2,=F'-1'
         CLR   15,2
         BNE   L875
L876     EQU   *
         L     15,=F'-1'
         L     14,=A(L873)
         BR    14
L875     EQU   *
         L     2,64(9)
         LTR   2,2
         BE    L878
         ST    7,88(13)
         SLL   3,2
         L     3,0(3,2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     14,=A(L880)
         BR    14
L878     EQU   *
         ST    7,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F57)
         BALR  14,15
         L     14,=A(L880)
         BR    14
L874     EQU   *
         LA    3,3(0,0)
         CLR   6,3
         BNE   L881
         CLM   15,1,=XL1'C5'
         BNE   L882
         ST    9,88(13)
         ST    4,92(13)
         ST    7,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
         B     L941
L882     EQU   *
         CLM   15,1,=XL1'D8'
         BE    L885
         CLM   15,1,=XL1'D2'
         BNE   L884
L885     EQU   *
         ST    9,88(13)
         ST    4,92(13)
         ST    7,96(13)
         MVC   100(4,13),=F'0'
         ST    8,104(13)
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
L941     EQU   *
         LR    3,15
         B     L883
L884     EQU   *
         SLR   5,5
         LR    6,5
         LR    3,5
         CLM   15,1,=XL1'6D'
         BNE   L887
         CLI   1(2),148
         BNE   L888
         LR    6,8
         ST    7,88(13)
         MVC   92(4,13),=A(LC50)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     8,0(4)
         A     8,=F'2'
         ST    8,0(4)
         B     L939
L887     EQU   *
         CLM   15,1,=XL1'94'
         BNE   L891
         ST    7,88(13)
         MVC   92(4,13),=A(LC50)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     9,0(4)
         A     9,=F'1'
         ST    9,0(4)
L891     EQU   *
         LR    5,8
         LR    6,8
L939     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         B     L940
L888     EQU   *
         LR    5,8
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
L940     EQU   *
         LR    2,15
         L     8,=F'-1'
         CLR   15,8
         BE    L883
         LR    9,13
         A     9,=F'112'
         ST    9,88(13)
         MVC   92(4,13),=A(LC211)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    7,88(13)
         LR    3,13
         A     3,=F'112'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         LA    8,9(0,0)
         CR    2,8
         BH    L896
         LTR   6,6
         BE    L895
L896     EQU   *
         LTR   5,5
         BNE   L895
         L     2,0(4)
         CLI   0(2),109
         BNE   L895
         A     2,=F'1'
         ST    2,0(4)
L895     EQU   *
         LA    3,1(0,0)
L883     EQU   *
         LR    8,3
         L     14,=A(L880)
         BR    14
L881     EQU   *
         LA    2,5(0,0)
         CLR   6,2
         BNE   L899
         CLM   15,1,=XL1'94'
         BNE   L900
         ST    7,88(13)
         MVC   92(4,13),=A(LC50)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     3,0(4)
         A     3,=F'1'
         ST    3,0(4)
L900     EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(LC212)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LTR   15,15
         BNH   L907
         STC   15,144(13)
         MVI   145(13),0
         ST    7,88(13)
         LR    9,13
         A     9,=F'144'
         ST    9,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(LC212)
         ST    8,96(13)
         B     L946
L899     EQU   *
         LA    2,4(0,0)
         CLR   6,2
         BNE   L904
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LTR   15,15
         BNE   L905
         ST    7,88(13)
         MVC   92(4,13),=A(LC213)
         MVC   96(4,13),=F'5'
         B     L946
L905     EQU   *
         LA    3,1(0,0)
         CLR   15,3
         BNE   L907
         ST    7,88(13)
         MVC   92(4,13),=A(LC214)
         ST    6,96(13)
L946     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         B     L880
L907     EQU   *
         SLR   8,8
         B     L880
L904     EQU   *
         LA    2,6(0,0)
         CLR   6,2
         BNE   L910
         CLM   15,1,=XL1'C5'
         BNE   L911
         ST    9,88(13)
         ST    4,92(13)
         ST    7,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
         B     L945
L911     EQU   *
         CLM   15,1,=XL1'94'
         BNE   L913
         ST    7,88(13)
         MVC   92(4,13),=A(LC50)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     3,0(4)
         A     3,=F'1'
         ST    3,0(4)
L913     EQU   *
         L     3,=V(ZZZ@2096)
         L     15,0(4)
L942     EQU   *
         SLR   2,2
         IC    2,0(15)
         AR    2,2
         LH    2,0(2,3)
         N     2,=F'4'
         LTR   2,2
         BE    L936
         ST    7,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     8,0(4)
         A     8,=F'1'
         ST    8,0(4)
         LR    15,8
         B     L942
L936     EQU   *
         L     2,0(4)
         CLI   0(2),75
         BNE   L917
         ST    7,88(13)
         MVC   92(4,13),=A(LC189)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     9,0(4)
         A     9,=F'1'
         ST    9,0(4)
         L     3,=V(ZZZ@2096)
         LR    15,9
L943     EQU   *
         SLR   2,2
         IC    2,0(15)
         AR    2,2
         LH    2,0(2,3)
         N     2,=F'4'
         LTR   2,2
         BE    L917
         ST    7,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     2,0(4)
         A     2,=F'1'
         ST    2,0(4)
         LR    15,2
         B     L943
L917     EQU   *
         L     2,0(4)
         CLI   0(2),133
         BNE   L921
         ST    7,88(13)
         MVC   92(4,13),=A(LC215)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     3,0(4)
         A     3,=F'1'
         ST    3,0(4)
         L     3,=V(ZZZ@2096)
         L     15,0(4)
L944     EQU   *
         SLR   2,2
         IC    2,0(15)
         AR    2,2
         LH    2,0(2,3)
         N     2,=F'4'
         LTR   2,2
         BE    L921
         ST    7,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     8,0(4)
         A     8,=F'1'
         ST    8,0(4)
         LR    15,8
         B     L944
L921     EQU   *
         LA    15,1(0,0)
         B     L945
L910     EQU   *
         LR    2,6
         BCTR  2,0
         LA    3,1(0,0)
         CLR   2,3
         BH    L880
         CLM   15,1,=XL1'D8'
         BNE   L927
         ST    9,88(13)
         ST    4,92(13)
         ST    7,96(13)
         MVC   100(4,13),=F'0'
         ST    8,104(13)
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
L945     EQU   *
         LR    8,15
         B     L880
L927     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    3,15
         L     2,=F'-1'
         CLR   3,2
         BE    L873
         LTR   3,3
         BNE   L930
         ST    7,88(13)
         MVC   92(4,13),=A(LC216)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         B     L931
L930     EQU   *
         LR    2,3
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    5,15
         ST    15,88(13)
         MVC   92(4,13),0(4)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCPY)
         BALR  14,15
         SLR   2,2
         STC   2,0(5,3)
         ST    5,88(13)
         MVC   92(4,13),0(9)
         LA    1,88(,13)
         L     15,=A(ZZZ@234)
         BALR  14,15
         LR    2,15
         LA    9,1(0,0)
         CLR   6,9
         BNE   L932
         ST    7,88(13)
         MVC   92(4,13),=A(LC98)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
L932     EQU   *
         LTR   2,2
         BE    L933
         ST    7,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     L934
L933     EQU   *
         ST    7,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L934     EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L931     EQU   *
         A     3,0(4)
         ST    3,0(4)
L880     EQU   *
         LR    15,8
L873     EQU   *
* Function demangle_template_value_parm epilogue
         PDPEPIL
* Function demangle_template_value_parm literal pool
         DS    0F
         LTORG
* Function demangle_template_value_parm page table
         DS    0F
PGT43    EQU   *
         DC    A(PG43)
         DS    0F
* Function demangle_expression,F16 prologue
@@F16    PDPPRLG CINDEX=44,FRAME=120,BASER=12,ENTRY=NO
         B     FEN44
         LTORG
FEN44    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG44     EQU   *
         LR    11,1
         L     10,=A(PGT44)
* Function demangle_expression code
         L     9,4(11)
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'1'
         MVC   88(4,13),8(11)
         MVC   92(4,13),=A(LC184)
         MVC   96(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     2,0(9)
         A     2,=F'1'
         ST    2,0(9)
         B     L966
L965     EQU   *
         CLM   2,1,=XL1'00'
         BE    L949
         L     4,104(13)
         LTR   4,4
         BE    L950
         MVC   108(4,13),=F'0'
         MVC   88(4,13),0(9)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    15,116(13)
         MVC   112(4,13),108(13)
         L     3,108(13)
L955     EQU   *
         L     2,=A(@@V2)
         L     4,0(3,2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    8,15
         CL    15,116(13)
         BH    L953
         LR    6,4
         LR    7,15
         L     4,0(9)
         LR    5,15
         LA    2,1(0,0)
         CLCL  6,4
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BE    L963
L953     EQU   *
         L     2,112(13)
         A     2,=F'1'
         ST    2,112(13)
         A     3,=F'12'
         LA    4,78(0,0)
         CLR   2,4
         BNH   L955
         B     L949
L963     EQU   *
         MVC   88(4,13),8(11)
         MVC   92(4,13),=A(LC190)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         MVC   88(4,13),8(11)
         A     3,=A(@@V2+4)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         MVC   88(4,13),8(11)
         MVC   92(4,13),=A(LC190)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         A     8,0(9)
         ST    8,0(9)
         B     L957
L950     EQU   *
         MVC   104(4,13),=F'1'
L957     EQU   *
         MVC   88(4,13),0(11)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         ST    15,108(13)
         LTR   15,15
         BE    L949
         L     2,0(9)
L966     EQU   *
         IC    2,0(2)
         CLM   2,1,=XL1'E6'
         BNE   L965
L949     EQU   *
         L     2,0(9)
         CLI   0(2),230
         BE    L959
         MVC   108(4,13),=F'0'
         B     L960
L959     EQU   *
         MVC   88(4,13),8(11)
         MVC   92(4,13),=A(LC185)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         L     2,0(9)
         A     2,=F'1'
         ST    2,0(9)
L960     EQU   *
         L     15,108(13)
* Function demangle_expression epilogue
         PDPEPIL
* Function demangle_expression literal pool
         DS    0F
         LTORG
* Function demangle_expression page table
         DS    0F
PGT44    EQU   *
         DC    A(PG44)
         DS    0F
* Function do_arg,F37 prologue
@@F37    PDPPRLG CINDEX=45,FRAME=104,BASER=12,ENTRY=NO
         B     FEN45
         LTORG
FEN45    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG45     EQU   *
         LR    11,1
         L     10,=A(PGT45)
* Function do_arg code
         L     3,0(11)
         L     4,4(11)
         L     5,8(11)
L984     EQU   *
         L     6,0(4)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         L     2,80(3)
         LTR   2,2
         BNH   L968
         BCTR  2,0
         ST    2,80(3)
         L     2,76(3)
         LR    15,2
         LTR   2,2
         BE    L967
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         B     L983
L968     EQU   *
         L     2,0(4)
         CLI   0(2),149
         BNE   L970
         A     2,=F'1'
         ST    2,0(4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         ST    15,80(3)
         LTR   15,15
         BNH   L982
         LA    2,9(0,0)
         CR    15,2
         BNH   L984
         L     2,0(4)
         CLI   0(2),109
         BE    L973
L982     EQU   *
         SLR   15,15
         B     L967
L973     EQU   *
         A     2,=F'1'
         ST    2,0(4)
         B     L984
L970     EQU   *
         L     2,76(3)
         LTR   2,2
         BE    L976
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         B     L977
L976     EQU   *
         MVC   88(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,76(3)
L977     EQU   *
         ST    3,88(13)
         ST    4,92(13)
         MVC   96(4,13),76(3)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LTR   15,15
         BE    L967
         ST    5,88(13)
         MVC   92(4,13),76(3)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         ST    3,88(13)
         ST    6,92(13)
         L     4,0(4)
         SR    4,6
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F38)
         BALR  14,15
L983     EQU   *
         LA    15,1(0,0)
L967     EQU   *
* Function do_arg epilogue
         PDPEPIL
* Function do_arg literal pool
         DS    0F
         LTORG
* Function do_arg page table
         DS    0F
PGT45    EQU   *
         DC    A(PG45)
LC217    EQU   *
         DC    C'...'
         DC    X'0'
         DS    0F
* Function demangle_args,F44 prologue
@@F44    PDPPRLG CINDEX=46,FRAME=136,BASER=12,ENTRY=NO
         B     FEN46
         LTORG
FEN46    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG46     EQU   *
         LR    11,1
         L     10,=A(PGT46)
* Function demangle_args code
         L     4,0(11)
         L     5,4(11)
         L     6,8(11)
         SLR   7,7
         L     2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L1031
         ST    6,88(13)
         MVC   92(4,13),=A(LC184)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,0(5)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L1031
         ST    6,88(13)
         MVC   92(4,13),=A(LC194)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L1031
L1017    EQU   *
         IC    2,0(3)
         CLM   2,1,=XL1'D5'
         BE    L993
         CLM   2,1,=XL1'E3'
         BNE   L992
L993     EQU   *
         L     2,0(5)
         A     2,=F'1'
         ST    2,0(5)
         CLI   0(3),213
         BNE   L994
         ST    5,88(13)
         LR    3,13
         A     3,=F'120'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         LTR   15,15
         BNE   L996
         B     L985
L994     EQU   *
         MVC   120(4,13),=F'1'
L996     EQU   *
         L     3,0(4)
         LR    2,3
         N     2,=F'4096'
         LTR   2,2
         BNE   L998
         LR    2,3
         N     2,=F'2048'
         LTR   2,2
         BNE   L998
         N     3,=F'8192'
         LTR   3,3
         BE    L997
L998     EQU   *
         L     2,32(4)
         LA    3,9(0,0)
         CR    2,3
         BNH   L997
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         ST    15,124(13)
         LTR   15,15
         BH    L1000
         B     L1005
L997     EQU   *
         ST    5,88(13)
         LR    2,13
         A     2,=F'124'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         LTR   15,15
         BE    L985
L1000    EQU   *
         L     3,0(4)
         LR    2,3
         N     2,=F'1024'
         LTR   2,2
         BNE   L1003
         LR    2,3
         N     2,=F'2048'
         LTR   2,2
         BNE   L1003
         LR    2,3
         N     2,=F'4096'
         LTR   2,2
         BNE   L1003
         N     3,=F'8192'
         LTR   3,3
         BE    L1002
L1003    EQU   *
         L     3,124(13)
         BCTR  3,0
         ST    3,124(13)
L1002    EQU   *
         L     2,124(13)
         LTR   2,2
         BL    L1005
         C     2,32(4)
         BL    L1004
L1005    EQU   *
         SLR   15,15
         B     L985
L1004    EQU   *
         L     2,80(4)
         LTR   2,2
         BH    L1028
         L     2,120(13)
         LR    3,2
         BCTR  3,0
         ST    3,120(13)
         LTR   3,3
         BL    L1031
L1028    EQU   *
         L     3,4(4)
         L     2,124(13)
         SLL   2,2
         L     3,0(2,3)
         ST    3,128(13)
         LTR   7,7
         BE    L1009
         L     2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L1009
         ST    6,88(13)
         MVC   92(4,13),=A(LC130)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L1009    EQU   *
         ST    4,88(13)
         LR    2,13
         A     2,=F'128'
         ST    2,92(13)
         LR    3,13
         A     3,=F'104'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F37)
         BALR  14,15
         LTR   15,15
         BE    L985
         L     2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L1011
         ST    6,88(13)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
L1011    EQU   *
         LR    3,13
         A     3,=F'104'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         LA    7,1(0,0)
         B     L1004
L992     EQU   *
         LTR   7,7
         BE    L1014
         L     2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L1014
         ST    6,88(13)
         MVC   92(4,13),=A(LC130)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L1014    EQU   *
         ST    4,88(13)
         ST    5,92(13)
         LR    2,13
         A     2,=F'104'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F37)
         BALR  14,15
         LTR   15,15
         BE    L985
         L     2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L1016
         ST    6,88(13)
         LR    3,13
         A     3,=F'104'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
L1016    EQU   *
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         LA    7,1(0,0)
L1031    EQU   *
         L     3,0(5)
         IC    2,0(3)
         CLM   2,1,=XL1'6D'
         BE    L991
         CLM   2,1,=XL1'00'
         BE    L991
         SLL   2,24
         SRA   2,24
         C     2,=F'-123'
         BNE   L1017
L991     EQU   *
         L     2,80(4)
         LTR   2,2
         BH    L1017
         CLI   0(3),133
         BNE   L1018
         A     3,=F'1'
         ST    3,0(5)
         L     2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L1018
         LTR   7,7
         BE    L1020
         ST    6,88(13)
         MVC   92(4,13),=A(LC179)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L1020    EQU   *
         ST    6,88(13)
         MVC   92(4,13),=A(LC217)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L1018    EQU   *
         L     2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L1021
         ST    6,88(13)
         MVC   92(4,13),=A(LC185)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L1021    EQU   *
         LA    15,1(0,0)
L985     EQU   *
* Function demangle_args epilogue
         PDPEPIL
* Function demangle_args literal pool
         DS    0F
         LTORG
* Function demangle_args page table
         DS    0F
PGT46    EQU   *
         DC    A(PG46)
         DS    0F
* Function demangle_nested_args,F45 prologue
@@F45    PDPPRLG CINDEX=47,FRAME=104,BASER=12,ENTRY=NO
         B     FEN47
         LTORG
FEN47    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG47     EQU   *
         LR    11,1
         L     10,=A(PGT47)
* Function demangle_nested_args code
         L     2,0(11)
         L     3,72(2)
         A     3,=F'1'
         ST    3,72(2)
         L     4,76(2)
         L     5,80(2)
         MVC   76(4,2),=F'0'
         MVC   80(4,2),=F'0'
         ST    2,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@F44)
         BALR  14,15
         LR    3,15
         L     15,76(2)
         LTR   15,15
         BE    L1033
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         MVC   88(4,13),76(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L1033    EQU   *
         ST    4,76(2)
         L     4,72(2)
         BCTR  4,0
         ST    4,72(2)
         ST    5,80(2)
         LR    15,3
* Function demangle_nested_args epilogue
         PDPEPIL
* Function demangle_nested_args literal pool
         DS    0F
         LTORG
* Function demangle_nested_args page table
         DS    0F
PGT47    EQU   *
         DC    A(PG47)
         DS    0F
* X-func ZZZ_247 prologue
ZZZ@247  PDPPRLG CINDEX=48,FRAME=224,BASER=12,ENTRY=YES
         B     FEN48
         LTORG
FEN48    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG48     EQU   *
         LR    11,1
         L     10,=A(PGT48)
* Function ZZZ_247 code
         L     8,0(11)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    15,212(13)
         L     2,4(11)
         MVI   0(2),0
         MVC   216(4,13),=F'0'
         LA    6,120(,13)
         ST    6,88(13)
         MVC   92(4,13),216(13)
         MVC   96(4,13),=F'84'
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         MVC   120(4,13),8(11)
         IC    5,0(8)
         CLM   5,1,=XL1'6D'
         BNE   L1038
         CLI   1(8),109
         BNE   L1077
         CLI   2(8),150
         BNE   L1077
         CLI   3(8),151
         BNE   L1077
         A     8,=F'4'
         B     L1081
L1077    EQU   *
         CLI   1(8),109
         BNE   L1038
         L     4,=V(ZZZ@2096)
         IC    3,2(8)
         LR    2,3
         N     2,=XL4'000000FF'
         AR    2,2
         LH    2,0(2,4)
         N     2,=F'8'
         LTR   2,2
         BE    L1038
         SLR   2,2
         IC    2,3(8)
         AR    2,2
         LH    2,0(2,4)
         N     2,=F'8'
         LTR   2,2
         BE    L1038
         IC    2,4(8)
         CLM   2,1,=XL1'00'
         BNE   L1039
         SLR   3,3
         LR    4,3
L1044    EQU   *
         L     2,=A(@@V2)
         L     5,0(4,2)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    5,2(0,0)
         CLR   15,5
         BNE   L1042
         L     2,0(4,2)
         CLC   0(2,2),2(8)
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BE    L1074
L1042    EQU   *
         A     3,=F'1'
         A     4,=F'12'
         LA    2,78(0,0)
         CLR   3,2
         BNH   L1044
         B     L1037
L1074    EQU   *
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(LC158)
         LA    1,88(,13)
         L     15,=V(STRCAT)
         BALR  14,15
         MVC   88(4,13),4(11)
         A     4,=A(@@V2+4)
         MVC   92(4,13),0(4)
         B     L1080
L1039    EQU   *
         CLM   3,1,=XL1'81'
         BNE   L1037
         IC    2,5(8)
         CLM   2,1,=XL1'00'
         BNE   L1037
         SLR   3,3
         LR    4,3
L1051    EQU   *
         L     2,=A(@@V2)
         L     5,0(4,2)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    5,3(0,0)
         CLR   15,5
         BNE   L1049
         L     2,0(4,2)
         CLC   0(3,2),2(8)
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BE    L1074
L1049    EQU   *
         A     3,=F'1'
         A     4,=F'12'
         LA    2,78(0,0)
         CLR   3,2
         BNH   L1051
         B     L1037
L1075    EQU   *
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(LC158)
         LA    1,88(,13)
         L     15,=V(STRCAT)
         BALR  14,15
         MVC   88(4,13),4(11)
         A     3,=A(@@V2+4)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(STRCAT)
         BALR  14,15
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(LC31)
L1080    EQU   *
         LA    1,88(,13)
         L     15,=V(STRCAT)
         BALR  14,15
         B     L1078
L1038    EQU   *
         L     2,212(13)
         LA    3,2(0,0)
         CR    2,3
         BNH   L1053
         CLM   5,1,=XL1'96'
         BNE   L1053
         CLI   1(8),151
         BNE   L1053
         MVC   88(4,13),=A(@@V1)
         SLR   3,3
         IC    3,2(8)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L1053
         LA    5,9(0,0)
         CR    2,5
         BNH   L1054
         L     2,=A(LC157)
         CLC   3(7,8),0(2)
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BNE   L1054
         LR    9,2
         LR    3,2
L1059    EQU   *
         L     2,212(13)
         A     2,=F'-10'
         L     4,=A(@@V2)
         L     5,0(3,4)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         CLR   15,2
         BNE   L1057
         LR    6,5
         LR    7,2
         LR    4,8
         A     4,=F'10'
         LR    5,2
         LA    2,1(0,0)
         CLCL  6,4
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BE    L1075
L1057    EQU   *
         A     9,=F'1'
         A     3,=F'12'
         LA    2,78(0,0)
         CLR   9,2
         BNH   L1059
         B     L1037
L1076    EQU   *
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(LC158)
         LA    1,88(,13)
         L     15,=V(STRCAT)
         BALR  14,15
         MVC   88(4,13),4(11)
         A     3,=A(@@V2+4)
         MVC   92(4,13),0(3)
         B     L1080
L1054    EQU   *
         SLR   9,9
         LR    3,9
L1065    EQU   *
         L     2,212(13)
         A     2,=F'-3'
         L     4,=A(@@V2)
         L     5,0(3,4)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         CLR   15,2
         BNE   L1063
         LR    6,5
         LR    7,2
         LR    4,8
         A     4,=F'3'
         LR    5,2
         LA    2,1(0,0)
         CLCL  6,4
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BE    L1076
L1063    EQU   *
         A     9,=F'1'
         A     3,=F'12'
         LA    2,78(0,0)
         CLR   9,2
         BNH   L1065
         B     L1037
L1053    EQU   *
         L     5,212(13)
         LA    3,4(0,0)
         CR    5,3
         BNH   L1037
         L     2,=A(LC159)
         CLC   0(4,8),0(2)
         BH    *+12
         BL    *+6
         SLR   2,2
         LNR   2,2
         LTR   2,2
         BNE   L1037
         MVC   88(4,13),=A(@@V1)
         SLR   2,2
         IC    2,4(8)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L1037
         A     8,=F'5'
L1081    EQU   *
         ST    8,208(13)
         ST    6,88(13)
         LR    3,13
         A     3,=F'208'
         ST    3,92(13)
         LR    5,13
         A     5,=F'104'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LTR   15,15
         BE    L1037
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(LC160)
         LA    1,88(,13)
         L     15,=V(STRCAT)
         BALR  14,15
         MVC   88(4,13),4(11)
         MVC   92(4,13),104(13)
         L     2,108(13)
         S     2,104(13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCAT)
         BALR  14,15
         LR    3,13
         A     3,=F'104'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
L1078    EQU   *
         MVC   216(4,13),=F'1'
L1037    EQU   *
         LR    5,13
         A     5,=F'120'
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         L     15,216(13)
* Function ZZZ_247 epilogue
         PDPEPIL
* Function ZZZ_247 literal pool
         DS    0F
         LTORG
* Function ZZZ_247 page table
         DS    0F
PGT48    EQU   *
         DC    A(PG48)
LC218    EQU   *
         DC    C' static'
         DC    X'0'
         DS    0F
* Function demangle_signature,F14 prologue
@@F14    PDPPRLG CINDEX=49,FRAME=208,BASER=12,ENTRY=NO
         B     FEN49
         LTORG
FEN49    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG49     EQU   *
         LR    11,1
         L     10,=A(PGT49)
* Function demangle_signature code
         L     5,0(11)
         L     6,4(11)
         L     8,8(11)
         LA    7,1(0,0)
         MVC   192(4,13),=F'0'
         MVC   196(4,13),192(13)
         MVC   200(4,13),192(13)
         MVC   204(4,13),192(13)
         L     2,0(6)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         L     14,=A(L1191)
         BER   14
L1179    EQU   *
         L     12,0(,10)
         L     4,0(6)
         IC    3,0(4)
         LR    2,3
         N     2,=XL4'000000FF'
         LA    9,200(0,0)
         CR    2,9
         L     14,=A(L1162)
         BER   14
         BH    L1171
         LA    15,164(0,0)
         CR    2,15
         BE    L1097
         BH    L1172
         LA    3,109(0,0)
         CLR   2,3
         L     14,=A(L1152)
         BER   14
         LA    9,163(0,0)
         CLR   2,9
         L     14,=A(L1144)
         BER   14
         L     14,=A(L1167)
         BR    14
L1172    EQU   *
         LA    15,195(0,0)
         CR    2,15
         BE    L1097
         BH    L1173
         LA    3,194(0,0)
         CLR   2,3
         BE    L1135
         L     14,=A(L1167)
         BR    14
L1173    EQU   *
         LA    9,198(0,0)
         CLR   2,9
         BE    L1139
         L     14,=A(L1167)
         BR    14
L1171    EQU   *
         LA    15,226(0,0)
         CR    2,15
         BE    L1093
         BH    L1174
         LA    9,211(0,0)
         CR    2,9
         BE    L1099
         BH    L1175
         LA    15,210(0,0)
         CLR   2,15
         BE    L1090
         L     14,=A(L1167)
         BR    14
L1175    EQU   *
         LA    3,216(0,0)
         CLR   2,3
         BE    L1086
         L     14,=A(L1167)
         BR    14
L1174    EQU   *
         LA    9,229(0,0)
         CR    2,9
         BE    L1097
         L     14,=A(L1167)
         BLR   14
         A     2,=F'-240'
         LA    15,9(0,0)
         CLR   2,15
         L     14,=A(L1167)
         BHR   14
         B     L1116
L1086    EQU   *
         ST    5,88(13)
         ST    6,92(13)
         ST    8,96(13)
         MVC   100(4,13),=F'1'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BE    L1198
         ST    5,88(13)
         ST    4,92(13)
         L     2,0(6)
         SR    2,4
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F38)
         BALR  14,15
         B     L1198
L1090    EQU   *
         ST    5,88(13)
         ST    6,92(13)
         ST    8,96(13)
         MVC   100(4,13),=F'1'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         LR    7,15
L1198    EQU   *
         L     3,0(5)
         LR    2,3
         N     2,=F'256'
         LTR   2,2
         BNE   L1195
         N     3,=F'512'
         LTR   3,3
         BE    L1132
         B     L1195
L1093    EQU   *
         L     3,204(13)
         LTR   3,3
         BNE   L1094
         ST    4,204(13)
L1094    EQU   *
         A     4,=F'1'
         ST    4,0(6)
         MVC   48(4,5),=F'1'
         L     14,=A(L1085)
         BR    14
L1097    EQU   *
         SLR   9,9
         IC    9,0(4)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         O     15,56(5)
         ST    15,56(5)
         L     15,204(13)
         LTR   15,15
         BNE   L1098
         MVC   204(4,13),0(6)
L1098    EQU   *
         L     2,0(6)
         A     2,=F'1'
         ST    2,0(6)
         L     14,=A(L1085)
         BR    14
L1099    EQU   *
         L     2,0(5)
         N     2,=F'4096'
         LTR   2,2
         L     14,=A(L1157)
         BER   14
         CLM   3,1,=XL1'00'
         BE    L1102
         CLM   3,1,=XL1'6D'
         BE    L1102
L1103    EQU   *
         L     3,0(6)
         A     3,=F'1'
         ST    3,0(6)
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    L1102
         CLM   2,1,=XL1'6D'
         BNE   L1103
L1102    EQU   *
         L     3,0(6)
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BNE   L1104
         SLR   7,7
         L     14,=A(L1183)
         BR    14
L1104    EQU   *
         A     3,=F'1'
         ST    3,0(6)
         L     14,=A(L1085)
         BR    14
L1116    EQU   *
         L     9,204(13)
         LTR   9,9
         BNE   L1117
         ST    4,204(13)
L1117    EQU   *
         MVC   52(4,5),=F'-1'
         SLR   2,2
         LA    7,144(,13)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F40)
         BALR  14,15
         LR    9,15
         ST    5,88(13)
         ST    6,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         LTR   15,15
         BE    L1118
         L     4,148(13)
         L     2,40(5)
         N     2,=F'1'
         LTR   2,2
         BNE   L1120
         L     2,44(5)
         N     2,=F'1'
         LTR   2,2
         BE    L1119
L1120    EQU   *
         L     3,52(5)
         LR    2,3
         A     2,=F'1'
         LA    15,1(0,0)
         CLR   2,15
         BNH   L1121
         A     3,144(13)
         ST    3,148(13)
L1121    EQU   *
         ST    8,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@F55)
         BALR  14,15
         L     2,44(5)
         N     2,=F'1'
         LTR   2,2
         BE    L1122
         ST    8,88(13)
         MVC   92(4,13),=A(LC103)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         L     2,44(5)
         BCTR  2,0
         ST    2,44(5)
         B     L1119
L1122    EQU   *
         L     3,40(5)
         BCTR  3,0
         ST    3,40(5)
L1119    EQU   *
         ST    4,148(13)
         ST    5,88(13)
         MVC   92(4,13),144(13)
         L     2,144(13)
         LR    3,4
         SR    3,2
         CLR   2,4
         BNE   L1125
         SLR   3,3
L1125    EQU   *
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F39)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),144(13)
         L     3,144(13)
         L     2,148(13)
         LR    15,2
         SR    15,3
         CLR   3,2
         BNE   L1127
         SLR   15,15
L1127    EQU   *
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=A(@@F41)
         BALR  14,15
         ST    8,88(13)
         L     2,0(5)
         N     2,=F'4'
         L     3,=A(LC189)
         LTR   2,2
         BNE   L1129
         L     3,=A(LC169)
L1129    EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         ST    8,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@F55)
         BALR  14,15
         LA    2,1(0,0)
L1118    EQU   *
         LR    9,13
         A     9,=F'144'
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         LR    7,2
         LTR   2,2
         BE    L1131
         ST    5,88(13)
         MVC   92(4,13),204(13)
         L     15,0(6)
         S     15,204(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(@@F38)
         BALR  14,15
L1131    EQU   *
         L     3,0(5)
         LR    2,3
         N     2,=F'256'
         LTR   2,2
         BNE   L1133
         LR    2,3
         N     2,=F'512'
         LTR   2,2
         BNE   L1133
         N     3,=F'8192'
         LTR   3,3
         BE    L1132
L1133    EQU   *
         L     2,0(6)
         CLI   0(2),198
         BE    L1132
L1195    EQU   *
         MVC   196(4,13),=F'1'
L1132    EQU   *
         MVC   204(4,13),=F'0'
         L     14,=A(L1085)
         BR    14
L1135    EQU   *
         ST    5,88(13)
         ST    6,92(13)
         LA    4,160(,13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BE    L1194
         ST    4,88(13)
         L     2,0(5)
         N     2,=F'4'
         L     3,=A(LC189)
         LTR   2,2
         BNE   L1138
         L     3,=A(LC169)
L1138    EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    8,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F55)
         BALR  14,15
         B     L1196
L1139    EQU   *
         MVC   204(4,13),=F'0'
         MVC   192(4,13),=F'1'
         A     4,=F'1'
         ST    4,0(6)
         L     3,0(5)
         LR    2,3
         N     2,=F'1024'
         LTR   2,2
         BNE   L1141
         LR    2,3
         N     2,=F'2048'
         LTR   2,2
         BNE   L1141
         LR    2,3
         N     2,=F'4096'
         LTR   2,2
         BNE   L1141
         N     3,=F'8192'
         LTR   3,3
         BE    L1140
L1141    EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F43)
         BALR  14,15
L1140    EQU   *
         ST    5,88(13)
         ST    6,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F44)
         BALR  14,15
         LR    7,15
         LTR   15,15
         L     14,=A(L1085)
         BER   14
         L     3,0(5)
         LR    2,3
         N     2,=F'256'
         LTR   2,2
         BNE   L1143
         N     3,=F'8192'
         LTR   3,3
         L     14,=A(L1085)
         BER   14
L1143    EQU   *
         L     2,0(6)
         CLI   0(2),109
         L     14,=A(L1085)
         BNER  14
         A     2,=F'1'
         ST    2,0(6)
         ST    5,88(13)
         ST    6,92(13)
         LA    2,128(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LR    7,15
         ST    2,88(13)
         B     L1193
L1144    EQU   *
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         LA    4,128(,13)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F49)
         BALR  14,15
         L     3,204(13)
         LTR   3,3
         BNE   L1145
         MVC   204(4,13),0(6)
L1145    EQU   *
         ST    5,88(13)
         ST    6,92(13)
         ST    4,96(13)
         LR    9,13
         A     9,=F'112'
         ST    9,100(13)
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BE    L1146
         ST    5,88(13)
         MVC   92(4,13),204(13)
         L     15,0(6)
         S     15,204(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(@@F38)
         BALR  14,15
L1146    EQU   *
         ST    4,88(13)
         L     2,0(5)
         N     2,=F'4'
         L     3,=A(LC189)
         LTR   2,2
         BNE   L1148
         L     3,=A(LC169)
L1148    EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    8,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F55)
         BALR  14,15
         L     2,44(5)
         N     2,=F'1'
         LTR   2,2
         BE    L1149
         LR    2,13
         A     2,=F'112'
         ST    2,88(13)
         MVC   92(4,13),=A(LC103)
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         ST    8,88(13)
         LR    3,13
         A     3,=F'112'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         L     9,44(5)
         BCTR  9,0
         ST    9,44(5)
L1149    EQU   *
         L     2,40(5)
         N     2,=F'1'
         LTR   2,2
         BNE   L1151
         L     2,44(5)
         N     2,=F'1'
         LTR   2,2
         BE    L1150
L1151    EQU   *
         ST    8,88(13)
         LR    15,13
         A     15,=F'112'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
         L     2,40(5)
         BCTR  2,0
         ST    2,40(5)
L1150    EQU   *
         LR    3,13
         A     3,=F'112'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
L1196    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
L1194    EQU   *
         MVC   204(4,13),=F'0'
         MVC   196(4,13),=F'1'
         B     L1085
L1152    EQU   *
         L     3,0(5)
         LR    2,3
         N     2,=F'256'
         LTR   2,2
         BNE   L1154
         LR    2,3
         N     2,=F'512'
         LTR   2,2
         BE    L1153
L1154    EQU   *
         L     9,200(13)
         LTR   9,9
         BE    L1153
         A     4,=F'1'
         ST    4,0(6)
         ST    5,88(13)
         ST    6,92(13)
         LA    3,176(,13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LR    7,15
         L     2,176(13)
         CL    2,180(13)
         BE    L1155
         ST    3,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L1155    EQU   *
         ST    8,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F55)
         BALR  14,15
         ST    3,88(13)
L1193    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F48)
         BALR  14,15
         B     L1085
L1153    EQU   *
         LR    2,3
         N     2,=F'4096'
         LTR   2,2
         BE    L1157
         A     4,=F'1'
         ST    4,0(6)
         LR    3,4
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BE    L1085
         L     4,=V(ZZZ@2096)
L1192    EQU   *
         N     2,=XL4'000000FF'
         AR    2,2
         LH    2,0(2,4)
         N     2,=F'4'
         LTR   2,2
         BE    L1085
         A     3,=F'1'
         ST    3,0(6)
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    L1085
         B     L1192
L1157    EQU   *
         LR    7,2
         L     14,=A(L1183)
         BR    14
L1162    EQU   *
         L     3,0(5)
         LR    2,3
         N     2,=F'256'
         LTR   2,2
         BNE   L1164
         N     3,=F'512'
         LTR   3,3
         BE    L1167
L1164    EQU   *
         ST    5,88(13)
         ST    6,92(13)
         ST    8,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
         LR    7,15
         L     2,40(5)
         N     2,=F'1'
         LTR   2,2
         BNE   L1165
         MVC   200(4,13),=F'1'
L1165    EQU   *
         L     15,0(6)
         A     15,=F'1'
         ST    15,0(6)
         B     L1085
L1167    EQU   *
         L     3,0(5)
         LR    2,3
         N     2,=F'256'
         LTR   2,2
         BNE   L1169
         LR    15,3
         N     15,=F'512'
         LTR   15,15
         BE    L1168
L1169    EQU   *
         MVC   192(4,13),=F'1'
         ST    5,88(13)
         ST    6,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F44)
         BALR  14,15
         LR    7,15
         B     L1085
L1168    EQU   *
         LR    7,15
         L     14,=A(L1183)
         BR    14
L1085    EQU   *
         LTR   7,7
         BE    L1083
         L     2,196(13)
         LTR   2,2
         BE    L1083
         MVC   192(4,13),=F'1'
         L     3,0(5)
         LR    2,3
         N     2,=F'1024'
         LTR   2,2
         BNE   L1178
         LR    2,3
         N     2,=F'2048'
         LTR   2,2
         BNE   L1178
         N     3,=F'8192'
         LTR   3,3
         BE    L1177
L1178    EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F43)
         BALR  14,15
L1177    EQU   *
         ST    5,88(13)
         ST    6,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F44)
         BALR  14,15
         LR    7,15
         MVC   196(4,13),=F'0'
L1083    EQU   *
         LTR   7,7
         BE    L1084
         L     2,0(6)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L1179
L1084    EQU   *
         LTR   7,7
         BE    L1180
         L     3,192(13)
         LTR   3,3
         BNE   L1180
L1191    EQU   *
         L     3,0(5)
         LR    2,3
         N     2,=F'256'
         LTR   2,2
         BNE   L1182
         N     3,=F'512'
         LTR   3,3
         BE    L1180
L1182    EQU   *
         ST    5,88(13)
         ST    6,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F44)
         BALR  14,15
         LR    7,15
L1180    EQU   *
         LTR   7,7
         BE    L1183
         L     2,0(5)
         N     2,=F'1'
         LTR   2,2
         BE    L1183
         L     2,48(5)
         LTR   2,2
         BE    L1184
         ST    8,88(13)
         MVC   92(4,13),=A(LC218)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L1184    EQU   *
         L     2,56(5)
         LTR   2,2
         BE    L1183
         L     2,0(8)
         CL    2,4(8)
         BE    L1186
         ST    8,88(13)
         MVC   92(4,13),=A(LC190)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L1186    EQU   *
         MVC   88(4,13),56(5)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         ST    8,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
L1183    EQU   *
         LR    15,7
* Function demangle_signature epilogue
         PDPEPIL
* Function demangle_signature literal pool
         DS    0F
         LTORG
* Function demangle_signature page table
         DS    0F
PGT49    EQU   *
         DC    A(PG49)
LC219    EQU   *
         DC    C'0123456789Qt'
         DC    X'0'
LC220    EQU   *
         DC    C'__thunk_'
         DC    X'0'
LC221    EQU   *
         DC    C'virtual function thunk (delta:%d) for '
         DC    X'0'
LC222    EQU   *
         DC    C'__t'
         DC    X'0'
LC223    EQU   *
         DC    C' type_info node'
         DC    X'0'
LC224    EQU   *
         DC    C' type_info function'
         DC    X'0'
         DS    0F
* Function gnu_special,F27 prologue
@@F27    PDPPRLG CINDEX=50,FRAME=168,BASER=12,ENTRY=NO
         B     FEN50
         LTORG
FEN50    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG50     EQU   *
         LR    11,1
         L     10,=A(PGT50)
* Function gnu_special code
         L     8,0(11)
         L     4,4(11)
         L     7,8(11)
         LA    6,1(0,0)
         L     2,0(4)
         CLI   0(2),109
         BNE   L1200
         MVC   88(4,13),=A(@@V1)
         SLR   3,3
         IC    3,1(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L1200
         L     2,0(4)
         CLI   2(2),109
         BNE   L1200
         A     2,=F'3'
         ST    2,0(4)
         L     5,44(8)
         AR    5,6
         ST    5,44(8)
         L     14,=A(L1201)
         BR    14
L1200    EQU   *
         L     2,0(4)
         CLI   0(2),109
         BNE   L1202
         CLI   1(2),109
         BNE   L1204
         CLI   2(2),165
         BNE   L1204
         CLI   3(2),163
         BNE   L1204
         CLI   4(2),109
         BE    L1203
L1204    EQU   *
         CLI   1(2),165
         BNE   L1202
         CLI   2(2),163
         BNE   L1202
         MVC   88(4,13),=A(@@V1)
         SLR   9,9
         IC    9,3(2)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L1202
L1203    EQU   *
         L     2,0(4)
         CLI   2(2),165
         BNE   L1205
         A     2,=F'5'
         B     L1264
L1205    EQU   *
         A     2,=F'4'
L1264    EQU   *
         ST    2,0(4)
         L     2,0(4)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L1262
L1224    EQU   *
         L     15,0(4)
         SLR   2,2
         IC    2,0(15)
         LA    3,210(0,0)
         CR    2,3
         BE    L1211
         BH    L1217
         LA    5,163(0,0)
         CLR   2,5
         BE    L1212
         B     L1213
L1217    EQU   *
         LA    9,216(0,0)
         CLR   2,9
         BNE   L1213
L1211    EQU   *
         ST    8,88(13)
         ST    4,92(13)
         ST    7,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         B     L1265
L1212    EQU   *
         ST    8,88(13)
         ST    4,92(13)
         ST    7,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
L1265    EQU   *
         LR    6,15
         B     L1209
L1213    EQU   *
         SLR   2,2
         IC    2,0(15)
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'4'
         LTR   2,2
         BE    L1214
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         CR    3,15
         BNH   L1216
         LA    6,1(0,0)
         B     L1209
L1214    EQU   *
         ST    15,88(13)
         MVC   92(4,13),=A(@@V1)
         LA    1,88(,13)
         L     15,=V(STRCSPN)
         BALR  14,15
         LR    3,15
L1216    EQU   *
         ST    7,88(13)
         MVC   92(4,13),0(4)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         A     3,0(4)
         ST    3,0(4)
L1209    EQU   *
         MVC   88(4,13),0(4)
         MVC   92(4,13),=A(@@V1)
         LA    1,88(,13)
         L     15,=V(STRPBRK)
         BALR  14,15
         LR    5,15
         LTR   6,6
         L     14,=A(L1248)
         BER   14
         LTR   15,15
         BE    L1219
         CL    15,0(4)
         L     14,=A(L1248)
         BNER  14
L1219    EQU   *
         LTR   5,5
         BE    L1207
         ST    7,88(13)
         L     2,0(8)
         N     2,=F'4'
         L     3,=A(LC189)
         LTR   2,2
         BNE   L1222
         L     3,=A(LC169)
L1222    EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,0(4)
         A     2,=F'1'
         ST    2,0(4)
L1207    EQU   *
         L     2,0(4)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L1224
         LTR   6,6
         L     14,=A(L1201)
         BER   14
L1262    EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(LC170)
         L     14,=A(L1268)
         BR    14
L1202    EQU   *
         L     2,0(4)
         CLI   0(2),109
         BNE   L1227
         MVC   88(4,13),=A(LC219)
         SLR   3,3
         IC    3,1(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L1227
         MVC   88(4,13),0(4)
         MVC   92(4,13),=A(@@V1)
         LA    1,88(,13)
         L     15,=V(STRPBRK)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    L1227
         L     9,0(4)
         A     9,=F'1'
         ST    9,0(4)
         SLR   3,3
         IC    3,0(9)
         LR    2,3
         LA    9,210(0,0)
         CR    3,9
         BE    L1230
         BH    L1236
         LA    3,163(0,0)
         CLR   2,3
         BE    L1231
         B     L1232
L1236    EQU   *
         LA    9,216(0,0)
         CLR   3,9
         BNE   L1232
L1230    EQU   *
         ST    8,88(13)
         ST    4,92(13)
         ST    7,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         B     L1266
L1231    EQU   *
         ST    8,88(13)
         ST    4,92(13)
         ST    7,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
         B     L1266
L1232    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    3,15
         LTR   15,15
         L     14,=A(L1248)
         BLR   14
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         CR    3,15
         L     14,=A(L1248)
         BHR   14
         LA    2,10(0,0)
         CR    3,2
         BNH   L1235
         MVC   88(4,13),0(4)
         MVC   92(4,13),=A(LC164)
         MVC   96(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L1235
         L     2,0(4)
         CLI   9(2),213
         BNE   L1235
         CLC   8(1,2),10(2)
         BNE   L1235
         MVC   88(4,13),=A(@@V1)
         SLR   9,9
         IC    9,8(2)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L1235
         ST    7,88(13)
         MVC   92(4,13),=A(LC186)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         L     2,0(4)
         AR    2,3
         ST    2,0(4)
         ST    2,88(13)
         MVC   92(4,13),=A(@@V1)
         LA    1,88(,13)
         L     15,=V(STRPBRK)
         BALR  14,15
         LR    5,15
         B     L1263
L1235    EQU   *
         ST    7,88(13)
         MVC   92(4,13),0(4)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         A     3,0(4)
         ST    3,0(4)
         B     L1263
L1266    EQU   *
         LR    6,15
         LTR   15,15
         BE    L1248
L1263    EQU   *
         CL    5,0(4)
         BNE   L1248
         A     5,=F'1'
         ST    5,0(4)
         ST    7,88(13)
         L     2,0(8)
         N     2,=F'4'
         L     3,=A(LC189)
         LTR   2,2
         BNE   L1239
         L     3,=A(LC169)
L1239    EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    3,15
         ST    7,88(13)
         MVC   92(4,13),0(4)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(@@F53)
         BALR  14,15
         A     3,0(4)
         ST    3,0(4)
         B     L1201
L1227    EQU   *
         MVC   88(4,13),0(4)
         MVC   92(4,13),=A(LC220)
         MVC   96(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   L1242
         L     3,0(4)
         A     3,=F'8'
         ST    3,0(4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LR    3,15
         L     5,=F'-1'
         CLR   15,5
         BE    L1245
         ST    8,88(13)
         L     9,0(4)
         A     9,=F'1'
         ST    9,0(4)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    L1245
         LR    5,13
         A     5,=F'112'
         ST    5,88(13)
         MVC   92(4,13),=A(LC221)
         LCR   3,3
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    7,88(13)
         LR    9,13
         A     9,=F'112'
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    7,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         A     15,0(4)
         ST    15,0(4)
         B     L1201
L1245    EQU   *
         LR    6,2
         B     L1201
L1242    EQU   *
         MVC   88(4,13),0(4)
         MVC   92(4,13),=A(LC222)
         MVC   96(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L1248
         L     2,0(4)
         IC    3,3(2)
         CLM   3,1,=XL1'89'
         BE    L1249
         CLM   3,1,=XL1'86'
         BNE   L1248
L1249    EQU   *
         L     5,=A(LC223)
         CLM   3,1,=XL1'89'
         BE    L1251
         L     5,=A(LC224)
L1251    EQU   *
         A     2,=F'4'
         ST    2,0(4)
         SLR   3,3
         IC    3,0(2)
         LR    2,3
         LA    9,210(0,0)
         CR    3,9
         BE    L1254
         BH    L1257
         LA    3,163(0,0)
         CLR   2,3
         BE    L1255
         B     L1256
L1257    EQU   *
         LA    9,216(0,0)
         CLR   3,9
         BNE   L1256
L1254    EQU   *
         ST    8,88(13)
         ST    4,92(13)
         ST    7,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         B     L1267
L1255    EQU   *
         ST    8,88(13)
         ST    4,92(13)
         ST    7,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
         B     L1267
L1256    EQU   *
         ST    8,88(13)
         ST    4,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
L1267    EQU   *
         LR    6,15
         LTR   15,15
         BE    L1258
         L     2,0(4)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L1248
L1258    EQU   *
         LTR   6,6
         BE    L1201
         ST    7,88(13)
         ST    5,92(13)
L1268    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F51)
         BALR  14,15
         B     L1201
L1248    EQU   *
         SLR   6,6
L1201    EQU   *
         LR    15,6
* Function gnu_special epilogue
         PDPEPIL
* Function gnu_special literal pool
         DS    0F
         LTORG
* Function gnu_special page table
         DS    0F
PGT50    EQU   *
         DC    A(PG50)
         END
