         COPY  PDPTOP
         CSECT
* Program text area
LC0      EQU   *
         DC    C'define'
         DC    X'0'
LC1      EQU   *
         DC    C'include'
         DC    X'0'
LC2      EQU   *
         DC    C'endif'
         DC    X'0'
LC3      EQU   *
         DC    C'ifdef'
         DC    X'0'
LC4      EQU   *
         DC    C'if'
         DC    X'0'
LC5      EQU   *
         DC    C'else'
         DC    X'0'
LC6      EQU   *
         DC    C'ifndef'
         DC    X'0'
LC7      EQU   *
         DC    C'undef'
         DC    X'0'
LC8      EQU   *
         DC    C'line'
         DC    X'0'
LC9      EQU   *
         DC    C'elif'
         DC    X'0'
LC10     EQU   *
         DC    C'error'
         DC    X'0'
LC11     EQU   *
         DC    C'pragma'
         DC    X'0'
LC12     EQU   *
         DC    C'warning'
         DC    X'0'
LC13     EQU   *
         DC    C'include_next'
         DC    X'0'
LC14     EQU   *
         DC    C'ident'
         DC    X'0'
LC15     EQU   *
         DC    C'import'
         DC    X'0'
LC16     EQU   *
         DC    C'assert'
         DC    X'0'
LC17     EQU   *
         DC    C'unassert'
         DC    X'0'
LC18     EQU   *
         DC    C'sccs'
         DC    X'0'
         DS    0F
@@V1     EQU   *
         DC    A(@@F15)
         DC    A(LC0)
         DC    X'0006'
         DC    X'00'
         DC    X'08'
         DC    A(@@F21)
         DC    A(LC1)
         DC    X'0007'
         DC    X'00'
         DC    X'14'
         DC    A(@@F51)
         DC    A(LC2)
         DC    X'0005'
         DC    X'00'
         DC    X'01'
         DC    A(@@F46)
         DC    A(LC3)
         DC    X'0005'
         DC    X'00'
         DC    X'03'
         DC    A(@@F48)
         DC    A(LC4)
         DC    X'0002'
         DC    X'00'
         DC    X'13'
         DC    A(@@F49)
         DC    A(LC5)
         DC    X'0004'
         DC    X'00'
         DC    X'01'
         DC    A(@@F47)
         DC    A(LC6)
         DC    X'0006'
         DC    X'00'
         DC    X'03'
         DC    A(@@F16)
         DC    A(LC7)
         DC    X'0005'
         DC    X'00'
         DC    X'08'
         DC    A(@@F26)
         DC    A(LC8)
         DC    X'0004'
         DC    X'00'
         DC    X'10'
         DC    A(@@F50)
         DC    A(LC9)
         DC    X'0004'
         DC    X'01'
         DC    X'11'
         DC    A(@@F29)
         DC    A(LC10)
         DC    X'0005'
         DC    X'01'
         DC    X'00'
         DC    A(@@F37)
         DC    A(LC11)
         DC    X'0006'
         DC    X'01'
         DC    X'08'
         DC    A(@@F30)
         DC    A(LC12)
         DC    X'0007'
         DC    X'02'
         DC    X'00'
         DC    A(@@F23)
         DC    A(LC13)
         DC    X'000C'
         DC    X'02'
         DC    X'14'
         DC    A(@@F31)
         DC    A(LC14)
         DC    X'0005'
         DC    X'02'
         DC    X'08'
         DC    A(@@F22)
         DC    A(LC15)
         DC    X'0006'
         DC    X'02'
         DC    X'14'
         DC    A(@@F56)
         DC    A(LC16)
         DC    X'0006'
         DC    X'02'
         DC    X'00'
         DC    A(@@F57)
         DC    A(LC17)
         DC    X'0008'
         DC    X'02'
         DC    X'00'
         DC    A(@@F45)
         DC    A(LC18)
         DC    X'0004'
         DC    X'02'
         DC    X'00'
LC19     EQU   *
         DC    C'#'
         DC    X'0'
         DS    0F
@@V2     EQU   *
         DC    A(@@F27)
         DC    A(LC19)
         DC    X'0001'
         DC    X'00'
         DC    X'08'
         DS    0F
* Function skip_rest_of_line,F7 prologue
@@F7     PDPPRLG CINDEX=0,FRAME=96,BASER=12,ENTRY=NO
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function skip_rest_of_line code
         L     3,0(11)
L10      EQU   *
         L     2,100(3)
         L     2,4(2)
         LTR   2,2
         BE    L9
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2078)
         BALR  14,15
         B     L10
L9       EQU   *
         L     2,188(3)
         A     2,=F'-16'
         CLI   6(2),24
         BE    L1
L6       EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2076)
         BALR  14,15
         CLI   6(15),24
         BNE   L6
L1       EQU   *
* Function skip_rest_of_line epilogue
         PDPEPIL
* Function skip_rest_of_line literal pool
         DS    0F
         LTORG
* Function skip_rest_of_line page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
LC20     EQU   *
         DC    C'extra tokens at end of #%s directive'
         DC    X'0'
         DS    0F
* Function check_eol,F8 prologue
@@F8     PDPPRLG CINDEX=1,FRAME=104,BASER=12,ENTRY=NO
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function check_eol code
         L     3,0(11)
         L     2,188(3)
         A     2,=F'-16'
         CLI   6(2),24
         BE    L11
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2076)
         BALR  14,15
         CLI   6(15),24
         BE    L11
         ST    3,88(13)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=A(LC20)
         L     2,104(3)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L11      EQU   *
* Function check_eol epilogue
         PDPEPIL
* Function check_eol literal pool
         DS    0F
         LTORG
* Function check_eol page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* Function start_directive,F9 prologue
@@F9     PDPPRLG CINDEX=2,FRAME=88,BASER=12,ENTRY=NO
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function start_directive code
         L     2,0(11)
         MVI   8(2),1
         MVI   13(2),0
         MVC   56(4,2),52(2)
* Function start_directive epilogue
         PDPEPIL
* Function start_directive literal pool
         DS    0F
         LTORG
* Function start_directive page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
         DS    0F
* Function end_directive,F10 prologue
@@F10    PDPPRLG CINDEX=3,FRAME=96,BASER=12,ENTRY=NO
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function end_directive code
         L     3,0(11)
         IC    2,477(3)
         CLM   2,1,=XL1'00'
         BE    L15
         IC    2,16(3)
         LA    2,255(,2)
         STC   2,16(3)
         L     2,104(3)
         L     4,=A(@@V1)
         CLR   2,4
         BE    L17
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(@CPP@REM)
         BALR  14,15
         B     L17
L15      EQU   *
         L     2,4(11)
         LTR   2,2
         BE    L17
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         L     2,216(3)
         LTR   2,2
         BNE   L17
         LR    2,3
         A     2,=F'192'
         ST    2,208(3)
         MVC   188(4,3),200(3)
L17      EQU   *
         SLR   15,15
         IC    2,447(3)
         STC   15,80(,13)
         CLM   2,1,80(13)
         BNE   L20
         LA    15,1(0,0)
L20      EQU   *
         STC   15,13(3)
         MVI   8(3),0
         MVI   12(3),0
         MVI   11(3),0
         MVC   104(4,3),=F'0'
* Function end_directive epilogue
         PDPEPIL
* Function end_directive literal pool
         DS    0F
         LTORG
* Function end_directive page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
         DS    0F
* Function prepare_directive_trad,F11 prologue
@@F11    PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=NO
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function prepare_directive_trad code
         L     3,0(11)
         L     15,104(3)
         L     2,=A(@@V1)
         CLR   15,2
         BE    L22
         SLR   5,5
         LTR   15,15
         BE    L23
         IC    2,11(15)
         N     2,=F'16'
         LTR   2,2
         BNE   L23
         LA    5,1(0,0)
L23      EQU   *
         IC    4,10(3)
         CLM   4,1,=XL1'00'
         BE    L24
         LA    4,1(0,0)
L24      EQU   *
         SLR   2,2
         L     6,=A(@@V1+48)
         CLR   15,6
         BE    L26
         L     6,=A(@@V1+108)
         CLR   15,6
         BNE   L25
L26      EQU   *
         LA    2,1(0,0)
L25      EQU   *
         STC   2,12(3)
         CLM   2,1,=XL1'00'
         BE    L27
         MVI   10(3),0
L27      EQU   *
         CLM   5,1,=XL1'00'
         BE    L28
         IC    2,16(3)
         LA    2,1(,2)
         STC   2,16(3)
L28      EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(@CPP@SCA)
         BALR  14,15
         CLM   5,1,=XL1'00'
         BE    L29
         IC    6,16(3)
         LA    6,255(,6)
         STC   6,16(3)
L29      EQU   *
         STC   4,10(3)
         ST    3,88(13)
         MVC   92(4,13),544(3)
         L     2,552(3)
         S     2,92(13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(@CPP@OVE)
         BALR  14,15
L22      EQU   *
         IC    6,16(3)
         LA    6,1(,6)
         STC   6,16(3)
* Function prepare_directive_trad epilogue
         PDPEPIL
* Function prepare_directive_trad literal pool
         DS    0F
         LTORG
* Function prepare_directive_trad page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
LC21     EQU   *
         DC    C'embedding a directive within macro arguments is '
         DC    C'not portable'
         DC    X'0'
LC22     EQU   *
         DC    C'style of line directive is a GCC extension'
         DC    X'0'
LC23     EQU   *
         DC    C'#%s is a GCC extension'
         DC    X'0'
LC24     EQU   *
         DC    C'suggest not using #elif in traditional C'
         DC    X'0'
LC25     EQU   *
         DC    C'traditional C ignores #%s with the # indented'
         DC    X'0'
LC26     EQU   *
         DC    C'suggest hiding #%s from traditional C with an in'
         DC    C'dented #'
         DC    X'0'
LC27     EQU   *
         DC    C'invalid preprocessing directive #%s'
         DC    X'0'
         DS    0F
* X-func _cpp_handle_directive prologue
@CPP@HAN PDPPRLG CINDEX=5,FRAME=104,BASER=12,ENTRY=YES
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function _cpp_handle_directive code
         L     3,0(11)
         L     6,4(11)
         SLR   4,4
         IC    5,17(3)
         CLM   5,1,=XL1'00'
         BE    L31
         LA    5,1(0,0)
L31      EQU   *
         LA    7,1(0,0)
         CLM   5,1,=XL1'00'
         BE    L32
         IC    2,473(3)
         CLM   2,1,=XL1'00'
         BE    L33
         ST    3,88(13)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=A(LC21)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L33      EQU   *
         STC   4,17(3)
         STC   4,16(3)
L32      EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2076)
         BALR  14,15
         IC    2,6(15)
         CLM   2,1,=XL1'39'
         BNE   L34
         L     2,8(15)
         L     2,12(2)
         LTR   2,2
         BNL   L39
         B     L66
L34      EQU   *
         CLM   2,1,=XL1'3B'
         BNE   L39
         L     2,440(3)
         LA    8,7(0,0)
         CLR   2,8
         BE    L39
         L     4,=A(@@V2)
         IC    2,473(3)
         CLM   2,1,=XL1'00'
         BE    L65
         IC    2,474(3)
         CLM   2,1,=XL1'00'
         BNE   L65
         IC    2,10(3)
         CLM   2,1,=XL1'00'
         BNE   L65
         ST    3,88(13)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=A(LC22)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L65
L66      EQU   *
         SRL   2,24
         N     2,=F'127'
         LR    4,2
         SLL   4,1
         AR    4,2
         SLL   4,2
         A     4,=A(@@V1)
         BE    L39
L65      EQU   *
         IC    2,11(4)
         N     2,=F'2'
         LTR   2,2
         BNE   L40
         STC   2,184(3)
L40      EQU   *
         IC    15,474(3)
         CLM   15,1,=XL1'00'
         BE    L41
         LTR   6,6
         BNE   L42
         IC    2,11(4)
         N     2,=F'8'
         LTR   2,2
         BNE   L41
L42      EQU   *
         SLR   7,7
         LR    4,7
         B     L54
L41      EQU   *
         IC    2,11(4)
         N     2,=F'4'
         STC   2,11(3)
         IC    8,11(4)
         N     8,=F'4'
         STC   8,9(3)
         CLM   15,1,=XL1'00'
         BNE   L44
         IC    2,473(3)
         CLM   2,1,=XL1'00'
         BE    L45
         IC    2,10(3)
         CLM   2,1,=XL1'00'
         BNE   L45
         CLI   10(4),2
         BNE   L45
         ST    3,88(13)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=A(LC23)
         MVC   100(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L45      EQU   *
         IC    2,461(3)
         CLM   2,1,=XL1'00'
         BE    L44
         L     2,=A(@@V1+108)
         CLR   4,2
         BNE   L47
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=A(LC24)
         B     L68
L47      EQU   *
         LTR   6,6
         BE    L49
         IC    2,10(4)
         CLM   2,1,=XL1'00'
         BNE   L49
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=A(LC25)
         B     L67
L49      EQU   *
         LTR   6,6
         BNE   L44
         IC    2,10(4)
         CLM   2,1,=XL1'00'
         BE    L44
         ST    3,88(13)
         ST    6,92(13)
         MVC   96(4,13),=A(LC26)
L67      EQU   *
         MVC   100(4,13),4(4)
L68      EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L44      EQU   *
         IC    2,10(3)
         CLM   2,1,=XL1'00'
         BE    L54
         IC    2,11(4)
         N     2,=F'1'
         LTR   2,2
         BNE   L54
         LR    4,2
         B     L54
L39      EQU   *
         CLI   6(15),24
         BE    L54
         L     2,440(3)
         LA    6,7(0,0)
         CLR   2,6
         BNE   L57
         SLR   7,7
         B     L54
L57      EQU   *
         IC    2,10(3)
         CLM   2,1,=XL1'00'
         BNE   L54
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@280)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC27)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L54      EQU   *
         ST    4,104(3)
         IC    2,477(3)
         CLM   2,1,=XL1'00'
         BE    L60
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
L60      EQU   *
         LTR   4,4
         BE    L61
         L     2,104(3)
         ST    3,88(13)
         L     2,0(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         B     L62
L61      EQU   *
         LTR   7,7
         BNE   L62
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(@CPP@BAC)
         BALR  14,15
L62      EQU   *
         ST    3,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         CLM   5,1,=XL1'00'
         BE    L64
         MVI   17(3),2
         MVI   16(3),1
L64      EQU   *
         LR    15,7
* Function _cpp_handle_directive epilogue
         PDPEPIL
* Function _cpp_handle_directive literal pool
         DS    0F
         LTORG
* Function _cpp_handle_directive page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
LC28     EQU   *
         DC    C'"defined" cannot be used as a macro name'
         DC    X'0'
LC29     EQU   *
         DC    C'"%s" cannot be used as a macro name as it is an '
         DC    C'operator in C++'
         DC    X'0'
LC30     EQU   *
         DC    C'no macro name given in #%s directive'
         DC    X'0'
LC31     EQU   *
         DC    C'macro names must be identifiers'
         DC    X'0'
         DS    0F
* Function lex_macro_node,F14 prologue
@@F14    PDPPRLG CINDEX=6,FRAME=104,BASER=12,ENTRY=NO
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function lex_macro_node code
         L     3,0(11)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2076)
         BALR  14,15
         IC    4,6(15)
         CLM   4,1,=XL1'39'
         BNE   L70
         L     15,8(15)
         CL    15,524(3)
         BNE   L71
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC28)
         B     L79
L71      EQU   *
         IC    2,15(15)
         N     2,=F'2'
         LTR   2,2
         BE    L69
         B     L74
L70      EQU   *
         IC    2,7(15)
         N     2,=F'16'
         LTR   2,2
         BE    L75
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC29)
         L     2,8(15)
         MVC   100(4,13),0(2)
         B     L79
L75      EQU   *
         CLM   4,1,=XL1'18'
         BNE   L77
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC30)
         L     2,104(3)
         MVC   100(4,13),4(2)
         B     L79
L77      EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC31)
L79      EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L74      EQU   *
         SLR   15,15
L69      EQU   *
* Function lex_macro_node epilogue
         PDPEPIL
* Function lex_macro_node literal pool
         DS    0F
         LTORG
* Function lex_macro_node page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
         DS    0F
* Function do_define,F15 prologue
@@F15    PDPPRLG CINDEX=7,FRAME=104,BASER=12,ENTRY=NO
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function do_define code
         L     3,0(11)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    L80
         SLR   15,15
         IC    2,448(3)
         STC   15,80(,13)
         CLM   2,1,80(13)
         BNE   L82
         LA    15,1(0,0)
L82      EQU   *
         STC   15,13(3)
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2054)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L80
         L     2,400(3)
         LTR   2,2
         BE    L80
         ST    3,88(13)
         MVC   92(4,13),56(3)
         ST    4,96(13)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L80      EQU   *
* Function do_define epilogue
         PDPEPIL
* Function do_define literal pool
         DS    0F
         LTORG
* Function do_define page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
LC32     EQU   *
         DC    C'undefining "%s"'
         DC    X'0'
         DS    0F
* Function do_undef,F16 prologue
@@F16    PDPPRLG CINDEX=8,FRAME=104,BASER=12,ENTRY=NO
         B     FEN8
         LTORG
FEN8     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         LR    11,1
         L     10,=A(PGT8)
* Function do_undef code
         L     4,0(11)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L86
         L     2,404(4)
         LTR   2,2
         BE    L87
         ST    4,88(13)
         MVC   92(4,13),56(4)
         ST    15,96(13)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L87      EQU   *
         CLI   14(3),1
         BNE   L86
         IC    2,15(3)
         N     2,=F'16'
         LTR   2,2
         BE    L89
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=A(LC32)
         MVC   100(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L89      EQU   *
         IC    2,470(4)
         CLM   2,1,=XL1'00'
         BE    L90
         ST    4,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(@CPP@WAR)
         BALR  14,15
L90      EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2067)
         BALR  14,15
L86      EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
* Function do_undef epilogue
         PDPEPIL
* Function do_undef literal pool
         DS    0F
         LTORG
* Function do_undef page table
         DS    0F
PGT8     EQU   *
         DC    A(PG8)
         DS    0F
* Function undefine_macros,F17 prologue
@@F17    PDPPRLG CINDEX=9,FRAME=104,BASER=12,ENTRY=NO
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function undefine_macros code
         L     3,0(11)
         L     4,4(11)
         SLR   2,2
         IC    2,14(4)
         LA    5,1(0,0)
         CLR   2,5
         BE    L94
         BL    L92
         LA    3,2(0,0)
         CLR   2,3
         BE    L97
         B     L98
L94      EQU   *
         L     2,404(3)
         LTR   2,2
         BE    L95
         ST    3,88(13)
         MVC   92(4,13),56(3)
         ST    4,96(13)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L95      EQU   *
         IC    2,470(3)
         CLM   2,1,=XL1'00'
         BE    L97
         ST    3,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(@CPP@WAR)
         BALR  14,15
L97      EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2067)
         BALR  14,15
         B     L92
L98      EQU   *
         LA    1,88(,13)
         L     15,=V(ABORT)
         BALR  14,15
L92      EQU   *
         NI    15(4),253
         LA    15,1(0,0)
* Function undefine_macros epilogue
         PDPEPIL
* Function undefine_macros literal pool
         DS    0F
         LTORG
* Function undefine_macros page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
         DS    0F
* X-func ZZZ_283 prologue
ZZZ@283  PDPPRLG CINDEX=10,FRAME=104,BASER=12,ENTRY=YES
         B     FEN10
         LTORG
FEN10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         LR    11,1
         L     10,=A(PGT10)
* Function ZZZ_283 code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=A(@@F17)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(CPP@FORA)
         BALR  14,15
* Function ZZZ_283 epilogue
         PDPEPIL
* Function ZZZ_283 literal pool
         DS    0F
         LTORG
* Function ZZZ_283 page table
         DS    0F
PGT10    EQU   *
         DC    A(PG10)
LC33     EQU   *
         DC    C'invalid flag "%s" in line directive'
         DC    X'0'
         DS    0F
* Function read_flag,F24 prologue
@@F24    PDPPRLG CINDEX=11,FRAME=104,BASER=12,ENTRY=NO
         B     FEN11
         LTORG
FEN11    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         LR    11,1
         L     10,=A(PGT11)
* Function read_flag code
         L     5,0(11)
         L     4,4(11)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2076)
         BALR  14,15
         LR    3,15
         IC    2,6(15)
         CLM   2,1,=XL1'3B'
         BNE   L101
         L     2,8(15)
         LA    6,1(0,0)
         CLR   2,6
         BNE   L106
         L     2,12(15)
         SLR   15,15
         IC    15,0(2)
         A     15,=F'-240'
         CLR   15,4
         BNH   L106
         LA    2,4(0,0)
         CLR   15,2
         BH    L106
         BNE   L103
         LA    6,3(0,0)
         CLR   4,6
         BNE   L106
         B     L100
L103     EQU   *
         LA    2,2(0,0)
         CLR   15,2
         BNE   L100
         LTR   4,4
         BNE   L106
         B     L100
L101     EQU   *
         CLM   2,1,=XL1'18'
         BE    L105
L106     EQU   *
         ST    5,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@280)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC33)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L105     EQU   *
         SLR   15,15
L100     EQU   *
* Function read_flag epilogue
         PDPEPIL
* Function read_flag literal pool
         DS    0F
         LTORG
* Function read_flag page table
         DS    0F
PGT11    EQU   *
         DC    A(PG11)
         DS    0F
* Function strtoul_for_line,F25 prologue
@@F25    PDPPRLG CINDEX=12,FRAME=88,BASER=12,ENTRY=NO
         B     FEN12
         LTORG
FEN12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         LR    11,1
         L     10,=A(PGT12)
* Function strtoul_for_line code
         L     6,0(11)
         SLR   4,4
         L     5,4(11)
L114     EQU   *
         BCTR  5,0
         L     2,=F'-1'
         CLR   5,2
         BE    L113
         SLR   2,2
         IC    2,0(6)
         A     6,=F'1'
         LR    15,2
         LR    3,2
         AR    3,2
         L     2,=V(ZZZ@2096)
         LH    2,0(3,2)
         N     2,=F'4'
         LTR   2,2
         BNE   L110
         LA    15,1(0,0)
         B     L107
L110     EQU   *
         LR    2,4
         SLL   2,3
         AR    2,4
         AR    4,2
         AR    4,15
         A     4,=F'-240'
         B     L114
L113     EQU   *
         L     2,8(11)
         ST    4,0(2)
         SLR   15,15
L107     EQU   *
* Function strtoul_for_line epilogue
         PDPEPIL
* Function strtoul_for_line literal pool
         DS    0F
         LTORG
* Function strtoul_for_line page table
         DS    0F
PGT12    EQU   *
         DC    A(PG12)
         DS    0F
* Function get_token_no_padding,F42 prologue
@@F42    PDPPRLG CINDEX=13,FRAME=96,BASER=12,ENTRY=NO
         B     FEN13
         LTORG
FEN13    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         LR    11,1
         L     10,=A(PGT13)
* Function get_token_no_padding code
         L     2,0(11)
L116     EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         CLI   6(15),69
         BE    L116
* Function get_token_no_padding epilogue
         PDPEPIL
* Function get_token_no_padding literal pool
         DS    0F
         LTORG
* Function get_token_no_padding page table
         DS    0F
PGT13    EQU   *
         DC    A(PG13)
LC34     EQU   *
         DC    C'missing terminating > character'
         DC    X'0'
LC35     EQU   *
         DC    C'pragma dependency'
         DC    X'0'
LC36     EQU   *
         DC    C'#%s expects "FILENAME" or <FILENAME>'
         DC    X'0'
         DS    0F
* Function parse_include,F19 prologue
@@F19    PDPPRLG CINDEX=14,FRAME=104,BASER=12,ENTRY=NO
         B     FEN14
         LTORG
FEN14    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG14     EQU   *
         LR    11,1
         L     10,=A(PGT14)
* Function parse_include code
         L     9,0(11)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F42)
         BALR  14,15
         LR    3,15                                            ç
         IC    2,6(15)
         CLM   2,1,=XL1'3F'
         BE    L121
         CLM   2,1,=XL1'42'
         BNE   L120
L121     EQU   *
         L     2,8(3)
         BCTR  2,0
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    8,15
         L     2,8(3)
         A     2,=F'-2'
         LR    6,15
         LR    7,2
         L     4,12(3)
         A     4,=F'1'
         LR    5,2
         MVCL  6,4
         LR    2,15
         A     2,8(3)
         A     2,=F'-2'
         MVI   0(2),0
         IC    2,6(3)
         X     2,=F'66'
         N     2,=XL4'000000FF'
         BCTR  2,0
         SRL   2,31
         L     3,4(11)
         ST    2,0(3)
         B     L123
L135     EQU   *
         ST    9,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC34)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L126
L120     EQU   *
         CLM   2,1,=XL1'03'
         BNE   L124
         SLR   6,6
         LA    5,1024(0,0)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    3,15
L125     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F42)
         BALR  14,15
         LR    4,15
         IC    2,6(15)
         CLM   2,1,=XL1'02'
         BE    L126
         CLM   2,1,=XL1'18'
         BE    L135
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@281)
         BALR  14,15
         A     15,=F'2'
         LR    2,6
         AR    2,15
         CLR   2,5
         BNH   L129
         AR    5,15
         AR    5,5
         ST    3,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
         LR    3,15
L129     EQU   *
         IC    2,7(4)
         N     2,=F'1'
         LTR   2,2
         BE    L130
         LA    2,64(0,0)
         STC   2,0(3,6)
         A     6,=F'1'
L130     EQU   *
         ST    9,88(13)
         ST    4,92(13)
         AR    6,3
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(CPP@SPEL)
         BALR  14,15
         LR    6,15
         SR    6,3
         B     L125
L126     EQU   *
         SLR   4,4
         STC   4,0(3,6)
         LR    8,3
         L     2,4(11)
         MVC   0(4,2),=F'1'
         B     L123
L124     EQU   *
         L     2,104(9)
         L     3,=A(LC35)
         L     4,=A(@@V1+132)
         CLR   2,4
         BE    L134
         L     3,4(2)
L134     EQU   *
         ST    9,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC36)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         SLR   15,15
         B     L119
L123     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         LR    15,8
L119     EQU   *
* Function parse_include epilogue
         PDPEPIL
* Function parse_include literal pool
         DS    0F
         LTORG
* Function parse_include page table
         DS    0F
PGT14    EQU   *
         DC    A(PG14)
LC37     EQU   *
         DC    C'empty filename in #%s'
         DC    X'0'
LC38     EQU   *
         DC    C'#include nested too deeply'
         DC    X'0'
         DS    0F
* Function do_include_common,F20 prologue
@@F20    PDPPRLG CINDEX=15,FRAME=120,BASER=12,ENTRY=NO
         B     FEN15
         LTORG
FEN15    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG15     EQU   *
         LR    11,1
         L     10,=A(PGT15)
* Function do_include_common code
         L     3,0(11)
         ST    3,88(13)
         LR    2,13
         A     2,=F'112'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    L136
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BNE   L138
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC37)
         L     2,104(3)
         MVC   100(4,13),4(2)
         B     L142
L138     EQU   *
         L     2,40(3)
         LA    5,199(0,0)
         CLR   2,5
         BNH   L139
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC38)
L142     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L140
L139     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         L     15,396(3)
         LTR   15,15
         BE    L141
         ST    3,88(13)
         MVC   92(4,13),56(3)
         L     2,104(3)
         MVC   96(4,13),4(2)
         ST    4,100(13)
         MVC   104(4,13),112(13)
         LA    1,88(,13)
         LA    15,0(15)
         BALR  14,15
L141     EQU   *
         ST    3,88(13)
         ST    4,92(13)
         MVC   96(4,13),112(13)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@2085)
         BALR  14,15
L140     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L136     EQU   *
* Function do_include_common epilogue
         PDPEPIL
* Function do_include_common literal pool
         DS    0F
         LTORG
* Function do_include_common page table
         DS    0F
PGT15    EQU   *
         DC    A(PG15)
         DS    0F
* Function do_import,F22 prologue
@@F22    PDPPRLG CINDEX=16,FRAME=96,BASER=12,ENTRY=NO
         B     FEN16
         LTORG
FEN16    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG16     EQU   *
         LR    11,1
         L     10,=A(PGT16)
* Function do_import code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'2'
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
* Function do_import epilogue
         PDPEPIL
* Function do_import literal pool
         DS    0F
         LTORG
* Function do_import page table
         DS    0F
PGT16    EQU   *
         DC    A(PG16)
LC39     EQU   *
         DC    C'#include_next in primary source file'
         DC    X'0'
         DS    0F
* Function do_include_next,F23 prologue
@@F23    PDPPRLG CINDEX=17,FRAME=104,BASER=12,ENTRY=NO
         B     FEN17
         LTORG
FEN17    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG17     EQU   *
         LR    11,1
         L     10,=A(PGT17)
* Function do_include_next code
         L     3,0(11)
         LA    15,1(0,0)
         L     2,0(3)
         L     2,36(2)
         LTR   2,2
         BNE   L145
         ST    3,88(13)
         ST    2,92(13)
         MVC   96(4,13),=A(LC39)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         LR    15,2
L145     EQU   *
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
* Function do_include_next epilogue
         PDPEPIL
* Function do_include_next literal pool
         DS    0F
         LTORG
* Function do_include_next page table
         DS    0F
PGT17    EQU   *
         DC    A(PG17)
         DS    0F
* Function do_include,F21 prologue
@@F21    PDPPRLG CINDEX=18,FRAME=96,BASER=12,ENTRY=NO
         B     FEN18
         LTORG
FEN18    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG18     EQU   *
         LR    11,1
         L     10,=A(PGT18)
* Function do_include code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
* Function do_include epilogue
         PDPEPIL
* Function do_include literal pool
         DS    0F
         LTORG
* Function do_include page table
         DS    0F
PGT18    EQU   *
         DC    A(PG18)
         DS    0F
* X-func ZZZ_2060 prologue
ZZZ@2060 PDPPRLG CINDEX=19,FRAME=112,BASER=12,ENTRY=YES
         B     FEN19
         LTORG
FEN19    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG19     EQU   *
         LR    11,1
         L     10,=A(PGT19)
* Function ZZZ_2060 code
         L     3,0(11)
         LR    2,3
         A     2,=F'24'
         ST    2,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),16(11)
         MVC   100(4,13),52(3)
         MVC   104(4,13),8(11)
         MVC   108(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@1538)
         BALR  14,15
         ST    15,48(3)
         L     2,388(3)
         LTR   2,2
         BE    L147
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L147     EQU   *
* Function ZZZ_2060 epilogue
         PDPEPIL
* Function ZZZ_2060 literal pool
         DS    0F
         LTORG
* Function ZZZ_2060 page table
         DS    0F
PGT19    EQU   *
         DC    A(PG19)
LC40     EQU   *
         DC    C'"%s" after #line is not a positive integer'
         DC    X'0'
LC41     EQU   *
         DC    C'line number out of range'
         DC    X'0'
LC42     EQU   *
         DC    C'"%s" is not a valid filename'
         DC    X'0'
         DS    0F
* Function do_line,F26 prologue
@@F26    PDPPRLG CINDEX=20,FRAME=128,BASER=12,ENTRY=NO
         B     FEN20
         LTORG
FEN20    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG20     EQU   *
         LR    11,1
         L     10,=A(PGT20)
* Function do_line code
         L     3,0(11)
         L     2,48(3)
         L     5,0(2)
         IC    2,471(3)
         L     4,=F'2147483647'
         CLM   2,1,=XL1'00'
         BNE   L151
         L     4,=F'32767'
L151     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         LR    2,15
         CLI   6(15),59
         BNE   L153
         MVC   88(4,13),12(15)
         MVC   92(4,13),8(15)
         LR    6,13
         A     6,=F'112'
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@F25)
         BALR  14,15
         LTR   15,15
         BE    L152
L153     EQU   *
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@280)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC40)
         B     L160
L152     EQU   *
         IC    2,473(3)
         CLM   2,1,=XL1'00'
         BE    L154
         L     2,112(13)
         LTR   2,2
         BE    L155
         CLR   2,4
         BNH   L154
L155     EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=A(LC41)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L154     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         LR    2,15
         IC    15,6(15)
         CLM   15,1,=XL1'3F'
         BNE   L156
         MVC   120(8,13),=F'0'
         ST    3,88(13)
         A     2,=F'8'
         ST    2,92(13)
         LR    2,13
         A     2,=F'120'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(@CPP@INT)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L157
         L     5,124(13)
L157     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         B     L158
L156     EQU   *
         CLM   15,1,=XL1'18'
         BE    L158
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@280)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC42)
L160     EQU   *
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L149
L158     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'2'
         ST    5,96(13)
         MVC   100(4,13),112(13)
         L     2,48(3)
         SLR   3,3
         IC    3,17(2)
         ST    3,104(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@2060)
         BALR  14,15
L149     EQU   *
* Function do_line epilogue
         PDPEPIL
* Function do_line literal pool
         DS    0F
         LTORG
* Function do_line page table
         DS    0F
PGT20    EQU   *
         DC    A(PG20)
LC43     EQU   *
         DC    C'"%s" after # is not a positive integer'
         DC    X'0'
         DS    0F
* Function do_linemarker,F27 prologue
@@F27    PDPPRLG CINDEX=21,FRAME=128,BASER=12,ENTRY=NO
         B     FEN21
         LTORG
FEN21    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG21     EQU   *
         LR    11,1
         L     10,=A(PGT21)
* Function do_linemarker code
         L     3,0(11)
         L     2,48(3)
         L     6,0(2)
         SLR   4,4
         IC    4,17(2)
         LA    7,2(0,0)
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(@CPP@BAC)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         LR    2,15
         CLI   6(15),59
         BNE   L163
         MVC   88(4,13),12(15)
         MVC   92(4,13),8(15)
         LR    5,13
         A     5,=F'112'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(@@F25)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    L162
L163     EQU   *
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@280)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC43)
         B     L174
L162     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         LR    2,15
         IC    15,6(15)
         CLM   15,1,=XL1'3F'
         BNE   L164
         MVC   120(8,13),=F'0'
         ST    3,88(13)
         A     2,=F'8'
         ST    2,92(13)
         LR    2,13
         A     2,=F'120'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(@CPP@INT)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L165
         L     6,124(13)
L165     EQU   *
         LR    4,5
         ST    3,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F24)
         BALR  14,15
         LR    2,15
         LA    5,1(0,0)
         CLR   15,5
         BNE   L166
         LR    7,4
         ST    3,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(@CPP@FAK)
         BALR  14,15
         B     L173
L166     EQU   *
         LA    5,2(0,0)
         CLR   15,5
         BNE   L167
         LA    7,1(0,0)
L173     EQU   *
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F24)
         BALR  14,15
         LR    2,15
L167     EQU   *
         LA    5,3(0,0)
         CLR   2,5
         BNE   L169
         LA    4,1(0,0)
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F24)
         BALR  14,15
         LA    2,4(0,0)
         CLR   15,2
         BNE   L169
         LA    4,2(0,0)
L169     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         B     L171
L164     EQU   *
         CLM   15,1,=XL1'18'
         BE    L171
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@280)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC42)
L174     EQU   *
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L161
L171     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         ST    3,88(13)
         ST    7,92(13)
         ST    6,96(13)
         MVC   100(4,13),112(13)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@2060)
         BALR  14,15
L161     EQU   *
* Function do_linemarker epilogue
         PDPEPIL
* Function do_linemarker literal pool
         DS    0F
         LTORG
* Function do_linemarker page table
         DS    0F
PGT21    EQU   *
         DC    A(PG21)
LC44     EQU   *
         DC    C'#%s '
         DC    X'0'
         DS    0F
* Function do_diagnostic,F28 prologue
@@F28    PDPPRLG CINDEX=22,FRAME=104,BASER=12,ENTRY=NO
         B     FEN22
         LTORG
FEN22    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG22     EQU   *
         LR    11,1
         L     10,=A(PGT22)
* Function do_diagnostic code
         L     4,0(11)
         ST    4,88(13)
         MVC   92(4,13),4(11)
         L     3,188(4)
         L     2,=F'-16'
         L     5,0(2,3)
         ST    5,96(13)
         LH    3,4(2,3)
         N     3,=XL4'0000FFFF'
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(@CPP@BEG)
         BALR  14,15
         LTR   15,15
         BE    L175
         L     2,8(11)
         LTR   2,2
         BE    L177
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(LC44)
         L     2,104(4)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(FPRINTF)
         BALR  14,15
L177     EQU   *
         IC    2,16(4)
         LA    2,1(,2)
         STC   2,16(4)
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(ZZZ@271)
         BALR  14,15
         IC    5,16(4)
         LA    5,255(,5)
         STC   5,16(4)
L175     EQU   *
* Function do_diagnostic epilogue
         PDPEPIL
* Function do_diagnostic literal pool
         DS    0F
         LTORG
* Function do_diagnostic page table
         DS    0F
PGT22    EQU   *
         DC    A(PG22)
         DS    0F
* Function do_error,F29 prologue
@@F29    PDPPRLG CINDEX=23,FRAME=104,BASER=12,ENTRY=NO
         B     FEN23
         LTORG
FEN23    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG23     EQU   *
         LR    11,1
         L     10,=A(PGT23)
* Function do_error code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
* Function do_error epilogue
         PDPEPIL
* Function do_error literal pool
         DS    0F
         LTORG
* Function do_error page table
         DS    0F
PGT23    EQU   *
         DC    A(PG23)
         DS    0F
* Function do_warning,F30 prologue
@@F30    PDPPRLG CINDEX=24,FRAME=104,BASER=12,ENTRY=NO
         B     FEN24
         LTORG
FEN24    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG24     EQU   *
         LR    11,1
         L     10,=A(PGT24)
* Function do_warning code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
* Function do_warning epilogue
         PDPEPIL
* Function do_warning literal pool
         DS    0F
         LTORG
* Function do_warning page table
         DS    0F
PGT24    EQU   *
         DC    A(PG24)
LC45     EQU   *
         DC    C'invalid #ident directive'
         DC    X'0'
         DS    0F
* Function do_ident,F31 prologue
@@F31    PDPPRLG CINDEX=25,FRAME=104,BASER=12,ENTRY=NO
         B     FEN25
         LTORG
FEN25    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG25     EQU   *
         LR    11,1
         L     10,=A(PGT25)
* Function do_ident code
         L     3,0(11)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         CLI   6(15),63
         BE    L181
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC45)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L182
L181     EQU   *
         L     2,408(3)
         LTR   2,2
         BE    L182
         ST    3,88(13)
         MVC   92(4,13),56(3)
         A     15,=F'8'
         ST    15,96(13)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L182     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
* Function do_ident epilogue
         PDPEPIL
* Function do_ident literal pool
         DS    0F
         LTORG
* Function do_ident page table
         DS    0F
PGT25    EQU   *
         DC    A(PG25)
         DS    0F
* Function lookup_pragma_entry,F32 prologue
@@F32    PDPPRLG CINDEX=26,FRAME=88,BASER=12,ENTRY=NO
         B     FEN26
         LTORG
FEN26    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG26     EQU   *
         LR    11,1
         L     10,=A(PGT26)
* Function lookup_pragma_entry code
         L     15,0(11)
         L     3,4(11)
         LTR   15,15
         BE    L186
         L     2,4(15)
         CLR   2,3
         BE    L186
L187     EQU   *
         L     15,0(15)
         LTR   15,15
         BE    L186
         L     2,4(15)
         CLR   2,3
         BNE   L187
L186     EQU   *
* Function lookup_pragma_entry epilogue
         PDPEPIL
* Function lookup_pragma_entry literal pool
         DS    0F
         LTORG
* Function lookup_pragma_entry page table
         DS    0F
PGT26    EQU   *
         DC    A(PG26)
         DS    0F
* Function insert_pragma_entry,F33 prologue
@@F33    PDPPRLG CINDEX=27,FRAME=96,BASER=12,ENTRY=NO
         B     FEN27
         LTORG
FEN27    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG27     EQU   *
         LR    11,1
         L     10,=A(PGT27)
* Function insert_pragma_entry code
         L     3,4(11)
         L     2,12(11)
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(@CPP@ALI)
         BALR  14,15
         MVC   4(4,15),8(11)
         LTR   2,2
         BE    L190
         MVC   8(4,15),=F'0'
         B     L192
L190     EQU   *
         MVC   8(4,15),=F'1'
L192     EQU   *
         ST    2,12(15)
         MVC   0(4,15),0(3)
         ST    15,0(3)
* Function insert_pragma_entry epilogue
         PDPEPIL
* Function insert_pragma_entry literal pool
         DS    0F
         LTORG
* Function insert_pragma_entry page table
         DS    0F
PGT27    EQU   *
         DC    A(PG27)
LC46     EQU   *
         DC    C'registering "%s" as both a pragma and a pragma n'
         DC    C'amespace'
         DC    X'0'
LC47     EQU   *
         DC    C'#pragma %s %s is already registered'
         DC    X'0'
LC48     EQU   *
         DC    C'#pragma %s is already registered'
         DC    X'0'
         DS    0F
* X-func cpp_register_pragma prologue
CPP@REGI PDPPRLG CINDEX=28,FRAME=112,BASER=12,ENTRY=YES
         B     FEN28
         LTORG
FEN28    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG28     EQU   *
         LR    11,1
         L     10,=A(PGT28)
* Function cpp_register_pragma code
         L     4,0(11)
         L     5,4(11)
         L     6,8(11)
         L     7,12(11)
         LR    2,4
         A     2,=F'380'
         LTR   7,7
         BNE   L194
         LA    1,88(,13)
         L     15,=V(ABORT)
         BALR  14,15
L194     EQU   *
         LTR   5,5
         BE    L195
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    4,88(13)
         ST    5,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(CPP@LOOK)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),0(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LTR   15,15
         BNE   L196
         ST    4,88(13)
         ST    2,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@F33)
         BALR  14,15
         B     L197
L196     EQU   *
         L     2,8(15)
         LTR   2,2
         BE    L199
L197     EQU   *
         LR    2,15
         A     2,=F'12'
L195     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    4,88(13)
         ST    6,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(CPP@LOOK)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),0(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LTR   15,15
         BE    L200
         L     2,8(15)
         LTR   2,2
         BE    L201
L199     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=A(LC46)
         MVC   100(4,13),0(3)
         B     L206
L201     EQU   *
         LTR   5,5
         BE    L203
         ST    4,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=A(LC47)
         ST    5,100(13)
         ST    6,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L193
L203     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=A(LC48)
         ST    6,100(13)
L206     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L193
L200     EQU   *
         ST    4,88(13)
         ST    2,92(13)
         ST    3,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=A(@@F33)
         BALR  14,15
L193     EQU   *
* Function cpp_register_pragma epilogue
         PDPEPIL
* Function cpp_register_pragma literal pool
         DS    0F
         LTORG
* Function cpp_register_pragma page table
         DS    0F
PGT28    EQU   *
         DC    A(PG28)
LC49     EQU   *
         DC    C'once'
         DC    X'0'
LC50     EQU   *
         DC    C'GCC'
         DC    X'0'
LC51     EQU   *
         DC    C'poison'
         DC    X'0'
LC52     EQU   *
         DC    C'system_header'
         DC    X'0'
LC53     EQU   *
         DC    C'dependency'
         DC    X'0'
         DS    0F
* X-func ZZZ_2073 prologue
ZZZ@2073 PDPPRLG CINDEX=29,FRAME=104,BASER=12,ENTRY=YES
         B     FEN29
         LTORG
FEN29    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG29     EQU   *
         LR    11,1
         L     10,=A(PGT29)
* Function ZZZ_2073 code
         L     2,0(11)
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=A(LC49)
         MVC   100(4,13),=A(@@F38)
         LA    1,88(,13)
         L     15,=A(CPP@REGI)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),=A(LC50)
         MVC   96(4,13),=A(LC51)
         MVC   100(4,13),=A(@@F39)
         LA    1,88(,13)
         L     15,=A(CPP@REGI)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),=A(LC50)
         MVC   96(4,13),=A(LC52)
         MVC   100(4,13),=A(@@F40)
         LA    1,88(,13)
         L     15,=A(CPP@REGI)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),=A(LC50)
         MVC   96(4,13),=A(LC53)
         MVC   100(4,13),=A(@@F41)
         LA    1,88(,13)
         L     15,=A(CPP@REGI)
         BALR  14,15
* Function ZZZ_2073 epilogue
         PDPEPIL
* Function ZZZ_2073 literal pool
         DS    0F
         LTORG
* Function ZZZ_2073 page table
         DS    0F
PGT29    EQU   *
         DC    A(PG29)
         DS    0F
* Function count_registered_pragmas,F34 prologue
@@F34    PDPPRLG CINDEX=30,FRAME=96,BASER=12,ENTRY=NO
         B     FEN30
         LTORG
FEN30    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG30     EQU   *
         LR    11,1
         L     10,=A(PGT30)
* Function count_registered_pragmas code
         L     3,0(11)
         SLR   4,4
L217     EQU   *
         LTR   3,3
         BE    L216
         L     2,8(3)
         LTR   2,2
         BE    L212
         MVC   88(4,13),12(3)
         LA    1,88(,13)
         L     15,=A(@@F34)
         BALR  14,15
         AR    4,15
L212     EQU   *
         A     4,=F'1'
         L     3,0(3)
         B     L217
L216     EQU   *
         LR    15,4
* Function count_registered_pragmas epilogue
         PDPEPIL
* Function count_registered_pragmas literal pool
         DS    0F
         LTORG
* Function count_registered_pragmas page table
         DS    0F
PGT30    EQU   *
         DC    A(PG30)
         DS    0F
* Function save_registered_pragmas,F35 prologue
@@F35    PDPPRLG CINDEX=31,FRAME=104,BASER=12,ENTRY=NO
         B     FEN31
         LTORG
FEN31    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG31     EQU   *
         LR    11,1
         L     10,=A(PGT31)
* Function save_registered_pragmas code
         L     4,0(11)
         L     5,4(11)
L227     EQU   *
         LTR   4,4
         BE    L226
         L     2,8(4)
         LTR   2,2
         BE    L222
         MVC   88(4,13),12(4)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F35)
         BALR  14,15
         LR    5,15
L222     EQU   *
         L     2,4(4)
         MVC   88(4,13),0(2)
         LR    3,5
         A     5,=F'4'
         L     2,4(4)
         MVC   92(4,13),4(2)
         L     2,4(4)
         L     2,4(2)
         A     2,=F'1'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(XMEMDUP)
         BALR  14,15
         ST    15,0(3)
         L     4,0(4)
         B     L227
L226     EQU   *
         LR    15,5
* Function save_registered_pragmas epilogue
         PDPEPIL
* Function save_registered_pragmas literal pool
         DS    0F
         LTORG
* Function save_registered_pragmas page table
         DS    0F
PGT31    EQU   *
         DC    A(PG31)
         DS    0F
* X-func ZZZ_2083 prologue
ZZZ@2083 PDPPRLG CINDEX=32,FRAME=96,BASER=12,ENTRY=YES
         B     FEN32
         LTORG
FEN32    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG32     EQU   *
         LR    11,1
         L     10,=A(PGT32)
* Function ZZZ_2083 code
         L     3,0(11)
         MVC   88(4,13),380(3)
         LA    1,88(,13)
         L     15,=A(@@F34)
         BALR  14,15
         SLL   15,2
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),380(3)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F35)
         BALR  14,15
         LR    15,2
* Function ZZZ_2083 epilogue
         PDPEPIL
* Function ZZZ_2083 literal pool
         DS    0F
         LTORG
* Function ZZZ_2083 page table
         DS    0F
PGT32    EQU   *
         DC    A(PG32)
         DS    0F
* Function restore_registered_pragmas,F36 prologue
@@F36    PDPPRLG CINDEX=33,FRAME=104,BASER=12,ENTRY=NO
         B     FEN33
         LTORG
FEN33    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG33     EQU   *
         LR    11,1
         L     10,=A(PGT33)
* Function restore_registered_pragmas code
         L     5,0(11)
         L     4,4(11)
         L     3,8(11)
L238     EQU   *
         LTR   4,4
         BE    L237
         L     2,8(4)
         LTR   2,2
         BE    L233
         ST    5,88(13)
         MVC   92(4,13),12(4)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F36)
         BALR  14,15
         LR    3,15
L233     EQU   *
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),0(3)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(CPP@LOOK)
         BALR  14,15
         ST    15,4(4)
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         A     3,=F'4'
         L     4,0(4)
         B     L238
L237     EQU   *
         LR    15,3
* Function restore_registered_pragmas epilogue
         PDPEPIL
* Function restore_registered_pragmas literal pool
         DS    0F
         LTORG
* Function restore_registered_pragmas page table
         DS    0F
PGT33    EQU   *
         DC    A(PG33)
         DS    0F
* X-func _cpp_restore_pragma_names prologue
@CPP@RES PDPPRLG CINDEX=34,FRAME=104,BASER=12,ENTRY=YES
         B     FEN34
         LTORG
FEN34    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG34     EQU   *
         LR    11,1
         L     10,=A(PGT34)
* Function _cpp_restore_pragma_names code
         L     2,0(11)
         L     3,4(11)
         ST    2,88(13)
         MVC   92(4,13),380(2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F36)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function _cpp_restore_pragma_names epilogue
         PDPEPIL
* Function _cpp_restore_pragma_names literal pool
         DS    0F
         LTORG
* Function _cpp_restore_pragma_names page table
         DS    0F
PGT34    EQU   *
         DC    A(PG34)
         DS    0F
* Function do_pragma,F37 prologue
@@F37    PDPPRLG CINDEX=35,FRAME=104,BASER=12,ENTRY=NO
         B     FEN35
         LTORG
FEN35    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG35     EQU   *
         LR    11,1
         L     10,=A(PGT35)
* Function do_pragma code
         L     3,0(11)
         L     5,188(3)
         LA    6,1(0,0)
         IC    2,16(3)
         LA    2,1(,2)
         STC   2,16(3)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         CLI   6(15),57
         BNE   L245
         MVC   88(4,13),380(3)
         MVC   92(4,13),8(15)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    L241
         L     2,8(15)
         LTR   2,2
         BE    L241
         LA    6,2(0,0)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         CLI   6(15),57
         BNE   L245
         MVC   88(4,13),12(4)
         MVC   92(4,13),8(15)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         LR    4,15
L241     EQU   *
         LTR   4,4
         BE    L245
         L     2,384(3)
         LTR   2,2
         BE    L246
         ST    3,88(13)
         ST    5,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L246     EQU   *
         ST    3,88(13)
         L     2,12(4)
         B     L249
L245     EQU   *
         L     2,412(3)
         LTR   2,2
         BE    L247
         ST    3,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(@CPP@BAC)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),56(3)
         L     2,412(3)
L249     EQU   *
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L247     EQU   *
         IC    2,16(3)
         LA    2,255(,2)
         STC   2,16(3)
* Function do_pragma epilogue
         PDPEPIL
* Function do_pragma literal pool
         DS    0F
         LTORG
* Function do_pragma page table
         DS    0F
PGT35    EQU   *
         DC    A(PG35)
LC54     EQU   *
         DC    C'#pragma once in main file'
         DC    X'0'
         DS    0F
* Function do_pragma_once,F38 prologue
@@F38    PDPPRLG CINDEX=36,FRAME=104,BASER=12,ENTRY=NO
         B     FEN36
         LTORG
FEN36    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG36     EQU   *
         LR    11,1
         L     10,=A(PGT36)
* Function do_pragma_once code
         L     3,0(11)
         L     2,0(3)
         L     2,36(2)
         LTR   2,2
         BNE   L251
         ST    3,88(13)
         ST    2,92(13)
         MVC   96(4,13),=A(LC54)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L251     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         ST    3,88(13)
         L     2,0(3)
         MVC   92(4,13),40(2)
         LA    1,88(,13)
         L     15,=V(@CPP@MAR)
         BALR  14,15
* Function do_pragma_once epilogue
         PDPEPIL
* Function do_pragma_once literal pool
         DS    0F
         LTORG
* Function do_pragma_once page table
         DS    0F
PGT36    EQU   *
         DC    A(PG36)
LC55     EQU   *
         DC    C'invalid #pragma GCC poison directive'
         DC    X'0'
LC56     EQU   *
         DC    C'poisoning existing macro "%s"'
         DC    X'0'
         DS    0F
* Function do_pragma_poison,F39 prologue
@@F39    PDPPRLG CINDEX=37,FRAME=104,BASER=12,ENTRY=NO
         B     FEN37
         LTORG
FEN37    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG37     EQU   *
         LR    11,1
         L     10,=A(PGT37)
* Function do_pragma_poison code
         L     3,0(11)
         MVI   15(3),1
L262     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2076)
         BALR  14,15
         IC    2,6(15)
         CLM   2,1,=XL1'18'
         BE    L254
         CLM   2,1,=XL1'39'
         BE    L256
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC55)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L254
L256     EQU   *
         L     2,8(15)
         IC    15,15(2)
         N     15,=F'2'
         LTR   15,15
         BNE   L262
         CLI   14(2),1
         BNE   L258
         ST    3,88(13)
         ST    15,92(13)
         MVC   96(4,13),=A(LC56)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L258     EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2067)
         BALR  14,15
         OI    15(2),10
         B     L262
L254     EQU   *
         MVI   15(3),0
* Function do_pragma_poison epilogue
         PDPEPIL
* Function do_pragma_poison literal pool
         DS    0F
         LTORG
* Function do_pragma_poison page table
         DS    0F
PGT37    EQU   *
         DC    A(PG37)
LC57     EQU   *
         DC    C'#pragma system_header ignored outside include fi'
         DC    C'le'
         DC    X'0'
         DS    0F
* Function do_pragma_system_header,F40 prologue
@@F40    PDPPRLG CINDEX=38,FRAME=104,BASER=12,ENTRY=NO
         B     FEN38
         LTORG
FEN38    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG38     EQU   *
         LR    11,1
         L     10,=A(PGT38)
* Function do_pragma_system_header code
         L     3,0(11)
         L     2,0(3)
         L     2,36(2)
         LTR   2,2
         BNE   L264
         ST    3,88(13)
         ST    2,92(13)
         MVC   96(4,13),=A(LC57)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L263
L264     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(CPP@MAKE)
         BALR  14,15
L263     EQU   *
* Function do_pragma_system_header epilogue
         PDPEPIL
* Function do_pragma_system_header literal pool
         DS    0F
         LTORG
* Function do_pragma_system_header page table
         DS    0F
PGT38    EQU   *
         DC    A(PG38)
LC58     EQU   *
         DC    C'cannot find source file %s'
         DC    X'0'
LC59     EQU   *
         DC    C'current file is older than %s'
         DC    X'0'
         DS    0F
* Function do_pragma_dependency,F41 prologue
@@F41    PDPPRLG CINDEX=39,FRAME=112,BASER=12,ENTRY=NO
         B     FEN39
         LTORG
FEN39    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG39     EQU   *
         LR    11,1
         L     10,=A(PGT39)
* Function do_pragma_dependency code
         L     2,0(11)
         ST    2,88(13)
         LR    3,13
         A     3,=F'104'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L266
         ST    2,88(13)
         ST    15,92(13)
         MVC   96(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(@CPP@COM)
         BALR  14,15
         LTR   15,15
         BNL   L268
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=A(LC58)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L269
L268     EQU   *
         LTR   15,15
         BNH   L269
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=A(LC59)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         CLI   6(15),24
         BE    L269
         ST    2,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(@CPP@BAC)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
L269     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L266     EQU   *
* Function do_pragma_dependency epilogue
         PDPEPIL
* Function do_pragma_dependency literal pool
         DS    0F
         LTORG
* Function do_pragma_dependency page table
         DS    0F
PGT39    EQU   *
         DC    A(PG39)
         DS    0F
* Function do_sccs,F45 prologue
@@F45    PDPPRLG CINDEX=40,FRAME=88,BASER=12,ENTRY=NO
         B     FEN40
         LTORG
FEN40    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG40     EQU   *
         LR    11,1
         L     10,=A(PGT40)
* Function do_sccs code
* Function do_sccs epilogue
         PDPEPIL
* Function do_sccs literal pool
         DS    0F
         LTORG
* Function do_sccs page table
         DS    0F
PGT40    EQU   *
         DC    A(PG40)
LC60     EQU   *
         DC    C'#else without #if'
         DC    X'0'
LC61     EQU   *
         DC    C'#else after #else'
         DC    X'0'
LC62     EQU   *
         DC    C'the conditional began here'
         DC    X'0'
         DS    0F
* Function do_else,F49 prologue
@@F49    PDPPRLG CINDEX=41,FRAME=112,BASER=12,ENTRY=NO
         B     FEN41
         LTORG
FEN41    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG41     EQU   *
         LR    11,1
         L     10,=A(PGT41)
* Function do_else code
         L     4,0(11)
         L     2,0(4)
         L     3,44(2)
         LTR   3,3
         BNE   L274
         ST    4,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC60)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L273
L274     EQU   *
         L     2,16(3)
         LA    5,5(0,0)
         CLR   2,5
         BNE   L276
         ST    4,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC61)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(3)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=A(LC62)
         LA    1,88(,13)
         L     15,=V(ZZZ@257)
         BALR  14,15
L276     EQU   *
         MVC   16(4,3),=F'5'
         MVC   10(1,4),12(3)
         MVI   12(3),1
         MVC   8(4,3),=F'0'
         IC    2,13(3)
         CLM   2,1,=XL1'00'
         BNE   L273
         IC    2,463(4)
         CLM   2,1,=XL1'00'
         BE    L273
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
L273     EQU   *
* Function do_else epilogue
         PDPEPIL
* Function do_else literal pool
         DS    0F
         LTORG
* Function do_else page table
         DS    0F
PGT41    EQU   *
         DC    A(PG41)
LC63     EQU   *
         DC    C'#elif without #if'
         DC    X'0'
LC64     EQU   *
         DC    C'#elif after #else'
         DC    X'0'
         DS    0F
* Function do_elif,F50 prologue
@@F50    PDPPRLG CINDEX=42,FRAME=112,BASER=12,ENTRY=NO
         B     FEN42
         LTORG
FEN42    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG42     EQU   *
         LR    11,1
         L     10,=A(PGT42)
* Function do_elif code
         L     4,0(11)
         L     2,0(4)
         L     3,44(2)
         LTR   3,3
         BNE   L279
         ST    4,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC63)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L278
L279     EQU   *
         L     2,16(3)
         LA    5,5(0,0)
         CLR   2,5
         BNE   L281
         ST    4,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC64)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(3)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=A(LC62)
         LA    1,88(,13)
         L     15,=V(ZZZ@257)
         BALR  14,15
L281     EQU   *
         MVC   16(4,3),=F'9'
         IC    2,12(3)
         CLM   2,1,=XL1'00'
         BE    L282
         MVI   10(4),1
         B     L283
L282     EQU   *
         STC   2,10(4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(@CPP@PAR)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L284
         LA    2,1(0,0)
L284     EQU   *
         STC   2,10(4)
         N     2,=XL4'000000FF'
         BCTR  2,0
         SRL   2,31
         STC   2,12(3)
L283     EQU   *
         MVC   8(4,3),=F'0'
L278     EQU   *
* Function do_elif epilogue
         PDPEPIL
* Function do_elif literal pool
         DS    0F
         LTORG
* Function do_elif page table
         DS    0F
PGT42    EQU   *
         DC    A(PG42)
LC65     EQU   *
         DC    C'#endif without #if'
         DC    X'0'
         DS    0F
* Function do_endif,F51 prologue
@@F51    PDPPRLG CINDEX=43,FRAME=104,BASER=12,ENTRY=NO
         B     FEN43
         LTORG
FEN43    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG43     EQU   *
         LR    11,1
         L     10,=A(PGT43)
* Function do_endif code
         L     4,0(11)
         L     5,0(4)
         L     3,44(5)
         LTR   3,3
         BNE   L287
         ST    4,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC65)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L286
L287     EQU   *
         IC    2,13(3)
         CLM   2,1,=XL1'00'
         BNE   L289
         IC    2,463(4)
         CLM   2,1,=XL1'00'
         BE    L289
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
L289     EQU   *
         L     2,0(3)
         LTR   2,2
         BNE   L290
         L     2,8(3)
         LTR   2,2
         BE    L290
         MVI   184(4),1
         ST    2,176(4)
L290     EQU   *
         MVC   44(4,5),0(3)
         MVC   10(1,4),13(3)
         LR    2,4
         A     2,=F'336'
         CL    3,4(2)
         BNH   L291
         CL    3,16(2)
         BNL   L291
         ST    3,8(2)
         ST    3,12(2)
         B     L286
L291     EQU   *
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(OBSTACK@)
         BALR  14,15
L286     EQU   *
* Function do_endif epilogue
         PDPEPIL
* Function do_endif literal pool
         DS    0F
         LTORG
* Function do_endif page table
         DS    0F
PGT43    EQU   *
         DC    A(PG43)
         DS    0F
* Function push_conditional,F52 prologue
@@F52    PDPPRLG CINDEX=44,FRAME=96,BASER=12,ENTRY=NO
         B     FEN44
         LTORG
FEN44    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG44     EQU   *
         LR    11,1
         L     10,=A(PGT44)
* Function push_conditional code
         L     6,0(11)
         L     8,4(11)
         L     7,0(6)
         LR    4,6
         A     4,=F'336'
         L     2,16(4)
         S     2,12(4)
         LA    3,20(0,0)
         CR    2,3
         BNL   L294
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2094)
         BALR  14,15
L294     EQU   *
         L     2,12(4)
         A     2,=F'20'
         ST    2,12(4)
         L     15,8(4)
         CR    2,15
         BNE   L295
         OC    40(4,4),=F'1073741824'
L295     EQU   *
         L     2,24(4)
         L     3,12(4)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(4)
         L     2,4(4)
         SR    3,2
         L     5,16(4)
         LR    9,5
         SR    9,2
         CR    3,9
         BNH   L296
         ST    5,12(4)
L296     EQU   *
         MVC   8(4,4),12(4)
         MVC   4(4,15),56(6)
         MVC   0(4,15),44(7)
         SLR   3,3
         IC    2,10(6)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BNE   L298
         LTR   8,8
         BNE   L297
L298     EQU   *
         LA    3,1(0,0)
L297     EQU   *
         STC   3,12(15)
         SLR   3,3
         IC    2,10(6)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BE    L299
         LA    3,1(0,0)
L299     EQU   *
         STC   3,13(15)
         MVC   16(4,15),8(11)
         IC    2,184(6)
         CLM   2,1,=XL1'00'
         BE    L300
         L     2,176(6)
         LTR   2,2
         BNE   L300
         MVC   8(4,15),12(11)
         B     L301
L300     EQU   *
         MVC   8(4,15),=F'0'
L301     EQU   *
         STC   8,10(6)
         ST    15,44(7)
* Function push_conditional epilogue
         PDPEPIL
* Function push_conditional literal pool
         DS    0F
         LTORG
* Function push_conditional page table
         DS    0F
PGT44    EQU   *
         DC    A(PG44)
         DS    0F
* Function do_ifndef,F47 prologue
@@F47    PDPPRLG CINDEX=45,FRAME=104,BASER=12,ENTRY=NO
         B     FEN45
         LTORG
FEN45    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG45     EQU   *
         LR    11,1
         L     10,=A(PGT45)
* Function do_ifndef code
         L     4,0(11)
         LA    5,1(0,0)
         SLR   3,3
         IC    2,10(4)
         CLM   2,1,=XL1'00'
         BNE   L303
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L303
         SLR   5,5
         CLI   14(15),1
         BNE   L306
         LA    5,1(0,0)
         IC    2,15(15)
         N     2,=F'4'
         LTR   2,2
         BNE   L306
         L     2,16(15)
         OC    16(4,2),=F'4096'
L306     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
L303     EQU   *
         ST    4,88(13)
         ST    5,92(13)
         MVC   96(4,13),=F'6'
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
* Function do_ifndef epilogue
         PDPEPIL
* Function do_ifndef literal pool
         DS    0F
         LTORG
* Function do_ifndef page table
         DS    0F
PGT45    EQU   *
         DC    A(PG45)
         DS    0F
* Function do_if,F48 prologue
@@F48    PDPPRLG CINDEX=46,FRAME=104,BASER=12,ENTRY=NO
         B     FEN46
         LTORG
FEN46    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG46     EQU   *
         LR    11,1
         L     10,=A(PGT46)
* Function do_if code
         L     3,0(11)
         LA    4,1(0,0)
         IC    2,10(3)
         CLM   2,1,=XL1'00'
         BNE   L311
         SLR   4,4
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(@CPP@PAR)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L311
         LA    4,1(0,0)
L311     EQU   *
         ST    3,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'4'
         MVC   100(4,13),180(3)
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
* Function do_if epilogue
         PDPEPIL
* Function do_if literal pool
         DS    0F
         LTORG
* Function do_if page table
         DS    0F
PGT46    EQU   *
         DC    A(PG46)
         DS    0F
* Function do_ifdef,F46 prologue
@@F46    PDPPRLG CINDEX=47,FRAME=104,BASER=12,ENTRY=NO
         B     FEN47
         LTORG
FEN47    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG47     EQU   *
         LR    11,1
         L     10,=A(PGT47)
* Function do_ifdef code
         L     3,0(11)
         LA    4,1(0,0)
         IC    2,10(3)
         CLM   2,1,=XL1'00'
         BNE   L314
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         LTR   15,15
         BE    L314
         SLR   4,4
         IC    2,14(15)
         CLM   2,1,=XL1'01'
         BE    L316
         LA    4,1(0,0)
L316     EQU   *
         CLM   2,1,=XL1'01'
         BNE   L317
         IC    2,15(15)
         N     2,=F'4'
         LTR   2,2
         BNE   L317
         L     2,16(15)
         OC    16(4,2),=F'4096'
L317     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
L314     EQU   *
         ST    3,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'3'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F52)
         BALR  14,15
* Function do_ifdef epilogue
         PDPEPIL
* Function do_ifdef literal pool
         DS    0F
         LTORG
* Function do_ifdef page table
         DS    0F
PGT47    EQU   *
         DC    A(PG47)
LC66     EQU   *
         DC    C'assertion without predicate'
         DC    X'0'
LC67     EQU   *
         DC    C'predicate must be an identifier'
         DC    X'0'
LC68     EQU   *
         DC    C'missing ''('' after predicate'
         DC    X'0'
LC70     EQU   *
         DC    C'predicate''s answer is empty'
         DC    X'0'
LC69     EQU   *
         DC    C'missing '')'' to complete answer'
         DC    X'0'
         DS    0F
* Function parse_assertion,F54 prologue
@@F54    PDPPRLG CINDEX=48,FRAME=104,BASER=12,ENTRY=NO
         B     FEN48
         LTORG
FEN48    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG48     EQU   *
         LR    11,1
         L     10,=A(PGT48)
* Function parse_assertion code
         L     5,0(11)
         L     3,8(11)
         SLR   9,9
         IC    2,16(5)
         LA    2,1(,2)
         STC   2,16(5)
         L     4,4(11)
         ST    9,0(4)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         LR    8,15
         IC    2,6(15)
         CLM   2,1,=XL1'18'
         BNE   L320
         ST    5,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC66)
         B     L339
L320     EQU   *
         CLM   2,1,=XL1'39'
         BE    L322
         ST    5,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC67)
         B     L339
L322     EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         IC    2,6(15)
         CLM   2,1,=XL1'16'
         BE    L325
         LA    15,4(0,0)
         CLR   3,15
         BNE   L326
         ST    5,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(@CPP@BAC)
         BALR  14,15
         B     L338
L326     EQU   *
         LA    4,17(0,0)
         CLR   3,4
         BNE   L328
         CLM   2,1,=XL1'18'
         BE    L338
L328     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC68)
         B     L339
L325     EQU   *
         LR    6,9
L329     EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@263)
         BALR  14,15
         LR    7,15
         IC    2,6(15)
         CLM   2,1,=XL1'17'
         BE    L330
         CLM   2,1,=XL1'18'
         BE    L337
         LR    4,6
         SLL   4,4
         LR    2,4
         A     2,=F'24'
         L     3,60(5)
         L     15,12(3)
         S     15,8(3)
         CLR   15,2
         BNL   L334
         ST    5,88(13)
         LR    2,5
         A     2,=F'60'
         ST    2,92(13)
         MVC   96(4,13),=F'24'
         LA    1,88(,13)
         L     15,=V(@CPP@EXT)
         BALR  14,15
L334     EQU   *
         L     2,60(5)
         LR    3,4
         A     3,8(2)
         A     3,=F'8'
         MVC   0(16,3),0(7)
         LTR   6,6
         BNE   L331
         NI    7(3),254
L331     EQU   *
         A     6,=F'1'
         B     L329
L330     EQU   *
         LTR   6,6
         BNE   L336
         ST    5,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC70)
L339     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L321
L337     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC69)
         B     L339
L336     EQU   *
         L     2,60(5)
         L     2,8(2)
         ST    6,4(2)
         MVC   0(4,2),=F'0'
         L     3,4(11)
         ST    2,0(3)
L338     EQU   *
         L     2,8(8)
         L     2,4(2)
         LR    4,2
         A     4,=F'1'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         MVI   0(15),123
         L     3,8(8)
         LR    8,15
         A     8,=F'1'
         LR    9,2
         L     6,0(3)
         LR    7,2
         MVCL  8,6
         ST    5,88(13)
         ST    15,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(CPP@LOOK)
         BALR  14,15
         LR    9,15
L321     EQU   *
         IC    4,16(5)
         LA    4,255(,4)
         STC   4,16(5)
         LR    15,9
* Function parse_assertion epilogue
         PDPEPIL
* Function parse_assertion literal pool
         DS    0F
         LTORG
* Function parse_assertion page table
         DS    0F
PGT48    EQU   *
         DC    A(PG48)
         DS    0F
* Function find_answer,F55 prologue
@@F55    PDPPRLG CINDEX=49,FRAME=96,BASER=12,ENTRY=NO
         B     FEN49
         LTORG
FEN49    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG49     EQU   *
         LR    11,1
         L     10,=A(PGT49)
* Function find_answer code
         L     7,4(11)
         L     5,0(11)
         A     5,=F'16'
L354     EQU   *
         L     2,0(5)
         LTR   2,2
         BE    L342
         L     4,0(5)
         L     2,4(4)
         CL    2,4(7)
         BNE   L343
         SLR   6,6
         CLR   6,2
         BNL   L346
         LR    3,7
         A     3,=F'8'
         LR    2,4
         A     2,=F'8'
L349     EQU   *
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(@CPP@EQU)
         BALR  14,15
         LTR   15,15
         BE    L346
         A     6,=F'1'
         A     2,=F'16'
         A     3,=F'16'
         CL    6,4(4)
         BL    L349
L346     EQU   *
         CL    6,4(4)
         BE    L342
L343     EQU   *
         L     5,0(5)
         B     L354
L342     EQU   *
         LR    15,5
* Function find_answer epilogue
         PDPEPIL
* Function find_answer literal pool
         DS    0F
         LTORG
* Function find_answer page table
         DS    0F
PGT49    EQU   *
         DC    A(PG49)
         DS    0F
* X-func _cpp_test_assertion prologue
@CPP@TES PDPPRLG CINDEX=50,FRAME=112,BASER=12,ENTRY=YES
         B     FEN50
         LTORG
FEN50    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG50     EQU   *
         LR    11,1
         L     10,=A(PGT50)
* Function _cpp_test_assertion code
         L     4,0(11)
         L     5,4(11)
         ST    4,88(13)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         MVC   96(4,13),=F'4'
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         LR    3,15
         MVC   0(4,5),=F'0'
         LTR   15,15
         BE    L356
         SLR   4,4
         CLI   14(15),2
         BNE   L357
         L     2,104(13)
         LTR   2,2
         BE    L358
         ST    15,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F55)
         BALR  14,15
         L     2,0(15)
         LTR   2,2
         BE    L357
L358     EQU   *
         LA    4,1(0,0)
L357     EQU   *
         ST    4,0(5)
         B     L359
L356     EQU   *
         L     2,188(4)
         A     2,=F'-16'
         CLI   6(2),24
         BNE   L359
         ST    4,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(@CPP@BAC)
         BALR  14,15
L359     EQU   *
         LPR   15,3
         BCTR  15,0
         SRL   15,31
* Function _cpp_test_assertion epilogue
         PDPEPIL
* Function _cpp_test_assertion literal pool
         DS    0F
         LTORG
* Function _cpp_test_assertion page table
         DS    0F
PGT50    EQU   *
         DC    A(PG50)
LC71     EQU   *
         DC    C'"%s" re-asserted'
         DC    X'0'
         DS    0F
* Function do_assert,F56 prologue
@@F56    PDPPRLG CINDEX=51,FRAME=112,BASER=12,ENTRY=NO
         B     FEN51
         LTORG
FEN51    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG51     EQU   *
         LR    11,1
         L     10,=A(PGT51)
* Function do_assert code
         L     4,0(11)
         ST    4,88(13)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         MVC   96(4,13),=F'16'
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L362
         L     2,104(13)
         MVC   0(4,2),=F'0'
         CLI   14(15),2
         BNE   L364
         ST    15,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F55)
         BALR  14,15
         L     2,0(15)
         LTR   2,2
         BE    L365
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=A(LC71)
         L     3,0(3)
         A     3,=F'1'
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
         B     L362
L365     EQU   *
         L     2,104(13)
         MVC   0(4,2),16(3)
L364     EQU   *
         MVI   14(3),2
         MVC   16(4,3),104(13)
         L     3,60(4)
         L     2,104(13)
         L     2,4(2)
         SLL   2,4
         A     2,8(3)
         A     2,=F'8'
         ST    2,8(3)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
L362     EQU   *
* Function do_assert epilogue
         PDPEPIL
* Function do_assert literal pool
         DS    0F
         LTORG
* Function do_assert page table
         DS    0F
PGT51    EQU   *
         DC    A(PG51)
         DS    0F
* Function do_unassert,F57 prologue
@@F57    PDPPRLG CINDEX=52,FRAME=112,BASER=12,ENTRY=NO
         B     FEN52
         LTORG
FEN52    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG52     EQU   *
         LR    11,1
         L     10,=A(PGT52)
* Function do_unassert code
         L     4,0(11)
         ST    4,88(13)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         MVC   96(4,13),=F'17'
         LA    1,88(,13)
         L     15,=A(@@F54)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L366
         CLI   14(15),2
         BNE   L366
         L     2,104(13)
         LTR   2,2
         BE    L368
         ST    15,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F55)
         BALR  14,15
         L     2,0(15)
         LTR   2,2
         BE    L369
         MVC   0(4,15),0(2)
L369     EQU   *
         L     2,16(3)
         LTR   2,2
         BNE   L370
         STC   2,14(3)
L370     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
         B     L366
L368     EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2067)
         BALR  14,15
L366     EQU   *
* Function do_unassert epilogue
         PDPEPIL
* Function do_unassert literal pool
         DS    0F
         LTORG
* Function do_unassert page table
         DS    0F
PGT52    EQU   *
         DC    A(PG52)
         DS    0F
* X-func ZZZ_256 prologue
ZZZ@256  PDPPRLG CINDEX=53,FRAME=88,BASER=12,ENTRY=YES
         B     FEN53
         LTORG
FEN53    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG53     EQU   *
         LR    11,1
         L     10,=A(PGT53)
* Function ZZZ_256 code
         L     2,0(11)
         L     15,220(2)
* Function ZZZ_256 epilogue
         PDPEPIL
* Function ZZZ_256 literal pool
         DS    0F
         LTORG
* Function ZZZ_256 page table
         DS    0F
PGT53    EQU   *
         DC    A(PG53)
         DS    0F
* X-func ZZZ_262 prologue
ZZZ@262  PDPPRLG CINDEX=54,FRAME=88,BASER=12,ENTRY=YES
         B     FEN54
         LTORG
FEN54    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG54     EQU   *
         LR    11,1
         L     10,=A(PGT54)
* Function ZZZ_262 code
         L     15,0(11)
         A     15,=F'436'
* Function ZZZ_262 epilogue
         PDPEPIL
* Function ZZZ_262 literal pool
         DS    0F
         LTORG
* Function ZZZ_262 page table
         DS    0F
PGT54    EQU   *
         DC    A(PG54)
         DS    0F
* X-func ZZZ_260 prologue
ZZZ@260  PDPPRLG CINDEX=55,FRAME=88,BASER=12,ENTRY=YES
         B     FEN55
         LTORG
FEN55    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG55     EQU   *
         LR    11,1
         L     10,=A(PGT55)
* Function ZZZ_260 code
         L     15,0(11)
         A     15,=F'384'
* Function ZZZ_260 epilogue
         PDPEPIL
* Function ZZZ_260 literal pool
         DS    0F
         LTORG
* Function ZZZ_260 page table
         DS    0F
PGT55    EQU   *
         DC    A(PG55)
         DS    0F
* X-func ZZZ_261 prologue
ZZZ@261  PDPPRLG CINDEX=56,FRAME=88,BASER=12,ENTRY=YES
         B     FEN56
         LTORG
FEN56    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG56     EQU   *
         LR    11,1
         L     10,=A(PGT56)
* Function ZZZ_261 code
         L     15,0(11)
         A     15,=F'24'
* Function ZZZ_261 epilogue
         PDPEPIL
* Function ZZZ_261 literal pool
         DS    0F
         LTORG
* Function ZZZ_261 page table
         DS    0F
PGT56    EQU   *
         DC    A(PG56)
         DS    0F
* X-func ZZZ_277 prologue
ZZZ@277  PDPPRLG CINDEX=57,FRAME=88,BASER=12,ENTRY=YES
         B     FEN57
         LTORG
FEN57    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG57     EQU   *
         LR    11,1
         L     10,=A(PGT57)
* Function ZZZ_277 code
         L     3,4(11)
         L     2,0(11)
         MVC   384(40,2),0(3)
* Function ZZZ_277 epilogue
         PDPEPIL
* Function ZZZ_277 literal pool
         DS    0F
         LTORG
* Function ZZZ_277 page table
         DS    0F
PGT57    EQU   *
         DC    A(PG57)
         DS    0F
* X-func ZZZ_273 prologue
ZZZ@273  PDPPRLG CINDEX=58,FRAME=104,BASER=12,ENTRY=YES
         B     FEN58
         LTORG
FEN58    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG58     EQU   *
         LR    11,1
         L     10,=A(PGT58)
* Function ZZZ_273 code
         L     7,0(11)
         L     6,4(11)
         LR    4,7
         A     4,=F'336'
         L     2,16(4)
         S     2,12(4)
         LA    3,88(0,0)
         CR    2,3
         BNL   L378
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2094)
         BALR  14,15
L378     EQU   *
         L     2,12(4)
         A     2,=F'88'
         ST    2,12(4)
         L     5,8(4)
         CR    2,5
         BNE   L379
         OC    40(4,4),=F'1073741824'
L379     EQU   *
         L     2,24(4)
         L     3,12(4)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(4)
         L     2,4(4)
         SR    3,2
         L     15,16(4)
         LR    8,15
         SR    8,2
         CR    3,8
         BNH   L380
         ST    15,12(4)
L380     EQU   *
         MVC   8(4,4),12(4)
         ST    5,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'88'
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         ST    6,12(5)
         ST    6,8(5)
         A     6,8(11)
         ST    6,16(5)
         MVC   50(1,5),15(11)
         MVC   36(4,5),0(7)
         MVI   48(5),1
         ST    5,0(7)
         LR    15,5
* Function ZZZ_273 epilogue
         PDPEPIL
* Function ZZZ_273 literal pool
         DS    0F
         LTORG
* Function ZZZ_273 page table
         DS    0F
PGT58    EQU   *
         DC    A(PG58)
LC72     EQU   *
         DC    C'unterminated #%s'
         DC    X'0'
         DS    0F
* X-func ZZZ_2077 prologue
ZZZ@2077 PDPPRLG CINDEX=59,FRAME=112,BASER=12,ENTRY=YES
         B     FEN59
         LTORG
FEN59    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG59     EQU   *
         LR    11,1
         L     10,=A(PGT59)
* Function ZZZ_2077 code
         L     5,0(11)
         L     4,0(5)
         L     6,40(4)
         L     3,44(4)
L391     EQU   *
         LTR   3,3
         BE    L390
         ST    5,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(3)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=A(LC72)
         L     2,16(3)
         SLL   2,1
         A     2,16(3)
         SLL   2,2
         A     2,=A(@@V1+4)
         MVC   108(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@257)
         BALR  14,15
         L     3,0(3)
         B     L391
L390     EQU   *
         MVI   10(5),0
         MVC   0(4,5),36(4)
         MVC   88(4,13),20(4)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    2,5
         A     2,=F'336'
         CL    4,4(2)
         BNH   L386
         CL    4,16(2)
         BNL   L386
         ST    4,8(2)
         ST    4,12(2)
         B     L387
L386     EQU   *
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(OBSTACK@)
         BALR  14,15
L387     EQU   *
         LTR   6,6
         BE    L381
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2079)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@2060)
         BALR  14,15
L381     EQU   *
* Function ZZZ_2077 epilogue
         PDPEPIL
* Function ZZZ_2077 literal pool
         DS    0F
         LTORG
* Function ZZZ_2077 page table
         DS    0F
PGT59    EQU   *
         DC    A(PG59)
         DS    0F
* Function run_directive,F13 prologue
@@F13    PDPPRLG CINDEX=60,FRAME=104,BASER=12,ENTRY=NO
         B     FEN60
         LTORG
FEN60    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG60     EQU   *
         LR    11,1
         L     10,=A(PGT60)
* Function run_directive code
         L     4,0(11)
         L     5,4(11)
         ST    4,88(13)
         MVC   92(4,13),8(11)
         MVC   96(4,13),12(11)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(ZZZ@273)
         BALR  14,15
         LA    2,11(0,0)
         CLR   5,2
         BNE   L393
         L     3,0(4)
         L     2,36(3)
         MVC   40(4,3),40(2)
L393     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@2053)
         BALR  14,15
         LR    2,5
         SLL   2,1
         AR    2,5
         SLL   2,2
         A     2,=A(@@V1)
         ST    2,104(4)
         IC    2,477(4)
         CLM   2,1,=XL1'00'
         BE    L394
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
L394     EQU   *
         L     2,104(4)
         ST    4,88(13)
         L     2,0(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         LA    2,11(0,0)
         CLR   5,2
         BNE   L395
         L     2,0(4)
         MVC   40(4,2),=F'0'
L395     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@2077)
         BALR  14,15
* Function run_directive epilogue
         PDPEPIL
* Function run_directive literal pool
         DS    0F
         LTORG
* Function run_directive page table
         DS    0F
PGT60    EQU   *
         DC    A(PG60)
         DS    0F
* Function handle_assertion,F58 prologue
@@F58    PDPPRLG CINDEX=61,FRAME=104,BASER=12,ENTRY=NO
         B     FEN61
         LTORG
FEN61    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG61     EQU   *
         LR    11,1
         L     10,=A(PGT61)
* Function handle_assertion code
         L     8,4(11)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    6,15
         ST    8,88(13)
         MVC   92(4,13),=F'126'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    7,15
         LR    2,6
         A     2,=F'2'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    4,15
         LR    5,6
         LR    2,8
         LR    3,6
         MVCL  4,2
         LTR   7,7
         BE    L397
         SR    7,8
         LA    2,77(0,0)
         STC   2,0(15,7)
         LA    2,93(0,0)
         STC   2,0(15,6)
         A     6,=F'1'
L397     EQU   *
         LA    2,21(0,0)
         STC   2,0(15,6)
         MVC   88(4,13),0(11)
         MVC   92(4,13),8(11)
         ST    15,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
* Function handle_assertion epilogue
         PDPEPIL
* Function handle_assertion literal pool
         DS    0F
         LTORG
* Function handle_assertion page table
         DS    0F
PGT61    EQU   *
         DC    A(PG61)
         DS    0F
* X-func cpp_unassert prologue
CPP@UNAS PDPPRLG CINDEX=62,FRAME=104,BASER=12,ENTRY=YES
         B     FEN62
         LTORG
FEN62    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG62     EQU   *
         LR    11,1
         L     10,=A(PGT62)
* Function cpp_unassert code
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         MVC   96(4,13),=F'17'
         LA    1,88(,13)
         L     15,=A(@@F58)
         BALR  14,15
* Function cpp_unassert epilogue
         PDPEPIL
* Function cpp_unassert literal pool
         DS    0F
         LTORG
* Function cpp_unassert page table
         DS    0F
PGT62    EQU   *
         DC    A(PG62)
         DS    0F
* X-func cpp_assert prologue
CPP@ASSE PDPPRLG CINDEX=63,FRAME=104,BASER=12,ENTRY=YES
         B     FEN63
         LTORG
FEN63    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG63     EQU   *
         LR    11,1
         L     10,=A(PGT63)
* Function cpp_assert code
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         MVC   96(4,13),=F'16'
         LA    1,88(,13)
         L     15,=A(@@F58)
         BALR  14,15
* Function cpp_assert epilogue
         PDPEPIL
* Function cpp_assert literal pool
         DS    0F
         LTORG
* Function cpp_assert page table
         DS    0F
PGT63    EQU   *
         DC    A(PG63)
         DS    0F
* X-func ZZZ_282 prologue
ZZZ@282  PDPPRLG CINDEX=64,FRAME=104,BASER=12,ENTRY=YES
         B     FEN64
         LTORG
FEN64    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG64     EQU   *
         LR    11,1
         L     10,=A(PGT64)
* Function ZZZ_282 code
         L     2,4(11)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    3,15
         LR    4,15
         A     4,=F'1'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    6,15
         LR    7,3
         LR    4,2
         LR    5,3
         MVCL  6,4
         LA    2,21(0,0)
         STC   2,0(15,3)
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'7'
         ST    15,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
* Function ZZZ_282 epilogue
         PDPEPIL
* Function ZZZ_282 literal pool
         DS    0F
         LTORG
* Function ZZZ_282 page table
         DS    0F
PGT64    EQU   *
         DC    A(PG64)
         DS    0F
* X-func ZZZ_2057 prologue
ZZZ@2057 PDPPRLG CINDEX=65,FRAME=104,BASER=12,ENTRY=YES
         B     FEN65
         LTORG
FEN65    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG65     EQU   *
         LR    11,1
         L     10,=A(PGT65)
* Function ZZZ_2057 code
         L     2,4(11)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    3,15
         LR    4,15
         A     4,=F'1'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    6,15
         LR    7,3
         LR    4,2
         LR    5,3
         MVCL  6,4
         LA    2,21(0,0)
         STC   2,0(15,3)
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
* Function ZZZ_2057 epilogue
         PDPEPIL
* Function ZZZ_2057 literal pool
         DS    0F
         LTORG
* Function ZZZ_2057 page table
         DS    0F
PGT65    EQU   *
         DC    A(PG65)
         DS    0F
* X-func ZZZ_253 prologue
ZZZ@253  PDPPRLG CINDEX=66,FRAME=104,BASER=12,ENTRY=YES
         B     FEN66
         LTORG
FEN66    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG66     EQU   *
         LR    11,1
         L     10,=A(PGT66)
* Function ZZZ_253 code
         L     8,4(11)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    6,15
         LR    2,15
         A     2,=F'3'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    7,15
         LR    4,15
         LR    5,6
         LR    2,8
         LR    3,6
         MVCL  4,2
         ST    8,88(13)
         MVC   92(4,13),=F'126'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L403
         SR    15,8
         LA    2,64(0,0)
         STC   2,0(7,15)
         B     L404
L403     EQU   *
         LA    2,64(0,0)
         STC   2,0(7,6)
         A     6,=F'1'
         L     2,=F'-15'
         STC   2,0(7,6)
         A     6,=F'1'
L404     EQU   *
         LA    2,21(0,0)
         STC   2,0(7,6)
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         ST    7,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
* Function ZZZ_253 epilogue
         PDPEPIL
* Function ZZZ_253 literal pool
         DS    0F
         LTORG
* Function ZZZ_253 page table
         DS    0F
PGT66    EQU   *
         DC    A(PG66)
LC73     EQU   *
         DC    C'_Pragma takes a parenthesized string literal'
         DC    X'0'
         DS    0F
* X-func ZZZ_2061 prologue
ZZZ@2061 PDPPRLG CINDEX=67,FRAME=104,BASER=12,ENTRY=YES
         B     FEN67
         LTORG
FEN67    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG67     EQU   *
         LR    11,1
         L     10,=A(PGT67)
* Function ZZZ_2061 code
         L     5,0(11)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F42)
         BALR  14,15
         CLI   6(15),22
         BNE   L410
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F42)
         BALR  14,15
         LR    3,15
         IC    4,6(15)
         LA    2,193(,4)
         CLM   2,1,=XL1'01'
         BH    L410
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F42)
         BALR  14,15
         CLI   6(15),23
         BNE   L410
         LTR   3,3
         BE    L410
         LR    4,3
         A     4,=F'8'
         L     2,0(4)
         BCTR  2,0
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    7,15
         LR    6,15
         L     2,4(4)
         LR    3,2
         A     3,=F'2'
         CLI   0(2),211
         BE    L412
         BCTR  3,0
L412     EQU   *
         LR    15,2
         A     15,0(4)
         BCTR  15,0
L423     EQU   *
         CLR   3,15
         BNL   L422
         CLI   0(3),224
         BNE   L415
         IC    2,1(3)
         CLM   2,1,=XL1'E0'
         BE    L416
         CLM   2,1,=XL1'7F'
         BNE   L415
L416     EQU   *
         A     3,=F'1'
L415     EQU   *
         IC    2,0(3)
         A     3,=F'1'
         STC   2,0(6)
         A     6,=F'1'
         B     L423
L422     EQU   *
         MVI   0(6),21
         L     2,100(5)
         L     4,188(5)
         L     3,208(5)
         MVC   88(4,13),=F'28'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,100(5)
         MVC   20(4,15),=F'0'
         MVC   4(4,15),=F'0'
         ST    5,88(13)
         MVC   92(4,13),=F'11'
         ST    7,96(13)
         SR    6,7
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         MVC   88(4,13),100(5)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    2,100(5)
         ST    4,188(5)
         ST    3,208(5)
         L     2,52(5)
         BCTR  2,0
         ST    2,52(5)
         L     2,384(5)
         LTR   2,2
         BE    L405
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         B     L405
L410     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=A(LC73)
         LA    1,88(,13)
         L     15,=V(ZZZ@255)
         BALR  14,15
L405     EQU   *
* Function ZZZ_2061 epilogue
         PDPEPIL
* Function ZZZ_2061 literal pool
         DS    0F
         LTORG
* Function ZZZ_2061 page table
         DS    0F
PGT67    EQU   *
         DC    A(PG67)
         DS    0F
* X-func ZZZ_2070 prologue
ZZZ@2070 PDPPRLG CINDEX=68,FRAME=104,BASER=12,ENTRY=YES
         B     FEN68
         LTORG
FEN68    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG68     EQU   *
         LR    11,1
         L     10,=A(PGT68)
* Function ZZZ_2070 code
         L     6,0(11)
         SLR   5,5
         L     4,=A(@@V1)
L428     EQU   *
         ST    6,88(13)
         MVC   92(4,13),4(4)
         LH    2,8(4)
         N     2,=XL4'0000FFFF'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(CPP@LOOK)
         BALR  14,15
         L     3,12(15)
         O     3,=F'-2147483648'
         LR    2,5
         N     2,=F'127'
         SLL   2,24
         N     3,=F'-2130706433'
         OR    3,2
         ST    3,12(15)
         A     5,=F'1'
         A     4,=F'12'
         LA    2,18(0,0)
         CLR   5,2
         BNH   L428
* Function ZZZ_2070 epilogue
         PDPEPIL
* Function ZZZ_2070 literal pool
         DS    0F
         LTORG
* Function ZZZ_2070 page table
         DS    0F
PGT68    EQU   *
         DC    A(PG68)
         END
