         COPY  PDPTOP
         CSECT
* Program text area
         DS    0F
* X-func init_all_optabs prologue
INIT@ALL PDPPRLG CINDEX=0,FRAME=88,BASER=12,ENTRY=YES
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function init_all_optabs code
         L     4,=V(OPTAB@TA)
         L     2,232(4)
         MVC   60(4,2),=F'0'
         MVC   52(4,2),=F'1'
         MVC   44(4,2),=F'2'
         MVC   84(4,2),=F'3'
         MVC   76(4,2),=F'4'
         L     2,224(4)
         MVC   52(4,2),=F'5'
         MVC   44(4,2),=F'6'
         MVC   36(4,2),=F'8'
         MVC   84(4,2),=F'9'
         MVC   76(4,2),=F'10'
         L     3,128(4)
         MVC   60(4,3),=F'14'
         MVC   52(4,3),=F'15'
         MVC   44(4,3),=F'17'
         MVC   36(4,3),=F'19'
         L     2,132(4)
         MVC   44(4,2),=F'20'
         MVC   84(4,3),=F'22'
         MVC   76(4,3),=F'24'
         L     15,=V(ZZZ@212)
         L     6,0(15)
         MVC   1916(4,6),=F'27'
         MVC   1908(4,6),=F'28'
         MVC   1596(4,6),=F'29'
         L     8,4(15)
         MVC   1916(4,8),=F'30'
         MVC   1908(4,8),=F'31'
         MVC   1596(4,8),=F'32'
         L     3,8(15)
         MVC   1612(4,3),=F'33'
         L     2,20(15)
         MVC   1956(4,2),=F'34'
         L     2,28(15)
         MVC   3172(4,2),=F'35'
         MVC   2892(4,3),=F'36'
         MVC   3196(4,6),=F'37'
         L     2,0(4)
         MVC   52(4,2),=F'41'
         MVC   44(4,2),=F'42'
         MVC   36(4,2),=F'43'
         L     3,4(4)
         MVC   84(4,2),=F'44'
         MVC   84(4,3),=F'44'
         MVC   76(4,2),=F'45'
         MVC   76(4,3),=F'45'
         L     2,8(4)
         MVC   52(4,2),=F'47'
         MVC   44(4,2),=F'48'
         MVC   36(4,2),=F'49'
         L     3,12(4)
         MVC   84(4,2),=F'50'
         MVC   84(4,3),=F'50'
         MVC   76(4,2),=F'51'
         MVC   76(4,3),=F'51'
         L     2,20(4)
         L     7,16(4)
         MVC   84(4,7),=F'54'
         MVC   84(4,2),=F'54'
         MVC   76(4,7),=F'55'
         MVC   76(4,2),=F'55'
         L     5,40(4)
         MVC   84(4,5),=F'57'
         MVC   76(4,5),=F'58'
         L     2,72(4)
         MVC   52(4,2),=F'61'
         MVC   44(4,2),=F'63'
         MVC   36(4,2),=F'65'
         L     2,76(4)
         MVC   52(4,2),=F'67'
         MVC   44(4,2),=F'69'
         MVC   36(4,2),=F'71'
         L     2,80(4)
         MVC   52(4,2),=F'73'
         MVC   44(4,2),=F'75'
         MVC   36(4,2),=F'77'
         L     2,136(4)
         MVC   52(4,2),=F'78'
         MVC   44(4,2),=F'79'
         L     3,140(4)
         MVC   84(4,2),=F'80'
         MVC   84(4,3),=F'80'
         MVC   76(4,2),=F'81'
         MVC   76(4,3),=F'81'
         L     2,144(4)
         MVC   52(4,2),=F'82'
         MVC   44(4,2),=F'83'
         L     3,148(4)
         MVC   84(4,2),=F'84'
         MVC   84(4,3),=F'84'
         MVC   76(4,2),=F'85'
         MVC   76(4,3),=F'85'
         L     2,152(4)
         MVC   52(4,2),=F'87'
         MVC   44(4,2),=F'89'
         MVC   36(4,2),=F'91'
         L     3,84(4)
         MVC   60(4,3),=F'92'
         L     2,92(4)
         MVC   60(4,2),=F'93'
         MVC   52(4,3),=F'94'
         MVC   52(4,2),=F'95'
         MVC   44(4,3),=F'96'
         MVC   44(4,2),=F'97'
         MVC   36(4,3),=F'98'
         MVC   36(4,2),=F'99'
         L     2,88(4)
         MVC   60(4,2),=F'100'
         MVC   52(4,2),=F'101'
         MVC   44(4,2),=F'102'
         MVC   36(4,2),=F'103'
         L     2,=V(BCC@GEN@)
         MVC   464(4,2),=V(GEN@BEQ)
         MVC   460(4,2),=V(GEN@BNE)
         MVC   472(4,2),=V(GEN@BGT)
         MVC   488(4,2),=V(GEN@BGTU)
         MVC   480(4,2),=V(GEN@BLT)
         MVC   496(4,2),=V(GEN@BLTU)
         MVC   468(4,2),=V(GEN@BGE)
         MVC   484(4,2),=V(GEN@BGEU)
         MVC   476(4,2),=V(GEN@BLE)
         MVC   492(4,2),=V(GEN@BLEU)
         L     2,=V(CMPMEM@O)
         MVC   24(4,2),=F'134'
         L     2,=V(CLRSTR@O)
         MVC   24(4,2),=F'135'
         L     2,=V(MOVSTR@O)
         MVC   24(4,2),=F'136'
         MVC   2236(4,6),=F'137'
         MVC   2236(4,8),=F'138'
         MVC   52(4,7),=F'139'
         MVC   52(4,5),=F'140'
         L     2,52(4)
         MVC   52(4,2),=F'141'
         L     2,60(4)
         MVC   52(4,2),=F'142'
         L     2,64(4)
         MVC   52(4,2),=F'143'
         SLR   5,5
         LR    6,5
L9       EQU   *
         SLR   4,4
         L     7,20(15)
         LR    2,6
         SLL   2,3
         LR    3,2
         A     3,24(15)
         A     3,=F'4'
L8       EQU   *
         L     8,4(7,2)
         ST    8,0(3)
         A     4,=F'1'
         A     2,=F'8'
         A     3,=F'8'
         LA    8,38(0,0)
         CR    4,8
         BNH   L8
         A     5,=F'1'
         A     6,=F'39'
         CR    5,8
         BNH   L9
* Function init_all_optabs epilogue
         PDPEPIL
* Function init_all_optabs literal pool
         DS    0F
         LTORG
* Function init_all_optabs page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         END
