         COPY  PDPTOP
         CSECT
* X-var debug_info_level
         ENTRY DEBUG@IN
* Program data area
         DS    0F
DEBUG@IN EQU   *
         DC    F'0'
* X-var write_symbols
         ENTRY WRITE@SY
         DS    0F
WRITE@SY EQU   *
         DC    F'0'
* X-var ZZZ_2018
         ENTRY ZZZ@2018
ZZZ@2018 EQU   *
         DC    X'01'
         DS    0F
@@V1     EQU   *
         DC    F'80'
* Program text area
@@V2     EQU   *
         DC    C'This switch lacks documentation'
         DC    X'0'
         DS    0F
* Function integral_argument,F2 prologue
@@F2     PDPPRLG CINDEX=0,FRAME=96,BASER=12,ENTRY=NO
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function integral_argument code
         L     3,0(11)
         LR    15,3
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    L3
         L     4,=V(ZZZ@2096)
L7       EQU   *
         N     2,=XL4'000000FF'
         AR    2,2
         LH    2,0(2,4)
         N     2,=F'4'
         LTR   2,2
         BE    L3
         A     15,=F'1'
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BNE   L7
L3       EQU   *
         IC    2,0(15)
         L     15,=F'-1'
         CLM   2,1,=XL1'00'
         BNE   L1
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ATOI)
         BALR  14,15
L1       EQU   *
* Function integral_argument epilogue
         PDPEPIL
* Function integral_argument literal pool
         DS    0F
         LTORG
* Function integral_argument page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         DS    0F
* Function write_langs,F3 prologue
@@F3     PDPPRLG CINDEX=1,FRAME=96,BASER=12,ENTRY=NO
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function write_langs code
         L     8,0(11)
         SLR   3,3
         LR    6,3
         L     2,=V(LANG@NAM)
         L     4,0(2)
         LTR   4,4
         BE    L21
         LR    5,2
L13      EQU   *
         LR    2,8
         SRL   2,0(6)
         N     2,=F'1'
         LTR   2,2
         BE    L11
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         AR    3,15
         A     3,=F'1'
L11      EQU   *
         A     6,=F'1'
         A     5,=F'4'
         L     4,0(5)
         LTR   4,4
         BNE   L13
L21      EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    5,15
         SLR   3,3
         LR    6,3
         L     2,=V(LANG@NAM)
         L     4,0(2)
         LTR   4,4
         BE    L23
         LR    7,2
L19      EQU   *
         LR    2,8
         SRL   2,0(6)
         N     2,=F'1'
         LTR   2,2
         BE    L16
         LTR   3,3
         BE    L18
         LA    2,97(0,0)
         STC   2,0(5,3)
         A     3,=F'1'
L18      EQU   *
         LR    2,5
         AR    2,3
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         AR    3,15
L16      EQU   *
         A     6,=F'1'
         A     7,=F'4'
         L     4,0(7)
         LTR   4,4
         BNE   L19
L23      EQU   *
         SLR   2,2
         STC   2,0(5,3)
         LR    15,5
* Function write_langs epilogue
         PDPEPIL
* Function write_langs literal pool
         DS    0F
         LTORG
* Function write_langs page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* X-func add_input_filename prologue
ADD@INPU PDPPRLG CINDEX=2,FRAME=96,BASER=12,ENTRY=YES
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function add_input_filename code
         L     2,=A(NUM@IN@F)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         L     3,=A(IN@FNAME)
         MVC   88(4,13),0(3)
         L     4,0(2)
         SLL   4,2
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
         ST    15,0(3)
         L     2,0(2)
         SLL   2,2
         AR    2,15
         A     2,=F'-4'
         MVC   0(4,2),0(11)
* Function add_input_filename epilogue
         PDPEPIL
* Function add_input_filename literal pool
         DS    0F
         LTORG
* Function add_input_filename page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
         DS    0F
* Function set_Wextra,F9 prologue
@@F9     PDPPRLG CINDEX=3,FRAME=88,BASER=12,ENTRY=NO
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function set_Wextra code
         L     15,0(11)
         LPR   2,15
         LCR   2,2
         SRL   2,31
         L     3,=A(EXTRA@WA)
         STC   2,0(3)
         L     3,=A(ZZZ@2048)
         STC   2,0(3)
         SLR   3,3
         LTR   15,15
         BE    L28
         L     2,=A(@@V3)
         IC    2,0(2)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BE    L28
         LA    3,1(0,0)
L28      EQU   *
         L     2,=A(ZZZ@2047)
         STC   3,0(2)
         L     3,=A(WARN@UNI)
         LTR   15,15
         BNE   L29
         ST    15,0(3)
         B     L25
L29      EQU   *
         L     2,0(3)
         LA    4,1(0,0)
         CLR   2,4
         BE    L25
         MVC   0(4,3),=F'2'
L25      EQU   *
* Function set_Wextra epilogue
         PDPEPIL
* Function set_Wextra literal pool
         DS    0F
         LTORG
* Function set_Wextra page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
         DS    0F
* X-func set_Wunused prologue
SET@WUNU PDPPRLG CINDEX=4,FRAME=88,BASER=12,ENTRY=YES
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function set_Wunused code
         L     15,0(11)
         LPR   2,15
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2045)
         STC   2,0(3)
         L     3,=A(ZZZ@2046)
         STC   2,0(3)
         L     3,=A(@@V3)
         STC   2,0(3)
         SLR   3,3
         LTR   15,15
         BE    L36
         L     2,=A(EXTRA@WA)
         IC    2,0(2)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BE    L36
         LA    3,1(0,0)
L36      EQU   *
         L     2,=A(ZZZ@2047)
         STC   3,0(2)
         LPR   2,15
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2049)
         STC   2,0(3)
         L     3,=A(ZZZ@2048)
         STC   2,0(3)
* Function set_Wunused epilogue
         PDPEPIL
* Function set_Wunused literal pool
         DS    0F
         LTORG
* Function set_Wunused page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
         DS    0F
* X-func set_fast_math_flags prologue
SET@FAST PDPPRLG CINDEX=5,FRAME=88,BASER=12,ENTRY=YES
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function set_fast_math_flags code
         L     4,0(11)
         LPR   3,4
         BCTR  3,0
         SRL   3,31
         L     2,=V(ZZZ@811)
         ST    3,0(2)
         L     2,=V(ZZZ@815)
         ST    4,0(2)
         L     2,=V(FLAG@FIN)
         ST    4,0(2)
         L     2,=V(FLAG@ERR)
         ST    3,0(2)
         LTR   4,4
         BE    L39
         L     2,=V(ZZZ@805)
         MVC   0(4,2),=F'0'
         L     2,=V(FLAG@ROU)
         MVC   0(4,2),=F'0'
L39      EQU   *
* Function set_fast_math_flags epilogue
         PDPEPIL
* Function set_fast_math_flags literal pool
         DS    0F
         LTORG
* Function set_fast_math_flags page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
         DS    0F
@@V4     EQU   *
         DC    1X'00'
LC0      EQU   *
         DC    C'debug format "%s" conflicts with prior selection'
         DC    X'0'
LC1      EQU   *
         DC    C'unrecognised debug output level "%s"'
         DC    X'0'
LC2      EQU   *
         DC    C'debug output level %s is too high'
         DC    X'0'
         DS    0F
* Function set_debug_level,F10 prologue
@@F10    PDPPRLG CINDEX=6,FRAME=96,BASER=12,ENTRY=NO
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function set_debug_level code
         L     4,0(11)
         L     5,8(11)
         L     3,4(11)
         LPR   2,3
         LCR   2,2
         SRL   2,31
         L     3,=A(USE@GNU@)
         STC   2,0(3)
         LTR   4,4
         BE    L49
         L     6,=A(@@V4)
         IC    2,0(6)
         CLM   2,1,=XL1'00'
         BE    L50
         L     2,=A(WRITE@SY)
         L     2,0(2)
         LTR   2,2
         BE    L50
         CLR   4,2
         BE    L50
         MVC   88(4,13),=A(LC0)
         LR    3,4
         SLL   3,2
         L     2,=V(DEBUG@TY)
         L     2,0(3,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L50      EQU   *
         L     2,=A(WRITE@SY)
         ST    4,0(2)
         MVI   0(6),1
L49      EQU   *
         IC    2,0(5)
         L     3,=A(DEBUG@IN)
         CLM   2,1,=XL1'00'
         BNE   L51
         L     2,0(3)
         LTR   2,2
         BNE   L43
         MVC   0(4,3),=F'2'
         B     L43
L51      EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         ST    15,0(3)
         L     2,=F'-1'
         CLR   15,2
         BNE   L54
         MVC   88(4,13),=A(LC1)
         B     L57
L54      EQU   *
         LA    3,3(0,0)
         CLR   15,3
         BNH   L43
         MVC   88(4,13),=A(LC2)
L57      EQU   *
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L43      EQU   *
* Function set_debug_level epilogue
         PDPEPIL
* Function set_debug_level literal pool
         DS    0F
         LTORG
* Function set_debug_level page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
         DS    0F
* X-func fast_math_flags_set_p prologue
FAST@MAT PDPPRLG CINDEX=7,FRAME=88,BASER=12,ENTRY=YES
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function fast_math_flags_set_p code
         SLR   15,15
         L     2,=V(ZZZ@811)
         L     2,0(2)
         LTR   2,2
         BNE   L59
         L     2,=V(ZZZ@815)
         L     2,0(2)
         LTR   2,2
         BE    L59
         L     2,=V(FLAG@FIN)
         L     2,0(2)
         LTR   2,2
         BE    L59
         L     2,=V(FLAG@ERR)
         L     2,0(2)
         LTR   2,2
         BNE   L59
         LA    15,1(0,0)
L59      EQU   *
         N     15,=F'1'
* Function fast_math_flags_set_p epilogue
         PDPEPIL
* Function fast_math_flags_set_p literal pool
         DS    0F
         LTORG
* Function fast_math_flags_set_p page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
LC3      EQU   *
         DC    C'  %-*.*s %.*s'
         DC    X'15'
         DC    X'0'
         DS    0F
* Function wrap_help,F15 prologue
@@F15    PDPPRLG CINDEX=8,FRAME=112,BASER=12,ENTRY=NO
         B     FEN8
         LTORG
FEN8     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         LR    11,1
         L     10,=A(PGT8)
* Function wrap_help code
         L     5,0(11)
         L     9,8(11)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    7,15
L61      EQU   *
         LR    3,9
         LA    2,27(0,0)
         CLR   9,2
         BNL   L64
         LR    3,2
L64      EQU   *
         L     2,=A(@@V1)
         L     2,0(2)
         LR    6,2
         SR    6,3
         A     6,=F'-3'
         CLR   6,2
         BNH   L65
         SLR   6,6
L65      EQU   *
         LR    4,7
         CLR   6,7
         BNL   L66
         SLR   8,8
         IC    2,0(5)
         CLM   2,1,=XL1'00'
         BE    L66
         LR    15,5
         BCTR  15,0
L74      EQU   *
         CLR   8,6
         BL    L70
         CLR   4,7
         BNE   L66
L70      EQU   *
         IC    2,1(15)
         CLM   2,1,=XL1'40'
         BNE   L71
         LR    4,8
         B     L69
L71      EQU   *
         LA    2,160(,2)
         CLM   2,1,=XL1'01'
         BH    L69
         CLI   2(15),64
         BE    L69
         LTR   8,8
         BE    L69
         SLR   2,2
         IC    2,0(15)
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'136'
         LTR   2,2
         BE    L69
         LR    4,8
         A     4,=F'1'
L69      EQU   *
         A     8,=F'1'
         A     15,=F'1'
         IC    2,1(15)
         CLM   2,1,=XL1'00'
         BNE   L74
L66      EQU   *
         MVC   88(4,13),=A(LC3)
         MVC   92(4,13),=F'27'
         ST    9,96(13)
         MVC   100(4,13),4(11)
         ST    4,104(13)
         ST    5,108(13)
         LA    1,88(,13)
         L     15,=V(PRINTF)
         BALR  14,15
         SLR   9,9
L81      EQU   *
         IC    2,0(5,4)
         CLM   2,1,=XL1'40'
         BNE   L80
         A     4,=F'1'
         B     L81
L80      EQU   *
         AR    5,4
         SR    7,4
         BNE   L61
* Function wrap_help epilogue
         PDPEPIL
* Function wrap_help literal pool
         DS    0F
         LTORG
* Function wrap_help page table
         DS    0F
PGT8     EQU   *
         DC    A(PG8)
         DS    0F
@@V5     EQU   *
         DC    4X'00'
         DS    0F
* Function print_filtered_help,F13 prologue
@@F13    PDPPRLG CINDEX=9,FRAME=112,BASER=12,ENTRY=NO
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function print_filtered_help code
         L     9,0(11)
         SLR   4,4
         STC   4,108(13)
         L     2,=F'536870912'
         CLR   9,2
         BNE   L83
         ST    9,104(13)
         L     3,=A(@@V5)
         L     2,0(3)
         LTR   2,2
         BNE   L84
         L     2,=V(ZZZ@166)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,0(3)
L84      EQU   *
         MVC   88(4,13),0(3)
         ST    4,92(13)
         L     2,=V(ZZZ@166)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         B     L85
L83      EQU   *
         LR    2,9
         O     2,=F'536870912'
         ST    2,104(13)
         LR    5,4
         L     2,=V(ZZZ@166)
         CL    4,0(2)
         BNL   L85
         L     7,=V(ZZZ@165)
L96      EQU   *
         L     15,12(7)
         L     2,104(13)
         NR    2,15
         CLR   2,9
         BNE   L88
         N     15,=F'1073741824'
         LTR   15,15
         BNE   L88
         L     2,=A(@@V5)
         L     2,0(2)
         IC    2,0(2,5)
         CLM   2,1,=XL1'00'
         BE    L88
         MVI   108(13),1
         L     8,0(7)
         LR    3,4
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    6,15
         A     6,=F'1'
         LTR   4,4
         BE    L92
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=F'107'
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         AR    4,6
         L     2,=A(@@V1)
         CL    4,0(2)
         BNH   L94
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=F'21'
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=F'64'
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         LA    3,1(0,0)
         B     L94
L92      EQU   *
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=F'64'
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
L94      EQU   *
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=F'64'
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LR    4,3
         AR    4,6
         A     4,=F'1'
L88      EQU   *
         A     5,=F'1'
         A     7,=F'16'
         L     2,=V(ZZZ@166)
         CL    5,0(2)
         BL    L96
         IC    2,108(13)
         CLM   2,1,=XL1'00'
         BE    L85
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=F'21'
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=F'21'
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
L85      EQU   *
         SLR   5,5
         L     7,=V(ZZZ@166)
         CL    5,0(7)
         BNL   L111
         L     6,=V(ZZZ@165)
L107     EQU   *
         L     15,12(6)
         L     2,104(13)
         NR    2,15
         CLR   2,9
         BNE   L100
         N     15,=F'1073741824'
         LTR   15,15
         BNE   L100
         L     2,=A(@@V5)
         L     3,0(2)
         IC    2,0(3,5)
         CLM   2,1,=XL1'00'
         BNE   L100
         LA    2,1(0,0)
         STC   2,0(3,5)
         L     2,4(6)
         LTR   2,2
         BNE   L104
         L     2,=A(@@V2)
L104     EQU   *
         ST    2,88(13)
         MVC   92(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L105
         LR    4,15
         SR    4,2
         LR    3,2
         LR    2,15
         A     2,=F'1'
         B     L106
L105     EQU   *
         L     3,0(6)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    4,15
L106     EQU   *
         ST    2,88(13)
         ST    3,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
L100     EQU   *
         A     5,=F'1'
         A     6,=F'16'
         CL    5,0(7)
         BL    L107
L111     EQU   *
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=F'21'
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function print_filtered_help epilogue
         PDPEPIL
* Function print_filtered_help literal pool
         DS    0F
         LTORG
* Function print_filtered_help page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
LC4      EQU   *
         DC    C'-O'
         DC    X'0'
LC5      EQU   *
         DC    X'0'
LC6      EQU   *
         DC    C'no-'
         DC    X'0'
LC7      EQU   *
         DC    C'command line option "%s" is valid for %s but not'
         DC    C' for %s'
         DC    X'0'
LC8      EQU   *
         DC    C'missing argument to "%s"'
         DC    X'0'
LC9      EQU   *
         DC    C'argument to "%s" should be a non-negative intege'
         DC    C'r'
         DC    X'0'
LC10     EQU   *
         DC    C'<stdin>'
         DC    X'0'
LC11     EQU   *
         DC    C'?'
         DC    X'0'
LC12     EQU   *
         DC    C'COLUMNS'
         DC    X'0'
LC13     EQU   *
         DC    C'The following options are language-independent:'
         DC    X'15'
         DC    X'0'
LC14     EQU   *
         DC    C'The --param option recognizes the following as p'
         DC    C'arameters:'
         DC    X'15'
         DC    X'0'
LC15     EQU   *
         DC    C'The %s front end recognizes the following option'
         DC    C's:'
         DC    X'15'
         DC    X'15'
         DC    X'0'
LC16     EQU   *
         DC    C'%s: --param arguments should be of the form NAME'
         DC    C'=VALUE'
         DC    X'0'
LC17     EQU   *
         DC    C'invalid --param value `%s'''
         DC    X'0'
LC18     EQU   *
         DC    C'once'
         DC    X'0'
LC19     EQU   *
         DC    C'every-line'
         DC    X'0'
LC20     EQU   *
         DC    C'max-inline-insns-single'
         DC    X'0'
LC21     EQU   *
         DC    C'max-inline-insns-auto'
         DC    X'0'
LC22     EQU   *
         DC    C'max-inline-insns-rtl'
         DC    X'0'
LC23     EQU   *
         DC    C'unrecognized register name "%s"'
         DC    X'0'
LC24     EQU   *
         DC    C'global-dynamic'
         DC    X'0'
LC25     EQU   *
         DC    C'local-dynamic'
         DC    X'0'
LC26     EQU   *
         DC    C'initial-exec'
         DC    X'0'
LC27     EQU   *
         DC    C'local-exec'
         DC    X'0'
LC28     EQU   *
         DC    C'unknown tls-model "%s"'
         DC    X'0'
LC29     EQU   *
         DC    C'-fwritable-strings is deprecated; see documentat'
         DC    C'ion for details'
         DC    X'0'
LC30     EQU   *
         DC    C'unrecognized command line option "%s"'
         DC    X'0'
LC31     EQU   *
         DC    C'-Wuninitialized is not supported without -O'
         DC    X'0'
         DS    0F
* X-func decode_options prologue
DECODE@O PDPPRLG CINDEX=10,FRAME=152,BASER=12,ENTRY=YES
         B     FEN10
         LTORG
FEN10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         LR    11,1
         L     10,=A(PGT10)
* Function decode_options code
         L     3,=V(LANG@HOO)
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         L     2,12(3)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         ST    15,104(13)
         L     2,=V(GLOBAL@D)
         MVC   88(4,13),0(2)
         L     2,16(3)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LA    4,1(0,0)
L481     EQU   *
         CL    4,0(11)
         BNL   L470
         LR    2,4
         SLL   2,2
         L     3,4(11)
         L     3,0(2,3)
         ST    3,88(13)
         MVC   92(4,13),=A(LC4)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   L116
         L     2,=V(ZZZ@1616)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@1619)
         ST    15,0(2)
         B     L115
L116     EQU   *
         L     5,4(11)
         L     2,0(2,5)
         CLI   0(2),96
         BNE   L115
         CLI   1(2),214
         BNE   L115
         LR    3,2
         A     3,=F'2'
         CLI   0(3),162
         BNE   L119
         IC    2,1(3)
         CLM   2,1,=XL1'00'
         BNE   L119
         L     2,=V(ZZZ@1619)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@1616)
         MVC   0(4,2),=F'2'
         B     L115
L119     EQU   *
         ST    3,88(13)
         A     3,=F'-2'
         ST    3,92(13)
         MVC   96(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(READ@INT)
         BALR  14,15
         L     2,=F'-1'
         CLR   15,2
         BE    L115
         L     2,=V(ZZZ@1616)
         ST    15,0(2)
         L     2,=V(ZZZ@1619)
         MVC   0(4,2),=F'0'
L115     EQU   *
         A     4,=F'1'
         B     L481
L470     EQU   *
         L     4,=V(ZZZ@1616)
         L     3,0(4)
         LTR   3,3
         BNE   L123
         L     2,=V(FLAG@MER)
         ST    3,0(2)
         B     L128
L123     EQU   *
         LTR   3,3
         BNH   L124
         L     2,=V(ZZZ@727)
         MVC   0(4,2),=F'1'
         L     2,=V(FLAG@THR)
         MVC   0(4,2),=F'1'
         L     2,=V(FLAG@GUE)
         MVC   0(4,2),=F'1'
         L     2,=V(FLAG@CPR)
         MVC   0(4,2),=F'1'
         L     2,=V(FLAG@LOO)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@745)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@746)
         MVC   0(4,2),=F'1'
L124     EQU   *
         LA    5,1(0,0)
         CR    3,5
         BNH   L125
         L     2,=V(FLAG@CRO)
         ST    5,0(2)
         L     2,=V(ZZZ@772)
         ST    5,0(2)
         L     2,=V(ZZZ@722)
         ST    5,0(2)
         L     2,=V(ZZZ@723)
         ST    5,0(2)
         L     2,=V(ZZZ@739)
         ST    5,0(2)
         L     2,=V(FLAG@EXP)
         ST    5,0(2)
         L     2,=V(ZZZ@808)
         ST    5,0(2)
         L     2,=V(ZZZ@790)
         ST    5,0(2)
         L     2,=V(ZZZ@791)
         ST    5,0(2)
         L     2,=V(FLAG@CAL)
         ST    5,0(2)
         L     2,=V(ZZZ@738)
         ST    5,0(2)
         L     2,=V(ZZZ@775)
         ST    5,0(2)
         L     2,=V(FLAG@REG)
         ST    5,0(2)
         L     2,=V(ZZZ@809)
         ST    5,0(2)
         L     2,=V(ZZZ@729)
         ST    5,0(2)
         L     2,=V(ZZZ@788)
         ST    5,0(2)
         L     2,=V(ZZZ@789)
         ST    5,0(2)
         L     2,=V(FLAG@UNI)
         ST    5,0(2)
L125     EQU   *
         LA    15,2(0,0)
         CR    3,15
         BNH   L126
         L     2,=V(ZZZ@750)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@786)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@816)
         MVC   0(4,2),=F'1'
         L     2,=V(FLAG@WEB)
         MVC   0(4,2),=F'1'
L126     EQU   *
         LA    2,1(0,0)
         CR    3,2
         BNH   L128
         L     2,=V(ZZZ@1619)
         L     2,0(2)
         LTR   2,2
         BE    L127
L128     EQU   *
         L     2,=V(ZZZ@16)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@10)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@13)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@8)
         MVC   0(4,2),=F'1'
         L     2,=V(ZZZ@788)
         MVC   0(4,2),=F'0'
L127     EQU   *
         L     2,=V(ZZZ@807)
         MVC   0(4,2),=F'0'
         L     2,=V(ZZZ@1960)
         MVC   0(4,2),=F'0'
         MVC   88(4,13),=A(LC5)
         LA    1,88(,13)
         L     15,=V(SET@TARG)
         BALR  14,15
         MVC   108(4,13),=F'1'
         LA    3,1(0,0)
         CL    3,0(11)
         L     14,=A(L472)
         BNLR  14
L460     EQU   *
         L     12,0(,10)
         L     4,108(13)
         SLL   4,2
         L     5,4(11)
         L     5,0(4,5)
         ST    5,112(13)
         CLI   0(5),96
         BNE   L133
         IC    2,1(5)
         CLM   2,1,=XL1'00'
         BNE   L132
L133     EQU   *
         L     3,=V(MAIN@INP)
         L     2,0(3)
         LTR   2,2
         BNE   L134
         MVC   0(4,3),112(13)
L134     EQU   *
         MVC   88(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(ADD@INPU)
         BALR  14,15
         LA    2,1(0,0)
         L     14,=A(L131)
         BR    14
L132     EQU   *
         L     15,4(11)
         AR    15,4
         ST    15,116(13)
         MVC   120(4,13),=F'0'
         SLR   8,8
         LA    5,1(0,0)
         ST    8,124(13)
         L     9,0(15)
         IC    2,1(9)
         CLM   2,1,=XL1'E6'
         BE    L136
         CLM   2,1,=XL1'86'
         BNE   L135
L136     EQU   *
         CLI   2(9),149
         BNE   L135
         CLI   3(9),150
         BNE   L135
         IC    3,4(9)
         CLM   3,1,=XL1'60'
         BNE   L135
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         LR    4,15
         A     4,=F'-2'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,120(13)
         STC   3,0(15)
         MVC   1(1,15),1(9)
         A     2,=F'-4'
         LR    6,15
         A     6,=F'2'
         LR    7,2
         LR    4,9
         A     4,=F'5'
         LR    5,2
         MVCL  6,4
         LR    9,15
         L     5,124(13)
L135     EQU   *
         LR    15,9
         A     15,=F'1'
         ST    15,128(13)
         L     2,104(13)
         O     2,=F'536870912'
         ST    2,132(13)
         MVC   144(4,13),=F'0'
         L     2,=V(ZZZ@166)
         L     7,0(2)
         ST    7,140(13)
         MVC   136(4,13),144(13)
         SLR   3,3
         CLR   3,7
         BNL   L474
         L     4,=V(ZZZ@165)
L146     EQU   *
         MVC   88(4,13),128(13)
         L     15,0(4)
         A     15,=F'1'
         ST    15,92(13)
         SLR   2,2
         IC    2,10(4)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L139
         L     3,12(4)
         L     2,132(13)
         NR    2,3
         LTR   2,2
         BE    L141
         SLR   6,6
         IC    6,10(4)
         L     15,128(13)
         IC    2,0(15,6)
         CLM   2,1,=XL1'00'
         BE    L142
         N     3,=F'16777216'
         LTR   3,3
         BE    L141
L142     EQU   *
         CL    6,144(13)
         BNH   L139
         L     7,136(13)
         ST    6,144(13)
         B     L139
L141     EQU   *
         L     2,=V(ZZZ@166)
         L     3,140(13)
         CL    3,0(2)
         BNE   L139
         MVC   140(4,13),136(13)
L139     EQU   *
         L     15,136(13)
         A     15,=F'1'
         ST    15,136(13)
         A     4,=F'16'
         L     2,=V(ZZZ@166)
         CL    15,0(2)
         BL    L146
L474     EQU   *
         L     2,=V(ZZZ@166)
         L     2,0(2)
         CLR   7,2
         BNE   L147
         L     7,140(13)
L147     EQU   *
         CLR   7,2
         L     14,=A(L150)
         BER   14
         LR    6,7
         SLL   6,4
         A     6,=V(ZZZ@165)
         LTR   5,5
         BNE   L151
         L     2,12(6)
         N     2,=F'67108864'
         LTR   2,2
         L     14,=A(L150)
         BNER  14
L151     EQU   *
         MVC   124(4,13),=F'1'
         L     3,12(6)
         LR    2,3
         N     2,=F'16777216'
         LTR   2,2
         BE    L152
         SLR   8,8
         IC    8,10(6)
         L     2,116(13)
         A     8,0(2)
         A     8,=F'1'
         LTR   5,5
         BNE   L153
         MVC   88(4,13),=A(LC6)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         AR    8,15
L153     EQU   *
         IC    2,0(8)
         CLM   2,1,=XL1'00'
         BNE   L157
         L     3,12(6)
         LR    2,3
         N     2,=F'134217728'
         LTR   2,2
         BNE   L157
         N     3,=F'33554432'
         LR    8,3
         LTR   3,3
         BE    L157
         L     3,116(13)
         L     8,4(3)
         B     L482
L152     EQU   *
         N     3,=F'33554432'
         LTR   3,3
         BE    L157
         L     4,116(13)
         L     8,4(4)
L482     EQU   *
         MVC   124(4,13),=F'2'
L157     EQU   *
         L     2,12(6)
         L     15,132(13)
         NR    15,2
         LTR   15,15
         BNE   L159
         L     3,116(13)
         L     4,0(3)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),104(13)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=A(LC7)
         ST    4,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L159     EQU   *
         LTR   8,8
         BNE   L480
         N     2,=F'50331648'
         LTR   2,2
         BE    L163
         ST    9,88(13)
         ST    7,92(13)
         L     2,=V(LANG@HOO)
         L     2,24(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(L150)
         BNER  14
         MVC   88(4,13),=A(LC8)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L480     EQU   *
         N     2,=F'268435456'
         LTR   2,2
         BE    L163
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         LR    5,15
         L     4,=F'-1'
         CLR   15,4
         BNE   L163
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L163     EQU   *
         L     2,104(13)
         N     2,12(6)
         LTR   2,2
         BE    L165
         ST    7,88(13)
         ST    8,92(13)
         ST    5,96(13)
         L     2,=V(LANG@HOO)
         L     2,20(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LTR   15,15
         BNE   L165
         ST    15,124(13)
         L     14,=A(L150)
         BR    14
L165     EQU   *
         L     15,124(13)
         LTR   15,15
         L     14,=A(L150)
         BER   14
         L     2,12(6)
         N     2,=F'536870912'
         LTR   2,2
         L     14,=A(L150)
         BER   14
         LA    2,387(0,0)
         CLR   7,2
         L     14,=A(L170)
         BHR   14
         LR    3,7
         SLL   3,2
         L     2,=A(L456)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
L456     EQU   *
         DC    A(L171)
         DC    A(L170)
         DC    A(L187)
         DC    A(L193)
         DC    A(L194)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L195)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L150)
         DC    A(L150)
         DC    A(L170)
         DC    A(L170)
         DC    A(L198)
         DC    A(L170)
         DC    A(L199)
         DC    A(L170)
         DC    A(L170)
         DC    A(L201)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L203)
         DC    A(L205)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L207)
         DC    A(L170)
         DC    A(L209)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L210)
         DC    A(L170)
         DC    A(L170)
         DC    A(L212)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L214)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L216)
         DC    A(L218)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L220)
         DC    A(L170)
         DC    A(L170)
         DC    A(L222)
         DC    A(L170)
         DC    A(L224)
         DC    A(L226)
         DC    A(L228)
         DC    A(L170)
         DC    A(L230)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L232)
         DC    A(L170)
         DC    A(L233)
         DC    A(L235)
         DC    A(L236)
         DC    A(L238)
         DC    A(L170)
         DC    A(L240)
         DC    A(L242)
         DC    A(L244)
         DC    A(L170)
         DC    A(L170)
         DC    A(L247)
         DC    A(L247)
         DC    A(L248)
         DC    A(L249)
         DC    A(L251)
         DC    A(L252)
         DC    A(L253)
         DC    A(L254)
         DC    A(L255)
         DC    A(L170)
         DC    A(L256)
         DC    A(L258)
         DC    A(L259)
         DC    A(L261)
         DC    A(L262)
         DC    A(L264)
         DC    A(L265)
         DC    A(L267)
         DC    A(L170)
         DC    A(L170)
         DC    A(L268)
         DC    A(L270)
         DC    A(L271)
         DC    A(L170)
         DC    A(L272)
         DC    A(L273)
         DC    A(L274)
         DC    A(L275)
         DC    A(L276)
         DC    A(L277)
         DC    A(L170)
         DC    A(L170)
         DC    A(L279)
         DC    A(L278)
         DC    A(L280)
         DC    A(L170)
         DC    A(L281)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L283)
         DC    A(L284)
         DC    A(L285)
         DC    A(L286)
         DC    A(L287)
         DC    A(L170)
         DC    A(L288)
         DC    A(L289)
         DC    A(L290)
         DC    A(L291)
         DC    A(L170)
         DC    A(L170)
         DC    A(L297)
         DC    A(L170)
         DC    A(L298)
         DC    A(L300)
         DC    A(L299)
         DC    A(L170)
         DC    A(L170)
         DC    A(L301)
         DC    A(L170)
         DC    A(L302)
         DC    A(L170)
         DC    A(L303)
         DC    A(L304)
         DC    A(L305)
         DC    A(L170)
         DC    A(L170)
         DC    A(L308)
         DC    A(L170)
         DC    A(L309)
         DC    A(L310)
         DC    A(L170)
         DC    A(L306)
         DC    A(L311)
         DC    A(L312)
         DC    A(L315)
         DC    A(L313)
         DC    A(L314)
         DC    A(L170)
         DC    A(L170)
         DC    A(L316)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L317)
         DC    A(L319)
         DC    A(L320)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L321)
         DC    A(L322)
         DC    A(L324)
         DC    A(L326)
         DC    A(L326)
         DC    A(L170)
         DC    A(L327)
         DC    A(L328)
         DC    A(L329)
         DC    A(L170)
         DC    A(L330)
         DC    A(L331)
         DC    A(L332)
         DC    A(L333)
         DC    A(L334)
         DC    A(L335)
         DC    A(L336)
         DC    A(L337)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L338)
         DC    A(L170)
         DC    A(L170)
         DC    A(L339)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L340)
         DC    A(L341)
         DC    A(L342)
         DC    A(L170)
         DC    A(L343)
         DC    A(L344)
         DC    A(L170)
         DC    A(L345)
         DC    A(L347)
         DC    A(L170)
         DC    A(L346)
         DC    A(L348)
         DC    A(L350)
         DC    A(L170)
         DC    A(L351)
         DC    A(L352)
         DC    A(L353)
         DC    A(L170)
         DC    A(L354)
         DC    A(L355)
         DC    A(L363)
         DC    A(L356)
         DC    A(L367)
         DC    A(L370)
         DC    A(L372)
         DC    A(L373)
         DC    A(L374)
         DC    A(L376)
         DC    A(L377)
         DC    A(L378)
         DC    A(L379)
         DC    A(L170)
         DC    A(L170)
         DC    A(L380)
         DC    A(L381)
         DC    A(L382)
         DC    A(L170)
         DC    A(L383)
         DC    A(L384)
         DC    A(L385)
         DC    A(L386)
         DC    A(L392)
         DC    A(L395)
         DC    A(L396)
         DC    A(L393)
         DC    A(L387)
         DC    A(L388)
         DC    A(L389)
         DC    A(L390)
         DC    A(L391)
         DC    A(L397)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L398)
         DC    A(L170)
         DC    A(L170)
         DC    A(L399)
         DC    A(L170)
         DC    A(L400)
         DC    A(L401)
         DC    A(L403)
         DC    A(L406)
         DC    A(L170)
         DC    A(L407)
         DC    A(L408)
         DC    A(L170)
         DC    A(L409)
         DC    A(L170)
         DC    A(L170)
         DC    A(L410)
         DC    A(L170)
         DC    A(L411)
         DC    A(L412)
         DC    A(L413)
         DC    A(L422)
         DC    A(L423)
         DC    A(L424)
         DC    A(L425)
         DC    A(L426)
         DC    A(L427)
         DC    A(L428)
         DC    A(L170)
         DC    A(L170)
         DC    A(L429)
         DC    A(L430)
         DC    A(L170)
         DC    A(L431)
         DC    A(L368)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L432)
         DC    A(L170)
         DC    A(L170)
         DC    A(L433)
         DC    A(L434)
         DC    A(L170)
         DC    A(L436)
         DC    A(L170)
         DC    A(L437)
         DC    A(L438)
         DC    A(L439)
         DC    A(L170)
         DC    A(L440)
         DC    A(L442)
         DC    A(L442)
         DC    A(L444)
         DC    A(L446)
         DC    A(L446)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L448)
         DC    A(L170)
         DC    A(L170)
         DC    A(L449)
         DC    A(L450)
         DC    A(L451)
         DC    A(L452)
         DC    A(L170)
         DC    A(L453)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L170)
         DC    A(L454)
         DC    A(L455)
L170     EQU   *
         MVC   88(4,13),=A(LC10)
         MVC   92(4,13),=F'709'
         MVC   96(4,13),=A(LC11)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L171     EQU   *
         MVC   88(4,13),=A(LC12)
         LA    1,88(,13)
         L     15,=V(GETENV)
         BALR  14,15
         LTR   15,15
         L     14,=A(L173)
         BER   14
         B     PGE10
         DS    0F
         LTORG
         DS    0F
PGE10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ATOI)
         BALR  14,15
         LTR   15,15
         BNH   L173
         L     2,=A(@@V1)
         ST    15,0(2)
L173     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(LC13)
         LA    1,88(,13)
         L     15,=V(PUTS)
         BALR  14,15
         MVC   88(4,13),=F'536870912'
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         MVC   88(4,13),=A(LC14)
         LA    1,88(,13)
         L     15,=V(PUTS)
         BALR  14,15
         SLR   5,5
         LA    6,35(0,0)
L180     EQU   *
         L     12,4(,10)
         L     2,=V(COMPILER)
         L     2,0(2)
         L     3,8(5,2)
         L     4,0(5,2)
         LTR   3,3
         BE    L179
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BNE   L178
L179     EQU   *
         L     12,4(,10)
         L     3,=A(@@V2)
L178     EQU   *
         L     12,4(,10)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    3,88(13)
         ST    4,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         BCTR  6,0
         A     5,=F'12'
         LTR   6,6
         BNL   L180
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=F'21'
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         SLR   3,3
         L     4,=V(LANG@NAM)
         L     2,0(4)
L483     EQU   *
         L     12,4(,10)
         LTR   2,2
         BE    L478
         MVC   88(4,13),=A(LC15)
         LR    2,3
         SLL   2,2
         L     4,0(2,4)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(PRINTF)
         BALR  14,15
         LA    4,1(0,0)
         SLL   4,0(3)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         A     3,=F'1'
         L     4,=V(LANG@NAM)
         LR    2,3
         SLL   2,2
         L     2,0(2,4)
         B     L483
L478     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(DISPLAY@)
         BALR  14,15
         L     2,=A(EXIT@AFT)
         MVI   0(2),1
         L     14,=A(L150)
         BR    14
L187     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),=F'126'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   L188
         MVC   88(4,13),=A(LC16)
         ST    3,92(13)
         B     L484
L188     EQU   *
         L     12,4(,10)
         LR    4,15
         A     4,=F'1'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         L     5,=F'-1'
         CLR   15,5
         BNE   L190
         MVC   88(4,13),=A(LC17)
         ST    4,92(13)
L484     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L189
L190     EQU   *
         L     12,4(,10)
         MVI   0(2),0
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(SET@PARA)
         BALR  14,15
L189     EQU   *
         L     12,4(,10)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L193     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(DISPLAY@)
         BALR  14,15
         L     2,=A(EXIT@AFT)
         MVI   0(2),1
         L     14,=A(L150)
         BR    14
L194     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(LC5)
         LA    1,88(,13)
         L     15,=V(PRINT@VE)
         BALR  14,15
         L     2,=A(EXIT@AFT)
         MVI   0(2),1
         L     14,=A(L150)
         BR    14
L195     EQU   *
         L     12,4(,10)
         L     2,=A(ZZZ@1383)
         ST    5,0(2)
         L     2,=A(ZZZ@1382)
         MVI   0(2),1
         L     14,=A(L150)
         BR    14
L198     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L199     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(WARN@AGG)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L201     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2015)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L203     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2018)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L205     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(WARN@DIS)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L207     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(WARNINGS)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L209     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F9)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L210     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(WARN@INL)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L212     EQU   *
         L     12,4(,10)
         L     2,=A(LARGER@T)
         ST    5,0(2)
         X     5,=F'-1'
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(WARN@LAR)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L214     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2031)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L216     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(WARN@PAC)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L218     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(WARN@PAD)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L220     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(WARN@SHA)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L222     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2040)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L224     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2042)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L226     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2043)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L228     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2044)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L230     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(WARN@SYS)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L232     EQU   *
         L     12,4(,10)
         L     2,=A(WARN@UNI)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L233     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(WARN@NOT)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L235     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(SET@WUNU)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L236     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2045)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L238     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2046)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L240     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2047)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L242     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2048)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L244     EQU   *
         L     12,4(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(ZZZ@2049)
         STC   2,0(3)
         L     14,=A(L150)
         BR    14
L247     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@53)
         ST    8,0(2)
         L     2,=V(ZZZ@743)
         MVC   0(4,2),=F'1'
         L     14,=A(L150)
         BR    14
L248     EQU   *
         L     12,4(,10)
         L     2,=V(AUX@BASE)
         ST    8,0(2)
         L     14,=A(L150)
         BR    14
L249     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(STRIP@OF)
         BALR  14,15
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         L     14,=A(L150)
         BER   14
         L     2,=V(AUX@BASE)
         ST    3,0(2)
         L     14,=A(L150)
         BR    14
L251     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(DECODE@D)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L252     EQU   *
         L     12,4(,10)
         L     2,=V(DUMP@BAS)
         ST    8,0(2)
         L     14,=A(L150)
         BR    14
L253     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@PIC)
         SLL   5,1
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L254     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@PIE)
         SLL   5,1
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L255     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@ABI)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L256     EQU   *
         L     12,4(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(ZZZ@8)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L258     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@8)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L259     EQU   *
         L     12,4(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(ZZZ@10)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L261     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@10)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L262     EQU   *
         L     12,4(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(ZZZ@13)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L264     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@13)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L265     EQU   *
         L     12,4(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(ZZZ@16)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L267     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@16)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L268     EQU   *
         L     12,4(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(FLAG@ARG)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L270     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@ARG)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L271     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@ARG)
         SLL   5,1
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L272     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@ASY)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L273     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@BOU)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L274     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@715)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L275     EQU   *
         L     12,4(,10)
         L     2,=A(@@V6)
         MVI   0(2),1
         L     2,=V(ZZZ@716)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L276     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@717)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L277     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@718)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L278     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(FIX@REGI)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L279     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FIX@REGI)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L280     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@CAL)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L281     EQU   *
         L     12,4(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(ZZZ@761)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L283     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@CPR)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L284     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@CRO)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L285     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@722)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L286     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@723)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L287     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@DAT)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L288     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@727)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L289     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@728)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L290     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@729)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L291     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=A(LC18)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   L292
         L     2,=V(GLOBAL@D)
         L     2,0(2)
         L     2,0(2)
         ST    15,24(2)
         L     14,=A(L150)
         BR    14
L292     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=A(LC19)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         SLR   2,2
         LTR   15,15
         L     14,=A(L479)
         BNER  14
         L     2,=V(GLOBAL@D)
         L     2,0(2)
         L     2,0(2)
         MVC   24(4,2),=F'2'
         L     14,=A(L150)
         BR    14
L297     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@733)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L298     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@735)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L299     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@736)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L300     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@725)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L301     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@EXC)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L302     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@EXP)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L303     EQU   *
         L     12,4(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(SET@FAST)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L304     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@FIN)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L305     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(FIX@REGI)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L306     EQU   *
         L     12,4(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(ZZZ@762)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L308     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@FLO)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L309     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@737)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L310     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@738)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L311     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@FUN)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L312     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@739)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L313     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@741)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L314     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@742)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L315     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@740)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L316     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@GUE)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L317     EQU   *
         L     12,4(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(ZZZ@764)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L319     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@745)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L320     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@746)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L321     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@INH)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L322     EQU   *
         L     12,4(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(ZZZ@765)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L324     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@750)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L326     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(LC20)
         LR    2,5
         SRL   2,31
         AR    2,5
         SRA   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(SET@PARA)
         BALR  14,15
         MVC   88(4,13),=A(LC21)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(SET@PARA)
         BALR  14,15
         MVC   88(4,13),=A(LC22)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(SET@PARA)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L327     EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@INS)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L328     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@755)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L329     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@756)
         ST    5,0(2)
         B     PGE11
         DS    0F
         LTORG
         DS    0F
PGE11    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         L     14,=A(L150)
         BR    14
L330     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@LEA)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L331     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@LOO)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L332     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@ERR)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L333     EQU   *
         L     12,8(,10)
         L     2,=V(MEM@REPO)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L334     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@MER)
         SLL   5,1
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L335     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@MER)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L336     EQU   *
         L     12,8(,10)
         L     2,=V(GLOBAL@D)
         L     2,0(2)
         MVC   88(4,13),0(2)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1663)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L337     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@MOV)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L338     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@758)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L339     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@NON)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L340     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@770)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L341     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@771)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L342     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@OMI)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L343     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@REG)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L344     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@772)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L345     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@PAC)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L346     EQU   *
         L     12,8(,10)
         L     2,=A(@@V7)
         MVI   0(2),1
         L     2,=V(ZZZ@774)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L347     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@PCC)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L348     EQU   *
         L     12,8(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(ZZZ@769)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L350     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@775)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L351     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@PIC)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L352     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@PIE)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L353     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@776)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L354     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@1707)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L355     EQU   *
         L     12,8(,10)
         L     2,=A(@@V8)
         MVI   0(2),1
         L     2,=V(ZZZ@1706)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L356     EQU   *
         L     12,8(,10)
         L     2,=A(@@V6)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L357
         L     2,=V(ZZZ@716)
         ST    5,0(2)
L357     EQU   *
         L     12,8(,10)
         L     2,=A(@@V9)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L358
         L     2,=V(FLAG@PRO)
         ST    5,0(2)
L358     EQU   *
         L     12,8(,10)
         L     2,=A(@@V10)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L359
         L     2,=V(ZZZ@814)
         ST    5,0(2)
L359     EQU   *
         L     12,8(,10)
         L     2,=A(@@V7)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L360
         L     2,=V(ZZZ@774)
         ST    5,0(2)
L360     EQU   *
         L     12,8(,10)
         L     2,=A(@@V11)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L361
         L     2,=V(ZZZ@810)
         ST    5,0(2)
L361     EQU   *
         L     12,8(,10)
         L     2,=A(@@V12)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         L     14,=A(L150)
         BNER  14
         L     2,=V(FLAG@VAL)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L363     EQU   *
         L     12,8(,10)
         L     2,=A(@@V8)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L364
         L     2,=V(ZZZ@1706)
         ST    5,0(2)
L364     EQU   *
         L     12,8(,10)
         L     2,=A(@@V9)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   L365
         L     2,=V(FLAG@PRO)
         ST    5,0(2)
L365     EQU   *
         L     12,8(,10)
         L     2,=A(@@V12)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         L     14,=A(L150)
         BNER  14
         L     2,=V(FLAG@VAL)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L367     EQU   *
         L     12,8(,10)
         L     2,=A(@@V9)
         MVI   0(2),1
         L     2,=V(FLAG@PRO)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L368     EQU   *
         L     12,8(,10)
         LPR   2,5
         LCR   2,2
         SRL   2,31
         L     3,=A(@@V12)
         STC   2,0(3)
         L     2,=V(FLAG@VAL)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L370     EQU   *
         L     12,8(,10)
         SLR   2,2
         LTR   5,5
         L     14,=A(L479)
         BNER  14
         L     2,=V(FLAG@RAN)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L372     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@RAN)
         ST    8,0(2)
         L     14,=A(L150)
         BR    14
L373     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@RED)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L374     EQU   *
         L     12,8(,10)
         LPR   2,5
         BCTR  2,0
         L     3,=V(FLAG@PCC)
         SRL   2,31
         ST    2,0(3)
         L     14,=A(L150)
         BR    14
L376     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@REG)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L377     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@786)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L378     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@788)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L379     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@789)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L380     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@790)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L381     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@791)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L382     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@ROU)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L383     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@796)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L384     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@797)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L385     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@798)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L386     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@799)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L387     EQU   *
         L     12,8(,10)
         SLR   2,2
         L     14,=A(L479)
         BR    14
L388     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@792)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L389     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@793)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L390     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@794)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L391     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@795)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L392     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@800)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L393     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@800)
         ST    5,0(2)
         LTR   5,5
         L     14,=A(L150)
         BNER  14
         MVC   0(4,2),=F'-1'
         L     14,=A(L150)
         BR    14
L395     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@801)
         MVC   0(4,2),=F'1'
         L     14,=A(L150)
         BR    14
L396     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@801)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L397     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@SHA)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L398     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@805)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L399     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@SIN)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L400     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@STA)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L401     EQU   *
         L     12,8(,10)
         SLR   2,2
         LTR   5,5
         L     14,=A(L479)
         BNER  14
         L     2,=V(STACK@LI)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L403     EQU   *
         L     12,8(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(DECODE@R)
         BALR  14,15
         LTR   15,15
         BNL   L404
         MVC   88(4,13),=A(LC23)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L404     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'6'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@993)
         BALR  14,15
         L     2,=V(STACK@LI)
         ST    15,0(2)
         L     14,=A(L150)
         BR    14
L406     EQU   *
         L     12,8(,10)
         ST    8,88(13)
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(ZZZ@1052)
         BALR  14,15
         MVC   88(4,13),=F'81'
         MVC   92(4,13),=F'6'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@980)
         BALR  14,15
         L     2,=V(STACK@LI)
         ST    15,0(2)
         L     14,=A(L150)
         BR    14
L407     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@808)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L408     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@809)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L409     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@SYN)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L410     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@TES)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L411     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@THR)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L412     EQU   *
         L     12,8(,10)
         L     2,=V(TIME@REP)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L413     EQU   *
         L     12,8(,10)
         ST    8,88(13)
         MVC   92(4,13),=A(LC24)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   L414
         L     2,=V(FLAG@TLS)
         MVC   0(4,2),=F'1'
         L     14,=A(L150)
         BR    14
L414     EQU   *
         L     12,8(,10)
         ST    8,88(13)
         MVC   92(4,13),=A(LC25)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   L416
         L     2,=V(FLAG@TLS)
         MVC   0(4,2),=F'2'
         L     14,=A(L150)
         BR    14
L416     EQU   *
         L     12,8(,10)
         ST    8,88(13)
         MVC   92(4,13),=A(LC26)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   L418
         L     2,=V(FLAG@TLS)
         MVC   0(4,2),=F'3'
         L     14,=A(L150)
         BR    14
L418     EQU   *
         L     12,8(,10)
         ST    8,88(13)
         MVC   92(4,13),=A(LC27)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   L420
         L     2,=V(FLAG@TLS)
         MVC   0(4,2),=F'4'
         L     14,=A(L150)
         BR    14
L420     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(LC28)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L422     EQU   *
         L     12,8(,10)
         L     2,=A(@@V11)
         MVI   0(2),1
         L     2,=V(ZZZ@810)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L423     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@811)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L424     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@812)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L425     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@UNI)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L426     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@813)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L427     EQU   *
         L     12,8(,10)
         L     2,=A(@@V10)
         MVI   0(2),1
         L     2,=V(ZZZ@814)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L428     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@815)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L429     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@816)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L430     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@UNW)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L431     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@VER)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L432     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@WEB)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L433     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@WRA)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L434     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@WRI)
         ST    5,0(2)
         LTR   5,5
         L     14,=A(L150)
         BER   14
         MVC   88(4,13),=A(LC29)
         LA    1,88(,13)
         L     15,=V(INFORM)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L436     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@819)
         ST    5,0(2)
         L     14,=A(L150)
         BR    14
L437     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'1'
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L438     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'2'
         MVC   92(4,13),=F'0'
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L439     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'0'
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L440     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'2'
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L442     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'1'
         X     7,=F'346'
         LPR   2,7
         BCTR  2,0
         SRL   2,31
         ST    2,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         L     14,=A(L150)
         BR    14
L444     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'6'
         MVC   92(4,13),=F'0'
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         B     L150
L446     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'5'
         X     7,=F'349'
         LPR   2,7
         BCTR  2,0
         SRL   2,31
         ST    2,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         B     L150
L448     EQU   *
         L     12,8(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(SET@TARG)
         BALR  14,15
         B     L150
L449     EQU   *
         L     12,8(,10)
         L     2,=V(ASM@FILE)
         ST    8,0(2)
         B     L150
L450     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@1707)
         MVC   0(4,2),=F'1'
         B     L150
L451     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@1636)
         MVC   0(4,2),=F'1'
         B     L150
L452     EQU   *
         L     12,8(,10)
         L     2,=V(ZZZ@1636)
         MVC   0(4,2),=F'1'
         L     2,=V(FLAG@PED)
         MVC   0(4,2),=F'1'
         B     L150
L453     EQU   *
         L     12,8(,10)
         L     2,=V(QUIET@FL)
         MVC   0(4,2),=F'1'
         B     L150
L454     EQU   *
         L     12,8(,10)
         L     2,=A(ZZZ@2008)
         MVI   0(2),1
         B     L150
L455     EQU   *
         L     12,8(,10)
         L     2,=A(INHIBIT@)
         MVI   0(2),1
         B     L150
L479     EQU   *
         L     12,8(,10)
         ST    2,124(13)
L150     EQU   *
         L     12,8(,10)
         L     15,120(13)
         LTR   15,15
         BE    L457
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L457     EQU   *
         L     12,8(,10)
         L     2,124(13)
         LTR   2,2
         BNE   L131
         LA    2,1(0,0)
         MVC   88(4,13),=A(LC30)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L131     EQU   *
         L     12,8(,10)
         A     2,108(13)
         ST    2,108(13)
         CL    2,0(11)
         L     14,=A(L460)
         BLR   14
L472     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@PIE)
         L     3,0(2)
         LTR   3,3
         BE    L462
         L     2,=V(FLAG@PIC)
         ST    3,0(2)
L462     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@PIC)
         L     2,0(2)
         LTR   2,2
         BE    L463
         LTR   3,3
         BNE   L463
         L     2,=V(FLAG@SHL)
         MVC   0(4,2),=F'1'
L463     EQU   *
         L     12,8(,10)
         L     4,=V(ZZZ@765)
         L     3,0(4)
         LA    2,2(0,0)
         CLR   3,2
         BNE   L464
         MVC   0(4,4),=F'0'
         B     L465
L464     EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@REA)
         ST    3,0(2)
L465     EQU   *
         L     12,8(,10)
         L     5,=V(ZZZ@1616)
         L     3,0(5)
         LTR   3,3
         L     14,=A(L466)
         BNER  14
         MVC   0(4,4),=F'1'
         L     2,=A(WARN@INL)
         STC   3,0(2)
         L     2,=A(WARN@UNI)
         L     2,0(2)
         LA    15,1(0,0)
         CLR   2,15
         B     PGE12
         DS    0F
         LTORG
         DS    0F
PGE12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         L     14,=A(L466)
         BNER  14
         MVC   88(4,13),=A(LC31)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L466     EQU   *
         L     12,12(,10)
         L     3,=V(FLAG@REA)
         L     2,0(3)
         LA    4,2(0,0)
         CLR   2,4
         BNE   L112
         L     2,=V(ZZZ@765)
         MVC   0(4,3),0(2)
L112     EQU   *
         L     12,12(,10)
* Function decode_options epilogue
         PDPEPIL
* Function decode_options literal pool
         DS    0F
         LTORG
* Function decode_options page table
         DS    0F
PGT10    EQU   *
         DC    A(PG10)
         DC    A(PG11)
         DC    A(PG12)
         DC    A(PG13)
* X-var in_fnames
         ENTRY IN@FNAME
         DS    0F
IN@FNAME EQU   *
         DC    4X'00'
* X-var num_in_fnames
         ENTRY NUM@IN@F
         DS    0F
NUM@IN@F EQU   *
         DC    4X'00'
* X-var use_gnu_debug_info_extensions
         ENTRY USE@GNU@
         DS    0F
USE@GNU@ EQU   *
         DC    1X'00'
* X-var inhibit_warnings
         ENTRY INHIBIT@
         DS    0F
INHIBIT@ EQU   *
         DC    1X'00'
* X-var warn_system_headers
         ENTRY WARN@SYS
         DS    0F
WARN@SYS EQU   *
         DC    1X'00'
* X-var extra_warnings
         ENTRY EXTRA@WA
         DS    0F
EXTRA@WA EQU   *
         DC    1X'00'
* X-var warnings_are_errors
         ENTRY WARNINGS
         DS    0F
WARNINGS EQU   *
         DC    1X'00'
* X-var ZZZ_2045
         ENTRY ZZZ@2045
         DS    0F
ZZZ@2045 EQU   *
         DC    1X'00'
* X-var ZZZ_2046
         ENTRY ZZZ@2046
         DS    0F
ZZZ@2046 EQU   *
         DC    1X'00'
* X-var ZZZ_2047
         ENTRY ZZZ@2047
         DS    0F
ZZZ@2047 EQU   *
         DC    1X'00'
* X-var ZZZ_2049
         ENTRY ZZZ@2049
         DS    0F
ZZZ@2049 EQU   *
         DC    1X'00'
* X-var ZZZ_2048
         ENTRY ZZZ@2048
         DS    0F
ZZZ@2048 EQU   *
         DC    1X'00'
* X-var warn_notreached
         ENTRY WARN@NOT
         DS    0F
WARN@NOT EQU   *
         DC    1X'00'
* X-var warn_inline
         ENTRY WARN@INL
         DS    0F
WARN@INL EQU   *
         DC    1X'00'
* X-var warn_uninitialized
         ENTRY WARN@UNI
         DS    0F
WARN@UNI EQU   *
         DC    4X'00'
* X-var warn_shadow
         ENTRY WARN@SHA
         DS    0F
WARN@SHA EQU   *
         DC    1X'00'
* X-var ZZZ_2042
         ENTRY ZZZ@2042
         DS    0F
ZZZ@2042 EQU   *
         DC    1X'00'
* X-var ZZZ_2043
         ENTRY ZZZ@2043
         DS    0F
ZZZ@2043 EQU   *
         DC    1X'00'
* X-var ZZZ_2044
         ENTRY ZZZ@2044
         DS    0F
ZZZ@2044 EQU   *
         DC    1X'00'
* X-var ZZZ_2031
         ENTRY ZZZ@2031
         DS    0F
ZZZ@2031 EQU   *
         DC    1X'00'
* X-var ZZZ_2015
         ENTRY ZZZ@2015
         DS    0F
ZZZ@2015 EQU   *
         DC    1X'00'
* X-var warn_larger_than
         ENTRY WARN@LAR
         DS    0F
WARN@LAR EQU   *
         DC    1X'00'
* X-var larger_than_size
         ENTRY LARGER@T
         DS    0F
LARGER@T EQU   *
         DC    4X'00'
* X-var warn_aggregate_return
         ENTRY WARN@AGG
         DS    0F
WARN@AGG EQU   *
         DC    1X'00'
* X-var warn_packed
         ENTRY WARN@PAC
         DS    0F
WARN@PAC EQU   *
         DC    1X'00'
* X-var warn_padded
         ENTRY WARN@PAD
         DS    0F
WARN@PAD EQU   *
         DC    1X'00'
* X-var warn_disabled_optimization
         ENTRY WARN@DIS
         DS    0F
WARN@DIS EQU   *
         DC    1X'00'
* X-var ZZZ_2040
         ENTRY ZZZ@2040
         DS    0F
ZZZ@2040 EQU   *
         DC    1X'00'
* X-var ZZZ_1383
         ENTRY ZZZ@1383
         DS    0F
ZZZ@1383 EQU   *
         DC    4X'00'
* X-var ZZZ_1382
         ENTRY ZZZ@1382
         DS    0F
ZZZ@1382 EQU   *
         DC    1X'00'
* X-var exit_after_options
         ENTRY EXIT@AFT
         DS    0F
EXIT@AFT EQU   *
         DC    1X'00'
* X-var ZZZ_2008
         ENTRY ZZZ@2008
         DS    0F
ZZZ@2008 EQU   *
         DC    1X'00'
         DS    0F
@@V3     EQU   *
         DC    1X'00'
         DS    0F
@@V8     EQU   *
         DC    1X'00'
         DS    0F
@@V9     EQU   *
         DC    1X'00'
         DS    0F
@@V10    EQU   *
         DC    1X'00'
         DS    0F
@@V11    EQU   *
         DC    1X'00'
         DS    0F
@@V12    EQU   *
         DC    1X'00'
         DS    0F
@@V7     EQU   *
         DC    1X'00'
         DS    0F
@@V6     EQU   *
         DC    1X'00'
         END
