         COPY  PDPTOP
         CSECT
* Program text area
LC0      EQU   *
         DC    C'<stdin>'
         DC    X'0'
LC1      EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* Function push_list,F1 prologue
@@F1     PDPPRLG CINDEX=0,FRAME=104,BASER=12,ENTRY=NO
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function push_list code
         L     15,0(11)
         L     3,4(11)
         L     2,4(15)
         LTR   2,2
         BNE   L3
         L     2,0(15)
         LTR   2,2
         BE    L2
L3       EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'108'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L2       EQU   *
         MVC   4(4,15),0(3)
         L     2,0(3)
         LTR   2,2
         BE    L4
         ST    15,0(2)
L4       EQU   *
         ST    15,0(3)
* Function push_list epilogue
         PDPEPIL
* Function push_list literal pool
         DS    0F
         LTORG
* Function push_list page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         DS    0F
* X-func remove_list prologue
REMOVE@L PDPPRLG CINDEX=1,FRAME=88,BASER=12,ENTRY=YES
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function remove_list code
         L     15,0(11)
         L     2,0(15)
         LTR   2,2
         BE    L6
         MVC   4(4,2),4(15)
         B     L7
L6       EQU   *
         L     2,4(11)
         MVC   0(4,2),4(15)
L7       EQU   *
         L     2,4(15)
         LTR   2,2
         BE    L8
         MVC   0(4,2),0(15)
L8       EQU   *
         MVC   0(4,15),=F'0'
         MVC   4(4,15),=F'0'
* Function remove_list epilogue
         PDPEPIL
* Function remove_list literal pool
         DS    0F
         LTORG
* Function remove_list page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* X-func pop_list prologue
POP@LIST PDPPRLG CINDEX=2,FRAME=96,BASER=12,ENTRY=YES
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function pop_list code
         L     15,0(11)
         L     2,0(15)
         LTR   2,2
         BE    L10
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
L10      EQU   *
         LR    15,2
* Function pop_list epilogue
         PDPEPIL
* Function pop_list literal pool
         DS    0F
         LTORG
* Function pop_list page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
         DS    0F
* Function free_dlist,F3 prologue
@@F3     PDPPRLG CINDEX=3,FRAME=88,BASER=12,ENTRY=NO
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function free_dlist code
         L     2,0(11)
         MVC   0(4,2),=F'0'
* Function free_dlist epilogue
         PDPEPIL
* Function free_dlist literal pool
         DS    0F
         LTORG
* Function free_dlist page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
         DS    0F
* X-func put_web prologue
PUT@WEB  PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=YES
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function put_web code
         L     4,0(11)
         L     3,4(11)
         LA    2,11(0,0)
         CLR   3,2
         BH    L28
         LA    15,1(0,0)
         SLL   15,0(3)
         LR    2,15
         N     2,=F'4035'
         LTR   2,2
         BNE   L21
         LR    2,15
         N     2,=F'8'
         LTR   2,2
         BNE   L23
         N     15,=F'4'
         LTR   15,15
         BNE   L22
         B     L28
L21      EQU   *
         MVC   88(4,13),136(4)
         LR    2,3
         SLL   2,2
         A     2,=V(WEB@LIST)
         B     L29
L22      EQU   *
         MVC   88(4,13),136(4)
         MVC   92(4,13),=V(WEB@LIST)
         B     L30
L23      EQU   *
         L     2,12(4)
         LTR   2,2
         BE    L24
         MVC   88(4,13),136(4)
         LA    3,4(0,0)
         L     2,=V(WEB@LIST)
         LA    2,16(0,2)
         B     L29
L24      EQU   *
         L     2,44(4)
         LTR   2,2
         BE    L26
         MVC   88(4,13),136(4)
         LA    3,5(0,0)
         L     2,=V(WEB@LIST)
         LA    2,20(0,2)
         B     L29
L26      EQU   *
         MVC   88(4,13),136(4)
         L     2,=V(WEB@LIST)
         LA    2,12(0,2)
L29      EQU   *
         ST    2,92(13)
         B     L30
L28      EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'197'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L30      EQU   *
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         N     3,=F'31'
         SLL   3,12
         L     2,40(4)
         N     2,=F'-126977'
         OR    2,3
         ST    2,40(4)
* Function put_web epilogue
         PDPEPIL
* Function put_web literal pool
         DS    0F
         LTORG
* Function put_web page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
         DS    0F
* X-func alias prologue
ALIAS    PDPPRLG CINDEX=5,FRAME=88,BASER=12,ENTRY=YES
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function alias code
         L     15,0(11)
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'40960'
         CLR   2,3
         BNE   L36
L34      EQU   *
         L     15,128(15)
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'40960'
         CLR   2,3
         BE    L34
L36      EQU   *
* Function alias epilogue
         PDPEPIL
* Function alias literal pool
         DS    0F
         LTORG
* Function alias page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
         DS    0F
* X-func reset_lists prologue
RESET@LI PDPPRLG CINDEX=6,FRAME=104,BASER=12,ENTRY=YES
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function reset_lists code
         L     3,=V(WEB@LIST)
         L     2,12(3)
         LTR   2,2
         BNE   L39
         L     2,16(3)
         LTR   2,2
         BNE   L39
         L     2,20(3)
         LTR   2,2
         BNE   L39
         L     2,24(3)
         LTR   2,2
         BNE   L39
         L     2,28(3)
         LTR   2,2
         BNE   L39
         L     2,32(3)
         LTR   2,2
         BE    L141
L39      EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'215'
         B     L140
L79      EQU   *
         L     3,8(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     4,=F'36864'
         CLR   2,4
         BE    L43
         L     4,=F'4096'
         CLR   2,4
         BNE   L42
L43      EQU   *
         MVC   88(4,13),136(3)
         L     2,=V(WEB@LIST)
         LA    2,4(0,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(3)
         N     2,=F'-126977'
         O     2,=F'4096'
         ST    2,40(3)
         B     L141
L42      EQU   *
         MVC   88(4,13),136(3)
         MVC   92(4,13),=V(WEB@LIST)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         NC    40(4,3),=F'-126977'
L141     EQU   *
         L     3,=V(WEB@LIST)
         LA    3,40(0,3)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   L79
         B     L80
L99      EQU   *
         L     3,8(2)
         MVC   88(4,13),136(3)
         L     4,=V(WEB@LIST)
         LA    4,4(0,4)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(3)
         N     2,=F'-126977'
         O     2,=F'4096'
         ST    2,40(3)
L80      EQU   *
         L     2,=V(WEB@LIST)
         LA    2,36(0,2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   L99
         B     L100
L119     EQU   *
         L     2,8(2)
         MVC   88(4,13),136(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         NC    40(4,2),=F'-126977'
L100     EQU   *
         L     3,=V(WEB@LIST)
         LA    3,44(0,3)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         LR    2,15
         L     3,=V(WEB@LIST)
         LTR   15,15
         BNE   L119
         L     2,4(3)
L138     EQU   *
         LTR   2,2
         BE    L132
         L     3,8(2)
         L     15,80(3)
         LTR   15,15
         BE    L123
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   88(4,13),80(3)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   80(4,3),=F'0'
L123     EQU   *
         MVC   80(4,3),=F'0'
         L     2,4(2)
         B     L138
L132     EQU   *
         SLR   15,15
         L     4,=V(NUM@WEBS)
L139     EQU   *
         CL    15,0(4)
         BNL   L134
         L     2,=V(ID2WEB)
         L     3,0(2)
         LR    2,15
         SLL   2,2
         L     2,0(2,3)
         L     2,40(2)
         N     2,=F'126976'
         LTR   2,2
         BE    L128
         L     3,=F'4096'
         CLR   2,3
         BE    L128
         L     3,=F'8192'
         CLR   2,3
         BE    L128
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'250'
L140     EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L128     EQU   *
         A     15,=F'1'
         B     L139
L134     EQU   *
         MVC   88(4,13),=A(@@V1)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         MVC   88(4,13),=A(@@V2)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         MVC   88(4,13),=A(@@V3)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         MVC   88(4,13),=A(@@V4)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         MVC   88(4,13),=A(@@V5)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
* Function reset_lists epilogue
         PDPEPIL
* Function reset_lists literal pool
         DS    0F
         LTORG
* Function reset_lists page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
         DS    0F
* X-func remove_web_from_list prologue
REMOVE@W PDPPRLG CINDEX=7,FRAME=96,BASER=12,ENTRY=YES
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function remove_web_from_list code
         L     3,0(11)
         L     15,40(3)
         LR    2,15
         N     2,=F'126976'
         L     4,=F'8192'
         CLR   2,4
         BNE   L143
         MVC   88(4,13),136(3)
         MVC   92(4,13),=V(WEB@LIST)
         B     L145
L143     EQU   *
         MVC   88(4,13),136(3)
         SRL   15,10
         N     15,=F'124'
         A     15,=V(WEB@LIST)
         ST    15,92(13)
L145     EQU   *
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
* Function remove_web_from_list epilogue
         PDPEPIL
* Function remove_web_from_list literal pool
         DS    0F
         LTORG
* Function remove_web_from_list page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
         DS    0F
* Function enable_move,F7 prologue
@@F7     PDPPRLG CINDEX=8,FRAME=104,BASER=12,ENTRY=NO
         B     FEN8
         LTORG
FEN8     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         LR    11,1
         L     10,=A(PGT8)
* Function enable_move code
         L     2,0(11)
         L     3,132(2)
         LTR   3,3
         BE    L162
L160     EQU   *
         L     15,4(3)
         L     2,12(15)
         LA    4,4(0,0)
         CLR   2,4
         BNE   L149
         MVC   88(4,13),16(15)
         MVC   92(4,13),=A(@@V5)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         L     2,4(3)
         MVC   88(4,13),16(2)
         MVC   92(4,13),=A(@@V1)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         MVC   12(4,2),=F'0'
L149     EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   L160
L162     EQU   *
* Function enable_move epilogue
         PDPEPIL
* Function enable_move literal pool
         DS    0F
         LTORG
* Function enable_move page table
         DS    0F
PGT8     EQU   *
         DC    A(PG8)
         DS    0F
* Function decrement_degree,F8 prologue
@@F8     PDPPRLG CINDEX=9,FRAME=104,BASER=12,ENTRY=NO
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function decrement_degree code
         L     4,0(11)
         L     5,48(4)
         LR    15,5
         S     15,4(11)
         ST    15,48(4)
         L     3,40(4)
         LR    2,3
         N     2,=F'126976'
         L     6,=F'8192'
         CR    2,6
         BE    L166
         C     15,100(4)
         BL    L167
         B     L164
L166     EQU   *
         LTR   15,15
         BH    L164
L167     EQU   *
         N     3,=F'126976'
         L     2,=F'8192'
         CR    3,2
         BE    L168
         C     5,100(4)
         BNL   L169
         B     L164
L168     EQU   *
         LTR   5,5
         BNH   L164
L169     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         L     2,72(4)
L214     EQU   *
         LTR   2,2
         BE    L213
         L     5,4(2)
         L     3,40(5)
         N     3,=F'126976'
         L     6,=F'32768'
         CLR   3,6
         BE    L172
         L     6,=F'40960'
         CLR   3,6
         BE    L172
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
L172     EQU   *
         L     2,0(2)
         B     L214
L213     EQU   *
         L     2,40(4)
         N     2,=F'126976'
         L     3,=F'24576'
         CLR   2,3
         BE    L164
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@W)
         BALR  14,15
         L     2,132(4)
         LTR   2,2
         BE    L176
         MVC   88(4,13),136(4)
         L     6,=V(WEB@LIST)
         LA    6,24(0,6)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         B     L216
L176     EQU   *
         LA    3,3(0,0)
         L     2,12(4)
         LTR   2,2
         BE    L206
         MVC   88(4,13),136(4)
         LA    3,4(0,0)
         L     2,=V(WEB@LIST)
         LA    2,16(0,2)
         B     L217
L206     EQU   *
         L     2,44(4)
         LTR   2,2
         BE    L208
         MVC   88(4,13),136(4)
         LA    3,5(0,0)
         L     6,=V(WEB@LIST)
         LA    6,20(0,6)
         ST    6,92(13)
         B     L215
L208     EQU   *
         MVC   88(4,13),136(4)
         L     2,=V(WEB@LIST)
         LA    2,12(0,2)
L217     EQU   *
         ST    2,92(13)
L215     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         SLL   3,12
L216     EQU   *
         L     2,40(4)
         N     2,=F'-126977'
         OR    2,3
         ST    2,40(4)
L164     EQU   *
* Function decrement_degree epilogue
         PDPEPIL
* Function decrement_degree literal pool
         DS    0F
         LTORG
* Function decrement_degree page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
         DS    0F
* Function remove_move,F11 prologue
@@F11    PDPPRLG CINDEX=10,FRAME=104,BASER=12,ENTRY=NO
         B     FEN10
         LTORG
FEN10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         LR    11,1
         L     10,=A(PGT10)
* Function remove_move code
         L     4,0(11)
         L     5,4(11)
         L     15,132(4)
         LTR   15,15
         BE    L220
         L     2,4(15)
         CLR   2,5
         BNE   L236
         MVC   132(4,4),0(15)
         B     L220
L235     EQU   *
         L     2,4(3)
         CLR   2,5
         BE    L223
         LR    15,3
L236     EQU   *
         L     3,0(15)
         LTR   3,3
         BNE   L235
L223     EQU   *
         L     2,0(15)
         LTR   2,2
         BE    L220
         MVC   0(4,15),0(2)
L220     EQU   *
         L     15,132(4)
         LTR   15,15
         BE    L234
L231     EQU   *
         L     2,4(15)
         CLR   2,5
         BNE   L229
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'504'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L229     EQU   *
         L     15,0(15)
         LTR   15,15
         BNE   L231
L234     EQU   *
* Function remove_move epilogue
         PDPEPIL
* Function remove_move literal pool
         DS    0F
         LTORG
* Function remove_move page table
         DS    0F
PGT10    EQU   *
         DC    A(PG10)
         DS    0F
* X-func merge_moves prologue
MERGE@MO PDPPRLG CINDEX=11,FRAME=96,BASER=12,ENTRY=YES
         B     FEN11
         LTORG
FEN11    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         LR    11,1
         L     10,=A(PGT11)
* Function merge_moves code
         L     6,0(11)
         L     7,4(11)
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         LR    4,15
         L     3,132(6)
L253     EQU   *
         LTR   3,3
         BE    L250
         ST    4,88(13)
         L     2,4(3)
         L     2,0(2)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     3,0(3)
         B     L253
L250     EQU   *
         L     3,132(7)
L254     EQU   *
         LTR   3,3
         BE    L252
         L     5,0(3)
         ST    4,88(13)
         L     2,4(3)
         L     2,0(2)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   L244
         MVC   0(4,3),132(6)
         ST    3,132(6)
L244     EQU   *
         LR    3,5
         B     L254
L252     EQU   *
         LTR   4,4
         BE    L247
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L247     EQU   *
         MVC   132(4,7),=F'0'
* Function merge_moves epilogue
         PDPEPIL
* Function merge_moves literal pool
         DS    0F
         LTORG
* Function merge_moves page table
         DS    0F
PGT11    EQU   *
         DC    A(PG11)
         DS    0F
* Function add_worklist,F12 prologue
@@F12    PDPPRLG CINDEX=12,FRAME=104,BASER=12,ENTRY=NO
         B     FEN12
         LTORG
FEN12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         LR    11,1
         L     10,=A(PGT12)
* Function add_worklist code
         L     3,0(11)
         L     2,40(3)
         N     2,=F'126976'
         L     4,=F'8192'
         CLR   2,4
         BE    L255
         L     2,132(3)
         LTR   2,2
         BNE   L255
         L     2,48(3)
         C     2,100(3)
         BNL   L255
         MVC   88(4,13),136(3)
         L     2,=V(WEB@LIST)
         LA    2,24(0,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         LA    4,3(0,0)
         L     2,12(3)
         LTR   2,2
         BE    L270
         MVC   88(4,13),136(3)
         LA    4,4(0,0)
         L     2,=V(WEB@LIST)
         LA    2,16(0,2)
         B     L276
L270     EQU   *
         L     2,44(3)
         LTR   2,2
         BE    L272
         MVC   88(4,13),136(3)
         LA    4,5(0,0)
         L     2,=V(WEB@LIST)
         LA    2,20(0,2)
         B     L276
L272     EQU   *
         MVC   88(4,13),136(3)
         L     2,=V(WEB@LIST)
         LA    2,12(0,2)
L276     EQU   *
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         SLL   4,12
         L     2,40(3)
         N     2,=F'-126977'
         OR    2,4
         ST    2,40(3)
L255     EQU   *
* Function add_worklist epilogue
         PDPEPIL
* Function add_worklist literal pool
         DS    0F
         LTORG
* Function add_worklist page table
         DS    0F
PGT12    EQU   *
         DC    A(PG12)
         DS    0F
* Function ok,F13 prologue
@@F13    PDPPRLG CINDEX=13,FRAME=152,BASER=12,ENTRY=NO
         B     FEN13
         LTORG
FEN13    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         LR    11,1
         L     10,=A(PGT13)
* Function ok code
         SLR   6,6
         SLR   7,7
         ST    6,88(13)
         ST    7,4+88(13)
         ST    6,96(13)
         ST    7,4+96(13)
         ST    6,104(13)
         ST    7,4+104(13)
         ST    6,112(13)
         ST    7,4+112(13)
         ST    6,120(13)
         ST    7,4+120(13)
         ST    6,128(13)
         ST    7,4+128(13)
         ST    6,136(13)
         ST    7,4+136(13)
         ST    6,144(13)
         ST    7,4+144(13)
         L     9,0(11)
         L     2,4(11)
         L     8,32(2)
         LA    3,15(0,0)
         CR    8,3
         BH    L279
         LR    2,8
         X     2,=F'1'
         N     2,=F'1'
         LTR   2,2
         BNE   L278
         L     2,60(9)
         IC    2,2(2)
         CLM   2,1,=XL1'07'
         BE    L327
         CLM   2,1,=XL1'0A'
         BE    L327
         B     L278
L279     EQU   *
         L     2,60(9)
         IC    3,2(2)
         LA    2,247(,3)
         CLM   2,1,=XL1'01'
         BNH   L278
         CLM   3,1,=XL1'10'
         BE    L278
         CLM   3,1,=XL1'11'
         BNE   L327
L278     EQU   *
         L     2,60(9)
         L     3,=V(MODE@SIZ)
         LA    4,15(0,0)
         CR    8,4
         BNH   L281
         SLR   4,4
         IC    4,2(2)
         LR    2,4
         SLR   4,4
         IC    4,0(3,2)
         LR    2,4
         A     2,=F'7'
         SRA   2,3
         B     L282
L281     EQU   *
         SLR   4,4
         IC    4,2(2)
         LR    2,4
         SLR   4,4
         IC    4,0(3,2)
         LR    2,4
         A     2,=F'3'
         SRA   2,2
L282     EQU   *
         LR    15,2
         LTR   2,2
         BE    L277
         LR    5,2
         BCTR  5,0
         L     2,=F'-1'
         CLR   5,2
         BE    L317
L290     EQU   *
         LR    3,8
         AR    3,5
         L     2,=V(NEVER@US)
         L     2,0(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L327
         L     2,84(9)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L327
         L     2,=V(NUM@WEBS)
         L     7,0(2)
         M     6,0(9)
         SLL   3,2
         L     2,=V(HARDREG2)
         L     2,0(3,2)
         L     4,0(2)
         AR    4,7
         LR    2,4
         SRL   2,5
         SLL   2,2
         L     3,=V(SUP@IGRA)
         A     2,0(3)
         N     4,=F'31'
         L     2,12(2)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BNE   L327
         BCTR  5,0
         L     3,=F'-1'
         CLR   5,3
         BNE   L290
L317     EQU   *
         L     6,72(9)
L322     EQU   *
         LTR   6,6
         BE    L319
         L     5,4(6)
         L     4,40(5)
         LR    2,4
         N     2,=F'126976'
         L     7,=F'32768'
         CLR   2,7
         BE    L293
         L     8,=F'40960'
         CLR   2,8
         BE    L293
         L     3,48(5)
         L     9,=F'8192'
         CR    2,9
         BE    L298
         C     3,100(5)
         BL    L293
         B     L299
L298     EQU   *
         LTR   3,3
         BNH   L293
L299     EQU   *
         N     4,=F'126976'
         L     2,=F'8192'
         CLR   4,2
         BE    L293
         L     3,=V(IGRAPH)
         L     7,0(3)
         L     4,4(11)
         L     15,0(4)
         L     4,0(5)
         CLR   15,4
         BNL   L300
         LR    8,4
         BCTR  8,0
         ST    8,92(13)
         L     2,88(13)
         L     3,4+88(13)
         MR    2,4
         ST    2,88(13)
         ST    3,4+88(13)
         L     2,92(13)
         SRL   2,1
         AR    2,15
         B     L323
L300     EQU   *
         LR    3,15
         BCTR  3,0
         ST    3,100(13)
         L     8,96(13)
         L     9,4+96(13)
         MR    8,15
         ST    8,96(13)
         ST    9,4+96(13)
         L     2,100(13)
         SRL   2,1
         AR    2,4
L323     EQU   *
         SRL   2,5
         SLL   2,2
         A     2,=F'8'
         L     3,4(7,2)
         CLR   15,4
         BNL   L302
         LR    9,4
         BCTR  9,0
         ST    9,108(13)
         L     8,104(13)
         L     9,4+104(13)
         MR    8,4
         ST    8,104(13)
         ST    9,4+104(13)
         L     2,108(13)
         SRL   2,1
         AR    2,15
         B     L324
L302     EQU   *
         LR    9,15
         BCTR  9,0
         ST    9,116(13)
         L     8,112(13)
         L     9,4+112(13)
         MR    8,15
         ST    8,112(13)
         ST    9,4+112(13)
         L     2,116(13)
         SRL   2,1
         AR    2,4
L324     EQU   *
         N     2,=F'31'
         SRL   3,0(2)
         N     3,=F'1'
         LTR   3,3
         BNE   L293
         L     15,8(6)
         LTR   15,15
         BE    L277
L314     EQU   *
         L     9,=V(IGRAPH)
         L     7,0(9)
         L     4,8(15)
         L     2,4(11)
         L     5,0(2)
         L     3,0(4)
         CLR   5,3
         BNL   L310
         LR    8,3
         BCTR  8,0
         ST    8,124(13)
         L     8,120(13)
         L     9,4+120(13)
         MR    8,3
         ST    8,120(13)
         ST    9,4+120(13)
         L     2,124(13)
         SRL   2,1
         AR    2,5
         B     L325
L310     EQU   *
         LR    9,5
         BCTR  9,0
         ST    9,132(13)
         L     8,128(13)
         L     9,4+128(13)
         MR    8,5
         ST    8,128(13)
         ST    9,4+128(13)
         L     2,132(13)
         SRL   2,1
         AR    2,3
L325     EQU   *
         SRL   2,5
         SLL   2,2
         A     2,=F'8'
         L     3,4(7,2)
         L     4,0(4)
         CLR   5,4
         BNL   L312
         LR    9,4
         BCTR  9,0
         ST    9,140(13)
         L     8,136(13)
         L     9,4+136(13)
         MR    8,4
         ST    8,136(13)
         ST    9,4+136(13)
         L     2,140(13)
         SRL   2,1
         AR    2,5
         B     L326
L312     EQU   *
         LR    9,5
         BCTR  9,0
         ST    9,148(13)
         L     8,144(13)
         L     9,4+144(13)
         MR    8,5
         ST    8,144(13)
         ST    9,4+144(13)
         L     2,148(13)
         SRL   2,1
         AR    2,4
L326     EQU   *
         N     2,=F'31'
         SRL   3,0(2)
         X     3,=F'1'
         N     3,=F'1'
         LTR   3,3
         BE    L308
L327     EQU   *
         SLR   15,15
         B     L277
L308     EQU   *
         L     15,0(15)
         LTR   15,15
         BNE   L314
L293     EQU   *
         L     6,0(6)
         B     L322
L319     EQU   *
         LA    15,1(0,0)
L277     EQU   *
* Function ok epilogue
         PDPEPIL
* Function ok literal pool
         DS    0F
         LTORG
* Function ok page table
         DS    0F
PGT13    EQU   *
         DC    A(PG13)
         DS    0F
* Function combine,F16 prologue
@@F16    PDPPRLG CINDEX=14,FRAME=112,BASER=12,ENTRY=NO
         B     FEN14
         LTORG
FEN14    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG14     EQU   *
         LR    11,1
         L     10,=A(PGT14)
* Function combine code
         L     7,0(11)
         L     8,4(11)
         CLR   7,8
         BE    L330
         L     2,40(8)
         N     2,=F'126976'
         L     3,=F'40960'
         CLR   2,3
         BNE   L329
L330     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'699'
         B     L414
L329     EQU   *
         SLR   5,5
         L     3,4(7)
         L     2,=V(MAX@NORM)
         L     4,0(2)
         CLR   3,4
         BL    L332
         LA    5,1(0,0)
L332     EQU   *
         SLR   3,3
         L     2,4(8)
         CLR   2,4
         BL    L333
         LA    3,1(0,0)
L333     EQU   *
         CLR   5,3
         BE    L331
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'701'
         B     L414
L331     EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@W)
         BALR  14,15
         MVC   88(4,13),136(8)
         L     4,=V(WEB@LIST)
         LA    4,40(0,4)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(8)
         N     2,=F'-126977'
         O     2,=F'40960'
         ST    2,40(8)
         ST    7,128(8)
         OC    40(4,7),=F'536870912'
         OC    40(4,8),=F'536870912'
         L     2,28(7)
         A     2,28(8)
         A     2,=F'1'
         ST    2,28(7)
         L     2,=V(ZZZ@783)
         L     2,0(2)
         LTR   2,2
         BE    L351
         L     2,40(7)
         N     2,=F'126976'
         L     5,=F'8192'
         CLR   2,5
         BE    L351
         L     9,20(7)
         A     9,20(8)
         ST    9,20(7)
L351     EQU   *
         ST    7,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(MERGE@MO)
         BALR  14,15
         L     5,72(8)
L411     EQU   *
         LTR   5,5
         BE    L407
         MVC   104(4,13),4(5)
         LR    6,7
         L     4,44(8)
         A     4,=F'1'
         L     2,40(7)
         N     2,=F'126976'
         L     3,=F'8192'
         CR    2,3
         BNE   L356
         L     2,32(7)
         L     4,=V(MODE@SIZ)
         L     3,60(8)
         LA    9,15(0,0)
         CR    2,9
         BNH   L357
         SLR   2,2
         IC    2,2(3)
         SLR   3,3
         IC    3,0(4,2)
         LR    4,3
         A     4,=F'7'
         SRA   4,3
         B     L356
L357     EQU   *
         SLR   2,2
         IC    2,2(3)
         SLR   9,9
         IC    9,0(4,2)
         LR    4,9
         A     4,=F'3'
         SRA   4,2
L356     EQU   *
         SLR   9,9
L412     EQU   *
         CR    9,4
         BNL   L362
         L     2,40(7)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BNE   L364
         L     2,32(7)
         AR    2,9
         SLL   2,2
         L     3,=V(HARDREG2)
         L     6,0(2,3)
L364     EQU   *
         L     2,8(5)
         LR    3,2
         LTR   2,2
         BNE   L372
         ST    6,88(13)
         MVC   92(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1762)
         BALR  14,15
         B     L366
L372     EQU   *
         L     2,4(3)
         L     2,60(2)
         LH    2,0(2)
         CLM   2,3,=H'76'
         BNE   L410
         ST    6,88(13)
         L     2,4(3)
         MVC   92(4,13),60(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@702)
         BALR  14,15
         LTR   15,15
         BNE   L371
L410     EQU   *
         LR    15,6
L371     EQU   *
         ST    15,88(13)
         MVC   92(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1762)
         BALR  14,15
         L     3,0(3)
         LTR   3,3
         BNE   L372
L366     EQU   *
         L     2,40(7)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BNE   L362
         A     9,=F'1'
         B     L412
L362     EQU   *
         L     4,104(13)
         L     2,40(4)
         N     2,=F'126976'
         L     9,=F'32768'
         CLR   2,9
         BE    L354
         L     3,=F'40960'
         CLR   2,3
         BE    L354
         ST    4,88(13)
         L     4,44(8)
         A     4,=F'1'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
L354     EQU   *
         L     5,0(5)
         B     L411
L407     EQU   *
         L     5,40(7)
         O     5,=F'-2147483648'
         ST    5,40(7)
         L     6,84(7)
         N     6,84(8)
         ST    6,84(7)
         LR    3,5
         SRL   3,2
         N     3,=F'1023'
         L     4,40(8)
         SRL   4,2
         N     4,=F'1023'
         LR    2,3
         SLL   2,2
         AR    2,3
         AR    2,4
         SLL   2,2
         L     3,=V(ZZZ@1785)
         L     2,0(2,3)
         N     2,=F'1023'
         SLL   2,2
         N     5,=F'-4093'
         OR    5,2
         ST    5,40(7)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1386)
         BALR  14,15
         S     15,44(7)
         ST    15,100(7)
         BNE   L377
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'798'
L414     EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L377     EQU   *
         L     4,48(7)
         L     3,40(7)
         LR    2,3
         N     2,=F'126976'
         L     5,=F'8192'
         CR    2,5
         BE    L379
         CR    4,15
         BNL   L380
         B     L378
L379     EQU   *
         LTR   4,4
         BNH   L378
L380     EQU   *
         LR    2,3
         N     2,=F'126976'
         L     9,=F'24576'
         CLR   2,9
         BE    L381
         LR    2,3
         SRL   2,12
         N     2,=F'31'
         A     2,=F'-3'
         LA    3,2(0,0)
         CLR   2,3
         BH    L378
L381     EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@W)
         BALR  14,15
         MVC   88(4,13),136(7)
         L     4,=V(WEB@LIST)
         LA    4,28(0,4)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(7)
         N     2,=F'-126977'
         O     2,=F'28672'
         ST    2,40(7)
L378     EQU   *
         L     3,12(8)
         LTR   3,3
         BE    L413
         LA    5,2(0,0)
         CLR   3,5
         BNE   L403
         L     2,12(7)
         LTR   2,2
         BE    L328
         B     L413
L403     EQU   *
         LA    9,3(0,0)
         CLR   3,9
         BNE   L328
         L     2,12(7)
         LA    4,1(0,0)
         CLR   2,4
         BNE   L328
L413     EQU   *
         ST    3,12(7)
L328     EQU   *
* Function combine epilogue
         PDPEPIL
* Function combine literal pool
         DS    0F
         LTORG
* Function combine page table
         DS    0F
PGT14    EQU   *
         DC    A(PG14)
         DS    0F
* Function freeze_moves,F18 prologue
@@F18    PDPPRLG CINDEX=15,FRAME=104,BASER=12,ENTRY=NO
         B     FEN15
         LTORG
FEN15    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG15     EQU   *
         LR    11,1
         L     10,=A(PGT15)
* Function freeze_moves code
         L     5,0(11)
         L     2,132(5)
         LTR   2,2
         BE    L454
L452     EQU   *
         L     4,4(2)
         L     6,0(2)
         L     2,12(4)
         LA    3,4(0,0)
         CLR   2,3
         BNE   L419
         MVC   88(4,13),16(4)
         MVC   92(4,13),=A(@@V5)
         B     L455
L419     EQU   *
         MVC   88(4,13),16(4)
         MVC   92(4,13),=A(@@V1)
L455     EQU   *
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         MVC   88(4,13),16(4)
         MVC   92(4,13),=A(@@V4)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         MVC   12(4,4),=F'3'
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),8(4)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    3,15
         CLR   2,5
         BE    L431
         LR    3,2
L431     EQU   *
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         L     2,132(3)
         LTR   2,2
         BNE   L418
         L     4,48(3)
         L     2,40(3)
         N     2,=F'126976'
         L     7,=F'8192'
         CR    2,7
         BE    L433
         C     4,100(3)
         BL    L434
         B     L418
L433     EQU   *
         LTR   4,4
         BH    L418
L434     EQU   *
         MVC   88(4,13),136(3)
         L     2,=V(WEB@LIST)
         LA    2,24(0,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         LA    4,3(0,0)
         L     2,12(3)
         LTR   2,2
         BE    L446
         MVC   88(4,13),136(3)
         LA    4,4(0,0)
         L     7,=V(WEB@LIST)
         LA    7,16(0,7)
         B     L457
L446     EQU   *
         L     2,44(3)
         LTR   2,2
         BE    L448
         MVC   88(4,13),136(3)
         LA    4,5(0,0)
         L     2,=V(WEB@LIST)
         LA    2,20(0,2)
         ST    2,92(13)
         B     L456
L448     EQU   *
         MVC   88(4,13),136(3)
         L     7,=V(WEB@LIST)
         LA    7,12(0,7)
L457     EQU   *
         ST    7,92(13)
L456     EQU   *
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         SLL   4,12
         L     2,40(3)
         N     2,=F'-126977'
         OR    2,4
         ST    2,40(3)
L418     EQU   *
         LR    2,6
         LTR   6,6
         BNE   L452
L454     EQU   *
* Function freeze_moves epilogue
         PDPEPIL
* Function freeze_moves literal pool
         DS    0F
         LTORG
* Function freeze_moves page table
         DS    0F
PGT15    EQU   *
         DC    A(PG15)
         DS    0F
* Function default_spill_heuristic,F20 prologue
@@F20    PDPPRLG CINDEX=16,FRAME=88,BASER=12,ENTRY=NO
         B     FEN16
         LTORG
FEN16    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG16     EQU   *
         LR    11,1
         L     10,=A(PGT16)
* Function default_spill_heuristic code
         L     3,0(11)
         LA    15,1(0,0)
         L     2,=V(ZZZ@779)
         L     2,0(2)
         LTR   2,2
         BE    L459
         L     15,28(3)
         A     15,=F'1'
L459     EQU   *
         A     15,48(3)
         L     2,20(3)
         SLL   2,8
         AR    2,15
         LR    4,2
         BCTR  4,0
         SLR   5,5
         CLR   15,4
         BH    L462
         LTR   15,15
         BL    L461
         LA    2,1(0,0)
         CLR   15,2
         BE    L460
         SRDL  4,32
         DR    4,15
         B     L462
L460     EQU   *
         LR    5,4
         B     L462
L461     EQU   *
         LA    5,1(0,0)
L462     EQU   *
         LR    15,5
         L     2,8(3)
         CLR   2,5
         BNL   L463
         SR    15,2
L463     EQU   *
* Function default_spill_heuristic epilogue
         PDPEPIL
* Function default_spill_heuristic literal pool
         DS    0F
         LTORG
* Function default_spill_heuristic page table
         DS    0F
PGT16    EQU   *
         DC    A(PG16)
         DS    0F
* X-func get_free_reg prologue
GET@FREE PDPPRLG CINDEX=17,FRAME=104,BASER=12,ENTRY=YES
         B     FEN17
         LTORG
FEN17    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG17     EQU   *
         LR    11,1
         L     10,=A(PGT17)
* Function get_free_reg code
         L     8,4(11)
         L     6,8(11)
         L     9,=F'-1'
         ST    9,88(13)
         L     7,=F'2147483647'
         ST    7,96(13)
         SLR   5,5
L487     EQU   *
         L     2,0(11)
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BNE   L467
         LR    2,8
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BE    L467
         LA    2,15(0,0)
         CR    5,2
         BH    L469
         LR    2,5
         X     2,=F'1'
         N     2,=F'1'
         LTR   2,2
         BNE   L470
         LA    3,7(0,0)
         CLR   6,3
         BE    L467
         LA    15,10(0,0)
         CLR   6,15
         BNE   L470
         B     L467
L469     EQU   *
         LR    2,6
         A     2,=F'-9'
         LA    3,1(0,0)
         CLR   2,3
         BNH   L470
         LA    15,16(0,0)
         CLR   6,15
         BE    L470
         LA    2,17(0,0)
         CR    6,2
         BNE   L467
L470     EQU   *
         L     2,=V(MODE@SIZ)
         LA    3,15(0,0)
         CR    5,3
         BNH   L471
         SLR   3,3
         IC    3,0(2,6)
         A     3,=F'7'
         SRA   3,3
         B     L472
L471     EQU   *
         SLR   3,3
         IC    3,0(2,6)
         A     3,=F'3'
         SRA   3,2
L472     EQU   *
         LA    4,1(0,0)
         CR    4,3
         BNL   L476
         AR    5,4
         LR    2,8
         SRL   2,0(5)
         BCTR  5,0
         NR    2,4
L493     EQU   *
         LTR   2,2
         BE    L476
         A     4,=F'1'
         CR    4,3
         BNL   L476
         LR    2,5
         AR    2,4
         LR    15,8
         SRL   15,0(2)
         LR    2,15
         N     2,=F'1'
         B     L493
L476     EQU   *
         CLR   4,3
         BE    L492
         AR    5,4
         B     L467
L492     EQU   *
         LA    2,1(0,0)
         CR    4,2
         BNH   L482
         LR    2,5
         X     2,=F'1'
         N     2,=F'1'
         LTR   2,2
         BE    L481
L482     EQU   *
         LR    3,5
         SLL   3,2
         L     2,=V(INV@REG@)
         L     2,0(3,2)
         C     2,96(13)
         BNL   L467
         ST    5,88(13)
         ST    2,96(13)
         B     L467
L481     EQU   *
         LR    3,5
         SLL   3,2
         L     2,=V(INV@REG@)
         L     2,0(3,2)
         CR    2,7
         BNL   L467
         LR    9,5
         LR    7,2
L467     EQU   *
         A     5,=F'1'
         LA    3,19(0,0)
         CR    5,3
         BNH   L487
         L     15,88(13)
         LTR   15,15
         BNL   L488
         LR    15,9
L488     EQU   *
* Function get_free_reg epilogue
         PDPEPIL
* Function get_free_reg literal pool
         DS    0F
         LTORG
* Function get_free_reg page table
         DS    0F
PGT17    EQU   *
         DC    A(PG17)
         DS    0F
* Function get_biased_reg,F23 prologue
@@F23    PDPPRLG CINDEX=18,FRAME=104,BASER=12,ENTRY=NO
         B     FEN18
         LTORG
FEN18    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG18     EQU   *
         LR    11,1
         L     10,=A(PGT18)
* Function get_biased_reg code
         L     8,0(11)
         L     4,8(11)
         L     6,12(11)
         L     7,16(11)
         L     2,=V(ZZZ@778)
         L     2,0(2)
         LTR   2,2
         BE    L495
         L     5,4(11)
         X     5,=F'-1'
         LR    3,8
         OR    3,5
         LR    2,4
         X     2,=F'-1'
         OR    3,2
         ST    3,88(13)
         ST    6,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(GET@FREE)
         BALR  14,15
         LTR   15,15
         BNL   L494
         OR    5,8
         ST    5,88(13)
         ST    6,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(GET@FREE)
         BALR  14,15
         LTR   15,15
         BNL   L494
L495     EQU   *
         X     4,=F'-1'
         OR    4,8
         ST    4,88(13)
         ST    6,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(GET@FREE)
         BALR  14,15
         LTR   15,15
         BNL   L494
         ST    8,88(13)
         ST    6,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(GET@FREE)
         BALR  14,15
L494     EQU   *
* Function get_biased_reg epilogue
         PDPEPIL
* Function get_biased_reg literal pool
         DS    0F
         LTORG
* Function get_biased_reg page table
         DS    0F
PGT18    EQU   *
         DC    A(PG18)
         DS    0F
* Function count_long_blocks,F24 prologue
@@F24    PDPPRLG CINDEX=19,FRAME=88,BASER=12,ENTRY=NO
         B     FEN19
         LTORG
FEN19    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG19     EQU   *
         LR    11,1
         L     10,=A(PGT19)
* Function count_long_blocks code
         L     6,0(11)
         L     5,4(11)
         SLR   15,15
         LR    4,15
L510     EQU   *
         LR    2,6
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L502
         LA    3,1(0,0)
L514     EQU   *
         CR    3,5
         BNL   L505
         LR    2,4
         AR    2,3
         LR    7,6
         SRL   7,0(2)
         LR    2,7
         N     2,=F'1'
         LTR   2,2
         BE    L505
         A     3,=F'1'
         B     L514
L505     EQU   *
         CR    3,5
         BNE   L509
         A     15,=F'1'
L509     EQU   *
         AR    4,3
         BCTR  4,0
L502     EQU   *
         A     4,=F'1'
         LA    2,19(0,0)
         CR    4,2
         BNH   L510
* Function count_long_blocks epilogue
         PDPEPIL
* Function count_long_blocks literal pool
         DS    0F
         LTORG
* Function count_long_blocks page table
         DS    0F
PGT19    EQU   *
         DC    A(PG19)
         DS    0F
* Function calculate_dont_begin,F26 prologue
@@F26    PDPPRLG CINDEX=20,FRAME=120,BASER=12,ENTRY=NO
         B     FEN20
         LTORG
FEN20    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG20     EQU   *
         LR    11,1
         L     10,=A(PGT20)
* Function calculate_dont_begin code
         MVC   96(4,13),=F'0'
         L     2,0(11)
         L     8,72(2)
L567     EQU   *
         LTR   8,8
         BE    L563
         MVC   88(4,13),4(8)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         ST    15,100(13)
         L     7,8(8)
         LTR   7,7
         BNE   L570
         L     3,4(8)
L520     EQU   *
         LTR   3,3
         BE    L522
         L     4,100(13)
         L     2,40(4)
         N     2,=F'126976'
         L     5,=F'45056'
         CLR   2,5
         BE    L524
         L     6,=F'8192'
         CLR   2,6
         BNE   L523
L524     EQU   *
         L     15,0(11)
         LTR   7,7
         BE    L526
         L     15,4(7)
L526     EQU   *
         L     9,100(13)
         MVC   112(4,13),32(9)
         L     2,60(3)
         L     5,112(13)
         LA    4,15(0,0)
         CR    5,4
         BNH   L527
         SLR   6,6
         IC    6,2(2)
         LR    2,6
         L     9,=V(MODE@SIZ)
         SLR   6,6
         IC    6,0(9,2)
         A     6,=F'7'
         SRA   6,3
         B     L528
L527     EQU   *
         SLR   4,4
         IC    4,2(2)
         L     5,=V(MODE@SIZ)
         SLR   6,6
         IC    6,0(5,4)
         A     6,=F'3'
         SRA   6,2
L528     EQU   *
         L     2,60(15)
         L     4,112(13)
         LA    9,15(0,0)
         CR    4,9
         BNH   L531
         SLR   5,5
         IC    5,2(2)
         LR    2,5
         L     9,=V(MODE@SIZ)
         SLR   5,5
         IC    5,0(9,2)
         A     5,=F'7'
         SRA   5,3
         B     L532
L531     EQU   *
         SLR   4,4
         IC    4,2(2)
         L     9,=V(MODE@SIZ)
         SLR   5,5
         IC    5,0(9,4)
         A     5,=F'3'
         SRA   5,2
L532     EQU   *
         MVC   104(4,13),=F'0'
         MVC   108(4,13),104(13)
         L     4,60(3)
         LH    2,0(4)
         CLM   2,3,=H'76'
         BNE   L535
         SLR   2,2
         IC    2,2(4)
         L     3,=V(MODE@SIZ)
         IC    2,0(3,2)
         CLM   2,1,=XL1'03'
         BNH   L535
         L     4,8(4)
         SRL   4,2
         ST    4,104(13)
L535     EQU   *
         L     4,60(15)
         LH    2,0(4)
         CLM   2,3,=H'76'
         BNE   L536
         SLR   2,2
         IC    2,2(4)
         L     3,=V(MODE@SIZ)
         IC    2,0(3,2)
         CLM   2,1,=XL1'03'
         BNH   L536
         L     4,8(4)
         SRL   4,2
         ST    4,108(13)
L536     EQU   *
         L     2,104(13)
         A     2,112(13)
         LR    4,2
         S     4,108(13)
         SR    4,5
         A     4,=F'1'
         LR    5,2
         AR    5,6
         S     5,108(13)
         BCTR  5,0
         LTR   5,5
         BL    L523
         LTR   4,4
         BNL   L539
         SLR   4,4
         B     L539
L545     EQU   *
         A     4,=F'1'
L539     EQU   *
         L     3,108(13)
         AR    3,4
         L     2,104(13)
         A     2,112(13)
         ST    2,116(13)
         L     2,60(15)
         LA    6,15(0,0)
         CR    4,6
         BNH   L541
         SLR   9,9
         IC    9,2(2)
         LR    2,9
         L     6,=V(MODE@SIZ)
         SLR   9,9
         IC    9,0(6,2)
         LR    2,9
         A     2,=F'7'
         SRA   2,3
         B     L568
L541     EQU   *
         SLR   6,6
         IC    6,2(2)
         LR    2,6
         L     9,=V(MODE@SIZ)
         SLR   6,6
         IC    6,0(9,2)
         LR    2,6
         A     2,=F'3'
         SRA   2,2
L568     EQU   *
         AR    3,2
         BCTR  3,0
         CL    3,116(13)
         BL    L545
         B     L546
L552     EQU   *
         BCTR  4,0
L546     EQU   *
         LTR   4,4
         BNH   L547
         L     3,108(13)
         AR    3,4
         L     9,104(13)
         A     9,112(13)
         ST    9,116(13)
         L     2,60(15)
         LA    6,15(0,0)
         CR    4,6
         BNH   L548
         SLR   9,9
         IC    9,2(2)
         LR    2,9
         L     6,=V(MODE@SIZ)
         SLR   9,9
         IC    9,0(6,2)
         LR    2,9
         A     2,=F'7'
         SRA   2,3
         B     L569
L548     EQU   *
         SLR   6,6
         IC    6,2(2)
         LR    2,6
         L     9,=V(MODE@SIZ)
         SLR   6,6
         IC    6,0(9,2)
         LR    2,6
         A     2,=F'3'
         SRA   2,2
L569     EQU   *
         AR    3,2
         BCTR  3,0
         CL    3,116(13)
         BH    L552
L547     EQU   *
         CR    4,5
         BH    L523
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,96(13)
         ST    2,96(13)
         A     4,=F'1'
         B     L547
L523     EQU   *
         LTR   7,7
         BE    L522
         L     7,0(7)
         LTR   7,7
         BE    L522
L570     EQU   *
         L     3,8(7)
         B     L520
L522     EQU   *
         L     8,0(8)
         B     L567
L563     EQU   *
         L     2,4(11)
         MVC   0(4,2),96(13)
* Function calculate_dont_begin epilogue
         PDPEPIL
* Function calculate_dont_begin literal pool
         DS    0F
         LTORG
* Function calculate_dont_begin page table
         DS    0F
PGT20    EQU   *
         DC    A(PG20)
         DS    0F
* Function restore_conflicts_from_coalesce,F37 prologue
@@F37    PDPPRLG CINDEX=21,FRAME=296,BASER=12,ENTRY=NO
         B     FEN21
         LTORG
FEN21    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG21     EQU   *
         LR    11,1
         L     10,=A(PGT21)
* Function restore_conflicts_from_coalesce code
         SLR   2,2
         SLR   3,3
         ST    2,112(13)
         ST    3,4+112(13)
         ST    2,120(13)
         ST    3,4+120(13)
         ST    2,128(13)
         ST    3,4+128(13)
         ST    2,136(13)
         ST    3,4+136(13)
         ST    2,144(13)
         ST    3,4+144(13)
         ST    2,152(13)
         ST    3,4+152(13)
         ST    2,160(13)
         ST    3,4+160(13)
         ST    2,168(13)
         ST    3,4+168(13)
         ST    2,184(13)
         ST    3,4+184(13)
         ST    2,192(13)
         ST    3,4+192(13)
         ST    2,200(13)
         ST    3,4+200(13)
         ST    2,208(13)
         ST    3,4+208(13)
         ST    2,216(13)
         ST    3,4+216(13)
         ST    2,224(13)
         ST    3,4+224(13)
         ST    2,232(13)
         ST    3,4+232(13)
         ST    2,240(13)
         ST    3,4+240(13)
         ST    2,248(13)
         ST    3,4+248(13)
         ST    2,256(13)
         ST    3,4+256(13)
         ST    2,264(13)
         ST    3,4+264(13)
         ST    2,272(13)
         ST    3,4+272(13)
         L     3,0(11)
         A     3,=F'72'
         ST    3,104(13)
         L     4,0(11)
         L     2,40(4)
         SRL   2,17
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L571)
         BER   14
L655     EQU   *
         L     12,0(,10)
         L     2,0(3)
         LTR   2,2
         L     14,=A(L642)
         BER   14
         L     5,104(13)
         L     9,0(5)
         MVC   108(4,13),4(9)
         L     8,0(11)
         L     5,76(8)
L656     EQU   *
         LTR   5,5
         BE    L576
         L     2,4(5)
         CL    2,108(13)
         BE    L576
         L     5,0(5)
         B     L656
L576     EQU   *
         LTR   5,5
         BE    L580
         ST    9,104(13)
         L     14,=A(L573)
         BR    14
L580     EQU   *
         L     2,104(13)
         MVC   0(4,2),0(9)
         L     4,108(13)
         L     3,40(4)
         LR    2,3
         SRL   2,17
         N     2,=F'1'
         LTR   2,2
         BNE   L582
         N     3,=F'126976'
         L     5,=F'8192'
         CLR   3,5
         BE    L582
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2210'
         B     L671
L582     EQU   *
         L     2,108(13)
         L     8,76(2)
L657     EQU   *
         LTR   8,8
         BE    L584
         L     2,4(8)
         CL    2,0(11)
         BE    L584
         L     8,0(8)
         B     L657
L584     EQU   *
         LTR   8,8
         BE    L588
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2215'
         B     L671
L588     EQU   *
         L     4,108(13)
         A     4,=F'72'
L658     EQU   *
         L     2,0(4)
         LTR   2,2
         BE    L653
         L     3,0(4)
         L     2,4(3)
         CL    2,0(11)
         BE    L652
         LR    4,3
         B     L658
L652     EQU   *
         LR    8,3
         MVC   0(4,4),0(3)
         LTR   3,3
         BNE   L594
L653     EQU   *
         L     3,108(13)
         L     2,40(3)
         N     2,=F'126976'
         L     4,=F'8192'
         CLR   2,4
         BE    L594
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2231'
L671     EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L594     EQU   *
         L     2,=V(SUP@IGRA)
         L     5,0(2)
         L     2,0(11)
         L     7,0(2)
         L     2,=V(NUM@WEBS)
         L     6,0(2)
         ST    6,116(13)
         L     2,112(13)
         L     3,4+112(13)
         MR    2,7
         ST    2,112(13)
         ST    3,4+112(13)
         L     3,108(13)
         L     15,0(3)
         L     3,116(13)
         AR    3,15
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         X     2,=F'-1'
         N     2,12(5,4)
         ST    2,12(5,4)
         ST    6,124(13)
         L     2,120(13)
         L     3,4+120(13)
         MR    2,15
         ST    2,120(13)
         ST    3,4+120(13)
         L     3,124(13)
         AR    3,7
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         X     2,=F'-1'
         N     2,12(5,4)
         ST    2,12(5,4)
         L     2,=V(IGRAPH)
         L     6,0(2)
         CLR   7,15
         BNL   L595
         LR    3,15
         BCTR  3,0
         ST    3,132(13)
         L     4,128(13)
         L     5,4+128(13)
         MR    4,15
         ST    4,128(13)
         ST    5,4+128(13)
         L     4,132(13)
         SRL   4,1
         AR    4,7
         B     L659
L595     EQU   *
         LR    5,7
         BCTR  5,0
         ST    5,140(13)
         L     4,136(13)
         L     5,4+136(13)
         MR    4,7
         ST    4,136(13)
         ST    5,4+136(13)
         L     4,140(13)
         SRL   4,1
         AR    4,15
L659     EQU   *
         SRL   4,5
         SLL   4,2
         A     4,=F'8'
         L     5,0(2)
         CLR   7,15
         BNL   L597
         LR    2,15
         BCTR  2,0
         ST    2,148(13)
         L     2,144(13)
         L     3,4+144(13)
         MR    2,15
         ST    2,144(13)
         ST    3,4+144(13)
         L     2,148(13)
         SRL   2,1
         AR    2,7
         B     L660
L597     EQU   *
         LR    3,7
         BCTR  3,0
         ST    3,156(13)
         L     2,152(13)
         L     3,4+152(13)
         MR    2,7
         ST    2,152(13)
         ST    3,4+152(13)
         L     2,156(13)
         SRL   2,1
         AR    2,15
L660     EQU   *
         SRL   2,5
         SLL   2,2
         A     2,=F'8'
         L     5,4(5,2)
         CLR   7,15
         BNL   L599
         LR    3,15
         BCTR  3,0
         ST    3,164(13)
         L     2,160(13)
         L     3,4+160(13)
         MR    2,15
         ST    2,160(13)
         ST    3,4+160(13)
         L     2,164(13)
         SRL   2,1
         AR    2,7
         B     L661
L599     EQU   *
         LR    3,7
         BCTR  3,0
         ST    3,172(13)
         L     2,168(13)
         L     3,4+168(13)
         MR    2,7
         ST    2,168(13)
         ST    3,4+168(13)
         L     2,172(13)
         SRL   2,1
         AR    2,15
L661     EQU   *
         N     2,=F'31'
         LA    3,1(0,0)
         SLL   3,0(2)
         X     3,=F'-1'
         NR    3,5
         ST    3,4(6,4)
         L     6,8(9)
L662     EQU   *
         LTR   6,6
         BE    L647
         L     9,=V(IGRAPH)
         MVC   176(4,13),0(9)
         L     7,4(6)
         L     15,8(6)
         L     3,0(7)
         L     2,0(15)
         CLR   3,2
         BNL   L604
         LR    4,2
         BCTR  4,0
         ST    4,188(13)
         L     4,184(13)
         L     5,4+184(13)
         MR    4,2
         ST    4,184(13)
         ST    5,4+184(13)
         L     4,188(13)
         SRL   4,1
         AR    4,3
         B     L663
L604     EQU   *
         LR    5,3
         BCTR  5,0
         ST    5,196(13)
         L     4,192(13)
         L     5,4+192(13)
         MR    4,3
         ST    4,192(13)
         ST    5,4+192(13)
         L     4,196(13)
         SRL   4,1
         AR    4,2
L663     EQU   *
         SRL   4,5
         SLL   4,2
         A     4,=F'8'
         L     9,0(9)
         L     5,0(7)
         MVC   280(4,13),0(15)
         CL    5,280(13)
         BNL   L606
         L     2,280(13)
         BCTR  2,0
         ST    2,204(13)
         L     2,200(13)
         L     3,4+200(13)
         M     2,280(13)
         ST    2,200(13)
         ST    3,4+200(13)
         L     2,204(13)
         SRL   2,1
         AR    2,5
         B     L664
L606     EQU   *
         LR    3,5
         BCTR  3,0
         ST    3,212(13)
         L     2,208(13)
         L     3,4+208(13)
         MR    2,5
         ST    2,208(13)
         ST    3,4+208(13)
         L     2,212(13)
         SRL   2,1
         A     2,280(13)
L664     EQU   *
         SRL   2,5
         SLL   2,2
         A     2,=F'8'
         L     9,4(9,2)
         L     5,0(7)
         L     7,0(15)
         CLR   5,7
         BNL   L608
         LR    3,7
         BCTR  3,0
         ST    3,220(13)
         L     2,216(13)
         L     3,4+216(13)
         MR    2,7
         ST    2,216(13)
         ST    3,4+216(13)
         L     2,220(13)
         SRL   2,1
         AR    2,5
         B     L665
L608     EQU   *
         LR    3,5
         BCTR  3,0
         ST    3,228(13)
         L     2,224(13)
         L     3,4+224(13)
         MR    2,5
         ST    2,224(13)
         ST    3,4+224(13)
         L     2,228(13)
         SRL   2,1
         AR    2,7
L665     EQU   *
         N     2,=F'31'
         LA    3,1(0,0)
         SLL   3,0(2)
         X     3,=F'-1'
         NR    3,9
         L     5,176(13)
         ST    3,4(5,4)
         L     6,0(6)
         B     L662
L647     EQU   *
         L     9,108(13)
         L     2,40(9)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BE    L573
         L     6,8(8)
L666     EQU   *
         LTR   6,6
         BE    L573
         L     5,=V(IGRAPH)
         MVC   284(4,13),0(5)
         L     7,4(6)
         L     15,8(6)
         L     3,0(7)
         L     2,0(15)
         CLR   3,2
         BNL   L615
         LR    4,2
         BCTR  4,0
         ST    4,236(13)
         L     8,232(13)
         L     9,4+232(13)
         MR    8,2
         ST    8,232(13)
         ST    9,4+232(13)
         L     4,236(13)
         SRL   4,1
         AR    4,3
         B     L667
L615     EQU   *
         LR    9,3
         BCTR  9,0
         ST    9,244(13)
         L     8,240(13)
         L     9,4+240(13)
         MR    8,3
         ST    8,240(13)
         ST    9,4+240(13)
         L     4,244(13)
         SRL   4,1
         AR    4,2
L667     EQU   *
         SRL   4,5
         SLL   4,2
         A     4,=F'8'
         MVC   288(4,13),0(5)
         L     5,0(7)
         L     3,0(15)
         CLR   5,3
         BNL   L617
         LR    9,3
         BCTR  9,0
         ST    9,252(13)
         L     8,248(13)
         L     9,4+248(13)
         MR    8,3
         ST    8,248(13)
         ST    9,4+248(13)
         L     2,252(13)
         SRL   2,1
         AR    2,5
         B     L668
L617     EQU   *
         LR    9,5
         BCTR  9,0
         ST    9,260(13)
         L     8,256(13)
         L     9,4+256(13)
         MR    8,5
         ST    8,256(13)
         ST    9,4+256(13)
         L     2,260(13)
         SRL   2,1
         AR    2,3
L668     EQU   *
         SRL   2,5
         SLL   2,2
         A     2,=F'8'
         L     9,288(13)
         L     2,4(9,2)
         ST    2,288(13)
         L     5,0(7)
         L     3,0(15)
         CLR   5,3
         BNL   L619
         LR    2,3
         BCTR  2,0
         ST    2,268(13)
         L     8,264(13)
         L     9,4+264(13)
         MR    8,3
         ST    8,264(13)
         ST    9,4+264(13)
         L     2,268(13)
         SRL   2,1
         AR    2,5
         B     L669
L619     EQU   *
         LR    9,5
         BCTR  9,0
         ST    9,276(13)
         L     8,272(13)
         L     9,4+272(13)
         MR    8,5
         ST    8,272(13)
         ST    9,4+272(13)
         L     2,276(13)
         SRL   2,1
         AR    2,3
L669     EQU   *
         N     2,=F'31'
         LA    3,1(0,0)
         SLL   3,0(2)
         X     3,=F'-1'
         N     3,288(13)
         L     9,284(13)
         ST    3,4(9,4)
         L     6,0(6)
         B     L666
L573     EQU   *
         L     3,104(13)
         B     L655
L642     EQU   *
         L     4,0(11)
         MVC   84(4,4),88(4)
         L     5,72(4)
         LTR   5,5
         BE    L571
L640     EQU   *
         L     3,4(5)
         L     2,40(3)
         N     2,=F'126976'
         L     8,=F'40960'
         CLR   2,8
         BNE   L625
         L     4,128(3)
L670     EQU   *
         LTR   4,4
         BE    L625
         L     2,8(5)
         LR    3,2
         LTR   2,2
         BNE   L637
         MVC   88(4,13),0(11)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1762)
         BALR  14,15
         B     L631
L637     EQU   *
         L     2,8(3)
         L     2,60(2)
         LH    2,0(2)
         CLM   2,3,=H'76'
         BNE   L654
         ST    4,88(13)
         L     2,8(3)
         MVC   92(4,13),60(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@702)
         BALR  14,15
         LTR   15,15
         BNE   L636
L654     EQU   *
         LR    15,4
L636     EQU   *
         MVC   88(4,13),4(3)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1762)
         BALR  14,15
         L     3,0(3)
         LTR   3,3
         BNE   L637
L631     EQU   *
         L     2,40(4)
         N     2,=F'126976'
         L     9,=F'40960'
         CLR   2,9
         BNE   L625
         L     4,128(4)
         B     L670
L625     EQU   *
         L     5,0(5)
         LTR   5,5
         BNE   L640
L571     EQU   *
* Function restore_conflicts_from_coalesce epilogue
         PDPEPIL
* Function restore_conflicts_from_coalesce literal pool
         DS    0F
         LTORG
* Function restore_conflicts_from_coalesce page table
         DS    0F
PGT21    EQU   *
         DC    A(PG21)
         DS    0F
* Function insert_coalesced_conflicts,F30 prologue
@@F30    PDPPRLG CINDEX=22,FRAME=104,BASER=12,ENTRY=NO
         B     FEN22
         LTORG
FEN22    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG22     EQU   *
         LR    11,1
         L     10,=A(PGT22)
* Function insert_coalesced_conflicts code
* Function insert_coalesced_conflicts epilogue
         PDPEPIL
* Function insert_coalesced_conflicts literal pool
         DS    0F
         LTORG
* Function insert_coalesced_conflicts page table
         DS    0F
PGT22    EQU   *
         DC    A(PG22)
         DS    0F
* Function comp_webs_maxcost,F31 prologue
@@F31    PDPPRLG CINDEX=23,FRAME=88,BASER=12,ENTRY=NO
         B     FEN23
         LTORG
FEN23    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG23     EQU   *
         LR    11,1
         L     10,=A(PGT23)
* Function comp_webs_maxcost code
         L     2,0(11)
         L     3,0(2)
         L     2,4(11)
         L     2,0(2)
         L     3,20(3)
         L     2,20(2)
         L     15,=F'-1'
         CLR   3,2
         BH    L695
         LA    15,1(0,0)
         BL    L695
         SLR   15,15
L695     EQU   *
* Function comp_webs_maxcost epilogue
         PDPEPIL
* Function comp_webs_maxcost literal pool
         DS    0F
         LTORG
* Function comp_webs_maxcost page table
         DS    0F
PGT23    EQU   *
         DC    A(PG23)
         DS    0F
* Function check_colors,F33 prologue
@@F33    PDPPRLG CINDEX=24,FRAME=128,BASER=12,ENTRY=NO
         B     FEN24
         LTORG
FEN24    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG24     EQU   *
         LR    11,1
         L     10,=A(PGT24)
* Function check_colors code
         MVC   104(4,13),=F'0'
         L     3,=V(NUM@WEBS)
         L     2,0(3)
         L     3,=V(NUM@SUBW)
         S     2,0(3)
         SLR   4,4
         CLR   4,2
         BNL   L759
L757     EQU   *
         L     2,=V(ID2WEB)
         L     3,0(2)
         L     2,104(13)
         SLL   2,2
         L     4,0(2,3)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         ST    15,108(13)
         L     3,40(15)
         N     3,=F'126976'
         L     5,=F'36864'
         CLR   3,5
         BE    L703
         L     2,4(4)
         L     5,=V(MAX@NORM)
         CL    2,0(5)
         BNL   L703
         L     2,=F'45056'
         CR    3,2
         BNE   L707
         L     2,32(15)
         L     9,=V(MODE@SIZ)
         L     3,60(4)
         LA    5,15(0,0)
         CR    2,5
         BNH   L708
         SLR   2,2
         IC    2,2(3)
         SLR   7,7
         IC    7,0(9,2)
         A     7,=F'7'
         SRA   7,3
         B     L706
L708     EQU   *
         SLR   2,2
         IC    2,2(3)
         SLR   7,7
         IC    7,0(9,2)
         A     7,=F'3'
         SRA   7,2
         B     L706
L707     EQU   *
         L     2,=F'8192'
         CLR   3,2
         BNE   L713
         LA    7,1(0,0)
         B     L706
L713     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1978'
         B     L766
L706     EQU   *
         SLR   3,3
L764     EQU   *
         CR    3,7
         BNL   L761
         L     5,108(13)
         L     2,32(5)
         AR    2,3
         L     5,84(4)
         SRL   5,0(2)
         LR    2,5
         N     2,=F'1'
         LTR   2,2
         BNE   L717
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1982'
         B     L766
L717     EQU   *
         A     3,=F'1'
         B     L764
L761     EQU   *
         L     2,40(4)
         SRL   2,17
         N     2,=F'1'
         LTR   2,2
         BE    L720
         L     8,76(4)
         B     L721
L720     EQU   *
         L     8,72(4)
L721     EQU   *
         LTR   8,8
         BE    L703
         L     3,4(8)
         L     2,4(3)
         L     4,=V(MAX@NORM)
         CL    2,0(4)
         BNL   L724
         L     2,8(8)
         LTR   2,2
         BNE   L727
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     5,=F'45056'
         CR    2,5
         BNE   L728
         L     2,32(15)
         L     9,=V(MODE@SIZ)
         L     3,60(15)
         LA    4,15(0,0)
         CR    2,4
         BNH   L729
         SLR   2,2
         IC    2,2(3)
         SLR   5,5
         IC    5,0(9,2)
         LR    2,5
         A     2,=F'7'
         SRA   2,3
         B     L733
L729     EQU   *
         SLR   2,2
         IC    2,2(3)
         SLR   3,3
         IC    3,0(9,2)
         LR    2,3
         A     2,=F'3'
         SRA   2,2
         B     L733
L728     EQU   *
         L     4,=F'8192'
         CR    2,4
         BNE   L724
         LA    2,1(0,0)
L733     EQU   *
         L     15,32(15)
         AR    2,15
         L     5,108(13)
         L     3,32(5)
         CR    3,2
         BNL   L724
         AR    3,7
         CR    15,3
         BNL   L724
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2006'
         B     L766
L727     EQU   *
         L     2,108(13)
         MVC   112(4,13),32(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         MVC   116(4,13),32(15)
         MVC   88(4,13),4(8)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'36864'
         CLR   2,3
         BE    L724
         L     6,8(8)
L765     EQU   *
         LTR   6,6
         BE    L724
         L     9,=V(MODE@SIZ)
         L     2,4(6)
         L     5,112(13)
         LA    4,15(0,0)
         CR    5,4
         BNH   L743
         L     2,60(2)
         SLR   3,3
         IC    3,2(2)
         SLR   5,5
         IC    5,0(9,3)
         A     5,=F'7'
         SRA   5,3
         B     L744
L743     EQU   *
         L     2,60(2)
         SLR   4,4
         IC    4,2(2)
         SLR   5,5
         IC    5,0(9,4)
         A     5,=F'3'
         SRA   5,2
L744     EQU   *
         L     9,=V(MODE@SIZ)
         L     2,8(6)
         L     4,116(13)
         LA    3,15(0,0)
         CR    4,3
         BNH   L747
         L     2,60(2)
         SLR   3,3
         IC    3,2(2)
         SLR   15,15
         IC    15,0(9,3)
         A     15,=F'7'
         SRA   15,3
         B     L748
L747     EQU   *
         L     2,60(2)
         SLR   4,4
         IC    4,2(2)
         SLR   15,15
         IC    15,0(9,4)
         A     15,=F'3'
         SRA   15,2
L748     EQU   *
         SLR   9,9
         ST    9,120(13)
         L     2,8(6)
         L     4,60(2)
         LH    2,0(4)
         CLM   2,3,=H'76'
         BNE   L751
         SLR   2,2
         IC    2,2(4)
         L     3,=V(MODE@SIZ)
         IC    2,0(3,2)
         CLM   2,1,=XL1'03'
         BNH   L751
         L     4,8(4)
         SRL   4,2
         ST    4,120(13)
L751     EQU   *
         L     2,4(6)
         L     4,60(2)
         LH    2,0(4)
         CLM   2,3,=H'76'
         BNE   L752
         SLR   2,2
         IC    2,2(4)
         L     3,=V(MODE@SIZ)
         IC    2,0(3,2)
         CLM   2,1,=XL1'03'
         BNH   L752
         L     9,8(4)
         SRL   9,2
L752     EQU   *
         L     2,116(13)
         A     2,120(13)
         L     3,112(13)
         AR    3,9
         AR    5,3
         CR    2,5
         BNL   L742
         AR    2,15
         CR    3,2
         BNL   L742
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2030'
L766     EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L742     EQU   *
         L     6,0(6)
         B     L765
L724     EQU   *
         L     8,0(8)
         B     L721
L703     EQU   *
         L     5,104(13)
         A     5,=F'1'
         ST    5,104(13)
         L     3,=V(NUM@WEBS)
         L     2,0(3)
         L     3,=V(NUM@SUBW)
         S     2,0(3)
         CLR   5,2
         BL    L757
L759     EQU   *
* Function check_colors epilogue
         PDPEPIL
* Function check_colors literal pool
         DS    0F
         LTORG
* Function check_colors page table
         DS    0F
PGT24    EQU   *
         DC    A(PG24)
         DS    0F
* Function unalias_web,F34 prologue
@@F34    PDPPRLG CINDEX=25,FRAME=104,BASER=12,ENTRY=NO
         B     FEN25
         LTORG
FEN25    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG25     EQU   *
         LR    11,1
         L     10,=A(PGT25)
* Function unalias_web code
         L     4,0(11)
         MVC   128(4,4),=F'0'
         L     2,40(4)
         N     2,=F'-536870913'
         MVC   32(4,4),=F'-1'
         O     2,=F'1073741824'
         ST    2,40(4)
         MVC   88(4,13),136(4)
         L     2,=V(WEB@LIST)
         LA    2,40(0,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         L     2,12(4)
         LTR   2,2
         BE    L768
         LA    3,2(0,0)
         CLR   2,3
         BE    L768
         MVC   88(4,13),136(4)
         L     2,=V(WEB@LIST)
         LA    2,32(0,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         B     L793
L768     EQU   *
         L     3,136(4)
         L     15,=V(WEB@LIST)
         LA    15,32(0,15)
         L     2,0(3)
         LTR   2,2
         BNE   L791
         L     2,4(3)
         LTR   2,2
         BE    L790
L791     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'119'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L790     EQU   *
         L     2,0(15)
         LTR   2,2
         BNE   L792
         ST    3,0(15)
         B     L793
L792     EQU   *
         L     2,4(2)
         LTR   2,2
         BE    L799
         L     15,0(15)
         A     15,=F'4'
         L     2,0(15)
         B     L792
L799     EQU   *
         MVC   0(4,3),0(15)
         L     2,0(15)
         ST    3,4(2)
L793     EQU   *
         L     2,40(4)
         N     2,=F'-126977'
         O     2,=F'32768'
         ST    2,40(4)
* Function unalias_web epilogue
         PDPEPIL
* Function unalias_web literal pool
         DS    0F
         LTORG
* Function unalias_web page table
         DS    0F
PGT25    EQU   *
         DC    A(PG25)
LC2      EQU   *
         DC    C' %d'
         DC    X'0'
         DS    0F
* Function break_aliases_to_web,F35 prologue
@@F35    PDPPRLG CINDEX=26,FRAME=104,BASER=12,ENTRY=NO
         B     FEN26
         LTORG
FEN26    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG26     EQU   *
         LR    11,1
         L     10,=A(PGT26)
* Function break_aliases_to_web code
         L     4,0(11)
         L     2,40(4)
         N     2,=F'126976'
         L     3,=F'36864'
         CLR   2,3
         BE    L801
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2072'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L801     EQU   *
         L     6,=V(WEB@LIST)
         L     15,40(6)
L815     EQU   *
         LTR   15,15
         BE    L812
         L     3,8(15)
         L     5,4(15)
         L     2,128(3)
         CLR   2,4
         BNE   L804
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@F34)
         BALR  14,15
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC2)
         MVC   96(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
L804     EQU   *
         LR    15,5
         B     L815
L812     EQU   *
         MVC   12(4,4),16(4)
         MVC   20(4,4),24(4)
         MVC   84(4,4),88(4)
         L     2,40(4)
         N     2,=F'-536870913'
         MVC   28(4,4),=F'0'
         O     2,=F'1073741824'
         ST    2,40(4)
         L     15,40(6)
         LTR   15,15
         BE    L814
L810     EQU   *
         L     2,8(15)
         L     2,128(2)
         OC    40(4,2),=F'536870912'
         L     15,4(15)
         LTR   15,15
         BNE   L810
L814     EQU   *
* Function break_aliases_to_web epilogue
         PDPEPIL
* Function break_aliases_to_web literal pool
         DS    0F
         LTORG
* Function break_aliases_to_web page table
         DS    0F
PGT26    EQU   *
         DC    A(PG26)
         DS    0F
@@V6     EQU   *
         DC    1024X'00'
LC3      EQU   *
         DC    C'0x%lx'
         DC    X'0'
LC4      EQU   *
         DC    C'colorize web %d Ýdon''t begin at %s¨'
         DC    X'0'
LC5      EQU   *
         DC    C' avoid %d'
         DC    X'0'
LC6      EQU   *
         DC    C' --> got %d'
         DC    X'0'
LC7      EQU   *
         DC    C' Ýconstrains neighbors¨'
         DC    X'0'
LC8      EQU   *
         DC    X'15'
         DC    X'0'
LC9      EQU   *
         DC    C'  *** %d spilled, although %s ***'
         DC    X'15'
         DC    X'0'
LC10     EQU   *
         DC    C'spilltemp'
         DC    X'0'
LC11     EQU   *
         DC    C'non-spill'
         DC    X'0'
LC12     EQU   *
         DC    C'  breaking alias %d -> %d'
         DC    X'15'
         DC    X'0'
LC13     EQU   *
         DC    C'  trying to spill %d'
         DC    X'15'
         DC    X'0'
LC14     EQU   *
         DC    C'  spilling %d was useless'
         DC    X'15'
         DC    X'0'
LC15     EQU   *
         DC    C'  to spill %d was a good idea'
         DC    X'15'
         DC    X'0'
LC16     EQU   *
         DC    C'breaking aliases to web %d:'
         DC    X'0'
         DS    0F
* Function colorize_one_web,F27 prologue
@@F27    PDPPRLG CINDEX=27,FRAME=320,BASER=12,ENTRY=NO
         B     FEN27
         LTORG
FEN27    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG27     EQU   *
         LR    11,1
         L     10,=A(PGT27)
* Function colorize_one_web code
         SLR   2,2
         SLR   3,3
         ST    2,200(13)
         ST    3,4+200(13)
         ST    2,208(13)
         ST    3,4+208(13)
         ST    2,216(13)
         ST    3,4+216(13)
         ST    2,224(13)
         ST    3,4+224(13)
         ST    2,232(13)
         ST    3,4+232(13)
         ST    2,240(13)
         ST    3,4+240(13)
         ST    2,248(13)
         ST    3,4+248(13)
         ST    2,256(13)
         ST    3,4+256(13)
         ST    2,264(13)
         ST    3,4+264(13)
         ST    2,272(13)
         ST    3,4+272(13)
         ST    2,280(13)
         ST    3,4+280(13)
         ST    2,288(13)
         ST    3,4+288(13)
         ST    2,296(13)
         ST    3,4+296(13)
         ST    2,304(13)
         ST    3,4+304(13)
         L     9,0(11)
         L     7,=F'-1'
         ST    7,148(13)
         MVC   152(4,13),=F'0'
         SLR   7,7
         ST    7,156(13)
         ST    7,160(13)
         MVC   164(4,13),148(13)
         ST    7,168(13)
         L     2,4(9)
         L     3,=V(MAX@NORM)
         CL    2,0(3)
         BL    L817
         ST    7,4(11)
L817     EQU   *
         ST    9,88(13)
         LR    4,13
         A     4,=F'144'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F26)
         BALR  14,15
         MVC   172(4,13),156(13)
         L     5,44(9)
         A     5,=F'1'
         ST    5,152(13)
         L     8,72(9)
L1175    EQU   *
         LTR   8,8
         BE    L1146
         MVC   88(4,13),4(8)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    6,15
         L     5,8(8)
         OC    172(4,13),92(15)
         LTR   5,5
         BE    L821
         L     3,8(5)
         B     L822
L821     EQU   *
         L     3,4(8)
L822     EQU   *
         L     2,40(6)
         LR    4,2
         N     4,=F'126976'
         L     15,=F'45056'
         CLR   4,15
         BE    L820
         L     15,=F'8192'
         CLR   4,15
         BE    L820
         SRL   2,30
         N     2,=F'1'
         LTR   2,2
         BNE   L820
L1176    EQU   *
         LTR   3,3
         BE    L820
         L     2,64(3)
         LR    15,3
         LTR   2,2
         BE    L828
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L828     EQU   *
         L     2,40(15)
         N     2,=F'126976'
         L     4,=F'40960'
         CR    2,4
         BE    L826
         L     2,44(3)
         C     2,152(13)
         BL    L826
         ST    2,152(13)
         LR    7,6
         L     15,156(13)
         A     15,=F'1'
         ST    15,156(13)
L826     EQU   *
         LTR   5,5
         BE    L820
         L     5,0(5)
         LTR   5,5
         BE    L820
         L     3,8(5)
         B     L1176
L820     EQU   *
         L     8,0(8)
         B     L1175
L1146    EQU   *
         MVC   88(4,13),=A(@@V6)
         MVC   92(4,13),=A(LC3)
         MVC   96(4,13),144(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC4)
         MVC   96(4,13),0(9)
         MVC   100(4,13),=A(@@V6)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         L     2,156(13)
         LTR   2,2
         BE    L836
         MVC   168(4,13),84(7)
         MVC   88(4,13),168(13)
         L     3,152(13)
         A     3,=F'1'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F24)
         BALR  14,15
         ST    15,160(13)
L836     EQU   *
         L     2,40(9)
         SRL   2,31
         L     3,=V(USABLE@R)
         LTR   2,2
         BE    L838
         L     5,84(9)
         MVC   88(4,13),4(9)
         LA    1,88(,13)
         L     15,=V(REG@PREF)
         BALR  14,15
         SLL   15,2
         N     5,0(15,3)
         B     L839
L838     EQU   *
         MVC   88(4,13),4(9)
         LA    1,88(,13)
         L     15,=V(REG@PREF)
         BALR  14,15
         SLL   15,2
         L     5,0(15,3)
L839     EQU   *
         L     8,=V(ZZZ@109)
         LR    6,5
         N     6,0(8)
         L     2,36(9)
         LTR   2,2
         BE    L1171
         LR    7,2
         BCTR  7,0
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,44(2)
         L     2,4(9)
         SLL   2,2
         L     2,0(2,3)
         SLR   3,3
         IC    3,2(2)
         L     2,144(13)
         SRL   2,0(7)
         N     2,=F'1'
         LTR   2,2
         BNE   L1171
         LR    2,5
         SRL   2,0(7)
         N     2,=F'1'
         LTR   2,2
         BE    L1171
         LA    4,15(0,0)
         CR    7,4
         BH    L843
         LR    2,7
         X     2,=F'1'
         N     2,=F'1'
         LTR   2,2
         BNE   L844
         LA    15,7(0,0)
         CLR   3,15
         BE    L1171
         LA    2,10(0,0)
         CLR   3,2
         BNE   L844
         B     L1171
L843     EQU   *
         LR    2,3
         A     2,=F'-9'
         LA    4,1(0,0)
         CLR   2,4
         BNH   L844
         LA    15,16(0,0)
         CLR   3,15
         BE    L844
         LA    2,17(0,0)
         CR    3,2
         BNE   L1171
L844     EQU   *
         L     4,=V(MODE@SIZ)
         LA    15,15(0,0)
         CR    7,15
         BNH   L845
         SLR   2,2
         IC    2,0(4,3)
         LR    3,2
         A     3,=F'7'
         SRA   3,3
         B     L846
L845     EQU   *
         SLR   15,15
         IC    15,0(4,3)
         LR    3,15
         A     3,=F'3'
         SRA   3,2
L846     EQU   *
         LA    4,1(0,0)
         CR    4,3
         BNL   L850
         AR    7,4
         LR    2,5
         SRL   2,0(7)
         BCTR  7,0
         NR    2,4
L1177    EQU   *
         LTR   2,2
         BE    L850
         A     4,=F'1'
         CR    4,3
         BNL   L850
         LR    2,7
         AR    2,4
         LR    15,5
         SRL   15,0(2)
         LR    2,15
         N     2,=F'1'
         B     L1177
L850     EQU   *
         CR    4,3
         BNE   L1171
         LTR   7,7
         BNL   L856
L1171    EQU   *
         MVC   88(4,13),144(13)
         MVC   92(4,13),172(13)
         MVC   96(4,13),96(9)
         ST    6,100(13)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,44(2)
         L     2,4(9)
         SLL   2,2
         L     2,0(2,3)
         SLR   3,3
         IC    3,2(2)
         ST    3,104(13)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         LR    7,15
L856     EQU   *
         LTR   7,7
         BNL   L857
         MVC   88(4,13),144(13)
         MVC   92(4,13),172(13)
         MVC   96(4,13),96(9)
         ST    5,100(13)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,44(2)
         L     2,4(9)
         SLL   2,2
         L     2,0(2,3)
         SLR   4,4
         IC    4,2(2)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         LR    7,15
L857     EQU   *
         LTR   7,7
         BNL   L858
         L     2,40(9)
         SRL   2,31
         LTR   2,2
         BE    L859
         O     5,84(9)
         B     L860
L859     EQU   *
         MVC   88(4,13),4(9)
         LA    1,88(,13)
         L     15,=V(REG@ALTE)
         BALR  14,15
         SLL   15,2
         L     2,=V(USABLE@R)
         O     5,0(15,2)
L860     EQU   *
         LR    6,5
         N     6,0(8)
         MVC   88(4,13),144(13)
         MVC   92(4,13),172(13)
         MVC   96(4,13),96(9)
         ST    6,100(13)
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,12(2)
         L     3,44(2)
         L     2,4(9)
         SLL   2,2
         L     2,0(2,3)
         SLR   6,6
         IC    6,2(2)
         ST    6,104(13)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNL   L858
         MVC   88(4,13),144(13)
         MVC   92(4,13),172(13)
         MVC   96(4,13),96(9)
         ST    5,100(13)
         L     2,0(4)
         L     2,12(2)
         L     3,44(2)
         L     2,4(9)
         SLL   2,2
         L     2,0(2,3)
         SLR   7,7
         IC    7,2(2)
         ST    7,104(13)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         LR    7,15
L858     EQU   *
         LTR   7,7
         BL    L837
         L     15,148(13)
         LTR   15,15
         BNL   L863
         ST    7,148(13)
L863     EQU   *
         L     2,156(13)
         LTR   2,2
         BE    L837
         L     4,168(13)
         SLR   5,5
         L     6,44(9)
         A     6,=F'1'
L1178    EQU   *
         CR    5,6
         BNL   L1150
         LR    3,7
         AR    3,5
         LA    2,1(0,0)
         SLL   2,0(3)
         X     2,=F'-1'
         NR    4,2
         A     5,=F'1'
         B     L1178
L1150    EQU   *
         ST    4,88(13)
         L     3,152(13)
         A     3,=F'1'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F24)
         BALR  14,15
         L     4,160(13)
         CR    4,15
         BE    L837
         C     15,156(13)
         BNL   L837
         C     15,164(13)
         BNH   L870
         ST    15,164(13)
         ST    7,148(13)
L870     EQU   *
         LA    2,1(0,0)
         SLL   2,0(7)
         O     2,144(13)
         ST    2,144(13)
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC5)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         B     L836
L837     EQU   *
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC6)
         LR    2,7
         LTR   7,7
         BNL   L873
         L     2,148(13)
L873     EQU   *
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         L     5,148(13)
         LTR   5,5
         BL    L874
         LTR   7,7
         BNL   L874
         L     2,40(9)
         SRL   2,30
         N     2,=F'1'
         LTR   2,2
         BNE   L874
         LR    7,5
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC7)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
L874     EQU   *
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC8)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         LTR   7,7
         L     14,=A(L876)
         BNLR  14
         L     6,4(11)
         LTR   6,6
         L     14,=A(L877)
         BER   14
         L     2,40(9)
         SRL   2,30
         N     2,=F'1'
         LTR   2,2
         BE    L878
         L     2,12(9)
         LTR   2,2
         L     14,=A(L877)
         BER   14
L878     EQU   *
         SLR   6,6
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC9)
         MVC   96(4,13),0(9)
         L     2,12(9)
         L     3,=A(LC10)
         LTR   2,2
         BNE   L880
         L     3,=A(LC11)
L880     EQU   *
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         LR    7,13
         A     7,=F'112'
         ST    7,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     8,72(9)
L1179    EQU   *
         L     12,0(,10)
         LTR   8,8
         L     14,=A(L1152)
         BER   14
         L     4,4(8)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         L     3,40(15)
         LR    2,3
         N     2,=F'126976'
         L     5,=F'8192'
         CLR   2,5
         BNE   L884
         CLR   4,15
         BE    L884
         L     5,12(9)
         LTR   5,5
         BE    L884
         L     2,=V(ZZZ@784)
         L     2,0(2)
         LTR   2,2
         BE    L884
         L     2,12(4)
         LTR   2,2
         BNE   L885
         L     2,128(13)
         LTR   2,2
         BE    L888
         L     2,20(2)
         CL    2,20(4)
         L     14,=A(L883)
         BNLR  14
L888     EQU   *
         ST    4,128(13)
         L     14,=A(L883)
         BR    14
L885     EQU   *
         LA    7,2(0,0)
         CLR   5,7
         BNE   L1174
         CLR   2,7
         L     14,=A(L883)
         BNER  14
         L     3,20(4)
         CL    3,20(9)
         L     14,=A(L883)
         BNLR  14
         L     2,132(13)
         LTR   2,2
         BE    L893
         L     2,20(2)
         CLR   2,3
         L     14,=A(L883)
         BNLR  14
L893     EQU   *
         ST    4,132(13)
         L     14,=A(L883)
         BR    14
L1174    EQU   *
         LA    15,2(0,0)
         CLR   2,15
         BE    L896
         L     2,20(4)
         CL    2,20(9)
         L     14,=A(L883)
         BNLR  14
L896     EQU   *
         L     2,136(13)
         LTR   2,2
         BE    L899
         L     2,20(2)
         CL    2,20(4)
         L     14,=A(L883)
         BNLR  14
L899     EQU   *
         ST    4,136(13)
         L     14,=A(L883)
         BR    14
L884     EQU   *
         N     3,=F'126976'
         L     2,=F'45056'
         CLR   3,2
         L     14,=A(L883)
         BNER  14
         L     3,40(4)
         LR    2,3
         N     2,=F'126976'
         L     5,=F'45056'
         CLR   2,5
         BNE   L901
         L     2,12(4)
         LTR   2,2
         BNE   L901
         N     3,=F'1610612736'
         L     7,=F'1073741824'
         CLR   3,7
         BNE   L901
         L     3,20(4)
         CL    3,20(9)
         BNL   L902
         L     2,112(13)
         LTR   2,2
         BE    L905
         L     2,20(2)
         CLR   2,3
         BNL   L901
L905     EQU   *
         ST    4,112(13)
         B     L901
L902     EQU   *
         L     2,12(9)
         LTR   2,2
         BE    L901
         L     2,116(13)
         LTR   2,2
         BE    L910
         L     2,20(2)
         CLR   2,3
         BNL   L901
L910     EQU   *
         ST    4,116(13)
L901     EQU   *
         L     3,40(4)
         LR    2,3
         N     2,=F'126976'
         L     5,=F'45056'
         CLR   2,5
         BNE   L911
         L     2,12(4)
         LTR   2,2
         BNE   L911
         N     3,=F'1610612736'
         LTR   3,3
         BNE   L911
         L     3,20(4)
         CL    3,20(9)
         BNL   L912
         L     2,120(13)
         LTR   2,2
         BE    L915
         L     2,20(2)
         CLR   2,3
         BNL   L911
L915     EQU   *
         ST    4,120(13)
         B     L911
L912     EQU   *
         L     2,12(9)
         LTR   2,2
         BE    L911
         LA    7,2(0,0)
         CLR   2,7
         BE    L911
         L     2,124(13)
         LTR   2,2
         BE    L920
         L     2,20(2)
         CLR   2,3
         BNL   L911
L920     EQU   *
         ST    4,124(13)
L911     EQU   *
         L     5,12(9)
         LTR   5,5
         BE    L883
         L     3,40(4)
         LR    2,3
         N     2,=F'126976'
         L     7,=F'45056'
         CLR   2,7
         BNE   L922
         L     2,12(4)
         LA    7,2(0,0)
         CLR   2,7
         BNE   L922
         SRL   3,29
         N     3,=F'1'
         LTR   3,3
         BNE   L922
         L     3,20(4)
         CL    3,20(9)
         BL    L923
         CLR   5,7
         BE    L922
L923     EQU   *
         L     2,128(13)
         LTR   2,2
         BE    L926
         L     2,20(2)
         CLR   2,3
         BNL   L922
L926     EQU   *
         ST    4,128(13)
L922     EQU   *
         L     2,12(15)
         LTR   2,2
         BNE   L927
         L     2,132(13)
         LTR   2,2
         BE    L930
         L     2,20(2)
         CL    2,20(15)
         BNL   L931
L930     EQU   *
         ST    15,132(13)
         B     L931
L927     EQU   *
         LA    3,2(0,0)
         CLR   2,3
         BNE   L931
         L     3,20(15)
         CL    3,20(9)
         BL    L932
         LA    4,2(0,0)
         CLR   5,4
         BE    L931
L932     EQU   *
         L     2,136(13)
         LTR   2,2
         BE    L935
         L     2,20(2)
         CLR   2,3
         BNL   L931
L935     EQU   *
         ST    15,136(13)
L931     EQU   *
         L     2,12(9)
         LA    5,2(0,0)
         CLR   2,5
         BE    L883
         L     2,40(15)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BE    L883
         L     2,=V(ZZZ@784)
         L     2,0(2)
         LTR   2,2
         BE    L883
         L     2,140(13)
         LTR   2,2
         BE    L939
         L     2,20(2)
         CL    2,20(15)
         BNL   L883
L939     EQU   *
         ST    15,140(13)
L883     EQU   *
         L     8,0(8)
         B     L1179
L1152    EQU   *
         SLR   4,4
         LA    3,112(,13)
L945     EQU   *
         L     2,0(3)
         LTR   2,2
         BE    L943
         LR    6,2
L943     EQU   *
         A     4,=F'1'
         A     3,=F'4'
         LTR   6,6
         BNE   L942
         LA    7,7(0,0)
         CLR   4,7
         BNH   L945
         L     14,=A(L946)
         BR    14
L942     EQU   *
         LTR   6,6
         L     14,=A(L946)
         BER   14
         L     3,32(6)
         L     2,40(6)
         N     2,=F'126976'
         L     15,=F'40960'
         CLR   2,15
         L     14,=A(L947)
         BNER  14
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BE    L948
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1538'
         B     L1193
L948     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC12)
         MVC   96(4,13),0(6)
         MVC   100(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         L     3,128(6)
         MVC   180(4,13),32(3)
         L     4,=V(MODE@SIZ)
         L     2,60(6)
         L     7,180(13)
         LA    5,15(0,0)
         CLR   7,5
         BNH   L949
         SLR   15,15
         IC    15,2(2)
         SLR   8,8
         IC    8,0(4,15)
         A     8,=F'7'
         SRA   8,3
         B     L950
L949     EQU   *
         SLR   5,5
         IC    5,2(2)
         SLR   8,8
         IC    8,0(4,5)
         A     8,=F'3'
         SRA   8,2
L950     EQU   *
         L     2,40(3)
         N     2,=F'126976'
         L     7,=F'8192'
         CLR   2,7
         BE    L953
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2117'
L1193    EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L953     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@F34)
         BALR  14,15
         MVC   176(4,13),72(6)
L1180    EQU   *
         L     12,0(,10)
         L     15,176(13)
         LTR   15,15
         L     14,=A(L1155)
         BER   14
         L     2,176(13)
         MVC   184(4,13),4(2)
         L     3,184(13)
         L     2,40(3)
         SRL   2,17
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L956)
         BER   14
         MVC   196(4,13),=F'0'
         MVC   192(4,13),196(13)
         SLR   4,4
         CLR   4,8
         BNL   L1157
L961     EQU   *
         L     3,180(13)
         A     3,192(13)
         LA    2,1(0,0)
         SLL   2,0(3)
         O     2,196(13)
         ST    2,196(13)
         L     5,192(13)
         A     5,=F'1'
         ST    5,192(13)
         CLR   5,8
         BL    L961
L1157    EQU   *
         L     6,184(13)
         L     3,72(6)
L1181    EQU   *
         LTR   3,3
         BE    L1159
         L     4,4(3)
         L     2,40(4)
         N     2,=F'126976'
         L     7,=F'40960'
         CLR   2,7
         BNE   L964
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     15,=F'8192'
         CLR   2,15
         BNE   L964
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LA    2,1(0,0)
         L     15,32(15)
         SLL   2,0(15)
         X     2,=F'-1'
         N     2,196(13)
         ST    2,196(13)
L964     EQU   *
         L     3,0(3)
         B     L1181
L1159    EQU   *
         L     2,184(13)
         L     3,76(2)
L1182    EQU   *
         LTR   3,3
         BE    L1161
         L     4,4(3)
         L     2,40(4)
         N     2,=F'126976'
         L     5,=F'8192'
         CLR   2,5
         BNE   L969
         LA    2,1(0,0)
         L     4,32(4)
         SLL   2,0(4)
         X     2,=F'-1'
         N     2,196(13)
         ST    2,196(13)
L969     EQU   *
         L     3,0(3)
         B     L1182
L1161    EQU   *
         MVC   188(4,13),=F'0'
         MVC   192(4,13),188(13)
         SLR   6,6
         CLR   6,8
         L     14,=A(L956)
         BNLR  14
L992     EQU   *
         L     12,0(,10)
         L     3,180(13)
         A     3,192(13)
         L     2,196(13)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L974)
         BER   14
         SLL   3,2
         L     2,=V(HARDREG2)
         L     2,0(3,2)
         ST    2,188(13)
         L     2,=V(SUP@IGRA)
         L     5,0(2)
         L     15,184(13)
         L     7,0(15)
         L     2,=V(NUM@WEBS)
         L     6,0(2)
         ST    6,204(13)
         L     2,200(13)
         L     3,4+200(13)
         MR    2,7
         ST    2,200(13)
         ST    3,4+200(13)
         L     3,188(13)
         L     15,0(3)
         L     3,204(13)
         AR    3,15
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         X     2,=F'-1'
         N     2,12(5,4)
         ST    2,12(5,4)
         ST    6,212(13)
         L     2,208(13)
         L     3,4+208(13)
         MR    2,15
         ST    2,208(13)
         ST    3,4+208(13)
         L     3,212(13)
         AR    3,7
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         X     2,=F'-1'
         N     2,12(5,4)
         ST    2,12(5,4)
         L     2,=V(IGRAPH)
         L     6,0(2)
         CLR   7,15
         L     14,=A(L976)
         BNLR  14
         LR    3,15
         BCTR  3,0
         B     PGE27
         DS    0F
         LTORG
         DS    0F
PGE27    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG28     EQU   *
         ST    3,220(13)
         L     4,216(13)
         L     5,4+216(13)
         MR    4,15
         ST    4,216(13)
         ST    5,4+216(13)
         L     4,220(13)
         SRL   4,1
         AR    4,7
         B     L1183
L976     EQU   *
         L     12,4(,10)
         LR    5,7
         BCTR  5,0
         ST    5,228(13)
         L     4,224(13)
         L     5,4+224(13)
         MR    4,7
         ST    4,224(13)
         ST    5,4+224(13)
         L     4,228(13)
         SRL   4,1
         AR    4,15
L1183    EQU   *
         L     12,4(,10)
         SRL   4,5
         SLL   4,2
         A     4,=F'8'
         L     5,0(2)
         CLR   7,15
         BNL   L978
         LR    2,15
         BCTR  2,0
         ST    2,236(13)
         L     2,232(13)
         L     3,4+232(13)
         MR    2,15
         ST    2,232(13)
         ST    3,4+232(13)
         L     2,236(13)
         SRL   2,1
         AR    2,7
         B     L1184
L978     EQU   *
         L     12,4(,10)
         LR    3,7
         BCTR  3,0
         ST    3,244(13)
         L     2,240(13)
         L     3,4+240(13)
         MR    2,7
         ST    2,240(13)
         ST    3,4+240(13)
         L     2,244(13)
         SRL   2,1
         AR    2,15
L1184    EQU   *
         L     12,4(,10)
         SRL   2,5
         SLL   2,2
         A     2,=F'8'
         L     5,4(5,2)
         CLR   7,15
         BNL   L980
         LR    3,15
         BCTR  3,0
         ST    3,252(13)
         L     2,248(13)
         L     3,4+248(13)
         MR    2,15
         ST    2,248(13)
         ST    3,4+248(13)
         L     2,252(13)
         SRL   2,1
         AR    2,7
         B     L1185
L980     EQU   *
         L     12,4(,10)
         LR    3,7
         BCTR  3,0
         ST    3,260(13)
         L     2,256(13)
         L     3,4+256(13)
         MR    2,7
         ST    2,256(13)
         ST    3,4+256(13)
         L     2,260(13)
         SRL   2,1
         AR    2,15
L1185    EQU   *
         L     12,4(,10)
         N     2,=F'31'
         LA    3,1(0,0)
         SLL   3,0(2)
         X     3,=F'-1'
         NR    3,5
         ST    3,4(6,4)
         L     3,184(13)
         MVC   312(4,13),68(3)
         L     4,312(13)
         LTR   4,4
         BE    L974
L991     EQU   *
         L     12,4(,10)
         L     2,=V(IGRAPH)
         L     15,0(2)
         L     6,312(13)
         L     5,0(6)
         L     7,188(13)
         L     3,0(7)
         CLR   5,3
         BNL   L985
         LR    4,3
         BCTR  4,0
         ST    4,268(13)
         L     6,264(13)
         L     7,4+264(13)
         MR    6,3
         ST    6,264(13)
         ST    7,4+264(13)
         L     4,268(13)
         SRL   4,1
         AR    4,5
         B     L1186
L985     EQU   *
         L     12,4(,10)
         LR    7,5
         BCTR  7,0
         ST    7,276(13)
         L     6,272(13)
         L     7,4+272(13)
         MR    6,5
         ST    6,272(13)
         ST    7,4+272(13)
         L     4,276(13)
         SRL   4,1
         AR    4,3
L1186    EQU   *
         L     12,4(,10)
         SRL   4,5
         SLL   4,2
         A     4,=F'8'
         MVC   316(4,13),0(2)
         CLR   5,3
         BNL   L987
         LR    7,3
         BCTR  7,0
         ST    7,284(13)
         L     6,280(13)
         L     7,4+280(13)
         MR    6,3
         ST    6,280(13)
         ST    7,4+280(13)
         L     2,284(13)
         SRL   2,1
         AR    2,5
         B     L1187
L987     EQU   *
         L     12,4(,10)
         LR    7,5
         BCTR  7,0
         ST    7,292(13)
         L     6,288(13)
         L     7,4+288(13)
         MR    6,5
         ST    6,288(13)
         ST    7,4+288(13)
         L     2,292(13)
         SRL   2,1
         AR    2,3
L1187    EQU   *
         L     12,4(,10)
         SRL   2,5
         SLL   2,2
         A     2,=F'8'
         L     7,316(13)
         L     2,4(7,2)
         ST    2,316(13)
         CLR   5,3
         BNL   L989
         LR    2,3
         BCTR  2,0
         ST    2,300(13)
         L     6,296(13)
         L     7,4+296(13)
         MR    6,3
         ST    6,296(13)
         ST    7,4+296(13)
         L     2,300(13)
         SRL   2,1
         AR    2,5
         B     L1188
L989     EQU   *
         L     12,4(,10)
         LR    7,5
         BCTR  7,0
         ST    7,308(13)
         L     6,304(13)
         L     7,4+304(13)
         MR    6,5
         ST    6,304(13)
         ST    7,4+304(13)
         L     2,308(13)
         SRL   2,1
         AR    2,3
L1188    EQU   *
         L     12,4(,10)
         N     2,=F'31'
         LA    3,1(0,0)
         SLL   3,0(2)
         X     3,=F'-1'
         N     3,316(13)
         ST    3,4(15,4)
         L     7,312(13)
         MVC   312(4,13),68(7)
         L     15,312(13)
         LTR   15,15
         BNE   L991
L974     EQU   *
         L     12,4(,10)
         L     2,192(13)
         A     2,=F'1'
         ST    2,192(13)
         CLR   2,8
         L     14,=A(L992)
         BLR   14
         L     3,188(13)
         LTR   3,3
         BE    L956
         L     4,184(13)
         A     4,=F'72'
L1194    EQU   *
         L     12,4(,10)
         L     2,0(4)
         LTR   2,2
         BE    L956
         L     3,0(4)
         L     5,4(3)
         L     2,40(5)
         N     2,=F'126976'
         L     6,=F'8192'
         CLR   2,6
         BNE   L997
         L     2,196(13)
         L     5,32(5)
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BNE   L996
L997     EQU   *
         L     12,4(,10)
         LR    4,3
         B     L1194
L996     EQU   *
         L     12,4(,10)
         MVC   0(4,4),0(3)
         B     L1194
L956     EQU   *
         L     12,4(,10)
         L     7,176(13)
         MVC   176(4,13),0(7)
         L     14,=A(L1180)
         BR    14
L1155    EQU   *
         L     12,4(,10)
         ST    9,88(13)
         MVC   92(4,13),4(11)
         B     L1192
L947     EQU   *
         L     12,4(,10)
         MVC   88(4,13),136(6)
         L     2,=V(WEB@LIST)
         LA    2,44(0,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         MVC   88(4,13),136(6)
         L     4,=V(WEB@LIST)
         LA    4,36(0,4)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(6)
         N     2,=F'-126977'
         O     2,=F'36864'
         ST    2,40(6)
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC13)
         MVC   96(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@F27)
         BALR  14,15
         L     2,40(9)
         N     2,=F'126976'
         L     5,=F'45056'
         CLR   2,5
         BE    L1021
         MVC   88(4,13),136(6)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         MVC   88(4,13),136(6)
         L     7,=V(WEB@LIST)
         LA    7,44(0,7)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(6)
         N     2,=F'-126977'
         OR    2,5
         ST    2,40(6)
         ST    3,32(6)
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC14)
         MVC   96(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         B     L1078
L1021    EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC15)
         MVC   96(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         MVC   88(4,13),136(6)
         L     15,=V(WEB@LIST)
         LA    15,36(0,15)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         L     2,40(6)
         SRL   2,30
         N     2,=F'1'
         LTR   2,2
         BE    L1040
         ST    6,88(13)
         MVC   92(4,13),=F'0'
         B     L1192
L1040    EQU   *
         L     12,4(,10)
         ST    6,88(13)
         L     2,4(11)
         BCTR  2,0
         ST    2,92(13)
L1192    EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(@@F27)
         BALR  14,15
         B     L1078
L946     EQU   *
         L     12,4(,10)
         MVC   88(4,13),136(9)
         L     3,=V(WEB@LIST)
         LA    3,36(0,3)
         ST    3,92(13)
         B     L1191
L877     EQU   *
         L     12,4(,10)
         MVC   88(4,13),136(9)
         L     4,=V(WEB@LIST)
         LA    4,36(0,4)
         ST    4,92(13)
L1191    EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(9)
         N     2,=F'-126977'
         O     2,=F'36864'
         ST    2,40(9)
         B     L1078
L876     EQU   *
         L     12,4(,10)
         MVC   88(4,13),136(9)
         L     5,=V(WEB@LIST)
         LA    5,44(0,5)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(9)
         N     2,=F'-126977'
         O     2,=F'45056'
         ST    2,40(9)
         ST    7,32(9)
         L     2,=V(ZZZ@778)
         L     2,0(2)
         LTR   2,2
         BE    L1078
         L     4,=V(MODE@SIZ)
         L     2,60(9)
         LA    6,15(0,0)
         CR    7,6
         BNH   L1097
         SLR   15,15
         IC    15,2(2)
         SLR   3,3
         IC    3,0(4,15)
         LR    4,3
         A     4,=F'7'
         SRA   4,3
         B     L1098
L1097    EQU   *
         L     12,4(,10)
         SLR   5,5
         IC    5,2(2)
         SLR   6,6
         IC    6,0(4,5)
         LR    4,6
         A     4,=F'3'
         SRA   4,2
L1098    EQU   *
         L     12,4(,10)
         L     8,72(9)
L1190    EQU   *
         L     12,4(,10)
         LTR   8,8
         BE    L1078
         MVC   88(4,13),4(8)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         SLR   6,6
         CR    6,4
         BNL   L1168
         L     5,92(15)
L1107    EQU   *
         L     12,4(,10)
         LR    3,7
         AR    3,6
         LA    2,1(0,0)
         SLL   2,0(3)
         OR    5,2
         A     6,=F'1'
         CR    6,4
         BL    L1107
         ST    5,92(15)
L1168    EQU   *
         L     12,4(,10)
         L     8,0(8)
         B     L1190
L1078    EQU   *
         L     12,4(,10)
         L     2,4(9)
         L     7,=V(MAX@NORM)
         CL    2,0(7)
         BL    L1109
         L     2,40(9)
         N     2,=F'126976'
         L     15,=F'36864'
         CLR   2,15
         BNE   L1109
         L     2,=V(AN@UNUSA)
         MVC   32(4,9),0(2)
         MVC   88(4,13),136(9)
         L     2,=V(WEB@LIST)
         LA    2,36(0,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         MVC   88(4,13),136(9)
         L     3,=V(WEB@LIST)
         LA    3,44(0,3)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(9)
         N     2,=F'-126977'
         O     2,=F'45056'
         ST    2,40(9)
L1109    EQU   *
         L     12,4(,10)
         L     3,40(9)
         LR    2,3
         N     2,=F'126976'
         L     4,=F'36864'
         CLR   2,4
         BNE   L816
         L     2,=V(ZZZ@784)
         L     2,0(2)
         LTR   2,2
         BE    L816
         SRL   3,29
         N     3,=F'1'
         LTR   3,3
         BE    L816
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC16)
         MVC   96(4,13),0(9)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F37)
         BALR  14,15
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@F35)
         BALR  14,15
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC8)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         MVC   88(4,13),136(9)
         L     5,=V(WEB@LIST)
         LA    5,36(0,5)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         MVC   88(4,13),136(9)
         L     6,=V(WEB@LIST)
         LA    6,32(0,6)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(9)
         N     2,=F'-126977'
         O     2,=F'32768'
         ST    2,40(9)
         MVC   32(4,9),=F'-1'
L816     EQU   *
         L     12,4(,10)
* Function colorize_one_web epilogue
         PDPEPIL
* Function colorize_one_web literal pool
         DS    0F
         LTORG
* Function colorize_one_web page table
         DS    0F
PGT27    EQU   *
         DC    A(PG27)
         DC    A(PG28)
         DS    0F
* Function assign_colors,F28 prologue
@@F28    PDPPRLG CINDEX=29,FRAME=96,BASER=12,ENTRY=NO
         B     FEN29
         LTORG
FEN29    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG29     EQU   *
         LR    11,1
         L     10,=A(PGT29)
* Function assign_colors code
         L     3,=V(WEB@LIST)
L1207    EQU   *
         L     2,32(3)
         LTR   2,2
         BE    L1204
         L     2,=V(WEB@LIST)
         LA    2,32(0,2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         MVC   88(4,13),8(15)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F27)
         BALR  14,15
         B     L1207
L1204    EQU   *
         L     2,=V(WEB@LIST)
         L     3,40(2)
         LTR   3,3
         BE    L1206
L1202    EQU   *
         MVC   88(4,13),8(3)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         L     2,8(3)
         MVC   32(4,2),32(15)
         L     3,4(3)
         LTR   3,3
         BNE   L1202
L1206    EQU   *
* Function assign_colors epilogue
         PDPEPIL
* Function assign_colors literal pool
         DS    0F
         LTORG
* Function assign_colors page table
         DS    0F
PGT29    EQU   *
         DC    A(PG29)
LC17     EQU   *
         DC    C'after alias-breaking'
         DC    X'0'
         DS    0F
* Function break_coalesced_spills,F38 prologue
@@F38    PDPPRLG CINDEX=30,FRAME=104,BASER=12,ENTRY=NO
         B     FEN30
         LTORG
FEN30    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG30     EQU   *
         LR    11,1
         L     10,=A(PGT30)
* Function break_coalesced_spills code
         SLR   5,5
L1248    EQU   *
         L     4,=V(WEB@LIST)
         L     3,36(4)
L1249    EQU   *
         LTR   3,3
         BE    L1212
         L     2,8(3)
         L     2,40(2)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BNE   L1212
         L     3,4(3)
         B     L1249
L1212    EQU   *
         LTR   3,3
         BE    L1210
         LA    5,1(0,0)
         L     2,8(3)
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC16)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F37)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F35)
         BALR  14,15
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC8)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         ST    3,88(13)
         L     3,=V(WEB@LIST)
         LA    3,36(0,3)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         MVC   88(4,13),136(2)
         L     3,=V(WEB@LIST)
         LA    3,32(0,3)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     3,40(2)
         N     3,=F'-126977'
         O     3,=F'32768'
         ST    3,40(2)
         MVC   32(4,2),=F'-1'
L1250    EQU   *
         L     2,32(4)
         LTR   2,2
         BE    L1248
         L     2,=V(WEB@LIST)
         LA    2,32(0,2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         MVC   88(4,13),8(15)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F27)
         BALR  14,15
         B     L1250
L1210    EQU   *
         LTR   5,5
         BE    L1237
         L     3,40(4)
L1251    EQU   *
         LTR   3,3
         BE    L1237
         MVC   88(4,13),8(3)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         L     2,8(3)
         MVC   32(4,2),32(15)
         L     3,4(3)
         B     L1251
L1237    EQU   *
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=A(LC17)
         LA    1,88(,13)
         L     15,=V(DUMP@GRA)
         BALR  14,15
* Function break_coalesced_spills epilogue
         PDPEPIL
* Function break_coalesced_spills literal pool
         DS    0F
         LTORG
* Function break_coalesced_spills page table
         DS    0F
PGT30    EQU   *
         DC    A(PG30)
         DS    0F
* Function init_web_pairs,F39 prologue
@@F39    PDPPRLG CINDEX=31,FRAME=104,BASER=12,ENTRY=NO
         B     FEN31
         LTORG
FEN31    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG31     EQU   *
         LR    11,1
         L     10,=A(PGT31)
* Function init_web_pairs code
         MVC   88(4,13),=A(@@V7)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'32768'
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     2,=A(@@V8)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V9)
         MVC   0(4,2),=F'0'
* Function init_web_pairs epilogue
         PDPEPIL
* Function init_web_pairs literal pool
         DS    0F
         LTORG
* Function init_web_pairs page table
         DS    0F
PGT31    EQU   *
         DC    A(PG31)
         DS    0F
* Function add_web_pair_cost,F40 prologue
@@F40    PDPPRLG CINDEX=32,FRAME=96,BASER=12,ENTRY=NO
         B     FEN32
         LTORG
FEN32    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG32     EQU   *
         LR    11,1
         L     10,=A(PGT32)
* Function add_web_pair_cost code
         SLR   4,4
         SLR   5,5
         L     6,0(11)
         L     7,4(11)
         L     9,8(11)
         L     8,12(11)
         L     2,0(6)
         CL    2,0(7)
         BNH   L1254
         LR    2,6
         LR    6,7
         LR    7,2
L1254    EQU   *
         L     2,=V(NUM@WEBS)
         L     5,0(2)
         M     4,0(6)
         L     3,0(7)
         AR    3,5
         N     3,=F'8191'
         L     4,=A(@@V7)
         SLL   3,2
         L     15,0(3,4)
L1262    EQU   *
         LTR   15,15
         BE    L1261
         L     2,8(15)
         CLR   2,6
         BNE   L1257
         L     2,12(15)
         CLR   2,7
         BNE   L1257
         A     9,20(15)
         ST    9,20(15)
         A     8,16(15)
         ST    8,16(15)
         B     L1253
L1257    EQU   *
         L     15,0(15)
         B     L1262
L1261    EQU   *
         MVC   88(4,13),=F'24'
         LA    1,88(,13)
         L     15,=V(RA@ALLOC)
         BALR  14,15
         L     2,0(3,4)
         ST    2,0(15)
         L     2,=A(@@V9)
         MVC   4(4,15),0(2)
         ST    6,8(15)
         ST    7,12(15)
         ST    8,16(15)
         ST    9,20(15)
         ST    15,0(3,4)
         ST    15,0(2)
         L     2,=A(@@V8)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
L1253    EQU   *
* Function add_web_pair_cost epilogue
         PDPEPIL
* Function add_web_pair_cost literal pool
         DS    0F
         LTORG
* Function add_web_pair_cost page table
         DS    0F
PGT32    EQU   *
         DC    A(PG32)
         DS    0F
* Function comp_web_pairs,F41 prologue
@@F41    PDPPRLG CINDEX=33,FRAME=88,BASER=12,ENTRY=NO
         B     FEN33
         LTORG
FEN33    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG33     EQU   *
         LR    11,1
         L     10,=A(PGT33)
* Function comp_web_pairs code
         L     2,0(11)
         L     4,0(2)
         L     2,4(11)
         L     5,0(2)
         L     3,16(4)
         L     2,16(5)
         L     15,=F'-1'
         CLR   3,2
         BH    L1263
         LA    15,1(0,0)
         BL    L1263
         L     3,20(4)
         L     2,20(5)
         L     15,=F'-1'
         CLR   3,2
         BH    L1263
         LA    15,1(0,0)
         BL    L1263
         SLR   15,15
L1263    EQU   *
* Function comp_web_pairs epilogue
         PDPEPIL
* Function comp_web_pairs literal pool
         DS    0F
         LTORG
* Function comp_web_pairs page table
         DS    0F
PGT33    EQU   *
         DC    A(PG33)
         DS    0F
* Function sort_and_combine_web_pairs,F42 prologue
@@F42    PDPPRLG CINDEX=34,FRAME=128,BASER=12,ENTRY=NO
         B     FEN34
         LTORG
FEN34    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG34     EQU   *
         LR    11,1
         L     10,=A(PGT34)
* Function sort_and_combine_web_pairs code
         SLR   2,2
         SLR   3,3
         ST    2,112(13)
         ST    3,4+112(13)
         ST    2,120(13)
         ST    3,4+120(13)
         L     3,=A(@@V8)
         L     2,0(3)
         LTR   2,2
         BE    L1272
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,104(13)
         L     2,=A(@@V9)
         L     2,0(2)
         SLR   8,8
         LTR   2,2
         BE    L1293
         LR    3,15
L1277    EQU   *
         ST    2,0(3)
         A     8,=F'1'
         A     3,=F'4'
         L     2,4(2)
         LTR   2,2
         BNE   L1277
L1293    EQU   *
         L     2,=A(@@V8)
         CL    8,0(2)
         BE    L1278
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2431'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L1278    EQU   *
         MVC   88(4,13),104(13)
         ST    8,92(13)
         MVC   96(4,13),=F'4'
         MVC   100(4,13),=A(@@F41)
         LA    1,88(,13)
         L     15,=V(QSORT)
         BALR  14,15
         SLR   8,8
L1296    EQU   *
         L     2,=A(@@V8)
         CL    8,0(2)
         BNL   L1295
         LR    2,8
         SLL   2,2
         L     3,104(13)
         L     2,0(2,3)
         MVC   88(4,13),8(2)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),12(2)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    4,15
         L     2,0(11)
         LTR   2,2
         BNE   L1282
         L     2,40(5)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BE    L1281
         L     2,40(15)
         N     2,=F'126976'
         CLR   2,3
         BE    L1281
L1282    EQU   *
         L     2,40(4)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BNE   L1284
         LR    2,5
         LR    5,4
         LR    4,2
L1284    EQU   *
         CLR   5,4
         BE    L1281
         L     2,=V(SUP@IGRA)
         L     9,0(2)
         L     7,0(5)
         L     2,=V(NUM@WEBS)
         L     6,0(2)
         ST    6,116(13)
         L     2,112(13)
         L     3,4+112(13)
         MR    2,7
         ST    2,112(13)
         ST    3,4+112(13)
         L     15,0(4)
         L     3,116(13)
         AR    3,15
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(9,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L1281
         ST    6,124(13)
         L     2,120(13)
         L     3,4+120(13)
         MR    2,15
         ST    2,120(13)
         ST    3,4+120(13)
         L     3,124(13)
         AR    3,7
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(9,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L1281
         L     2,40(4)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BE    L1281
         LR    2,5
         A     2,=F'84'
         ST    2,88(13)
         LR    3,4
         A     3,=F'84'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1387)
         BALR  14,15
         LTR   15,15
         BE    L1281
         L     2,40(5)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BNE   L1288
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         LTR   15,15
         BE    L1287
L1288    EQU   *
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
         B     L1281
L1287    EQU   *
         L     2,40(5)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BNE   L1281
         LA    2,1(0,0)
         L     5,32(5)
         SLL   2,0(5)
         O     2,96(4)
         ST    2,96(4)
L1281    EQU   *
         A     8,=F'1'
         B     L1296
L1295    EQU   *
         MVC   88(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L1272    EQU   *
* Function sort_and_combine_web_pairs epilogue
         PDPEPIL
* Function sort_and_combine_web_pairs literal pool
         DS    0F
         LTORG
* Function sort_and_combine_web_pairs page table
         DS    0F
PGT34    EQU   *
         DC    A(PG34)
         DS    0F
* Function aggressive_coalesce,F43 prologue
@@F43    PDPPRLG CINDEX=35,FRAME=120,BASER=12,ENTRY=NO
         B     FEN35
         LTORG
FEN35    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG35     EQU   *
         LR    11,1
         L     10,=A(PGT35)
* Function aggressive_coalesce code
         SLR   2,2
         SLR   3,3
         ST    2,104(13)
         ST    3,4+104(13)
         ST    2,112(13)
         ST    3,4+112(13)
         LA    1,88(,13)
         L     15,=A(@@F39)
         BALR  14,15
         B     L1341
L1336    EQU   *
         L     6,8(15)
         LTR   6,6
         BE    L1341
         MVC   88(4,13),4(6)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    4,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BNE   L1301
         LR    2,5
         LR    5,15
         LR    4,2
L1301    EQU   *
         CLR   5,4
         BE    L1302
         L     2,40(4)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BE    L1302
         L     2,=V(SUP@IGRA)
         L     9,0(2)
         L     8,0(5)
         L     2,=V(NUM@WEBS)
         L     7,0(2)
         ST    7,108(13)
         L     2,104(13)
         L     3,4+104(13)
         MR    2,8
         ST    2,104(13)
         ST    3,4+104(13)
         L     15,0(4)
         L     3,108(13)
         AR    3,15
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(9,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L1302
         ST    7,116(13)
         L     2,112(13)
         L     3,4+112(13)
         MR    2,15
         ST    2,112(13)
         ST    3,4+112(13)
         L     3,116(13)
         AR    3,8
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(9,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L1302
         L     2,40(5)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BNE   L1305
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         LTR   15,15
         BNE   L1304
L1305    EQU   *
         L     2,40(5)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BE    L1337
L1304    EQU   *
         MVC   88(4,13),16(6)
         MVC   92(4,13),=A(@@V2)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         MVC   12(4,6),=F'1'
         ST    5,88(13)
         ST    4,92(13)
         L     2,0(6)
         L     2,16(2)
         MVC   96(4,13),76(2)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F40)
         BALR  14,15
         B     L1341
L1337    EQU   *
         MVC   88(4,13),16(6)
         MVC   92(4,13),=A(@@V3)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         MVC   12(4,6),=F'2'
         LA    2,1(0,0)
         L     5,32(5)
         SLL   2,0(5)
         O     2,96(4)
         ST    2,96(4)
         B     L1341
L1302    EQU   *
         MVC   88(4,13),16(6)
         MVC   92(4,13),=A(@@V3)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         MVC   12(4,6),=F'2'
L1341    EQU   *
         MVC   88(4,13),=A(@@V1)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         LTR   15,15
         BNE   L1336
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F42)
         BALR  14,15
* Function aggressive_coalesce epilogue
         PDPEPIL
* Function aggressive_coalesce literal pool
         DS    0F
         LTORG
* Function aggressive_coalesce page table
         DS    0F
PGT35    EQU   *
         DC    A(PG35)
         DS    0F
* Function extended_coalesce_2,F44 prologue
@@F44    PDPPRLG CINDEX=36,FRAME=144,BASER=12,ENTRY=NO
         B     FEN36
         LTORG
FEN36    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG36     EQU   *
         LR    11,1
         L     10,=A(PGT36)
* Function extended_coalesce_2 code
         SLR   2,2
         SLR   3,3
         ST    2,128(13)
         ST    3,4+128(13)
         ST    2,136(13)
         ST    3,4+136(13)
         LA    1,88(,13)
         L     15,=A(@@F39)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    7,15
L1366    EQU   *
         LTR   7,7
         BE    L1363
         LH    2,0(7)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L1345
         L     2,4(7)
         SLL   2,4
         L     3,=V(INSN@DF)
         A     2,0(3)
         MVC   104(16,13),0(2)
         L     2,104(13)
         LTR   2,2
         BE    L1345
         MVC   120(4,13),=F'0'
         SLR   3,3
         CLR   3,2
         BNL   L1345
L1360    EQU   *
         L     3,120(13)
         SLL   3,2
         L     2,112(13)
         L     4,0(3,2)
         L     2,=V(DEF2WEB)
         L     3,0(2)
         L     2,16(4)
         SLL   2,2
         L     5,0(2,3)
         L     2,64(5)
         LR    15,5
         LTR   2,2
         BE    L1351
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L1351    EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    5,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BE    L1349
         L     2,4(15)
         L     3,=V(MAX@NORM)
         CL    2,0(3)
         BNL   L1349
         MVC   124(4,13),=F'0'
         SLR   2,2
L1367    EQU   *
         CL    2,108(13)
         BNL   L1349
         L     3,124(13)
         SLL   3,2
         L     2,116(13)
         L     4,0(3,2)
         L     2,=V(USE2WEB)
         L     3,0(2)
         L     2,16(4)
         SLL   2,2
         L     4,0(2,3)
         L     2,64(4)
         LR    15,4
         LTR   2,2
         BE    L1357
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L1357    EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    4,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BE    L1355
         CLR   15,5
         BE    L1355
         L     2,4(15)
         L     3,=V(MAX@NORM)
         CL    2,0(3)
         BNL   L1355
         L     3,60(15)
         L     2,60(5)
         CLC   2(1,3),2(2)
         BNE   L1355
         L     2,=V(SUP@IGRA)
         L     9,0(2)
         L     8,0(5)
         L     2,=V(NUM@WEBS)
         L     6,0(2)
         ST    6,132(13)
         L     2,128(13)
         L     3,4+128(13)
         MR    2,8
         ST    2,128(13)
         ST    3,4+128(13)
         L     15,0(15)
         L     3,132(13)
         AR    3,15
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(9,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L1355
         ST    6,140(13)
         L     2,136(13)
         L     3,4+136(13)
         MR    2,15
         ST    2,136(13)
         ST    3,4+136(13)
         L     3,140(13)
         AR    3,8
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(9,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L1355
         LR    3,4
         A     3,=F'84'
         ST    3,88(13)
         LR    2,5
         A     2,=F'84'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1387)
         BALR  14,15
         LTR   15,15
         BE    L1355
         ST    5,88(13)
         ST    4,92(13)
         L     2,16(7)
         MVC   96(4,13),76(2)
         L     3,48(5)
         A     3,48(4)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@F40)
         BALR  14,15
L1355    EQU   *
         L     2,124(13)
         A     2,=F'1'
         ST    2,124(13)
         B     L1367
L1349    EQU   *
         L     3,120(13)
         A     3,=F'1'
         ST    3,120(13)
         CL    3,104(13)
         BL    L1360
L1345    EQU   *
         L     7,12(7)
         B     L1366
L1363    EQU   *
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F42)
         BALR  14,15
* Function extended_coalesce_2 epilogue
         PDPEPIL
* Function extended_coalesce_2 literal pool
         DS    0F
         LTORG
* Function extended_coalesce_2 page table
         DS    0F
PGT36    EQU   *
         DC    A(PG36)
         DS    0F
* Function check_uncoalesced_moves,F45 prologue
@@F45    PDPPRLG CINDEX=37,FRAME=120,BASER=12,ENTRY=NO
         B     FEN37
         LTORG
FEN37    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG37     EQU   *
         LR    11,1
         L     10,=A(PGT37)
* Function check_uncoalesced_moves code
         SLR   2,2
         SLR   3,3
         ST    2,112(13)
         ST    3,4+112(13)
         LR    8,2
         LR    9,3
         L     2,=V(WL@MOVES)
         L     7,0(2)
         LTR   7,7
         BE    L1379
L1377    EQU   *
         L     5,4(7)
         LTR   5,5
         BE    L1371
         MVC   88(4,13),4(5)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    4,15
         L     2,40(15)
         N     2,=F'126976'
         L     6,=F'8192'
         CLR   2,6
         BNE   L1373
         LR    2,3
         LR    3,15
         LR    4,2
L1373    EQU   *
         CLR   3,4
         BE    L1371
         L     2,12(5)
         LA    5,2(0,0)
         CLR   2,5
         BE    L1371
         LA    6,1(0,0)
         CLR   2,6
         BE    L1371
         L     2,40(4)
         N     2,=F'126976'
         L     5,=F'8192'
         CLR   2,5
         BE    L1371
         L     2,40(3)
         N     2,=F'126976'
         CLR   2,5
         BNE   L1376
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         LTR   15,15
         BNE   L1375
L1376    EQU   *
         L     2,40(3)
         N     2,=F'126976'
         L     6,=F'8192'
         CLR   2,6
         BE    L1371
L1375    EQU   *
         L     2,=V(SUP@IGRA)
         MVC   104(4,13),0(2)
         L     6,0(3)
         L     2,=V(NUM@WEBS)
         L     5,0(2)
         ST    5,116(13)
         L     2,112(13)
         L     3,4+112(13)
         MR    2,6
         ST    2,112(13)
         ST    3,4+112(13)
         L     15,0(4)
         L     3,116(13)
         AR    3,15
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     4,104(13)
         L     2,12(4,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L1371
         LR    9,5
         MR    8,15
         LR    3,6
         AR    3,9
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(4,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L1371
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2600'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L1371    EQU   *
         L     7,0(7)
         LTR   7,7
         BNE   L1377
L1379    EQU   *
* Function check_uncoalesced_moves epilogue
         PDPEPIL
* Function check_uncoalesced_moves literal pool
         DS    0F
         LTORG
* Function check_uncoalesced_moves page table
         DS    0F
PGT37    EQU   *
         DC    A(PG37)
LC18     EQU   *
         DC    C' simplifying web %3d, conflicts = %d'
         DC    X'15'
         DC    X'0'
LC19     EQU   *
         DC    C' potential spill web %3d, conflicts = %d'
         DC    X'15'
         DC    X'0'
LC20     EQU   *
         DC    C'initially'
         DC    X'0'
LC21     EQU   *
         DC    C'before spill-recolor'
         DC    X'0'
LC22     EQU   *
         DC    C'try to set web %d to color %d'
         DC    X'15'
         DC    X'0'
LC23     EQU   *
         DC    C'reset coloring of web %d, too expensive'
         DC    X'15'
         DC    X'0'
LC24     EQU   *
         DC    C'after spill-recolor'
         DC    X'0'
         DS    0F
* X-func ZZZ_1729 prologue
ZZZ@1729 PDPPRLG CINDEX=38,FRAME=192,BASER=12,ENTRY=YES
         B     FEN38
         LTORG
FEN38    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG38     EQU   *
         LR    11,1
         L     10,=A(PGT38)
* Function ZZZ_1729 code
         SLR   2,2
         SLR   3,3
         ST    2,112(13)
         ST    3,4+112(13)
         ST    2,120(13)
         ST    3,4+120(13)
         L     2,=V(ZZZ@1844)
         L     2,0(2)
         LTR   2,2
         BE    L1381
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@489)
         BALR  14,15
L1381    EQU   *
         L     2,=V(RA@PASS)
         L     2,0(2)
         LA    3,1(0,0)
         CR    2,3
         BNH   L1382
         L     3,=V(NUM@WEBS)
         L     2,=V(NUM@SUBW)
         L     7,0(3)
         S     7,0(2)
         LR    4,7
         SLL   4,2
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    9,15
         SLR   6,6
         LR    8,6
         CLR   6,7
         BNL   L1388
         LR    5,15
L1387    EQU   *
         L     2,=V(ID2WEB)
         L     3,0(2)
         LR    2,6
         SLL   2,2
         L     4,0(2,3)
         L     3,4(4)
         L     2,=V(MAX@NORM)
         CL    3,0(2)
         BL    L1385
         ST    4,0(5)
         A     8,=F'1'
         A     5,=F'4'
L1385    EQU   *
         A     6,=F'1'
         CLR   6,7
         BL    L1387
         LTR   8,8
         BE    L1388
         ST    9,88(13)
         ST    8,92(13)
         MVC   96(4,13),=F'4'
         MVC   100(4,13),=A(@@F31)
         LA    1,88(,13)
         L     15,=V(QSORT)
         BALR  14,15
         LR    6,8
         BCTR  6,0
         LR    5,6
         SLL   5,2
         AR    5,9
L1389    EQU   *
         L     3,0(5)
         MVC   88(4,13),136(3)
         MVC   92(4,13),=V(WEB@LIST)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         MVC   88(4,13),136(3)
         L     15,=V(WEB@LIST)
         LA    15,32(0,15)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(3)
         N     2,=F'-126977'
         O     2,=F'32768'
         ST    2,40(3)
         L     4,72(3)
         LTR   4,4
         BE    L1810
         L     7,44(3)
L1412    EQU   *
         L     3,4(4)
         L     2,48(3)
         SR    2,7
         BCTR  2,0
         ST    2,48(3)
         L     4,0(4)
         LTR   4,4
         BNE   L1412
L1810    EQU   *
         LTR   6,6
         BE    L1388
         BCTR  6,0
         A     5,=F'-4'
         B     L1389
L1388    EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L1382    EQU   *
         L     2,=V(WEB@LIST)
         L     15,0(2)
L1850    EQU   *
         LTR   15,15
         BE    L1812
         L     3,8(15)
         L     5,4(15)
         L     2,40(3)
         N     2,=F'126976'
         L     4,=F'8192'
         CLR   2,4
         BE    L1416
         ST    15,88(13)
         MVC   92(4,13),=V(WEB@LIST)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         L     4,48(3)
         L     2,40(3)
         N     2,=F'126976'
         L     6,=F'8192'
         CR    2,6
         BE    L1419
         C     4,100(3)
         BNL   L1420
         B     L1418
L1419    EQU   *
         LTR   4,4
         BNH   L1418
L1420    EQU   *
         MVC   88(4,13),136(3)
         L     9,=V(WEB@LIST)
         LA    9,28(0,9)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(3)
         N     2,=F'-126977'
         O     2,=F'28672'
         B     L1852
L1418    EQU   *
         L     2,132(3)
         LTR   2,2
         BE    L1439
         MVC   88(4,13),136(3)
         L     15,=V(WEB@LIST)
         LA    15,24(0,15)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(3)
         N     2,=F'-126977'
         O     2,=F'24576'
         B     L1852
L1439    EQU   *
         LA    4,3(0,0)
         L     2,12(3)
         LTR   2,2
         BE    L1469
         MVC   88(4,13),136(3)
         LA    4,4(0,0)
         L     2,=V(WEB@LIST)
         LA    2,16(0,2)
         ST    2,92(13)
         B     L1851
L1469    EQU   *
         L     2,44(3)
         LTR   2,2
         BE    L1471
         MVC   88(4,13),136(3)
         LA    4,5(0,0)
         L     6,=V(WEB@LIST)
         LA    6,20(0,6)
         ST    6,92(13)
         B     L1851
L1471    EQU   *
         MVC   88(4,13),136(3)
         L     9,=V(WEB@LIST)
         LA    9,12(0,9)
         ST    9,92(13)
L1851    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         SLL   4,12
         L     2,40(3)
         N     2,=F'-126977'
         OR    2,4
L1852    EQU   *
         ST    2,40(3)
L1416    EQU   *
         LR    15,5
         B     L1850
L1812    EQU   *
         L     2,=V(WL@MOVES)
L1867    EQU   *
         L     2,0(2)
         LTR   2,2
         BE    L1814
         L     3,4(2)
         LTR   3,3
         BE    L1867
         MVC   88(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(RA@CALLO)
         BALR  14,15
         ST    3,8(15)
         ST    15,16(3)
         ST    15,88(13)
         MVC   92(4,13),=A(@@V1)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         MVC   12(4,3),=F'0'
         B     L1867
L1814    EQU   *
         L     15,=V(ZZZ@784)
         L     2,0(15)
         LTR   2,2
         BE    L1868
         LA    1,88(,13)
         L     15,=A(@@F43)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@F44)
         BALR  14,15
L1868    EQU   *
         L     12,0(,10)
         L     2,=V(WEB@LIST)
         LA    2,12(0,2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         LTR   15,15
         BNE   L1497
         L     3,=V(WEB@LIST)
         LA    3,20(0,3)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
L1497    EQU   *
         LTR   15,15
         BNE   L1498
         L     4,=V(WEB@LIST)
         LA    4,16(0,4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
L1498    EQU   *
         LTR   15,15
         BE    L1496
         L     3,8(15)
         MVC   88(4,13),=F'8'
         MVC   92(4,13),=A(LC18)
         MVC   96(4,13),0(3)
         MVC   100(4,13),48(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         MVC   88(4,13),136(3)
         L     5,=V(WEB@LIST)
         LA    5,32(0,5)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(3)
         N     2,=F'-126977'
         O     2,=F'32768'
         ST    2,40(3)
         L     2,72(3)
L1854    EQU   *
         LTR   2,2
         BE    L1868
         L     5,4(2)
         L     4,40(5)
         N     4,=F'126976'
         L     6,=F'32768'
         CLR   4,6
         BE    L1519
         L     9,=F'40960'
         CLR   4,9
         BE    L1519
         ST    5,88(13)
         L     15,44(3)
         A     15,=F'1'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
L1519    EQU   *
         L     2,0(2)
         B     L1854
L1496    EQU   *
         L     3,=A(@@V1)
         L     2,0(3)
         LTR   2,2
         L     14,=A(L1523)
         BER   14
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         L     6,8(15)
         MVC   88(4,13),4(6)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    8,15
         L     2,40(15)
         N     2,=F'126976'
         L     4,=F'8192'
         CLR   2,4
         BNE   L1524
         LR    2,5
         LR    5,15
         LR    8,2
L1524    EQU   *
         CLR   5,8
         BNE   L1525
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         MVC   88(4,13),16(6)
         MVC   92(4,13),=A(@@V2)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         MVC   12(4,6),=F'1'
         B     L1866
L1525    EQU   *
         L     2,40(8)
         N     2,=F'126976'
         L     9,=F'8192'
         CLR   2,9
         BE    L1537
         L     2,=V(SUP@IGRA)
         L     15,0(2)
         L     9,0(5)
         L     2,=V(NUM@WEBS)
         L     7,0(2)
         ST    7,116(13)
         L     2,112(13)
         L     3,4+112(13)
         MR    2,9
         ST    2,112(13)
         ST    3,4+112(13)
         L     4,0(8)
         L     3,116(13)
         AR    3,4
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(15,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L1537
         ST    7,124(13)
         L     2,120(13)
         L     3,4+120(13)
         MR    2,4
         ST    2,120(13)
         ST    3,4+120(13)
         L     3,124(13)
         AR    3,9
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(15,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L1536
L1537    EQU   *
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         ST    8,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         MVC   88(4,13),16(6)
         MVC   92(4,13),=A(@@V3)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         MVC   12(4,6),=F'2'
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
         ST    8,88(13)
         B     L1858
L1536    EQU   *
         L     2,40(5)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BNE   L1550
         ST    8,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         LTR   15,15
         BNE   L1549
L1550    EQU   *
         L     2,40(5)
         N     2,=F'126976'
         L     4,=F'8192'
         CLR   2,4
         BE    L1548
         L     2,40(8)
         N     2,=F'126976'
         MVC   136(4,13),=F'1'
         CLR   2,4
         BE    L1552
         MVC   136(4,13),100(8)
L1552    EQU   *
         MVC   128(4,13),=F'0'
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         LR    9,15
         MVC   132(4,13),128(13)
L1565    EQU   *
         LR    2,8
         L     15,132(13)
         LTR   15,15
         BE    L1557
         LR    2,5
L1557    EQU   *
         L     7,72(2)
L1855    EQU   *
         LTR   7,7
         BE    L1820
         L     3,4(7)
         L     2,40(3)
         N     2,=F'126976'
         L     4,=F'32768'
         CLR   2,4
         BE    L1560
         L     15,=F'40960'
         CLR   2,15
         BE    L1560
         L     4,48(3)
         L     15,=F'8192'
         CR    2,15
         BE    L1562
         C     4,100(3)
         BNL   L1563
         B     L1560
L1562    EQU   *
         LTR   4,4
         BNH   L1560
L1563    EQU   *
         ST    9,88(13)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   L1560
         ST    9,88(13)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     2,128(13)
         A     2,44(3)
         A     2,=F'1'
         ST    2,128(13)
L1560    EQU   *
         L     7,0(7)
         B     L1855
L1820    EQU   *
         L     3,132(13)
         A     3,=F'1'
         ST    3,132(13)
         LA    4,1(0,0)
         CLR   3,4
         BNH   L1565
         LTR   9,9
         BE    L1566
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L1566    EQU   *
         L     9,128(13)
         CL    9,136(13)
         BNL   L1548
L1549    EQU   *
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         ST    8,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         MVC   88(4,13),16(6)
         MVC   92(4,13),=A(@@V2)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         MVC   12(4,6),=F'1'
         ST    5,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
L1866    EQU   *
         ST    5,88(13)
L1858    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
         L     14,=A(L1494)
         BR    14
L1548    EQU   *
         MVC   88(4,13),16(6)
         MVC   92(4,13),=A(@@V5)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         MVC   12(4,6),=F'4'
         L     14,=A(L1494)
         BR    14
L1523    EQU   *
         L     3,=V(WEB@LIST)
         L     2,24(3)
         LTR   2,2
         BE    L1591
         L     15,=V(WEB@LIST)
         LA    15,24(0,15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         LR    5,15
         L     3,8(15)
         LA    4,3(0,0)
         L     2,12(3)
         LTR   2,2
         BE    L1603
         MVC   88(4,13),136(3)
         LA    4,4(0,0)
         L     2,=V(WEB@LIST)
         LA    2,16(0,2)
         ST    2,92(13)
         B     L1856
L1603    EQU   *
         L     2,44(3)
         LTR   2,2
         BE    L1605
         MVC   88(4,13),136(3)
         LA    4,5(0,0)
         L     6,=V(WEB@LIST)
         LA    6,20(0,6)
         ST    6,92(13)
         B     L1856
L1605    EQU   *
         MVC   88(4,13),136(3)
         L     9,=V(WEB@LIST)
         LA    9,12(0,9)
         ST    9,92(13)
L1856    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         SLL   4,12
         L     2,40(3)
         N     2,=F'-126977'
         OR    2,4
         ST    2,40(3)
         MVC   88(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(@@F18)
         BALR  14,15
         L     14,=A(L1494)
         BR    14
L1591    EQU   *
         L     3,28(3)
         LTR   3,3
         L     14,=A(L1494)
         BER   14
         L     6,=F'-1'
         LR    5,2
         LR    7,6
         LR    8,2
         LR    4,3
L1619    EQU   *
         L     3,8(4)
         ST    3,88(13)
         L     2,=A(@@V10)
         L     2,0(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     2,12(3)
         LTR   2,2
         BNE   L1615
         CLR   15,6
         BNL   L1846
         LR    6,15
         LR    5,4
         B     L1614
L1615    EQU   *
         LA    9,2(0,0)
         CLR   2,9
         BE    L1618
L1846    EQU   *
         L     2,40(3)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BE    L1614
L1618    EQU   *
         CLR   15,7
         BNL   L1614
         LR    7,15
         LR    8,4
L1614    EQU   *
         L     4,4(4)
         LTR   4,4
         BNE   L1619
         LTR   5,5
         BNE   L1620
         LR    5,8
L1620    EQU   *
         LTR   5,5
         BNE   L1621
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'972'
         L     14,=A(L1865)
         BR    14
L1621    EQU   *
         L     2,8(5)
         OC    40(4,2),=F'1073741824'
         ST    5,88(13)
         L     15,=V(WEB@LIST)
         LA    15,28(0,15)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         L     3,8(5)
         LA    4,3(0,0)
         L     2,12(3)
         LTR   2,2
         BE    L1633
         MVC   88(4,13),136(3)
         LA    4,4(0,0)
         L     2,=V(WEB@LIST)
         LA    2,16(0,2)
         ST    2,92(13)
         B     L1857
L1633    EQU   *
         L     2,44(3)
         LTR   2,2
         BE    L1635
         MVC   88(4,13),136(3)
         LA    4,5(0,0)
         L     6,=V(WEB@LIST)
         LA    6,20(0,6)
         ST    6,92(13)
         B     L1857
L1635    EQU   *
         MVC   88(4,13),136(3)
         L     9,=V(WEB@LIST)
         LA    9,12(0,9)
         ST    9,92(13)
L1857    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         SLL   4,12
         L     2,40(3)
         N     2,=F'-126977'
         OR    2,4
         ST    2,40(3)
         MVC   88(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(@@F18)
         BALR  14,15
         MVC   88(4,13),=F'8'
         MVC   92(4,13),=A(LC19)
         L     2,8(5)
         MVC   96(4,13),0(2)
         L     2,8(5)
         MVC   100(4,13),48(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
L1494    EQU   *
         L     3,=V(WEB@LIST)
         L     2,12(3)
         LTR   2,2
         BNE   L1868
         L     2,20(3)
         LTR   2,2
         BNE   L1868
         L     2,16(3)
         LTR   2,2
         BNE   L1868
         L     15,=A(@@V1)
         L     2,0(15)
         LTR   2,2
         BNE   L1868
         L     2,24(3)
         LTR   2,2
         BNE   L1868
         L     3,28(3)
         LTR   3,3
         BNE   L1868
         L     4,=V(ZZZ@784)
         L     2,0(4)
         LTR   2,2
         BE    L1641
         LA    1,88(,13)
         L     15,=A(@@F45)
         BALR  14,15
L1641    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@F33)
         BALR  14,15
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=A(LC20)
         LA    1,88(,13)
         L     15,=V(DUMP@GRA)
         BALR  14,15
         L     2,=V(ZZZ@779)
         L     2,0(2)
         LTR   2,2
         BE    L1642
         LA    1,88(,13)
         L     15,=A(@@F38)
         BALR  14,15
L1642    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F33)
         BALR  14,15
         L     2,=V(NUM@SUBW)
         L     5,=V(NUM@WEBS)
         L     6,0(5)
         S     6,0(2)
         ST    6,144(13)
         SLL   6,2
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,148(13)
         ST    3,140(13)
         CL    3,144(13)
         BNL   L1824
L1647    EQU   *
         L     3,140(13)
         SLL   3,2
         L     5,=V(ID2WEB)
         L     4,0(5)
         L     15,0(3,4)
         L     9,148(13)
         ST    15,0(3,9)
         L     2,=V(ZZZ@783)
         L     2,0(2)
         LTR   2,2
         BNE   L1645
         L     4,0(3,4)
         L     2,40(4)
         N     2,=F'126976'
         L     6,=F'40960'
         CLR   2,6
         BNE   L1645
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         L     2,0(5)
         L     2,0(3,2)
         L     9,20(15)
         A     9,20(2)
         ST    9,20(15)
L1645    EQU   *
         L     15,140(13)
         A     15,=F'1'
         ST    15,140(13)
         CL    15,144(13)
         BL    L1647
L1824    EQU   *
         MVC   88(4,13),148(13)
         MVC   92(4,13),144(13)
         MVC   96(4,13),=F'4'
         MVC   100(4,13),=A(@@F31)
         LA    1,88(,13)
         L     15,=V(QSORT)
         BALR  14,15
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=A(LC21)
         LA    1,88(,13)
         L     15,=V(DUMP@GRA)
         BALR  14,15
         MVC   140(4,13),=F'0'
         SLR   2,2
         CL    2,144(13)
         L     14,=A(L1826)
         BNLR  14
L1805    EQU   *
         L     12,0(,10)
         L     2,140(13)
         SLL   2,2
         L     3,148(13)
         L     9,0(2,3)
         L     2,40(9)
         N     2,=F'126976'
         L     4,=F'36864'
         CLR   2,4
         L     14,=A(L1650)
         BNER  14
         MVC   88(4,13),=F'20'
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,152(13)
         MVC   88(4,13),=F'20'
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,156(13)
         SLR   4,4
         ST    4,168(13)
L1673    EQU   *
         L     12,0(,10)
         LA    5,15(0,0)
         CR    4,5
         L     14,=A(L1656)
         BHR   14
         LR    2,4
         X     2,=F'1'
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L1655)
         BNER  14
         L     2,60(9)
         IC    2,2(2)
         CLM   2,1,=XL1'07'
         L     14,=A(L1654)
         BER   14
         CLM   2,1,=XL1'0A'
         L     14,=A(L1654)
         BER   14
         L     14,=A(L1655)
         BR    14
L1656    EQU   *
         L     2,60(9)
         IC    3,2(2)
         LA    2,247(,3)
         B     PGE38
         DS    0F
         LTORG
         DS    0F
PGE38    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG39     EQU   *
         CLM   2,1,=XL1'01'
         BNH   L1655
         CLM   3,1,=XL1'10'
         BE    L1655
         SLL   3,24
         SRA   3,24
         C     3,=F'17'
         BNE   L1654
L1655    EQU   *
         L     12,4(,10)
         L     2,60(9)
         L     15,=V(MODE@SIZ)
         LA    6,15(0,0)
         CR    4,6
         BNH   L1658
         SLR   3,3
         IC    3,2(2)
         SLR   5,5
         IC    5,0(15,3)
         LR    15,5
         A     15,=F'7'
         SRA   15,3
         B     L1659
L1658    EQU   *
         L     12,4(,10)
         SLR   6,6
         IC    6,2(2)
         SLR   3,3
         IC    3,0(15,6)
         LR    15,3
         A     15,=F'3'
         SRA   15,2
L1659    EQU   *
         L     12,4(,10)
         SLR   3,3
L1859    EQU   *
         L     12,4(,10)
         CR    3,15
         BNL   L1663
         LR    2,4
         AR    2,3
         L     5,84(9)
         SRL   5,0(2)
         LR    2,5
         N     2,=F'1'
         LTR   2,2
         BE    L1663
         A     3,=F'1'
         B     L1859
L1663    EQU   *
         L     12,4(,10)
         CR    3,15
         BL    L1654
         LTR   15,15
         BE    L1654
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,168(13)
         ST    2,168(13)
         BCTR  15,0
         L     6,=F'-1'
         CLR   15,6
         BE    L1654
         LR    3,15
         AR    3,4
         SLL   3,2
         A     3,156(13)
L1672    EQU   *
         L     12,4(,10)
         L     2,0(3)
         LTR   2,2
         BNE   L1669
         LR    2,4
         A     2,=F'1'
         ST    2,0(3)
L1669    EQU   *
         L     12,4(,10)
         BCTR  15,0
         A     3,=F'-4'
         L     5,=F'-1'
         CR    15,5
         BNE   L1672
L1654    EQU   *
         L     12,4(,10)
         A     4,=F'1'
         LA    6,19(0,0)
         CR    4,6
         L     14,=A(L1673)
         BNHR  14
         MVC   164(4,13),=F'0'
         MVC   160(4,13),164(13)
         MVC   172(4,13),164(13)
         L     7,72(9)
L1860    EQU   *
         L     12,4(,10)
         LTR   7,7
         BE    L1832
         MVC   88(4,13),4(7)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    8,15
         MVC   176(4,13),=F'0'
         L     2,4(7)
         L     2,40(2)
         N     2,=F'126976'
         L     15,=F'40960'
         CLR   2,15
         BE    L1678
         L     2,40(8)
         N     2,=F'126976'
         L     3,=F'45056'
         CLR   2,3
         BE    L1677
L1678    EQU   *
         L     12,4(,10)
         L     2,40(8)
         N     2,=F'126976'
         L     4,=F'8192'
         CLR   2,4
         BNE   L1676
         L     15,32(8)
         LR    2,15
         SLL   2,2
         L     6,156(13)
         L     5,0(2,6)
         LR    2,15
         LTR   5,5
         BE    L1681
         LR    2,5
         BCTR  2,0
L1681    EQU   *
         L     12,4(,10)
         LR    5,2
L1861    EQU   *
         L     12,4(,10)
         CR    5,15
         BH    L1676
         LA    2,1(0,0)
         SLL   2,0(5)
         O     2,160(13)
         ST    2,160(13)
         A     5,=F'1'
         B     L1861
L1677    EQU   *
         L     12,4(,10)
         L     2,44(8)
         LTR   2,2
         BE    L1686
         MVC   176(4,13),=F'1'
L1686    EQU   *
         L     12,4(,10)
         L     3,72(8)
         LTR   3,3
         BE    L1688
         L     15,176(13)
         LTR   15,15
         BNE   L1688
L1691    EQU   *
         L     12,4(,10)
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         L     2,44(15)
         LTR   2,2
         BE    L1689
         MVC   176(4,13),=F'1'
L1689    EQU   *
         L     12,4(,10)
         L     3,0(3)
         LTR   3,3
         BE    L1688
         L     2,176(13)
         LTR   2,2
         BE    L1691
L1688    EQU   *
         L     12,4(,10)
         ST    8,88(13)
         LR    3,13
         A     3,=F'104'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F26)
         BALR  14,15
         L     3,32(8)
         LR    2,3
         SLL   2,2
         L     4,156(13)
         L     5,0(2,4)
         LR    6,3
         LTR   5,5
         BE    L1693
         LR    6,5
         BCTR  6,0
L1693    EQU   *
         L     12,4(,10)
         LR    5,6
         L     15,=V(MODE@SIZ)
         L     2,60(8)
         LA    4,15(0,0)
         CR    3,4
         BNH   L1694
         SLR   4,4
         IC    4,2(2)
         LR    2,4
         SLR   4,4
         IC    4,0(15,2)
         A     4,=F'7'
         SRA   4,3
         B     L1862
L1694    EQU   *
         L     12,4(,10)
         SLR   4,4
         IC    4,2(2)
         LR    2,4
         SLR   4,4
         IC    4,0(15,2)
         A     4,=F'3'
         SRA   4,2
L1862    EQU   *
         L     12,4(,10)
         AR    4,3
         BCTR  4,0
         CR    6,4
         BH    L1676
L1713    EQU   *
         L     12,4(,10)
         L     2,168(13)
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BE    L1700
         L     2,60(9)
         L     15,=V(MODE@SIZ)
         LA    6,15(0,0)
         CR    5,6
         BNH   L1702
         SLR   3,3
         IC    3,2(2)
         SLR   6,6
         IC    6,0(15,3)
         LR    15,6
         A     15,=F'7'
         SRA   15,3
         B     L1703
L1702    EQU   *
         L     12,4(,10)
         SLR   3,3
         IC    3,2(2)
         SLR   6,6
         IC    6,0(15,3)
         LR    15,6
         A     15,=F'3'
         SRA   15,2
L1703    EQU   *
         L     12,4(,10)
         L     6,84(8)
         BCTR  15,0
         L     2,=F'-1'
         CLR   15,2
         BE    L1838
L1708    EQU   *
         L     12,4(,10)
         LR    3,5
         AR    3,15
         LA    2,1(0,0)
         SLL   2,0(3)
         X     2,=F'-1'
         NR    6,2
         BCTR  15,0
         L     3,=F'-1'
         CLR   15,3
         BNE   L1708
L1838    EQU   *
         L     12,4(,10)
         L     15,176(13)
         LTR   15,15
         BE    L1709
         LA    2,1(0,0)
         SLL   2,0(5)
         O     2,172(13)
         ST    2,172(13)
L1709    EQU   *
         L     12,4(,10)
         MVC   88(4,13),104(13)
         ST    6,92(13)
         L     2,60(8)
         SLR   3,3
         IC    3,2(2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(GET@FREE)
         BALR  14,15
         LTR   15,15
         BNL   L1700
         L     2,12(8)
         LTR   2,2
         BE    L1711
         LA    2,1(0,0)
         SLL   2,0(5)
         O     2,164(13)
         ST    2,164(13)
         B     L1700
L1711    EQU   *
         L     12,4(,10)
         LR    2,5
         SLL   2,2
         L     6,152(13)
         L     15,0(2,6)
         A     15,20(8)
         ST    15,0(2,6)
L1700    EQU   *
         L     12,4(,10)
         A     5,=F'1'
         CR    5,4
         BNH   L1713
L1676    EQU   *
         L     12,4(,10)
         L     7,0(7)
         B     L1860
L1832    EQU   *
         L     12,4(,10)
         L     8,=F'-1'
         SLR   4,4
         L     5,152(13)
L1720    EQU   *
         L     12,4(,10)
         L     2,168(13)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L1717
         L     2,160(13)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BNE   L1717
         L     2,164(13)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BNE   L1717
         L     2,=F'-1'
         CLR   8,2
         BE    L1719
         LR    3,8
         SLL   3,2
         L     2,0(5)
         L     6,152(13)
         CL    2,0(3,6)
         BNL   L1717
L1719    EQU   *
         L     12,4(,10)
         LR    8,4
L1717    EQU   *
         L     12,4(,10)
         A     4,=F'1'
         A     5,=F'4'
         LA    15,19(0,0)
         CR    4,15
         BNH   L1720
         LTR   8,8
         L     14,=A(L1721)
         BLR   14
         LR    2,8
         SLL   2,2
         ST    2,180(13)
         L     3,152(13)
         L     2,0(2,3)
         CL    2,20(9)
         L     14,=A(L1721)
         BNLR  14
         L     2,60(9)
         L     15,=V(MODE@SIZ)
         LA    5,15(0,0)
         CR    8,5
         BNH   L1722
         SLR   6,6
         IC    6,2(2)
         LR    2,6
         SLR   6,6
         IC    6,0(15,2)
         A     6,=F'7'
         SRA   6,3
         B     L1723
L1722    EQU   *
         L     12,4(,10)
         SLR   3,3
         IC    3,2(2)
         SLR   6,6
         IC    6,0(15,3)
         A     6,=F'3'
         SRA   6,2
L1723    EQU   *
         L     12,4(,10)
         MVC   184(4,13),=F'0'
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC22)
         MVC   96(4,13),0(9)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         MVC   88(4,13),136(9)
         L     4,=V(WEB@LIST)
         LA    4,36(0,4)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         MVC   88(4,13),136(9)
         L     5,=V(WEB@LIST)
         LA    5,44(0,5)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(9)
         N     2,=F'-126977'
         O     2,=F'45056'
         ST    2,40(9)
         ST    8,32(9)
         L     15,=V(NUM@WEBS)
         MVC   88(4,13),0(15)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,188(13)
         L     7,72(9)
L1869    EQU   *
         L     12,4(,10)
         LTR   7,7
         BE    L1842
         MVC   88(4,13),4(7)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    4,15
         L     7,0(7)
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'45056'
         CR    2,3
         BNE   L1869
         L     5,32(15)
         L     15,=V(MODE@SIZ)
         L     2,60(4)
         LA    3,15(0,0)
         CR    5,3
         BNH   L1747
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         SLR   3,3
         IC    3,0(15,2)
         LR    2,3
         A     2,=F'7'
         SRA   2,3
         B     L1748
L1747    EQU   *
         L     12,4(,10)
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         SLR   3,3
         IC    3,0(15,2)
         LR    2,3
         A     2,=F'3'
         SRA   2,2
L1748    EQU   *
         L     12,4(,10)
         AR    2,5
         L     3,32(9)
         CR    3,2
         BNL   L1869
         AR    3,6
         CR    5,3
         BNL   L1869
         L     2,0(4)
         SLL   2,2
         A     5,=F'1'
         L     15,188(13)
         ST    5,0(2,15)
         MVC   32(4,4),=F'-1'
         MVC   88(4,13),136(4)
         L     2,=V(WEB@LIST)
         LA    2,44(0,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         L     2,40(4)
         N     2,=F'-126977'
         O     2,=F'32768'
         ST    2,40(4)
         L     3,12(4)
         LTR   3,3
         BE    L1754
         LA    5,2(0,0)
         CLR   3,5
         BNE   L1753
L1754    EQU   *
         L     12,4(,10)
         O     2,=F'1073741824'
         ST    2,40(4)
L1753    EQU   *
         L     12,4(,10)
         ST    4,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F27)
         BALR  14,15
         L     2,40(4)
         N     2,=F'126976'
         L     15,=F'36864'
         CLR   2,15
         BNE   L1869
         L     2,184(13)
         A     2,20(4)
         ST    2,184(13)
         B     L1869
L1842    EQU   *
         L     12,4(,10)
         L     5,184(13)
         L     3,152(13)
         L     4,180(13)
         CL    5,0(4,3)
         BNH   L1757
         LA    15,1(0,0)
         CLR   6,15
         BNE   L1757
         L     2,172(13)
         SRL   2,0(8)
         ST    2,172(13)
         NC    172(4,13),=F'1'
         L     3,172(13)
         LTR   3,3
         BNE   L1757
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1803'
         B     L1865
L1757    EQU   *
         L     12,4(,10)
         L     4,184(13)
         CL    4,20(9)
         BNH   L1758
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC23)
         MVC   96(4,13),0(9)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         MVC   88(4,13),136(9)
         L     5,=V(WEB@LIST)
         LA    5,44(0,5)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         MVC   32(4,9),=F'-1'
         MVC   88(4,13),136(9)
         L     6,=V(WEB@LIST)
         LA    6,36(0,6)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(9)
         N     2,=F'-126977'
         O     2,=F'36864'
         ST    2,40(9)
         L     7,72(9)
L1864    EQU   *
         L     12,4(,10)
         LTR   7,7
         BE    L1758
         MVC   88(4,13),4(7)
         LA    1,88(,13)
         L     15,=A(ALIAS)
         BALR  14,15
         LR    3,15
         L     2,0(15)
         SLL   2,2
         L     9,188(13)
         L     4,0(2,9)
         LTR   4,4
         BE    L1778
         L     2,40(15)
         N     2,=F'126976'
         L     15,=F'36864'
         CLR   2,15
         BNE   L1780
         MVC   88(4,13),136(3)
         L     2,=V(WEB@LIST)
         LA    2,36(0,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@L)
         BALR  14,15
         L     2,0(3)
         SLL   2,2
         L     2,0(2,9)
         BCTR  2,0
         ST    2,32(3)
         MVC   88(4,13),136(3)
         L     4,=V(WEB@LIST)
         LA    4,44(0,4)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         L     2,40(3)
         N     2,=F'-126977'
         O     2,=F'45056'
         ST    2,40(3)
         B     L1778
L1780    EQU   *
         L     12,4(,10)
         L     5,=F'45056'
         CLR   2,5
         BNE   L1799
         BCTR  4,0
         ST    4,32(3)
         B     L1778
L1799    EQU   *
         L     12,4(,10)
         L     6,=F'32768'
         CLR   2,6
         BE    L1778
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1837'
L1865    EQU   *
         L     12,4(,10)
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L1778    EQU   *
         L     12,4(,10)
         L     7,0(7)
         B     L1864
L1758    EQU   *
         L     12,4(,10)
         MVC   88(4,13),188(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L1721    EQU   *
         L     12,4(,10)
         MVC   88(4,13),156(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),152(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L1650    EQU   *
         L     12,4(,10)
         L     9,140(13)
         A     9,=F'1'
         ST    9,140(13)
         CL    9,144(13)
         L     14,=A(L1805)
         BLR   14
L1826    EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
         MVC   88(4,13),148(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=A(LC24)
         LA    1,88(,13)
         L     15,=V(DUMP@GRA)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@F33)
         BALR  14,15
* Function ZZZ_1729 epilogue
         PDPEPIL
* Function ZZZ_1729 literal pool
         DS    0F
         LTORG
* Function ZZZ_1729 page table
         DS    0F
PGT38    EQU   *
         DC    A(PG38)
         DC    A(PG39)
         DS    0F
* X-func ZZZ_1730 prologue
ZZZ@1730 PDPPRLG CINDEX=40,FRAME=88,BASER=12,ENTRY=YES
         B     FEN40
         LTORG
FEN40    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG40     EQU   *
         LR    11,1
         L     10,=A(PGT40)
* Function ZZZ_1730 code
         L     2,=A(@@V10)
         MVC   0(4,2),=A(@@F20)
* Function ZZZ_1730 epilogue
         PDPEPIL
* Function ZZZ_1730 literal pool
         DS    0F
         LTORG
* Function ZZZ_1730 page table
         DS    0F
PGT40    EQU   *
         DC    A(PG40)
         DS    0F
* X-func ZZZ_1728 prologue
ZZZ@1728 PDPPRLG CINDEX=41,FRAME=104,BASER=12,ENTRY=YES
         B     FEN41
         LTORG
FEN41    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG41     EQU   *
         LR    11,1
         L     10,=A(PGT41)
* Function ZZZ_1728 code
         B     L1872
L1891    EQU   *
         L     2,8(3)
         MVC   88(4,13),136(2)
         MVC   92(4,13),=V(WEB@LIST)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         NC    40(4,2),=F'-126977'
L1872    EQU   *
         L     2,=V(WEB@LIST)
         LA    2,4(0,2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   L1891
         B     L1892
L1898    EQU   *
         L     15,8(3)
         MVC   76(4,15),=F'0'
         MVC   72(4,15),=F'0'
         L     15,68(15)
L1901    EQU   *
         LTR   15,15
         BE    L1900
         L     2,68(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    15,2
         B     L1901
L1900    EQU   *
         MVC   88(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L1892    EQU   *
         MVC   88(4,13),=V(WEB@LIST)
         LA    1,88(,13)
         L     15,=A(POP@LIST)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   L1898
* Function ZZZ_1728 epilogue
         PDPEPIL
* Function ZZZ_1728 literal pool
         DS    0F
         LTORG
* Function ZZZ_1728 page table
         DS    0F
PGT41    EQU   *
         DC    A(PG41)
         DS    0F
@@V1     EQU   *
         DC    4X'00'
         DS    0F
@@V2     EQU   *
         DC    4X'00'
         DS    0F
@@V3     EQU   *
         DC    4X'00'
         DS    0F
@@V4     EQU   *
         DC    4X'00'
         DS    0F
@@V5     EQU   *
         DC    4X'00'
         DS    0F
@@V10    EQU   *
         DC    4X'00'
         DS    0F
@@V7     EQU   *
         DC    32767X'00'
         DC    1X'00'
         DS    0F
@@V9     EQU   *
         DC    4X'00'
         DS    0F
@@V8     EQU   *
         DC    4X'00'
         END
