         COPY  PDPTOP
         CSECT
* Program text area
         DS    0F
* Function allocate_spill_web,F6 prologue
@@F6     PDPPRLG CINDEX=0,FRAME=96,BASER=12,ENTRY=NO
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function allocate_spill_web code
         L     3,0(11)
         L     15,4(3)
         L     2,108(3)
         LTR   2,2
         BNE   L1
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         SLL   15,2
         L     2,0(15,2)
         SLR   4,4
         IC    4,2(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         ST    15,108(3)
L1       EQU   *
* Function allocate_spill_web epilogue
         PDPEPIL
* Function allocate_spill_web literal pool
         DS    0F
         LTORG
* Function allocate_spill_web page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         DS    0F
* Function is_partly_live_1,F15 prologue
@@F15    PDPPRLG CINDEX=1,FRAME=88,BASER=12,ENTRY=NO
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function is_partly_live_1 code
         L     4,0(11)
         L     15,4(11)
L4       EQU   *
         L     3,0(15)
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(4,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L6
         LA    15,1(0,0)
         B     L3
L6       EQU   *
         L     15,68(15)
         LTR   15,15
         BNE   L4
L3       EQU   *
* Function is_partly_live_1 epilogue
         PDPEPIL
* Function is_partly_live_1 literal pool
         DS    0F
         LTORG
* Function is_partly_live_1 page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* Function update_spill_colors,F16 prologue
@@F16    PDPPRLG CINDEX=2,FRAME=104,BASER=12,ENTRY=NO
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function update_spill_colors code
         L     7,0(11)
         L     6,4(11)
         L     2,64(6)
         LR    15,6
         LTR   2,2
         BE    L12
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L12      EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     5,32(15)
         LTR   5,5
         BL    L8
         L     2,=V(AN@UNUSA)
         C     5,0(2)
         BE    L8
         L     3,=V(MODE@SIZ)
         L     2,60(6)
         LA    4,15(0,0)
         CR    5,4
         BNH   L13
         SLR   4,4
         IC    4,2(2)
         LR    2,4
         SLR   4,4
         IC    4,0(3,2)
         A     4,=F'7'
         SRA   4,3
         B     L14
L13      EQU   *
         SLR   4,4
         IC    4,2(2)
         LR    2,4
         SLR   4,4
         IC    4,0(3,2)
         A     4,=F'3'
         SRA   4,2
L14      EQU   *
         L     3,60(6)
         LH    2,0(3)
         CLM   2,3,=H'76'
         BNE   L17
         ST    5,88(13)
         L     2,4(3)
         SLR   6,6
         IC    6,2(2)
         ST    6,92(13)
         MVC   96(4,13),8(3)
         SLR   2,2
         IC    2,2(3)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1959)
         BALR  14,15
         AR    5,15
         B     L18
L17      EQU   *
         L     2,40(6)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BNE   L18
         LA    4,1(0,0)
L18      EQU   *
         LR    3,4
         BCTR  3,0
         L     2,8(11)
         LTR   2,2
         BE    L20
         LR    4,3
         L     6,=F'-1'
         CLR   3,6
         BE    L8
         L     15,0(7)
L23      EQU   *
         LR    3,5
         AR    3,4
         LA    2,1(0,0)
         SLL   2,0(3)
         OR    15,2
         BCTR  4,0
         L     2,=F'-1'
         CLR   4,2
         BNE   L23
         B     L33
L20      EQU   *
         LR    4,3
         L     3,=F'-1'
         CLR   4,3
         BE    L8
         L     15,0(7)
L27      EQU   *
         LR    3,5
         AR    3,4
         LA    2,1(0,0)
         SLL   2,0(3)
         X     2,=F'-1'
         NR    15,2
         BCTR  4,0
         L     6,=F'-1'
         CLR   4,6
         BNE   L27
L33      EQU   *
         ST    15,0(7)
L8       EQU   *
* Function update_spill_colors epilogue
         PDPEPIL
* Function update_spill_colors literal pool
         DS    0F
         LTORG
* Function update_spill_colors page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
         DS    0F
* Function spill_is_free,F17 prologue
@@F17    PDPPRLG CINDEX=3,FRAME=96,BASER=12,ENTRY=NO
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function spill_is_free code
         L     6,0(11)
         L     3,4(11)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     4,32(15)
         L     15,=F'-1'
         LTR   4,4
         BL    L34
         LA    15,1(0,0)
         L     2,=V(AN@UNUSA)
         CL    4,0(2)
         BE    L34
         L     2,40(3)
         N     2,=F'126976'
         L     5,=F'8192'
         CR    2,5
         BE    L38
         L     5,=V(MODE@SIZ)
         L     2,=V(CFUN)
         L     15,4(3)
         LA    3,15(0,0)
         CR    4,3
         BNH   L39
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         SLL   15,2
         L     2,0(15,2)
         SLR   3,3
         IC    3,2(2)
         SLR   15,15
         IC    15,0(5,3)
         A     15,=F'7'
         SRA   15,3
         B     L38
L39      EQU   *
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         SLL   15,2
         L     2,0(15,2)
         SLR   3,3
         IC    3,2(2)
         SLR   15,15
         IC    15,0(5,3)
         A     15,=F'3'
         SRA   15,2
         B     L38
L49      EQU   *
         SLR   15,15
         B     L34
L38      EQU   *
         BCTR  15,0
         L     5,=F'-1'
         CLR   15,5
         BE    L48
         LR    2,4
         AR    2,15
         L     3,0(6)
         SRL   3,0(2)
         LR    2,3
         N     2,=F'1'
         LTR   2,2
         BNE   L49
         B     L38
L48      EQU   *
         LA    15,1(0,0)
L34      EQU   *
* Function spill_is_free epilogue
         PDPEPIL
* Function spill_is_free literal pool
         DS    0F
         LTORG
* Function spill_is_free page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
LC0      EQU   *
         DC    C'<stdin>'
         DC    X'0'
LC1      EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* Function emit_loads,F18 prologue
@@F18    PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=NO
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function emit_loads code
         L     2,0(11)
         L     9,16(2)
L94      EQU   *
         LTR   9,9
         BE    L52
         BCTR  9,0
         L     3,0(11)
         L     2,12(3)
         LR    4,9
         SLL   4,2
         L     8,0(4,2)
         LTR   8,8
         BE    L94
         L     2,64(8)
         LR    7,8
         LTR   2,2
         BE    L55
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
         LR    7,15
L55      EQU   *
         L     3,4(7)
         L     2,=V(MAX@NORM)
         CL    3,0(2)
         BL    L56
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'877'
         B     L93
L56      EQU   *
         L     5,0(11)
         L     3,32(5)
         LTR   3,3
         BNE   L57
         L     2,12(7)
         LTR   2,2
         BE    L94
         L     2,12(5)
         ST    3,0(4,2)
L57      EQU   *
         NC    40(4,8),=F'-2097153'
         C     9,4(11)
         BNL   L60
         L     3,0(8)
         LR    2,3
         SRL   2,5
         SLL   2,2
         L     4,0(11)
         A     2,8(4)
         N     3,=F'31'
         L     2,12(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L94
L60      EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         LR    2,15
         OC    40(4,15),=F'524288'
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         L     3,116(7)
         LTR   3,3
         BE    L61
         CLR   2,7
         BE    L62
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'904'
         B     L93
L62      EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@222)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),60(7)
         LA    1,88(,13)
         L     15,=V(ZZZ@222)
         BALR  14,15
         LR    3,15
         CL    15,60(7)
         BE    L64
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'910'
L93      EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L61      EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         L     5,108(2)
         MVC   88(4,13),60(8)
         LA    1,88(,13)
         L     15,=V(ZZZ@222)
         BALR  14,15
         LR    3,15
         LH    2,0(15)
         CLM   2,3,=H'76'
         BNE   L64
         SLR   2,2
         IC    2,2(15)
         ST    2,88(13)
         ST    5,92(13)
         SLR   4,4
         IC    4,2(5)
         ST    4,96(13)
         MVC   100(4,13),8(15)
         LA    1,88(,13)
         L     15,=V(ZZZ@1910)
         BALR  14,15
         LR    5,15
L64      EQU   *
         ST    3,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RA@EMIT@)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         L     5,112(8)
         MVC   112(4,8),=F'0'
         LTR   5,5
         BNE   L69
         L     4,8(11)
         LH    2,0(4)
         CLM   2,3,=H'46'
         BNE   L67
         LR    5,4
         B     L69
L67      EQU   *
         L     4,8(11)
         LTR   4,4
         BE    L69
         L     5,12(4)
         L     6,16(4)
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@546)
         BALR  14,15
         L     2,4(6)
         CLR   2,4
         BNE   L70
         MVC   4(4,6),8(5)
L70      EQU   *
         L     3,12(4)
L91      EQU   *
         CLR   3,5
         BE    L75
         ST    6,16(3)
         L     2,=V(DF)
         MVC   88(4,13),0(2)
         ST    6,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@470)
         BALR  14,15
         L     3,12(3)
         B     L91
L69      EQU   *
         L     4,8(5)
         L     6,16(5)
         ST    3,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@550)
         BALR  14,15
         L     2,0(6)
         CLR   2,5
         BNE   L76
         MVC   0(4,6),12(4)
L76      EQU   *
         CLR   3,5
         BE    L75
         ST    6,16(3)
         L     2,=V(DF)
         MVC   88(4,13),0(2)
         ST    6,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@470)
         BALR  14,15
         L     3,12(3)
         B     L76
L75      EQU   *
         L     2,116(7)
         LTR   2,2
         BE    L81
         L     2,=A(@@V1)
         L     5,0(2)
         A     5,=F'1'
         ST    5,0(2)
         L     3,=A(@@V2)
         B     L92
L81      EQU   *
         L     2,=A(@@V3)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         L     3,=A(@@V4)
L92      EQU   *
         L     2,0(3)
         A     2,76(6)
         A     2,=F'1'
         ST    2,0(3)
         L     4,0(8)
         LR    3,4
         SRL   3,5
         SLL   3,2
         L     5,0(11)
         A     3,8(5)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         X     2,=F'-1'
         N     2,12(3)
         ST    2,12(3)
         L     2,32(5)
         LA    3,2(0,0)
         CR    2,3
         BNE   L94
         C     9,4(11)
         BNL   L94
L52      EQU   *
         L     4,0(11)
         L     2,32(4)
         LTR   2,2
         BE    L50
         ST    9,16(4)
L50      EQU   *
* Function emit_loads epilogue
         PDPEPIL
* Function emit_loads literal pool
         DS    0F
         LTORG
* Function emit_loads page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
         DS    0F
* Function reloads_to_loads,F19 prologue
@@F19    PDPPRLG CINDEX=5,FRAME=152,BASER=12,ENTRY=NO
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function reloads_to_loads code
         L     2,0(11)
         MVC   108(4,13),20(2)
         MVC   104(4,13),=F'0'
         SLR   3,3
         CL    3,8(11)
         BNL   L97
         L     4,108(13)
         LTR   4,4
         BE    L97
L151     EQU   *
         L     2,104(13)
         SLL   2,2
         L     8,4(11)
         L     2,0(2,8)
         L     2,16(2)
         SLL   2,2
         L     15,12(11)
         L     5,0(2,15)
         L     2,64(5)
         LR    9,5
         LTR   2,2
         BE    L100
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
         LR    9,15
L100     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'36864'
         CLR   2,3
         BE    L98
         L     2,40(9)
         N     2,=F'126976'
         L     4,=F'8192'
         CLR   2,4
         BNE   L102
         L     2,=V(NEVER@US)
         L     2,0(2)
         L     8,32(9)
         SRL   2,0(8)
         N     2,=F'1'
         LTR   2,2
         BNE   L98
L102     EQU   *
         L     15,0(11)
         L     4,8(15)
         L     3,0(9)
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     15,12(4,2)
         SRL   15,0(3)
         X     15,=F'1'
         N     15,=F'1'
         L     3,0(5)
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(4,2)
         SRL   2,0(3)
         LR    3,2
         N     3,=F'1'
         LTR   3,3
         BNE   L98
         LTR   15,15
         BE    L98
         MVC   112(4,13),108(13)
         L     2,0(11)
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         L     4,0(11)
         L     2,0(4)
         L     6,0(2)
         ST    3,120(13)
         ST    3,116(13)
L163     EQU   *
         LTR   6,6
         BE    L155
L162     EQU   *
         L     2,120(13)
         SLL   2,2
         L     2,12(6,2)
         ST    2,124(13)
         LTR   2,2
         BE    L117
L147     EQU   *
         LA    3,1(0,0)
         L     8,116(13)
         SLL   3,0(8)
         L     2,124(13)
         NR    2,3
         LTR   2,2
         BE    L120
         X     3,=F'-1'
         N     3,124(13)
         ST    3,124(13)
         L     5,8(6)
         SLL   5,2
         A     5,120(13)
         SLL   5,5
         AR    5,8
         L     2,=V(ID2WEB)
         L     3,0(2)
         LR    2,5
         SLL   2,2
         L     3,0(2,3)
         ST    3,128(13)
         L     2,64(3)
         LR    15,3
         LTR   2,2
         BE    L123
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L123     EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         ST    15,144(13)
         L     15,0(11)
         A     15,=F'24'
         ST    15,88(13)
         MVC   92(4,13),144(13)
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         LTR   15,15
         BNE   L124
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1038'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L124     EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     4,32(15)
         LTR   4,4
         BL    L125
         L     2,=V(AN@UNUSA)
         CL    4,0(2)
         BE    L125
         MVC   88(4,13),144(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     7,32(15)
         LTR   7,7
         BL    L125
         CL    7,0(2)
         BE    L125
         L     2,40(9)
         N     2,=F'126976'
         LA    3,1(0,0)
         L     8,=F'8192'
         CR    2,8
         BE    L132
         L     2,=V(CFUN)
         L     3,4(9)
         LA    15,15(0,0)
         CR    4,15
         BNH   L133
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         SLL   3,2
         L     2,0(3,2)
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         L     8,=V(MODE@SIZ)
         SLR   3,3
         IC    3,0(8,2)
         A     3,=F'7'
         SRA   3,3
         B     L132
L133     EQU   *
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         SLL   3,2
         L     2,0(3,2)
         SLR   15,15
         IC    15,2(2)
         L     8,=V(MODE@SIZ)
         SLR   3,3
         IC    3,0(8,15)
         A     3,=F'3'
         SRA   3,2
L132     EQU   *
         L     15,144(13)
         L     2,40(15)
         N     2,=F'126976'
         LA    15,1(0,0)
         L     8,=F'8192'
         CR    2,8
         BE    L138
         L     2,=V(CFUN)
         L     8,144(13)
         L     15,4(8)
         LA    8,15(0,0)
         CR    7,8
         BNH   L139
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         SLL   15,2
         L     2,0(15,2)
         SLR   15,15
         IC    15,2(2)
         LR    2,15
         L     8,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(8,2)
         A     15,=F'7'
         SRA   15,3
         B     L138
L139     EQU   *
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         SLL   15,2
         L     2,0(15,2)
         SLR   15,15
         IC    15,2(2)
         LR    2,15
         L     8,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(8,2)
         A     15,=F'3'
         SRA   15,2
L138     EQU   *
         AR    15,7
         CR    4,15
         BNL   L125
         AR    4,3
         CR    7,4
         BNL   L125
         L     15,128(13)
         L     2,40(15)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L145
         L     2,0(11)
         L     3,12(2)
         LR    4,2
         L     2,16(2)
         SLL   2,2
         ST    15,0(2,3)
         L     8,16(4)
         A     8,=F'1'
         ST    8,16(4)
         OC    40(4,15),=F'2097152'
L145     EQU   *
         L     15,0(11)
         MVC   88(4,13),4(15)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     2,108(13)
         BCTR  2,0
         ST    2,108(13)
L125     EQU   *
         L     3,124(13)
         LTR   3,3
         BE    L117
L120     EQU   *
         L     4,116(13)
         A     4,=F'1'
         ST    4,116(13)
         LA    8,31(0,0)
         CLR   4,8
         BNH   L147
L117     EQU   *
         MVC   116(4,13),=F'0'
         L     15,120(13)
         A     15,=F'1'
         ST    15,120(13)
         LA    2,3(0,0)
         CLR   15,2
         BNH   L162
         MVC   120(4,13),116(13)
         L     6,0(6)
         B     L163
L155     EQU   *
         L     3,108(13)
         CL    3,112(13)
         BE    L98
         L     4,0(11)
         MVC   88(4,13),0(4)
         MVC   92(4,13),0(4)
         MVC   96(4,13),4(4)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
L98      EQU   *
         L     8,104(13)
         A     8,=F'1'
         ST    8,104(13)
         CL    8,8(11)
         BNL   L97
         L     15,108(13)
         LTR   15,15
         BNE   L151
L97      EQU   *
         L     2,0(11)
         MVC   20(4,2),108(13)
* Function reloads_to_loads epilogue
         PDPEPIL
* Function reloads_to_loads literal pool
         DS    0F
         LTORG
* Function reloads_to_loads page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
         DS    0F
* Function rewrite_program2,F20 prologue
@@F20    PDPPRLG CINDEX=6,FRAME=240,BASER=12,ENTRY=NO
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function rewrite_program2 code
         MVC   168(4,13),=F'0'
         L     2,=V(NUM@WEBS)
         L     3,0(2)
         SLL   3,2
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,116(13)
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         ST    15,104(13)
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         ST    15,108(13)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         ST    15,112(13)
         MVC   120(4,13),168(13)
         MVC   124(4,13),168(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LR    8,15
L447     EQU   *
         L     12,0(,10)
         LTR   8,8
         L     14,=A(L166)
         BER   14
         LH    2,0(8)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    L168
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@REA)
         BALR  14,15
         LR    8,15
L168     EQU   *
         LTR   8,8
         BE    L170
         MVC   168(4,13),16(8)
         L     4,168(13)
         LTR   4,4
         BNE   L170
L171     EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@REA)
         BALR  14,15
         LR    8,15
         LTR   15,15
         BE    L170
         MVC   168(4,13),16(15)
         L     15,168(13)
         LTR   15,15
         BE    L171
L170     EQU   *
         LTR   8,8
         L     14,=A(L166)
         BER   14
         L     3,168(13)
         L     2,44(3)
         A     2,=F'2'
         ST    8,180(13)
         MVC   88(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         MVC   128(4,13),=F'0'
         SLL   2,2
         L     4,=V(LIVE@AT@)
         A     2,0(4)
         A     2,=F'-8'
         L     2,0(2)
         L     6,0(2)
         SLR   9,9
         ST    9,184(13)
L448     EQU   *
         LTR   6,6
         BE    L406
         LR    15,6
         A     15,=F'12'
         ST    15,232(13)
L195     EQU   *
         L     2,232(13)
         L     7,0(2)
         LTR   7,7
         BE    L184
L194     EQU   *
         LA    3,1(0,0)
         L     4,184(13)
         SLL   3,0(4)
         LR    2,7
         NR    2,3
         LTR   2,2
         BE    L187
         X     3,=F'-1'
         NR    7,3
         L     2,8(6)
         SLL   2,2
         AR    2,9
         SLL   2,5
         AR    2,4
         L     3,=V(USE2WEB)
         L     3,0(3)
         SLL   2,2
         L     5,0(2,3)
         L     2,64(5)
         LR    15,5
         LTR   2,2
         BE    L190
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L190     EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'36864'
         CLR   2,3
         BE    L191
         L     4,0(5)
         LR    3,4
         SRL   3,5
         SLL   3,2
         A     3,112(13)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
         L     2,40(15)
         N     2,=F'126976'
         L     4,=F'36864'
         CLR   2,4
         BE    L191
         LR    15,13
         A     15,=F'128'
         ST    15,88(13)
         ST    5,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
L191     EQU   *
         LTR   7,7
         BE    L184
L187     EQU   *
         L     2,184(13)
         A     2,=F'1'
         ST    2,184(13)
         LA    3,31(0,0)
         CLR   2,3
         BNH   L194
L184     EQU   *
         MVC   184(4,13),=F'0'
         A     9,=F'1'
         L     4,232(13)
         A     4,=F'4'
         ST    4,232(13)
         LA    15,3(0,0)
         CLR   9,15
         BNH   L195
         SLR   9,9
         L     6,0(6)
         B     L448
L406     EQU   *
         MVC   88(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   124(4,13),=F'0'
         MVC   132(4,13),=F'0'
         L     2,=V(ZZZ@782)
         L     2,0(2)
         LTR   2,2
         BE    L197
         SLR   6,6
L211     EQU   *
         L     2,=V(WEB@LIST)
         LTR   6,6
         BE    L201
         L     5,36(2)
         B     L202
L201     EQU   *
         L     5,40(2)
L202     EQU   *
         LTR   5,5
         BE    L412
         L     4,8(5)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'36864'
         CLR   2,3
         BNE   L205
         L     2,68(4)
         LTR   2,2
         BNE   L208
         L     3,0(4)
         LR    2,3
         SRL   2,5
         SLL   2,2
         A     2,112(13)
         N     3,=F'31'
         L     2,12(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L209
         B     L205
L208     EQU   *
         MVC   88(4,13),112(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L205
L209     EQU   *
         LR    15,13
         A     15,=F'128'
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         LTR   15,15
         BNH   L205
         L     2,124(13)
         A     2,=F'1'
         ST    2,124(13)
         MVC   88(4,13),104(13)
         MVC   92(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         MVC   112(4,4),=F'0'
L205     EQU   *
         L     5,4(5)
         B     L202
L412     EQU   *
         A     6,=F'1'
         LA    3,1(0,0)
         CR    6,3
         BNH   L211
L197     EQU   *
         MVC   176(4,13),168(13)
L449     EQU   *
         L     12,0(,10)
         LTR   8,8
         L     14,=A(L213)
         BER   14
         LH    2,0(8)
         N     2,=XL4'0000FFFF'
         L     4,=V(RTX@CLAS)
         IC    2,0(4,2)
         CLM   2,1,=XL1'89'
         BNE   L215
         L     2,16(8)
         CL    2,176(13)
         BE    L215
         L     2,44(2)
         A     2,=F'2'
         SLL   2,2
         L     15,=V(LIVE@AT@)
         A     2,0(15)
         A     2,=F'-8'
         L     2,0(2)
         L     6,0(2)
         SLR   9,9
         ST    9,188(13)
L450     EQU   *
         LTR   6,6
         BE    L416
         LR    2,6
         A     2,=F'12'
         ST    2,228(13)
L237     EQU   *
         L     3,228(13)
         L     7,0(3)
         LTR   7,7
         BE    L227
L236     EQU   *
         LA    3,1(0,0)
         L     4,188(13)
         SLL   3,0(4)
         LR    2,7
         NR    2,3
         LTR   2,2
         BE    L230
         X     3,=F'-1'
         NR    7,3
         L     2,8(6)
         SLL   2,2
         AR    2,9
         SLL   2,5
         AR    2,4
         L     3,=V(USE2WEB)
         L     3,0(3)
         SLL   2,2
         L     5,0(2,3)
         L     2,64(5)
         LR    15,5
         LTR   2,2
         BE    L233
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L233     EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     15,=F'36864'
         CLR   2,15
         BE    L234
         L     4,0(5)
         LR    3,4
         SRL   3,5
         SLL   3,2
         A     3,112(13)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
         LR    2,13
         A     2,=F'128'
         ST    2,88(13)
         ST    5,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
L234     EQU   *
         LTR   7,7
         BE    L227
L230     EQU   *
         L     3,188(13)
         A     3,=F'1'
         ST    3,188(13)
         LA    4,31(0,0)
         CLR   3,4
         BNH   L236
L227     EQU   *
         MVC   188(4,13),=F'0'
         A     9,=F'1'
         L     15,228(13)
         A     15,=F'4'
         ST    15,228(13)
         LA    2,3(0,0)
         CLR   9,2
         BNH   L237
         SLR   9,9
         L     6,0(6)
         B     L450
L416     EQU   *
         MVC   88(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         L     2,104(13)
         L     6,0(2)
         SLR   9,9
         ST    9,192(13)
L451     EQU   *
         LTR   6,6
         BE    L422
         LR    3,6
         A     3,=F'12'
         ST    3,224(13)
L261     EQU   *
         L     4,224(13)
         L     7,0(4)
         LTR   7,7
         BE    L250
L260     EQU   *
         LA    3,1(0,0)
         L     15,192(13)
         SLL   3,0(15)
         LR    2,7
         NR    2,3
         LTR   2,2
         BE    L253
         X     3,=F'-1'
         NR    7,3
         L     4,8(6)
         SLL   4,2
         AR    4,9
         SLL   4,5
         AR    4,15
         L     2,=V(ID2WEB)
         L     3,0(2)
         LR    2,4
         SLL   2,2
         L     5,0(2,3)
         L     2,64(5)
         LR    15,5
         LTR   2,2
         BE    L256
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L256     EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         LR    2,13
         A     2,=F'128'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         LTR   15,15
         BH    L257
         L     2,40(5)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L258
         L     3,120(13)
         SLL   3,2
         L     2,116(13)
         ST    5,0(3,2)
         L     3,120(13)
         A     3,=F'1'
         ST    3,120(13)
         OC    40(4,5),=F'2097152'
L258     EQU   *
         MVC   88(4,13),108(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     4,124(13)
         BCTR  4,0
         ST    4,124(13)
L257     EQU   *
         LTR   7,7
         BE    L250
L253     EQU   *
         L     15,192(13)
         A     15,=F'1'
         ST    15,192(13)
         LA    2,31(0,0)
         CLR   15,2
         BNH   L260
L250     EQU   *
         MVC   192(4,13),=F'0'
         A     9,=F'1'
         L     3,224(13)
         A     3,=F'4'
         ST    3,224(13)
         LA    4,3(0,0)
         CLR   9,4
         BNH   L261
         SLR   9,9
         L     6,0(6)
         B     L451
L422     EQU   *
         MVC   88(4,13),104(13)
         MVC   92(4,13),104(13)
         MVC   96(4,13),108(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
         MVC   176(4,13),16(8)
         ST    8,180(13)
         LH    2,0(8)
         N     2,=XL4'0000FFFF'
         L     15,=V(RTX@CLAS)
         IC    2,0(15,2)
         CLM   2,1,=XL1'89'
         BE    L215
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@REA)
         BALR  14,15
         ST    15,180(13)
L215     EQU   *
         MVC   136(4,13),=F'0'
         LH    2,0(8)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    4,0(3,2)
         CLM   4,1,=XL1'89'
         BNE   L264
         L     2,4(8)
         SLL   2,4
         L     3,=V(INSN@DF)
         A     2,0(3)
         MVC   144(16,13),0(2)
L264     EQU   *
         CLM   4,1,=XL1'89'
         L     14,=A(L265)
         BNER  14
         SLR   9,9
L452     EQU   *
         L     12,0(,10)
         CL    9,144(13)
         L     14,=A(L265)
         BNLR  14
         LR    3,9
         SLL   3,2
         L     2,152(13)
         L     2,0(3,2)
         ST    2,196(13)
         L     2,=V(DEF2WEB)
         L     3,0(2)
         L     4,196(13)
         L     2,16(4)
         SLL   2,2
         L     7,0(2,3)
         L     2,64(7)
         LTR   2,2
         BE    L270
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L270     EQU   *
         L     2,64(7)
         LR    6,7
         LTR   2,2
         BE    L272
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
         LR    6,15
L272     EQU   *
         SLR   5,5
L453     EQU   *
         CL    5,148(13)
         BNL   L446
         LR    3,5
         SLL   3,2
         L     2,156(13)
         L     4,0(3,2)
         L     2,=V(USE2WEB)
         L     3,0(2)
         L     2,16(4)
         SLL   2,2
         L     3,0(2,3)
         L     2,64(3)
         LTR   2,2
         BE    L277
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
         CLR   6,15
         L     14,=A(L268)
         BER   14
         B     L275
L277     EQU   *
         CLR   6,3
         L     14,=A(L268)
         BER   14
L275     EQU   *
         A     5,=F'1'
         B     L453
L446     EQU   *
         L     2,68(6)
         LTR   2,2
         BNE   L282
         L     3,0(6)
         LR    2,3
         SRL   2,5
         SLL   2,2
         A     2,112(13)
         N     3,=F'31'
         L     2,12(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L281
         B     L283
L282     EQU   *
         MVC   88(4,13),112(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L281
L283     EQU   *
         L     2,=A(@@V5)
         MVC   88(4,13),0(2)
         L     15,196(13)
         MVC   92(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
L281     EQU   *
         L     4,0(7)
         LR    3,4
         SRL   3,5
         SLL   3,2
         A     3,112(13)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         X     2,=F'-1'
         N     2,12(3)
         ST    2,12(3)
         MVC   88(4,13),104(13)
         MVC   92(4,13),0(7)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BE    L284
         L     2,124(13)
         BCTR  2,0
         ST    2,124(13)
         MVC   88(4,13),104(13)
         MVC   92(4,13),0(7)
         LA    1,88(,13)
         L     15,=V(ZZZ@55)
         BALR  14,15
L284     EQU   *
         CLR   7,6
         BE    L285
         L     2,68(6)
         LTR   2,2
         BNE   L287
         L     3,0(6)
         LR    2,3
         SRL   2,5
         SLL   2,2
         A     2,112(13)
         N     3,=F'31'
         L     2,12(2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L289
         B     L288
L287     EQU   *
         MVC   88(4,13),112(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L289
L288     EQU   *
         MVC   88(4,13),104(13)
         MVC   92(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BE    L289
         L     3,124(13)
         BCTR  3,0
         ST    3,124(13)
         MVC   88(4,13),104(13)
         MVC   92(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@55)
         BALR  14,15
         B     L289
L285     EQU   *
         L     5,68(7)
L454     EQU   *
         LTR   5,5
         BE    L289
         L     4,0(5)
         LR    3,4
         SRL   3,5
         SLL   3,2
         A     3,112(13)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         X     2,=F'-1'
         N     2,12(3)
         ST    2,12(3)
         MVC   88(4,13),104(13)
         MVC   92(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BE    L292
         L     4,124(13)
         BCTR  4,0
         ST    4,124(13)
         MVC   88(4,13),104(13)
         MVC   92(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@55)
         BALR  14,15
L292     EQU   *
         L     5,68(5)
         B     L454
L289     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     15,=F'36864'
         CLR   2,15
         BE    L268
         LR    2,13
         A     2,=F'128'
         ST    2,88(13)
         ST    7,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
L268     EQU   *
         A     9,=F'1'
         B     L452
L265     EQU   *
         MVC   172(4,13),120(13)
         LH    2,0(8)
         CLM   2,3,=H'47'
         BNE   L297
         MVC   136(4,13),=F'1'
         L     14,=A(L298)
         BR    14
L445     EQU   *
         L     12,0(,10)
         MVC   136(4,13),=F'1'
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(8)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     14,=A(L298)
         BR    14
L297     EQU   *
         LH    2,0(8)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(L298)
         BNER  14
         SLR   9,9
L455     EQU   *
         L     12,0(,10)
         CL    9,148(13)
         L     14,=A(L298)
         BNLR  14
         LR    3,9
         SLL   3,2
         L     2,156(13)
         L     4,0(3,2)
         L     2,=V(USE2WEB)
         L     3,0(2)
         L     2,16(4)
         SLL   2,2
         L     5,0(2,3)
         L     2,64(5)
         LR    15,5
         LTR   2,2
         BE    L304
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L304     EQU   *
         L     2,40(15)
         N     2,=F'126976'
         L     4,=F'8192'
         CLR   2,4
         BNE   L305
         L     2,=V(NEVER@US)
         L     2,0(2)
         L     3,32(15)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L302
L305     EQU   *
         L     4,112(13)
         L     3,0(15)
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     15,12(4,2)
         SRL   15,0(3)
         X     15,=F'1'
         N     15,=F'1'
         L     3,0(5)
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(4,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L302
         LTR   15,15
         BNE   L445
L302     EQU   *
         A     9,=F'1'
         B     L455
L298     EQU   *
         L     5,=V(RTX@CLAS)
         LH    2,0(8)
         N     2,=XL4'0000FFFF'
         IC    2,0(5,2)
         CLM   2,1,=XL1'89'
         L     14,=A(L310)
         BNER  14
         L     3,124(13)
         LTR   3,3
         L     14,=A(L310)
         BER   14
         LR    4,13
         A     4,=F'104'
         ST    4,88(13)
         MVC   92(4,13),156(13)
         MVC   96(4,13),148(13)
         L     2,=V(USE2WEB)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
         L     2,124(13)
         LTR   2,2
         BE    L311
         LR    15,13
         A     15,=F'104'
         ST    15,88(13)
         MVC   92(4,13),152(13)
         MVC   96(4,13),144(13)
         L     2,=V(DEF2WEB)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=A(@@F19)
         BALR  14,15
L311     EQU   *
         L     2,124(13)
         CLR   2,3
         BE    L310
         L     2,136(13)
         LTR   2,2
         BNE   L310
         MVC   136(4,13),=F'1'
L310     EQU   *
         L     2,120(13)
         LTR   2,2
         L     14,=A(L313)
         BER   14
         L     2,136(13)
         LTR   2,2
         BNE   L314
         L     2,132(13)
         LTR   2,2
         L     14,=A(L313)
         BER   14
L314     EQU   *
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         MVC   92(4,13),172(13)
         MVC   96(4,13),180(13)
         LA    1,88(,13)
         L     15,=A(@@F18)
         BALR  14,15
L313     EQU   *
         LH    2,0(8)
         N     2,=XL4'0000FFFF'
         IC    2,0(5,2)
         CLM   2,1,=XL1'89'
         L     14,=A(L315)
         BNER  14
         L     2,=V(ZZZ@782)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L315)
         BER   14
         SLR   9,9
L456     EQU   *
         L     12,0(,10)
         B     PGE6
         DS    0F
         LTORG
         DS    0F
PGE6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         CL    9,148(13)
         BNL   L315
         LR    3,9
         SLL   3,2
         L     2,156(13)
         L     4,0(3,2)
         L     2,=V(USE2WEB)
         L     3,0(2)
         L     2,16(4)
         SLL   2,2
         L     3,0(2,3)
         L     2,64(3)
         LR    15,3
         LTR   2,2
         BE    L320
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L320     EQU   *
         L     12,4(,10)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     4,=F'36864'
         CLR   2,4
         BE    L318
         LR    15,13
         A     15,=F'128'
         ST    15,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
L318     EQU   *
         L     12,4(,10)
         A     9,=F'1'
         L     14,=A(L456)
         BR    14
L315     EQU   *
         L     12,4(,10)
         MVC   132(4,13),=F'0'
         LH    2,0(8)
         N     2,=XL4'0000FFFF'
         IC    2,0(5,2)
         CLM   2,1,=XL1'89'
         BNE   L323
         SLR   9,9
L457     EQU   *
         L     12,4(,10)
         CL    9,148(13)
         BNL   L323
         LR    3,9
         SLL   3,2
         L     2,156(13)
         L     4,0(3,2)
         L     2,=V(USE2WEB)
         L     3,0(2)
         L     2,16(4)
         SLL   2,2
         L     5,0(2,3)
         L     2,64(5)
         LR    6,5
         LTR   2,2
         BE    L328
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
         LR    6,15
L328     EQU   *
         L     12,4(,10)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     4,0(5)
         LR    3,4
         SRL   3,5
         SLL   3,2
         A     3,112(13)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'36864'
         CLR   2,3
         BNE   L326
         L     2,12(6)
         LTR   2,2
         BE    L330
         MVC   132(4,13),=F'1'
L330     EQU   *
         L     12,4(,10)
         ST    8,112(5)
         L     3,40(5)
         LR    2,3
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L331
         LR    4,13
         A     4,=F'128'
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         LTR   15,15
         BNH   L333
         L     2,=V(ZZZ@782)
         L     2,0(2)
         LTR   2,2
         BNE   L332
L333     EQU   *
         L     12,4(,10)
         L     3,120(13)
         SLL   3,2
         L     2,116(13)
         ST    5,0(3,2)
         L     15,120(13)
         A     15,=F'1'
         ST    15,120(13)
         OC    40(4,5),=F'3145728'
         B     L326
L332     EQU   *
         L     12,4(,10)
         MVC   88(4,13),104(13)
         MVC   92(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   L335
         MVC   88(4,13),104(13)
         MVC   92(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     2,124(13)
         A     2,=F'1'
         ST    2,124(13)
         OC    40(4,5),=F'1048576'
         B     L326
L335     EQU   *
         L     12,4(,10)
         NC    40(4,5),=F'-1048577'
         B     L326
L331     EQU   *
         L     12,4(,10)
         N     3,=F'-1048577'
         ST    3,40(5)
L326     EQU   *
         L     12,4(,10)
         A     9,=F'1'
         B     L457
L323     EQU   *
         L     12,4(,10)
         LH    2,0(8)
         CLM   2,3,=H'49'
         BE    L213
         L     8,8(8)
         L     14,=A(L449)
         BR    14
L213     EQU   *
         L     12,4(,10)
         MVC   172(4,13),120(13)
         L     2,124(13)
         LTR   2,2
         BE    L341
         MVC   200(4,13),=F'0'
         MVC   204(4,13),200(13)
         MVC   164(4,13),200(13)
         L     3,168(13)
         L     9,16(3)
         LTR   9,9
         BE    L369
L368     EQU   *
         L     12,4(,10)
         MVC   160(4,13),=F'0'
         L     4,8(9)
         L     2,=V(LIVE@AT@)
         L     3,0(2)
         L     2,44(4)
         SLL   2,2
         L     2,0(2,3)
         L     4,0(2)
         SLR   6,6
         ST    6,208(13)
L458     EQU   *
         L     12,4(,10)
         LTR   4,4
         BE    L435
         LR    7,4
         A     7,=F'12'
L366     EQU   *
         L     12,4(,10)
         L     5,0(7)
         LTR   5,5
         BE    L356
L365     EQU   *
         L     12,4(,10)
         LA    3,1(0,0)
         L     15,208(13)
         SLL   3,0(15)
         LR    2,5
         NR    2,3
         LTR   2,2
         BE    L359
         X     3,=F'-1'
         NR    5,3
         L     2,8(4)
         SLL   2,2
         AR    2,6
         SLL   2,5
         AR    2,15
         L     3,=V(USE2WEB)
         L     3,0(3)
         SLL   2,2
         L     3,0(2,3)
         L     2,64(3)
         LR    15,3
         LTR   2,2
         BE    L362
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L362     EQU   *
         L     12,4(,10)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     15,=F'36864'
         CLR   2,15
         BE    L363
         LR    2,13
         A     2,=F'160'
         ST    2,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F16)
         BALR  14,15
L363     EQU   *
         L     12,4(,10)
         LTR   5,5
         BE    L356
L359     EQU   *
         L     12,4(,10)
         L     3,208(13)
         A     3,=F'1'
         ST    3,208(13)
         LA    15,31(0,0)
         CLR   3,15
         BNH   L365
L356     EQU   *
         L     12,4(,10)
         MVC   208(4,13),=F'0'
         A     6,=F'1'
         A     7,=F'4'
         LA    2,3(0,0)
         CLR   6,2
         BNH   L366
         SLR   6,6
         L     4,0(4)
         B     L458
L435     EQU   *
         L     12,4(,10)
         OC    164(4,13),160(13)
         L     9,0(9)
         L     3,204(13)
         A     3,=F'1'
         ST    3,204(13)
         LTR   9,9
         BE    L343
         LA    4,4(0,0)
         CR    3,4
         BNH   L368
L343     EQU   *
         L     12,4(,10)
         L     2,204(13)
         LA    15,5(0,0)
         CLR   2,15
         BNE   L369
         MVC   200(4,13),=F'1'
L369     EQU   *
         L     12,4(,10)
         MVC   88(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         L     2,104(13)
         L     7,0(2)
         MVC   216(4,13),=F'0'
         MVC   212(4,13),216(13)
L459     EQU   *
         L     12,4(,10)
         LTR   7,7
         BE    L441
         LR    3,7
         A     3,=F'12'
         ST    3,220(13)
L393     EQU   *
         L     12,4(,10)
         L     4,220(13)
         L     9,0(4)
         LTR   9,9
         BE    L381
L392     EQU   *
         L     12,4(,10)
         LA    3,1(0,0)
         L     15,212(13)
         SLL   3,0(15)
         LR    2,9
         NR    2,3
         LTR   2,2
         BE    L384
         X     3,=F'-1'
         NR    9,3
         L     4,8(7)
         SLL   4,2
         A     4,216(13)
         SLL   4,5
         AR    4,15
         L     2,=V(ID2WEB)
         L     3,0(2)
         LR    2,4
         SLL   2,2
         L     5,0(2,3)
         L     2,64(5)
         LR    3,5
         LTR   2,2
         BE    L387
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
         LR    3,15
L387     EQU   *
         L     12,4(,10)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,=V(RA@PASS)
         L     6,0(2)
         LTR   6,6
         BH    L389
         L     2,40(3)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BNE   L389
         LA    2,1(0,0)
         CLR   6,2
         BNE   L388
         L     3,200(13)
         LTR   3,3
         BNE   L389
         LR    2,13
         A     2,=F'164'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         LTR   15,15
         BH    L388
L389     EQU   *
         L     12,4(,10)
         L     2,40(5)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L390
         L     3,120(13)
         SLL   3,2
         L     2,116(13)
         ST    5,0(3,2)
         L     3,120(13)
         A     3,=F'1'
         ST    3,120(13)
         OC    40(4,5),=F'2097152'
L390     EQU   *
         L     12,4(,10)
         MVC   88(4,13),108(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     4,124(13)
         BCTR  4,0
         ST    4,124(13)
L388     EQU   *
         L     12,4(,10)
         LTR   9,9
         BE    L381
L384     EQU   *
         L     12,4(,10)
         L     15,212(13)
         A     15,=F'1'
         ST    15,212(13)
         LA    2,31(0,0)
         CLR   15,2
         BNH   L392
L381     EQU   *
         L     12,4(,10)
         MVC   212(4,13),=F'0'
         L     3,216(13)
         A     3,=F'1'
         ST    3,216(13)
         L     4,220(13)
         A     4,=F'4'
         ST    4,220(13)
         LA    15,3(0,0)
         CLR   3,15
         BNH   L393
         MVC   216(4,13),212(13)
         L     7,0(7)
         B     L459
L441     EQU   *
         L     12,4(,10)
         MVC   88(4,13),104(13)
         MVC   92(4,13),104(13)
         MVC   96(4,13),108(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
L341     EQU   *
         L     12,4(,10)
         MVC   136(4,13),=F'1'
         LR    2,13
         A     2,=F'104'
         ST    2,88(13)
         MVC   92(4,13),172(13)
         MVC   96(4,13),180(13)
         LA    1,88(,13)
         L     15,=A(@@F18)
         BALR  14,15
         L     2,120(13)
         LTR   2,2
         BE    L395
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1398'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L395     EQU   *
         L     12,4(,10)
         LTR   8,8
         BE    L166
         L     8,8(8)
         L     14,=A(L447)
         BR    14
L166     EQU   *
         L     12,4(,10)
         MVC   88(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,108(13)
         LTR   2,2
         BE    L398
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   88(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   108(4,13),=F'0'
L398     EQU   *
         L     12,4(,10)
         L     2,104(13)
         LTR   2,2
         BE    L164
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   88(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   104(4,13),=F'0'
L164     EQU   *
         L     12,4(,10)
* Function rewrite_program2 epilogue
         PDPEPIL
* Function rewrite_program2 literal pool
         DS    0F
         LTORG
* Function rewrite_program2 page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
         DC    A(PG7)
         DS    0F
* Function mark_refs_for_checking,F21 prologue
@@F21    PDPPRLG CINDEX=8,FRAME=96,BASER=12,ENTRY=NO
         B     FEN8
         LTORG
FEN8     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         LR    11,1
         L     10,=A(PGT8)
* Function mark_refs_for_checking code
         L     8,0(11)
         L     9,4(11)
         SLR   7,7
L473     EQU   *
         CL    7,52(8)
         BNL   L470
         L     3,124(8)
         LR    2,7
         SLL   2,2
         L     2,0(2,3)
         L     4,16(2)
         LR    3,4
         SRL   3,5
         SLL   3,2
         L     2,=V(LAST@CHE)
         A     3,0(2)
         LR    5,4
         N     5,=F'31'
         LA    2,1(0,0)
         SLL   2,0(5)
         O     2,12(3)
         ST    2,12(3)
         ST    9,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     2,=V(DF)
         L     6,0(2)
         LR    5,4
         A     5,36(6)
         L     2,=V(WEB@PART)
         L     3,0(2)
         LR    2,5
         SLL   2,2
         AR    2,5
         SLL   2,2
         SLR   5,5
         ST    5,8(2,3)
         A     4,36(6)
         LR    2,4
         SLL   2,2
         AR    2,4
         SLL   2,2
         L     4,16(2,3)
         N     4,=F'2147483647'
         ST    4,16(2,3)
         A     7,=F'1'
         B     L473
L470     EQU   *
         SLR   7,7
         CL    7,56(8)
         BNL   L472
L468     EQU   *
         L     3,120(8)
         LR    2,7
         SLL   2,2
         L     4,0(2,3)
         L     2,=V(WEB@PART)
         L     3,0(2)
         L     2,16(4)
         SLL   2,2
         A     2,16(4)
         SLL   2,2
         SLR   5,5
         ST    5,8(2,3)
         L     4,16(2,3)
         N     4,=F'2147483647'
         ST    4,16(2,3)
         A     7,=F'1'
         CL    7,56(8)
         BL    L468
L472     EQU   *
* Function mark_refs_for_checking epilogue
         PDPEPIL
* Function mark_refs_for_checking literal pool
         DS    0F
         LTORG
* Function mark_refs_for_checking page table
         DS    0F
PGT8     EQU   *
         DC    A(PG8)
LC2      EQU   *
         DC    C'choosing color %d for spilled web %d'
         DC    X'15'
         DC    X'0'
LC3      EQU   *
         DC    C'no insns emitted for spilled web %d'
         DC    X'15'
         DC    X'0'
LC4      EQU   *
         DC    C'need to check these uses:'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func actual_spill prologue
ACTUAL@S PDPPRLG CINDEX=9,FRAME=240,BASER=12,ENTRY=YES
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function actual_spill code
         SLR   2,2
         SLR   3,3
         ST    2,144(13)
         ST    3,4+144(13)
         ST    2,152(13)
         ST    3,4+152(13)
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         ST    15,124(13)
         L     4,=V(WEB@LIST)
         L     3,36(4)
L856     EQU   *
         LTR   3,3
         BE    L785
         L     2,8(3)
         NC    40(4,2),=F'-524289'
         L     3,4(3)
         B     L856
L785     EQU   *
         L     5,=V(NUM@WEBS)
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         ST    15,128(13)
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         ST    15,132(13)
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         ST    15,136(13)
         MVC   88(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         L     6,=V(WEB@LIST)
         L     5,36(6)
L857     EQU   *
         LTR   5,5
         BE    L787
         L     2,8(5)
         L     3,0(2)
         LR    4,3
         SRL   4,5
         SLL   4,2
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         L     8,128(13)
         O     2,12(8,4)
         ST    2,12(8,4)
         L     5,4(5)
         B     L857
L787     EQU   *
         MVC   88(4,13),136(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1864)
         BALR  14,15
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         L     2,=V(WL@MOVES)
         MVC   140(4,13),0(2)
L858     EQU   *
         L     9,140(13)
         LTR   9,9
         BE    L789
         L     15,140(13)
         L     6,4(15)
         LTR   6,6
         BE    L489
         MVC   88(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         LR    7,15
         MVC   88(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         LR    5,15
         L     15,0(7)
         LR    4,15
         SRL   4,5
         SLL   4,2
         LR    8,15
         N     8,=F'31'
         L     3,128(13)
         L     2,12(3,4)
         SRL   2,0(8)
         N     2,=F'1'
         LTR   2,2
         BE    L493
         L     3,0(5)
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     9,136(13)
         L     2,12(9,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L492
L493     EQU   *
         L     3,0(5)
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     9,128(13)
         L     2,12(9,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    L489
         L     3,136(13)
         L     2,12(3,4)
         SRL   2,0(8)
         N     2,=F'1'
         LTR   2,2
         BE    L489
L492     EQU   *
         L     2,=V(SUP@IGRA)
         L     9,0(2)
         L     4,=V(NUM@WEBS)
         L     8,0(4)
         ST    8,148(13)
         L     2,144(13)
         L     3,4+144(13)
         MR    2,15
         ST    2,144(13)
         ST    3,4+144(13)
         L     4,0(5)
         L     3,148(13)
         AR    3,4
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(9,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L489
         ST    8,156(13)
         L     2,152(13)
         L     3,4+152(13)
         MR    2,4
         ST    2,152(13)
         ST    3,4+152(13)
         L     3,156(13)
         AR    3,15
         LR    2,3
         SRL   2,5
         SLL   2,2
         N     3,=F'31'
         L     2,12(9,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   L489
         L     2,116(7)
         LTR   2,2
         BNE   L489
         L     2,116(5)
         LTR   2,2
         BNE   L489
         L     2,=A(@@V6)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         L     3,=A(@@V7)
         L     4,0(6)
         L     2,16(4)
         L     2,76(2)
         A     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         MVC   0(2,4),=H'50'
         L     2,0(6)
         MVC   24(4,2),=F'-99'
         L     2,=V(DF)
         MVC   88(4,13),0(2)
         L     2,0(6)
         MVC   92(4,13),16(2)
         MVC   96(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@470)
         BALR  14,15
         L     2,8(6)
         OC    40(4,2),=F'262144'
         CLR   7,5
         BE    L489
         L     2,40(5)
         N     2,=F'126976'
         L     4,=F'36864'
         CLR   2,4
         BNE   L498
         L     2,40(7)
         N     2,=F'126976'
         CLR   2,4
         BE    L497
L498     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'123'
         L     14,=A(L875)
         BR    14
L497     EQU   *
         MVC   88(4,13),136(5)
         L     6,=V(WEB@LIST)
         LA    6,36(0,6)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(REMOVE@L)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=F'10'
         LA    1,88(,13)
         L     15,=V(PUT@WEB)
         BALR  14,15
         ST    7,128(5)
         OC    40(4,7),=F'536870912'
         OC    40(4,5),=F'536870912'
         ST    7,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(MERGE@MO)
         BALR  14,15
         L     4,72(5)
L859     EQU   *
         LTR   4,4
         BE    L489
         L     6,4(4)
         L     2,8(4)
         LR    3,2
         LTR   2,2
         BNE   L509
         ST    7,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1762)
         BALR  14,15
         B     L503
L509     EQU   *
         L     2,4(3)
         L     2,60(2)
         LH    2,0(2)
         CLM   2,3,=H'76'
         BNE   L854
         ST    7,88(13)
         L     2,4(3)
         MVC   92(4,13),60(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@702)
         BALR  14,15
         LTR   15,15
         BNE   L508
L854     EQU   *
         LR    15,7
L508     EQU   *
         ST    15,88(13)
         MVC   92(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1762)
         BALR  14,15
         L     3,0(3)
         LTR   3,3
         BNE   L509
L503     EQU   *
         L     2,48(6)
         S     2,44(5)
         BCTR  2,0
         ST    2,48(6)
         L     4,0(4)
         B     L859
L489     EQU   *
         L     8,140(13)
         MVC   140(4,13),0(8)
         B     L858
L789     EQU   *
         MVC   88(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),=F'80'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    7,15
         L     15,=V(WEB@LIST)
         L     9,36(15)
L860     EQU   *
         LTR   9,9
         BE    L793
         L     6,8(9)
         ST    7,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'80'
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     4,72(6)
L861     EQU   *
         LTR   4,4
         BE    L795
         L     3,4(4)
         L     2,40(3)
         N     2,=F'126976'
         L     5,=F'45056'
         CLR   2,5
         BE    L521
         L     8,=F'8192'
         CLR   2,8
         BNE   L519
L521     EQU   *
         L     2,32(3)
         SLL   2,2
         L     15,0(2,7)
         A     15,20(3)
         ST    15,0(2,7)
L519     EQU   *
         L     4,0(4)
         B     L861
L795     EQU   *
         MVC   232(4,13),84(6)
         L     2,40(6)
         SRL   2,27
         N     2,=F'1'
         LTR   2,2
         BE    L523
         SLR   4,4
L528     EQU   *
         L     2,=V(ZZZ@109)
         L     2,0(2)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L526
         LR    2,4
         SLL   2,2
         L     3,0(2,7)
         A     3,=F'1000'
         ST    3,0(2,7)
L526     EQU   *
         A     4,=F'1'
         LA    5,19(0,0)
         CR    4,5
         BNH   L528
L523     EQU   *
         MVC   160(4,13),=F'-1'
         SLR   4,4
         LR    8,7
L545     EQU   *
         L     15,160(13)
         LTR   15,15
         BL    L533
         LR    2,15
         SLL   2,2
         L     2,0(2,7)
         CL    2,0(8)
         BNH   L531
L533     EQU   *
         L     2,232(13)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    L531
         LA    2,15(0,0)
         CR    4,2
         BH    L534
         LR    2,4
         X     2,=F'1'
         N     2,=F'1'
         LTR   2,2
         BNE   L535
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,44(2)
         L     2,4(6)
         SLL   2,2
         L     2,0(2,3)
         IC    2,2(2)
         CLM   2,1,=XL1'07'
         BE    L531
         CLM   2,1,=XL1'0A'
         BNE   L535
         B     L531
L534     EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,44(2)
         L     2,4(6)
         SLL   2,2
         L     2,0(2,3)
         IC    3,2(2)
         LA    2,247(,3)
         CLM   2,1,=XL1'01'
         BNH   L535
         CLM   3,1,=XL1'10'
         BE    L535
         SLL   3,24
         SRA   3,24
         C     3,=F'17'
         BNE   L531
L535     EQU   *
         L     3,4(6)
         L     5,=V(MODE@SIZ)
         LA    15,15(0,0)
         CR    4,15
         BNH   L536
         L     15,=V(CFUN)
         L     2,0(15)
         L     2,12(2)
         L     2,44(2)
         SLL   3,2
         L     2,0(3,2)
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         SLR   3,3
         IC    3,0(5,2)
         A     3,=F'7'
         SRA   3,3
         B     L537
L536     EQU   *
         L     15,=V(CFUN)
         L     2,0(15)
         L     2,12(2)
         L     2,44(2)
         SLL   3,2
         L     2,0(3,2)
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         SLR   3,3
         IC    3,0(5,2)
         A     3,=F'3'
         SRA   3,2
L537     EQU   *
         LA    5,1(0,0)
         CR    5,3
         BNL   L541
         AR    4,5
         L     2,232(13)
         SRL   2,0(4)
         BCTR  4,0
         NR    2,5
L862     EQU   *
         LTR   2,2
         BE    L541
         A     5,=F'1'
         CR    5,3
         BNL   L541
         LR    2,4
         AR    2,5
         L     15,232(13)
         SRL   15,0(2)
         LR    2,15
         N     2,=F'1'
         B     L862
L541     EQU   *
         CR    5,3
         BNE   L531
         ST    4,160(13)
L531     EQU   *
         A     4,=F'1'
         A     8,=F'4'
         LA    2,19(0,0)
         CR    4,2
         BNH   L545
         MVC   32(4,6),160(13)
         MVC   88(4,13),=F'8'
         MVC   92(4,13),=A(LC2)
         MVC   96(4,13),160(13)
         MVC   100(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         L     9,4(9)
         B     L860
L793     EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         L     3,=A(@@V5)
         ST    15,0(3)
         L     2,=V(ZZZ@781)
         L     2,0(2)
         LTR   2,2
         BE    L548
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@F20)
         BALR  14,15
         L     14,=A(L549)
         BR    14
L548     EQU   *
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         LR    8,15
         ST    2,164(13)
L588     EQU   *
         L     12,0(,10)
         L     2,=V(WEB@LIST)
         L     4,164(13)
         LTR   4,4
         BNE   L553
         MVC   168(4,13),36(2)
         B     L554
L553     EQU   *
         MVC   168(4,13),40(2)
L554     EQU   *
         L     5,168(13)
         LTR   5,5
         L     14,=A(L803)
         BER   14
L587     EQU   *
         L     12,0(,10)
         L     6,168(13)
         L     7,8(6)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         ST    15,172(13)
         L     2,40(15)
         N     2,=F'126976'
         L     9,=F'36864'
         CLR   2,9
         L     14,=A(L557)
         BNER  14
         L     2,=V(ZZZ@785)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L559)
         BER   14
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   88(4,13),172(13)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         L     15,172(13)
         MVC   180(4,13),108(15)
         MVC   176(4,13),=F'0'
         SLR   2,2
         CL    2,52(7)
         BNL   L559
L571     EQU   *
         L     2,124(7)
         L     5,176(13)
         SLL   5,2
         L     2,0(5,2)
         L     4,4(2)
         L     9,8(4)
         L     6,16(4)
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'89'
         BNE   L562
         ST    8,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   L562
         ST    8,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     2,124(7)
         L     2,0(5,2)
         L     3,0(2)
         L     5,180(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         LH    2,0(3)
         CLM   2,3,=H'76'
         BNE   L565
         SLR   5,5
         IC    5,2(3)
         ST    5,88(13)
         MVC   92(4,13),180(13)
         L     15,180(13)
         SLR   2,2
         IC    2,2(15)
         ST    2,96(13)
         MVC   100(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1910)
         BALR  14,15
         LR    5,15
L565     EQU   *
         ST    3,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RA@EMIT@)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@550)
         BALR  14,15
         L     2,0(6)
         CLR   2,4
         BNE   L566
         MVC   0(4,6),12(9)
L566     EQU   *
         L     4,8(4)
         CLR   4,9
         BE    L806
         ST    6,16(4)
         L     2,=V(DF)
         MVC   88(4,13),0(2)
         ST    6,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@470)
         BALR  14,15
         B     L566
L806     EQU   *
         L     2,=A(@@V3)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         L     3,=A(@@V4)
         L     2,0(3)
         A     2,76(6)
         A     2,=F'1'
         ST    2,0(3)
L562     EQU   *
         L     4,176(13)
         A     4,=F'1'
         ST    4,176(13)
         CL    4,52(7)
         BL    L571
L559     EQU   *
         L     5,172(13)
         MVC   180(4,13),108(5)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         L     6,180(13)
         LTR   6,6
         L     14,=A(L557)
         BER   14
         MVC   176(4,13),=F'0'
         SLR   9,9
         CL    9,56(7)
         L     14,=A(L557)
         BNLR  14
L586     EQU   *
         L     12,0(,10)
         L     2,120(7)
         L     9,176(13)
         SLL   9,2
         L     2,0(9,2)
         L     4,4(2)
         L     6,12(4)
         L     5,16(4)
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'89'
         L     14,=A(L575)
         BNER  14
         ST    8,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         L     14,=A(L575)
         BNER  14
         ST    8,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         L     2,120(7)
         L     2,0(9,2)
         L     3,0(2)
         L     15,180(13)
         LH    2,0(3)
         CLM   2,3,=H'76'
         BNE   L578
         SLR   2,2
         IC    2,2(3)
         ST    2,88(13)
         ST    15,92(13)
         SLR   9,9
         IC    9,2(15)
         ST    9,96(13)
         MVC   100(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1910)
         BALR  14,15
L578     EQU   *
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(RA@EMIT@)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LTR   3,3
         BE    L579
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@546)
         BALR  14,15
         L     2,4(5)
         CLR   2,4
         BNE   L580
         MVC   4(4,5),8(6)
L580     EQU   *
         LR    4,3
L863     EQU   *
         CLR   4,6
         BE    L585
         ST    5,16(4)
         L     2,=V(DF)
         MVC   88(4,13),0(2)
         ST    5,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@470)
         BALR  14,15
         L     4,12(4)
         B     L863
L579     EQU   *
         L     2,=V(DF)
         MVC   88(4,13),0(2)
         ST    5,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@470)
         BALR  14,15
L585     EQU   *
         L     2,=A(@@V8)
         L     15,0(2)
         A     15,=F'1'
         ST    15,0(2)
         L     3,=A(@@V9)
         L     2,0(3)
         A     2,76(5)
         A     2,=F'1'
         ST    2,0(3)
         MVC   88(4,13),124(13)
         L     2,8(6)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
L575     EQU   *
         L     2,176(13)
         A     2,=F'1'
         ST    2,176(13)
         CL    2,56(7)
         BL    L586
L557     EQU   *
         L     3,168(13)
         MVC   168(4,13),4(3)
         L     4,168(13)
         LTR   4,4
         BNE   L587
L803     EQU   *
         L     5,164(13)
         A     5,=F'1'
         ST    5,164(13)
         LA    6,1(0,0)
         CLR   5,6
         BNH   L588
         LTR   8,8
         BE    L549
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L549     EQU   *
         MVC   184(4,13),=F'0'
         MVC   120(4,13),184(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LR    6,15
L864     EQU   *
         L     12,0(,10)
         LTR   6,6
         L     14,=A(L811)
         BER   14
         L     9,4(6)
         LH    2,0(6)
         CLM   2,3,=H'48'
         L     14,=A(L596)
         BER   14
         CLM   2,3,=H'46'
         L     14,=A(L596)
         BER   14
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@115)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L595
L596     EQU   *
         MVC   184(4,13),=F'0'
         MVC   120(4,13),184(13)
L595     EQU   *
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         L     8,=V(RTX@CLAS)
         IC    2,0(8,2)
         SLL   2,24
         SRA   2,24
         C     2,=F'-119'
         L     14,=A(L594)
         BNER  14
         B     PGE9
         DS    0F
         LTORG
         DS    0F
PGE9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         L     2,=V(INSN@DF@)
         C     9,0(2)
         BNL   L598
         L     8,12(6)
         L     7,16(6)
         LR    2,9
         SLL   2,4
         L     3,=V(INSN@DF)
         A     2,0(3)
         MVC   104(16,13),0(2)
         MVC   188(4,13),=F'0'
         SLR   15,15
         CL    15,104(13)
         BNL   L598
L624     EQU   *
         L     12,4(,10)
         L     5,188(13)
         SLL   5,2
         L     2,112(13)
         L     4,0(5,2)
         L     2,=V(DEF2WEB)
         L     3,0(2)
         L     2,16(4)
         SLL   2,2
         L     2,0(2,3)
         L     3,64(2)
         LTR   3,3
         BE    L603
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
         LR    2,15
L603     EQU   *
         L     12,4(,10)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'36864'
         CLR   2,3
         BNE   L601
         L     15,108(15)
         LTR   15,15
         BE    L601
         LR    3,15
         L     2,112(13)
         L     2,0(5,2)
         L     4,0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         LH    2,0(4)
         CLM   2,3,=H'76'
         BNE   L606
         SLR   5,5
         IC    5,2(4)
         ST    5,88(13)
         ST    3,92(13)
         SLR   15,15
         IC    15,2(3)
         ST    15,96(13)
         MVC   100(4,13),8(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1910)
         BALR  14,15
         LR    3,15
L606     EQU   *
         L     12,4(,10)
         L     2,184(13)
         LTR   2,2
         BE    L608
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1849)
         BALR  14,15
         LTR   15,15
         BNE   L607
L608     EQU   *
         L     12,4(,10)
         L     2,120(13)
L865     EQU   *
         L     12,4(,10)
         LTR   2,2
         BE    L814
         MVC   88(4,13),4(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1849)
         BALR  14,15
         LTR   15,15
         BNE   L607
         L     2,0(2)
         B     L865
L814     EQU   *
         L     12,4(,10)
         ST    3,184(13)
         MVC   88(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(RA@ALLOC)
         BALR  14,15
         MVC   0(4,15),120(13)
         MVC   4(4,15),184(13)
         ST    15,120(13)
         MVC   88(4,13),184(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(RA@EMIT@)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LTR   3,3
         BE    L616
         ST    3,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@546)
         BALR  14,15
         L     2,4(7)
         CLR   2,6
         BNE   L617
         MVC   4(4,7),8(8)
L617     EQU   *
         L     12,4(,10)
         CLR   3,8
         BE    L622
         ST    7,16(3)
         L     2,=V(DF)
         MVC   88(4,13),0(2)
         ST    7,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@470)
         BALR  14,15
         L     3,12(3)
         B     L617
L616     EQU   *
         L     12,4(,10)
         L     2,=V(DF)
         MVC   88(4,13),0(2)
         ST    7,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@470)
         BALR  14,15
L622     EQU   *
         L     12,4(,10)
         L     2,=A(@@V8)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         L     3,=A(@@V9)
         L     2,0(3)
         A     2,76(7)
         A     2,=F'1'
         ST    2,0(3)
         MVC   88(4,13),124(13)
         L     2,8(8)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         B     L601
L607     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
L601     EQU   *
         L     12,4(,10)
         L     4,188(13)
         A     4,=F'1'
         ST    4,188(13)
         CL    4,104(13)
         BL    L624
L598     EQU   *
         L     12,4(,10)
         L     2,=V(LAST@MAX)
         C     9,0(2)
         BL    L594
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         L     5,=V(RTX@CLAS)
         IC    2,0(5,2)
         SLR   15,15
         CLM   2,1,=XL1'89'
         BNE   L627
         L     2,24(6)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'60'
         BE    L627
         ST    6,88(13)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
L627     EQU   *
         L     12,4(,10)
         MVC   184(4,13),=F'0'
         LTR   15,15
         BNE   L630
         ST    15,120(13)
         B     L594
L630     EQU   *
         L     12,4(,10)
         LA    8,120(,13)
         ST    8,192(13)
         MVC   196(4,13),8(15)
         L     2,120(13)
L866     EQU   *
         L     12,4(,10)
         LTR   2,2
         BE    L594
         L     9,192(13)
         L     2,0(9)
         L     4,4(2)
         L     5,196(13)
         SLR   9,9
         LR    7,9
         L     3,=V(MODE@SIZ)
         SLR   2,2
         IC    2,2(4)
         SLR   15,15
         IC    15,0(3,2)
         ST    15,200(13)
         SLR   2,2
         IC    2,2(5)
         SLR   8,8
         IC    8,0(3,2)
         LH    2,0(4)
         CLM   2,3,=H'76'
         BNE   L636
         L     7,8(4)
         L     4,4(4)
L636     EQU   *
         L     12,4(,10)
         LH    2,0(5)
         CLM   2,3,=H'76'
         BNE   L637
         L     9,8(5)
         L     5,4(5)
L637     EQU   *
         L     12,4(,10)
         LA    3,1(0,0)
         CLR   4,5
         BE    L639
         LH    2,0(4)
         SLR   3,3
         MVC   80(2,13),0(5)
         CLM   2,3,80(13)
         BNE   L639
         CLM   2,3,=H'74'
         BNE   L641
         L     2,4(4)
         C     2,4(5)
         BNE   L639
         AR    8,9
         CR    7,8
         BNL   L653
         A     7,200(13)
         LA    3,1(0,0)
         B     L876
L641     EQU   *
         L     12,4(,10)
         CLM   2,3,=H'79'
         BE    L645
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'574'
L875     EQU   *
         L     12,4(,10)
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L645     EQU   *
         L     12,4(,10)
         L     4,4(4)
         L     5,4(5)
         LH    2,0(4)
         CLM   2,3,=H'88'
         BNE   L650
         L     15,4(4)
         LH    2,0(15)
         CLM   2,3,=H'74'
         BNE   L650
         L     2,8(4)
         LH    2,0(2)
         CLM   2,3,=H'67'
         BNE   L650
         LH    2,0(5)
         CLM   2,3,=H'88'
         BNE   L650
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'74'
         BNE   L650
         L     2,8(5)
         LH    2,0(2)
         CLM   2,3,=H'67'
         BE    L649
L650     EQU   *
         L     12,4(,10)
         LA    3,1(0,0)
         B     L639
L649     EQU   *
         L     12,4(,10)
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1849)
         BALR  14,15
         LA    3,1(0,0)
         LTR   15,15
         BE    L639
         L     2,8(4)
         A     7,4(2)
         L     2,8(5)
         A     9,4(2)
         AR    8,9
         CR    7,8
         BNL   L653
         A     7,200(13)
L876     EQU   *
         L     12,4(,10)
         CR    9,7
         BL    L639
L653     EQU   *
         L     12,4(,10)
         SLR   3,3
L639     EQU   *
         L     12,4(,10)
         L     4,192(13)
         L     2,0(4)
         LTR   3,3
         BE    L635
         MVC   0(4,4),0(2)
         B     L633
L635     EQU   *
         L     12,4(,10)
         ST    2,192(13)
L633     EQU   *
         L     12,4(,10)
         L     5,192(13)
         L     2,0(5)
         B     L866
L594     EQU   *
         L     12,4(,10)
         L     6,8(6)
         L     14,=A(L864)
         BR    14
L811     EQU   *
         L     12,4(,10)
         L     6,=A(@@V5)
         L     2,0(6)
         L     6,0(2)
         SLR   9,9
         ST    9,204(13)
L867     EQU   *
         L     12,4(,10)
         LTR   6,6
         BE    L820
         LR    8,6
         A     8,=F'12'
         ST    8,228(13)
L684     EQU   *
         L     12,4(,10)
         L     15,228(13)
         L     8,0(15)
         LTR   8,8
         BE    L670
L683     EQU   *
         L     12,4(,10)
         LA    3,1(0,0)
         L     2,204(13)
         SLL   3,0(2)
         LR    2,8
         NR    2,3
         LTR   2,2
         BE    L673
         X     3,=F'-1'
         NR    8,3
         L     4,8(6)
         SLL   4,2
         AR    4,9
         SLL   4,5
         A     4,204(13)
         L     3,=V(DF)
         L     2,0(3)
         L     2,8(2)
         SLL   4,2
         L     2,0(4,2)
         L     5,4(2)
         LH    3,0(5)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         SLR   7,7
         CLM   2,1,=XL1'89'
         BNE   L676
         L     2,24(5)
         LH    3,0(2)
         LR    7,2
         CLM   3,3,=H'60'
         BE    L676
         ST    5,88(13)
         MVC   92(4,13),24(5)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    7,15
L676     EQU   *
         L     12,4(,10)
         L     2,=V(DEF2WEB)
         L     2,0(2)
         L     2,0(4,2)
         L     3,64(2)
         LR    15,2
         LTR   3,3
         BE    L680
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
L680     EQU   *
         L     12,4(,10)
         LTR   7,7
         BE    L681
         L     2,40(15)
         N     2,=F'126976'
         L     4,=F'36864'
         CLR   2,4
         BNE   L681
         L     2,108(15)
         LTR   2,2
         BNE   L681
         L     2,=A(@@V10)
         L     15,0(2)
         A     15,=F'1'
         ST    15,0(2)
         L     3,=A(@@V11)
         L     2,16(5)
         L     2,76(2)
         A     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         MVC   0(2,5),=H'50'
         MVC   24(4,5),=F'-99'
         L     2,=V(DF)
         MVC   88(4,13),0(2)
         MVC   92(4,13),16(5)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@470)
         BALR  14,15
L681     EQU   *
         L     12,4(,10)
         LTR   8,8
         BE    L670
L673     EQU   *
         L     12,4(,10)
         L     3,204(13)
         A     3,=F'1'
         ST    3,204(13)
         LA    4,31(0,0)
         CLR   3,4
         BNH   L683
L670     EQU   *
         L     12,4(,10)
         MVC   204(4,13),=F'0'
         A     9,=F'1'
         L     5,228(13)
         A     5,=F'4'
         ST    5,228(13)
         LA    8,3(0,0)
         CLR   9,8
         BNH   L684
         SLR   9,9
         L     6,0(6)
         B     L867
L820     EQU   *
         L     12,4(,10)
         L     9,=A(@@V5)
         L     2,0(9)
         LTR   2,2
         BE    L687
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   88(4,13),0(9)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   0(4,9),=F'0'
L687     EQU   *
         L     12,4(,10)
         L     15,=V(INSNS@WI)
         MVC   88(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GET@MAX@)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         L     2,=V(INSNS@WI)
         ST    15,0(2)
         LA    1,88(,13)
         L     15,=V(GET@MAX@)
         BALR  14,15
         L     2,=V(DEATH@IN)
         ST    15,0(2)
         L     3,=V(INSNS@WI)
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         L     4,124(13)
         L     5,0(4)
         SLR   7,7
         LR    9,7
L868     EQU   *
         L     12,4(,10)
         LTR   5,5
         BE    L826
         LR    8,5
         A     8,=F'12'
L707     EQU   *
         L     12,4(,10)
         L     6,0(8)
         LTR   6,6
         BE    L700
L706     EQU   *
         L     12,4(,10)
         LA    3,1(0,0)
         SLL   3,0(9)
         LR    2,6
         NR    2,3
         LTR   2,2
         BE    L703
         X     3,=F'-1'
         NR    6,3
         L     2,8(5)
         SLL   2,2
         AR    2,7
         SLL   2,5
         AR    2,9
         LR    4,2
         SRL   4,5
         SLL   4,2
         L     15,=V(INSNS@WI)
         A     4,0(15)
         N     2,=F'31'
         LA    3,1(0,0)
         SLL   3,0(2)
         O     3,12(4)
         ST    3,12(4)
         LTR   6,6
         BE    L700
L703     EQU   *
         L     12,4(,10)
         A     9,=F'1'
         LA    2,31(0,0)
         CLR   9,2
         BNH   L706
L700     EQU   *
         L     12,4(,10)
         SLR   9,9
         A     7,=F'1'
         A     8,=F'4'
         LA    3,3(0,0)
         CLR   7,3
         BNH   L707
         LR    7,9
         L     5,0(5)
         B     L868
L826     EQU   *
         L     12,4(,10)
         L     2,=V(WEB@LIST)
         L     2,36(2)
L869     EQU   *
         L     12,4(,10)
         LTR   2,2
         BE    L831
         L     3,8(2)
         L     5,4(2)
         L     4,40(3)
         LR    2,4
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BNE   L712
         MVC   88(4,13),=F'8'
         MVC   92(4,13),=A(LC3)
         MVC   96(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(REMOVE@W)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'11'
         LA    1,88(,13)
         L     15,=V(PUT@WEB)
         BALR  14,15
         OC    40(4,3),=F'524288'
         B     L711
L712     EQU   *
         L     12,4(,10)
         N     4,=F'-524289'
         ST    4,40(3)
L711     EQU   *
         L     12,4(,10)
         LR    2,5
         B     L869
L831     EQU   *
         L     12,4(,10)
         L     2,=V(NUM@WEBS)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         ST    15,220(13)
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         ST    15,208(13)
         L     4,=V(LAST@CHE)
         L     2,0(4)
         LTR   2,2
         BE    L716
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L716     EQU   *
         L     12,4(,10)
         L     5,=V(DF)
         L     2,0(5)
         MVC   88(4,13),48(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1852)
         BALR  14,15
         L     6,=V(LAST@CHE)
         ST    15,0(6)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         MVC   88(4,13),220(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1881)
         BALR  14,15
         MVC   212(4,13),=F'0'
L763     EQU   *
         L     12,4(,10)
         L     2,=V(WEB@LIST)
         L     8,212(13)
         LTR   8,8
         BNE   L720
         MVC   216(4,13),36(2)
         B     L721
L720     EQU   *
         L     12,4(,10)
         MVC   216(4,13),40(2)
L721     EQU   *
         L     12,4(,10)
         L     9,216(13)
         LTR   9,9
         L     14,=A(L835)
         BER   14
L762     EQU   *
         L     12,4(,10)
         L     15,216(13)
         L     8,8(15)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'36864'
         CLR   2,3
         L     14,=A(L724)
         BNER  14
         SLR   7,7
L870     EQU   *
         L     12,4(,10)
         CL    7,52(8)
         BNL   L837
         L     3,124(8)
         LR    2,7
         SLL   2,2
         L     2,0(2,3)
         L     4,16(2)
         LR    3,4
         SRL   3,5
         SLL   3,2
         L     5,=V(LAST@CHE)
         A     3,0(5)
         LR    5,4
         N     5,=F'31'
         LA    2,1(0,0)
         SLL   2,0(5)
         O     2,12(3)
         ST    2,12(3)
         MVC   88(4,13),208(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         L     9,=V(DF)
         L     6,0(9)
         LR    5,4
         A     5,36(6)
         L     2,=V(WEB@PART)
         L     3,0(2)
         LR    2,5
         SLL   2,2
         AR    2,5
         SLL   2,2
         SLR   15,15
         ST    15,4(2,3)
         ST    15,8(2,3)
         A     4,36(6)
         LR    2,4
         SLL   2,2
         AR    2,4
         SLL   2,2
         L     4,16(2,3)
         N     4,=F'2147483647'
         ST    4,16(2,3)
         A     7,=F'1'
         B     L870
L837     EQU   *
         L     12,4(,10)
         SLR   7,7
L871     EQU   *
         L     12,4(,10)
         CL    7,56(8)
         BNL   L839
         L     3,120(8)
         LR    2,7
         SLL   2,2
         L     4,0(2,3)
         L     2,=V(WEB@PART)
         L     3,0(2)
         L     2,16(4)
         SLL   2,2
         A     2,16(4)
         SLL   2,2
         SLR   5,5
         ST    5,4(2,3)
         ST    5,8(2,3)
         L     6,16(2,3)
         N     6,=F'2147483647'
         ST    6,16(2,3)
         A     7,=F'1'
         B     L871
L839     EQU   *
         L     12,4(,10)
         L     2,40(8)
         SRL   2,17
         N     2,=F'1'
         LTR   2,2
         BE    L734
         L     4,76(8)
         B     L735
L734     EQU   *
         L     12,4(,10)
         L     4,72(8)
L735     EQU   *
         L     12,4(,10)
         LTR   4,4
         BE    L841
         L     7,4(4)
         L     2,0(7)
         LR    3,2
         SRL   3,5
         SLL   3,2
         A     3,220(13)
         A     3,=F'12'
         LR    5,2
         N     5,=F'31'
         L     6,0(3)
         LR    2,6
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BNE   L738
         LA    2,1(0,0)
         SLL   2,0(5)
         OR    6,2
         ST    6,0(3)
         ST    7,88(13)
         MVC   92(4,13),208(13)
         LA    1,88(,13)
         L     15,=A(@@F21)
         BALR  14,15
L738     EQU   *
         L     12,4(,10)
         L     4,0(4)
         B     L735
L841     EQU   *
         L     12,4(,10)
         L     2,80(8)
         L     4,0(2)
         SLR   8,8
         ST    8,224(13)
L872     EQU   *
         L     12,4(,10)
         LTR   4,4
         L     14,=A(L724)
         BER   14
         LR    9,4
         A     9,=F'12'
L760     EQU   *
         L     12,4(,10)
         L     7,0(9)
         LTR   7,7
         L     14,=A(L752)
         BER   14
L759     EQU   *
         L     12,4(,10)
         LA    3,1(0,0)
         L     15,224(13)
         SLL   3,0(15)
         LR    2,7
         NR    2,3
         LTR   2,2
         L     14,=A(L755)
         BER   14
         X     3,=F'-1'
         NR    7,3
         L     2,8(4)
         SLL   2,2
         AR    2,8
         SLL   2,5
         AR    2,15
         L     3,=V(ID2WEB)
         L     3,0(3)
         SLL   2,2
         L     15,0(2,3)
         L     2,0(15)
         LR    3,2
         SRL   3,5
         SLL   3,2
         A     3,220(13)
         A     3,=F'12'
         LR    5,2
         N     5,=F'31'
         L     6,0(3)
         LR    2,6
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BNE   L755
         LA    2,1(0,0)
         SLL   2,0(5)
         OR    6,2
         ST    6,0(3)
         ST    15,88(13)
         MVC   92(4,13),208(13)
         LA    1,88(,13)
         L     15,=A(@@F21)
         BALR  14,15
         LTR   7,7
         BE    L752
L755     EQU   *
         L     12,4(,10)
         L     2,224(13)
         A     2,=F'1'
         ST    2,224(13)
         LA    3,31(0,0)
         CLR   2,3
         BNH   L759
L752     EQU   *
         L     12,4(,10)
         MVC   224(4,13),=F'0'
         A     8,=F'1'
         A     9,=F'4'
         LA    5,3(0,0)
         CLR   8,5
         BNH   L760
         SLR   8,8
         L     4,0(4)
         B     L872
L724     EQU   *
         L     12,4(,10)
         L     6,216(13)
         MVC   216(4,13),4(6)
         L     8,216(13)
         LTR   8,8
         BNE   L762
L835     EQU   *
         L     12,4(,10)
         L     9,212(13)
         A     9,=F'1'
         ST    9,212(13)
         LA    15,1(0,0)
         CLR   9,15
         BNH   L763
         SLR   7,7
         LR    4,7
L773     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@713)
         IC    2,0(2,7)
         CLM   2,1,=XL1'00'
         L     14,=A(L766)
         BNER  14
         L     2,=V(DF)
         L     2,0(2)
         L     2,20(2)
         L     3,4(4,2)
L873     EQU   *
         L     12,4(,10)
         LTR   3,3
         L     14,=A(L766)
         BER   14
         L     2,4(3)
         LTR   2,2
         L     14,=A(L770)
         BER   14
         MVC   88(4,13),208(13)
         B     PGE10
         DS    0F
         LTORG
         DS    0F
PGE10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         L     2,4(3)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
L770     EQU   *
         L     12,8(,10)
         L     3,0(3)
         L     14,=A(L873)
         BR    14
L766     EQU   *
         L     12,8(,10)
         A     7,=F'1'
         A     4,=F'20'
         LA    2,19(0,0)
         CLR   7,2
         L     14,=A(L773)
         BNHR  14
         L     4,=V(LIVE@AT@)
         L     3,0(4)
         A     3,=F'-8'
         ST    3,0(4)
         SLR   7,7
         L     5,=V(LAST@BAS)
L874     EQU   *
         L     12,8(,10)
         L     2,0(5)
         A     2,=F'2'
         CLR   7,2
         BNL   L851
         L     3,0(4)
         LR    2,7
         SLL   2,2
         L     6,0(2,3)
         ST    6,88(13)
         L     3,0(2,3)
         ST    3,92(13)
         MVC   96(4,13),208(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
         A     7,=F'1'
         B     L874
L851     EQU   *
         L     12,8(,10)
         L     2,=V(LIVE@AT@)
         L     8,0(2)
         A     8,=F'8'
         ST    8,0(2)
         L     3,=V(ZZZ@1844)
         L     2,0(3)
         LTR   2,2
         BE    L778
         L     2,=V(ZZZ@375)
         L     2,0(2)
         N     2,=F'32768'
         LTR   2,2
         BE    L778
         MVC   88(4,13),=F'32768'
         MVC   92(4,13),=A(LC4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         MVC   88(4,13),0(3)
         L     2,=V(LAST@CHE)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@492)
         BALR  14,15
L778     EQU   *
         L     12,8(,10)
         MVC   88(4,13),220(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     9,208(13)
         LTR   9,9
         BE    L852
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   88(4,13),208(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L852     EQU   *
         L     12,8(,10)
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function actual_spill epilogue
         PDPEPIL
* Function actual_spill literal pool
         DS    0F
         LTORG
* Function actual_spill page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
         DC    A(PG10)
         DC    A(PG11)
LC5      EQU   *
         DC    C'Renumber pseudo %d (== web %d) to %d'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func emit_colors prologue
EMIT@COL PDPPRLG CINDEX=12,FRAME=120,BASER=12,ENTRY=YES
         B     FEN12
         LTORG
FEN12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         LR    11,1
         L     10,=A(PGT12)
* Function emit_colors code
         L     9,0(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@1564)
         BALR  14,15
         ST    15,112(13)
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         L     2,=A(@@V12)
         ST    15,0(2)
         SLR   7,7
         L     8,=V(NUM@SUBW)
L954     EQU   *
         L     3,=V(NUM@WEBS)
         L     2,0(3)
         S     2,0(8)
         CLR   7,2
         BNL   L941
         L     2,=V(ID2WEB)
         L     3,0(2)
         LR    2,7
         SLL   2,2
         L     5,0(2,3)
         L     2,40(5)
         N     2,=F'126976'
         L     4,=F'45056'
         CLR   2,4
         BE    L881
         L     3,=F'40960'
         CLR   2,3
         BNE   L880
L881     EQU   *
         L     4,=F'40960'
         CLR   2,4
         BNE   L882
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,40(15)
         N     2,=F'126976'
         L     3,=F'45056'
         CLR   2,3
         BE    L880
L882     EQU   *
         L     15,104(5)
         LTR   15,15
         BNE   L884
         L     4,4(5)
         LA    2,19(0,0)
         CLR   4,2
         BH    L883
L884     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1679'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L883     EQU   *
         L     2,=V(MAX@NORM)
         CL    4,0(2)
         BL    L885
         L     3,32(5)
         L     6,=V(CFUN)
         SLL   4,2
         L     2,=V(AN@UNUSA)
         CL    3,0(2)
         BNE   L886
         L     2,0(6)
         L     2,12(2)
         L     2,44(2)
         L     2,0(4,2)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         ST    3,88(13)
         ST    4,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@46)
         BALR  14,15
         LR    4,15
         L     2,0(6)
         L     2,12(2)
         L     3,44(2)
         L     2,4(5)
         SLL   2,2
         L     2,0(2,3)
         L     3,0(2)
         N     3,=F'32'
         L     2,0(15)
         N     2,=F'-33'
         OR    2,3
         ST    2,0(15)
         LA    1,88(,13)
         L     15,=V(NEW@ALIA)
         BALR  14,15
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1889)
         BALR  14,15
         B     L889
L886     EQU   *
         L     2,0(6)
         L     2,12(2)
         L     2,44(2)
         L     2,0(4,2)
         SLR   3,3
         IC    3,2(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    4,15
L889     EQU   *
         ST    4,104(5)
         B     L880
L885     EQU   *
         L     2,52(5)
         LTR   2,2
         BNE   L891
         L     2,56(5)
         LA    3,1(0,0)
         CLR   2,3
         BNE   L891
         L     2,120(5)
         L     2,0(2)
         L     3,0(2)
         LH    2,0(3)
         LR    4,3
         CLM   2,3,=H'76'
         BNE   L893
         L     4,4(3)
L893     EQU   *
         SLR   2,2
         IC    2,2(4)
         ST    2,88(13)
         B     L955
L891     EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         SLL   4,2
         L     2,0(4,2)
         SLR   3,3
         IC    3,2(2)
         ST    3,88(13)
L955     EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         ST    15,104(5)
         L     2,40(5)
         N     2,=F'126976'
         L     4,=F'40960'
         CLR   2,4
         BNE   L880
         L     2,=A(@@V12)
         MVC   88(4,13),0(2)
         L     2,104(5)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
L880     EQU   *
         A     7,=F'1'
         B     L954
L941     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1564)
         BALR  14,15
         L     3,=V(MAX@REGN)
         ST    15,0(3)
         L     2,=V(RA@MAX@R)
         ST    15,0(2)
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@22)
         BALR  14,15
         L     4,0(3)
         SLL   4,1
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=V(RA@REG@R)
         ST    15,0(2)
         SLR   2,2
         L     3,0(3)
L956     EQU   *
         CR    2,3
         BNL   L943
         MVC   0(2,15),=H'-1'
         A     2,=F'1'
         A     15,=F'2'
         B     L956
L943     EQU   *
         SLR   7,7
L957     EQU   *
         CL    7,48(9)
         BNL   L945
         L     2,12(9)
         LR    3,7
         SLL   3,2
         L     2,0(3,2)
         LTR   2,2
         BE    L903
         L     2,4(2)
         L     2,16(2)
         L     8,32(2)
         L     2,=V(USE2WEB)
         L     2,0(2)
         L     5,0(3,2)
         L     2,64(5)
         LR    6,5
         LTR   2,2
         BE    L906
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
         LR    6,15
L906     EQU   *
         LR    5,6
         L     2,40(6)
         N     2,=F'126976'
         L     4,=F'45056'
         CLR   2,4
         BE    L907
         L     4,=F'40960'
         CLR   2,4
         BNE   L903
L907     EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     4,104(15)
         LTR   4,4
         BNE   L908
         L     4,104(5)
L908     EQU   *
         L     2,12(9)
         L     5,0(3,2)
         L     2,0(5)
         LH    3,0(2)
         A     2,=F'4'
         CLM   3,3,=H'76'
         BE    L910
         L     2,8(5)
L910     EQU   *
         ST    4,0(2)
         ST    8,88(13)
         MVC   92(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BE    L903
         LH    2,0(4)
         CLM   2,3,=H'74'
         BNE   L903
         ST    8,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
L903     EQU   *
         A     7,=F'1'
         B     L957
L945     EQU   *
         SLR   7,7
L958     EQU   *
         CL    7,36(9)
         BNL   L947
         L     2,8(9)
         LR    3,7
         SLL   3,2
         L     2,0(3,2)
         LTR   2,2
         BE    L915
         L     2,4(2)
         L     2,16(2)
         L     8,32(2)
         L     2,=V(DEF2WEB)
         L     2,0(2)
         L     5,0(3,2)
         L     2,64(5)
         LR    6,5
         LTR   2,2
         BE    L918
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@WEB)
         BALR  14,15
         LR    6,15
L918     EQU   *
         LR    5,6
         L     2,40(6)
         N     2,=F'126976'
         L     4,=F'45056'
         CLR   2,4
         BE    L919
         L     4,=F'40960'
         CLR   2,4
         BNE   L915
L919     EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     4,104(15)
         LTR   4,4
         BNE   L920
         L     4,104(5)
L920     EQU   *
         L     2,8(9)
         L     5,0(3,2)
         L     2,0(5)
         LH    3,0(2)
         A     2,=F'4'
         CLM   3,3,=H'76'
         BE    L922
         L     2,8(5)
L922     EQU   *
         ST    4,0(2)
         ST    8,88(13)
         MVC   92(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BE    L915
         LH    2,0(4)
         CLM   2,3,=H'74'
         BNE   L915
         ST    8,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
L915     EQU   *
         A     7,=F'1'
         B     L958
L947     EQU   *
         SLR   7,7
         L     8,=V(NUM@WEBS)
         L     6,=V(NUM@SUBW)
L959     EQU   *
         L     2,0(8)
         S     2,0(6)
         CLR   7,2
         BNL   L949
         L     2,=V(ID2WEB)
         L     3,0(2)
         LR    2,7
         SLL   2,2
         L     5,0(2,3)
         L     3,104(5)
         LTR   3,3
         BE    L927
         LH    2,0(3)
         CLM   2,3,=H'74'
         BNE   L927
         L     3,4(3)
         L     2,=V(RA@REG@R)
         L     4,0(2)
         LR    2,3
         AR    2,3
         LH    9,34(5)
         STH   9,0(2,4)
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=A(LC5)
         ST    3,96(13)
         MVC   100(4,13),0(5)
         LH    4,0(2,4)
         SLL   4,16
         SRA   4,16
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
L927     EQU   *
         A     7,=F'1'
         B     L959
L949     EQU   *
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@57)
         BALR  14,15
         LR    3,15
         LA    2,20(0,0)
L960     EQU   *
         C     2,112(13)
         BNL   L951
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         A     2,=F'1'
         B     L960
L951     EQU   *
         L     2,=V(ENTRY@EX)
         L     2,52(2)
         L     4,=V(ENTRY@EX)
         LA    4,88(0,4)
         CLR   2,4
         BE    L953
L937     EQU   *
         MVC   88(4,13),32(2)
         MVC   92(4,13),32(2)
         ST    3,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
         MVC   88(4,13),36(2)
         MVC   92(4,13),36(2)
         ST    3,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
         L     2,52(2)
         L     9,=V(ENTRY@EX)
         LA    9,88(0,9)
         CLR   2,9
         BNE   L937
L953     EQU   *
         LTR   3,3
         BE    L877
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L877     EQU   *
* Function emit_colors epilogue
         PDPEPIL
* Function emit_colors literal pool
         DS    0F
         LTORG
* Function emit_colors page table
         DS    0F
PGT12    EQU   *
         DC    A(PG12)
         DS    0F
* X-func delete_moves prologue
DELETE@M PDPPRLG CINDEX=13,FRAME=104,BASER=12,ENTRY=YES
         B     FEN13
         LTORG
FEN13    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         LR    11,1
         L     10,=A(PGT13)
* Function delete_moves code
         L     2,=V(WL@MOVES)
         L     5,0(2)
         LTR   5,5
         BE    L968
L966     EQU   *
         L     2,4(5)
         LTR   2,2
         BE    L964
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         LR    3,15
         L     2,4(5)
         MVC   88(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(ALIAS)
         BALR  14,15
         L     2,104(3)
         CL    2,104(15)
         BNE   L964
         L     2,40(3)
         N     2,=F'126976'
         L     3,=F'8192'
         CLR   2,3
         BE    L964
         L     2,40(15)
         N     2,=F'126976'
         CLR   2,3
         BE    L964
         L     2,4(5)
         L     2,0(2)
         L     4,16(2)
         L     2,=V(DF)
         MVC   88(4,13),0(2)
         ST    4,92(13)
         L     2,4(5)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@466)
         BALR  14,15
         L     2,=A(@@V6)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         L     3,=A(@@V7)
         L     2,0(3)
         A     2,76(4)
         A     2,=F'1'
         ST    2,0(3)
L964     EQU   *
         L     5,0(5)
         LTR   5,5
         BNE   L966
L968     EQU   *
* Function delete_moves epilogue
         PDPEPIL
* Function delete_moves literal pool
         DS    0F
         LTORG
* Function delete_moves page table
         DS    0F
PGT13    EQU   *
         DC    A(PG13)
         DS    0F
* X-func remove_suspicious_death_notes prologue
REMOVE@S PDPPRLG CINDEX=14,FRAME=96,BASER=12,ENTRY=YES
         B     FEN14
         LTORG
FEN14    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG14     EQU   *
         LR    11,1
         L     10,=A(PGT14)
* Function remove_suspicious_death_notes code
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    5,15
L986     EQU   *
         LTR   5,5
         BE    L984
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L972
         LR    4,5
         A     4,=F'36'
L988     EQU   *
         L     2,0(4)
         LTR   2,2
         BE    L972
         L     3,0(4)
         IC    2,2(3)
         CLM   2,1,=XL1'01'
         BE    L977
         CLM   2,1,=XL1'09'
         BNE   L976
L977     EQU   *
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'74'
         BNE   L976
         L     2,=A(@@V12)
         MVC   88(4,13),0(2)
         L     2,4(3)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BE    L976
         MVC   0(4,4),8(3)
         B     L988
L976     EQU   *
         L     4,0(4)
         A     4,=F'8'
         B     L988
L972     EQU   *
         L     5,12(5)
         B     L986
L984     EQU   *
         L     3,=A(@@V12)
         L     2,0(3)
         LTR   2,2
         BE    L981
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@54)
         BALR  14,15
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   0(4,3),=F'0'
L981     EQU   *
         MVC   0(4,3),=F'0'
* Function remove_suspicious_death_notes epilogue
         PDPEPIL
* Function remove_suspicious_death_notes literal pool
         DS    0F
         LTORG
* Function remove_suspicious_death_notes page table
         DS    0F
PGT14    EQU   *
         DC    A(PG14)
         DS    0F
* X-func setup_renumber prologue
SETUP@RE PDPPRLG CINDEX=15,FRAME=104,BASER=12,ENTRY=YES
         B     FEN15
         LTORG
FEN15    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG15     EQU   *
         LR    11,1
         L     10,=A(PGT15)
* Function setup_renumber code
         LA    1,88(,13)
         L     15,=V(ZZZ@1564)
         BALR  14,15
         L     6,=V(MAX@REGN)
         ST    15,0(6)
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@22)
         BALR  14,15
         SLR   15,15
L999     EQU   *
         C     15,0(6)
         BNL   L998
         L     2,=V(REG@RENU)
         L     5,0(2)
         LR    3,15
         AR    3,15
         LH    4,=H'-1'
         L     2,=V(RA@MAX@R)
         C     15,0(2)
         BNL   L994
         L     2,=V(RA@REG@R)
         L     2,0(2)
         LH    4,0(3,2)
L994     EQU   *
         STH   4,0(3,5)
         A     15,=F'1'
         B     L999
L998     EQU   *
         L     2,0(11)
         LTR   2,2
         BE    L989
         L     2,=V(RA@REG@R)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   0(4,2),=F'0'
         L     2,=V(RA@MAX@R)
         MVC   0(4,2),=F'0'
L989     EQU   *
* Function setup_renumber epilogue
         PDPEPIL
* Function setup_renumber literal pool
         DS    0F
         LTORG
* Function setup_renumber page table
         DS    0F
PGT15    EQU   *
         DC    A(PG15)
LC6      EQU   *
         DC    C'Instructions for spilling'
         DC    X'15'
         DC    C' added:'
         DC    X'15'
         DC    X'0'
LC7      EQU   *
         DC    C'  loads =%d cost=%lu'
         DC    X'15'
         DC    X'0'
LC8      EQU   *
         DC    C'  stores=%d cost=%lu'
         DC    X'15'
         DC    X'0'
LC9      EQU   *
         DC    C'  remat =%d cost=%lu'
         DC    X'15'
         DC    X'0'
LC10     EQU   *
         DC    C' removed:'
         DC    X'15'
         DC    C'  moves =%d cost=%lu'
         DC    X'15'
         DC    X'0'
LC11     EQU   *
         DC    C'  others=%d cost=%lu'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func dump_cost prologue
DUMP@COS PDPPRLG CINDEX=16,FRAME=104,BASER=12,ENTRY=YES
         B     FEN16
         LTORG
FEN16    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG16     EQU   *
         LR    11,1
         L     10,=A(PGT16)
* Function dump_cost code
         L     3,0(11)
         ST    3,88(13)
         MVC   92(4,13),=A(LC6)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(LC7)
         L     2,=A(@@V3)
         MVC   96(4,13),0(2)
         L     2,=A(@@V4)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(LC8)
         L     2,=A(@@V8)
         MVC   96(4,13),0(2)
         L     2,=A(@@V9)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(LC9)
         L     2,=A(@@V1)
         MVC   96(4,13),0(2)
         L     2,=A(@@V2)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(LC10)
         L     2,=A(@@V6)
         MVC   96(4,13),0(2)
         L     2,=A(@@V7)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(LC11)
         L     2,=A(@@V10)
         MVC   96(4,13),0(2)
         L     2,=A(@@V11)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1733)
         BALR  14,15
* Function dump_cost epilogue
         PDPEPIL
* Function dump_cost literal pool
         DS    0F
         LTORG
* Function dump_cost page table
         DS    0F
PGT16    EQU   *
         DC    A(PG16)
         DS    0F
* X-func ra_rewrite_init prologue
RA@REWRI PDPPRLG CINDEX=17,FRAME=88,BASER=12,ENTRY=YES
         B     FEN17
         LTORG
FEN17    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG17     EQU   *
         LR    11,1
         L     10,=A(PGT17)
* Function ra_rewrite_init code
         L     2,=A(@@V3)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V8)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V1)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V4)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V9)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V2)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V6)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V7)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V10)
         MVC   0(4,2),=F'0'
         L     2,=A(@@V11)
         MVC   0(4,2),=F'0'
* Function ra_rewrite_init epilogue
         PDPEPIL
* Function ra_rewrite_init literal pool
         DS    0F
         LTORG
* Function ra_rewrite_init page table
         DS    0F
PGT17    EQU   *
         DC    A(PG17)
         DS    0F
@@V6     EQU   *
         DC    4X'00'
         DS    0F
@@V7     EQU   *
         DC    4X'00'
         DS    0F
@@V3     EQU   *
         DC    4X'00'
         DS    0F
@@V8     EQU   *
         DC    4X'00'
         DS    0F
@@V1     EQU   *
         DC    4X'00'
         DS    0F
@@V4     EQU   *
         DC    4X'00'
         DS    0F
@@V9     EQU   *
         DC    4X'00'
         DS    0F
@@V2     EQU   *
         DC    4X'00'
         DS    0F
@@V5     EQU   *
         DC    4X'00'
         DS    0F
@@V10    EQU   *
         DC    4X'00'
         DS    0F
@@V11    EQU   *
         DC    4X'00'
         DS    0F
@@V12    EQU   *
         DC    4X'00'
         END
