         COPY  PDPTOP
         CSECT
         DS    0F
@@V1     EQU   *
         DC    4X'00'
* Program text area
         DS    0F
* X-func using_eh_for_cleanups prologue
USING@EH PDPPRLG CINDEX=0,FRAME=88,BASER=12,ENTRY=YES
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function using_eh_for_cleanups code
         L     2,=A(@@V1)
         MVC   0(4,2),=F'1'
* Function using_eh_for_cleanups epilogue
         PDPEPIL
* Function using_eh_for_cleanups literal pool
         DS    0F
         LTORG
* Function using_eh_for_cleanups page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         DS    0F
* X-func init_stmt_for_function prologue
INIT@STM PDPPRLG CINDEX=1,FRAME=96,BASER=12,ENTRY=YES
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function init_stmt_for_function code
         L     2,=V(CFUN)
         L     2,0(2)
         MVC   88(4,13),=F'60'
         LA    1,88(,13)
         L     15,=V(ZZZ@1051)
         BALR  14,15
         ST    15,4(2)
* Function init_stmt_for_function epilogue
         PDPEPIL
* Function init_stmt_for_function literal pool
         DS    0F
         LTORG
* Function init_stmt_for_function page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* X-func set_file_and_line_for_stmt prologue
SET@FILE PDPPRLG CINDEX=2,FRAME=88,BASER=12,ENTRY=YES
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function set_file_and_line_for_stmt code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         LTR   2,2
         BE    L3
         MVC   48(8,2),0(11)
L3       EQU   *
* Function set_file_and_line_for_stmt epilogue
         PDPEPIL
* Function set_file_and_line_for_stmt literal pool
         DS    0F
         LTORG
* Function set_file_and_line_for_stmt page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
         DS    0F
* X-func emit_nop prologue
EMIT@NOP PDPPRLG CINDEX=3,FRAME=96,BASER=12,ENTRY=YES
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function emit_nop code
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BNE   L5
         LH    2,0(15)
         CLM   2,3,=H'49'
         BE    L7
         CLM   2,3,=H'50'
         BNE   L5
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@REA)
         BALR  14,15
         LTR   15,15
         BNE   L5
L7       EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@NOP)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
L5       EQU   *
* Function emit_nop epilogue
         PDPEPIL
* Function emit_nop literal pool
         DS    0F
         LTORG
* Function emit_nop page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
LC0      EQU   *
         DC    C'<stdin>'
         DC    X'0'
LC1      EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* X-func label_rtx prologue
LABEL@RT PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=YES
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function label_rtx code
         L     3,0(11)
         CLI   8(3),31
         BE    L9
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'475'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L9       EQU   *
         L     2,80(3)
         LTR   2,2
         BNE   L10
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1886)
         BALR  14,15
L10      EQU   *
         L     15,80(3)
         LTR   15,15
         BNE   L11
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     15,80(3)
L11      EQU   *
* Function label_rtx epilogue
         PDPEPIL
* Function label_rtx literal pool
         DS    0F
         LTORG
* Function label_rtx page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
         DS    0F
* X-func force_label_rtx prologue
FORCE@LA PDPPRLG CINDEX=5,FRAME=104,BASER=12,ENTRY=YES
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function force_label_rtx code
         L     2,0(11)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         LR    4,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(DECL@FUN)
         BALR  14,15
         LTR   15,15
         BNE   L13
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'493'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L13      EQU   *
         L     2,=V(ZZZ@289)
         CL    15,0(2)
         BE    L14
         L     2,=V(INLINE@F)
         CL    15,0(2)
         BE    L14
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@FUN)
         BALR  14,15
         B     L15
L14      EQU   *
         L     2,=V(CFUN)
         L     15,0(2)
L15      EQU   *
         L     3,8(15)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         L     2,8(15)
         MVC   100(4,13),20(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
         ST    15,20(3)
         LR    15,4
* Function force_label_rtx epilogue
         PDPEPIL
* Function force_label_rtx literal pool
         DS    0F
         LTORG
* Function force_label_rtx page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
         DS    0F
* X-func ZZZ_553 prologue
ZZZ@553  PDPPRLG CINDEX=6,FRAME=96,BASER=12,ENTRY=YES
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function ZZZ_553 code
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@554)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@530)
         BALR  14,15
* Function ZZZ_553 epilogue
         PDPEPIL
* Function ZZZ_553 literal pool
         DS    0F
         LTORG
* Function ZZZ_553 page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
         DS    0F
* X-func ZZZ_607 prologue
ZZZ@607  PDPPRLG CINDEX=7,FRAME=112,BASER=12,ENTRY=YES
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function ZZZ_607 code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         MVC   88(4,13),=F'6'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@209)
         BALR  14,15
         LR    5,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         L     4,=V(CFUN)
         L     3,0(4)
         L     2,100(3)
         LTR   2,2
         BNE   L18
         MVC   88(4,13),=F'6'
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@225)
         BALR  14,15
         ST    15,104(3)
         L     2,0(4)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,100(2)
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         L     2,0(4)
         MVC   88(4,13),100(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         L     2,0(4)
         MVC   88(4,13),104(2)
         LA    1,88(,13)
         L     15,=V(EMIT@IND)
         BALR  14,15
         L     2,0(4)
         OC    244(4,2),=F'524288'
         B     L17
L18      EQU   *
         MVC   88(4,13),104(3)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         L     2,0(4)
         MVC   88(4,13),100(2)
         LA    1,88(,13)
         L     15,=A(ZZZ@553)
         BALR  14,15
L17      EQU   *
* Function ZZZ_607 epilogue
         PDPEPIL
* Function ZZZ_607 literal pool
         DS    0F
         LTORG
* Function ZZZ_607 page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
         DS    0F
* X-func ZZZ_648 prologue
ZZZ@648  PDPPRLG CINDEX=8,FRAME=96,BASER=12,ENTRY=YES
         B     FEN8
         LTORG
FEN8     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         LR    11,1
         L     10,=A(PGT8)
* Function ZZZ_648 code
         L     3,0(11)
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         L     2,44(3)
         LTR   2,2
         BE    L21
         L     15,80(3)
         LTR   15,15
         BNE   L22
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     15,80(3)
L22      EQU   *
         L     2,44(3)
         MVC   32(4,15),12(2)
L21      EQU   *
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     2,4(2)
         LTR   2,2
         BE    L20
         MVC   88(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         L     2,4(2)
         MVC   0(4,15),44(2)
         ST    15,44(2)
         ST    3,4(15)
L20      EQU   *
* Function ZZZ_648 epilogue
         PDPEPIL
* Function ZZZ_648 literal pool
         DS    0F
         LTORG
* Function ZZZ_648 page table
         DS    0F
PGT8     EQU   *
         DC    A(PG8)
         DS    0F
* X-func ZZZ_395 prologue
ZZZ@395  PDPPRLG CINDEX=9,FRAME=104,BASER=12,ENTRY=YES
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function ZZZ_395 code
         L     3,0(11)
         MVC   88(4,13),=F'6'
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,6(2)
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@46)
         BALR  14,15
         LR    5,15
         L     4,=V(CFUN)
         L     2,0(4)
         MVC   88(4,13),=F'0'
         ST    3,92(13)
         MVC   96(4,13),72(2)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,72(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         OC    0(4,15),=F'8'
         L     3,0(4)
         L     2,76(3)
         LTR   2,2
         BNE   L25
         MVC   88(4,13),=F'2'
         LR    2,3
         A     2,=F'84'
         ST    2,92(13)
         L     2,124(3)
         MVC   96(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@575)
         BALR  14,15
L25      EQU   *
         L     2,0(4)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'0'
         ST    5,96(13)
         MVC   100(4,13),76(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
         ST    15,76(2)
* Function ZZZ_395 epilogue
         PDPEPIL
* Function ZZZ_395 literal pool
         DS    0F
         LTORG
* Function ZZZ_395 page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
         DS    0F
* Function n_occurrences,F4 prologue
@@F4     PDPPRLG CINDEX=10,FRAME=88,BASER=12,ENTRY=NO
         B     FEN10
         LTORG
FEN10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         LR    11,1
         L     10,=A(PGT10)
* Function n_occurrences code
         L     4,0(11)
         L     3,4(11)
         SLR   15,15
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    L33
L31      EQU   *
         SLR   2,2
         IC    2,0(3)
         A     3,=F'1'
         CLR   2,4
         BNE   L27
         A     15,=F'1'
L27      EQU   *
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BNE   L31
L33      EQU   *
* Function n_occurrences epilogue
         PDPEPIL
* Function n_occurrences literal pool
         DS    0F
         LTORG
* Function n_occurrences page table
         DS    0F
PGT10    EQU   *
         DC    A(PG10)
         DS    0F
* X-func clear_last_expr prologue
CLEAR@LA PDPPRLG CINDEX=11,FRAME=88,BASER=12,ENTRY=YES
         B     FEN11
         LTORG
FEN11    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         LR    11,1
         L     10,=A(PGT11)
* Function clear_last_expr code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
         MVC   36(4,2),=F'0'
         MVC   40(4,2),=F'0'
* Function clear_last_expr epilogue
         PDPEPIL
* Function clear_last_expr literal pool
         DS    0F
         LTORG
* Function clear_last_expr page table
         DS    0F
PGT11    EQU   *
         DC    A(PG11)
         DS    0F
* X-func ZZZ_586 prologue
ZZZ@586  PDPPRLG CINDEX=12,FRAME=104,BASER=12,ENTRY=YES
         B     FEN12
         LTORG
FEN12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         LR    11,1
         L     10,=A(PGT12)
* Function ZZZ_586 code
         L     2,0(11)
         L     3,4(11)
         CLI   8(2),119
         BNE   L36
         L     2,16(2)
L36      EQU   *
         MVC   88(4,13),=F'53'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@979)
         BALR  14,15
         N     3,=F'1'
         SLL   3,4
         L     2,0(15)
         N     2,=F'-17'
         OR    2,3
         ST    2,0(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
* Function ZZZ_586 epilogue
         PDPEPIL
* Function ZZZ_586 literal pool
         DS    0F
         LTORG
* Function ZZZ_586 page table
         DS    0F
PGT12    EQU   *
         DC    A(PG12)
LC2      EQU   *
         DC    C'output operand constraint lacks `='''
         DC    X'0'
LC3      EQU   *
         DC    C'output constraint `%c'' for operand %d is not at'
         DC    C' the beginning'
         DC    X'0'
LC4      EQU   *
         DC    C'operand constraint contains incorrectly position'
         DC    C'ed ''+'' or ''='''
         DC    X'0'
LC5      EQU   *
         DC    C'`%%'' constraint used with last operand'
         DC    X'0'
LC6      EQU   *
         DC    C'matching constraint not valid in output operand'
         DC    X'0'
         DS    0F
* X-func parse_output_constraint prologue
PARSE@OU PDPPRLG CINDEX=13,FRAME=104,BASER=12,ENTRY=YES
         B     FEN13
         LTORG
FEN13    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         LR    11,1
         L     10,=A(PGT13)
* Function parse_output_constraint code
         L     8,0(11)
         L     9,4(11)
         L     7,16(11)
         L     6,20(11)
         L     5,0(8)
         MVI   0(7),0
         MVI   0(6),0
         ST    5,88(13)
         MVC   92(4,13),=F'126'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   L38
         ST    5,88(13)
         MVC   92(4,13),=F'78'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    4,15
L38      EQU   *
         LTR   4,4
         BNE   L39
         MVC   88(4,13),=A(LC2)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         LR    15,4
         B     L37
L39      EQU   *
         IC    2,0(4)
         X     2,=F'78'
         N     2,=XL4'000000FF'
         BCTR  2,0
         SRL   2,31
         L     3,24(11)
         STC   2,0(3)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    3,15
         CLR   4,5
         BE    L43
         MVC   88(4,13),=A(LC3)
         SLR   2,2
         IC    2,0(4)
         ST    2,92(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L43      EQU   *
         LR    2,3
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         SR    4,5
         IC    5,0(2)
         STC   5,0(2,4)
         MVI   0(2),126
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1052)
         BALR  14,15
         ST    15,0(8)
         LR    4,15
L120     EQU   *
         A     4,=F'1'
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BE    L114
         IC    5,0(4)
         LR    2,5
         N     2,=XL4'000000FF'
         LA    3,148(0,0)
         CR    2,3
         BE    L119
         BH    L102
         LA    3,108(0,0)
         CR    2,3
         BE    L50
         BH    L103
         LA    3,80(0,0)
         CR    2,3
         BE    L120
         BH    L104
         LA    3,76(0,0)
         CLR   2,3
         BE    L119
         LA    3,78(0,0)
         B     L117
L104     EQU   *
         LA    3,92(0,0)
         CR    2,3
         BE    L120
         BH    L105
         LA    3,90(0,0)
         B     L116
L105     EQU   *
         LA    3,107(0,0)
         B     L116
L103     EQU   *
         LA    3,123(0,0)
         CR    2,3
         BE    L120
         BH    L106
         LA    3,110(0,0)
         CLR   2,3
         BE    L119
         LA    3,111(0,0)
         B     L116
L106     EQU   *
         LA    3,135(0,0)
         CR    2,3
         BE    L100
         BH    L107
         LA    3,126(0,0)
L117     EQU   *
         CLR   2,3
         BE    L49
         B     L93
L107     EQU   *
         LA    3,137(0,0)
L116     EQU   *
         CLR   2,3
         BE    L120
         B     L93
L102     EQU   *
         LA    3,201(0,0)
         CR    2,3
         BH    L108
         LA    3,197(0,0)
         CR    2,3
         BNL   L120
         LA    3,151(0,0)
         CR    2,3
         BE    L96
         BH    L109
         LA    3,149(0,0)
         CLR   2,3
         BE    L120
         LA    3,150(0,0)
         CLR   2,3
         BE    L119
         B     L93
L109     EQU   *
         LA    3,162(0,0)
         CR    2,3
         BE    L120
         BH    L110
         LA    3,153(0,0)
         CLR   2,3
         BE    L96
         B     L93
L110     EQU   *
         LA    3,173(0,0)
         CLR   2,3
         BE    L86
         B     L93
L108     EQU   *
         LA    3,229(0,0)
         CR    2,3
         BE    L119
         BH    L111
         A     2,=F'-209'
         LA    3,6(0,0)
         CLR   2,3
         BH    L93
         B     L120
L111     EQU   *
         LA    3,231(0,0)
         CR    2,3
         BE    L100
         BL    L93
         A     2,=F'-240'
         LA    3,9(0,0)
         CLR   2,3
         BH    L93
         B     L86
L49      EQU   *
         MVC   88(4,13),=A(LC4)
         B     L118
L50      EQU   *
         LR    3,9
         A     3,=F'1'
         L     2,8(11)
         A     2,12(11)
         CLR   3,2
         BNE   L120
         MVC   88(4,13),=A(LC5)
         B     L118
L86      EQU   *
         MVC   88(4,13),=A(LC6)
L118     EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   15,15
         B     L37
L93      EQU   *
         LR    2,5
         N     2,=XL4'000000FF'
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'136'
         LTR   2,2
         BE    L120
         CLM   5,1,=XL1'81'
         BE    L96
         CLM   5,1,=XL1'84'
         BE    L96
         CLM   5,1,=XL1'86'
         BNE   L100
L96      EQU   *
         MVI   0(6),1
         B     L120
L100     EQU   *
         MVI   0(6),1
L119     EQU   *
         MVI   0(7),1
         B     L120
L114     EQU   *
         LA    15,1(0,0)
L37      EQU   *
* Function parse_output_constraint epilogue
         PDPEPIL
* Function parse_output_constraint literal pool
         DS    0F
         LTORG
* Function parse_output_constraint page table
         DS    0F
PGT13    EQU   *
         DC    A(PG13)
LC7      EQU   *
         DC    C'input operand constraint contains `%c'''
         DC    X'0'
LC8      EQU   *
         DC    C'matching constraint references invalid operand n'
         DC    C'umber'
         DC    X'0'
LC9      EQU   *
         DC    C'invalid punctuation `%c'' in constraint'
         DC    X'0'
LC10     EQU   *
         DC    C'matching constraint does not allow a register'
         DC    X'0'
         DS    0F
* X-func ZZZ_1631 prologue
ZZZ@1631 PDPPRLG CINDEX=14,FRAME=112,BASER=12,ENTRY=YES
         B     FEN14
         LTORG
FEN14    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG14     EQU   *
         LR    11,1
         L     10,=A(PGT14)
* Function ZZZ_1631 code
         L     9,24(11)
         L     7,28(11)
         L     2,0(11)
         L     4,0(2)
         ST    4,108(13)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    6,15
         SLR   8,8
         STC   8,0(9)
         STC   8,0(7)
         SLR   5,5
         CLR   5,15
         BNL   L194
L193     EQU   *
         IC    15,0(4,5)
         LR    2,15
         N     2,=XL4'000000FF'
         LA    3,148(0,0)
         CR    2,3
         BE    L199
         BH    L184
         LA    3,108(0,0)
         CR    2,3
         BE    L130
         BH    L185
         LA    3,80(0,0)
         CR    2,3
         BE    L128
         BH    L186
         LA    3,76(0,0)
         CLR   2,3
         BE    L124
         LA    3,78(0,0)
         B     L198
L186     EQU   *
         LA    3,92(0,0)
         CR    2,3
         BE    L124
         BH    L187
         LA    3,90(0,0)
         B     L197
L187     EQU   *
         LA    3,107(0,0)
         B     L197
L185     EQU   *
         LA    3,123(0,0)
         CR    2,3
         BE    L124
         BH    L188
         A     2,=F'-110'
         LA    3,1(0,0)
         B     L200
L188     EQU   *
         LA    3,135(0,0)
         CR    2,3
         BE    L182
         BH    L189
         LA    3,126(0,0)
L198     EQU   *
         CLR   2,3
         BE    L128
         B     L175
L189     EQU   *
         LA    3,137(0,0)
         B     L197
L184     EQU   *
         LA    3,201(0,0)
         CR    2,3
         BH    L190
         LA    3,197(0,0)
         CR    2,3
         BNL   L124
         LA    3,151(0,0)
         CR    2,3
         BE    L178
         BH    L191
         LA    3,149(0,0)
         CLR   2,3
         BE    L124
         LA    3,150(0,0)
         CLR   2,3
         BE    L199
         B     L175
L191     EQU   *
         LA    3,153(0,0)
         CLR   2,3
         BE    L178
         LA    3,162(0,0)
L197     EQU   *
         CLR   2,3
         BE    L124
         B     L175
L190     EQU   *
         LA    3,229(0,0)
         CR    2,3
         BE    L199
         BH    L192
         A     2,=F'-209'
         LA    3,6(0,0)
L200     EQU   *
         CLR   2,3
         BH    L175
         B     L124
L192     EQU   *
         LA    3,231(0,0)
         CR    2,3
         BE    L182
         BL    L175
         A     2,=F'-240'
         LA    3,9(0,0)
         CLR   2,3
         BH    L175
         B     L166
L128     EQU   *
         CL    4,108(13)
         BNE   L124
         MVC   88(4,13),=A(LC7)
         SLR   2,2
         IC    2,0(4,5)
         ST    2,92(13)
         B     L201
L130     EQU   *
         CL    4,108(13)
         BNE   L124
         L     3,4(11)
         A     3,=F'1'
         L     2,8(11)
         S     2,16(11)
         CLR   3,2
         BNE   L124
         MVC   88(4,13),=A(LC5)
         B     L201
L166     EQU   *
         LA    8,1(0,0)
         LR    3,4
         AR    3,5
         ST    3,88(13)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         MVC   96(4,13),=F'10'
         LA    1,88(,13)
         L     15,=V(STRTOUL)
         BALR  14,15
         CL    15,12(11)
         BL    L167
         MVC   88(4,13),=A(LC8)
L201     EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   15,15
         B     L121
L167     EQU   *
         L     3,104(13)
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BNE   L168
         LTR   5,5
         BE    L169
         LA    2,1(0,0)
         CLR   5,2
         BNE   L168
         CLI   0(4),108
         BNE   L168
L169     EQU   *
         SLL   15,2
         L     3,20(11)
         L     4,0(15,3)
         L     2,0(11)
         ST    4,0(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    6,15
         SLR   5,5
         B     L124
L168     EQU   *
         LR    5,3
         SR    5,4
         BCTR  5,0
         B     L178
L175     EQU   *
         LR    2,15
         N     2,=XL4'000000FF'
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'136'
         LTR   2,2
         BNE   L176
         MVC   88(4,13),=A(LC9)
         SLR   3,3
         IC    3,0(4,5)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         LR    15,2
         B     L121
L176     EQU   *
         CLM   15,1,=XL1'81'
         BE    L178
         CLM   15,1,=XL1'84'
         BE    L178
         CLM   15,1,=XL1'86'
         BNE   L182
L178     EQU   *
         MVI   0(7),1
         B     L124
L182     EQU   *
         MVI   0(7),1
L199     EQU   *
         MVI   0(9),1
L124     EQU   *
         A     5,=F'1'
         CLR   5,6
         BL    L193
         CLM   8,1,=XL1'00'
         BE    L194
         IC    2,0(7)
         CLM   2,1,=XL1'00'
         BNE   L194
         MVC   88(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L194     EQU   *
         LA    15,1(0,0)
L121     EQU   *
* Function ZZZ_1631 epilogue
         PDPEPIL
* Function ZZZ_1631 literal pool
         DS    0F
         LTORG
* Function ZZZ_1631 page table
         DS    0F
PGT14    EQU   *
         DC    A(PG14)
LC11     EQU   *
         DC    C'asm-specifier for variable `%s'' conflicts with '
         DC    C'asm clobber list'
         DC    X'0'
         DS    0F
* Function decl_conflicts_with_clobbers_p,F5 prologue
@@F5     PDPPRLG CINDEX=15,FRAME=96,BASER=12,ENTRY=NO
         B     FEN15
         LTORG
FEN15    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG15     EQU   *
         LR    11,1
         L     10,=A(PGT15)
* Function decl_conflicts_with_clobbers_p code
         L     4,0(11)
         L     7,4(11)
         IC    3,8(4)
         LA    2,222(,3)
         CLM   2,1,=XL1'01'
         BH    L203
         L     2,28(4)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    L203
         L     2,80(4)
         LTR   2,2
         BNE   L204
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L204     EQU   *
         LH    2,0(2)
         CLM   2,3,=H'74'
         BNE   L203
         L     2,80(4)
         LTR   2,2
         BNE   L205
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L205     EQU   *
         L     2,4(2)
         LA    8,19(0,0)
         CLR   2,8
         BH    L203
         L     3,80(4)
         LTR   3,3
         BNE   L206
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     3,80(4)
L206     EQU   *
         L     15,4(3)
         LR    5,15
         B     L207
L215     EQU   *
         LA    2,1(0,0)
         SLL   2,0(15)
         NR    2,7
         LTR   2,2
         BE    L209
         MVC   88(4,13),=A(LC11)
         L     2,44(4)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         NC    28(4,4),=F'-2097153'
         LA    15,1(0,0)
         B     L202
L209     EQU   *
         A     15,=F'1'
L207     EQU   *
         L     6,=V(MODE@SIZ)
         L     2,0(3)
         LA    8,15(0,0)
         CLR   5,8
         BNH   L210
         SRL   2,8
         N     2,=F'255'
         SLR   8,8
         IC    8,0(6,2)
         LR    2,8
         A     2,=F'7'
         SRA   2,3
         B     L216
L210     EQU   *
         SRL   2,8
         N     2,=F'255'
         SLR   8,8
         IC    8,0(6,2)
         LR    2,8
         A     2,=F'3'
         SRA   2,2
L216     EQU   *
         AR    2,5
         CLR   15,2
         BL    L215
L203     EQU   *
         SLR   15,15
L202     EQU   *
* Function decl_conflicts_with_clobbers_p epilogue
         PDPEPIL
* Function decl_conflicts_with_clobbers_p literal pool
         DS    0F
         LTORG
* Function decl_conflicts_with_clobbers_p page table
         DS    0F
PGT15    EQU   *
         DC    A(PG15)
LC12     EQU   *
         DC    C'missing close brace for named operand'
         DC    X'0'
LC13     EQU   *
         DC    C'undefined named operand ''%s'''
         DC    X'0'
LC14     EQU   *
         DC    C'%d'
         DC    X'0'
         DS    0F
* Function resolve_operand_name_1,F8 prologue
@@F8     PDPPRLG CINDEX=16,FRAME=104,BASER=12,ENTRY=NO
         B     FEN16
         LTORG
FEN16    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG16     EQU   *
         LR    11,1
         L     10,=A(PGT16)
* Function resolve_operand_name_1 code
         L     4,0(11)
         ST    4,88(13)
         MVC   92(4,13),=F'189'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BNE   L218
         MVC   88(4,13),=A(LC12)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         ST    4,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         B     L217
L218     EQU   *
         LR    5,15
         SR    5,4
         BCTR  5,0
         SLR   7,7
         L     3,4(11)
L237     EQU   *
         LTR   3,3
         BE    L234
         L     2,12(3)
         L     2,12(2)
         LTR   2,2
         BE    L221
         L     2,16(2)
         ST    2,88(13)
         LR    8,4
         A     8,=F'1'
         ST    8,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L221
         IC    2,0(2,5)
         CLM   2,1,=XL1'00'
         BE    L224
L221     EQU   *
         L     3,0(3)
         A     7,=F'1'
         B     L237
L234     EQU   *
         L     3,8(11)
L238     EQU   *
         LTR   3,3
         BE    L236
         L     2,12(3)
         L     2,12(2)
         LTR   2,2
         BE    L228
         L     2,16(2)
         ST    2,88(13)
         LR    8,4
         A     8,=F'1'
         ST    8,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   L228
         IC    2,0(2,5)
         CLM   2,1,=XL1'00'
         BE    L224
L228     EQU   *
         L     3,0(3)
         A     7,=F'1'
         B     L238
L236     EQU   *
         MVI   0(6),0
         MVC   88(4,13),=A(LC13)
         LR    2,4
         A     2,=F'1'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   7,7
L224     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(LC14)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    4,15
         CLR   15,6
         BNH   L232
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2113'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L232     EQU   *
         LR    2,6
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    4,88(13)
         ST    2,92(13)
         A     15,=F'1'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(MEMMOVE)
         BALR  14,15
         LR    15,4
L217     EQU   *
* Function resolve_operand_name_1 epilogue
         PDPEPIL
* Function resolve_operand_name_1 literal pool
         DS    0F
         LTORG
* Function resolve_operand_name_1 page table
         DS    0F
PGT16    EQU   *
         DC    A(PG16)
LC15     EQU   *
         DC    C'duplicate asm operand name ''%s'''
         DC    X'0'
         DS    0F
* X-func ZZZ_1829 prologue
ZZZ@1829 PDPPRLG CINDEX=17,FRAME=104,BASER=12,ENTRY=YES
         B     FEN17
         LTORG
FEN17    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG17     EQU   *
         LR    11,1
         L     10,=A(PGT17)
* Function ZZZ_1829 code
         L     6,0(11)
         L     8,4(11)
         L     7,8(11)
         LR    4,8
         LTR   8,8
         BE    L291
L250     EQU   *
         L     2,12(4)
         L     5,12(2)
         LTR   5,5
         BE    L242
         L     3,0(4)
L303     EQU   *
         LTR   3,3
         BE    L242
         ST    5,88(13)
         L     2,12(3)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LTR   15,15
         BNE   L248
         L     3,0(3)
         B     L303
L242     EQU   *
         L     4,0(4)
         LTR   4,4
         BNE   L250
L291     EQU   *
         LR    4,7
         LTR   7,7
         BE    L266
L265     EQU   *
         L     2,12(4)
         L     5,12(2)
         LTR   5,5
         BE    L253
         L     3,0(4)
L304     EQU   *
         LTR   3,3
         BE    L296
         ST    5,88(13)
         L     2,12(3)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LTR   15,15
         BNE   L248
         L     3,0(3)
         B     L304
L296     EQU   *
         LR    3,8
         LTR   8,8
         BE    L253
L264     EQU   *
         ST    5,88(13)
         L     2,12(3)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LTR   15,15
         BNE   L248
         L     3,0(3)
         LTR   3,3
         BNE   L264
L253     EQU   *
         L     4,0(4)
         LTR   4,4
         BNE   L265
         B     L266
L248     EQU   *
         MVC   88(4,13),=A(LC15)
         L     2,12(4)
         L     2,12(2)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L266     EQU   *
         LR    3,7
         LTR   7,7
         BE    L299
L274     EQU   *
         L     2,12(3)
         L     2,16(2)
         L     4,16(2)
         ST    4,88(13)
         MVC   92(4,13),=F'173'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    L269
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         LR    5,15
         B     L271
L273     EQU   *
         ST    15,88(13)
         ST    8,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
L271     EQU   *
         ST    15,88(13)
         MVC   92(4,13),=F'173'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BNE   L273
         L     2,12(3)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    15,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@95)
         BALR  14,15
         ST    15,16(2)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L269     EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   L274
L299     EQU   *
         L     4,16(6)
         B     L275
L281     EQU   *
         IC    2,1(4)
         CLM   2,1,=XL1'AD'
         BE    L276
         N     2,=XL4'000000FF'
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'136'
         LTR   2,2
         BE    L279
         CLI   2(4),173
         BE    L276
L279     EQU   *
         A     4,=F'1'
L275     EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'108'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   L281
L276     EQU   *
         LTR   4,4
         BE    L282
         MVC   88(4,13),16(6)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         LR    5,15
         LR    15,4
         S     15,16(6)
         AR    15,5
         B     L305
L289     EQU   *
         IC    2,1(15)
         CLM   2,1,=XL1'AD'
         BNE   L285
         A     15,=F'1'
         B     L286
L285     EQU   *
         N     2,=XL4'000000FF'
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    2,0(2,3)
         N     2,=F'136'
         LTR   2,2
         BE    L287
         CLI   2(15),173
         BNE   L287
         A     15,=F'2'
         B     L286
L287     EQU   *
         A     15,=F'1'
         B     L305
L286     EQU   *
         ST    15,88(13)
         ST    8,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@F8)
         BALR  14,15
L305     EQU   *
         ST    15,88(13)
         MVC   92(4,13),=F'108'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BNE   L289
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    15,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@95)
         BALR  14,15
         LR    6,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L282     EQU   *
         LR    15,6
* Function ZZZ_1829 epilogue
         PDPEPIL
* Function ZZZ_1829 literal pool
         DS    0F
         LTORG
* Function ZZZ_1829 page table
         DS    0F
PGT17    EQU   *
         DC    A(PG17)
LC16     EQU   *
         DC    C'too many alternatives in `asm'''
         DC    X'0'
LC17     EQU   *
         DC    C'operand constraints for `asm'' differ in number '
         DC    C'of alternatives'
         DC    X'0'
LC18     EQU   *
         DC    C'unknown register name `%s'' in `asm'''
         DC    X'0'
LC20     EQU   *
         DC    C'more than %d operands in `asm'''
         DC    X'0'
LC21     EQU   *
         DC    C'output number %d not directly addressable'
         DC    X'0'
LC22     EQU   *
         DC    C'asm operand %d probably doesn''t match constrain'
         DC    C'ts'
         DC    X'0'
LC23     EQU   *
         DC    C'use of memory input without lvalue in asm operan'
         DC    C'd %d is deprecated'
         DC    X'0'
LC19     EQU   *
         DC    C'PIC register `%s'' clobbered in `asm'''
         DC    X'0'
LC24     EQU   *
         DC    C'asm clobber conflict with output operand'
         DC    X'0'
LC25     EQU   *
         DC    C'asm clobber conflict with input operand'
         DC    X'0'
         DS    0F
* X-func ZZZ_587 prologue
ZZZ@587  PDPPRLG CINDEX=18,FRAME=248,BASER=12,ENTRY=YES
         B     FEN18
         LTORG
FEN18    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG18     EQU   *
         LR    11,1
         L     10,=A(PGT18)
* Function ZZZ_587 code
         L     4,8(11)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(LIST@LEN)
         BALR  14,15
         ST    15,180(13)
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(LIST@LEN)
         BALR  14,15
         ST    15,184(13)
         MVC   200(4,13),=F'0'
         LR    2,15
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,204(13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,208(13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,212(13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,216(13)
         L     2,184(13)
         A     2,180(13)
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,220(13)
         L     2,=V(GENERATI)
         MVC   224(4,13),0(2)
         L     2,184(13)
         LTR   2,2
         BNE   L307
         MVC   16(4,11),=F'1'
L307     EQU   *
         L     3,4(11)
         LTR   3,3
         BNE   L310
         LTR   4,4
         BE    L309
L310     EQU   *
         L     2,4(11)
         LTR   2,2
         BNE   L311
         LR    2,4
L311     EQU   *
         L     3,12(2)
         MVC   88(4,13),=F'107'
         L     2,16(3)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         LR    6,15
         LR    5,4
         LR    2,15
         A     2,=F'1'
         LA    15,30(0,0)
         CR    2,15
         BNH   L312
         MVC   88(4,13),=A(LC16)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     2,200(13)
         B     L313
L480     EQU   *
         MVC   88(4,13),=A(LC17)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   2,2
         B     L313
L312     EQU   *
         L     3,4(11)
L499     EQU   *
         LTR   3,3
         BE    L309
         L     2,12(3)
         L     2,16(2)
         L     2,16(2)
         MVC   88(4,13),=F'107'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         CLR   15,6
         BNE   L480
         L     2,0(3)
         LR    3,2
         LTR   2,2
         BNE   L499
         LR    3,5
         LR    5,2
         B     L499
L309     EQU   *
         LA    2,1(0,0)
L313     EQU   *
         CLM   2,1,=XL1'00'
         L     14,=A(L306)
         BER   14
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1829)
         BALR  14,15
         ST    15,0(11)
         SLR   7,7
         L     5,4(11)
         LTR   5,5
         BE    L452
         L     3,220(13)
L323     EQU   *
         L     2,12(5)
         L     2,16(2)
         MVC   0(4,3),16(2)
         L     5,0(5)
         A     7,=F'1'
         A     3,=F'4'
         LTR   5,5
         BNE   L323
L452     EQU   *
         LR    5,4
         LTR   4,4
         BE    L454
         LR    3,7
         SLL   3,2
         A     3,220(13)
L327     EQU   *
         L     2,12(5)
         L     2,16(2)
         MVC   0(4,3),16(2)
         L     5,0(5)
         A     3,=F'4'
         LTR   5,5
         BNE   L327
L454     EQU   *
         MVC   192(4,13),=F'0'
         MVC   196(4,13),192(13)
         L     6,12(11)
L484     EQU   *
         LTR   6,6
         BE    L456
         L     2,16(6)
         L     2,16(2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(DECODE@R)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNL   L332
         L     3,=F'-4'
         CLR   15,3
         BNE   L331
L332     EQU   *
         L     5,192(13)
         A     5,=F'1'
         ST    5,192(13)
         B     L333
L331     EQU   *
         L     15,=F'-2'
         CLR   7,15
         BNE   L333
         MVC   88(4,13),=A(LC18)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L330
L333     EQU   *
         LTR   7,7
         BL    L330
         L     3,=F'-1'
         CLR   7,3
         L     14,=A(L481)
         BER   14
         LA    2,1(0,0)
         SLL   2,0(7)
         O     2,196(13)
         ST    2,196(13)
L330     EQU   *
         L     6,0(6)
         B     L484
L456     EQU   *
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
         SLR   7,7
         ST    7,188(13)
         L     6,4(11)
L485     EQU   *
         LTR   6,6
         BE    L458
         L     5,16(6)
         L     8,4(5)
         L     2,=V(GLOBAL@T)
         CL    8,0(2)
         L     14,=A(L306)
         BER   14
         LR    2,7
         SLL   2,2
         L     15,220(13)
         L     2,0(2,15)
         ST    2,144(13)
         LR    2,13
         A     2,=F'144'
         ST    2,88(13)
         ST    7,92(13)
         MVC   96(4,13),180(13)
         MVC   100(4,13),184(13)
         LR    3,13
         A     3,=F'148'
         ST    3,104(13)
         LR    15,13
         A     15,=F'149'
         ST    15,108(13)
         A     2,=F'6'
         ST    2,112(13)
         LA    1,88(,13)
         L     15,=A(PARSE@OU)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(L306)
         BER   14
         CLI   149(13),0
         BNE   L343
         CLI   148(13),0
         BNE   L344
         CLI   150(13),0
         BNE   L344
         SLR   2,2
         IC    2,8(5)
         L     3,=V(ZZZ@1978)
         IC    2,0(3,2)
         CLM   2,1,=XL1'84'
         BNE   L343
         L     2,80(5)
         LTR   2,2
         BNE   L345
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(5)
L345     EQU   *
         LH    2,0(2)
         CLM   2,3,=H'74'
         BNE   L343
         L     2,80(5)
         LTR   2,2
         BNE   L346
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(5)
L346     EQU   *
         SLR   3,3
         IC    3,2(2)
         LH    2,32(8)
         N     2,=F'127'
         CLR   3,2
         BE    L343
L344     EQU   *
         ST    5,88(13)
         L     2,=V(LANG@HOO)
         L     2,76(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L343     EQU   *
         CLI   150(13),0
         BE    L340
         L     3,188(13)
         A     3,=F'1'
         ST    3,188(13)
L340     EQU   *
         L     6,0(6)
         A     7,=F'1'
         B     L485
L458     EQU   *
         L     5,180(13)
         A     5,188(13)
         ST    5,180(13)
         LR    2,5
         A     2,184(13)
         LA    15,30(0,0)
         CR    2,15
         BNH   L349
         MVC   88(4,13),=A(LC20)
         ST    15,92(13)
         L     14,=A(L496)
         BR    14
L349     EQU   *
         SLR   7,7
         LR    6,4
         LTR   4,4
         BE    L460
         L     5,184(13)
         SLL   5,2
         A     5,220(13)
L356     EQU   *
         L     2,16(6)
         L     3,4(2)
         L     2,=V(GLOBAL@T)
         CL    3,0(2)
         L     14,=A(L306)
         BER   14
         MVC   152(4,13),0(5)
         LR    2,13
         A     2,=F'152'
         ST    2,88(13)
         ST    7,92(13)
         MVC   96(4,13),180(13)
         MVC   100(4,13),184(13)
         MVC   104(4,13),188(13)
         MVC   108(4,13),220(13)
         LR    3,13
         A     3,=F'156'
         ST    3,112(13)
         LR    15,13
         A     15,=F'157'
         ST    15,116(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1631)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(L306)
         BER   14
         CLI   157(13),0
         BNE   L352
         CLI   156(13),0
         BE    L352
         MVC   88(4,13),16(6)
         L     2,=V(LANG@HOO)
         L     2,76(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L352     EQU   *
         A     7,=F'1'
         A     5,=F'4'
         L     6,0(6)
         LTR   6,6
         BNE   L356
L460     EQU   *
         SLR   7,7
         ST    7,188(13)
         L     6,4(11)
         LTR   6,6
         L     14,=A(L462)
         BER   14
         ST    7,244(13)
         L     8,212(13)
L378     EQU   *
         L     12,0(,10)
         L     5,16(6)
         L     9,4(5)
         L     2,220(13)
         A     2,244(13)
         ST    2,88(13)
         ST    7,92(13)
         MVC   96(4,13),180(13)
         MVC   100(4,13),184(13)
         LR    3,13
         A     3,=F'158'
         ST    3,104(13)
         LR    15,13
         A     15,=F'159'
         ST    15,108(13)
         LR    2,13
         A     2,=F'160'
         ST    2,112(13)
         LA    1,88(,13)
         L     15,=A(PARSE@OU)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L360
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1606'
         L     14,=A(L498)
         BR    14
L360     EQU   *
         L     3,=V(GENERATI)
         MVC   0(4,3),=F'0'
         MVC   0(4,8),=F'0'
         CLI   8(5),42
         BNE   L363
         CLI   158(13),0
         BNE   L362
L363     EQU   *
         SLR   2,2
         IC    2,8(5)
         L     3,=V(ZZZ@1978)
         IC    2,0(3,2)
         CLM   2,1,=XL1'84'
         BNE   L364
         CLI   158(13),0
         BNE   L365
         L     2,80(5)
         LTR   2,2
         BNE   L366
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(5)
L366     EQU   *
         LH    2,0(2)
         CLM   2,3,=H'74'
         BNE   L364
L365     EQU   *
         L     2,80(5)
         LTR   2,2
         BNE   L367
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(5)
L367     EQU   *
         LH    2,0(2)
         CLM   2,3,=H'74'
         BNE   L362
         L     2,80(5)
         LTR   2,2
         BNE   L368
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(5)
L368     EQU   *
         SLR   3,3
         IC    3,2(2)
         LH    2,32(9)
         N     2,=F'127'
         CLR   3,2
         BE    L362
L364     EQU   *
         CLI   159(13),0
         BE    L362
         CLI   160(13),0
         BE    L361
L362     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'6'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         LR    3,15
         LH    2,0(15)
         CLM   2,3,=H'79'
         BNE   L369
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(VALIDIZE)
         BALR  14,15
         LR    3,15
L369     EQU   *
         CLI   159(13),0
         BNE   L370
         LH    2,0(3)
         CLM   2,3,=H'79'
         BE    L370
         MVC   88(4,13),=A(LC21)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L370     EQU   *
         CLI   158(13),0
         BNE   L373
         LH    2,0(3)
         CLM   2,3,=H'79'
         BE    L372
L373     EQU   *
         LH    2,0(3)
         CLM   2,3,=H'78'
         BNE   L375
L372     EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         ST    15,0(8)
         SLR   15,15
         IC    15,2(3)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    3,15
         CLI   160(13),0
         BE    L375
         ST    15,88(13)
         MVC   92(4,13),0(8)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         B     L375
L361     EQU   *
         ST    9,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSIGN@T)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(VALIDIZE)
         BALR  14,15
         LR    3,15
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1557)
         BALR  14,15
         ST    15,16(6)
L375     EQU   *
         L     2,244(13)
         L     15,204(13)
         ST    3,0(15,2)
         L     2,=V(GENERATI)
         MVC   0(4,2),224(13)
         CLI   160(13),0
         BE    L376
         L     2,188(13)
         SLL   2,2
         LH    9,32(9)
         N     9,=F'127'
         L     3,216(13)
         ST    9,0(2,3)
         L     15,208(13)
         ST    7,0(2,15)
         L     2,188(13)
         A     2,=F'1'
         ST    2,188(13)
L376     EQU   *
         ST    5,88(13)
         MVC   92(4,13),196(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L359
         MVC   200(4,13),=F'1'
L359     EQU   *
         L     6,0(6)
         A     7,=F'1'
         L     3,244(13)
         A     3,=F'4'
         ST    3,244(13)
         A     8,=F'4'
         LTR   6,6
         BNE   L378
L462     EQU   *
         MVC   88(4,13),180(13)
         LA    1,88(,13)
         L     15,=V(RTVEC@AL)
         BALR  14,15
         ST    15,172(13)
         MVC   88(4,13),180(13)
         LA    1,88(,13)
         L     15,=V(RTVEC@AL)
         BALR  14,15
         ST    15,176(13)
         MVC   88(4,13),=F'54'
         L     2,184(13)
         LTR   2,2
         BE    L380
         L     5,204(13)
         L     2,0(5)
         SLR   15,15
         IC    15,2(2)
         LR    2,15
L380     EQU   *
         ST    2,92(13)
         L     2,0(11)
         MVC   96(4,13),16(2)
         MVC   100(4,13),=V(EMPTY@ST)
         MVC   104(4,13),=F'0'
         MVC   108(4,13),172(13)
         MVC   112(4,13),176(13)
         L     3,20(11)
         ST    3,116(13)
         L     5,24(11)
         ST    5,120(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@986)
         BALR  14,15
         LR    9,15
         L     15,16(11)
         N     15,=F'1'
         ST    15,228(13)
         LR    3,15
         SLL   3,4
         L     2,0(9)
         N     2,=F'-17'
         OR    2,3
         ST    2,0(9)
         SLR   7,7
         LR    6,4
         LTR   4,4
         L     14,=A(L464)
         BER   14
         L     8,184(13)
         SLL   8,2
         A     8,220(13)
         MVC   240(4,13),184(13)
L404     EQU   *
         L     12,0(,10)
         MVC   164(4,13),0(8)
         LR    2,13
         A     2,=F'164'
         ST    2,88(13)
         ST    7,92(13)
         MVC   96(4,13),180(13)
         MVC   100(4,13),184(13)
         MVC   104(4,13),188(13)
         MVC   108(4,13),220(13)
         LR    3,13
         A     3,=F'168'
         ST    3,112(13)
         LR    4,13
         A     4,=F'169'
         ST    4,116(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1631)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L384
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1687'
L498     EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L384     EQU   *
         L     5,=V(GENERATI)
         MVC   0(4,5),=F'0'
         MVC   232(4,13),16(6)
         L     15,232(13)
         L     5,4(15)
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         CLI   168(13),0
         BE    L385
         LA    2,7(0,0)
         CLI   169(13),0
         BE    L386
L385     EQU   *
         SLR   2,2
L386     EQU   *
         ST    2,100(13)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         LR    4,15
         LH    2,0(15)
         CLM   2,3,=H'78'
         BNE   L387
         SLR   2,2
         IC    2,2(15)
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@RE)
         BALR  14,15
         B     L486
L387     EQU   *
         CLM   2,3,=H'79'
         BNE   L388
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(VALIDIZE)
         BALR  14,15
L486     EQU   *
         LR    4,15
L388     EQU   *
         ST    4,88(13)
         MVC   92(4,13),164(13)
         LA    1,88(,13)
         L     15,=V(ASM@OPER)
         BALR  14,15
         LTR   15,15
         L     14,=A(L390)
         BHR   14
         CLI   169(13),0
         BE    L391
         LH    3,32(5)
         N     3,=F'127'
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@RE)
         BALR  14,15
         LR    4,15
         L     14,=A(L390)
         BR    14
L391     EQU   *
         CLI   168(13),0
         BNE   L393
         MVC   88(4,13),=A(LC22)
         MVC   92(4,13),240(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         L     14,=A(L390)
         BR    14
L393     EQU   *
         LH    2,0(4)
         CLM   2,3,=H'79'
         L     14,=A(L390)
         BER   14
         MVC   88(4,13),=A(LC23)
         MVC   92(4,13),240(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-80'
         CLM   2,3,=H'1'
         BNH   L398
         CLM   3,3,=H'67'
         BE    L398
         CLM   3,3,=H'68'
         BE    L398
         CLM   3,3,=H'71'
         BE    L398
         CLM   3,3,=H'151'
         BE    L398
         CLM   3,3,=H'69'
         BE    L398
         CLM   3,3,=H'157'
         BNE   L397
L398     EQU   *
         LH    15,32(5)
         N     15,=F'127'
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@CO)
         BALR  14,15
         LTR   15,15
         BE    L399
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(VALIDIZE)
         BALR  14,15
         B     L487
L399     EQU   *
         LH    2,32(5)
         N     2,=F'127'
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@RE)
         BALR  14,15
L487     EQU   *
         LR    4,15
L397     EQU   *
         LH    2,0(4)
         CLM   2,3,=H'74'
         BE    L402
         CLM   2,3,=H'76'
         BE    L402
         CLM   2,3,=H'83'
         BE    L402
         CLM   2,3,=H'78'
         L     14,=A(L390)
         BNER  14
L402     EQU   *
         ST    5,88(13)
         L     3,8(5)
         SRL   3,19
         LR    2,3
         SRL   2,0
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         O     3,=F'1'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(BUILD@QU)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSIGN@T)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(VALIDIZE)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         LR    4,2
L390     EQU   *
         L     3,=V(GENERATI)
         MVC   0(4,3),224(13)
         L     2,16(9)
         LR    3,7
         SLL   3,2
         ST    4,4(3,2)
         L     2,20(9)
         MVC   88(4,13),=F'53'
         LH    5,32(5)
         N     5,=F'127'
         ST    5,92(13)
         MVC   96(4,13),0(8)
         LA    1,88(,13)
         L     15,=V(ZZZ@979)
         BALR  14,15
         ST    15,4(3,2)
         MVC   88(4,13),232(13)
         MVC   92(4,13),196(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L383
         MVC   200(4,13),=F'1'
L383     EQU   *
         L     6,0(6)
         A     7,=F'1'
         L     4,240(13)
         A     4,=F'1'
         ST    4,240(13)
         A     8,=F'4'
         LTR   6,6
         BNE   L404
L464     EQU   *
         L     8,=V(GENERATI)
         B     PGE18
         DS    0F
         LTORG
         DS    0F
PGE18    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG19     EQU   *
         MVC   0(4,8),=F'0'
         SLR   7,7
         L     4,180(13)
         S     4,188(13)
L488     EQU   *
         L     12,4(,10)
         CR    7,4
         BNL   L466
         L     3,16(9)
         LR    2,7
         SLL   2,2
         L     5,4(2,3)
         ST    5,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         ST    15,4(2,3)
         A     7,=F'1'
         B     L488
L466     EQU   *
         L     12,4(,10)
         SLR   7,7
L489     EQU   *
         L     12,4(,10)
         C     7,184(13)
         BNL   L468
         LR    2,7
         SLL   2,2
         L     15,204(13)
         L     15,0(2,15)
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         L     3,204(13)
         ST    15,0(2,3)
         A     7,=F'1'
         B     L489
L468     EQU   *
         L     12,4(,10)
         SLR   7,7
L490     EQU   *
         L     12,4(,10)
         C     7,188(13)
         BNL   L470
         LR    6,7
         SLL   6,2
         L     4,208(13)
         L     5,0(6,4)
         L     4,16(9)
         L     3,180(13)
         S     3,188(13)
         AR    3,7
         SLL   3,2
         LR    2,5
         SLL   2,2
         L     15,204(13)
         L     2,0(2,15)
         ST    2,4(3,4)
         LR    2,13
         A     2,=F'128'
         ST    2,88(13)
         MVC   92(4,13),=A(LC14)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         L     2,20(9)
         LR    4,13
         A     4,=F'128'
         ST    4,88(13)
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(ZZZ@1052)
         BALR  14,15
         MVC   88(4,13),=F'53'
         L     5,216(13)
         L     6,0(6,5)
         ST    6,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@979)
         BALR  14,15
         ST    15,4(3,2)
         A     7,=F'1'
         B     L490
L470     EQU   *
         L     12,4(,10)
         MVC   0(4,8),224(13)
         L     2,184(13)
         LA    15,1(0,0)
         CLR   2,15
         BNE   L417
         L     3,192(13)
         LTR   3,3
         BNE   L419
         L     4,220(13)
         MVC   8(4,9),0(4)
         MVC   88(4,13),=F'60'
         MVC   92(4,13),192(13)
         L     5,204(13)
         MVC   96(4,13),0(5)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
         ST    15,88(13)
         B     L494
L417     EQU   *
         L     12,4(,10)
         L     15,184(13)
         LTR   15,15
         BNE   L419
         L     2,192(13)
         LTR   2,2
         BNE   L419
         B     L474
L481     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(LC19)
         ST    2,92(13)
L496     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L306
L419     EQU   *
         L     12,4(,10)
         ST    9,236(13)
         L     2,184(13)
         LTR   2,2
         BNE   L421
         LA    2,1(0,0)
L421     EQU   *
         L     12,4(,10)
         A     2,192(13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(RTVEC@AL)
         BALR  14,15
         MVC   88(4,13),=F'52'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@952)
         BALR  14,15
         LR    9,15
         SLR   7,7
         L     6,4(11)
         LTR   6,6
         BE    L482
L425     EQU   *
         L     12,4(,10)
         L     4,4(9)
         LR    3,7
         SLL   3,2
         MVC   88(4,13),=F'54'
         L     5,204(13)
         L     2,0(3,5)
         SLR   15,15
         IC    15,2(2)
         ST    15,92(13)
         L     2,0(11)
         MVC   96(4,13),16(2)
         L     5,220(13)
         L     5,0(3,5)
         ST    5,100(13)
         ST    7,104(13)
         MVC   108(4,13),172(13)
         MVC   112(4,13),176(13)
         L     15,20(11)
         ST    15,116(13)
         L     2,24(11)
         ST    2,120(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@986)
         BALR  14,15
         MVC   88(4,13),=F'60'
         MVC   92(4,13),=F'0'
         L     5,204(13)
         L     5,0(3,5)
         ST    5,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
         ST    15,4(3,4)
         L     2,4(9)
         L     2,4(3,2)
         L     3,8(2)
         L     4,228(13)
         SLL   4,4
         L     2,0(3)
         N     2,=F'-17'
         OR    2,4
         ST    2,0(3)
         L     6,0(6)
         A     7,=F'1'
         LTR   6,6
         BNE   L425
         LTR   7,7
         BNE   L426
L482     EQU   *
         L     12,4(,10)
         L     2,4(9)
         MVC   4(4,2),236(13)
         LA    7,1(0,0)
L426     EQU   *
         L     12,4(,10)
         L     6,12(11)
L491     EQU   *
         L     12,4(,10)
         LTR   6,6
         BE    L474
         L     2,16(6)
         MVC   88(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(DECODE@R)
         BALR  14,15
         LTR   15,15
         BNL   L430
         L     2,=F'-3'
         CLR   15,2
         BE    L429
         L     3,=F'-4'
         CLR   15,3
         BNE   L429
         L     3,4(9)
         LR    2,7
         SLL   2,2
         MVC   88(4,13),=F'75'
         A     7,=F'1'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@950)
         BALR  14,15
         MVC   88(4,13),=F'1'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@992)
         BALR  14,15
         MVC   88(4,13),=F'62'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         B     L493
L430     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'4'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@993)
         BALR  14,15
         LR    8,15
         L     4,200(13)
         LTR   4,4
         BNE   L433
         C     4,184(13)
         BNL   L476
         L     2,204(13)
L438     EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1793)
         BALR  14,15
         LTR   15,15
         BE    L436
         MVC   88(4,13),=A(LC24)
         B     L497
L436     EQU   *
         L     12,4(,10)
         A     4,=F'1'
         A     2,=F'4'
         C     4,184(13)
         BL    L438
L476     EQU   *
         L     12,4(,10)
         SLR   4,4
         L     5,180(13)
         S     5,188(13)
L492     EQU   *
         L     12,4(,10)
         CR    4,5
         BNL   L433
         ST    8,88(13)
         L     15,236(13)
         L     3,16(15)
         LR    2,4
         SLL   2,2
         L     3,4(2,3)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1793)
         BALR  14,15
         LTR   15,15
         BE    L441
         MVC   88(4,13),=A(LC25)
L497     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(ZZZ@1485)
         BALR  14,15
L441     EQU   *
         L     12,4(,10)
         A     4,=F'1'
         B     L492
L433     EQU   *
         L     12,4(,10)
         L     3,4(9)
         LR    2,7
         SLL   2,2
         MVC   88(4,13),=F'62'
         A     7,=F'1'
         MVC   92(4,13),=F'0'
         ST    8,96(13)
L493     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(ZZZ@953)
         BALR  14,15
         ST    15,4(2,3)
L429     EQU   *
         L     12,4(,10)
         L     6,0(6)
         B     L491
L474     EQU   *
         L     12,4(,10)
         ST    9,88(13)
L494     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
         SLR   7,7
L495     EQU   *
         L     12,4(,10)
         C     7,184(13)
         BNL   L479
         LR    3,7
         SLL   3,2
         L     4,212(13)
         L     2,0(3,4)
         LTR   2,2
         BE    L447
         ST    2,88(13)
         L     5,204(13)
         L     3,0(3,5)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
L447     EQU   *
         L     12,4(,10)
         A     7,=F'1'
         B     L495
L479     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(ZZZ@868)
         BALR  14,15
L306     EQU   *
         L     12,4(,10)
* Function ZZZ_587 epilogue
         PDPEPIL
* Function ZZZ_587 literal pool
         DS    0F
         LTORG
* Function ZZZ_587 page table
         DS    0F
PGT18    EQU   *
         DC    A(PG18)
         DC    A(PG19)
LC26     EQU   *
         DC    C'%Hvalue computed is not used'
         DC    X'0'
         DS    0F
* X-func warn_if_unused_value prologue
WARN@IF@ PDPPRLG CINDEX=20,FRAME=96,BASER=12,ENTRY=YES
         B     FEN20
         LTORG
FEN20    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG20     EQU   *
         LR    11,1
         L     10,=A(PGT20)
* Function warn_if_unused_value code
         L     4,0(11)
L554     EQU   *
         L     3,8(4)
         LR    15,3
         SRL   15,15
         N     15,=F'1'
         LTR   15,15
         BNE   L533
         L     2,4(4)
         CLI   8(2),5
         BE    L500
         LR    2,3
         SRL   2,24
         LA    5,90(0,0)
         CLR   2,5
         BH    L542
         LA    5,89(0,0)
         CLR   2,5
         BNL   L520
         LA    5,51(0,0)
         CLR   2,5
         BH    L543
         LA    5,49(0,0)
         CLR   2,5
         BNL   L533
         LA    5,42(0,0)
         CLR   2,5
         BE    L535
         LA    5,48(0,0)
         CLR   2,5
         BE    L521
         B     L537
L543     EQU   *
         LA    5,53(0,0)
         CLR   2,5
         BE    L520
         BL    L537
         LA    5,55(0,0)
         B     L551
L542     EQU   *
         LA    5,118(0,0)
         CLR   2,5
         BE    L533
         BH    L544
         LA    5,112(0,0)
         CLR   2,5
         BL    L537
         LA    5,114(0,0)
         CLR   2,5
         BNH   L527
         LA    5,116(0,0)
         CLR   2,5
         BE    L520
         B     L537
L544     EQU   *
         LA    5,132(0,0)
         CLR   2,5
         BE    L533
         BH    L545
         A     2,=F'-127'
         LA    5,3(0,0)
L551     EQU   *
         CLR   2,5
         BH    L537
         B     L533
L545     EQU   *
         LA    5,138(0,0)
         CLR   2,5
         BNE   L537
         B     L533
L520     EQU   *
         L     4,20(4)
         B     L554
L521     EQU   *
         SRL   3,13
         N     3,=F'1'
         LTR   3,3
         BNE   L500
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=A(WARN@IF@)
         BALR  14,15
         LTR   15,15
         BNE   L553
         L     3,20(4)
         L     2,8(3)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BNE   L500
         LR    4,3
         B     L554
L527     EQU   *
         SRL   3,13
         N     3,=F'1'
         LTR   3,3
         BNE   L500
         L     15,16(4)
         IC    3,8(15)
         LA    2,144(,3)
L552     EQU   *
         CLM   2,1,=XL1'01'
         BH    L547
         L     15,16(15)
         IC    5,8(15)
         LA    2,144(,5)
         B     L552
L547     EQU   *
         IC    3,8(15)
         LA    2,207(,3)
         CLM   2,1,=XL1'01'
         BNH   L533
         CLM   3,1,=XL1'36'
         BNE   L534
L533     EQU   *
         SLR   15,15
         B     L500
L535     EQU   *
         L     15,16(4)
         L     2,4(15)
         CLI   8(2),15
         BNE   L537
         LR    4,15
         B     L554
L537     EQU   *
         L     5,=V(ZZZ@1978)
         LR    2,3
         SRL   2,24
         IC    2,0(5,2)
         CLM   2,1,=XL1'84'
         BE    L539
         CLM   2,1,=XL1'99'
         BNE   L538
L539     EQU   *
         LR    2,3
         SRL   2,20
         N     2,=F'1'
         SLR   15,15
         LTR   2,2
         BNE   L500
L538     EQU   *
         SRL   3,24
         IC    2,0(5,3)
         CLM   2,1,=XL1'85'
         BNE   L534
         L     2,=V(ZZZ@1976)
         IC    2,0(2,3)
         SLR   15,15
         CLM   2,1,=XL1'00'
         BE    L500
L534     EQU   *
         L     2,8(4)
         SRL   2,23
         N     2,=F'1'
         SLR   15,15
         LTR   2,2
         BNE   L500
         MVC   88(4,13),=A(LC26)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         A     2,=F'48'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L553     EQU   *
         LA    15,1(0,0)
L500     EQU   *
* Function warn_if_unused_value epilogue
         PDPEPIL
* Function warn_if_unused_value literal pool
         DS    0F
         LTORG
* Function warn_if_unused_value page table
         DS    0F
PGT20    EQU   *
         DC    A(PG20)
LC27     EQU   *
         DC    C'%Hstatement with no effect'
         DC    X'0'
         DS    0F
* X-func ZZZ_640 prologue
ZZZ@640  PDPPRLG CINDEX=21,FRAME=128,BASER=12,ENTRY=YES
         B     FEN21
         LTORG
FEN21    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG21     EQU   *
         LR    11,1
         L     10,=A(PGT21)
* Function ZZZ_640 code
         L     4,0(11)
         L     6,4(11)
         MVC   120(4,13),=F'0'
         L     2,=F'-1'
         CLR   6,2
         BNE   L557
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,44(2)
         LTR   2,2
         BE    L558
         LA    2,1(0,0)
L558     EQU   *
         LR    6,2
L557     EQU   *
         LTR   6,6
         BNE   L573
         L     2,=V(CFUN)
         L     3,0(2)
         L     2,4(3)
         L     2,44(2)
         LTR   2,2
         BE    L560
         L     2,8(11)
         LTR   2,2
         BNE   L564
L560     EQU   *
         L     2,=V(GLOBAL@T)
         CL    4,0(2)
         BE    L564
         L     2,=V(ZZZ@2048)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L564
         L     2,8(4)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         BE    L561
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(WARN@IF@)
         BALR  14,15
         B     L564
L561     EQU   *
         L     2,4(4)
         CLI   8(2),5
         BE    L564
         MVC   88(4,13),=A(LC27)
         L     3,4(3)
         A     3,=F'48'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     L564
L573     EQU   *
         L     2,4(4)
         CLI   8(2),23
         BNE   L564
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@87)
         BALR  14,15
         MVC   88(4,13),=F'119'
         ST    15,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    4,15
L564     EQU   *
         ST    4,88(13)
         SLR   2,2
         LTR   6,6
         BNE   L566
         L     2,=V(ZZZ@206)
         L     2,256(2)
L566     EQU   *
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LR    2,13
         A     2,=F'120'
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         LR    3,15
         L     5,4(4)
         LTR   15,15
         BE    L567
         LH    2,0(15)
         CLM   2,3,=H'79'
         BNE   L567
         L     2,8(4)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BE    L567
         L     2,32(5)
         N     2,=F'8323072'
         LTR   2,2
         BE    L567
         L     4,=F'65536'
         CLR   2,4
         BE    L570
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@226)
         BALR  14,15
         LR    3,15
         B     L567
L570     EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),16(5)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    3,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'116'
         ST    15,100(13)
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'0'
         ST    2,112(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
L567     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1692)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@868)
         BALR  14,15
         LTR   6,6
         BE    L572
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         ST    3,36(2)
         MVC   40(4,2),120(13)
         ST    5,32(2)
L572     EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
* Function ZZZ_640 epilogue
         PDPEPIL
* Function ZZZ_640 literal pool
         DS    0F
         LTORG
* Function ZZZ_640 page table
         DS    0F
PGT21    EQU   *
         DC    A(PG21)
         DS    0F
* X-func ZZZ_639 prologue
ZZZ@639  PDPPRLG CINDEX=22,FRAME=104,BASER=12,ENTRY=YES
         B     FEN22
         LTORG
FEN22    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG22     EQU   *
         LR    11,1
         L     10,=A(PGT22)
* Function ZZZ_639 code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'-1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(ZZZ@640)
         BALR  14,15
* Function ZZZ_639 epilogue
         PDPEPIL
* Function ZZZ_639 literal pool
         DS    0F
         LTORG
* Function ZZZ_639 page table
         DS    0F
PGT22    EQU   *
         DC    A(PG22)
         DS    0F
* X-func ZZZ_671 prologue
ZZZ@671  PDPPRLG CINDEX=23,FRAME=96,BASER=12,ENTRY=YES
         B     FEN23
         LTORG
FEN23    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG23     EQU   *
         LR    11,1
         L     10,=A(PGT23)
* Function ZZZ_671 code
         MVC   88(4,13),=F'118'
         LA    1,88(,13)
         L     15,=V(MAKE@NOD)
         BALR  14,15
         LR    4,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         L     2,0(11)
         LTR   2,2
         BE    L576
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1946)
         BALR  14,15
         B     L577
L576     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
L577     EQU   *
         L     2,=V(CFUN)
         L     3,0(2)
         L     2,8(3)
         L     5,4(2)
         A     5,=F'1'
         ST    5,4(2)
         L     2,4(3)
         L     3,44(2)
         A     3,=F'1'
         ST    3,44(2)
         LR    15,4
* Function ZZZ_671 epilogue
         PDPEPIL
* Function ZZZ_671 literal pool
         DS    0F
         LTORG
* Function ZZZ_671 page table
         DS    0F
PGT23    EQU   *
         DC    A(PG23)
         DS    0F
* X-func ZZZ_632 prologue
ZZZ@632  PDPPRLG CINDEX=24,FRAME=104,BASER=12,ENTRY=YES
         B     FEN24
         LTORG
FEN24    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG24     EQU   *
         LR    11,1
         L     10,=A(PGT24)
* Function ZZZ_632 code
         L     5,0(11)
         L     6,=V(CFUN)
         L     3,0(6)
         L     2,8(3)
         L     4,4(2)
         BCTR  4,0
         ST    4,4(2)
         L     4,4(3)
         L     15,36(4)
         LTR   15,15
         BE    L580
         L     2,32(4)
         LTR   2,2
         BNE   L579
L580     EQU   *
         L     2,=V(ZZZ@206)
         MVC   36(4,4),256(2)
         MVC   40(4,4),=F'0'
         L     2,=V(GLOBAL@T)
         MVC   32(4,4),144(2)
         B     L581
L579     EQU   *
         LH    3,0(15)
         CLM   3,3,=H'74'
         BE    L581
         LR    2,3
         AH    2,=H'-80'
         CLM   2,3,=H'1'
         BNH   L581
         CLM   3,3,=H'67'
         BE    L581
         CLM   3,3,=H'68'
         BE    L581
         CLM   3,3,=H'71'
         BE    L581
         CLM   3,3,=H'151'
         BE    L581
         CLM   3,3,=H'69'
         BE    L581
         CLM   3,3,=H'157'
         BE    L581
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         ST    15,36(4)
L581     EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         L     3,0(6)
         L     2,4(3)
         MVC   4(4,5),32(2)
         L     2,4(3)
         MVC   20(4,5),36(2)
         MVC   24(4,5),40(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         ST    15,16(5)
         L     2,0(6)
         MVC   88(4,13),=F'0'
         ST    5,92(13)
         MVC   96(4,13),116(2)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,116(2)
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         OC    8(4,5),=F'8388608'
         L     2,0(6)
         L     2,4(2)
         MVC   88(4,13),36(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@2012)
         BALR  14,15
         N     15,=F'1'
         SLL   15,20
         L     2,8(5)
         N     2,=F'-1048577'
         OR    2,15
         ST    2,8(5)
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
         L     2,0(6)
         L     2,4(2)
         L     3,44(2)
         BCTR  3,0
         ST    3,44(2)
         LR    15,5
* Function ZZZ_632 epilogue
         PDPEPIL
* Function ZZZ_632 literal pool
         DS    0F
         LTORG
* Function ZZZ_632 page table
         DS    0F
PGT24    EQU   *
         DC    A(PG24)
         DS    0F
* X-func ZZZ_665 prologue
ZZZ@665  PDPPRLG CINDEX=25,FRAME=104,BASER=12,ENTRY=YES
         B     FEN25
         LTORG
FEN25    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG25     EQU   *
         LR    11,1
         L     10,=A(PGT25)
* Function ZZZ_665 code
         MVC   88(4,13),=F'64'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         LR    4,15
         MVC   16(4,15),=F'0'
         L     5,=V(CFUN)
         L     2,0(5)
         L     2,4(2)
         MVC   4(4,15),8(2)
         MVC   0(4,15),20(2)
         L     3,24(2)
         LR    6,3
         A     6,=F'1'
         ST    6,24(2)
         ST    6,8(4)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,24(4)
         L     15,4(11)
         LTR   15,15
         BE    L585
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
L585     EQU   *
         ST    15,12(4)
         ST    15,20(4)
         L     2,0(5)
         L     2,4(2)
         ST    4,8(2)
         ST    4,20(2)
         MVC   88(4,13),0(11)
         MVC   92(4,13),24(4)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(DO@JUMP)
         BALR  14,15
* Function ZZZ_665 epilogue
         PDPEPIL
* Function ZZZ_665 literal pool
         DS    0F
         LTORG
* Function ZZZ_665 page table
         DS    0F
PGT25    EQU   *
         DC    A(PG25)
         DS    0F
* X-func ZZZ_667 prologue
ZZZ@667  PDPPRLG CINDEX=26,FRAME=104,BASER=12,ENTRY=YES
         B     FEN26
         LTORG
FEN26    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG26     EQU   *
         LR    11,1
         L     10,=A(PGT26)
* Function ZZZ_667 code
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     3,8(2)
         L     2,20(3)
         LTR   2,2
         BNE   L587
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,20(3)
L587     EQU   *
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(ZZZ@553)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,24(2)
         MVC   88(4,13),0(11)
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   92(4,13),24(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(DO@JUMP)
         BALR  14,15
* Function ZZZ_667 epilogue
         PDPEPIL
* Function ZZZ_667 literal pool
         DS    0F
         LTORG
* Function ZZZ_667 page table
         DS    0F
PGT26    EQU   *
         DC    A(PG26)
         DS    0F
* X-func ZZZ_666 prologue
ZZZ@666  PDPPRLG CINDEX=27,FRAME=96,BASER=12,ENTRY=YES
         B     FEN27
         LTORG
FEN27    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG27     EQU   *
         LR    11,1
         L     10,=A(PGT27)
* Function ZZZ_666 code
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     3,8(2)
         L     2,20(3)
         LTR   2,2
         BNE   L589
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,20(3)
L589     EQU   *
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(ZZZ@553)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   24(4,2),=F'0'
* Function ZZZ_666 epilogue
         PDPEPIL
* Function ZZZ_666 literal pool
         DS    0F
         LTORG
* Function ZZZ_666 page table
         DS    0F
PGT27    EQU   *
         DC    A(PG27)
         DS    0F
* X-func ZZZ_624 prologue
ZZZ@624  PDPPRLG CINDEX=28,FRAME=104,BASER=12,ENTRY=YES
         B     FEN28
         LTORG
FEN28    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG28     EQU   *
         LR    11,1
         L     10,=A(PGT28)
* Function ZZZ_624 code
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,4(2)
         L     2,8(2)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,24(2)
         MVC   88(4,13),0(11)
         L     2,0(3)
         L     2,4(2)
         L     2,8(2)
         MVC   92(4,13),24(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(DO@JUMP)
         BALR  14,15
* Function ZZZ_624 epilogue
         PDPEPIL
* Function ZZZ_624 literal pool
         DS    0F
         LTORG
* Function ZZZ_624 page table
         DS    0F
PGT28    EQU   *
         DC    A(PG28)
         DS    0F
* X-func ZZZ_629 prologue
ZZZ@629  PDPPRLG CINDEX=29,FRAME=96,BASER=12,ENTRY=YES
         B     FEN29
         LTORG
FEN29    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG29     EQU   *
         LR    11,1
         L     10,=A(PGT29)
* Function ZZZ_629 code
         L     5,=V(CFUN)
         L     2,0(5)
         L     2,4(2)
         L     3,8(2)
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         L     2,24(3)
         LTR   2,2
         BE    L592
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
L592     EQU   *
         L     2,20(3)
         LTR   2,2
         BE    L593
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
L593     EQU   *
         L     2,0(5)
         L     2,4(2)
         L     6,8(2)
L595     EQU   *
         L     4,0(5)
         L     3,4(4)
         L     15,20(3)
         L     2,12(3)
         CLR   2,15
         BNE   L598
         MVC   12(4,3),4(15)
L598     EQU   *
         L     3,4(4)
         L     2,8(3)
         CLR   2,15
         BNE   L599
         MVC   8(4,3),4(15)
L599     EQU   *
         L     3,4(4)
         L     2,0(3)
         CLR   2,15
         BNE   L600
         MVC   0(4,3),4(15)
L600     EQU   *
         L     3,4(4)
         L     2,4(3)
         CLR   2,15
         BNE   L601
         MVC   4(4,3),4(15)
L601     EQU   *
         L     3,4(4)
         L     2,16(3)
         CLR   2,15
         BNE   L602
         MVC   16(4,3),4(15)
L602     EQU   *
         L     2,4(4)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(15)
         CLR   15,6
         BNE   L595
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
* Function ZZZ_629 epilogue
         PDPEPIL
* Function ZZZ_629 literal pool
         DS    0F
         LTORG
* Function ZZZ_629 page table
         DS    0F
PGT29    EQU   *
         DC    A(PG29)
         DS    0F
* X-func ZZZ_668 prologue
ZZZ@668  PDPPRLG CINDEX=30,FRAME=96,BASER=12,ENTRY=YES
         B     FEN30
         LTORG
FEN30    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG30     EQU   *
         LR    11,1
         L     10,=A(PGT30)
* Function ZZZ_668 code
         L     6,0(11)
         MVC   88(4,13),=F'64'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         LR    4,15
         MVC   16(4,15),=F'1'
         L     5,=V(CFUN)
         L     2,0(5)
         L     2,4(2)
         MVC   4(4,15),12(2)
         MVC   0(4,15),20(2)
         L     3,24(2)
         LR    7,3
         A     7,=F'1'
         ST    7,24(2)
         ST    7,8(4)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,20(4)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,24(4)
         MVC   28(4,4),20(4)
         LTR   6,6
         BNE   L605
         LR    15,6
L605     EQU   *
         ST    15,12(4)
         L     2,0(5)
         L     2,4(2)
         ST    4,12(2)
         ST    4,20(2)
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         MVC   88(4,13),=F'-96'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         MVC   88(4,13),20(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         LR    15,4
* Function ZZZ_668 epilogue
         PDPEPIL
* Function ZZZ_668 literal pool
         DS    0F
         LTORG
* Function ZZZ_668 page table
         DS    0F
PGT30    EQU   *
         DC    A(PG30)
         DS    0F
* X-func ZZZ_669 prologue
ZZZ@669  PDPPRLG CINDEX=31,FRAME=96,BASER=12,ENTRY=YES
         B     FEN31
         LTORG
FEN31    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG31     EQU   *
         LR    11,1
         L     10,=A(PGT31)
* Function ZZZ_669 code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(ZZZ@668)
         BALR  14,15
         LR    3,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,12(2)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,28(2)
         LR    15,3
* Function ZZZ_669 epilogue
         PDPEPIL
* Function ZZZ_669 literal pool
         DS    0F
         LTORG
* Function ZZZ_669 page table
         DS    0F
PGT31    EQU   *
         DC    A(PG31)
         DS    0F
* X-func ZZZ_670 prologue
ZZZ@670  PDPPRLG CINDEX=32,FRAME=96,BASER=12,ENTRY=YES
         B     FEN32
         LTORG
FEN32    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG32     EQU   *
         LR    11,1
         L     10,=A(PGT32)
* Function ZZZ_670 code
         MVC   88(4,13),=F'64'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         LR    3,15
         MVC   16(4,15),=F'1'
         L     5,=V(CFUN)
         L     2,0(5)
         L     2,4(2)
         MVC   4(4,15),12(2)
         MVC   0(4,15),20(2)
         L     4,24(2)
         LR    6,4
         A     6,=F'1'
         ST    6,24(2)
         ST    6,8(3)
         MVC   88(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         ST    15,20(3)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,24(3)
         ST    15,28(3)
         ST    15,12(3)
         L     2,0(5)
         L     2,4(2)
         ST    3,12(2)
         ST    3,20(2)
         LR    15,3
* Function ZZZ_670 epilogue
         PDPEPIL
* Function ZZZ_670 literal pool
         DS    0F
         LTORG
* Function ZZZ_670 page table
         DS    0F
PGT32    EQU   *
         DC    A(PG32)
         DS    0F
* X-func ZZZ_649 prologue
ZZZ@649  PDPPRLG CINDEX=33,FRAME=96,BASER=12,ENTRY=YES
         B     FEN33
         LTORG
FEN33    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG33     EQU   *
         LR    11,1
         L     10,=A(PGT33)
* Function ZZZ_649 code
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         MVC   88(4,13),=F'-94'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,12(2)
         MVC   88(4,13),28(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
* Function ZZZ_649 epilogue
         PDPEPIL
* Function ZZZ_649 literal pool
         DS    0F
         LTORG
* Function ZZZ_649 page table
         DS    0F
PGT33    EQU   *
         DC    A(PG33)
         DS    0F
* X-func ZZZ_630 prologue
ZZZ@630  PDPPRLG CINDEX=34,FRAME=104,BASER=12,ENTRY=YES
         B     FEN34
         LTORG
FEN34    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG34     EQU   *
         LR    11,1
         L     10,=A(PGT34)
* Function ZZZ_630 code
         L     9,=V(CFUN)
         L     2,0(9)
         L     2,4(2)
         L     2,12(2)
         L     6,20(2)
         CL    6,28(2)
         BNE   L610
         MVC   88(4,13),=F'-94'
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@571)
         BALR  14,15
L610     EQU   *
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    7,1(0,0)
         SLR   8,8
         LR    4,8
         LR    5,6
         LTR   6,6
         BE    L612
L629     EQU   *
         LH    2,0(5)
         CLM   2,3,=H'50'
         BNE   L614
         L     2,24(5)
         L     3,=F'-92'
         CLR   2,3
         BE    L612
         L     15,=F'-96'
         CLR   2,15
         BE    L630
         A     3,=F'6'
         CLR   2,3
         BNE   L619
         A     4,=F'1'
         B     L613
L619     EQU   *
         L     15,=F'-85'
         CR    2,15
         BNE   L621
         BCTR  4,0
         LTR   4,4
         BNL   L613
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'2651'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L621     EQU   *
         L     3,=F'-98'
         CLR   2,3
         BNE   L624
         A     8,=F'1'
         B     L613
L624     EQU   *
         L     15,=F'-97'
         CLR   2,15
         BNE   L613
         BCTR  8,0
         B     L613
L614     EQU   *
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L613
         SLR   7,7
L613     EQU   *
         L     5,12(5)
         LTR   5,5
         BNE   L629
L612     EQU   *
         LTR   5,5
         BE    L630
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BE    L630
         CLM   7,1,=XL1'00'
         BNE   L630
         LTR   4,4
         BNE   L630
         LTR   8,8
         BE    L631
         LA    3,1(0,0)
         CR    2,3
         BNH   L630
L631     EQU   *
         L     2,12(5)
         LTR   2,2
         BE    L630
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LTR   15,15
         BNE   L630
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    7,15
         LR    4,6
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'50'
         BNE   L632
         L     2,24(3)
         L     15,=F'-94'
         CLR   2,15
         BNE   L632
         LR    4,3
L632     EQU   *
         ST    7,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@563)
         BALR  14,15
         LTR   8,8
         BNE   L654
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    4,88(13)
         ST    5,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1820)
         BALR  14,15
         B     L634
L654     EQU   *
         LR    3,4
         LTR   4,4
         BE    L634
         SLR   4,4
         CLR   3,5
         BE    L639
         L     4,12(3)
L639     EQU   *
         LH    2,0(3)
         CLM   2,3,=H'50'
         BNE   L640
         L     2,24(3)
         A     2,=F'98'
         LA    8,1(0,0)
         CLR   2,8
         BNH   L654
L640     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    3,88(13)
         ST    3,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1820)
         BALR  14,15
         B     L654
L634     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@558)
         BALR  14,15
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@532)
         BALR  14,15
         LR    6,7
L630     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@553)
         BALR  14,15
         MVC   88(4,13),=F'-95'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         L     2,0(9)
         L     2,4(2)
         L     2,12(2)
         MVC   88(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         L     2,0(9)
         L     2,4(2)
         L     5,12(2)
L643     EQU   *
         L     4,0(9)
         L     3,4(4)
         L     15,20(3)
         L     2,12(3)
         CLR   2,15
         BNE   L646
         MVC   12(4,3),4(15)
L646     EQU   *
         L     3,4(4)
         L     2,8(3)
         CLR   2,15
         BNE   L647
         MVC   8(4,3),4(15)
L647     EQU   *
         L     3,4(4)
         L     2,0(3)
         CLR   2,15
         BNE   L648
         MVC   0(4,3),4(15)
L648     EQU   *
         L     3,4(4)
         L     2,4(3)
         CLR   2,15
         BNE   L649
         MVC   4(4,3),4(15)
L649     EQU   *
         L     3,4(4)
         L     2,16(3)
         CLR   2,15
         BNE   L650
         MVC   16(4,3),4(15)
L650     EQU   *
         L     2,4(4)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(15)
         CLR   15,5
         BNE   L643
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
* Function ZZZ_630 epilogue
         PDPEPIL
* Function ZZZ_630 literal pool
         DS    0F
         LTORG
* Function ZZZ_630 page table
         DS    0F
PGT34    EQU   *
         DC    A(PG34)
         DS    0F
* X-func ZZZ_631 prologue
ZZZ@631  PDPPRLG CINDEX=35,FRAME=96,BASER=12,ENTRY=YES
         B     FEN35
         LTORG
FEN35    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG35     EQU   *
         LR    11,1
         L     10,=A(PGT35)
* Function ZZZ_631 code
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         L     5,=V(CFUN)
         L     2,0(5)
         L     2,4(2)
         L     2,12(2)
         MVC   88(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         L     2,0(5)
         L     2,4(2)
         L     6,12(2)
L657     EQU   *
         L     4,0(5)
         L     3,4(4)
         L     15,20(3)
         L     2,12(3)
         CLR   2,15
         BNE   L660
         MVC   12(4,3),4(15)
L660     EQU   *
         L     3,4(4)
         L     2,8(3)
         CLR   2,15
         BNE   L661
         MVC   8(4,3),4(15)
L661     EQU   *
         L     3,4(4)
         L     2,0(3)
         CLR   2,15
         BNE   L662
         MVC   0(4,3),4(15)
L662     EQU   *
         L     3,4(4)
         L     2,4(3)
         CLR   2,15
         BNE   L663
         MVC   4(4,3),4(15)
L663     EQU   *
         L     3,4(4)
         L     2,16(3)
         CLR   2,15
         BNE   L664
         MVC   16(4,3),4(15)
L664     EQU   *
         L     2,4(4)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(15)
         CLR   15,6
         BNE   L657
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
* Function ZZZ_631 epilogue
         PDPEPIL
* Function ZZZ_631 literal pool
         DS    0F
         LTORG
* Function ZZZ_631 page table
         DS    0F
PGT35    EQU   *
         DC    A(PG35)
         DS    0F
* X-func ZZZ_1691 prologue
ZZZ@1691 PDPPRLG CINDEX=36,FRAME=88,BASER=12,ENTRY=YES
         B     FEN36
         LTORG
FEN36    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG36     EQU   *
         LR    11,1
         L     10,=A(PGT36)
* Function ZZZ_1691 code
         L     2,=V(FLAG@EXP)
         L     3,0(2)
         LA    15,1(0,0)
         LTR   3,3
         BNE   L665
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BE    L668
         L     4,=V(CFUN)
         L     2,0(4)
         LTR   2,2
         BE    L668
         L     2,4(2)
         LTR   2,2
         BE    L668
         L     2,12(2)
         LTR   2,2
         BNE   L667
L668     EQU   *
         SLR   15,15
         B     L665
L667     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1035)
         BALR  14,15
         LR    5,3
         LTR   15,15
         BE    L669
         L     2,0(4)
         L     2,4(2)
         L     2,12(2)
         L     2,20(2)
         L     4,4(15)
         S     4,4(2)
         L     3,=V(N@NON@FI)
         L     2,0(3)
         SLL   2,1
         A     2,0(3)
         CR    4,2
         BNL   L669
         LA    5,1(0,0)
L669     EQU   *
         LR    15,5
L665     EQU   *
* Function ZZZ_1691 epilogue
         PDPEPIL
* Function ZZZ_1691 literal pool
         DS    0F
         LTORG
* Function ZZZ_1691 page table
         DS    0F
PGT36    EQU   *
         DC    A(PG36)
         DS    0F
* X-func start_cleanup_deferral prologue
START@CL PDPPRLG CINDEX=37,FRAME=88,BASER=12,ENTRY=YES
         B     FEN37
         LTORG
FEN37    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG37     EQU   *
         LR    11,1
         L     10,=A(PGT37)
* Function start_cleanup_deferral code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         LTR   2,2
         BE    L670
         L     3,56(2)
         A     3,=F'1'
         ST    3,56(2)
L670     EQU   *
* Function start_cleanup_deferral epilogue
         PDPEPIL
* Function start_cleanup_deferral literal pool
         DS    0F
         LTORG
* Function start_cleanup_deferral page table
         DS    0F
PGT37    EQU   *
         DC    A(PG37)
         DS    0F
* X-func end_cleanup_deferral prologue
END@CLEA PDPPRLG CINDEX=38,FRAME=88,BASER=12,ENTRY=YES
         B     FEN38
         LTORG
FEN38    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG38     EQU   *
         LR    11,1
         L     10,=A(PGT38)
* Function end_cleanup_deferral code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         LTR   2,2
         BE    L672
         L     3,56(2)
         BCTR  3,0
         ST    3,56(2)
L672     EQU   *
* Function end_cleanup_deferral epilogue
         PDPEPIL
* Function end_cleanup_deferral literal pool
         DS    0F
         LTORG
* Function end_cleanup_deferral page table
         DS    0F
PGT38    EQU   *
         DC    A(PG38)
         DS    0F
* X-func ZZZ_661 prologue
ZZZ@661  PDPPRLG CINDEX=39,FRAME=104,BASER=12,ENTRY=YES
         B     FEN39
         LTORG
FEN39    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG39     EQU   *
         LR    11,1
         L     10,=A(PGT39)
* Function ZZZ_661 code
         L     2,0(11)
         L     3,4(11)
         MVC   88(4,13),=F'64'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         LR    5,15
         LR    8,2
         N     8,=F'1'
         SRL   2,1
         X     2,=F'1'
         N     2,=F'1'
         LTR   2,2
         BNE   L683
         LTR   3,3
         BE    L676
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'3419'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L683     EQU   *
         MVC   88(4,13),=F'-98'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         LR    6,15
         ST    3,20(15)
         B     L677
L676     EQU   *
         MVC   88(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         LR    6,15
L677     EQU   *
         MVC   16(4,5),=F'2'
         L     7,=V(CFUN)
         L     4,0(7)
         L     2,4(4)
         MVC   4(4,5),0(2)
         MVC   0(4,5),20(2)
         L     3,24(2)
         LR    9,3
         A     9,=F'1'
         ST    9,24(2)
         ST    9,8(5)
         MVC   24(4,5),=F'0'
         MVC   36(4,5),=F'0'
         MVC   48(4,5),=F'0'
         MVC   52(4,5),176(4)
         MVC   56(4,5),=F'0'
         ST    6,60(5)
         MVC   88(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         L     4,0(7)
         L     2,4(4)
         L     3,0(2)
         LTR   3,3
         BE    L678
         L     2,36(3)
         LTR   2,2
         BNE   L679
         L     2,40(3)
         LTR   2,2
         BE    L678
L679     EQU   *
         MVC   88(4,13),=F'0'
         L     2,4(4)
         L     2,0(2)
         MVC   92(4,13),36(2)
         L     2,4(4)
         L     2,0(2)
         MVC   96(4,13),40(2)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,40(5)
         B     L680
L678     EQU   *
         MVC   40(4,5),=F'0'
L680     EQU   *
         MVC   44(4,5),=F'0'
         L     3,0(7)
         L     2,4(3)
         MVC   32(4,5),4(2)
         ST    6,28(5)
         L     2,4(3)
         L     3,28(2)
         LR    4,3
         A     4,=F'1'
         ST    4,28(2)
         ST    4,20(5)
         LR    15,8
         LTR   8,8
         BE    L682
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
L682     EQU   *
         ST    15,12(5)
         L     2,0(7)
         L     2,4(2)
         ST    5,0(2)
         ST    5,20(2)
         LA    1,88(,13)
         L     15,=V(PUSH@TEM)
         BALR  14,15
* Function ZZZ_661 epilogue
         PDPEPIL
* Function ZZZ_661 literal pool
         DS    0F
         LTORG
* Function ZZZ_661 page table
         DS    0F
PGT39    EQU   *
         DC    A(PG39)
         DS    0F
* X-func ZZZ_672 prologue
ZZZ@672  PDPPRLG CINDEX=40,FRAME=96,BASER=12,ENTRY=YES
         B     FEN40
         LTORG
FEN40    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG40     EQU   *
         LR    11,1
         L     10,=A(PGT40)
* Function ZZZ_672 code
         LA    1,88(,13)
         L     15,=V(PUSH@TEM)
         BALR  14,15
         MVC   88(4,13),=F'2'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@661)
         BALR  14,15
         L     2,=V(CFUN)
         L     2,0(2)
         MVC   176(4,2),168(2)
* Function ZZZ_672 epilogue
         PDPEPIL
* Function ZZZ_672 literal pool
         DS    0F
         LTORG
* Function ZZZ_672 page table
         DS    0F
PGT40    EQU   *
         DC    A(PG40)
         DS    0F
* X-func is_body_block prologue
IS@BODY@ PDPPRLG CINDEX=41,FRAME=88,BASER=12,ENTRY=YES
         B     FEN41
         LTORG
FEN41    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG41     EQU   *
         LR    11,1
         L     10,=A(PGT41)
* Function is_body_block code
         L     3,0(11)
         SLR   15,15
         L     2,=V(LANG@HOO)
         CLI   105(2),0
         BNE   L685
         CLI   8(3),4
         BNE   L687
         L     2,24(3)
         LTR   2,2
         BE    L687
         CLI   8(2),4
         BNE   L687
         L     2,24(2)
         LTR   2,2
         BE    L687
         LA    15,1(0,0)
         CLI   8(2),30
         BE    L685
L687     EQU   *
         SLR   15,15
L685     EQU   *
* Function is_body_block epilogue
         PDPEPIL
* Function is_body_block literal pool
         DS    0F
         LTORG
* Function is_body_block page table
         DS    0F
PGT41    EQU   *
         DC    A(PG41)
         DS    0F
* X-func conditional_context prologue
CONDITIO PDPPRLG CINDEX=42,FRAME=88,BASER=12,ENTRY=YES
         B     FEN42
         LTORG
FEN42    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG42     EQU   *
         LR    11,1
         L     10,=A(PGT42)
* Function conditional_context code
         SLR   15,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         LTR   2,2
         BE    L691
         L     2,56(2)
         LTR   2,2
         BE    L691
         LA    15,1(0,0)
L691     EQU   *
* Function conditional_context epilogue
         PDPEPIL
* Function conditional_context literal pool
         DS    0F
         LTORG
* Function conditional_context page table
         DS    0F
PGT42    EQU   *
         DC    A(PG42)
         DS    0F
* X-func ZZZ_300 prologue
ZZZ@300  PDPPRLG CINDEX=43,FRAME=88,BASER=12,ENTRY=YES
         B     FEN43
         LTORG
FEN43    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG43     EQU   *
         LR    11,1
         L     10,=A(PGT43)
* Function ZZZ_300 code
         L     2,=V(CFUN)
         L     2,0(2)
         LR    15,2
         LTR   2,2
         BE    L694
         L     2,4(2)
         L     15,0(2)
L694     EQU   *
* Function ZZZ_300 epilogue
         PDPEPIL
* Function ZZZ_300 literal pool
         DS    0F
         LTORG
* Function ZZZ_300 page table
         DS    0F
PGT43    EQU   *
         DC    A(PG43)
         DS    0F
* Function expand_nl_handler_label,F14 prologue
@@F14    PDPPRLG CINDEX=44,FRAME=104,BASER=12,ENTRY=NO
         B     FEN44
         LTORG
FEN44    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG44     EQU   *
         LR    11,1
         L     10,=A(PGT44)
* Function expand_nl_handler_label code
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    3,15
         OC    0(4,15),=F'8'
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         MVC   88(4,13),=F'80'
         MVC   92(4,13),=F'6'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@987)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@550)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         LR    15,3
* Function expand_nl_handler_label epilogue
         PDPEPIL
* Function expand_nl_handler_label literal pool
         DS    0F
         LTORG
* Function expand_nl_handler_label page table
         DS    0F
PGT44    EQU   *
         DC    A(PG44)
LC28     EQU   *
         DC    X'0'
         DS    0F
* Function expand_nl_goto_receiver,F15 prologue
@@F15    PDPPRLG CINDEX=45,FRAME=104,BASER=12,ENTRY=NO
         B     FEN45
         LTORG
FEN45    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG45     EQU   *
         LR    11,1
         L     10,=A(PGT45)
* Function expand_nl_goto_receiver code
         MVC   88(4,13),=F'61'
         MVC   92(4,13),=F'0'
         L     3,=V(ZZZ@1074)
         MVC   96(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@953)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
         MVC   88(4,13),=F'62'
         MVC   92(4,13),=F'0'
         L     2,=V(ZZZ@1948)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@953)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
         MVC   88(4,13),24(3)
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         L     2,=V(ZZZ@713)
         IC    2,11(2)
         CLM   2,1,=XL1'00'
         BE    L697
         L     2,=V(CFUN)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(GET@ARG@)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@226)
         BALR  14,15
         MVC   88(4,13),20(3)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
L697     EQU   *
         MVC   88(4,13),=F'53'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=A(LC28)
         LA    1,88(,13)
         L     15,=V(ZZZ@979)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
* Function expand_nl_goto_receiver epilogue
         PDPEPIL
* Function expand_nl_goto_receiver literal pool
         DS    0F
         LTORG
* Function expand_nl_goto_receiver page table
         DS    0F
PGT45    EQU   *
         DC    A(PG45)
LC29     EQU   *
         DC    C'%Junused variable ''%D'''
         DC    X'0'
         DS    0F
* X-func warn_about_unused_variables prologue
WARN@ABO PDPPRLG CINDEX=46,FRAME=104,BASER=12,ENTRY=YES
         B     FEN46
         LTORG
FEN46    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG46     EQU   *
         LR    11,1
         L     10,=A(PGT46)
* Function warn_about_unused_variables code
         L     2,=V(ZZZ@2049)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L698
         L     3,0(11)
         LTR   3,3
         BE    L698
L704     EQU   *
         L     2,8(3)
         N     2,=F'-16744448'
         L     4,=F'570425344'
         CLR   2,4
         BNE   L702
         L     15,28(3)
         LR    2,15
         SRL   2,15
         N     2,=F'1'
         LTR   2,2
         BNE   L702
         L     2,44(3)
         LTR   2,2
         BE    L702
         SRL   15,9
         N     15,=F'1'
         LTR   15,15
         BNE   L702
         MVC   88(4,13),=A(LC29)
         ST    3,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L702     EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   L704
L698     EQU   *
* Function warn_about_unused_variables epilogue
         PDPEPIL
* Function warn_about_unused_variables literal pool
         DS    0F
         LTORG
* Function warn_about_unused_variables page table
         DS    0F
PGT46    EQU   *
         DC    A(PG46)
         DS    0F
* X-func save_stack_pointer prologue
SAVE@STA PDPPRLG CINDEX=47,FRAME=104,BASER=12,ENTRY=YES
         B     FEN47
         LTORG
FEN47    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG47     EQU   *
         LR    11,1
         L     10,=A(PGT47)
* Function save_stack_pointer code
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     3,0(2)
         L     2,24(3)
         LTR   2,2
         BNE   L706
         LR    15,2
         L     2,4(3)
         LTR   2,2
         BNE   L708
         LA    15,1(0,0)
L708     EQU   *
         ST    15,88(13)
         LR    2,3
         A     2,=F'24'
         ST    2,92(13)
         MVC   96(4,13),28(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@575)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         ST    3,4(2)
L706     EQU   *
* Function save_stack_pointer epilogue
         PDPEPIL
* Function save_stack_pointer literal pool
         DS    0F
         LTORG
* Function save_stack_pointer page table
         DS    0F
PGT47    EQU   *
         DC    A(PG47)
         DS    0F
* X-func ZZZ_611 prologue
ZZZ@611  PDPPRLG CINDEX=48,FRAME=120,BASER=12,ENTRY=YES
         B     FEN48
         LTORG
FEN48    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG48     EQU   *
         LR    11,1
         L     10,=A(PGT48)
* Function ZZZ_611 code
         L     4,0(11)
         L     5,4(4)
         IC    2,8(4)
         CLM   2,1,=XL1'20'
         BNE   L710
         IC    2,33(5)
         N     2,=F'127'
         STC   2,28(4)
         L     3,36(5)
         SLL   3,8
         SLR   2,2
         IC    2,39(4)
         OR    2,3
         ST    2,36(4)
         MVC   24(4,4),16(5)
         MVC   40(4,4),20(5)
         L     14,=A(L709)
         BR    14
L710     EQU   *
         CLM   2,1,=XL1'22'
         L     14,=A(L709)
         BNER  14
         L     3,8(4)
         LR    2,3
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L709)
         BNER  14
         L     15,28(4)
         LR    2,15
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L709)
         BNER  14
         L     2,=V(GLOBAL@T)
         CL    5,0(2)
         BNE   L714
         MVC   88(4,13),=F'1'
         L     2,=V(ZZZ@206)
         MVC   92(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@992)
         BALR  14,15
         ST    4,88(13)
         ST    15,92(13)
         B     L747
L714     EQU   *
         L     2,24(4)
         LTR   2,2
         BNE   L716
         L     2,60(4)
         LTR   2,2
         BNE   L717
         MVC   88(4,13),=F'1'
         L     2,=V(ZZZ@206)
         MVC   92(4,13),256(2)
         B     L746
L717     EQU   *
         MVC   88(4,13),=F'6'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         MVC   88(4,13),=F'1'
         ST    15,92(13)
L746     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@992)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@1891)
         BALR  14,15
         ST    4,88(13)
         ST    2,92(13)
L747     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1886)
         BALR  14,15
         B     L709
L716     EQU   *
         CLI   28(4),1
         BE    L720
         L     2,=V(FLAG@FLO)
         L     2,0(2)
         LTR   2,2
         BE    L721
         CLI   8(5),7
         BE    L720
L721     EQU   *
         SRL   3,20
         N     3,=F'1'
         LTR   3,3
         BNE   L720
         LR    3,15
         SRL   3,22
         N     3,=F'1'
         LTR   3,3
         BNE   L720
         LR    2,15
         N     2,=F'2097664'
         LTR   2,2
         BNE   L722
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BE    L720
L722     EQU   *
         L     2,8(5)
         SRL   2,18
         N     2,=F'1'
         ST    2,112(13)
         ST    5,88(13)
         SRL   15,24
         ST    15,92(13)
         LR    6,13
         A     6,=F'112'
         ST    6,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(PROMOTE@)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1886)
         BALR  14,15
         L     2,28(4)
         SRL   2,9
         N     2,=F'1'
         LTR   2,2
         BNE   L723
         L     2,80(4)
         LTR   2,2
         BNE   L724
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L724     EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(MARK@USE)
         BALR  14,15
L723     EQU   *
         IC    2,8(5)
         CLM   2,1,=XL1'0D'
         BE    L726
         CLM   2,1,=XL1'0F'
         BNE   L725
L726     EQU   *
         L     2,80(4)
         LTR   2,2
         BNE   L727
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L727     EQU   *
         ST    2,88(13)
         L     2,4(4)
         L     2,4(2)
         MVC   92(4,13),36(2)
         LA    1,88(,13)
         L     15,=V(MARK@REG)
         BALR  14,15
L725     EQU   *
         L     2,80(4)
         LTR   2,2
         BNE   L728
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L728     EQU   *
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(MAYBE@SE)
         BALR  14,15
         L     2,8(4)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    L709
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PUT@VAR@)
         BALR  14,15
         B     L709
L720     EQU   *
         L     3,40(4)
         CLI   8(3),25
         BNE   L731
         L     2,=V(FLAG@STA)
         L     2,0(2)
         LTR   2,2
         BE    L732
         ST    3,88(13)
         MVC   92(4,13),=F'40'
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BH    L731
L732     EQU   *
         SLR   5,5
         L     3,80(4)
         LTR   3,3
         BE    L733
         LH    2,0(3)
         CLM   2,3,=H'79'
         BNE   L735
         L     3,4(3)
         LH    2,0(3)
         CLM   2,3,=H'74'
         BE    L738
L735     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'3996'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L738     EQU   *
         LR    5,3
L733     EQU   *
         LA    3,64(0,0)
         CLI   28(4),1
         BE    L740
         SLR   3,3
         IC    3,28(4)
         L     2,=V(MODE@SIZ)
         SLR   6,6
         IC    6,0(2,3)
         LR    3,6
         SLL   3,3
L740     EQU   *
         SLL   3,8
         SLR   2,2
         IC    2,39(4)
         OR    2,3
         ST    2,36(4)
         NC    32(4,4),=F'-1073741825'
         ST    4,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSIGN@T)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@1891)
         BALR  14,15
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1886)
         BALR  14,15
         LTR   5,5
         BE    L709
         L     2,80(4)
         LTR   2,2
         BNE   L742
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L742     EQU   *
         MVC   88(4,13),4(2)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         CLR   15,5
         BE    L709
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         B     L709
L731     EQU   *
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(SAVE@STA)
         BALR  14,15
         CLI   8(5),18
         BNE   L745
         L     2,12(5)
         LTR   2,2
         BE    L745
         MVC   88(4,13),60(2)
         L     2,=V(ZZZ@206)
         MVC   92(4,13),256(2)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
L745     EQU   *
         MVC   88(4,13),40(4)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(ZZZ@868)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         L     2,4(4)
         MVC   96(4,13),36(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@20)
         BALR  14,15
         SLR   2,2
         IC    2,28(4)
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@992)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@1891)
         BALR  14,15
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1886)
         BALR  14,15
         SLR   2,2
         IC    2,39(4)
         O     2,=F'16384'
         ST    2,36(4)
         NC    32(4,4),=F'-1073741825'
L709     EQU   *
* Function ZZZ_611 epilogue
         PDPEPIL
* Function ZZZ_611 literal pool
         DS    0F
         LTORG
* Function ZZZ_611 page table
         DS    0F
PGT48    EQU   *
         DC    A(PG48)
         DS    0F
* X-func ZZZ_614 prologue
ZZZ@614  PDPPRLG CINDEX=49,FRAME=104,BASER=12,ENTRY=YES
         B     FEN49
         LTORG
FEN49    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG49     EQU   *
         LR    11,1
         L     10,=A(PGT49)
* Function ZZZ_614 code
         L     5,0(11)
         L     2,8(5)
         LR    4,2
         SRL   4,15
         N     4,=F'1'
         CLI   8(5),32
         BE    L748
         LR    3,2
         SRL   3,13
         N     3,=F'1'
         LTR   3,3
         BNE   L748
         LA    1,88(,13)
         L     15,=V(PUSH@TEM)
         BALR  14,15
         L     6,=V(GLOBAL@T)
         L     2,60(5)
         CL    2,0(6)
         BNE   L751
         L     2,4(5)
         SLR   15,15
         IC    15,8(2)
         LR    2,15
         A     2,=F'-6'
         LA    3,1(0,0)
         CLR   2,3
         BNH   L753
         LA    2,10(0,0)
         CLR   15,2
         BE    L753
         LA    3,13(0,0)
         CLR   15,3
         BE    L753
         LA    2,15(0,0)
         CLR   15,2
         BNE   L756
L753     EQU   *
         MVC   88(4,13),4(5)
         MVC   92(4,13),44(6)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    5,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         B     L757
L751     EQU   *
         LTR   2,2
         BE    L754
         CLI   8(2),2
         BE    L754
         MVC   88(8,13),12(5)
         LA    1,88(,13)
         L     15,=V(EMIT@LIN)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),60(5)
         ST    3,96(13)
L757     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@588)
         BALR  14,15
L756     EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
L754     EQU   *
         N     4,=F'1'
         SLL   4,15
         L     2,8(5)
         N     2,=F'-32769'
         OR    2,4
         ST    2,8(5)
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1692)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@868)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(POP@TEMP)
         BALR  14,15
L748     EQU   *
* Function ZZZ_614 epilogue
         PDPEPIL
* Function ZZZ_614 literal pool
         DS    0F
         LTORG
* Function ZZZ_614 page table
         DS    0F
PGT49    EQU   *
         DC    A(PG49)
         DS    0F
* X-func ZZZ_612 prologue
ZZZ@612  PDPPRLG CINDEX=50,FRAME=112,BASER=12,ENTRY=YES
         B     FEN50
         LTORG
FEN50    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG50     EQU   *
         LR    11,1
         L     10,=A(PGT50)
* Function ZZZ_612 code
         L     7,4(11)
         L     3,=V(CFUN)
         L     2,0(3)
         LTR   2,2
         BE    L760
         L     2,4(2)
         L     6,0(2)
         LTR   6,6
         BNE   L759
L760     EQU   *
         SLR   15,15
         B     L758
L759     EQU   *
         LTR   7,7
         BE    L761
         LR    9,6
         A     9,=F'36'
         LA    1,88(,13)
         L     15,=A(CONDITIO)
         BALR  14,15
         LR    8,15
         LTR   15,15
         BE    L762
         L     5,=V(WORD@MOD)
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         ST    3,88(13)
         L     4,=V(ZZZ@206)
         MVC   92(4,13),256(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),60(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@546)
         BALR  14,15
         ST    15,60(6)
         ST    3,88(13)
         MVC   92(4,13),260(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         L     4,=V(LANG@HOO)
         MVC   88(4,13),0(5)
         MVC   92(4,13),=F'1'
         L     2,296(4)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         MVC   88(4,13),=F'34'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@72)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1886)
         BALR  14,15
         ST    2,88(13)
         L     2,60(4)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         MVC   88(4,13),=F'52'
         L     2,=V(GLOBAL@T)
         MVC   92(4,13),144(2)
         ST    15,96(13)
         ST    7,100(13)
         MVC   104(4,13),44(2)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    7,15
L762     EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1988)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         MVC   96(4,13),0(9)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         LR    3,15
         ST    15,0(9)
         LTR   8,8
         BNE   L770
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         ST    6,4(2)
         B     L764
L770     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
L764     EQU   *
         L     2,=A(@@V1)
         L     2,0(2)
         LTR   2,2
         BNE   L765
         OC    8(4,3),=F'2097152'
         B     L766
L765     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@622)
         BALR  14,15
L766     EQU   *
         LTR   8,8
         BE    L767
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LTR   2,2
         BE    L761
         ST    2,88(13)
         MVC   92(4,13),60(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@546)
         BALR  14,15
         ST    15,60(6)
         B     L761
L767     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    15,60(6)
         MVC   88(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
L761     EQU   *
         LA    15,1(0,0)
L758     EQU   *
* Function ZZZ_612 epilogue
         PDPEPIL
* Function ZZZ_612 literal pool
         DS    0F
         LTORG
* Function ZZZ_612 page table
         DS    0F
PGT50    EQU   *
         DC    A(PG50)
         DS    0F
* X-func ZZZ_613 prologue
ZZZ@613  PDPPRLG CINDEX=51,FRAME=96,BASER=12,ENTRY=YES
         B     FEN51
         LTORG
FEN51    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG51     EQU   *
         LR    11,1
         L     10,=A(PGT51)
* Function ZZZ_613 code
         L     2,4(11)
         L     4,8(11)
         MVC   88(4,13),0(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@612)
         BALR  14,15
         LTR   2,2
         BE    L772
         LTR   15,15
         BE    L772
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         L     3,36(2)
         N     4,=F'1'
         SLL   4,13
         L     2,8(3)
         N     2,=F'-8193'
         OR    2,4
         ST    2,8(3)
L772     EQU   *
* Function ZZZ_613 epilogue
         PDPEPIL
* Function ZZZ_613 literal pool
         DS    0F
         LTORG
* Function ZZZ_613 page table
         DS    0F
PGT51    EQU   *
         DC    A(PG51)
         DS    0F
* X-func ZZZ_585 prologue
ZZZ@585  PDPPRLG CINDEX=52,FRAME=112,BASER=12,ENTRY=YES
         B     FEN52
         LTORG
FEN52    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG52     EQU   *
         LR    11,1
         L     10,=A(PGT52)
* Function ZZZ_585 code
         L     7,0(11)
         L     3,8(11)
         L     2,=V(CFUN)
         L     2,0(2)
         LR    8,2
         LTR   2,2
         BE    L775
         L     2,4(2)
         L     8,0(2)
         B     L775
L800     EQU   *
         OC    8(4,7),=F'2097152'
         B     L777
L775     EQU   *
         LR    5,3
L801     EQU   *
         LTR   5,5
         BE    L777
         L     2,16(5)
         L     2,8(2)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L800
         L     5,0(5)
         B     L801
L777     EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@611)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(ZZZ@612)
         BALR  14,15
         L     6,80(7)
         LTR   6,6
         BNE   L781
         ST    7,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     6,80(7)
L781     EQU   *
         LR    5,3
         LTR   3,3
         BE    L799
L796     EQU   *
         L     4,16(5)
         L     9,12(5)
         L     2,4(4)
         LH    15,32(2)
         N     15,=F'127'
         L     2,8(4)
         SRL   2,15
         N     2,=F'1'
         LTR   2,2
         BE    L785
         OC    8(4,7),=F'32768'
L785     EQU   *
         L     3,36(7)
         N     3,=F'-256'
         SLR   2,2
         IC    2,39(4)
         OR    2,3
         ST    2,36(4)
         L     3,32(7)
         N     3,=F'1073741824'
         L     2,32(4)
         N     2,=F'-1073741825'
         OR    2,3
         ST    2,32(4)
         LA    2,1(0,0)
         CLR   15,2
         BNE   L786
         CLI   28(7),1
         BE    L786
         MVC   88(4,13),24(4)
         MVC   92(4,13),=F'2'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1576)
         BALR  14,15
         STC   15,28(4)
L786     EQU   *
         LH    2,0(6)
         CLM   2,3,=H'79'
         BNE   L787
         SLR   2,2
         IC    2,2(6)
         CLR   15,2
         BE    L803
         ST    6,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@6)
         BALR  14,15
         B     L804
L787     EQU   *
         CLM   2,3,=H'74'
         BNE   L791
         SLR   2,2
         IC    2,2(6)
         CLR   15,2
         BNE   L792
L803     EQU   *
         ST    4,88(13)
         ST    6,92(13)
         B     L802
L792     EQU   *
         ST    15,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@926)
         BALR  14,15
L804     EQU   *
         ST    4,88(13)
         ST    15,92(13)
         B     L802
L791     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'4284'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L802     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1886)
         BALR  14,15
         L     2,4(11)
         LTR   2,2
         BE    L784
         ST    4,88(13)
         ST    9,92(13)
         MVC   96(4,13),36(8)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,36(8)
L784     EQU   *
         L     5,0(5)
         LTR   5,5
         BNE   L796
L799     EQU   *
* Function ZZZ_585 epilogue
         PDPEPIL
* Function ZZZ_585 literal pool
         DS    0F
         LTORG
* Function ZZZ_585 page table
         DS    0F
PGT52    EQU   *
         DC    A(PG52)
         DS    0F
* Function expand_cleanups,F17 prologue
@@F17    PDPPRLG CINDEX=53,FRAME=112,BASER=12,ENTRY=NO
         B     FEN53
         LTORG
FEN53    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG53     EQU   *
         LR    11,1
         L     10,=A(PGT53)
* Function expand_cleanups code
         L     5,4(11)
         L     6,8(11)
         L     4,0(11)
         LTR   4,4
         BE    L818
L816     EQU   *
         L     3,16(4)
         CLI   8(3),2
         BNE   L809
         ST    3,88(13)
         ST    5,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         B     L808
L809     EQU   *
         LTR   5,5
         BNE   L812
         L     2,=A(@@V1)
         L     2,0(2)
         LTR   2,2
         BE    L812
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@618)
         BALR  14,15
L812     EQU   *
         LTR   6,6
         BE    L808
         L     3,8(4)
         SRL   3,13
         N     3,=F'1'
         LTR   3,3
         BNE   L808
         LTR   5,5
         BE    L814
         L     2,=A(@@V1)
         L     2,0(2)
         LTR   2,2
         BE    L814
         LA    1,88(,13)
         L     15,=V(ZZZ@622)
         BALR  14,15
         MVC   88(4,13),16(4)
         L     2,=V(ZZZ@206)
         MVC   92(4,13),256(2)
         ST    3,96(13)
         ST    3,100(13)
         ST    3,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@619)
         BALR  14,15
         B     L815
L814     EQU   *
         MVC   88(4,13),16(4)
         L     2,=V(ZZZ@206)
         MVC   92(4,13),256(2)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
L815     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@868)
         BALR  14,15
L808     EQU   *
         L     4,0(4)
         LTR   4,4
         BNE   L816
L818     EQU   *
* Function expand_cleanups epilogue
         PDPEPIL
* Function expand_cleanups literal pool
         DS    0F
         LTORG
* Function expand_cleanups page table
         DS    0F
PGT53    EQU   *
         DC    A(PG53)
LC30     EQU   *
         DC    C'%Jlabel ''%D'' used before containing binding co'
         DC    C'ntour'
         DC    X'0'
         DS    0F
* Function fixup_gotos,F3 prologue
@@F3     PDPPRLG CINDEX=54,FRAME=104,BASER=12,ENTRY=NO
         B     FEN54
         LTORG
FEN54    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG54     EQU   *
         LR    11,1
         L     10,=A(PGT54)
* Function fixup_gotos code
         L     8,0(11)
         L     7,4(11)
         SLR   3,3
         L     9,=V(CFUN)
         L     2,0(9)
         L     2,4(2)
         L     4,56(2)
L858     EQU   *
         LTR   4,4
         BE    L852
         L     6,4(4)
         LTR   6,6
         BNE   L823
         LTR   3,3
         BE    L822
         MVC   0(4,3),0(4)
         B     L822
L823     EQU   *
         L     3,16(4)
         L     2,8(3)
         LTR   2,2
         BE    L822
         L     5,8(4)
         LTR   5,5
         BE    L827
         L     2,16(11)
         LTR   2,2
         BH    L828
         BNE   L829
         LTR   7,7
         BNE   L828
L829     EQU   *
         L     15,8(11)
         LTR   15,15
         BE    L827
L828     EQU   *
         L     15,12(11)
         L     2,4(15)
         C     2,4(3)
         BNL   L827
         C     2,4(6)
         BNH   L827
         L     2,28(5)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L827
         MVC   88(4,13),=A(LC30)
         MVC   92(4,13),8(4)
         MVC   96(4,13),8(4)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     2,8(4)
         OC    28(4,2),=F'2097152'
L827     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         L     5,=V(LANG@HOO)
         MVC   88(4,13),=F'0'
         L     2,244(5)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         MVC   88(4,13),12(4)
         L     2,260(5)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     2,28(4)
         LTR   2,2
         BE    L830
         LR    3,2
L835     EQU   *
         L     2,8(3)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    L833
         L     2,16(3)
         LTR   2,2
         BE    L833
         ST    2,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
L833     EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   L835
L830     EQU   *
         L     2,24(4)
         LTR   2,2
         BE    L836
         L     3,0(9)
         L     2,16(4)
         CL    2,92(3)
         BNE   L837
         L     2,=V(ZZZ@289)
         L     2,0(2)
         L     2,4(2)
         CLI   8(2),23
         BNE   L837
         L     2,32(2)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         BNE   L836
L837     EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),24(4)
         MVC   96(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@574)
         BALR  14,15
L836     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         L     2,248(5)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@546)
         BALR  14,15
         MVC   4(4,4),=F'0'
L822     EQU   *
         LR    3,4
         L     4,0(4)
         B     L858
L852     EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     4,56(2)
         LTR   4,4
         BE    L855
L850     EQU   *
         L     2,4(4)
         LTR   2,2
         BE    L841
         L     2,16(4)
         L     2,8(2)
         LTR   2,2
         BNE   L841
         LTR   8,8
         BE    L841
         L     2,20(8)
         C     2,20(4)
         BH    L841
         L     5,28(4)
L859     EQU   *
         LTR   5,5
         BE    L857
         L     2,0(5)
         CL    2,40(8)
         BNE   L845
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         L     3,=V(LANG@HOO)
         MVC   88(4,13),=F'0'
         L     2,244(3)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         MVC   88(4,13),12(4)
         L     2,260(3)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         MVC   88(4,13),16(5)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    6,15
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         L     2,248(3)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LTR   6,6
         BE    L847
         ST    6,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@546)
         BALR  14,15
         ST    15,4(4)
L847     EQU   *
         MVC   28(4,4),0(5)
L845     EQU   *
         L     5,0(5)
         B     L859
L857     EQU   *
         LTR   7,7
         BE    L841
         ST    7,24(4)
L841     EQU   *
         L     4,0(4)
         LTR   4,4
         BNE   L850
L855     EQU   *
* Function fixup_gotos epilogue
         PDPEPIL
* Function fixup_gotos literal pool
         DS    0F
         LTORG
* Function fixup_gotos page table
         DS    0F
PGT54    EQU   *
         DC    A(PG54)
         DS    0F
* X-func ZZZ_642 prologue
ZZZ@642  PDPPRLG CINDEX=55,FRAME=112,BASER=12,ENTRY=YES
         B     FEN55
         LTORG
FEN55    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG55     EQU   *
         LR    11,1
         L     10,=A(PGT55)
* Function ZZZ_642 code
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),0(11)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
* Function ZZZ_642 epilogue
         PDPEPIL
* Function ZZZ_642 literal pool
         DS    0F
         LTORG
* Function ZZZ_642 page table
         DS    0F
PGT55    EQU   *
         DC    A(PG55)
LC31     EQU   *
         DC    C'jump to `%s'' invalidly jumps into binding conto'
         DC    C'ur'
         DC    X'0'
         DS    0F
* Function expand_goto_internal,F1 prologue
@@F1     PDPPRLG CINDEX=56,FRAME=104,BASER=12,ENTRY=NO
         B     FEN56
         LTORG
FEN56    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG56     EQU   *
         LR    11,1
         L     10,=A(PGT56)
* Function expand_goto_internal code
         L     8,4(11)
         L     7,8(11)
         SLR   4,4
         LH    2,0(8)
         CLM   2,3,=H'49'
         BE    L862
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'704'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L862     EQU   *
         L     2,8(8)
         L     3,=V(CFUN)
         LTR   2,2
         BE    L863
         LR    5,3
         L     2,0(3)
         L     2,4(2)
         L     3,0(2)
         LTR   3,3
         BE    L871
L870     EQU   *
         L     2,28(3)
         L     2,4(2)
         C     2,4(8)
         BL    L865
         L     2,24(3)
         LTR   2,2
         BE    L868
         LR    4,2
L868     EQU   *
         L     2,36(3)
         LTR   2,2
         BE    L866
         ST    2,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
L866     EQU   *
         L     3,4(3)
         LTR   3,3
         BNE   L870
L865     EQU   *
         LTR   4,4
         BE    L871
         LA    1,88(,13)
         L     15,=V(CLEAR@PE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         L     2,0(5)
         CL    8,92(2)
         BNE   L872
         L     2,=V(ZZZ@289)
         L     2,0(2)
         L     2,4(2)
         CLI   8(2),23
         BNE   L872
         L     2,32(2)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         BNE   L871
L872     EQU   *
         MVC   88(4,13),=F'0'
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@574)
         BALR  14,15
L871     EQU   *
         L     2,0(11)
         LTR   2,2
         BE    L875
         LR    3,2
         L     2,28(2)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    L875
         MVC   88(4,13),=A(LC31)
         L     2,44(3)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     L875
L863     EQU   *
         L     2,0(3)
         L     2,4(2)
         L     2,8(2)
         LTR   2,2
         BE    L877
         CL    8,20(2)
         BE    L878
         CL    8,24(2)
         BNE   L877
L878     EQU   *
         LR    5,2
         B     L879
L877     EQU   *
         L     2,0(3)
         L     2,4(2)
         L     2,12(2)
         LTR   2,2
         BE    L880
         CL    8,20(2)
         BE    L881
         CL    8,24(2)
         BE    L881
         CL    8,28(2)
         BNE   L880
L881     EQU   *
         L     2,0(3)
         L     2,4(2)
         L     5,12(2)
         B     L879
L880     EQU   *
         SLR   5,5
         B     L883
L879     EQU   *
         LTR   5,5
         BE    L883
         L     3,0(5)
         L     6,=V(CFUN)
         L     2,0(6)
         L     2,4(2)
         L     4,0(2)
         B     L919
L918     EQU   *
         CLR   3,4
         BE    L885
         L     3,0(3)
L919     EQU   *
         LTR   3,3
         BNE   L918
L885     EQU   *
         LTR   3,3
         BNE   L917
         L     2,0(6)
         L     2,4(2)
         L     2,0(2)
         L     3,4(2)
         LR    4,2
L920     EQU   *
         CLR   4,5
         BE    L915
         CLR   4,3
         BNE   L891
         L     3,4(4)
L891     EQU   *
         L     4,0(4)
         B     L920
L915     EQU   *
         LR    5,3
L883     EQU   *
         L     15,=V(CFUN)
         L     2,0(15)
         L     2,4(2)
         L     4,0(2)
L921     EQU   *
         CLR   4,5
         BE    L895
         L     2,24(4)
         LTR   2,2
         BNE   L895
         L     2,36(4)
         LTR   2,2
         BNE   L895
         L     4,4(4)
         B     L921
L895     EQU   *
         CLR   4,5
         BE    L900
         MVC   88(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         LR    6,15
         LTR   7,7
         BNE   L901
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
L901     EQU   *
         MVC   8(4,6),0(11)
         ST    8,16(6)
         LTR   7,7
         BNE   L902
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LR    7,15
L902     EQU   *
         MVC   88(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(MAKE@NOD)
         BALR  14,15
         LR    5,15
         OC    8(4,15),=F'32768'
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,244(2)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         BNE   L903
         ST    15,88(13)
         L     2,=V(LANG@HOO)
         L     2,256(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         B     L904
L903     EQU   *
         L     2,=V(ZZZ@289)
         L     3,0(2)
         L     2,60(3)
         MVC   0(4,15),0(2)
         L     2,60(3)
         ST    15,0(2)
L904     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         MVC   88(4,13),=F'-98'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         LR    3,15
         L     9,=V(CFUN)
         L     2,0(9)
         L     2,244(2)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         BE    L905
         ST    5,20(15)
L905     EQU   *
         MVC   88(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         ST    15,4(6)
         MVC   88(4,13),=F'-97'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         L     2,0(9)
         L     2,244(2)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         BE    L906
         ST    5,20(15)
L906     EQU   *
         ST    5,12(6)
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    3,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@546)
         BALR  14,15
         L     2,0(9)
         L     2,4(2)
         MVC   20(4,6),28(2)
         MVC   24(4,6),=F'0'
         L     2,40(4)
         LTR   2,2
         BNE   L909
         L     2,36(4)
         LTR   2,2
         BE    L908
L909     EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),36(4)
         MVC   96(4,13),40(4)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         LR    2,15
L908     EQU   *
         ST    2,28(6)
         L     15,=V(CFUN)
         L     2,0(15)
         L     2,4(2)
         MVC   0(4,6),56(2)
         ST    6,56(2)
L900     EQU   *
         LR    2,4
         LTR   4,4
         BE    L910
         LA    2,1(0,0)
L910     EQU   *
         LTR   2,2
         BNE   L875
L917     EQU   *
         L     2,0(11)
         LTR   2,2
         BE    L875
         OC    8(4,2),=F'2097152'
L875     EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@553)
         BALR  14,15
* Function expand_goto_internal epilogue
         PDPEPIL
* Function expand_goto_internal literal pool
         DS    0F
         LTORG
* Function expand_goto_internal page table
         DS    0F
PGT56    EQU   *
         DC    A(PG56)
         DS    0F
* X-func ZZZ_1620 prologue
ZZZ@1620 PDPPRLG CINDEX=57,FRAME=120,BASER=12,ENTRY=YES
         B     FEN57
         LTORG
FEN57    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG57     EQU   *
         LR    11,1
         L     10,=A(PGT57)
* Function ZZZ_1620 code
         L     2,=V(ZZZ@289)
         L     2,0(2)
         L     7,52(2)
         L     5,0(11)
         LR    4,7
         SLR   8,8
         B     L975
L974     EQU   *
         LTR   4,4
         BE    L925
         L     2,16(5)
         L     2,4(2)
         L     3,4(4)
         L     2,68(2)
         CL    2,68(3)
         BNE   L970
         L     2,80(4)
         LTR   2,2
         BNE   L931
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L931     EQU   *
         LH    2,0(2)
         CLM   2,3,=H'74'
         BNE   L970
         CLI   28(4),1
         BE    L970
         L     5,0(5)
         L     4,0(4)
         A     8,=F'1'
L975     EQU   *
         LTR   5,5
         BNE   L974
L925     EQU   *
         LTR   5,5
         BNE   L970
         LTR   4,4
         BE    L933
L970     EQU   *
         SLR   5,5
         B     L923
L933     EQU   *
         SLL   8,2
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    9,15
         L     5,0(11)
         LTR   5,5
         BE    L964
         LR    2,15
L938     EQU   *
         MVC   88(4,13),16(5)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    15,0(2)
         L     5,0(5)
         A     2,=F'4'
         LTR   5,5
         BNE   L938
L964     EQU   *
         L     5,0(11)
         SLR   8,8
         LTR   5,5
         BE    L966
         LR    3,9
L949     EQU   *
         LR    4,7
         SLR   6,6
L976     EQU   *
         CR    6,8
         BNL   L941
         L     2,80(4)
         LTR   2,2
         BNE   L946
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L946     EQU   *
         ST    2,88(13)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BNE   L973
         L     4,0(4)
         A     6,=F'1'
         B     L976
L973     EQU   *
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@226)
         BALR  14,15
         ST    15,0(3)
L941     EQU   *
         L     5,0(5)
         A     8,=F'1'
         A     3,=F'4'
         LTR   5,5
         BNE   L949
L966     EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         LR    4,7
         L     5,0(11)
         SLR   8,8
L977     EQU   *
         LTR   4,4
         BE    L969
         L     2,80(4)
         LTR   2,2
         BNE   L954
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L954     EQU   *
         LR    7,8
         SLL   7,2
         L     15,0(7,9)
         CLC   2(1,2),2(15)
         BNE   L953
         L     2,80(4)
         LTR   2,2
         BNE   L955
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L955     EQU   *
         ST    2,88(13)
         L     7,0(7,9)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         B     L952
L953     EQU   *
         LR    6,15
         L     2,16(5)
         L     3,4(2)
         L     2,8(3)
         SRL   2,18
         N     2,=F'1'
         ST    2,112(13)
         ST    3,88(13)
         SLR   2,2
         IC    2,2(15)
         ST    2,92(13)
         LR    2,13
         A     2,=F'112'
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PROMOTE@)
         BALR  14,15
         L     2,80(4)
         LTR   2,2
         BNE   L958
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L958     EQU   *
         CLC   28(1,4),2(2)
         BE    L957
         SLR   2,2
         IC    2,28(4)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    6,15
         ST    15,88(13)
         L     7,0(7,9)
         ST    7,92(13)
         MVC   96(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@211)
         BALR  14,15
L957     EQU   *
         L     2,80(4)
         LTR   2,2
         BNE   L959
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,80(4)
L959     EQU   *
         ST    2,88(13)
         ST    6,92(13)
         MVC   96(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@211)
         BALR  14,15
L952     EQU   *
         L     4,0(4)
         L     5,0(5)
         A     8,=F'1'
         B     L977
L969     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@868)
         BALR  14,15
         LA    5,1(0,0)
         L     4,=V(CFUN)
         L     3,0(4)
         L     2,120(3)
         LTR   2,2
         BNE   L961
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,120(3)
         L     2,0(4)
         MVC   88(4,13),120(2)
         MVC   92(4,13),124(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@562)
         BALR  14,15
L961     EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         MVC   88(4,13),=F'0'
         L     2,0(4)
         MVC   92(4,13),120(2)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@530)
         BALR  14,15
L923     EQU   *
         LR    15,5
* Function ZZZ_1620 epilogue
         PDPEPIL
* Function ZZZ_1620 literal pool
         DS    0F
         LTORG
* Function ZZZ_1620 page table
         DS    0F
PGT57    EQU   *
         DC    A(PG57)
         DS    0F
* Function expand_null_return_1,F12 prologue
@@F12    PDPPRLG CINDEX=58,FRAME=104,BASER=12,ENTRY=NO
         B     FEN58
         LTORG
FEN58    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG58     EQU   *
         LR    11,1
         L     10,=A(PGT58)
* Function expand_null_return_1 code
         L     3,=V(CFUN)
         L     15,0(3)
         L     2,88(15)
         LTR   2,2
         BNE   L979
         L     2,92(15)
L979     EQU   *
         LA    1,88(,13)
         L     15,=V(CLEAR@PE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
         LTR   2,2
         BNE   L980
         L     2,0(3)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,92(2)
         LR    2,15
L980     EQU   *
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
* Function expand_null_return_1 epilogue
         PDPEPIL
* Function expand_null_return_1 literal pool
         DS    0F
         LTORG
* Function expand_null_return_1 page table
         DS    0F
PGT58    EQU   *
         DC    A(PG58)
         DS    0F
* Function expand_value_return,F11 prologue
@@F11    PDPPRLG CINDEX=59,FRAME=112,BASER=12,ENTRY=NO
         B     FEN59
         LTORG
FEN59    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG59     EQU   *
         LR    11,1
         L     10,=A(PGT59)
* Function expand_value_return code
         L     5,0(11)
         L     2,=V(FLAG@GUE)
         L     2,0(2)
         LTR   2,2
         BE    L982
         L     2,=V(ZZZ@289)
         L     2,0(2)
         L     2,56(2)
         L     2,4(2)
         IC    2,8(2)
         CLM   2,1,=XL1'0D'
         BE    L984
         CLM   2,1,=XL1'0F'
         BNE   L983
L984     EQU   *
         LA    4,23(0,0)
         L     2,=V(ZZZ@206)
         CL    5,256(2)
         BE    L997
         B     L982
L983     EQU   *
         LH    3,0(5)
         CH    3,=H'67'
         BNE   L988
         L     2,4(5)
         LA    4,22(0,0)
         LTR   2,2
         BL    L997
L988     EQU   *
         LR    2,3
         AH    2,=H'-80'
         CLM   2,3,=H'1'
         BNH   L990
         CLM   3,3,=H'67'
         BE    L990
         CLM   3,3,=H'68'
         BE    L990
         CLM   3,3,=H'71'
         BE    L990
         CLM   3,3,=H'151'
         BE    L990
         CLM   3,3,=H'69'
         BE    L990
         CLM   3,3,=H'157'
         BNE   L982
L990     EQU   *
         L     2,=V(ZZZ@206)
         CL    5,256(2)
         BE    L982
         CL    5,260(2)
         BE    L982
         LA    4,21(0,0)
L997     EQU   *
         MVC   88(4,13),=F'-81'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         SLL   4,8
         ST    4,20(15)
L982     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LR    8,15
         L     7,=V(ZZZ@289)
         L     2,0(7)
         L     2,56(2)
         L     4,80(2)
         LTR   4,4
         BNE   L991
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,0(7)
         L     2,56(2)
         L     4,80(2)
L991     EQU   *
         CLR   4,5
         BE    L992
         L     3,0(7)
         L     2,56(3)
         L     6,4(2)
         MVC   88(4,13),4(3)
         L     2,=V(TARGETM)
         L     2,352(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L993
         L     2,8(6)
         SRL   2,18
         N     2,=F'1'
         ST    2,104(13)
         L     2,0(7)
         L     2,56(2)
         SLR   3,3
         IC    3,28(2)
         LR    2,3
         ST    6,88(13)
         ST    3,92(13)
         LR    3,13
         A     3,=F'104'
         ST    3,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(PROMOTE@)
         BALR  14,15
         CLR   15,2
         BE    L993
         ST    15,88(13)
         ST    2,92(13)
         ST    5,96(13)
         MVC   100(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    5,15
L993     EQU   *
         LH    2,0(4)
         CLM   2,3,=H'52'
         BNE   L995
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(INT@SIZE)
         BALR  14,15
         ST    4,88(13)
         ST    5,92(13)
         ST    6,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@542)
         BALR  14,15
         B     L992
L995     EQU   *
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
L992     EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
* Function expand_value_return epilogue
         PDPEPIL
* Function expand_value_return literal pool
         DS    0F
         LTORG
* Function expand_value_return page table
         DS    0F
PGT59    EQU   *
         DC    A(PG59)
         DS    0F
* X-func ZZZ_656 prologue
ZZZ@656  PDPPRLG CINDEX=60,FRAME=96,BASER=12,ENTRY=YES
         B     FEN60
         LTORG
FEN60    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG60     EQU   *
         LR    11,1
         L     10,=A(PGT60)
* Function ZZZ_656 code
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(CLOBBER@)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
* Function ZZZ_656 epilogue
         PDPEPIL
* Function ZZZ_656 literal pool
         DS    0F
         LTORG
* Function ZZZ_656 page table
         DS    0F
PGT60    EQU   *
         DC    A(PG60)
         DS    0F
* X-func expand_return prologue
EXPAND@R PDPPRLG CINDEX=61,FRAME=152,BASER=12,ENTRY=YES
         B     FEN61
         LTORG
FEN61    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG61     EQU   *
         LR    11,1
         L     10,=A(PGT61)
* Function expand_return code
         L     4,0(11)
         SLR   3,3
         L     8,=V(ZZZ@289)
         L     2,0(8)
         L     2,4(2)
         L     2,4(2)
         CLI   8(2),5
         BNE   L1000
         ST    4,88(13)
         ST    3,92(13)
         ST    3,96(13)
         ST    3,100(13)
         ST    3,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         B     L1053
L1000    EQU   *
         L     2,=V(GLOBAL@T)
         CL    4,0(2)
         BE    L1053
         IC    2,8(4)
         LR    5,4
         CLM   2,1,=XL1'24'
         BE    L1002
         LA    2,207(,2)
         CLM   2,1,=XL1'01'
         BH    L1005
         L     2,16(4)
         CLI   8(2),36
         BNE   L1005
         L     5,20(4)
         B     L1002
L1005    EQU   *
         L     2,4(4)
         LR    5,4
         CLI   8(2),5
         BE    L1002
         SLR   5,5
L1002    EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         L     2,=V(ZZZ@1616)
         L     2,0(2)
         LTR   2,2
         BE    L1009
         LTR   5,5
         BE    L1009
         L     2,=V(CFUN)
         L     2,0(2)
         L     3,136(2)
         LTR   3,3
         BNE   L1009
         CLI   8(5),52
         BNE   L1009
         L     2,20(5)
         CLI   8(2),54
         BE    L1010
         L     2,24(5)
         CLI   8(2),54
         BNE   L1009
L1010    EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),16(5)
         ST    15,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(DO@JUMP)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(START@CL)
         BALR  14,15
         MVC   88(4,13),=F'49'
         L     3,0(8)
         L     2,4(3)
         MVC   92(4,13),4(2)
         MVC   96(4,13),56(3)
         MVC   100(4,13),20(5)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         OC    8(4,15),=F'8388608'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(EXPAND@R)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         MVC   88(4,13),=F'49'
         L     3,0(8)
         L     2,4(3)
         MVC   92(4,13),4(2)
         MVC   96(4,13),56(3)
         MVC   100(4,13),24(5)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         OC    8(4,15),=F'8388608'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(EXPAND@R)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(END@CLEA)
         BALR  14,15
         L     14,=A(L999)
         BR    14
L1009    EQU   *
         L     2,0(8)
         L     2,56(2)
         L     7,80(2)
         LTR   7,7
         BNE   L1012
         ST    2,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,0(8)
         L     2,56(2)
         L     7,80(2)
L1012    EQU   *
         LTR   5,5
         BE    L1013
         L     3,4(5)
         L     2,32(3)
         N     2,=F'8323072'
         L     6,=F'65536'
         CLR   2,6
         BNE   L1013
         LH    2,0(7)
         CLM   2,3,=H'74'
         BNE   L1013
         MVC   120(4,13),=F'0'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(INT@SIZE)
         BALR  14,15
         LR    4,15
         A     4,=F'3'
         LR    2,4
         SRL   2,2
         ST    2,124(13)
         A     4,=F'-3'
         L     2,4(5)
         L     8,36(2)
         LA    3,32(0,0)
         CLR   8,3
         BNH   L1014
         LR    8,3
L1014    EQU   *
         L     6,124(13)
         SLL   6,2
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,128(13)
         L     6,120(13)
         ST    6,132(13)
         ST    5,88(13)
         ST    6,92(13)
         ST    6,96(13)
         ST    6,100(13)
         ST    6,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    15,136(13)
         LTR   4,4
         BNE   L1015
L1053    EQU   *
         LA    1,88(,13)
         L     15,=A(ZZZ@656)
         BALR  14,15
         L     14,=A(L999)
         BR    14
L1015    EQU   *
         LR    3,4
         N     3,=F'3'
         LTR   3,3
         BE    L1016
         MVC   88(4,13),4(5)
         L     2,=V(TARGETM)
         L     2,368(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L1016
         SLL   3,3
         LA    2,32(0,0)
         SR    2,3
         ST    2,120(13)
L1016    EQU   *
         SLR   9,9
         L     5,120(13)
         LR    3,4
         SLL   3,3
         ST    3,144(13)
         CLR   9,3
         BNL   L1047
L1023    EQU   *
         LR    2,5
         N     2,=F'31'
         ST    2,140(13)
         LTR   2,2
         BE    L1021
         CL    5,120(13)
         BNE   L1020
L1021    EQU   *
         L     2,=V(WORD@MOD)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    6,15
         LR    2,5
         SRL   2,5
         SLL   2,2
         L     3,128(13)
         ST    15,0(2,3)
         ST    15,88(13)
         SLR   2,2
         IC    2,2(15)
         SLL   2,2
         L     3,=V(CONST@TI)
         L     2,0(2,3)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
L1020    EQU   *
         LR    2,9
         N     2,=F'31'
         LTR   2,2
         BNE   L1022
         MVC   88(4,13),136(13)
         LR    3,9
         SRL   3,5
         ST    3,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@1615)
         BALR  14,15
         ST    15,132(13)
L1022    EQU   *
         MVC   88(4,13),132(13)
         ST    8,92(13)
         ST    2,96(13)
         MVC   100(4,13),=F'1'
         MVC   104(4,13),=F'0'
         L     2,=V(WORD@MOD)
         MVC   108(4,13),0(2)
         MVC   112(4,13),0(2)
         MVC   116(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(ZZZ@678)
         BALR  14,15
         ST    6,88(13)
         ST    8,92(13)
         MVC   96(4,13),140(13)
         MVC   100(4,13),0(2)
         ST    15,104(13)
         MVC   108(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(STORE@BI)
         BALR  14,15
         AR    9,8
         AR    5,8
         CL    9,144(13)
         BL    L1023
L1047    EQU   *
         SLR   5,5
         IC    5,2(7)
         LA    6,1(0,0)
         CLR   5,6
         BNE   L1024
         L     2,=V(CLASS@NA)
         SLR   5,5
         IC    5,2(2)
L1051    EQU   *
         LTR   5,5
         BE    L1026
         L     2,=V(MODE@SIZ)
         SLR   3,3
         IC    3,0(2,5)
         CLR   3,4
         BNL   L1026
         L     2,=V(MODE@WID)
         SLR   6,6
         IC    6,0(2,5)
         LR    5,6
         B     L1051
L1026    EQU   *
         LTR   5,5
         BNE   L1030
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'3226'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L1030    EQU   *
         STC   5,2(7)
L1024    EQU   *
         L     4,=V(MODE@SIZ)
         L     2,=V(WORD@MOD)
         L     2,0(2)
         IC    3,0(4,5)
         IC    4,0(4,2)
         STC   4,80(,13)
         CLM   3,1,80(13)
         BL    L1032
         LR    2,5
L1032    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    4,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         SLR   6,6
         C     6,124(13)
         BNL   L1050
         L     3,128(13)
L1036    EQU   *
         ST    4,88(13)
         ST    6,92(13)
         MVC   96(4,13),=F'0'
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1614)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         A     6,=F'1'
         A     3,=F'4'
         C     6,124(13)
         BL    L1036
L1050    EQU   *
         CLR   5,2
         BE    L1037
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@LOWP)
         BALR  14,15
         LR    4,15
L1037    EQU   *
         ST    4,88(13)
         B     L1052
L1013    EQU   *
         LTR   5,5
         BE    L1039
         L     2,4(5)
         CLI   8(2),5
         BE    L1039
         LH    2,0(7)
         CLM   2,3,=H'74'
         BE    L1040
         CLM   2,3,=H'52'
         BNE   L1039
L1040    EQU   *
         L     2,0(8)
         L     2,56(2)
         L     4,4(2)
         ST    4,88(13)
         L     3,8(4)
         SRL   3,19
         LR    2,3
         SRL   2,0
         N     2,=F'2'
         N     3,=F'1'
         OR    3,2
         L     2,32(4)
         SRL   2,8
         N     2,=F'4'
         OR    3,2
         O     3,=F'1'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(BUILD@QU)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSIGN@T)
         BALR  14,15
         ST    5,88(13)
         ST    15,92(13)
         SLR   7,7
         IC    7,2(15)
         ST    7,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@853)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         LR    5,3
         L     2,0(8)
         L     2,56(2)
         L     6,4(2)
         ST    6,88(13)
         L     2,=V(TARGETM)
         L     2,368(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L1041
         L     2,0(8)
         L     2,56(2)
         L     4,80(2)
         LTR   4,4
         BNE   L1042
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1556)
         BALR  14,15
         L     2,0(8)
         L     2,56(2)
         L     4,80(2)
L1042    EQU   *
         SLR   2,2
         IC    2,2(4)
         L     3,=V(MODE@SIZ)
         SLR   7,7
         IC    7,0(3,2)
         LR    2,7
         SLL   2,3
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(INT@SIZE)
         BALR  14,15
         SLL   15,3
         SR    2,15
         BNH   L1041
         SLR   3,3
         IC    3,2(4)
         ST    3,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@LOWP)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@947)
         BALR  14,15
         SLR   6,6
         IC    6,2(4)
         ST    6,88(13)
         L     2,=V(OPTAB@TA)
         MVC   92(4,13),84(2)
         ST    3,96(13)
         ST    15,100(13)
         ST    4,104(13)
         MVC   108(4,13),=F'1'
         MVC   112(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(ZZZ@589)
         BALR  14,15
         LR    5,15
L1041    EQU   *
         ST    5,88(13)
         B     L1052
L1039    EQU   *
         ST    4,88(13)
         L     2,=V(ZZZ@206)
         MVC   92(4,13),256(2)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         ST    7,88(13)
L1052    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
L999     EQU   *
* Function expand_return epilogue
         PDPEPIL
* Function expand_return literal pool
         DS    0F
         LTORG
* Function expand_return page table
         DS    0F
PGT61    EQU   *
         DC    A(PG61)
         DS    0F
* X-func ZZZ_655 prologue
ZZZ@655  PDPPRLG CINDEX=62,FRAME=104,BASER=12,ENTRY=YES
         B     FEN62
         LTORG
FEN62    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG62     EQU   *
         LR    11,1
         L     10,=A(PGT62)
* Function ZZZ_655 code
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LR    4,15
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,96(2)
         LA    1,88(,13)
         L     15,=V(CLEAR@PE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
         LTR   2,2
         BNE   L1055
         L     2,0(3)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,96(2)
         LR    2,15
L1055    EQU   *
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
* Function ZZZ_655 epilogue
         PDPEPIL
* Function ZZZ_655 literal pool
         DS    0F
         LTORG
* Function ZZZ_655 page table
         DS    0F
PGT62    EQU   *
         DC    A(PG62)
         DS    0F
* X-func ZZZ_637 prologue
ZZZ@637  PDPPRLG CINDEX=63,FRAME=104,BASER=12,ENTRY=YES
         B     FEN63
         LTORG
FEN63    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG63     EQU   *
         LR    11,1
         L     10,=A(PGT63)
* Function ZZZ_637 code
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     15,20(2)
L1064    EQU   *
         LTR   15,15
         BE    L1063
         L     2,12(15)
         LTR   2,2
         BE    L1059
         MVC   88(4,13),=F'0'
         MVC   92(4,13),12(15)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LA    15,1(0,0)
         B     L1056
L1059    EQU   *
         L     15,0(15)
         B     L1064
L1063    EQU   *
         SLR   15,15
L1056    EQU   *
* Function ZZZ_637 epilogue
         PDPEPIL
* Function ZZZ_637 literal pool
         DS    0F
         LTORG
* Function ZZZ_637 page table
         DS    0F
PGT63    EQU   *
         DC    A(PG63)
         DS    0F
* X-func ZZZ_634 prologue
ZZZ@634  PDPPRLG CINDEX=64,FRAME=104,BASER=12,ENTRY=YES
         B     FEN64
         LTORG
FEN64    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG64     EQU   *
         LR    11,1
         L     10,=A(PGT64)
* Function ZZZ_634 code
         L     2,0(11)
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
         LTR   2,2
         BNE   L1066
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,12(2)
L1066    EQU   *
         LR    15,2
         LTR   2,2
         BE    L1065
         MVC   88(4,13),=F'0'
         MVC   92(4,13),24(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LA    15,1(0,0)
L1065    EQU   *
* Function ZZZ_634 epilogue
         PDPEPIL
* Function ZZZ_634 literal pool
         DS    0F
         LTORG
* Function ZZZ_634 page table
         DS    0F
PGT64    EQU   *
         DC    A(PG64)
         DS    0F
* X-func ZZZ_635 prologue
ZZZ@635  PDPPRLG CINDEX=65,FRAME=104,BASER=12,ENTRY=YES
         B     FEN65
         LTORG
FEN65    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG65     EQU   *
         LR    11,1
         L     10,=A(PGT65)
* Function ZZZ_635 code
         L     3,0(11)
         L     5,4(11)
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
         LTR   3,3
         BNE   L1069
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     3,12(2)
L1069    EQU   *
         LR    2,3
         LTR   3,3
         BE    L1068
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1480)
         BALR  14,15
         LA    2,1(0,0)
         LTR   15,15
         BNE   L1068
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    L1072
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@634)
         BALR  14,15
         LR    2,15
         B     L1068
L1072    EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         CL    3,20(2)
         BNE   L1073
         ST    5,88(13)
         MVC   92(4,13),24(3)
         LA    1,88(,13)
         L     15,=V(JUMPIFNO)
         BALR  14,15
         B     L1074
L1073    EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(JUMPIF)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),24(3)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
L1074    EQU   *
         LA    2,1(0,0)
L1068    EQU   *
         LR    15,2
* Function ZZZ_635 epilogue
         PDPEPIL
* Function ZZZ_635 literal pool
         DS    0F
         LTORG
* Function ZZZ_635 page table
         DS    0F
PGT65    EQU   *
         DC    A(PG65)
         DS    0F
* X-func ZZZ_636 prologue
ZZZ@636  PDPPRLG CINDEX=66,FRAME=96,BASER=12,ENTRY=YES
         B     FEN66
         LTORG
FEN66    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG66     EQU   *
         LR    11,1
         L     10,=A(PGT66)
* Function ZZZ_636 code
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(ZZZ@635)
         BALR  14,15
         LTR   15,15
         BE    L1075
         MVC   88(4,13),=F'-92'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         LA    15,1(0,0)
L1075    EQU   *
* Function ZZZ_636 epilogue
         PDPEPIL
* Function ZZZ_636 literal pool
         DS    0F
         LTORG
* Function ZZZ_636 page table
         DS    0F
PGT66    EQU   *
         DC    A(PG66)
         DS    0F
* X-func ZZZ_609 prologue
ZZZ@609  PDPPRLG CINDEX=67,FRAME=104,BASER=12,ENTRY=YES
         B     FEN67
         LTORG
FEN67    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG67     EQU   *
         LR    11,1
         L     10,=A(PGT67)
* Function ZZZ_609 code
         L     3,0(11)
         L     2,=V(FLAG@GUE)
         L     2,0(2)
         LTR   2,2
         BE    L1078
         MVC   88(4,13),=F'-81'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         MVC   20(4,15),=F'1793'
L1078    EQU   *
         LA    1,88(,13)
         L     15,=A(CLEAR@LA)
         BALR  14,15
         LTR   3,3
         BNE   L1079
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     3,12(2)
L1079    EQU   *
         LR    15,3
         LTR   3,3
         BE    L1077
         MVC   88(4,13),=F'0'
         MVC   92(4,13),28(3)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LA    15,1(0,0)
L1077    EQU   *
* Function ZZZ_609 epilogue
         PDPEPIL
* Function ZZZ_609 literal pool
         DS    0F
         LTORG
* Function ZZZ_609 page table
         DS    0F
PGT67    EQU   *
         DC    A(PG67)
         DS    0F
* X-func expand_goto prologue
EXPAND@G PDPPRLG CINDEX=68,FRAME=104,BASER=12,ENTRY=YES
         B     FEN68
         LTORG
FEN68    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG68     EQU   *
         LR    11,1
         L     10,=A(PGT68)
* Function expand_goto code
         L     5,0(11)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(DECL@FUN)
         BALR  14,15
         LTR   15,15
         BE    L1082
         L     2,=V(ZZZ@289)
         CL    15,0(2)
         BE    L1082
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@FUN)
         BALR  14,15
         LR    6,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),=F'80'
         MVC   92(4,13),=F'6'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@987)
         BALR  14,15
         L     4,76(6)
         L     3,72(6)
L1100    EQU   *
         L     2,16(3)
         CLR   2,5
         BE    L1097
         L     4,8(4)
         L     3,0(3)
         B     L1100
L1097    EQU   *
         L     4,4(4)
         OC    244(4,6),=F'4194304'
         L     2,=V(CFUN)
         L     2,0(2)
         OC    244(4,2),=F'2097152'
         OC    0(4,15),=F'16'
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(LOOKUP@S)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@226)
         BALR  14,15
         LR    3,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@222)
         BALR  14,15
         ST    15,88(13)
         L     5,=V(ZZZ@1074)
         MVC   92(4,13),24(5)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1828)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@226)
         BALR  14,15
         LR    4,15
         L     2,84(6)
         LTR   2,2
         BE    L1087
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@222)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),24(5)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1828)
         BALR  14,15
         LR    2,15
L1087    EQU   *
         MVC   88(4,13),=F'75'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@950)
         BALR  14,15
         MVC   88(4,13),=F'1'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@992)
         BALR  14,15
         MVC   88(4,13),=F'62'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@953)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
         MVC   88(4,13),=F'1'
         MVC   92(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@992)
         BALR  14,15
         MVC   88(4,13),=F'62'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@953)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
         MVC   88(4,13),12(5)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         MVC   88(4,13),=F'2'
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@574)
         BALR  14,15
         MVC   88(4,13),=F'61'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@953)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
         MVC   88(4,13),=F'61'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@953)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(EMIT@IND)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L1081
L1094    EQU   *
         LH    2,0(3)
         CLM   2,3,=H'46'
         BE    L1099
         CLM   2,3,=H'47'
         BE    L1081
         L     3,8(3)
         LTR   3,3
         BNE   L1094
         B     L1081
L1099    EQU   *
         MVC   88(4,13),=F'26'
         L     2,=V(ZZZ@206)
         MVC   92(4,13),256(2)
         MVC   96(4,13),36(3)
         LA    1,88(,13)
         L     15,=V(ALLOC@EX)
         BALR  14,15
         ST    15,36(3)
         B     L1081
L1082    EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    5,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
L1081    EQU   *
* Function expand_goto epilogue
         PDPEPIL
* Function expand_goto literal pool
         DS    0F
         LTORG
* Function expand_goto page table
         DS    0F
PGT68    EQU   *
         DC    A(PG68)
         DS    0F
* X-func ZZZ_626 prologue
ZZZ@626  PDPPRLG CINDEX=69,FRAME=112,BASER=12,ENTRY=YES
         B     FEN69
         LTORG
FEN69    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG69     EQU   *
         LR    11,1
         L     10,=A(PGT69)
* Function ZZZ_626 code
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     5,0(2)
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(WARN@ABO)
         BALR  14,15
         L     2,12(5)
         LTR   2,2
         BE    L1102
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         MVC   88(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
L1102    EQU   *
         L     3,0(4)
         L     2,68(3)
         LTR   2,2
         BE    L1103
         L     2,72(3)
         LTR   2,2
         BE    L1103
         L     2,4(5)
         LTR   2,2
         BNE   L1104
         L     2,244(3)
         SRL   2,22
         N     2,=F'1'
         B     L1156
L1104    EQU   *
         L     2,36(5)
         LTR   2,2
         BNE   L1105
         L     2,24(5)
L1156    EQU   *
         LTR   2,2
         BE    L1103
L1105    EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    8,15
         L     2,4(5)
         LTR   2,2
         BE    L1106
         L     2,0(4)
         L     4,76(2)
L1157    EQU   *
         LTR   4,4
         BE    L1106
         MVC   88(4,13),=F'6'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(4)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),28(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@550)
         BALR  14,15
         L     4,8(4)
         B     L1157
L1106    EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@553)
         BALR  14,15
         L     7,=V(CFUN)
         L     2,0(7)
         L     3,72(2)
         L     4,76(2)
         SLR   6,6
L1158    EQU   *
         LTR   3,3
         BE    L1152
         L     2,16(3)
         L     2,28(2)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BNE   L1113
         MVC   88(4,13),4(4)
         MVC   92(4,13),28(5)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         MVC   88(4,13),=F'3'
         ST    2,92(13)
         ST    15,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
         LR    6,15
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         MVC   88(4,13),16(3)
         LA    1,88(,13)
         L     15,=A(EXPAND@G)
         BALR  14,15
L1113    EQU   *
         L     3,0(3)
         L     4,8(4)
         B     L1158
L1152    EQU   *
         L     2,0(7)
         L     3,72(2)
         L     4,76(2)
         SLR   15,15
         LTR   3,3
         BE    L1121
L1120    EQU   *
         L     2,16(3)
         L     2,28(2)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    L1118
         MVC   88(4,13),4(4)
         MVC   92(4,13),28(5)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
         LR    6,15
         LA    15,1(0,0)
L1118    EQU   *
         L     3,0(3)
         L     4,8(4)
         LTR   3,3
         BNE   L1120
         LTR   15,15
         BE    L1121
         LA    1,88(,13)
         L     15,=A(@@F15)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@602)
         BALR  14,15
L1121    EQU   *
         L     2,0(7)
         ST    6,80(2)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
L1103    EQU   *
         L     2,8(11)
         LTR   2,2
         BH    L1124
         BNE   L1123
         L     2,24(5)
         LTR   2,2
         BE    L1123
L1124    EQU   *
         L     3,44(5)
L1159    EQU   *
         LTR   3,3
         BE    L1123
         L     2,4(3)
         OC    28(4,2),=F'524288'
         L     2,4(3)
         L     2,8(2)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    L1127
         MVC   88(4,13),=A(LC30)
         MVC   92(4,13),4(3)
         MVC   96(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
L1127    EQU   *
         L     3,0(3)
         B     L1159
L1123    EQU   *
         L     2,24(5)
         LTR   2,2
         BNE   L1131
         L     2,36(5)
         LTR   2,2
         BE    L1130
L1131    EQU   *
         L     9,=V(CFUN)
         L     2,0(9)
         L     2,4(2)
         L     4,44(2)
         L     6,36(2)
         L     7,40(2)
         L     8,32(2)
         MVC   44(4,2),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'50'
         BNE   L1132
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
L1132    EQU   *
         SLR   3,3
         LTR   15,15
         BE    L1134
         LH    2,0(15)
         CLM   2,3,=H'48'
         BE    L1133
L1134    EQU   *
         LA    3,1(0,0)
L1133    EQU   *
         MVC   88(4,13),36(5)
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@F17)
         BALR  14,15
         LTR   3,3
         BE    L1135
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
L1135    EQU   *
         L     2,0(9)
         L     2,4(2)
         ST    4,44(2)
         ST    6,36(2)
         ST    7,40(2)
         ST    8,32(2)
         LTR   3,3
         BE    L1136
         L     2,24(5)
         LTR   2,2
         BE    L1136
         SLR   3,3
         L     2,4(5)
         LTR   2,2
         BNE   L1137
         LA    3,1(0,0)
L1137    EQU   *
         ST    3,88(13)
         MVC   92(4,13),24(5)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@574)
         BALR  14,15
         L     2,=V(CFUN)
         L     3,0(2)
         L     2,76(3)
         LTR   2,2
         BE    L1136
         MVC   88(4,13),=F'2'
         A     3,=F'84'
         ST    3,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@575)
         BALR  14,15
L1136    EQU   *
         ST    5,88(13)
         MVC   92(4,13),24(5)
         MVC   96(4,13),36(5)
         MVC   100(4,13),28(5)
         MVC   104(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
L1130    EQU   *
         L     2,4(11)
         LTR   2,2
         BE    L1139
         MVC   88(4,13),=F'-97'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
         L     2,28(5)
         MVC   20(4,15),20(2)
         B     L1140
L1139    EQU   *
         L     2,28(5)
         MVC   24(4,2),=F'-99'
L1140    EQU   *
         L     6,=V(CFUN)
         L     2,0(6)
         MVC   176(4,2),52(5)
         L     2,4(2)
         MVC   4(4,2),32(5)
         L     5,0(2)
L1142    EQU   *
         L     4,0(6)
         L     3,4(4)
         L     15,20(3)
         L     2,12(3)
         CLR   2,15
         BNE   L1145
         MVC   12(4,3),4(15)
L1145    EQU   *
         L     3,4(4)
         L     2,8(3)
         CLR   2,15
         BNE   L1146
         MVC   8(4,3),4(15)
L1146    EQU   *
         L     3,4(4)
         L     2,0(3)
         CLR   2,15
         BNE   L1147
         MVC   0(4,3),4(15)
L1147    EQU   *
         L     3,4(4)
         L     2,4(3)
         CLR   2,15
         BNE   L1148
         MVC   4(4,3),4(15)
L1148    EQU   *
         L     3,4(4)
         L     2,16(3)
         CLR   2,15
         BNE   L1149
         MVC   16(4,3),4(15)
L1149    EQU   *
         L     2,4(4)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(15)
         CLR   15,5
         BNE   L1142
         LA    1,88(,13)
         L     15,=V(POP@TEMP)
         BALR  14,15
* Function ZZZ_626 epilogue
         PDPEPIL
* Function ZZZ_626 literal pool
         DS    0F
         LTORG
* Function ZZZ_626 page table
         DS    0F
PGT69    EQU   *
         DC    A(PG69)
         DS    0F
* X-func ZZZ_633 prologue
ZZZ@633  PDPPRLG CINDEX=70,FRAME=104,BASER=12,ENTRY=YES
         B     FEN70
         LTORG
FEN70    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG70     EQU   *
         LR    11,1
         L     10,=A(PGT70)
* Function ZZZ_633 code
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@626)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(POP@TEMP)
         BALR  14,15
* Function ZZZ_633 epilogue
         PDPEPIL
* Function ZZZ_633 literal pool
         DS    0F
         LTORG
* Function ZZZ_633 page table
         DS    0F
PGT70    EQU   *
         DC    A(PG70)
         DS    0F
* X-func last_cleanup_this_contour prologue
LAST@CLE PDPPRLG CINDEX=71,FRAME=88,BASER=12,ENTRY=YES
         B     FEN71
         LTORG
FEN71    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG71     EQU   *
         LR    11,1
         L     10,=A(PGT71)
* Function last_cleanup_this_contour code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         LR    15,2
         LTR   2,2
         BE    L1161
         L     15,36(2)
L1161    EQU   *
* Function last_cleanup_this_contour epilogue
         PDPEPIL
* Function last_cleanup_this_contour literal pool
         DS    0F
         LTORG
* Function last_cleanup_this_contour page table
         DS    0F
PGT71    EQU   *
         DC    A(PG71)
         DS    0F
* X-func any_pending_cleanups prologue
ANY@PEND PDPPRLG CINDEX=72,FRAME=88,BASER=12,ENTRY=YES
         B     FEN72
         LTORG
FEN72    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG72     EQU   *
         LR    11,1
         L     10,=A(PGT72)
* Function any_pending_cleanups code
         L     2,=V(CFUN)
         L     2,0(2)
         LTR   2,2
         BE    L1174
         L     2,4(2)
         LTR   2,2
         BE    L1174
         L     3,0(2)
         LTR   3,3
         BE    L1174
         L     2,36(3)
         LA    15,1(0,0)
         LTR   2,2
         BNE   L1163
         L     2,40(3)
         LR    15,2
         LTR   2,2
         BE    L1163
         B     L1167
L1175    EQU   *
         LA    15,1(0,0)
         B     L1163
L1167    EQU   *
         L     15,4(3)
L1176    EQU   *
         LTR   15,15
         BE    L1174
         L     2,36(15)
         LTR   2,2
         BNE   L1175
         L     15,4(15)
         B     L1176
L1174    EQU   *
         SLR   15,15
L1163    EQU   *
* Function any_pending_cleanups epilogue
         PDPEPIL
* Function any_pending_cleanups literal pool
         DS    0F
         LTORG
* Function any_pending_cleanups page table
         DS    0F
PGT72    EQU   *
         DC    A(PG72)
         DS    0F
* X-func ZZZ_662 prologue
ZZZ@662  PDPPRLG CINDEX=73,FRAME=96,BASER=12,ENTRY=YES
         B     FEN73
         LTORG
FEN73    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG73     EQU   *
         LR    11,1
         L     10,=A(PGT73)
* Function ZZZ_662 code
         MVC   88(4,13),=F'64'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         LR    4,15
         MVC   16(4,15),=F'3'
         L     5,=V(CFUN)
         L     2,0(5)
         L     2,4(2)
         MVC   4(4,15),16(2)
         MVC   0(4,15),20(2)
         L     3,24(2)
         LR    6,3
         A     6,=F'1'
         ST    6,24(2)
         ST    6,8(4)
         L     15,0(11)
         LTR   15,15
         BE    L1179
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
L1179    EQU   *
         ST    15,12(4)
         MVC   24(4,4),=F'0'
         MVC   32(4,4),4(11)
         MVC   36(4,4),8(11)
         MVC   28(4,4),=F'0'
         MVC   40(4,4),12(11)
         LA    1,88(,13)
         L     15,=V(FORCE@LI)
         BALR  14,15
         ST    15,44(4)
         L     2,0(5)
         L     2,4(2)
         ST    4,16(2)
         ST    4,20(2)
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'50'
         BE    L1180
         MVC   88(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(ZZZ@569)
         BALR  14,15
L1180    EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    15,20(4)
         LA    1,88(,13)
         L     15,=A(START@CL)
         BALR  14,15
* Function ZZZ_662 epilogue
         PDPEPIL
* Function ZZZ_662 literal pool
         DS    0F
         LTORG
* Function ZZZ_662 page table
         DS    0F
PGT73    EQU   *
         DC    A(PG73)
         DS    0F
* X-func ZZZ_663 prologue
ZZZ@663  PDPPRLG CINDEX=74,FRAME=96,BASER=12,ENTRY=YES
         B     FEN74
         LTORG
FEN74    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG74     EQU   *
         LR    11,1
         L     10,=A(PGT74)
* Function ZZZ_663 code
         MVC   88(4,13),=F'64'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         MVC   16(4,15),=F'3'
         L     2,=V(CFUN)
         L     4,0(2)
         L     2,4(4)
         MVC   4(4,15),16(2)
         MVC   0(4,15),20(2)
         L     3,24(2)
         LR    5,3
         A     5,=F'1'
         ST    5,24(2)
         ST    5,8(15)
         MVC   12(4,15),=F'0'
         MVC   24(4,15),=F'0'
         MVC   20(4,15),=F'0'
         MVC   36(4,15),=F'0'
         MVC   28(4,15),=F'0'
         L     2,4(4)
         ST    15,16(2)
         ST    15,20(2)
         LA    1,88(,13)
         L     15,=A(START@CL)
         BALR  14,15
* Function ZZZ_663 epilogue
         PDPEPIL
* Function ZZZ_663 literal pool
         DS    0F
         LTORG
* Function ZZZ_663 page table
         DS    0F
PGT74    EQU   *
         DC    A(PG74)
LC32     EQU   *
         DC    C'%Hunreachable code at beginning of %s'
         DC    X'0'
         DS    0F
* Function check_seenlabel,F18 prologue
@@F18    PDPPRLG CINDEX=75,FRAME=112,BASER=12,ENTRY=NO
         B     FEN75
         LTORG
FEN75    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG75     EQU   *
         LR    11,1
         L     10,=A(PGT75)
* Function check_seenlabel code
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     2,16(2)
         L     2,44(2)
         LTR   2,2
         BL    L1182
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1832)
         BALR  14,15
         L     3,0(4)
         L     2,4(3)
         L     2,16(2)
         MVC   44(4,2),=F'-1'
         L     2,4(3)
         L     2,16(2)
         L     3,20(2)
         LTR   3,3
         BE    L1182
L1195    EQU   *
         LH    2,0(3)
         CLM   2,3,=H'49'
         BE    L1182
         CLM   2,3,=H'50'
         BE    L1186
         CLM   2,3,=H'45'
         BNE   L1200
         L     2,24(3)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BE    L1186
L1200    EQU   *
         L     3,8(3)
         LTR   3,3
         BE    L1191
         LH    2,0(3)
         CH    2,=H'50'
         BNE   L1200
         L     2,24(3)
         LTR   2,2
         BL    L1200
L1191    EQU   *
         LTR   3,3
         BE    L1182
         MVC   104(4,13),20(3)
         MVC   108(4,13),24(3)
         MVC   88(4,13),=A(LC32)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         L     2,0(4)
         L     2,4(2)
         L     2,16(2)
         MVC   96(4,13),40(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     L1182
L1186    EQU   *
         L     3,12(3)
         LTR   3,3
         BNE   L1195
L1182    EQU   *
* Function check_seenlabel epilogue
         PDPEPIL
* Function check_seenlabel literal pool
         DS    0F
         LTORG
* Function check_seenlabel page table
         DS    0F
PGT75    EQU   *
         DC    A(PG75)
         DS    0F
* X-func add_case_node prologue
ADD@CASE PDPPRLG CINDEX=76,FRAME=96,BASER=12,ENTRY=YES
         B     FEN76
         LTORG
FEN76    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG76     EQU   *
         LR    11,1
         L     10,=A(PGT76)
* Function add_case_node code
         L     3,0(11)
         L     6,4(11)
         L     7,8(11)
         L     9,12(11)
         LTR   6,6
         BNE   L1202
         LR    6,3
L1202    EQU   *
         LTR   6,6
         BNE   L1203
         LTR   3,3
         BNE   L1203
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     3,16(2)
         L     2,28(3)
         LTR   2,2
         BE    L1204
         ST    2,0(9)
         B     L1265
L1204    EQU   *
         ST    7,28(3)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@648)
         BALR  14,15
         LR    15,6
         B     L1201
L1203    EQU   *
         L     8,=V(CFUN)
         L     2,0(8)
         L     2,4(2)
         L     2,16(2)
         A     2,=F'24'
         L     5,0(2)
         LR    4,5
         LTR   5,5
         BE    L1256
L1211    EQU   *
         LR    5,4
         ST    6,88(13)
         MVC   92(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LR    2,4
         LTR   15,15
         BNE   L1205
         MVC   88(4,13),16(4)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1209
         A     2,=F'4'
         B     L1205
L1209    EQU   *
         MVC   0(4,9),20(4)
L1265    EQU   *
         LA    15,2(0,0)
         B     L1201
L1205    EQU   *
         L     4,0(2)
         LTR   4,4
         BNE   L1211
L1256    EQU   *
         MVC   88(4,13),=F'28'
         LA    1,88(,13)
         L     15,=V(ZZZ@1050)
         BALR  14,15
         LR    4,15
         ST    3,12(15)
         ST    3,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L1212
         MVC   16(4,4),12(4)
         B     L1213
L1260    EQU   *
         ST    4,0(3)
         B     L1215
L1261    EQU   *
         ST    15,0(3)
         B     L1215
L1212    EQU   *
         ST    6,16(4)
L1213    EQU   *
         ST    7,20(4)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@648)
         BALR  14,15
         ST    4,0(2)
         ST    5,8(4)
         MVC   0(4,4),=F'0'
         MVC   4(4,4),=F'0'
         MVC   24(4,4),=F'0'
L1262    EQU   *
         LTR   5,5
         BE    L1215
         L     2,24(5)
         CL    4,0(5)
         BNE   L1216
         LTR   2,2
         BNE   L1217
         MVC   24(4,5),=F'-1'
         B     û1235
L1217    EQU   *
         LTR   2,2
         BNL   L1238
         L     2,24(4)
         L     15,4(4)
         LTR   2,2
         BNL   L1220
         ST    15,0(5)
         LTR   15,15
         BE    L1221
         ST    5,8(15)
L1221    EQU   *
         ST    5,4(4)
         B     L1268
L1220    EQU   *
         L     3,4(15)
         ST    3,0(5)
         LTR   3,3
         BE    L1227
         ST    5,8(3)
L1227    EQU   *
         ST    5,4(15)
         L     3,0(15)
         ST    3,4(4)
         LTR   3,3
         BE    L1228
         ST    4,8(3)
L1228    EQU   *
         ST    4,0(15)
         L     3,24(15)
         LR    2,3
         SRL   2,31
         ST    2,24(5)
         LCR   2,2
         SR    2,3
         ST    2,24(4)
         B     L1269
L1216    EQU   *
         LTR   2,2
         BNE   L1236
         MVC   24(4,5),=F'1'
         B     L1235
L1236    EQU   *
         LTR   2,2
         BNH   L1238
         L     2,24(4)
         L     15,0(4)
         LTR   2,2
         BNH   L1239
         ST    15,4(5)
         LTR   15,15
         BE    L1240
         ST    5,8(15)
L1240    EQU   *
         ST    5,0(4)
L1268    EQU   *
         MVC   24(4,5),=F'0'
         MVC   24(4,4),=F'0'
         L     3,8(5)
         ST    4,8(5)
         ST    3,8(4)
         LTR   3,3
         BE    L1241
         L     2,0(3)
         CLR   2,5
         BE    L1260
         ST    4,4(3)
         B     L1215
L1241    EQU   *
         L     2,0(8)
         L     2,4(2)
         L     2,16(2)
         ST    4,24(2)
         B     L1215
L1239    EQU   *
         L     3,0(15)
         ST    3,4(5)
         LTR   3,3
         BE    L1246
         ST    5,8(3)
L1246    EQU   *
         ST    5,0(15)
         L     3,4(15)
         ST    3,0(4)
         LTR   3,3
         BE    L1247
         ST    4,8(3)
L1247    EQU   *
         ST    4,4(15)
         L     3,24(15)
         LR    2,3
         SRL   2,31
         ST    2,24(4)
         LCR   2,2
         SR    2,3
         ST    2,24(5)
L1269    EQU   *
         MVC   24(4,15),=F'0'
         L     3,8(5)
         ST    15,8(5)
         ST    15,8(4)
         ST    3,8(15)
         LTR   3,3
         BE    L1249
         L     2,0(3)
         CLR   2,5
         BE    L1261
         ST    15,4(3)
         B     L1215
L1249    EQU   *
         L     2,0(8)
         L     2,4(2)
         L     2,16(2)
         ST    15,24(2)
         B     L1215
L1238    EQU   *
         MVC   24(4,5),=F'0'
         B     L1215
L1235    EQU   *
         LR    4,5
         L     5,8(5)
         B     L1262
L1215    EQU   *
         SLR   15,15
L1201    EQU   *
* Function add_case_node epilogue
         PDPEPIL
* Function add_case_node literal pool
         DS    0F
         LTORG
* Function add_case_node page table
         DS    0F
PGT76    EQU   *
         DC    A(PG76)
         DS    0F
* X-func ZZZ_1714 prologue
ZZZ@1714 PDPPRLG CINDEX=77,FRAME=104,BASER=12,ENTRY=YES
         B     FEN77
         LTORG
FEN77    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG77     EQU   *
         LR    11,1
         L     10,=A(PGT77)
* Function ZZZ_1714 code
         L     5,0(11)
         L     4,4(11)
         L     8,8(11)
         L     6,=V(CFUN)
         L     2,0(6)
         L     3,4(2)
         L     15,16(3)
         LTR   15,15
         BE    L1272
         L     2,20(15)
         LTR   2,2
         BNE   L1271
L1272    EQU   *
         LA    3,1(0,0)
         B     L1270
L1271    EQU   *
         L     2,4(3)
         LTR   2,2
         BE    L1273
         L     2,8(2)
         LA    3,5(0,0)
         C     2,8(15)
         BH    L1270
L1273    EQU   *
         L     2,0(6)
         L     2,4(2)
         L     3,16(2)
         L     2,32(3)
         L     7,4(2)
         L     6,36(3)
         SLR   3,3
         L     2,=V(GLOBAL@T)
         CL    7,0(2)
         BE    L1270
         LA    1,88(,13)
         L     15,=A(@@F18)
         BALR  14,15
         LTR   5,5
         BNE   L1275
         L     5,56(7)
L1275    EQU   *
         LTR   4,4
         BNE   L1276
         L     4,60(7)
L1276    EQU   *
         LTR   4,4
         BE    L1277
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LA    3,4(0,0)
         LTR   15,15
         BNE   L1270
L1277    EQU   *
         LTR   4,4
         BNE   L1278
         L     4,60(6)
L1278    EQU   *
         ST    6,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         LA    15,0(8)
         BALR  14,15
         LR    5,15
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(8)
         BALR  14,15
         LR    4,15
         L     2,8(5)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BNE   L1282
         ST    5,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BE    L1282
         L     2,8(4)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BNE   L1282
         ST    4,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BNE   L1281
L1282    EQU   *
         LA    3,3(0,0)
         B     L1270
L1281    EQU   *
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),12(11)
         MVC   100(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(ADD@CASE)
         BALR  14,15
         LR    3,15
L1270    EQU   *
         LR    15,3
* Function ZZZ_1714 epilogue
         PDPEPIL
* Function ZZZ_1714 literal pool
         DS    0F
         LTORG
* Function ZZZ_1714 page table
         DS    0F
PGT77    EQU   *
         DC    A(PG77)
         DS    0F
* X-func ZZZ_1713 prologue
ZZZ@1713 PDPPRLG CINDEX=78,FRAME=104,BASER=12,ENTRY=YES
         B     FEN78
         LTORG
FEN78    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG78     EQU   *
         LR    11,1
         L     10,=A(PGT78)
* Function ZZZ_1713 code
         L     4,0(11)
         L     5,=V(CFUN)
         L     2,0(5)
         L     15,4(2)
         L     3,16(15)
         LTR   3,3
         BE    L1285
         L     2,20(3)
         LTR   2,2
         BNE   L1284
L1285    EQU   *
         LA    15,1(0,0)
         B     L1283
L1284    EQU   *
         L     2,4(15)
         LTR   2,2
         BE    L1286
         L     2,8(2)
         LA    15,5(0,0)
         C     2,8(3)
         BH    L1283
L1286    EQU   *
         L     2,0(5)
         L     2,4(2)
         L     3,16(2)
         L     2,32(3)
         L     5,4(2)
         L     3,36(3)
         SLR   15,15
         L     2,=V(GLOBAL@T)
         CL    5,0(2)
         BE    L1283
         LTR   4,4
         BE    L1288
         ST    3,88(13)
         ST    4,92(13)
         L     2,4(11)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    4,15
L1288    EQU   *
         LA    1,88(,13)
         L     15,=A(@@F18)
         BALR  14,15
         LTR   4,4
         BE    L1289
         L     2,8(4)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BNE   L1290
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BNE   L1289
L1290    EQU   *
         LA    15,3(0,0)
         B     L1283
L1289    EQU   *
         ST    4,88(13)
         ST    4,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(ADD@CASE)
         BALR  14,15
L1283    EQU   *
* Function ZZZ_1713 epilogue
         PDPEPIL
* Function ZZZ_1713 literal pool
         DS    0F
         LTORG
* Function ZZZ_1713 page table
         DS    0F
PGT78    EQU   *
         DC    A(PG78)
         DS    0F
* X-func all_cases_count prologue
ALL@CASE PDPPRLG CINDEX=79,FRAME=104,BASER=12,ENTRY=YES
         B     FEN79
         LTORG
FEN79    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG79     EQU   *
         LR    11,1
         L     10,=A(PGT79)
* Function all_cases_count code
         L     6,0(11)
         L     7,4(11)
         MVC   0(4,7),=F'0'
         SLR   2,2
         IC    2,8(6)
         LA    3,11(0,0)
         CLR   2,3
         BE    L1293
         BH    L1310
         LA    3,10(0,0)
         CLR   2,3
         BE    L1299
         B     L1296
L1310    EQU   *
         LA    3,12(0,0)
         CLR   2,3
         BE    L1294
         B     L1296
L1293    EQU   *
         LA    5,2(0,0)
         B     L1292
L1294    EQU   *
         LA    5,256(0,0)
         B     L1292
L1296    EQU   *
         L     2,60(6)
         LTR   2,2
         BE    L1301
         MVC   88(4,13),=F'60'
         ST    6,92(13)
         ST    2,96(13)
         MVC   100(4,13),56(6)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L1301
         ST    6,88(13)
         L     2,=V(GLOBAL@T)
         MVC   92(4,13),44(2)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'59'
         ST    6,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L1301
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L1301
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    5,15
         B     L1292
L1299    EQU   *
         MVC   88(4,13),56(6)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L1301
         L     2,60(6)
         LTR   2,2
         BE    L1301
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BNE   L1300
L1301    EQU   *
         L     15,=F'-1'
         B     L1291
L1300    EQU   *
         MVC   88(4,13),56(6)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    4,15
         LR    8,15
         SLR   5,5
         L     3,12(6)
L1312    EQU   *
         LTR   3,3
         BE    L1292
         MVC   88(4,13),16(3)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         L     2,0(7)
         LA    6,2(0,0)
         CR    2,6
         BE    L1306
         CR    15,4
         BH    L1305
L1306    EQU   *
         MVC   0(4,7),=F'2'
         B     L1307
L1305    EQU   *
         LR    2,8
         AR    2,5
         CLR   15,2
         BE    L1307
         MVC   0(4,7),=F'1'
L1307    EQU   *
         LR    4,15
         A     5,=F'1'
         L     3,0(3)
         B     L1312
L1292    EQU   *
         LR    15,5
L1291    EQU   *
* Function all_cases_count epilogue
         PDPEPIL
* Function all_cases_count literal pool
         DS    0F
         LTORG
* Function all_cases_count page table
         DS    0F
PGT79    EQU   *
         DC    A(PG79)
         DS    0F
* Function case_tree2list,F22 prologue
@@F22    PDPPRLG CINDEX=80,FRAME=96,BASER=12,ENTRY=NO
         B     FEN80
         LTORG
FEN80    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG80     EQU   *
         LR    11,1
         L     10,=A(PGT80)
* Function case_tree2list code
         L     3,0(11)
         L     2,4(11)
L1315    EQU   *
         L     15,4(3)
         LTR   15,15
         BE    L1314
         ST    15,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         LR    2,15
L1314    EQU   *
         ST    2,4(3)
         L     15,0(3)
         LTR   15,15
         BE    L1316
         MVC   0(4,3),=F'0'
         LR    2,3
         LR    3,15
         B     L1315
L1316    EQU   *
         LR    15,3
* Function case_tree2list epilogue
         PDPEPIL
* Function case_tree2list literal pool
         DS    0F
         LTORG
* Function case_tree2list page table
         DS    0F
PGT80    EQU   *
         DC    A(PG80)
         DS    0F
* X-func mark_seen_cases prologue
MARK@SEE PDPPRLG CINDEX=81,FRAME=128,BASER=12,ENTRY=YES
         B     FEN81
         LTORG
FEN81    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG81     EQU   *
         LR    11,1
         L     10,=A(PGT81)
* Function mark_seen_cases code
         L     7,0(11)
         L     9,4(11)
         SLR   8,8
         ST    8,120(13)
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,4(2)
         L     2,16(2)
         L     6,24(2)
         MVC   88(4,13),=F'25'
         LA    1,88(,13)
         L     15,=V(MAKE@NOD)
         BALR  14,15
         LR    5,15
         ST    7,4(15)
         LTR   6,6
         BE    L1317
         L     4,12(11)
         LA    2,2(0,0)
         CLR   4,2
         BNE   L1320
         L     2,12(6)
         MVC   4(4,15),4(2)
         L     7,12(7)
         LTR   7,7
         BE    L1317
L1331    EQU   *
         L     2,16(7)
         MVC   12(4,5),12(2)
         L     2,16(7)
         MVC   16(4,5),16(2)
         LR    4,6
L1324    EQU   *
         ST    5,88(13)
         MVC   92(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1327
         L     4,0(4)
         B     L1326
L1327    EQU   *
         MVC   88(4,13),16(4)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1329
         L     4,4(4)
         B     L1326
L1329    EQU   *
         LR    4,8
         SRL   4,3
         LR    3,8
         N     3,=F'7'
         LA    2,1(0,0)
         SLL   2,0(3)
         IC    3,0(9,4)
         OR    3,2
         STC   3,0(9,4)
         B     L1325
L1326    EQU   *
         LTR   4,4
         BNE   L1324
L1325    EQU   *
         L     7,0(7)
         A     8,=F'1'
         LTR   7,7
         BNE   L1331
         B     L1317
L1320    EQU   *
         L     2,0(6)
         LTR   2,2
         BE    L1333
         L     2,0(3)
         L     2,4(2)
         L     2,16(2)
         ST    6,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         LR    6,15
         ST    15,24(2)
L1333    EQU   *
         LR    4,6
         LTR   6,6
         BE    L1317
L1350    EQU   *
         L     2,12(4)
         MVC   12(4,5),12(2)
         L     2,12(4)
         MVC   16(4,5),16(2)
         B     L1337
L1354    EQU   *
         L     8,0(2)
         A     3,=F'1'
         ST    3,120(13)
         B     L1345
L1349    EQU   *
         L     2,12(11)
         LTR   2,2
         BE    L1339
         L     2,12(7)
         LTR   2,2
         BE    L1339
         LR    2,8
         MVC   112(4,13),120(13)
         ST    15,116(13)
L1340    EQU   *
         LTR   2,2
         BNE   L1342
         L     2,12(7)
         MVC   112(4,13),=F'0'
L1342    EQU   *
         ST    5,88(13)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         L     3,112(13)
         LTR   15,15
         BNE   L1354
         A     3,=F'1'
         ST    3,112(13)
         L     2,0(2)
         CLR   2,8
         BNE   L1340
         MVC   112(4,13),=F'-1'
         B     L1345
L1339    EQU   *
         L     2,56(7)
         LTR   2,2
         BE    L1346
         MVC   88(4,13),12(2)
         MVC   92(4,13),16(2)
         LR    3,13
         A     3,=F'112'
         ST    3,96(13)
         LR    2,13
         A     2,=F'116'
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(NEG@DOUB)
         BALR  14,15
         B     L1347
L1346    EQU   *
         ST    2,116(13)
         ST    2,112(13)
L1347    EQU   *
         MVC   88(4,13),112(13)
         MVC   92(4,13),116(13)
         MVC   96(4,13),12(5)
         MVC   100(4,13),16(5)
         LR    3,13
         A     3,=F'112'
         ST    3,104(13)
         LR    2,13
         A     2,=F'116'
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=V(ADD@DOUB)
         BALR  14,15
L1345    EQU   *
         L     2,116(13)
         LTR   2,2
         BNE   L1348
         L     15,112(13)
         CL    15,8(11)
         BNL   L1348
         LR    3,15
         N     3,=F'7'
         LA    2,1(0,0)
         SLL   2,0(3)
         SRL   15,3
         IC    3,0(9,15)
         OR    3,2
         STC   3,0(9,15)
L1348    EQU   *
         MVC   88(4,13),12(5)
         MVC   92(4,13),16(5)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'0'
         LR    2,5
         A     2,=F'12'
         ST    2,104(13)
         LR    3,5
         A     3,=F'16'
         ST    3,108(13)
         LA    1,88(,13)
         L     15,=V(ADD@DOUB)
         BALR  14,15
L1337    EQU   *
         MVC   88(4,13),16(4)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1349
         L     4,4(4)
         LTR   4,4
         BNE   L1350
L1317    EQU   *
* Function mark_seen_cases epilogue
         PDPEPIL
* Function mark_seen_cases literal pool
         DS    0F
         LTORG
* Function mark_seen_cases page table
         DS    0F
PGT81    EQU   *
         DC    A(PG81)
LC33     EQU   *
         DC    C'enumeration value `%s'' not handled in switch'
         DC    X'0'
LC34     EQU   *
         DC    C'case value `%ld'' not in enumerated type'
         DC    X'0'
LC35     EQU   *
         DC    C'case value `%ld'' not in enumerated type `%s'''
         DC    X'0'
         DS    0F
* X-func ZZZ_154 prologue
ZZZ@154  PDPPRLG CINDEX=82,FRAME=112,BASER=12,ENTRY=YES
         B     FEN82
         LTORG
FEN82    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG82     EQU   *
         LR    11,1
         L     10,=A(PGT82)
* Function ZZZ_154 code
         L     8,0(11)
         MVC   104(4,13),=F'0'
         ST    8,88(13)
         LR    2,13
         A     2,=F'104'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(ALL@CASE)
         BALR  14,15
         LR    5,15
         LR    2,15
         A     2,=F'8'
         BNL   L1356
         A     2,=F'7'
L1356    EQU   *
         LR    3,2
         SRA   3,3
         LR    2,5
         BCTR  2,0
         L     4,=F'599998'
         CLR   2,4
         BH    L1357
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(CALLOC)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BE    L1357
         L     4,12(8)
         ST    8,88(13)
         ST    15,92(13)
         ST    5,96(13)
         MVC   100(4,13),104(13)
         LA    1,88(,13)
         L     15,=A(MARK@SEE)
         BALR  14,15
         SLR   7,7
         B     L1391
L1390    EQU   *
         CR    7,5
         BNL   L1359
         LR    2,7
         SRL   2,3
         SLR   3,3
         IC    3,0(6,2)
         LR    2,3
         LR    3,7
         N     3,=F'7'
         SRA   2,0(3)
         X     2,=F'1'
         N     2,=F'1'
         LTR   2,2
         BE    L1360
         MVC   88(4,13),=A(LC33)
         L     2,12(4)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1360    EQU   *
         A     7,=F'1'
         L     4,0(4)
L1391    EQU   *
         LTR   4,4
         BNE   L1390
L1359    EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L1357    EQU   *
         L     5,=V(CFUN)
         L     2,0(5)
         L     2,4(2)
         L     4,16(2)
         L     3,24(4)
         LTR   3,3
         BE    L1363
         L     2,0(3)
         LTR   2,2
         BE    L1363
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         ST    15,24(4)
L1363    EQU   *
         L     2,0(5)
         L     2,4(2)
         L     2,16(2)
         L     4,24(2)
         LTR   4,4
         BE    L1389
L1386    EQU   *
         L     2,12(8)
         B     L1367
L1370    EQU   *
         L     2,0(2)
L1367    EQU   *
         LTR   2,2
         BE    L1368
         MVC   88(4,13),12(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L1370
L1368    EQU   *
         LTR   2,2
         BNE   L1371
         L     3,52(8)
         LTR   3,3
         BNE   L1372
         MVC   88(4,13),=A(LC34)
         L     2,12(4)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     L1371
L1372    EQU   *
         MVC   88(4,13),=A(LC35)
         L     2,12(4)
         MVC   92(4,13),12(2)
         LR    2,3
         CLI   8(3),1
         BE    L1375
         L     2,44(3)
L1375    EQU   *
         MVC   96(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1371    EQU   *
         MVC   88(4,13),12(4)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1366
         L     2,12(8)
         B     L1377
L1380    EQU   *
         L     2,0(2)
L1377    EQU   *
         LTR   2,2
         BE    L1378
         MVC   88(4,13),16(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L1380
L1378    EQU   *
         LTR   2,2
         BNE   L1366
         L     3,52(8)
         LTR   3,3
         BNE   L1382
         MVC   88(4,13),=A(LC34)
         L     2,16(4)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     L1366
L1382    EQU   *
         MVC   88(4,13),=A(LC35)
         L     2,16(4)
         MVC   92(4,13),12(2)
         LR    2,3
         CLI   8(3),1
         BE    L1385
         L     2,44(3)
L1385    EQU   *
         MVC   96(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1366    EQU   *
         L     4,4(4)
         LTR   4,4
         BNE   L1386
L1389    EQU   *
* Function ZZZ_154 epilogue
         PDPEPIL
* Function ZZZ_154 literal pool
         DS    0F
         LTORG
* Function ZZZ_154 page table
         DS    0F
PGT82    EQU   *
         DC    A(PG82)
         DS    0F
* Function case_bit_test_cmp,F20 prologue
@@F20    PDPPRLG CINDEX=83,FRAME=88,BASER=12,ENTRY=NO
         B     FEN83
         LTORG
FEN83    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG83     EQU   *
         LR    11,1
         L     10,=A(PGT83)
* Function case_bit_test_cmp code
         L     3,4(11)
         L     2,0(11)
         L     15,12(3)
         S     15,12(2)
* Function case_bit_test_cmp epilogue
         PDPEPIL
* Function case_bit_test_cmp literal pool
         DS    0F
         LTORG
* Function case_bit_test_cmp page table
         DS    0F
PGT83    EQU   *
         DC    A(PG83)
         DS    0F
* Function balance_case_nodes,F28 prologue
@@F28    PDPPRLG CINDEX=84,FRAME=104,BASER=12,ENTRY=NO
         B     FEN84
         LTORG
FEN84    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG84     EQU   *
         LR    11,1
         L     10,=A(PGT84)
* Function balance_case_nodes code
         L     7,0(11)
         MVC   96(4,13),4(11)
L1408    EQU   *
         L     3,0(7)
         LTR   3,3
         BE    L1393
         SLR   5,5
         LR    6,5
         LR    8,5
L1400    EQU   *
         MVC   88(4,13),12(3)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1397
         A     8,=F'1'
         L     2,=A(@@V2)
         L     2,0(2)
         LTR   2,2
         BE    L1397
         L     2,16(3)
         L     2,12(2)
         SLL   2,1
         A     2,=A(@@V3+2)
         LH    2,0(2)
         AR    6,2
L1397    EQU   *
         L     2,=A(@@V2)
         L     15,0(2)
         LTR   15,15
         BE    L1399
         L     2,12(3)
         L     2,12(2)
         SLL   2,1
         A     2,=A(@@V3+2)
         LH    2,0(2)
         AR    6,2
L1399    EQU   *
         A     5,=F'1'
         L     3,4(3)
         LTR   3,3
         BNE   L1400
         L     9,0(7)
         LA    2,2(0,0)
         CR    5,2
         BNH   L1401
         LR    4,7
         LTR   15,15
         BE    L1402
         LR    8,3
         LR    2,6
         A     2,=F'1'
         LR    5,2
         SRL   5,31
         AR    5,2
         SRA   5,1
L1403    EQU   *
         L     2,0(4)
         MVC   88(4,13),12(2)
         L     2,0(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1405
         L     2,0(4)
         L     2,16(2)
         L     2,12(2)
         SLL   2,1
         A     2,=A(@@V3+2)
         LH    2,0(2)
         SR    5,2
L1405    EQU   *
         L     3,0(4)
         L     2,12(3)
         L     2,12(2)
         SLL   2,1
         A     2,=A(@@V3+2)
         LH    2,0(2)
         SR    5,2
         BNH   L1404
         LR    4,3
         A     4,=F'4'
         A     8,=F'1'
         B     L1403
L1404    EQU   *
         LTR   8,8
         BNE   L1413
         L     3,0(7)
         MVC   8(4,3),96(13)
         ST    3,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
         L     2,4(3)
         LTR   2,2
         BE    L1393
L1412    EQU   *
         L     2,4(3)
         ST    3,8(2)
         LR    3,2
         L     2,4(2)
         LTR   2,2
         BNE   L1412
         B     L1393
L1402    EQU   *
         LA    2,3(0,0)
         CLR   5,2
         BNE   L1414
         LR    4,9
         A     4,=F'4'
         B     L1413
L1414    EQU   *
         LR    2,5
         AR    2,8
         A     2,=F'1'
         LR    5,2
         SRL   5,31
         AR    5,2
         SRA   5,1
L1416    EQU   *
         L     2,0(4)
         MVC   88(4,13),12(2)
         L     2,0(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1418
         BCTR  5,0
L1418    EQU   *
         BCTR  5,0
         LTR   5,5
         BNH   L1413
         L     4,0(4)
         A     4,=F'4'
         B     L1416
L1413    EQU   *
         L     3,0(4)
         ST    3,0(7)
         MVC   0(4,4),=F'0'
         MVC   8(4,3),96(13)
         ST    9,0(3)
         ST    3,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
         LR    7,3
         A     7,=F'4'
         ST    3,96(13)
         B     L1408
L1401    EQU   *
         LR    3,9
         MVC   8(4,9),96(13)
         L     2,4(9)
         LTR   2,2
         BE    L1393
L1424    EQU   *
         L     2,4(3)
         ST    3,8(2)
         LR    3,2
         L     2,4(2)
         LTR   2,2
         BNE   L1424
L1393    EQU   *
* Function balance_case_nodes epilogue
         PDPEPIL
* Function balance_case_nodes literal pool
         DS    0F
         LTORG
* Function balance_case_nodes page table
         DS    0F
PGT84    EQU   *
         DC    A(PG84)
         DS    0F
* Function emit_jump_if_reachable,F32 prologue
@@F32    PDPPRLG CINDEX=85,FRAME=96,BASER=12,ENTRY=NO
         B     FEN85
         LTORG
FEN85    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG85     EQU   *
         LR    11,1
         L     10,=A(PGT85)
* Function emit_jump_if_reachable code
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'48'
         BE    L1430
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(ZZZ@553)
         BALR  14,15
L1430    EQU   *
* Function emit_jump_if_reachable epilogue
         PDPEPIL
* Function emit_jump_if_reachable literal pool
         DS    0F
         LTORG
* Function emit_jump_if_reachable page table
         DS    0F
PGT85    EQU   *
         DC    A(PG85)
         DS    0F
* Function do_jump_if_equal,F23 prologue
@@F23    PDPPRLG CINDEX=86,FRAME=120,BASER=12,ENTRY=NO
         B     FEN86
         LTORG
FEN86    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG86     EQU   *
         LR    11,1
         L     10,=A(PGT86)
* Function do_jump_if_equal code
         L     15,0(11)
         L     3,4(11)
         L     4,8(11)
         LH    2,0(15)
         CLM   2,3,=H'67'
         BNE   L1433
         LH    2,0(3)
         CLM   2,3,=H'67'
         BNE   L1433
         CLR   15,3
         BNE   L1432
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@553)
         BALR  14,15
         B     L1432
L1433    EQU   *
         ST    15,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'116'
         MVC   100(4,13),=F'0'
         IC    2,2(15)
         CLM   2,1,=XL1'00'
         BNE   L1436
         SLR   2,2
         IC    2,2(3)
         B     L1437
L1436    EQU   *
         SLR   2,2
         IC    2,2(15)
L1437    EQU   *
         ST    2,104(13)
         MVC   108(4,13),12(11)
         ST    4,112(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
L1432    EQU   *
* Function do_jump_if_equal epilogue
         PDPEPIL
* Function do_jump_if_equal literal pool
         DS    0F
         LTORG
* Function do_jump_if_equal page table
         DS    0F
PGT86    EQU   *
         DC    A(PG86)
         DS    0F
* Function same_case_target_p,F25 prologue
@@F25    PDPPRLG CINDEX=87,FRAME=96,BASER=12,ENTRY=NO
         B     FEN87
         LTORG
FEN87    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG87     EQU   *
         LR    11,1
         L     10,=A(PGT87)
* Function same_case_target_p code
         L     4,0(11)
         L     5,4(11)
         LA    15,1(0,0)
         CLR   4,5
         BE    L1438
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         LR    3,15
         LA    15,1(0,0)
         CLR   2,3
         BE    L1438
         LTR   2,2
         BE    L1441
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(SIMPLEJU)
         BALR  14,15
         LTR   15,15
         BE    L1441
         L     2,24(2)
         L     2,8(2)
         L     4,4(2)
L1441    EQU   *
         LTR   3,3
         BE    L1442
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SIMPLEJU)
         BALR  14,15
         LTR   15,15
         BE    L1442
         L     2,24(3)
         L     2,8(2)
         L     5,4(2)
L1442    EQU   *
         XR    4,5
         LPR   15,4
         BCTR  15,0
         SRL   15,31
L1438    EQU   *
* Function same_case_target_p epilogue
         PDPEPIL
* Function same_case_target_p literal pool
         DS    0F
         LTORG
* Function same_case_target_p page table
         DS    0F
PGT87    EQU   *
         DC    A(PG87)
         DS    0F
* Function node_has_low_bound,F29 prologue
@@F29    PDPPRLG CINDEX=88,FRAME=104,BASER=12,ENTRY=NO
         B     FEN88
         LTORG
FEN88    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG88     EQU   *
         LR    11,1
         L     10,=A(PGT88)
* Function node_has_low_bound code
         L     4,0(11)
         MVC   88(4,13),12(4)
         L     2,4(11)
         MVC   92(4,13),56(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LR    3,15
         LA    15,1(0,0)
         LTR   3,3
         BNE   L1444
         L     2,0(4)
         LR    15,3
         LTR   2,2
         BNE   L1444
         MVC   88(4,13),=F'60'
         L     2,12(4)
         MVC   92(4,13),4(2)
         ST    2,96(13)
         L     2,=V(GLOBAL@T)
         MVC   100(4,13),48(2)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1444
         B     L1447
L1455    EQU   *
         LA    15,1(0,0)
         B     L1444
L1447    EQU   *
         L     2,8(4)
L1456    EQU   *
         LTR   2,2
         BE    L1454
         ST    3,88(13)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1455
         L     2,8(2)
         B     L1456
L1454    EQU   *
         SLR   15,15
L1444    EQU   *
* Function node_has_low_bound epilogue
         PDPEPIL
* Function node_has_low_bound literal pool
         DS    0F
         LTORG
* Function node_has_low_bound page table
         DS    0F
PGT88    EQU   *
         DC    A(PG88)
         DS    0F
* Function node_has_high_bound,F30 prologue
@@F30    PDPPRLG CINDEX=89,FRAME=104,BASER=12,ENTRY=NO
         B     FEN89
         LTORG
FEN89    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG89     EQU   *
         LR    11,1
         L     10,=A(PGT89)
* Function node_has_high_bound code
         L     4,0(11)
         L     2,4(11)
         L     2,60(2)
         LA    3,1(0,0)
         LTR   2,2
         BE    L1457
         MVC   88(4,13),16(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1457
         L     2,4(4)
         LR    3,15
         LTR   2,2
         BNE   L1457
         MVC   88(4,13),=F'59'
         L     2,16(4)
         MVC   92(4,13),4(2)
         ST    2,96(13)
         L     2,=V(GLOBAL@T)
         MVC   100(4,13),48(2)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),16(4)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L1457
         B     L1461
L1469    EQU   *
         LA    3,1(0,0)
         B     L1457
L1461    EQU   *
         L     2,8(4)
L1470    EQU   *
         LTR   2,2
         BE    L1468
         ST    5,88(13)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1469
         L     2,8(2)
         B     L1470
L1468    EQU   *
         SLR   3,3
L1457    EQU   *
         LR    15,3
* Function node_has_high_bound epilogue
         PDPEPIL
* Function node_has_high_bound literal pool
         DS    0F
         LTORG
* Function node_has_high_bound page table
         DS    0F
PGT89    EQU   *
         DC    A(PG89)
         DS    0F
* Function node_is_bounded,F31 prologue
@@F31    PDPPRLG CINDEX=90,FRAME=96,BASER=12,ENTRY=NO
         B     FEN90
         LTORG
FEN90    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG90     EQU   *
         LR    11,1
         L     10,=A(PGT90)
* Function node_is_bounded code
         L     2,0(11)
         L     3,4(11)
         SLR   4,4
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F29)
         BALR  14,15
         LTR   15,15
         BE    L1472
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         LTR   15,15
         BE    L1472
         LA    4,1(0,0)
L1472    EQU   *
         LR    15,4
* Function node_is_bounded epilogue
         PDPEPIL
* Function node_is_bounded literal pool
         DS    0F
         LTORG
* Function node_is_bounded page table
         DS    0F
PGT90    EQU   *
         DC    A(PG90)
         DS    0F
* Function emit_case_nodes,F33 prologue
@@F33    PDPPRLG CINDEX=91,FRAME=136,BASER=12,ENTRY=NO
         B     FEN91
         LTORG
FEN91    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG91     EQU   *
         LR    11,1
         L     10,=A(PGT91)
* Function emit_case_nodes code
         MVC   120(4,13),0(11)
         L     7,4(11)
         MVC   124(4,13),8(11)
         MVC   128(4,13),12(11)
L1528    EQU   *
         L     12,0(,10)
         L     2,128(13)
         L     8,8(2)
         SRL   8,18
         N     8,=F'1'
         L     3,120(13)
         SLR   9,9
         IC    9,2(3)
         LH    3,32(2)
         N     3,=F'127'
         ST    3,132(13)
         ST    7,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         LR    4,15
         LTR   15,15
         L     14,=A(L1508)
         BNER  14
         MVC   88(4,13),12(7)
         MVC   92(4,13),16(7)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         L     14,=A(L1476)
         BER   14
         MVC   88(4,13),12(7)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),20(7)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         L     3,4(7)
         LTR   3,3
         BE    L1477
         L     2,0(7)
         LTR   2,2
         BE    L1477
         ST    3,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    L1478
         MVC   88(4,13),16(7)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    3,15
         L     2,4(7)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    3,92(13)
         MVC   96(4,13),=F'118'
         ST    4,100(13)
         L     14,=A(L1523)
         BR    14
L1478    EQU   *
         MVC   88(4,13),0(7)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    L1481
         MVC   88(4,13),16(7)
         ST    5,92(13)
         ST    5,96(13)
         ST    5,100(13)
         ST    5,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    3,15
         L     2,0(7)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    3,92(13)
         MVC   96(4,13),=F'120'
         ST    5,100(13)
         L     14,=A(L1520)
         BR    14
L1481    EQU   *
         MVC   88(4,13),=F'31'
         ST    15,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@72)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),16(7)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    2,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         MVC   96(4,13),=F'118'
         ST    4,100(13)
         ST    9,104(13)
         ST    8,108(13)
         ST    15,112(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
         MVC   88(4,13),120(13)
         MVC   92(4,13),0(7)
         MVC   96(4,13),124(13)
         MVC   100(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F33)
         BALR  14,15
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         ST    3,88(13)
         L     14,=A(L1521)
         BR    14
L1477    EQU   *
         LTR   3,3
         BE    L1484
         L     2,0(7)
         LTR   2,2
         BNE   L1484
         L     2,4(3)
         LTR   2,2
         BNE   L1486
         L     4,0(3)
         LTR   4,4
         BNE   L1486
         MVC   88(4,13),12(3)
         L     2,4(7)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1485
L1486    EQU   *
         ST    7,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F29)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(L1517)
         BNER  14
         MVC   88(4,13),16(7)
         ST    15,92(13)
         ST    15,96(13)
         ST    15,100(13)
         ST    15,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'120'
         ST    2,100(13)
         ST    9,104(13)
         ST    8,108(13)
         MVC   112(4,13),124(13)
         L     14,=A(L1522)
         BR    14
L1485    EQU   *
         L     2,4(7)
         MVC   88(4,13),12(2)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    3,15
         L     2,4(7)
         B     L1526
L1484    EQU   *
         LTR   3,3
         L     14,=A(L1473)
         BNER  14
         L     3,0(7)
         LTR   3,3
         L     14,=A(L1473)
         BER   14
         L     2,0(3)
         LTR   2,2
         BNE   L1492
         L     4,4(3)
         LTR   4,4
         BNE   L1492
         MVC   88(4,13),12(3)
         L     2,0(7)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1491
L1492    EQU   *
         ST    7,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(L1518)
         BNER  14
         MVC   88(4,13),16(7)
         ST    15,92(13)
         ST    15,96(13)
         ST    15,100(13)
         ST    15,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'118'
         ST    2,100(13)
         ST    9,104(13)
         ST    8,108(13)
         MVC   112(4,13),124(13)
         L     14,=A(L1524)
         BR    14
L1491    EQU   *
         L     2,0(7)
         MVC   88(4,13),12(2)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    3,15
         L     2,0(7)
L1526    EQU   *
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    3,92(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=A(@@F23)
         BALR  14,15
         L     14,=A(L1473)
         BR    14
L1476    EQU   *
         L     3,4(7)
         LTR   3,3
         BE    L1496
         L     2,0(7)
         LTR   2,2
         BE    L1496
         LR    4,15
         ST    3,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F31)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L1497
         MVC   88(4,13),16(7)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    3,15
         L     2,4(7)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    3,92(13)
         MVC   96(4,13),=F'118'
         ST    4,100(13)
         B     L1519
L1497    EQU   *
         MVC   88(4,13),=F'31'
         ST    4,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@72)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),16(7)
         ST    3,92(13)
         ST    3,96(13)
         ST    3,100(13)
         ST    3,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    2,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         MVC   96(4,13),=F'118'
         ST    3,100(13)
L1519    EQU   *
         ST    9,104(13)
         ST    8,108(13)
         ST    15,112(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
         MVC   88(4,13),12(7)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),20(7)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         MVC   96(4,13),=F'117'
         MVC   100(4,13),=F'0'
         ST    9,104(13)
         ST    8,108(13)
         ST    15,112(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
         MVC   88(4,13),120(13)
         MVC   92(4,13),0(7)
         MVC   96(4,13),124(13)
         MVC   100(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F33)
         BALR  14,15
         LTR   4,4
         L     14,=A(L1473)
         BER   14
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         ST    4,88(13)
L1521    EQU   *
         LA    1,88(,13)
         L     15,=A(ZZZ@648)
         BALR  14,15
         B     L1517
L1496    EQU   *
         LTR   3,3
         BE    L1501
         L     4,0(7)
         LTR   4,4
         BNE   L1501
         ST    7,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F29)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   L1502
         MVC   88(4,13),12(7)
         ST    15,92(13)
         ST    15,96(13)
         ST    15,100(13)
         ST    15,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'120'
         ST    2,100(13)
         ST    9,104(13)
         ST    8,108(13)
         MVC   112(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
L1502    EQU   *
         MVC   88(4,13),16(7)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),20(7)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         MVC   96(4,13),=F'119'
         ST    4,100(13)
L1520    EQU   *
         ST    9,104(13)
         ST    8,108(13)
         ST    15,112(13)
L1522    EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
L1517    EQU   *
         L     7,4(7)
         B     L1528
L1501    EQU   *
         LTR   3,3
         BNE   L1504
         L     2,0(7)
         LTR   2,2
         BE    L1504
         ST    7,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   L1505
         MVC   88(4,13),16(7)
         ST    15,92(13)
         ST    15,96(13)
         ST    15,100(13)
         ST    15,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'118'
         ST    2,100(13)
         ST    9,104(13)
         ST    8,108(13)
         MVC   112(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
L1505    EQU   *
         MVC   88(4,13),12(7)
         ST    3,92(13)
         ST    3,96(13)
         ST    3,100(13)
         ST    3,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),20(7)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         MVC   96(4,13),=F'117'
         ST    3,100(13)
L1523    EQU   *
         ST    9,104(13)
         ST    8,108(13)
         ST    15,112(13)
L1524    EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
L1518    EQU   *
         L     7,0(7)
         B     L1528
L1504    EQU   *
         ST    7,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F30)
         BALR  14,15
         LR    6,15
         ST    7,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@F29)
         BALR  14,15
         LR    2,15
         LTR   6,6
         BNE   L1507
         LTR   15,15
         BE    L1507
         MVC   88(4,13),16(7)
         ST    6,92(13)
         ST    6,96(13)
         ST    6,100(13)
         ST    6,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'118'
         ST    6,100(13)
         B     L1527
L1507    EQU   *
         LTR   2,2
         L     14,=A(L1508)
         BNER  14
         LTR   6,6
         BE    L1515
         MVC   88(4,13),12(7)
         ST    2,92(13)
         ST    2,96(13)
         ST    2,100(13)
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@210)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'120'
         ST    2,100(13)
L1527    EQU   *
         ST    9,104(13)
         ST    8,108(13)
         L     14,=A(L1525)
         BR    14
L1515    EQU   *
         ST    9,88(13)
         ST    8,92(13)
         L     2,=V(LANG@HOO)
         L     2,296(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'112'
         ST    15,92(13)
         MVC   96(4,13),12(7)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'112'
         ST    2,92(13)
         MVC   96(4,13),16(7)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    5,15
         ST    4,88(13)
         ST    6,92(13)
         ST    9,96(13)
         ST    6,100(13)
         ST    6,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),=F'89'
         MVC   96(4,13),120(13)
         ST    15,100(13)
         ST    6,104(13)
         ST    8,108(13)
         MVC   112(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(ZZZ@658)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'60'
         ST    2,92(13)
         ST    5,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,88(13)
         ST    6,92(13)
         ST    9,96(13)
         ST    6,100(13)
         ST    6,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    3,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'118'
         ST    6,100(13)
         ST    9,104(13)
         MVC   108(4,13),=F'1'
L1525    EQU   *
         MVC   112(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
L1508    EQU   *
         MVC   88(4,13),20(7)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@553)
         BALR  14,15
L1473    EQU   *
* Function emit_case_nodes epilogue
         PDPEPIL
* Function emit_case_nodes literal pool
         DS    0F
         LTORG
* Function emit_case_nodes page table
         DS    0F
PGT91    EQU   *
         DC    A(PG91)
         DS    0F
@@V4     EQU   *
         DC    1X'00'
* Program data area
@@V5     EQU   *
         DC    X'01'
* Program text area
LC36     EQU   *
         DC    C'switch missing default case'
         DC    X'0'
         DS    0F
* X-func ZZZ_627 prologue
ZZZ@627  PDPPRLG CINDEX=92,FRAME=224,BASER=12,ENTRY=YES
         B     FEN92
         LTORG
FEN92    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG92     EQU   *
         LR    11,1
         L     10,=A(PGT92)
* Function ZZZ_627 code
         MVC   176(4,13),=F'0'
         MVC   180(4,13),176(13)
         MVC   184(4,13),176(13)
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,4(2)
         L     8,16(2)
         MVI   200(13),0
         LTR   8,8
         L     14,=A(L1529)
         BER   14
         MVC   196(4,13),32(8)
         L     4,196(13)
         L     9,4(4)
         L     5,8(9)
         SRL   5,18
         ST    5,204(13)
         NC    204(4,13),=F'1'
         L     7,4(11)
         LTR   7,7
         BNE   L1531
         L     2,0(11)
         MVC   4(4,11),4(2)
L1531    EQU   *
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@F18)
         BALR  14,15
         L     6,=V(GLOBAL@T)
         CL    9,0(6)
         L     14,=A(L1532)
         BER   14
         L     2,=V(ZZZ@2042)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L1535
         L     2,28(8)
         LTR   2,2
         BE    L1534
L1535    EQU   *
         L     2,=V(ZZZ@2044)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L1533
L1534    EQU   *
         L     15,4(11)
         CLI   8(15),10
         BNE   L1533
         L     2,196(13)
         CLI   8(2),25
         BE    L1533
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@154)
         BALR  14,15
L1533    EQU   *
         L     2,=V(ZZZ@2043)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L1536
         L     2,28(8)
         LTR   2,2
         BNE   L1536
         MVC   88(4,13),=A(LC36)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L1536    EQU   *
         L     2,28(8)
         LTR   2,2
         BNE   L1537
         MVC   88(4,13),=F'31'
         ST    2,92(13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@72)
         BALR  14,15
         ST    15,28(8)
         L     2,12(8)
         LTR   2,2
         BE    L1538
         ST    15,88(13)
         MVC   92(4,13),12(8)
         LA    1,88(,13)
         L     15,=V(ZZZ@1886)
         BALR  14,15
         MVI   200(13),1
L1538    EQU   *
         MVC   88(4,13),28(8)
         LA    1,88(,13)
         L     15,=A(ZZZ@648)
         BALR  14,15
L1537    EQU   *
         MVC   88(4,13),28(8)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,188(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    15,168(13)
         L     3,24(8)
         LTR   3,3
         BE    L1539
         L     2,0(3)
         LTR   2,2
         BE    L1539
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F22)
         BALR  14,15
         ST    15,24(8)
L1539    EQU   *
         L     3,24(8)
L1718    EQU   *
         LTR   3,3
         BE    L1687
         MVC   88(4,13),20(3)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         LR    5,15
         LR    4,3
         B     L1542
L1544    EQU   *
         MVC   16(4,3),16(4)
L1542    EQU   *
         L     4,4(4)
         LTR   4,4
         BE    L1543
         MVC   88(4,13),20(4)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F25)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L1543
         MVC   88(4,13),=F'59'
         L     2,16(3)
         MVC   92(4,13),4(2)
         MVC   96(4,13),16(3)
         MVC   100(4,13),48(6)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         MVC   88(4,13),12(4)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BE    L1543
         MVC   88(4,13),=F'59'
         L     2,16(3)
         MVC   92(4,13),4(2)
         MVC   96(4,13),16(3)
         MVC   100(4,13),48(6)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         MVC   88(4,13),16(3)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BNE   L1544
L1543    EQU   *
         ST    4,4(3)
         LR    3,4
         B     L1718
L1687    EQU   *
         LR    3,8
         A     3,=F'24'
         ST    3,220(13)
L1732    EQU   *
         L     2,0(3)
         LTR   2,2
         BE    L1689
         L     2,0(3)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),188(13)
         LA    1,88(,13)
         L     15,=A(@@F25)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L1549
         MVC   0(4,3),4(2)
         B     L1732
L1549    EQU   *
         LR    3,2
         A     3,=F'4'
         B     L1732
L1689    EQU   *
         SLR   5,5
         LR    6,5
         L     3,24(8)
         LTR   3,3
         BE    L1571
L1570    EQU   *
         L     2,12(3)
         CLI   8(2),25
         BE    L1556
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'5444'
         L     14,=A(L1731)
         BR    14
L1556    EQU   *
         L     2,16(3)
         CLI   8(2),25
         BE    L1557
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'5446'
         L     14,=A(L1731)
         BR    14
L1557    EQU   *
         ST    9,88(13)
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    15,12(3)
         ST    9,88(13)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    15,16(3)
         A     5,=F'1'
         L     4,12(3)
         LA    7,1(0,0)
         CLR   5,7
         BNE   L1558
         ST    4,176(13)
         ST    15,180(13)
         B     L1559
L1714    EQU   *
         BCTR  6,0
         B     L1566
L1558    EQU   *
         L     15,16(4)
         L     7,176(13)
         L     2,16(7)
         CR    15,2
         BL    L1561
         BNE   L1560
         L     2,12(4)
         CL    2,12(7)
         BNL   L1560
L1561    EQU   *
         ST    4,176(13)
L1560    EQU   *
         L     4,16(3)
         L     2,180(13)
         L     15,16(2)
         L     2,16(4)
         CR    15,2
         BL    L1563
         BNE   L1559
         L     7,180(13)
         L     2,12(7)
         CL    2,12(4)
         BNL   L1559
L1563    EQU   *
         ST    4,180(13)
L1559    EQU   *
         MVC   88(4,13),12(3)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1980)
         BALR  14,15
         LTR   15,15
         BNE   L1564
         A     5,=F'1'
L1564    EQU   *
         A     6,=F'1'
         MVC   88(4,13),20(3)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         LR    4,15
         L     2,24(8)
L1720    EQU   *
         CLR   2,3
         BE    L1566
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F25)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L1714
         L     2,4(2)
         B     L1720
L1566    EQU   *
         L     3,4(3)
         LTR   3,3
         BNE   L1570
         LTR   5,5
         BE    L1571
         MVC   88(4,13),=F'60'
         ST    9,92(13)
         MVC   96(4,13),180(13)
         MVC   100(4,13),176(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,184(13)
L1571    EQU   *
         LA    1,88(,13)
         L     15,=A(END@CLEA)
         BALR  14,15
         LTR   5,5
         BNE   L1572
         MVC   88(4,13),196(13)
         L     2,=V(ZZZ@206)
         MVC   92(4,13),256(2)
         ST    5,96(13)
         ST    5,100(13)
         ST    5,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         L     14,=A(L1628)
         BR    14
L1572    EQU   *
         L     7,=V(WORD@MOD)
         L     4,0(7)
         LR    2,4
         SLL   2,3
         L     15,=V(OPTAB@TA)
         A     2,84(15)
         L     2,4(2)
         LA    3,145(0,0)
         CLR   2,3
         L     14,=A(L1574)
         BER   14
         L     15,196(13)
         L     3,8(15)
         SRL   3,22
         N     3,=F'1'
         LTR   3,3
         L     14,=A(L1574)
         BNER  14
         MVC   88(4,13),184(13)
         L     15,=V(MODE@SIZ)
         SLR   2,2
         IC    2,0(15,4)
         SLL   2,3
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         L     14,=A(L1574)
         BNLR  14
         MVC   88(4,13),184(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         L     14,=A(L1574)
         BNHR  14
         L     4,=A(@@V4)
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BNE   L1575
         MVC   88(4,13),0(7)
         MVC   92(4,13),=F'10000'
         LA    1,88(,13)
         L     15,=V(ZZZ@993)
         BALR  14,15
         MVC   88(4,13),=F'100'
         MVC   92(4,13),0(7)
         L     2,=V(ZZZ@206)
         MVC   96(4,13),260(2)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'60'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         LA    2,11(0,0)
         CR    15,2
         BH    L1576
         LA    3,1(0,0)
L1576    EQU   *
         L     2,=A(@@V5)
         STC   3,0(2)
         MVI   0(4),1
L1575    EQU   *
         L     2,=A(@@V5)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         L     14,=A(L1574)
         BER   14
         LA    3,1(0,0)
         CLR   6,3
         BNE   L1579
         LA    4,2(0,0)
         CLR   5,4
         BH    L1578
         B     L1580
L1579    EQU   *
         LA    15,2(0,0)
         CLR   6,15
         BNE   L1580
         LA    2,4(0,0)
         CLR   5,2
         BH    L1578
         L     14,=A(L1574)
         BR    14
L1580    EQU   *
         LA    3,3(0,0)
         CLR   6,3
         L     14,=A(L1574)
         BNER  14
         LA    4,5(0,0)
         CLR   5,4
         L     14,=A(L1574)
         BNHR  14
L1578    EQU   *
         MVC   88(4,13),176(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BNH   L1581
         MVC   88(4,13),180(13)
         L     2,0(7)
         L     5,=V(MODE@SIZ)
         SLR   7,7
         IC    7,0(5,2)
         LR    2,7
         SLL   2,3
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BNL   L1581
         L     2,=V(GLOBAL@T)
         MVC   176(4,13),44(2)
         MVC   184(4,13),180(13)
L1581    EQU   *
         MVC   208(4,13),=F'0'
         L     7,24(8)
L1721    EQU   *
         LTR   7,7
         BE    L1694
         MVC   88(4,13),20(7)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         LR    3,15
         SLR   6,6
L1722    EQU   *
         CL    6,208(13)
         BNL   L1586
         ST    3,88(13)
         LR    2,6
         SLL   2,4
         L     2,128(13,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F25)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L1586
         A     6,=F'1'
         B     L1722
L1586    EQU   *
         CL    6,208(13)
         BNE   L1590
         LA    15,2(0,0)
         CLR   6,15
         BNH   L1591
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'5293'
         L     14,=A(L1731)
         BR    14
L1591    EQU   *
         LR    2,6
         SLL   2,4
         SLR   4,4
         ST    4,120(13,2)
         ST    4,124(2,13)
         AR    2,13
         A     2,=F'128'
         ST    3,0(2)
         MVC   4(4,2),=F'1'
         LR    5,6
         A     5,=F'1'
         ST    5,208(13)
         B     L1592
L1590    EQU   *
         LR    2,6
         SLL   2,4
         L     15,132(13,2)
         A     15,=F'1'
         ST    15,132(13,2)
L1592    EQU   *
         MVC   88(4,13),=F'60'
         ST    9,92(13)
         MVC   96(4,13),12(7)
         MVC   100(4,13),176(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'60'
         ST    9,92(13)
         MVC   96(4,13),16(7)
         MVC   100(4,13),176(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    4,2
         CLR   2,15
         BH    L1697
         LR    5,2
         A     5,=F'-32'
L1598    EQU   *
         LR    3,6
         SLL   3,4
         LA    2,31(0,0)
         CLR   4,2
         BNH   L1596
         LA    2,1(0,0)
         SLL   2,0(5)
         O     2,120(3,13)
         ST    2,120(3,13)
         B     L1595
L1596    EQU   *
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,124(3,13)
         ST    2,124(3,13)
L1595    EQU   *
         A     4,=F'1'
         A     5,=F'1'
         CLR   4,15
         BNH   L1598
L1697    EQU   *
         L     7,4(7)
         B     L1721
L1694    EQU   *
         LR    3,13
         A     3,=F'120'
         ST    3,88(13)
         MVC   92(4,13),208(13)
         MVC   96(4,13),=F'16'
         MVC   100(4,13),=A(@@F20)
         LA    1,88(,13)
         L     15,=V(QSORT)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),196(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    2,15
         ST    9,88(13)
         MVC   92(4,13),176(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'60'
         ST    9,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LH    2,32(9)
         N     2,=F'127'
         MVC   88(4,13),184(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         ST    3,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'122'
         MVC   100(4,13),=F'0'
         ST    2,104(13)
         MVC   108(4,13),=F'1'
         MVC   112(4,13),188(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
         L     4,=V(WORD@MOD)
         MVC   88(4,13),0(4)
         ST    3,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@216)
         BALR  14,15
         MVC   88(4,13),0(4)
         L     5,=V(OPTAB@TA)
         MVC   92(4,13),84(5)
         L     5,=V(ZZZ@206)
         MVC   96(4,13),260(5)
         ST    15,100(13)
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'1'
         MVC   112(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(ZZZ@589)
         BALR  14,15
         LR    3,15
         SLR   6,6
L1723    EQU   *
         CL    6,208(13)
         L     14,=A(L1628)
         BNLR  14
         LR    2,6
         SLL   2,4
         L     7,124(2,13)
         ST    7,88(13)
         L     15,120(13,2)
         ST    15,92(13)
         MVC   96(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(IMMED@DO)
         BALR  14,15
         MVC   88(4,13),0(4)
         L     7,=V(OPTAB@TA)
         MVC   92(4,13),72(7)
         ST    3,96(13)
         ST    15,100(13)
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'1'
         MVC   112(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(ZZZ@589)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),256(5)
         MVC   96(4,13),=F'115'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),0(4)
         MVC   108(4,13),=F'1'
         L     2,128(13,2)
         ST    2,112(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
         A     6,=F'1'
         B     L1723
L1574    EQU   *
         LA    1,88(,13)
         L     15,=V(CASE@VAL)
         BALR  14,15
         CLR   5,15
         L     14,=A(L1607)
         BLR   14
         MVC   88(4,13),184(13)
         L     3,=V(ZZZ@1619)
         L     2,0(3)
         LTR   2,2
         BE    L1608
         LR    2,5
         SLL   2,1
         B     L1724
L1715    EQU   *
         L     12,0(,10)
         ST    3,88(13)
         ST    7,92(13)
         MVC   96(4,13),204(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@216)
         BALR  14,15
         LR    7,15
         L     14,=A(L1610)
         BR    14
L1608    EQU   *
         LR    2,5
         SLL   2,3
         AR    2,5
L1724    EQU   *
         AR    2,5
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BH    L1607
         MVC   88(4,13),184(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BL    L1607
         L     15,196(13)
         L     2,8(15)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L1606)
         BER   14
L1607    EQU   *
         MVC   88(4,13),196(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         LR    7,15
         SLR   2,2
         IC    2,2(15)
         L     3,=V(MODE@CLA)
         IC    2,0(3,2)
         CLM   2,1,=XL1'02'
         L     14,=A(L1610)
         BNER  14
         MVC   88(4,13),=F'87'
         SLR   2,2
         IC    2,2(15)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         L     14,=A(L1610)
         BNER  14
         SLR   3,3
         IC    3,2(7)
L1725    EQU   *
         L     12,0(,10)
         LTR   3,3
         L     14,=A(L1610)
         BER   14
         MVC   88(4,13),=F'87'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         BNE   L1715
         L     2,=V(MODE@WID)
         SLR   4,4
         IC    4,0(2,3)
         LR    3,4
         B     L1725
L1610    EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         B     PGE92
         DS    0F
         LTORG
         DS    0F
PGE92    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG93     EQU   *
         ST    7,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         LR    7,15
         LH    2,0(15)
         CLM   2,3,=H'79'
         BNE   L1616
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@226)
         BALR  14,15
         LR    7,15
L1616    EQU   *
         L     12,4(,10)
         LH    2,0(7)
         CLM   2,3,=H'67'
         BE    L1618
         L     5,196(13)
         CLI   8(5),25
         BNE   L1617
L1618    EQU   *
         L     12,4(,10)
         L     15,196(13)
         CLI   8(15),25
         BE    L1619
         MVC   88(4,13),4(7)
         L     2,204(13)
         LTR   2,2
         BNE   L1622
         L     2,4(7)
         LTR   2,2
         BL    L1620
L1622    EQU   *
         L     12,4(,10)
         SLR   2,2
         B     L1621
L1620    EQU   *
         L     12,4(,10)
         L     2,=F'-1'
L1621    EQU   *
         L     12,4(,10)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    15,196(13)
L1619    EQU   *
         L     12,4(,10)
         L     3,24(8)
L1726    EQU   *
         L     12,4(,10)
         LTR   3,3
         BE    L1624
         MVC   88(4,13),196(13)
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BNE   L1625
         MVC   88(4,13),16(3)
         MVC   92(4,13),196(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1981)
         BALR  14,15
         LTR   15,15
         BE    L1624
L1625    EQU   *
         L     12,4(,10)
         L     3,4(3)
         B     L1726
L1624    EQU   *
         L     12,4(,10)
         LTR   3,3
         BE    L1628
         MVC   88(4,13),20(3)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         B     L1730
L1628    EQU   *
         L     12,4(,10)
         MVC   88(4,13),188(13)
L1730    EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(ZZZ@553)
         BALR  14,15
         L     14,=A(L1573)
         BR    14
L1617    EQU   *
         L     12,4(,10)
         MVC   212(4,13),=F'0'
         L     3,4(11)
         CLI   8(3),10
         BE    L1631
         L     6,24(8)
         L     2,=V(GLOBAL@T)
         MVC   216(4,13),52(2)
         MVC   88(4,13),=F'127'
         MVC   92(4,13),212(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         L     2,16(6)
         MVC   88(4,13),4(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         L     3,=A(@@V6)
         L     2,0(3)
         LTR   2,2
         BNE   L1632
         MVC   0(4,3),=F'1'
         L     4,212(13)
         L     5,=A(@@V3+2)
L1641    EQU   *
         L     12,4(,10)
         LR    2,4
         N     2,=F'255'
         AR    2,2
         L     3,=V(ZZZ@2096)
         LH    3,0(2,3)
         N     3,=XL4'0000FFFF'
         LR    2,3
         N     2,=F'140'
         LTR   2,2
         BE    L1636
         MVC   0(2,5),=H'16'
         B     L1635
L1636    EQU   *
         L     12,4(,10)
         LR    2,3
         N     2,=F'32'
         LTR   2,2
         BE    L1638
         MVC   0(2,5),=H'8'
         B     L1635
L1638    EQU   *
         L     12,4(,10)
         N     3,=F'2'
         LTR   3,3
         BE    L1635
         MVC   0(2,5),=H'-1'
L1635    EQU   *
         L     12,4(,10)
         A     4,=F'1'
         A     5,=F'2'
         LA    2,127(0,0)
         CR    4,2
         BNH   L1641
         L     2,=A(@@V3)
         MVC   130(2,2),=H'8'
         MVC   12(2,2),=H'4'
         MVC   2(2,2),=H'4'
         MVC   44(2,2),=H'2'
         MVC   26(2,2),=H'1'
         MVC   24(2,2),=H'1'
         MVC   46(2,2),=H'1'
L1632    EQU   *
         L     12,4(,10)
         LTR   6,6
         BE    L1705
         L     4,12(6)
         L     3,16(4)
         L     5,216(13)
         L     2,16(5)
         CR    3,2
         BL    L1631
         BNE   L1647
         L     2,12(4)
         CL    2,12(5)
         BL    L1631
L1647    EQU   *
         L     12,4(,10)
         L     5,16(6)
         L     3,16(15)
         L     2,16(5)
         CR    3,2
         BL    L1631
         BNE   L1645
         L     2,12(15)
         CL    2,12(5)
         BL    L1631
L1645    EQU   *
         L     12,4(,10)
         L     4,12(4)
         C     4,12(5)
         BH    L1707
         LR    3,4
         AR    3,4
         A     3,=A(@@V3+2)
L1653    EQU   *
         L     12,4(,10)
         LH    2,0(3)
         CH    2,=H'0'
         BL    L1631
         A     4,=F'1'
         A     3,=F'2'
         C     4,12(5)
         BNH   L1653
L1707    EQU   *
         L     12,4(,10)
         L     6,4(6)
         B     L1632
L1705    EQU   *
         L     12,4(,10)
         MVC   212(4,13),=F'1'
L1631    EQU   *
         L     12,4(,10)
         L     2,=A(@@V2)
         MVC   0(4,2),212(13)
         MVC   88(4,13),220(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F28)
         BALR  14,15
         ST    7,88(13)
         L     7,220(13)
         MVC   92(4,13),0(7)
         MVC   96(4,13),188(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=A(@@F33)
         BALR  14,15
         MVC   88(4,13),188(13)
         LA    1,88(,13)
         L     15,=A(@@F32)
         BALR  14,15
         B     L1573
L1606    EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,192(13)
         ST    9,88(13)
         MVC   92(4,13),196(13)
         MVC   96(4,13),176(13)
         MVC   100(4,13),184(13)
         ST    15,104(13)
         MVC   108(4,13),188(13)
         LA    1,88(,13)
         L     15,=V(TRY@CASE)
         BALR  14,15
         LTR   15,15
         BNE   L1656
         L     9,36(8)
         L     2,0(3)
         LTR   2,2
         BNE   L1657
         MVC   88(4,13),176(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BNH   L1657
         MVC   88(4,13),176(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BNL   L1657
         L     2,=V(GLOBAL@T)
         MVC   176(4,13),44(2)
         MVC   184(4,13),180(13)
L1657    EQU   *
         L     12,4(,10)
         ST    9,88(13)
         MVC   92(4,13),196(13)
         MVC   96(4,13),176(13)
         MVC   100(4,13),184(13)
         MVC   104(4,13),192(13)
         MVC   108(4,13),188(13)
         LA    1,88(,13)
         L     15,=V(TRY@TABL)
         BALR  14,15
         LTR   15,15
         BNE   L1656
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'5634'
         B     L1731
L1656    EQU   *
         L     12,4(,10)
         MVC   88(4,13),184(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    7,15
         A     7,=F'1'
         LR    2,7
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    5,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     3,24(8)
L1727    EQU   *
         L     12,4(,10)
         LTR   3,3
         BE    L1709
         MVC   88(4,13),=F'60'
         ST    9,92(13)
         MVC   96(4,13),12(3)
         MVC   100(4,13),176(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'60'
         ST    9,92(13)
         MVC   96(4,13),16(3)
         MVC   100(4,13),176(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    6,15
         CR    2,15
         BH    L1711
         LR    4,2
         SLL   4,2
         AR    4,5
L1665    EQU   *
         L     12,4(,10)
         MVC   88(4,13),20(3)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),=F'80'
         MVC   92(4,13),=F'6'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@987)
         BALR  14,15
         ST    15,0(4)
         A     2,=F'1'
         A     4,=F'4'
         CR    2,6
         BNH   L1665
L1711    EQU   *
         L     12,4(,10)
         L     3,4(3)
         B     L1727
L1709    EQU   *
         L     12,4(,10)
         SLR   3,3
L1728    EQU   *
         L     12,4(,10)
         CR    3,7
         BNL   L1713
         LR    4,3
         SLL   4,2
         L     2,0(4,5)
         LTR   2,2
         BNE   L1669
         MVC   88(4,13),=F'80'
         MVC   92(4,13),=F'6'
         MVC   96(4,13),188(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@987)
         BALR  14,15
         ST    15,0(4,5)
L1669    EQU   *
         L     12,4(,10)
         A     3,=F'1'
         B     L1728
L1713    EQU   *
         L     12,4(,10)
         MVC   88(4,13),192(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         L     2,=V(FLAG@PIC)
         L     2,0(2)
         LTR   2,2
         BE    L1672
         MVC   88(4,13),=F'80'
         MVC   92(4,13),=F'6'
         MVC   96(4,13),192(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@987)
         BALR  14,15
         LR    2,15
         ST    7,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@946)
         BALR  14,15
         MVC   88(4,13),=F'58'
         MVC   92(4,13),=F'6'
         ST    2,96(13)
         ST    15,100(13)
         L     2,=V(ZZZ@206)
         MVC   104(4,13),256(2)
         MVC   108(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@959)
         BALR  14,15
         B     L1729
L1672    EQU   *
         L     12,4(,10)
         ST    7,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@946)
         BALR  14,15
         MVC   88(4,13),=F'57'
         MVC   92(4,13),=F'6'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@952)
         BALR  14,15
L1729    EQU   *
         L     12,4(,10)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@554)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@530)
         BALR  14,15
L1573    EQU   *
         L     12,4(,10)
         L     2,168(13)
         MVC   168(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    15,172(13)
         LR    15,13
         A     15,=F'168'
         ST    15,88(13)
         LR    2,13
         A     2,=F'172'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(SQUEEZE@)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L1674
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'5691'
L1731    EQU   *
         L     12,4(,10)
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L1674    EQU   *
         L     12,4(,10)
         MVC   88(4,13),168(13)
         MVC   92(4,13),172(13)
         MVC   96(4,13),20(8)
         LA    1,88(,13)
         L     15,=V(ZZZ@1820)
         BALR  14,15
         B     L1675
L1532    EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(END@CLEA)
         BALR  14,15
L1675    EQU   *
         L     12,4(,10)
         L     2,12(8)
         LTR   2,2
         BE    L1676
         IC    3,200(13)
         CLM   3,1,=XL1'00'
         BNE   L1676
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
L1676    EQU   *
         L     12,4(,10)
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     6,16(2)
L1678    EQU   *
         L     12,4(,10)
         L     7,=V(CFUN)
         L     5,0(7)
         L     3,4(5)
         L     4,20(3)
         L     2,12(3)
         CLR   2,4
         BNE   L1681
         MVC   12(4,3),4(4)
L1681    EQU   *
         L     12,4(,10)
         L     3,4(5)
         L     2,8(3)
         CLR   2,4
         BNE   L1682
         MVC   8(4,3),4(4)
L1682    EQU   *
         L     12,4(,10)
         L     3,4(5)
         L     2,0(3)
         CLR   2,4
         BNE   L1683
         MVC   0(4,3),4(4)
L1683    EQU   *
         L     12,4(,10)
         L     3,4(5)
         L     2,4(3)
         CLR   2,4
         BNE   L1684
         MVC   4(4,3),4(4)
L1684    EQU   *
         L     12,4(,10)
         L     3,4(5)
         L     2,16(3)
         CLR   2,4
         BNE   L1685
         MVC   16(4,3),4(4)
L1685    EQU   *
         L     12,4(,10)
         L     2,4(5)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(4)
         CLR   4,6
         BNE   L1678
         LA    1,88(,13)
         L     15,=V(ZZZ@868)
         BALR  14,15
L1529    EQU   *
         L     12,4(,10)
* Function ZZZ_627 epilogue
         PDPEPIL
* Function ZZZ_627 literal pool
         DS    0F
         LTORG
* Function ZZZ_627 page table
         DS    0F
PGT92    EQU   *
         DC    A(PG92)
         DC    A(PG93)
         DS    0F
* X-func ZZZ_1107 prologue
ZZZ@1107 PDPPRLG CINDEX=94,FRAME=96,BASER=12,ENTRY=YES
         B     FEN94
         LTORG
FEN94    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG94     EQU   *
         LR    11,1
         L     10,=A(PGT94)
* Function ZZZ_1107 code
         L     2,0(11)
         LA    3,1(0,0)
         CLR   2,3
         BNH   L1733
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   L1733
         L     15,0(2)
         LTR   15,15
         BE    L1735
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1107)
         BALR  14,15
L1735    EQU   *
         L     15,4(2)
         LTR   15,15
         BE    L1738
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1738    EQU   *
         L     15,8(2)
         LTR   15,15
         BE    L1740
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1740    EQU   *
         L     15,12(2)
         LTR   15,15
         BE    L1742
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1742    EQU   *
         L     15,16(2)
         LTR   15,15
         BE    L1744
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1744    EQU   *
         L     15,24(2)
         LTR   15,15
         BE    L1746
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1746    EQU   *
         L     15,28(2)
         LTR   15,15
         BE    L1733
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1733    EQU   *
* Function ZZZ_1107 epilogue
         PDPEPIL
* Function ZZZ_1107 literal pool
         DS    0F
         LTORG
* Function ZZZ_1107 page table
         DS    0F
PGT94    EQU   *
         DC    A(PG94)
         DS    0F
* X-func ZZZ_1111 prologue
ZZZ@1111 PDPPRLG CINDEX=95,FRAME=96,BASER=12,ENTRY=YES
         B     FEN95
         LTORG
FEN95    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG95     EQU   *
         LR    11,1
         L     10,=A(PGT95)
* Function ZZZ_1111 code
         L     2,0(11)
         LA    3,1(0,0)
         CLR   2,3
         BNH   L1750
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   L1750
         L     15,0(2)
         LTR   15,15
         BE    L1752
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1111)
         BALR  14,15
L1752    EQU   *
         L     15,4(2)
         LTR   15,15
         BE    L1750
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1750    EQU   *
* Function ZZZ_1111 epilogue
         PDPEPIL
* Function ZZZ_1111 literal pool
         DS    0F
         LTORG
* Function ZZZ_1111 page table
         DS    0F
PGT95    EQU   *
         DC    A(PG95)
         DS    0F
* X-func ZZZ_1081 prologue
ZZZ@1081 PDPPRLG CINDEX=96,FRAME=96,BASER=12,ENTRY=YES
         B     FEN96
         LTORG
FEN96    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG96     EQU   *
         LR    11,1
         L     10,=A(PGT96)
* Function ZZZ_1081 code
         L     2,0(11)
         LA    3,1(0,0)
         CLR   2,3
         BNH   L1757
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   L1757
         L     15,0(2)
         LTR   15,15
         BE    L1759
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1081)
         BALR  14,15
L1759    EQU   *
         L     15,4(2)
         LTR   15,15
         BE    L1762
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1081)
         BALR  14,15
L1762    EQU   *
         L     15,8(2)
         LTR   15,15
         BE    L1764
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1081)
         BALR  14,15
L1764    EQU   *
         L     15,12(2)
         LTR   15,15
         BE    L1766
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1766    EQU   *
         L     15,16(2)
         LTR   15,15
         BE    L1768
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1768    EQU   *
         L     15,20(2)
         LTR   15,15
         BE    L1757
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1757    EQU   *
* Function ZZZ_1081 epilogue
         PDPEPIL
* Function ZZZ_1081 literal pool
         DS    0F
         LTORG
* Function ZZZ_1081 page table
         DS    0F
PGT96    EQU   *
         DC    A(PG96)
         DS    0F
* X-func ZZZ_1118 prologue
ZZZ@1118 PDPPRLG CINDEX=97,FRAME=96,BASER=12,ENTRY=YES
         B     FEN97
         LTORG
FEN97    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG97     EQU   *
         LR    11,1
         L     10,=A(PGT97)
* Function ZZZ_1118 code
         L     2,0(11)
         LA    3,1(0,0)
         CLR   2,3
         BNH   L1772
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   L1772
         L     15,0(2)
         LTR   15,15
         BE    L1774
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1118)
         BALR  14,15
L1774    EQU   *
         L     15,4(2)
         LTR   15,15
         BE    L1777
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1118)
         BALR  14,15
L1777    EQU   *
         L     15,12(2)
         LTR   15,15
         BE    L1779
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1779    EQU   *
         L     15,16(2)
         LA    3,1(0,0)
         CLR   15,3
         BE    L1787
         BL    L1782
         LA    3,2(0,0)
         CLR   15,3
         BE    L1794
         LA    3,3(0,0)
         CLR   15,3
         BE    L1809
         B     L1772
L1782    EQU   *
         L     15,20(2)
         LTR   15,15
         BE    L1783
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1783    EQU   *
         L     15,24(2)
         LTR   15,15
         BE    L1772
         B     L1821
L1787    EQU   *
         L     15,20(2)
         LTR   15,15
         BE    L1788
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1788    EQU   *
         L     15,24(2)
         LTR   15,15
         BE    L1790
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1790    EQU   *
         L     15,28(2)
         LTR   15,15
         BE    L1772
         B     L1821
L1794    EQU   *
         L     15,24(2)
         LTR   15,15
         BE    L1795
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1795    EQU   *
         L     15,28(2)
         LTR   15,15
         BE    L1797
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1797    EQU   *
         L     15,32(2)
         LTR   15,15
         BE    L1799
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1118)
         BALR  14,15
L1799    EQU   *
         L     15,36(2)
         LTR   15,15
         BE    L1801
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1801    EQU   *
         L     15,40(2)
         LTR   15,15
         BE    L1803
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1803    EQU   *
         L     15,44(2)
         LTR   15,15
         BE    L1805
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1111)
         BALR  14,15
L1805    EQU   *
         L     15,60(2)
         LTR   15,15
         BE    L1772
L1821    EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
         B     L1772
L1809    EQU   *
         L     15,20(2)
         LTR   15,15
         BE    L1810
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1810    EQU   *
         L     15,24(2)
         LTR   15,15
         BE    L1812
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1081)
         BALR  14,15
L1812    EQU   *
         L     15,28(2)
         LTR   15,15
         BE    L1814
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1814    EQU   *
         L     15,32(2)
         LTR   15,15
         BE    L1816
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1816    EQU   *
         L     15,36(2)
         LTR   15,15
         BE    L1772
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1772    EQU   *
* Function ZZZ_1118 epilogue
         PDPEPIL
* Function ZZZ_1118 literal pool
         DS    0F
         LTORG
* Function ZZZ_1118 page table
         DS    0F
PGT97    EQU   *
         DC    A(PG97)
         DS    0F
* X-func ZZZ_1130 prologue
ZZZ@1130 PDPPRLG CINDEX=98,FRAME=96,BASER=12,ENTRY=YES
         B     FEN98
         LTORG
FEN98    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG98     EQU   *
         LR    11,1
         L     10,=A(PGT98)
* Function ZZZ_1130 code
         L     2,0(11)
         LA    3,1(0,0)
         CLR   2,3
         BNH   L1822
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   L1822
         L     15,0(2)
         LTR   15,15
         BE    L1824
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1118)
         BALR  14,15
L1824    EQU   *
         L     15,4(2)
         LTR   15,15
         BE    L1826
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1118)
         BALR  14,15
L1826    EQU   *
         L     15,8(2)
         LTR   15,15
         BE    L1828
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1118)
         BALR  14,15
L1828    EQU   *
         L     15,12(2)
         LTR   15,15
         BE    L1830
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1118)
         BALR  14,15
L1830    EQU   *
         L     15,16(2)
         LTR   15,15
         BE    L1832
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1118)
         BALR  14,15
L1832    EQU   *
         L     15,20(2)
         LTR   15,15
         BE    L1834
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1118)
         BALR  14,15
L1834    EQU   *
         L     15,32(2)
         LTR   15,15
         BE    L1836
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1114)
         BALR  14,15
L1836    EQU   *
         L     15,36(2)
         LTR   15,15
         BE    L1838
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1838    EQU   *
         L     15,40(2)
         LTR   15,15
         BE    L1840
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1127)
         BALR  14,15
L1840    EQU   *
         L     15,56(2)
         LTR   15,15
         BE    L1822
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1107)
         BALR  14,15
L1822    EQU   *
* Function ZZZ_1130 epilogue
         PDPEPIL
* Function ZZZ_1130 literal pool
         DS    0F
         LTORG
* Function ZZZ_1130 page table
         DS    0F
PGT98    EQU   *
         DC    A(PG98)
         DS    0F
* X-func ZZZ_1231 prologue
ZZZ@1231 PDPPRLG CINDEX=99,FRAME=104,BASER=12,ENTRY=YES
         B     FEN99
         LTORG
FEN99    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG99     EQU   *
         LR    11,1
         L     10,=A(PGT99)
* Function ZZZ_1231 code
         L     2,0(11)
         ST    2,88(13)
         ST    2,92(13)
         MVC   96(4,13),=A(ZZZ@1282)
         LA    1,88(,13)
         L     15,=V(ZZZ@1199)
         BALR  14,15
         LTR   15,15
         BE    L1844
         L     15,0(2)
         LTR   15,15
         BE    L1846
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1231)
         BALR  14,15
L1846    EQU   *
         L     15,4(2)
         LTR   15,15
         BE    L1849
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1849    EQU   *
         L     15,8(2)
         LTR   15,15
         BE    L1851
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1851    EQU   *
         L     15,12(2)
         LTR   15,15
         BE    L1853
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1853    EQU   *
         L     15,16(2)
         LTR   15,15
         BE    L1855
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1855    EQU   *
         L     15,24(2)
         LTR   15,15
         BE    L1857
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1857    EQU   *
         L     15,28(2)
         LTR   15,15
         BE    L1844
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1844    EQU   *
* Function ZZZ_1231 epilogue
         PDPEPIL
* Function ZZZ_1231 literal pool
         DS    0F
         LTORG
* Function ZZZ_1231 page table
         DS    0F
PGT99    EQU   *
         DC    A(PG99)
         DS    0F
* X-func ZZZ_1235 prologue
ZZZ@1235 PDPPRLG CINDEX=100,FRAME=104,BASER=12,ENTRY=YES
         B     FEN100
         LTORG
FEN100   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG100    EQU   *
         LR    11,1
         L     10,=A(PGT100)
* Function ZZZ_1235 code
         L     2,0(11)
         ST    2,88(13)
         ST    2,92(13)
         MVC   96(4,13),=A(ZZZ@1289)
         LA    1,88(,13)
         L     15,=V(ZZZ@1199)
         BALR  14,15
         LTR   15,15
         BE    L1861
         L     15,0(2)
         LTR   15,15
         BE    L1863
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1235)
         BALR  14,15
L1863    EQU   *
         L     15,4(2)
         LTR   15,15
         BE    L1861
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1861    EQU   *
* Function ZZZ_1235 epilogue
         PDPEPIL
* Function ZZZ_1235 literal pool
         DS    0F
         LTORG
* Function ZZZ_1235 page table
         DS    0F
PGT100   EQU   *
         DC    A(PG100)
         DS    0F
* X-func ZZZ_1205 prologue
ZZZ@1205 PDPPRLG CINDEX=101,FRAME=104,BASER=12,ENTRY=YES
         B     FEN101
         LTORG
FEN101   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG101    EQU   *
         LR    11,1
         L     10,=A(PGT101)
* Function ZZZ_1205 code
         L     2,0(11)
         ST    2,88(13)
         ST    2,92(13)
         MVC   96(4,13),=A(ZZZ@1332)
         LA    1,88(,13)
         L     15,=V(ZZZ@1199)
         BALR  14,15
         LTR   15,15
         BE    L1868
         L     15,0(2)
         LTR   15,15
         BE    L1870
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1205)
         BALR  14,15
L1870    EQU   *
         L     15,4(2)
         LTR   15,15
         BE    L1873
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1205)
         BALR  14,15
L1873    EQU   *
         L     15,8(2)
         LTR   15,15
         BE    L1875
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1205)
         BALR  14,15
L1875    EQU   *
         L     15,12(2)
         LTR   15,15
         BE    L1877
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1877    EQU   *
         L     15,16(2)
         LTR   15,15
         BE    L1879
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1879    EQU   *
         L     15,20(2)
         LTR   15,15
         BE    L1868
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1868    EQU   *
* Function ZZZ_1205 epilogue
         PDPEPIL
* Function ZZZ_1205 literal pool
         DS    0F
         LTORG
* Function ZZZ_1205 page table
         DS    0F
PGT101   EQU   *
         DC    A(PG101)
         DS    0F
* X-func ZZZ_1242 prologue
ZZZ@1242 PDPPRLG CINDEX=102,FRAME=104,BASER=12,ENTRY=YES
         B     FEN102
         LTORG
FEN102   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG102    EQU   *
         LR    11,1
         L     10,=A(PGT102)
* Function ZZZ_1242 code
         L     2,0(11)
         ST    2,88(13)
         ST    2,92(13)
         MVC   96(4,13),=A(ZZZ@1327)
         LA    1,88(,13)
         L     15,=V(ZZZ@1199)
         BALR  14,15
         LTR   15,15
         BE    L1883
         L     15,0(2)
         LTR   15,15
         BE    L1885
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1242)
         BALR  14,15
L1885    EQU   *
         L     15,4(2)
         LTR   15,15
         BE    L1888
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1242)
         BALR  14,15
L1888    EQU   *
         L     15,12(2)
         LTR   15,15
         BE    L1890
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1890    EQU   *
         L     15,16(2)
         LA    3,1(0,0)
         CLR   15,3
         BE    L1898
         BL    L1893
         LA    3,2(0,0)
         CLR   15,3
         BE    L1905
         LA    3,3(0,0)
         CLR   15,3
         BE    L1920
         B     L1883
L1893    EQU   *
         L     15,20(2)
         LTR   15,15
         BE    L1894
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1894    EQU   *
         L     15,24(2)
         LTR   15,15
         BE    L1883
         B     L1932
L1898    EQU   *
         L     15,20(2)
         LTR   15,15
         BE    L1899
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1899    EQU   *
         L     15,24(2)
         LTR   15,15
         BE    L1901
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1901    EQU   *
         L     15,28(2)
         LTR   15,15
         BE    L1883
         B     L1932
L1905    EQU   *
         L     15,24(2)
         LTR   15,15
         BE    L1906
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1906    EQU   *
         L     15,28(2)
         LTR   15,15
         BE    L1908
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1908    EQU   *
         L     15,32(2)
         LTR   15,15
         BE    L1910
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1242)
         BALR  14,15
L1910    EQU   *
         L     15,36(2)
         LTR   15,15
         BE    L1912
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1912    EQU   *
         L     15,40(2)
         LTR   15,15
         BE    L1914
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1914    EQU   *
         L     15,44(2)
         LTR   15,15
         BE    L1916
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1235)
         BALR  14,15
L1916    EQU   *
         L     15,60(2)
         LTR   15,15
         BE    L1883
L1932    EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
         B     L1883
L1920    EQU   *
         L     15,20(2)
         LTR   15,15
         BE    L1921
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1921    EQU   *
         L     15,24(2)
         LTR   15,15
         BE    L1923
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1205)
         BALR  14,15
L1923    EQU   *
         L     15,28(2)
         LTR   15,15
         BE    L1925
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1925    EQU   *
         L     15,32(2)
         LTR   15,15
         BE    L1927
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1927    EQU   *
         L     15,36(2)
         LTR   15,15
         BE    L1929
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1929    EQU   *
         MVC   88(4,13),40(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1278)
         BALR  14,15
L1883    EQU   *
* Function ZZZ_1242 epilogue
         PDPEPIL
* Function ZZZ_1242 literal pool
         DS    0F
         LTORG
* Function ZZZ_1242 page table
         DS    0F
PGT102   EQU   *
         DC    A(PG102)
         DS    0F
* X-func ZZZ_1254 prologue
ZZZ@1254 PDPPRLG CINDEX=103,FRAME=104,BASER=12,ENTRY=YES
         B     FEN103
         LTORG
FEN103   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG103    EQU   *
         LR    11,1
         L     10,=A(PGT103)
* Function ZZZ_1254 code
         L     2,0(11)
         ST    2,88(13)
         ST    2,92(13)
         MVC   96(4,13),=A(ZZZ@1290)
         LA    1,88(,13)
         L     15,=V(ZZZ@1199)
         BALR  14,15
         LTR   15,15
         BE    L1933
         L     15,0(2)
         LTR   15,15
         BE    L1935
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1242)
         BALR  14,15
L1935    EQU   *
         L     15,4(2)
         LTR   15,15
         BE    L1937
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1242)
         BALR  14,15
L1937    EQU   *
         L     15,8(2)
         LTR   15,15
         BE    L1939
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1242)
         BALR  14,15
L1939    EQU   *
         L     15,12(2)
         LTR   15,15
         BE    L1941
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1242)
         BALR  14,15
L1941    EQU   *
         L     15,16(2)
         LTR   15,15
         BE    L1943
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1242)
         BALR  14,15
L1943    EQU   *
         L     15,20(2)
         LTR   15,15
         BE    L1945
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1242)
         BALR  14,15
L1945    EQU   *
         L     15,32(2)
         LTR   15,15
         BE    L1947
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1238)
         BALR  14,15
L1947    EQU   *
         L     15,36(2)
         LTR   15,15
         BE    L1949
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1949    EQU   *
         L     15,40(2)
         LTR   15,15
         BE    L1951
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1251)
         BALR  14,15
L1951    EQU   *
         MVC   88(4,13),48(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1278)
         BALR  14,15
         L     15,56(2)
         LTR   15,15
         BE    L1933
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1231)
         BALR  14,15
L1933    EQU   *
* Function ZZZ_1254 epilogue
         PDPEPIL
* Function ZZZ_1254 literal pool
         DS    0F
         LTORG
* Function ZZZ_1254 page table
         DS    0F
PGT103   EQU   *
         DC    A(PG103)
         DS    0F
* X-func ZZZ_1282 prologue
ZZZ@1282 PDPPRLG CINDEX=104,FRAME=96,BASER=12,ENTRY=YES
         B     FEN104
         LTORG
FEN104   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG104    EQU   *
         LR    11,1
         L     10,=A(PGT104)
* Function ZZZ_1282 code
         L     2,0(11)
         L     3,4(11)
         L     5,8(11)
         L     4,12(11)
         CLR   3,2
         BNE   L1956
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1956    EQU   *
         CLR   3,2
         BNE   L1957
         LR    6,2
         A     6,=F'4'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1957    EQU   *
         CLR   3,2
         BNE   L1958
         LR    6,2
         A     6,=F'8'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1958    EQU   *
         CLR   3,2
         BNE   L1959
         LR    6,2
         A     6,=F'12'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1959    EQU   *
         CLR   3,2
         BNE   L1960
         LR    6,2
         A     6,=F'16'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1960    EQU   *
         CLR   3,2
         BNE   L1961
         LR    6,2
         A     6,=F'24'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1961    EQU   *
         CLR   3,2
         BNE   L1955
         A     2,=F'28'
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1955    EQU   *
* Function ZZZ_1282 epilogue
         PDPEPIL
* Function ZZZ_1282 literal pool
         DS    0F
         LTORG
* Function ZZZ_1282 page table
         DS    0F
PGT104   EQU   *
         DC    A(PG104)
         DS    0F
* X-func ZZZ_1289 prologue
ZZZ@1289 PDPPRLG CINDEX=105,FRAME=96,BASER=12,ENTRY=YES
         B     FEN105
         LTORG
FEN105   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG105    EQU   *
         LR    11,1
         L     10,=A(PGT105)
* Function ZZZ_1289 code
         L     2,0(11)
         L     3,4(11)
         L     5,8(11)
         L     4,12(11)
         CLR   3,2
         BNE   L1964
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1964    EQU   *
         CLR   3,2
         BNE   L1963
         A     2,=F'4'
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1963    EQU   *
* Function ZZZ_1289 epilogue
         PDPEPIL
* Function ZZZ_1289 literal pool
         DS    0F
         LTORG
* Function ZZZ_1289 page table
         DS    0F
PGT105   EQU   *
         DC    A(PG105)
         DS    0F
* X-func ZZZ_1327 prologue
ZZZ@1327 PDPPRLG CINDEX=106,FRAME=96,BASER=12,ENTRY=YES
         B     FEN106
         LTORG
FEN106   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG106    EQU   *
         LR    11,1
         L     10,=A(PGT106)
* Function ZZZ_1327 code
         L     3,0(11)
         L     2,4(11)
         L     5,8(11)
         L     4,12(11)
         CLR   2,3
         BNE   L1967
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1967    EQU   *
         CLR   2,3
         BNE   L1968
         LR    6,2
         A     6,=F'4'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1968    EQU   *
         CLR   2,3
         BNE   L1969
         LR    6,2
         A     6,=F'12'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1969    EQU   *
         L     15,16(2)
         LA    6,1(0,0)
         CLR   15,6
         BE    L1974
         BL    L1971
         LA    6,2(0,0)
         CLR   15,6
         BE    L1978
         LA    6,3(0,0)
         CLR   15,6
         BE    L1986
         B     L1966
L1971    EQU   *
         CLR   2,3
         BNE   L1972
         LR    6,2
         A     6,=F'20'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1972    EQU   *
         CLR   2,3
         BNE   L1966
         A     2,=F'24'
         B     L1994
L1974    EQU   *
         CLR   2,3
         BNE   L1975
         LR    6,2
         A     6,=F'20'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1975    EQU   *
         CLR   2,3
         BNE   L1976
         LR    6,2
         A     6,=F'24'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1976    EQU   *
         CLR   2,3
         BNE   L1966
         A     2,=F'28'
         B     L1994
L1978    EQU   *
         CLR   2,3
         BNE   L1979
         LR    6,2
         A     6,=F'24'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1979    EQU   *
         CLR   2,3
         BNE   L1980
         LR    6,2
         A     6,=F'28'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1980    EQU   *
         CLR   2,3
         BNE   L1981
         LR    6,2
         A     6,=F'32'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1981    EQU   *
         CLR   2,3
         BNE   L1982
         LR    6,2
         A     6,=F'36'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1982    EQU   *
         CLR   2,3
         BNE   L1983
         LR    6,2
         A     6,=F'40'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1983    EQU   *
         CLR   2,3
         BNE   L1984
         LR    6,2
         A     6,=F'44'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1984    EQU   *
         CLR   2,3
         BNE   L1966
         A     2,=F'60'
         B     L1994
L1986    EQU   *
         CLR   2,3
         BNE   L1987
         LR    6,2
         A     6,=F'20'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1987    EQU   *
         CLR   2,3
         BNE   L1988
         LR    6,2
         A     6,=F'24'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1988    EQU   *
         CLR   2,3
         BNE   L1989
         LR    6,2
         A     6,=F'28'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1989    EQU   *
         CLR   2,3
         BNE   L1990
         LR    6,2
         A     6,=F'32'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1990    EQU   *
         CLR   2,3
         BNE   L1991
         LR    6,2
         A     6,=F'36'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1991    EQU   *
         CLR   2,3
         BNE   L1966
         A     2,=F'40'
L1994    EQU   *
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1966    EQU   *
* Function ZZZ_1327 epilogue
         PDPEPIL
* Function ZZZ_1327 literal pool
         DS    0F
         LTORG
* Function ZZZ_1327 page table
         DS    0F
PGT106   EQU   *
         DC    A(PG106)
         DS    0F
* X-func ZZZ_1332 prologue
ZZZ@1332 PDPPRLG CINDEX=107,FRAME=96,BASER=12,ENTRY=YES
         B     FEN107
         LTORG
FEN107   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG107    EQU   *
         LR    11,1
         L     10,=A(PGT107)
* Function ZZZ_1332 code
         L     2,0(11)
         L     3,4(11)
         L     5,8(11)
         L     4,12(11)
         CLR   3,2
         BNE   L1996
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1996    EQU   *
         CLR   3,2
         BNE   L1997
         LR    6,2
         A     6,=F'4'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1997    EQU   *
         CLR   3,2
         BNE   L1998
         LR    6,2
         A     6,=F'8'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1998    EQU   *
         CLR   3,2
         BNE   L1999
         LR    6,2
         A     6,=F'12'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1999    EQU   *
         CLR   3,2
         BNE   L2000
         LR    6,2
         A     6,=F'16'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2000    EQU   *
         CLR   3,2
         BNE   L1995
         A     2,=F'20'
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L1995    EQU   *
* Function ZZZ_1332 epilogue
         PDPEPIL
* Function ZZZ_1332 literal pool
         DS    0F
         LTORG
* Function ZZZ_1332 page table
         DS    0F
PGT107   EQU   *
         DC    A(PG107)
         DS    0F
* X-func ZZZ_1290 prologue
ZZZ@1290 PDPPRLG CINDEX=108,FRAME=96,BASER=12,ENTRY=YES
         B     FEN108
         LTORG
FEN108   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG108    EQU   *
         LR    11,1
         L     10,=A(PGT108)
* Function ZZZ_1290 code
         L     3,0(11)
         L     2,4(11)
         L     5,8(11)
         L     4,12(11)
         CLR   2,3
         BNE   L2003
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2003    EQU   *
         CLR   2,3
         BNE   L2004
         LR    6,2
         A     6,=F'4'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2004    EQU   *
         CLR   2,3
         BNE   L2005
         LR    6,2
         A     6,=F'8'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2005    EQU   *
         CLR   2,3
         BNE   L2006
         LR    6,2
         A     6,=F'12'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2006    EQU   *
         CLR   2,3
         BNE   L2007
         LR    6,2
         A     6,=F'16'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2007    EQU   *
         CLR   2,3
         BNE   L2008
         LR    6,2
         A     6,=F'20'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2008    EQU   *
         CLR   2,3
         BNE   L2009
         LR    6,2
         A     6,=F'32'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2009    EQU   *
         CLR   2,3
         BNE   L2010
         LR    6,2
         A     6,=F'36'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2010    EQU   *
         CLR   2,3
         BNE   L2011
         LR    6,2
         A     6,=F'40'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2011    EQU   *
         CLR   2,3
         BNE   L2012
         LR    6,2
         A     6,=F'48'
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2012    EQU   *
         CLR   2,3
         BNE   L2002
         A     2,=F'56'
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(5)
         BALR  14,15
L2002    EQU   *
* Function ZZZ_1290 epilogue
         PDPEPIL
* Function ZZZ_1290 literal pool
         DS    0F
         LTORG
* Function ZZZ_1290 page table
         DS    0F
PGT108   EQU   *
         DC    A(PG108)
         DS    0F
@@V3     EQU   *
         DC    258X'00'
         DS    0F
@@V2     EQU   *
         DC    4X'00'
         DS    0F
@@V6     EQU   *
         DC    4X'00'
         END
