         COPY  PDPTOP
         CSECT
* X-var ZZZ_1195
         ENTRY ZZZ@1195
* Program text area
         DS    0F
ZZZ@1195 EQU   *
         DC    A(@@V1)
         DC    F'1'
         DC    F'4'
         DC    V(ZZZ@1114)
         DC    V(ZZZ@1238)
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
* X-var lang_adjust_rli
         ENTRY LANG@ADJ
* Program data area
         DS    0F
LANG@ADJ EQU   *
         DC    F'0'
* X-var set_alignment
         ENTRY SET@ALIG
         DS    0F
SET@ALIG EQU   *
         DC    F'0'
         DS    0F
@@V2     EQU   *
         DC    4X'00'
* Program text area
         DS    0F
* X-func ZZZ_1486 prologue
ZZZ@1486 PDPPRLG CINDEX=0,FRAME=88,BASER=12,ENTRY=YES
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function ZZZ_1486 code
         L     2,=A(@@V2)
         MVC   0(4,2),=F'1'
* Function ZZZ_1486 epilogue
         PDPEPIL
* Function ZZZ_1486 literal pool
         DS    0F
         LTORG
* Function ZZZ_1486 page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         DS    0F
* X-func get_pending_sizes prologue
GET@PEND PDPPRLG CINDEX=1,FRAME=88,BASER=12,ENTRY=YES
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function get_pending_sizes code
         L     5,=A(@@V1)
         L     15,0(5)
         LR    4,15
         LTR   15,15
         BE    L8
L6       EQU   *
         L     3,16(4)
         L     2,=V(ZZZ@289)
         MVC   20(4,3),0(2)
         L     4,0(4)
         LTR   4,4
         BNE   L6
L8       EQU   *
         MVC   0(4,5),=F'0'
* Function get_pending_sizes epilogue
         PDPEPIL
* Function get_pending_sizes literal pool
         DS    0F
         LTORG
* Function get_pending_sizes page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* X-func is_pending_size prologue
IS@PENDI PDPPRLG CINDEX=2,FRAME=88,BASER=12,ENTRY=YES
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function is_pending_size code
         L     3,0(11)
         L     2,=A(@@V1)
         L     15,0(2)
L17      EQU   *
         LTR   15,15
         BE    L16
         L     2,16(15)
         CLR   2,3
         BNE   L12
         LA    15,1(0,0)
         B     L9
L12      EQU   *
         L     15,0(15)
         B     L17
L16      EQU   *
         SLR   15,15
L9       EQU   *
* Function is_pending_size epilogue
         PDPEPIL
* Function is_pending_size literal pool
         DS    0F
         LTORG
* Function is_pending_size page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
         DS    0F
* X-func ZZZ_1721 prologue
ZZZ@1721 PDPPRLG CINDEX=3,FRAME=104,BASER=12,ENTRY=YES
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function ZZZ_1721 code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SKIP@SIM)
         BALR  14,15
         CLI   8(15),116
         BNE   L18
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         L     2,=A(@@V1)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,0(2)
L18      EQU   *
* Function ZZZ_1721 epilogue
         PDPEPIL
* Function ZZZ_1721 literal pool
         DS    0F
         LTORG
* Function ZZZ_1721 page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
LC0      EQU   *
         DC    C'<stdin>'
         DC    X'0'
LC1      EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* X-func ZZZ_1722 prologue
ZZZ@1722 PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=YES
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function ZZZ_1722 code
         L     15,=A(@@V1)
         L     2,0(15)
         LTR   2,2
         BE    L21
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'140'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L21      EQU   *
         MVC   0(4,15),0(11)
* Function ZZZ_1722 epilogue
         PDPEPIL
* Function ZZZ_1722 literal pool
         DS    0F
         LTORG
* Function ZZZ_1722 page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
LC2      EQU   *
         DC    C'type size can''t be explicitly evaluated'
         DC    X'0'
LC3      EQU   *
         DC    C'variable-size type declared outside of any funct'
         DC    C'ion'
         DC    X'0'
         DS    0F
* X-func ZZZ_2007 prologue
ZZZ@2007 PDPPRLG CINDEX=5,FRAME=112,BASER=12,ENTRY=YES
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function ZZZ_2007 code
         L     4,0(11)
         L     2,8(4)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BNE   L32
         L     5,=V(LANG@HOO)
         L     2,252(5)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LTR   15,15
         BL    L32
         LTR   4,4
         BE    L23
         L     2,8(4)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BNE   L23
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(CONTAINS)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   L32
L23      EQU   *
         CLI   8(4),60
         BNE   L25
         MVC   88(4,13),20(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1481)
         BALR  14,15
         LTR   15,15
         BE    L25
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SAVE@EXP)
         BALR  14,15
         LR    3,15
         ST    15,16(4)
         B     L26
L25      EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SAVE@EXP)
         BALR  14,15
         LR    4,15
         LR    3,15
L26      EQU   *
         CLI   8(3),116
         BNE   L27
         OC    8(4,3),=F'131072'
L27      EQU   *
         L     2,252(5)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LTR   15,15
         BE    L28
         L     2,8(4)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BE    L29
         MVC   88(4,13),=A(LC2)
         B     L35
L29      EQU   *
         MVC   88(4,13),=A(LC3)
L35      EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     2,=V(GLOBAL@T)
         L     15,64(2)
         B     L22
L28      EQU   *
         L     2,=A(ZZZ@1439)
         L     2,0(2)
         LTR   2,2
         BE    L31
         ST    3,88(13)
         L     2,=V(ZZZ@206)
         MVC   92(4,13),256(2)
         ST    15,96(13)
         ST    15,100(13)
         ST    15,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@638)
         BALR  14,15
         B     L32
L31      EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         LTR   2,2
         BE    L33
         L     2,244(2)
         SRL   2,11
         N     2,=F'1'
         LTR   2,2
         BNE   L32
L33      EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1721)
         BALR  14,15
L32      EQU   *
         LR    15,4
L22      EQU   *
* Function ZZZ_2007 epilogue
         PDPEPIL
* Function ZZZ_2007 literal pool
         DS    0F
         LTORG
* Function ZZZ_2007 page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
         DS    0F
* X-func ZZZ_1575 prologue
ZZZ@1575 PDPPRLG CINDEX=6,FRAME=88,BASER=12,ENTRY=YES
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function ZZZ_1575 code
         L     4,0(11)
         L     2,8(11)
         LTR   2,2
         BE    L37
         L     2,=V(MODE@SIZ)
         SLR   3,3
         IC    3,7(2)
         LR    2,3
         SLL   2,3
         LA    15,1(0,0)
         CLR   4,2
         BH    L36
L37      EQU   *
         L     3,4(11)
         L     2,=V(CLASS@NA)
         SLR   15,15
         IC    15,0(2,3)
L46      EQU   *
         LTR   15,15
         BE    L44
         LR    2,15
         AR    2,15
         L     3,=V(MODE@PRE)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CLR   2,4
         BE    L36
         L     2,=V(MODE@WID)
         SLR   3,3
         IC    3,0(2,15)
         LR    15,3
         B     L46
L44      EQU   *
         LA    15,1(0,0)
L36      EQU   *
* Function ZZZ_1575 epilogue
         PDPEPIL
* Function ZZZ_1575 literal pool
         DS    0F
         LTORG
* Function ZZZ_1575 page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
         DS    0F
* X-func ZZZ_1576 prologue
ZZZ@1576 PDPPRLG CINDEX=7,FRAME=104,BASER=12,ENTRY=YES
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function ZZZ_1576 code
         L     3,0(11)
         L     2,8(3)
         N     2,=F'-16773120'
         L     4,=F'419430400'
         CLR   2,4
         BNE   L49
         ST    3,88(13)
         MVC   92(4,13),=F'1000'
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BNH   L48
L49      EQU   *
         LA    15,1(0,0)
         B     L47
L48      EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(ZZZ@1575)
         BALR  14,15
L47      EQU   *
* Function ZZZ_1576 epilogue
         PDPEPIL
* Function ZZZ_1576 literal pool
         DS    0F
         LTORG
* Function ZZZ_1576 page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
         DS    0F
* X-func smallest_mode_for_size prologue
SMALLEST PDPPRLG CINDEX=8,FRAME=104,BASER=12,ENTRY=YES
         B     FEN8
         LTORG
FEN8     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         LR    11,1
         L     10,=A(PGT8)
* Function smallest_mode_for_size code
         L     4,0(11)
         L     3,=V(CLASS@NA)
         L     2,4(11)
         SLR   15,15
         IC    15,0(3,2)
L60      EQU   *
         LTR   15,15
         BE    L59
         LR    2,15
         AR    2,15
         L     3,=V(MODE@PRE)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CLR   2,4
         BNL   L57
         L     2,=V(MODE@WID)
         SLR   3,3
         IC    3,0(2,15)
         LR    15,3
         B     L60
L59      EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'259'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L57      EQU   *
* Function smallest_mode_for_size epilogue
         PDPEPIL
* Function smallest_mode_for_size literal pool
         DS    0F
         LTORG
* Function smallest_mode_for_size page table
         DS    0F
PGT8     EQU   *
         DC    A(PG8)
         DS    0F
* X-func int_mode_for_mode prologue
INT@MODE PDPPRLG CINDEX=9,FRAME=104,BASER=12,ENTRY=YES
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function int_mode_for_mode code
         L     15,0(11)
         L     2,=V(MODE@CLA)
         SLR   3,3
         IC    3,0(2,15)
         LA    2,8(0,0)
         CLR   3,2
         BH    L73
         SLL   3,2
         L     2,=A(L74)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
L74      EQU   *
         DC    A(L70)
         DC    A(L73)
         DC    A(L62)
         DC    A(L62)
         DC    A(L69)
         DC    A(L69)
         DC    A(L69)
         DC    A(L69)
         DC    A(L69)
L69      EQU   *
         L     2,=V(MODE@SIZ)
         SLR   3,3
         IC    3,0(2,15)
         LR    2,3
         SLL   2,3
         ST    2,88(13)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@1575)
         BALR  14,15
         B     L62
L70      EQU   *
         LA    2,1(0,0)
         CLR   15,2
         BE    L62
L73      EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'289'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L62      EQU   *
* Function int_mode_for_mode epilogue
         PDPEPIL
* Function int_mode_for_mode literal pool
         DS    0F
         LTORG
* Function int_mode_for_mode page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
         DS    0F
* X-func get_mode_alignment prologue
GET@MODE PDPPRLG CINDEX=10,FRAME=88,BASER=12,ENTRY=YES
         B     FEN10
         LTORG
FEN10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         LR    11,1
         L     10,=A(PGT10)
* Function get_mode_alignment code
         L     3,0(11)
         L     2,=V(MODE@BAS)
         SLR   4,4
         IC    4,0(2,3)
         LR    2,4
         SLL   2,3
         LA    15,64(0,0)
         CR    2,15
         BH    L77
         LR    15,2
         LA    2,1(0,0)
         CR    15,2
         BNL   L77
         LR    15,2
L77      EQU   *
* Function get_mode_alignment epilogue
         PDPEPIL
* Function get_mode_alignment literal pool
         DS    0F
         LTORG
* Function get_mode_alignment page table
         DS    0F
PGT10    EQU   *
         DC    A(PG10)
         DS    0F
* X-func round_up prologue
ROUND@UP PDPPRLG CINDEX=11,FRAME=104,BASER=12,ENTRY=YES
         B     FEN11
         LTORG
FEN11    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         LR    11,1
         L     10,=A(PGT11)
* Function round_up code
         L     2,0(11)
         MVC   88(4,13),4(11)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1920)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'63'
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         MVC   88(4,13),=F'61'
         ST    15,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
* Function round_up epilogue
         PDPEPIL
* Function round_up literal pool
         DS    0F
         LTORG
* Function round_up page table
         DS    0F
PGT11    EQU   *
         DC    A(PG11)
         DS    0F
* X-func round_down prologue
ROUND@DO PDPPRLG CINDEX=12,FRAME=104,BASER=12,ENTRY=YES
         B     FEN12
         LTORG
FEN12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         LR    11,1
         L     10,=A(PGT12)
* Function round_down code
         L     2,0(11)
         MVC   88(4,13),4(11)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1920)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'64'
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         MVC   88(4,13),=F'61'
         ST    15,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
* Function round_down epilogue
         PDPEPIL
* Function round_down literal pool
         DS    0F
         LTORG
* Function round_down page table
         DS    0F
PGT12    EQU   *
         DC    A(PG12)
LC4      EQU   *
         DC    C'%Jsize of ''%D'' is %d bytes'
         DC    X'0'
LC5      EQU   *
         DC    C'%Jsize of ''%D'' is larger than %d bytes'
         DC    X'0'
         DS    0F
* X-func layout_decl prologue
LAYOUT@D PDPPRLG CINDEX=13,FRAME=112,BASER=12,ENTRY=YES
         B     FEN13
         LTORG
FEN13    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         LR    11,1
         L     10,=A(PGT13)
* Function layout_decl code
         L     4,0(11)
         L     8,4(11)
         L     5,4(4)
         L     3,8(4)
         LR    7,3
         SRL   7,24
         SLR   9,9
         LA    2,32(0,0)
         CLR   7,2
         L     14,=A(L81)
         BER   14
         LR    2,7
         A     2,=F'-33'
         LA    6,4(0,0)
         CLR   2,6
         BNH   L83
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'363'
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L83      EQU   *
         L     2,80(4)
         LTR   2,2
         BE    L86
         LR    9,2
L86      EQU   *
         L     6,=V(GLOBAL@T)
         CL    5,0(6)
         BNE   L88
         L     5,144(6)
L88      EQU   *
         L     2,8(5)
         N     2,=F'262144'
         N     3,=F'-262145'
         OR    3,2
         ST    3,8(4)
         IC    2,28(4)
         CLM   2,1,=XL1'00'
         BNE   L89
         IC    2,33(5)
         N     2,=F'127'
         STC   2,28(4)
L89      EQU   *
         L     3,24(4)
         LTR   3,3
         BNE   L90
         MVC   24(4,4),16(5)
         MVC   40(4,4),20(5)
         B     L91
L90      EQU   *
         L     2,40(4)
         LTR   2,2
         BNE   L91
         MVC   88(4,13),=F'63'
         ST    3,92(13)
         MVC   96(4,13),76(6)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         L     2,=A(SIZETYPE)
         MVC   88(4,13),0(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    15,40(4)
L91      EQU   *
         LA    3,37(0,0)
         CLR   7,3
         BE    L93
         L     15,36(4)
         LR    2,15
         SRL   2,8
         L     3,36(5)
         CLR   3,2
         BNH   L97
         SLL   3,8
         N     15,=F'255'
         OR    15,3
         ST    15,36(4)
         CLI   8(4),37
         BNE   L97
         L     2,32(5)
         N     2,=F'1'
         SLL   2,30
         L     3,32(4)
         N     3,=F'-1073741825'
         OR    3,2
         ST    3,32(4)
         B     L97
L93      EQU   *
         MVI   104(13),0
         L     6,32(4)
         LR    15,6
         SRL   15,30
         N     15,=F'1'
         LTR   15,15
         BE    L98
         MVI   104(13),1
L98      EQU   *
         L     3,28(4)
         LR    2,3
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    L99
         ST    5,56(4)
         MVC   88(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L100
         L     2,28(4)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L100
         MVC   88(4,13),48(4)
         L     2,=V(TARGETM)
         L     2,236(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         SLL   15,24
         SRA   15,24
         C     15,=F'0'
         BNE   L100
         L     3,36(4)
         LR    2,3
         SRL   2,8
         LA    6,7(0,0)
         CR    2,6
         BH    L100
         N     3,=F'255'
         O     3,=F'2048'
         ST    3,36(4)
         NC    32(4,4),=F'-1073741825'
L100     EQU   *
         L     2,16(5)
         LTR   2,2
         BE    L102
         CLI   8(2),25
         BNE   L102
         LH    2,32(5)
         N     2,=F'127'
         L     3,=V(MODE@CLA)
         IC    2,0(3,2)
         CLM   2,1,=XL1'02'
         BNE   L102
         MVC   88(4,13),24(4)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(ZZZ@1576)
         BALR  14,15
         LR    3,15
         LA    2,1(0,0)
         CLR   15,2
         BE    L102
         LTR   8,8
         BE    L104
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(GET@MODE)
         BALR  14,15
         CLR   8,15
         BL    L102
L104     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(GET@MODE)
         BALR  14,15
         L     2,36(4)
         SRL   2,8
         CLR   15,2
         BH    L106
         LR    15,2
L106     EQU   *
         SLL   15,8
         SLR   2,2
         IC    2,39(4)
         OR    2,15
         ST    2,36(4)
         STC   3,28(4)
         NC    28(4,4),=F'-524289'
L102     EQU   *
         L     2,32(5)
         N     2,=F'8323072'
         L     3,=F'65536'
         CLR   2,3
         BNE   L108
         CLI   28(4),1
         BNE   L108
         L     3,36(5)
         CLR   8,3
         BL    L108
         L     2,36(4)
         SRL   2,8
         CLR   2,3
         BL    L108
         NC    28(4,4),=F'-524289'
         B     L108
L99      EQU   *
         SRL   3,21
         N     3,=F'1'
         LTR   3,3
         BE    L109
         LTR   15,15
         BNE   L108
L109     EQU   *
         L     15,36(4)
         LR    2,15
         SRL   2,8
         L     3,36(5)
         CLR   3,2
         BNH   L108
         SLL   3,8
         N     15,=F'255'
         OR    15,3
         ST    15,36(4)
         CLI   8(4),37
         BNE   L108
         L     2,32(5)
         N     2,=F'1'
         SLL   2,30
         N     6,=F'-1073741825'
         OR    6,2
         ST    6,32(4)
L108     EQU   *
         L     2,28(4)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    L114
         IC    5,104(13)
         CLM   5,1,=XL1'00'
         BNE   L114
         L     2,32(4)
         SRL   2,31
         LTR   2,2
         BNE   L115
         L     2,40(4)
         LTR   2,2
         BE    L115
         IC    2,8(2)
         SLL   2,24
         SRA   2,24
         C     2,=F'25'
         BNE   L114
L115     EQU   *
         L     3,36(4)
         LR    2,3
         SRL   2,8
         LA    6,8(0,0)
         CR    2,6
         BNH   L116
         LR    2,6
L116     EQU   *
         SLL   2,8
         N     3,=F'255'
         OR    3,2
         ST    3,36(4)
L114     EQU   *
         L     2,=A(MAXIMUM@)
         L     2,0(2)
         LTR   2,2
         BE    L97
         L     3,36(4)
         LR    15,3
         SRL   15,8
         CLR   2,15
         BNH   L118
         LR    2,15
L118     EQU   *
         SLL   2,8
         N     3,=F'255'
         OR    3,2
         ST    3,36(4)
L97      EQU   *
         L     2,24(4)
         LTR   2,2
         BE    L120
         CLI   8(2),25
         BE    L120
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@2007)
         BALR  14,15
         ST    15,24(4)
L120     EQU   *
         L     2,40(4)
         LTR   2,2
         BE    L121
         CLI   8(2),25
         BE    L121
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@2007)
         BALR  14,15
         ST    15,40(4)
L121     EQU   *
         L     2,=V(WARN@LAR)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L122
         A     7,=F'-34'
         LA    2,1(0,0)
         CLR   7,2
         BH    L122
         L     2,28(4)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         BNE   L122
         L     2,40(4)
         LTR   2,2
         BE    L122
         CLI   8(2),25
         BNE   L122
         ST    2,88(13)
         L     5,=V(LARGER@T)
         MVC   92(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BNH   L122
         L     3,12(2)
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BNE   L124
         MVC   88(4,13),=A(LC4)
         ST    4,92(13)
         ST    4,96(13)
         ST    3,100(13)
         B     L127
L124     EQU   *
         MVC   88(4,13),=A(LC5)
         ST    4,92(13)
         ST    4,96(13)
         MVC   100(4,13),0(5)
L127     EQU   *
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L122     EQU   *
         LTR   9,9
         BE    L81
         MVC   2(1,9),28(4)
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1886)
         BALR  14,15
         ST    9,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@1891)
         BALR  14,15
         ST    4,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1886)
         BALR  14,15
L81      EQU   *
* Function layout_decl epilogue
         PDPEPIL
* Function layout_decl literal pool
         DS    0F
         LTORG
* Function layout_decl page table
         DS    0F
PGT13    EQU   *
         DC    A(PG13)
         DS    0F
* X-func set_lang_adjust_rli prologue
SET@LANG PDPPRLG CINDEX=14,FRAME=88,BASER=12,ENTRY=YES
         B     FEN14
         LTORG
FEN14    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG14     EQU   *
         LR    11,1
         L     10,=A(PGT14)
* Function set_lang_adjust_rli code
         L     2,=A(LANG@ADJ)
         MVC   0(4,2),0(11)
* Function set_lang_adjust_rli epilogue
         PDPEPIL
* Function set_lang_adjust_rli literal pool
         DS    0F
         LTORG
* Function set_lang_adjust_rli page table
         DS    0F
PGT14    EQU   *
         DC    A(PG14)
         DS    0F
* X-func start_record_layout prologue
START@RE PDPPRLG CINDEX=15,FRAME=96,BASER=12,ENTRY=YES
         B     FEN15
         LTORG
FEN15    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG15     EQU   *
         LR    11,1
         L     10,=A(PGT15)
* Function start_record_layout code
         L     2,0(11)
         MVC   88(4,13),=F'40'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    3,15
         ST    2,0(15)
         L     2,36(2)
         LA    4,8(0,0)
         CLR   2,4
         BNL   L130
         LR    2,4
L130     EQU   *
         ST    2,16(3)
         ST    2,20(3)
         LA    4,64(0,0)
         CLR   2,4
         BNL   L131
         LR    2,4
L131     EQU   *
         ST    2,8(3)
         L     2,=V(GLOBAL@T)
         MVC   4(4,3),60(2)
         MVC   12(4,3),68(2)
         MVC   24(4,3),=F'0'
         MVC   28(4,3),=F'0'
         MVC   36(4,3),=F'0'
* Function start_record_layout epilogue
         PDPEPIL
* Function start_record_layout literal pool
         DS    0F
         LTORG
* Function start_record_layout page table
         DS    0F
PGT15    EQU   *
         DC    A(PG15)
         DS    0F
* X-func bit_from_pos prologue
BIT@FROM PDPPRLG CINDEX=16,FRAME=104,BASER=12,ENTRY=YES
         B     FEN16
         LTORG
FEN16    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG16     EQU   *
         LR    11,1
         L     10,=A(PGT16)
* Function bit_from_pos code
         L     2,=A(SIZETYPE)
         MVC   88(4,13),12(2)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'61'
         ST    15,92(13)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),76(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         MVC   88(4,13),=F'59'
         MVC   92(4,13),4(11)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
* Function bit_from_pos epilogue
         PDPEPIL
* Function bit_from_pos literal pool
         DS    0F
         LTORG
* Function bit_from_pos page table
         DS    0F
PGT16    EQU   *
         DC    A(PG16)
         DS    0F
* X-func byte_from_pos prologue
BYTE@FRO PDPPRLG CINDEX=17,FRAME=104,BASER=12,ENTRY=YES
         B     FEN17
         LTORG
FEN17    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG17     EQU   *
         LR    11,1
         L     10,=A(PGT17)
* Function byte_from_pos code
         MVC   88(4,13),=F'62'
         MVC   92(4,13),4(11)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),76(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         L     2,=A(SIZETYPE)
         MVC   88(4,13),0(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'59'
         MVC   92(4,13),0(11)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
* Function byte_from_pos epilogue
         PDPEPIL
* Function byte_from_pos literal pool
         DS    0F
         LTORG
* Function byte_from_pos page table
         DS    0F
PGT17    EQU   *
         DC    A(PG17)
         DS    0F
* X-func pos_from_bit prologue
POS@FROM PDPPRLG CINDEX=18,FRAME=104,BASER=12,ENTRY=YES
         B     FEN18
         LTORG
FEN18    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG18     EQU   *
         LR    11,1
         L     10,=A(PGT18)
* Function pos_from_bit code
         L     3,8(11)
         L     4,12(11)
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         MVC   88(4,13),=F'64'
         ST    4,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         L     2,=A(SIZETYPE)
         MVC   88(4,13),0(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    2,15
         LR    5,3
         SRL   5,3
         ST    5,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         MVC   88(4,13),=F'61'
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         L     2,0(11)
         ST    15,0(2)
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         MVC   88(4,13),=F'68'
         ST    4,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         L     2,4(11)
         ST    15,0(2)
* Function pos_from_bit epilogue
         PDPEPIL
* Function pos_from_bit literal pool
         DS    0F
         LTORG
* Function pos_from_bit page table
         DS    0F
PGT18    EQU   *
         DC    A(PG18)
         DS    0F
* X-func ZZZ_1602 prologue
ZZZ@1602 PDPPRLG CINDEX=19,FRAME=104,BASER=12,ENTRY=YES
         B     FEN19
         LTORG
FEN19    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG19     EQU   *
         LR    11,1
         L     10,=A(PGT19)
* Function ZZZ_1602 code
         L     5,0(11)
         L     4,4(11)
         L     3,8(11)
         MVC   88(4,13),0(4)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@173)
         BALR  14,15
         LTR   15,15
         BL    L135
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         MVC   88(4,13),=F'64'
         MVC   92(4,13),0(4)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         L     2,=A(SIZETYPE)
         MVC   88(4,13),0(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    2,15
         LR    6,3
         SRL   6,3
         ST    6,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         MVC   88(4,13),=F'61'
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         MVC   88(4,13),=F'59'
         MVC   92(4,13),0(5)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,0(5)
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         MVC   88(4,13),=F'68'
         MVC   92(4,13),0(4)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,0(4)
L135     EQU   *
* Function ZZZ_1602 epilogue
         PDPEPIL
* Function ZZZ_1602 literal pool
         DS    0F
         LTORG
* Function ZZZ_1602 page table
         DS    0F
PGT19    EQU   *
         DC    A(PG19)
LC6      EQU   *
         DC    C'type'
         DC    X'0'
LC7      EQU   *
         DC    X'15'
         DC    C'offset'
         DC    X'0'
LC8      EQU   *
         DC    C' bitpos'
         DC    X'0'
LC9      EQU   *
         DC    X'15'
         DC    C'aligns: rec = %u, unpack = %u, off = %u'
         DC    X'15'
         DC    X'0'
LC10     EQU   *
         DC    C'packed may be necessary'
         DC    X'15'
         DC    X'0'
LC11     EQU   *
         DC    C'pending statics:'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func debug_rli prologue
DEBUG@RL PDPPRLG CINDEX=20,FRAME=112,BASER=12,ENTRY=YES
         B     FEN20
         LTORG
FEN20    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG20     EQU   *
         LR    11,1
         L     10,=A(PGT20)
* Function debug_rli code
         L     3,0(11)
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(LC6)
         MVC   96(4,13),0(3)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1696)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(LC7)
         MVC   96(4,13),4(3)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1696)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(LC8)
         MVC   96(4,13),12(3)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1696)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(LC9)
         MVC   96(4,13),16(3)
         MVC   100(4,13),20(3)
         MVC   104(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,36(3)
         LTR   2,2
         BE    L138
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L138     EQU   *
         L     2,28(3)
         LTR   2,2
         BE    L137
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(LC11)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),28(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@392)
         BALR  14,15
L137     EQU   *
* Function debug_rli epilogue
         PDPEPIL
* Function debug_rli literal pool
         DS    0F
         LTORG
* Function debug_rli page table
         DS    0F
PGT20    EQU   *
         DC    A(PG20)
         DS    0F
* X-func ZZZ_1603 prologue
ZZZ@1603 PDPPRLG CINDEX=21,FRAME=104,BASER=12,ENTRY=YES
         B     FEN21
         LTORG
FEN21    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG21     EQU   *
         LR    11,1
         L     10,=A(PGT21)
* Function ZZZ_1603 code
         L     2,0(11)
         LR    3,2
         A     3,=F'4'
         ST    3,88(13)
         A     3,=F'8'
         ST    3,92(13)
         MVC   96(4,13),8(2)
         LA    1,88(,13)
         L     15,=A(ZZZ@1602)
         BALR  14,15
* Function ZZZ_1603 epilogue
         PDPEPIL
* Function ZZZ_1603 literal pool
         DS    0F
         LTORG
* Function ZZZ_1603 page table
         DS    0F
PGT21    EQU   *
         DC    A(PG21)
         DS    0F
* X-func ZZZ_1842 prologue
ZZZ@1842 PDPPRLG CINDEX=22,FRAME=96,BASER=12,ENTRY=YES
         B     FEN22
         LTORG
FEN22    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG22     EQU   *
         LR    11,1
         L     10,=A(PGT22)
* Function ZZZ_1842 code
         L     2,0(11)
         MVC   88(4,13),4(2)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=A(BYTE@FRO)
         BALR  14,15
* Function ZZZ_1842 epilogue
         PDPEPIL
* Function ZZZ_1842 literal pool
         DS    0F
         LTORG
* Function ZZZ_1842 page table
         DS    0F
PGT22    EQU   *
         DC    A(PG22)
         DS    0F
* X-func ZZZ_1841 prologue
ZZZ@1841 PDPPRLG CINDEX=23,FRAME=96,BASER=12,ENTRY=YES
         B     FEN23
         LTORG
FEN23    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG23     EQU   *
         LR    11,1
         L     10,=A(PGT23)
* Function ZZZ_1841 code
         L     2,0(11)
         MVC   88(4,13),4(2)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=A(BIT@FROM)
         BALR  14,15
* Function ZZZ_1841 epilogue
         PDPEPIL
* Function ZZZ_1841 literal pool
         DS    0F
         LTORG
* Function ZZZ_1841 page table
         DS    0F
PGT23    EQU   *
         DC    A(PG23)
         DS    0F
* Function update_alignment_for_field,F2 prologue
@@F2     PDPPRLG CINDEX=24,FRAME=96,BASER=12,ENTRY=NO
         B     FEN24
         LTORG
FEN24    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG24     EQU   *
         LR    11,1
         L     10,=A(PGT24)
* Function update_alignment_for_field code
         L     4,0(11)
         L     3,4(11)
         L     5,4(3)
         ST    3,88(13)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(LAYOUT@D)
         BALR  14,15
         L     6,36(3)
         SRL   6,8
         SLR   7,7
         L     2,32(3)
         SRL   2,30
         N     2,=F'1'
         LTR   2,2
         BE    L144
         LA    7,1(0,0)
L144     EQU   *
         L     2,=V(GLOBAL@T)
         CL    5,0(2)
         BE    L146
         L     2,56(3)
         LTR   2,2
         BE    L146
         MVC   88(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L146
         MVC   88(4,13),0(4)
         L     2,=V(TARGETM)
         L     2,236(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L146
         MVC   88(4,13),24(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L148
         L     2,28(3)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L155
         B     L149
L148     EQU   *
         L     3,24(4)
         LTR   3,3
         BE    L155
         L     2,56(3)
         LTR   2,2
         BE    L155
         MVC   88(4,13),24(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L155
L149     EQU   *
         L     3,36(5)
         CLR   3,6
         BNL   L150
         LR    3,6
L150     EQU   *
         L     2,=A(MAXIMUM@)
         L     2,0(2)
         LTR   2,2
         BE    L151
         CLR   3,2
         BNH   L151
         LR    3,2
L151     EQU   *
         L     15,16(4)
         LR    2,3
         CLR   3,15
         BNL   L156
         LR    2,15
         B     L156
L146     EQU   *
         L     3,16(4)
         LR    2,6
         CLR   6,3
         BNL   L156
         LR    2,3
L156     EQU   *
         ST    2,16(4)
         L     3,20(4)
         L     2,36(5)
         CLR   2,3
         BNL   L157
         LR    2,3
L157     EQU   *
         ST    2,20(4)
L155     EQU   *
         L     4,0(4)
         L     3,32(4)
         LR    2,3
         OR    2,7
         N     2,=F'1'
         N     3,=F'-2'
         OR    3,2
         ST    3,32(4)
         LR    15,6
* Function update_alignment_for_field epilogue
         PDPEPIL
* Function update_alignment_for_field literal pool
         DS    0F
         LTORG
* Function update_alignment_for_field page table
         DS    0F
PGT24    EQU   *
         DC    A(PG24)
LC12     EQU   *
         DC    C'%Jpacked attribute is unnecessary for ''%D'''
         DC    X'0'
LC13     EQU   *
         DC    C'%Jpadding struct to align ''%D'''
         DC    X'0'
         DS    0F
* X-func place_field prologue
PLACE@FI PDPPRLG CINDEX=25,FRAME=120,BASER=12,ENTRY=YES
         B     FEN25
         LTORG
FEN25    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG25     EQU   *
         LR    11,1
         L     10,=A(PGT25)
* Function place_field code
         L     4,0(11)
         L     5,4(11)
         L     9,4(5)
         IC    3,8(5)
         CLM   3,1,=XL1'00'
         L     14,=A(L160)
         BER   14
         IC    2,8(9)
         CLM   2,1,=XL1'00'
         L     14,=A(L160)
         BER   14
         CLM   3,1,=XL1'22'
         BNE   L163
         MVC   88(4,13),=F'0'
         ST    5,92(13)
         MVC   96(4,13),28(4)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,28(4)
         L     14,=A(L160)
         BR    14
L163     EQU   *
         CLM   3,1,=XL1'25'
         L     14,=A(L160)
         BNER  14
         L     2,0(4)
         CLI   8(2),20
         BE    L164
         ST    4,88(13)
         ST    5,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         L     2,=V(GLOBAL@T)
         MVC   52(4,5),60(2)
         MVC   84(4,5),68(2)
         MVC   88(4,13),=F'64'
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         STC   15,39(5)
         L     2,0(4)
         IC    2,8(2)
         CLM   2,1,=XL1'15'
         BNE   L168
         MVC   88(4,13),=F'79'
         MVC   92(4,13),4(4)
         MVC   96(4,13),40(5)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         B     L225
L168     EQU   *
         CLM   2,1,=XL1'16'
         L     14,=A(L160)
         BNER  14
         MVC   88(4,13),=F'52'
         L     2,=A(SIZETYPE)
         MVC   92(4,13),0(2)
         MVC   96(4,13),60(5)
         MVC   100(4,13),40(5)
         MVC   104(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
L225     EQU   *
         ST    15,4(4)
         L     14,=A(L160)
         BR    14
L164     EQU   *
         MVC   88(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L172
         MVC   88(4,13),12(4)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    8,15
         MVC   88(4,13),12(4)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LCR   15,15
         NR    8,15
         B     L173
L172     EQU   *
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LA    8,64(0,0)
         LTR   15,15
         BNE   L173
         MVC   88(4,13),4(4)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L176
         MVC   88(4,13),4(4)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    8,15
         MVC   88(4,13),4(4)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LCR   15,15
         NR    8,15
         SLL   8,3
         B     L173
L176     EQU   *
         L     8,8(4)
L173     EQU   *
         ST    4,88(13)
         ST    5,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         ST    15,112(13)
         L     2,=V(WARN@PAC)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L178
         L     2,28(5)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    L178
         L     2,36(9)
         CLR   8,2
         BL    L179
         CLR   2,15
         BNH   L178
         MVC   88(4,13),=A(LC12)
         ST    5,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     L178
L179     EQU   *
         MVC   36(4,4),=F'1'
L178     EQU   *
         CL    8,112(13)
         BNL   L184
         L     2,=V(WARN@PAD)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L185
         MVC   88(4,13),=A(LC13)
         ST    5,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L185     EQU   *
         L     2,112(13)
         CL    2,8(4)
         BNL   L186
         MVC   88(4,13),12(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(ROUND@UP)
         BALR  14,15
         ST    15,12(4)
         B     L187
L186     EQU   *
         MVC   88(4,13),=F'63'
         MVC   92(4,13),12(4)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),76(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         L     3,=A(SIZETYPE)
         MVC   88(4,13),0(3)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'59'
         MVC   92(4,13),4(4)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,4(4)
         MVC   12(4,4),68(2)
         ST    15,88(13)
         L     3,112(13)
         SRL   3,3
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(ROUND@UP)
         BALR  14,15
         ST    15,4(4)
L187     EQU   *
         L     2,4(4)
         L     2,8(2)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BNE   L184
         MVC   8(4,4),112(13)
L184     EQU   *
         MVC   88(4,13),0(4)
         L     2,=V(TARGETM)
         L     2,236(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    L189
         L     3,56(5)
         LTR   3,3
         BE    L191
         L     2,28(5)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    L190
L191     EQU   *
         L     2,24(4)
         LTR   2,2
         BE    L189
         L     2,28(2)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L189
L190     EQU   *
         L     6,24(4)
         LTR   6,6
         BE    L192
         LTR   3,3
         BE    L193
         MVC   88(4,13),24(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L193
         L     2,24(4)
         MVC   88(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   L193
         L     2,24(4)
         MVC   88(4,13),24(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L193
         MVC   88(4,13),16(9)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L193
         MVC   88(4,13),16(9)
         L     2,24(4)
         L     2,4(2)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LTR   15,15
         BE    L193
         MVC   88(4,13),24(5)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    7,15
         L     2,32(4)
         CR    2,15
         BNL   L194
         L     2,24(4)
         MVC   4(4,4),52(2)
         MVC   88(4,13),=F'59'
         MVC   92(4,13),16(9)
         MVC   96(4,13),84(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,12(4)
         ST    5,24(4)
         MVC   88(4,13),16(9)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         ST    15,32(4)
L194     EQU   *
         L     2,32(4)
         SR    2,7
         ST    2,32(4)
         B     L195
L193     EQU   *
         L     2,24(4)
         MVC   88(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L196
         L     2,24(4)
         L     3,4(2)
         L     3,16(3)
         MVC   88(4,13),=F'59'
         ST    3,92(13)
         MVC   96(4,13),84(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,12(4)
         B     L197
L196     EQU   *
         SLR   6,6
L197     EQU   *
         L     2,56(5)
         LTR   2,2
         BE    L199
         MVC   88(4,13),24(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L195
L199     EQU   *
         MVC   24(4,4),=F'0'
L195     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1603)
         BALR  14,15
L192     EQU   *
         L     2,56(5)
         LTR   2,2
         BE    L201
         LTR   6,6
         BE    L202
         MVC   88(4,13),16(9)
         L     2,4(6)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         B     L224
L202     EQU   *
         MVC   88(4,13),24(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
L224     EQU   *
         LTR   15,15
         BNE   L189
L201     EQU   *
         LA    3,8(0,0)
         L     2,24(5)
         LTR   2,2
         BE    L204
         L     2,4(5)
         MVC   88(4,13),16(2)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L204
         MVC   88(4,13),24(5)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L204
         L     2,4(5)
         MVC   88(4,13),16(2)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),24(5)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         SR    2,15
         ST    2,32(4)
L204     EQU   *
         L     2,28(5)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L205
         L     2,36(9)
         CLR   3,2
         BNL   L205
         LR    3,2
L205     EQU   *
         LTR   6,6
         BE    L207
         L     2,56(6)
         LTR   2,2
         BE    L207
         MVC   88(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L207
         L     2,4(6)
         L     2,36(2)
         CLR   3,2
         BNL   L207
         LR    3,2
L207     EQU   *
         L     2,=A(MAXIMUM@)
         L     2,0(2)
         LTR   2,2
         BE    L209
         CLR   3,2
         BNH   L209
         LR    3,2
L209     EQU   *
         MVC   88(4,13),12(4)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(ROUND@UP)
         BALR  14,15
         ST    15,12(4)
         MVC   24(4,4),=F'0'
L189     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1603)
         BALR  14,15
         MVC   52(4,5),4(4)
         MVC   84(4,5),12(4)
         L     3,8(4)
         LCR   2,3
         NR    2,3
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         STC   15,39(5)
         MVC   88(4,13),84(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L211
         MVC   88(4,13),84(5)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),84(5)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LCR   3,15
         NR    3,2
         B     L212
L211     EQU   *
         MVC   88(4,13),52(5)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LA    3,64(0,0)
         LTR   15,15
         BNE   L212
         MVC   88(4,13),52(5)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L215
         MVC   88(4,13),52(5)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),52(5)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LCR   3,15
         NR    3,2
         SLL   3,3
         B     L212
L215     EQU   *
         SLR   2,2
         IC    2,39(5)
         LA    3,1(0,0)
         SLL   3,0(2)
L212     EQU   *
         CLR   8,3
         BE    L217
         ST    5,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(LAYOUT@D)
         BALR  14,15
L217     EQU   *
         L     2,24(4)
         LTR   2,2
         BNE   L218
         L     2,56(5)
         LTR   2,2
         BE    L218
         ST    5,24(4)
L218     EQU   *
         L     3,24(5)
         LTR   3,3
         BE    L160
         L     2,40(5)
         L     2,8(2)
         N     2,=F'-16769024'
         L     6,=F'419430400'
         CLR   2,6
         BE    L221
         MVC   88(4,13),=F'63'
         MVC   92(4,13),12(4)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),76(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         L     3,=A(SIZETYPE)
         MVC   88(4,13),0(3)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'59'
         MVC   92(4,13),4(4)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,4(4)
         MVC   88(4,13),=F'59'
         ST    15,92(13)
         MVC   96(4,13),40(5)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,4(4)
         MVC   12(4,4),68(2)
         L     2,8(4)
         L     15,112(13)
         CLR   15,2
         BNH   L222
         LR    15,2
L222     EQU   *
         ST    15,8(4)
         B     L160
L221     EQU   *
         MVC   88(4,13),=F'59'
         MVC   92(4,13),12(4)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,12(4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1603)
         BALR  14,15
L160     EQU   *
* Function place_field epilogue
         PDPEPIL
* Function place_field literal pool
         DS    0F
         LTORG
* Function place_field page table
         DS    0F
PGT25    EQU   *
         DC    A(PG25)
         DS    0F
* X-func ZZZ_179 prologue
ZZZ@179  PDPPRLG CINDEX=26,FRAME=104,BASER=12,ENTRY=YES
         B     FEN26
         LTORG
FEN26    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG26     EQU   *
         LR    11,1
         L     10,=A(PGT26)
* Function ZZZ_179 code
         L     4,0(11)
         SLR   5,5
         L     2,32(4)
         N     2,=F'-8323073'
         O     2,=F'65536'
         ST    2,32(4)
         MVC   88(4,13),16(4)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L226
         L     3,12(4)
L242     EQU   *
         LTR   3,3
         BE    L241
         CLI   8(3),37
         BNE   L230
         L     15,4(3)
         IC    2,8(15)
         CLM   2,1,=XL1'00'
         BE    L226
         L     2,32(15)
         N     2,=F'8339456'
         L     6,=F'65536'
         CLR   2,6
         BNE   L234
         L     2,16(15)
         LTR   2,2
         BE    L226
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BE    L226
L234     EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(BIT@POSI)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L226
         L     2,24(3)
         LTR   2,2
         BE    L226
         ST    2,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L226
         MVC   88(4,13),16(4)
         MVC   92(4,13),24(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LTR   15,15
         BE    L230
         SLR   5,5
         IC    5,28(3)
L230     EQU   *
         L     3,0(3)
         B     L242
L241     EQU   *
         CLI   8(4),20
         BNE   L237
         LTR   5,5
         BE    L237
         N     5,=F'127'
         SLL   5,16
         L     2,32(4)
         N     2,=F'-8323073'
         OR    2,5
         B     L243
L237     EQU   *
         MVC   88(4,13),16(4)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(ZZZ@1576)
         BALR  14,15
         N     15,=F'127'
         SLL   15,16
         L     2,32(4)
         N     2,=F'-8323073'
         OR    2,15
L243     EQU   *
         ST    2,32(4)
L226     EQU   *
* Function ZZZ_179 epilogue
         PDPEPIL
* Function ZZZ_179 literal pool
         DS    0F
         LTORG
* Function ZZZ_179 page table
         DS    0F
PGT26    EQU   *
         DC    A(PG26)
         DS    0F
* Function finalize_type_size,F5 prologue
@@F5     PDPPRLG CINDEX=27,FRAME=104,BASER=12,ENTRY=NO
         B     FEN27
         LTORG
FEN27    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG27     EQU   *
         LR    11,1
         L     10,=A(PGT27)
* Function finalize_type_size code
         L     3,0(11)
         L     4,32(3)
         LR    2,4
         N     2,=F'8323072'
         L     5,=F'65536'
         CLR   2,5
         BE    L245
         LTR   2,2
         BE    L245
         IC    15,8(3)
         LA    2,236(,15)
         CLM   2,1,=XL1'02'
         BNH   L245
         CLM   15,1,=XL1'12'
         BE    L245
         LR    2,4
         SRL   2,16
         N     2,=F'127'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(GET@MODE)
         BALR  14,15
         ST    15,36(3)
         N     4,=F'-2'
         ST    4,32(3)
L245     EQU   *
         L     2,20(3)
         LTR   2,2
         BNE   L246
         L     2,16(3)
         LTR   2,2
         BE    L246
         MVC   88(4,13),=F'64'
         ST    2,92(13)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),76(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         L     2,=A(SIZETYPE)
         MVC   88(4,13),0(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    15,20(3)
L246     EQU   *
         L     2,16(3)
         LTR   2,2
         BE    L247
         ST    2,88(13)
         MVC   92(4,13),36(3)
         LA    1,88(,13)
         L     15,=A(ROUND@UP)
         BALR  14,15
         ST    15,16(3)
         MVC   88(4,13),20(3)
         L     2,36(3)
         SRL   2,3
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(ROUND@UP)
         BALR  14,15
         ST    15,20(3)
L247     EQU   *
         L     2,16(3)
         LTR   2,2
         BE    L248
         CLI   8(2),25
         BE    L248
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@2007)
         BALR  14,15
         ST    15,16(3)
L248     EQU   *
         L     2,20(3)
         LTR   2,2
         BE    L249
         CLI   8(2),25
         BE    L249
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@2007)
         BALR  14,15
         ST    15,20(3)
L249     EQU   *
         L     2,64(3)
         LTR   2,2
         BNE   L251
         CL    3,68(3)
         BE    L244
L251     EQU   *
         L     8,16(3)
         L     7,20(3)
         L     6,36(3)
         L     2,32(3)
         LR    5,2
         N     5,=F'1'
         LR    4,2
         SRL   4,16
         N     4,=F'127'
         L     15,68(3)
         LTR   15,15
         BE    L244
L255     EQU   *
         ST    8,16(15)
         ST    7,20(15)
         ST    6,36(15)
         L     3,32(15)
         N     3,=F'-8323074'
         LR    2,4
         N     2,=F'127'
         SLL   2,16
         OR    3,5
         OR    3,2
         ST    3,32(15)
         L     15,64(15)
         LTR   15,15
         BNE   L255
L244     EQU   *
* Function finalize_type_size epilogue
         PDPEPIL
* Function finalize_type_size literal pool
         DS    0F
         LTORG
* Function finalize_type_size page table
         DS    0F
PGT27    EQU   *
         DC    A(PG27)
LC14     EQU   *
         DC    C'padding struct size to alignment boundary'
         DC    X'0'
LC15     EQU   *
         DC    C'packed attribute is unnecessary for `%s'''
         DC    X'0'
LC16     EQU   *
         DC    C'packed attribute is unnecessary'
         DC    X'0'
         DS    0F
* X-func finish_record_layout prologue
FINISH@R PDPPRLG CINDEX=28,FRAME=104,BASER=12,ENTRY=YES
         B     FEN28
         LTORG
FEN28    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG28     EQU   *
         LR    11,1
         L     10,=A(PGT28)
* Function finish_record_layout code
         L     4,0(11)
         MVC   8(4,4),=F'8'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1603)
         BALR  14,15
         L     3,0(4)
         L     15,36(3)
         L     2,16(4)
         CLR   2,15
         BNL   L258
         LR    2,15
L258     EQU   *
         ST    2,36(3)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1841)
         BALR  14,15
         LR    5,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(ZZZ@1842)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L259
         MVC   88(4,13),=F'59'
         ST    3,92(13)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),64(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         LR    3,15
L259     EQU   *
         L     2,0(4)
         ST    5,88(13)
         MVC   92(4,13),36(2)
         LA    1,88(,13)
         L     15,=A(ROUND@UP)
         BALR  14,15
         ST    15,16(2)
         L     2,0(4)
         ST    3,88(13)
         L     3,36(2)
         SRL   3,3
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(ROUND@UP)
         BALR  14,15
         ST    15,20(2)
         L     2,=V(WARN@PAD)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L260
         L     2,8(5)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BE    L260
         ST    5,88(13)
         L     2,0(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LTR   15,15
         BNE   L260
         MVC   88(4,13),=A(LC14)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L260     EQU   *
         L     2,=V(WARN@PAC)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BE    L272
         L     3,0(4)
         CLI   8(3),20
         BNE   L272
         L     2,32(3)
         SRL   2,11
         N     2,=F'1'
         LTR   2,2
         BE    L272
         L     2,36(4)
         LTR   2,2
         BNE   L272
         L     2,8(5)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         BE    L272
         L     15,36(3)
         L     2,20(4)
         CLR   2,15
         BNL   L262
         LR    2,15
L262     EQU   *
         ST    2,20(4)
         MVC   88(4,13),16(3)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(ROUND@UP)
         BALR  14,15
         ST    15,88(13)
         L     2,0(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LTR   15,15
         BE    L272
         L     2,0(4)
         NC    32(4,2),=F'-2049'
         L     2,0(4)
         L     2,52(2)
         LTR   2,2
         BE    L270
         CLI   8(2),1
         BE    L279
         L     2,44(2)
L279     EQU   *
         L     2,12(2)
         MVC   88(4,13),=A(LC15)
         ST    2,92(13)
         B     L280
L270     EQU   *
         MVC   88(4,13),=A(LC16)
L280     EQU   *
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
L272     EQU   *
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=A(ZZZ@179)
         BALR  14,15
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
L281     EQU   *
         L     2,28(4)
         LTR   2,2
         BE    L278
         L     2,28(4)
         MVC   88(4,13),16(2)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(LAYOUT@D)
         BALR  14,15
         L     2,28(4)
         MVC   28(4,4),0(2)
         B     L281
L278     EQU   *
         L     2,4(11)
         LTR   2,2
         BE    L257
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L257     EQU   *
* Function finish_record_layout epilogue
         PDPEPIL
* Function finish_record_layout literal pool
         DS    0F
         LTORG
* Function finish_record_layout page table
         DS    0F
PGT28    EQU   *
         DC    A(PG28)
         DS    0F
* X-func layout_type prologue
LAYOUT@T PDPPRLG CINDEX=29,FRAME=112,BASER=12,ENTRY=YES
         B     FEN29
         LTORG
FEN29    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG29     EQU   *
         LR    11,1
         L     10,=A(PGT29)
* Function layout_type code
         SLR   4,4
         SLR   5,5
         LR    8,4
         LR    9,5
         L     6,0(11)
         LTR   6,6
         BNE   L283
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1520'
         L     14,=A(L354)
         BR    14
L283     EQU   *
         L     2,16(6)
         LTR   2,2
         L     14,=A(L282)
         BNER  14
         SLR   3,3
         IC    3,8(6)
         A     3,=F'-5'
         LA    2,19(0,0)
         CLR   3,2
         L     14,=A(L342)
         BHR   14
         SLL   3,2
         L     2,=A(L343)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
L343     EQU   *
         DC    A(L298)
         DC    A(L291)
         DC    A(L293)
         DC    A(L294)
         DC    A(L297)
         DC    A(L291)
         DC    A(L287)
         DC    A(L291)
         DC    A(L303)
         DC    A(L299)
         DC    A(L303)
         DC    A(L301)
         DC    A(L341)
         DC    A(L307)
         DC    A(L330)
         DC    A(L322)
         DC    A(L322)
         DC    A(L322)
         DC    A(L301)
         DC    A(L286)
L286     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1531'
         L     14,=A(L354)
         BR    14
L287     EQU   *
         L     3,32(6)
         LR    2,3
         SRL   2,23
         LTR   2,2
         BNE   L291
         N     3,=F'8388607'
         O     3,=F'8388608'
         ST    3,32(6)
L291     EQU   *
         L     2,56(6)
         CLI   8(2),25
         BNE   L292
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1983)
         BALR  14,15
         LTR   15,15
         BL    L292
         OC    8(4,6),=F'262144'
L292     EQU   *
         L     3,32(6)
         SRL   3,23
         ST    3,88(13)
         MVC   92(4,13),=F'2'
         LA    1,88(,13)
         L     15,=A(SMALLEST)
         BALR  14,15
         B     L355
L293     EQU   *
         L     15,32(6)
         SRL   15,23
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@1575)
         BALR  14,15
L355     EQU   *
         N     15,=F'127'
         SLL   15,16
         L     2,32(6)
         N     2,=F'-8323073'
         OR    2,15
         ST    2,32(6)
         L     3,=V(MODE@SIZ)
         SRL   2,16
         N     2,=F'127'
         SLR   4,4
         IC    4,0(3,2)
         LR    2,4
         SLL   2,3
         ST    2,88(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,16(6)
         LH    2,32(6)
         N     2,=F'127'
         SLR   5,5
         IC    5,0(3,2)
         ST    5,88(13)
         B     L353
L294     EQU   *
         L     3,4(6)
         L     4,8(3)
         N     4,=F'262144'
         L     2,8(6)
         N     2,=F'-262145'
         OR    2,4
         ST    2,8(6)
         L     2,32(3)
         SRL   2,23
         SLL   2,1
         ST    2,88(13)
         IC    2,8(3)
         X     2,=F'6'
         N     2,=XL4'000000FF'
         LCR   2,2
         SRL   2,31
         A     2,=F'5'
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@1575)
         BALR  14,15
         N     15,=F'127'
         SLL   15,16
         L     2,32(6)
         N     2,=F'-8323073'
         OR    2,15
         ST    2,32(6)
         L     3,=V(MODE@SIZ)
         SRL   2,16
         N     2,=F'127'
         SLR   15,15
         IC    15,0(3,2)
         LR    2,15
         SLL   2,3
         ST    2,88(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,16(6)
         LH    2,32(6)
         N     2,=F'127'
         SLR   4,4
         IC    4,0(3,2)
         ST    4,88(13)
         B     L353
L297     EQU   *
         L     2,4(6)
         L     3,8(2)
         N     3,=F'262144'
         L     2,8(6)
         N     2,=F'-262145'
         OR    2,3
         ST    2,8(6)
         L     3,=V(MODE@SIZ)
         LH    2,32(6)
         N     2,=F'127'
         SLR   5,5
         IC    5,0(3,2)
         LR    2,5
         SLL   2,3
         ST    2,88(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,16(6)
         LH    2,32(6)
         N     2,=F'127'
         SLR   15,15
         IC    15,0(3,2)
         ST    15,88(13)
         B     L353
L298     EQU   *
         MVC   36(4,6),=F'1'
         NC    32(4,6),=F'-8323074'
         L     14,=A(L285)
         BR    14
L299     EQU   *
         MVC   88(4,13),=F'32'
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,16(6)
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,20(6)
         MVC   88(4,13),=F'32'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@1575)
         BALR  14,15
         L     14,=A(L356)
         BR    14
L301     EQU   *
         MVC   88(4,13),=F'64'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ZZZ@1575)
         BALR  14,15
         N     15,=F'127'
         SLL   15,16
         L     2,32(6)
         N     2,=F'-8323073'
         OR    2,15
         ST    2,32(6)
         MVC   88(4,13),=F'64'
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,16(6)
         MVC   88(4,13),=F'8'
L353     EQU   *
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,20(6)
         L     14,=A(L285)
         BR    14
L303     EQU   *
         CLI   8(6),15
         BNE   L306
         L     2,=A(@@V2)
         L     2,0(2)
         LA    3,6(0,0)
         LTR   2,2
         BNE   L305
L306     EQU   *
         LH    3,32(6)
         N     3,=F'127'
L305     EQU   *
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         LR    3,4
         SLL   3,3
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,16(6)
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,20(6)
         OC    8(4,6),=F'262144'
         SLL   3,23
         L     2,32(6)
         N     2,=F'8388607'
         L     14,=A(L357)
         BR    14
L307     EQU   *
         L     7,12(6)
         L     4,4(6)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@87)
         BALR  14,15
         LTR   7,7
         BE    L308
         L     5,60(7)
         LTR   5,5
         BE    L308
         L     3,56(7)
         LTR   3,3
         BE    L308
         L     2,16(4)
         LTR   2,2
         BE    L308
         MVC   88(4,13),=F'60'
         MVC   92(4,13),4(3)
         ST    5,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         L     9,=A(SIZETYPE)
         MVC   88(4,13),0(9)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'59'
         L     5,=V(GLOBAL@T)
         MVC   92(4,13),64(5)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         LR    5,15
         L     8,16(4)
         L     2,32(6)
         SRL   2,11
         N     2,=F'1'
         LTR   2,2
         BE    L309
         IC    2,8(4)
         CLM   2,1,=XL1'06'
         BE    L310
         CLM   2,1,=XL1'0A'
         BE    L310
         CLM   2,1,=XL1'0B'
         BE    L310
         CLM   2,1,=XL1'0C'
         BNE   L309
L310     EQU   *
         MVC   88(4,13),60(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1484)
         BALR  14,15
         LTR   15,15
         BNE   L311
         MVC   88(4,13),60(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1481)
         BALR  14,15
         LTR   15,15
         BE    L309
L311     EQU   *
         MVC   88(4,13),56(4)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    L309
         MVC   88(4,13),60(4)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),56(4)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    2,3
         SR    2,15
         LA    15,1(0,0)
         CLR   2,15
         BNE   L309
         CLR   3,15
         BH    L309
         L     2,=V(GLOBAL@T)
         L     8,48(2)
L309     EQU   *
         L     2,0(9)
         L     2,8(2)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BNE   L313
         L     2,56(7)
         CLI   8(2),25
         BE    L313
         L     2,60(7)
         CLI   8(2),25
         BE    L313
         MVC   88(4,13),=F'79'
         ST    5,92(13)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),60(2)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         LR    5,15
L313     EQU   *
         MVC   88(4,13),12(9)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'61'
         ST    8,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,16(6)
         L     2,20(4)
         LTR   2,2
         BE    L308
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1481)
         BALR  14,15
         LTR   15,15
         BNE   L308
         MVC   88(4,13),=F'61'
         MVC   92(4,13),20(4)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(SIZE@BIN)
         BALR  14,15
         ST    15,20(6)
L308     EQU   *
         L     2,36(4)
         LA    3,8(0,0)
         CLR   2,3
         BNL   L315
         LR    2,3
L315     EQU   *
         ST    2,36(6)
         L     3,32(4)
         N     3,=F'1'
         L     2,32(6)
         N     2,=F'-8323074'
         OR    2,3
         O     2,=F'65536'
         ST    2,32(6)
         L     4,16(6)
         LTR   4,4
         L     14,=A(L285)
         BER   14
         L     3,4(6)
         L     2,32(3)
         N     2,=F'8339456'
         L     5,=F'65536'
         CLR   2,5
         L     14,=A(L285)
         BER   14
         ST    4,88(13)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1905)
         BALR  14,15
         LTR   15,15
         BE    L317
         L     2,4(6)
         LH    2,32(2)
         N     2,=F'127'
         SLL   2,16
         L     3,32(6)
         N     3,=F'-8323073'
         OR    3,2
         ST    3,32(6)
         L     14,=A(L285)
         BR    14
L317     EQU   *
         MVC   88(4,13),16(6)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(ZZZ@1576)
         BALR  14,15
L356     EQU   *
         N     15,=F'127'
         SLL   15,16
         L     2,32(6)
         N     2,=F'-8323073'
         OR    2,15
         L     14,=A(L352)
         BR    14
L322     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(START@RE)
         BALR  14,15
         LR    3,15
         CLI   8(6),22
         BNE   L323
         MVC   88(4,13),12(6)
         LA    1,88(,13)
         L     15,=V(NREVERSE)
         BALR  14,15
         ST    15,12(6)
L323     EQU   *
         L     2,12(6)
L350     EQU   *
         LTR   2,2
         BE    L349
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(PLACE@FI)
         BALR  14,15
         L     2,0(2)
         B     L350
L349     EQU   *
         CLI   8(6),22
         BNE   L328
         MVC   88(4,13),12(6)
         LA    1,88(,13)
         L     15,=V(NREVERSE)
         BALR  14,15
         ST    15,12(6)
L328     EQU   *
         L     2,=A(LANG@ADJ)
         L     2,0(2)
         LTR   2,2
         BE    L329
         ST    3,88(13)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
L329     EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(FINISH@R)
         BALR  14,15
         L     14,=A(L285)
         BR    14
L330     EQU   *
         L     2,12(6)
         L     3,60(2)
         CLI   8(3),25
         BNE   L332
         L     2,56(2)
         CLI   8(2),25
         BE    L331
L332     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1759'
         B     L354
L331     EQU   *
         L     2,=A(SET@ALIG)
         L     7,0(2)
         LTR   7,7
         BNE   L334
         LA    7,32(0,0)
L334     EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    3,15
         L     2,12(6)
         MVC   88(4,13),56(2)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         SR    3,15
         LR    15,3
         A     15,=F'1'
         ST    15,104(13)
         LR    4,7
         AR    4,3
         SLR   5,5
         CLR   7,4
         BH    L337
         LTR   7,7
         BL    L336
         LA    2,1(0,0)
         CLR   7,2
         BE    L335
         SRDL  4,32
         DR    4,7
         B     L337
L335     EQU   *
         LR    5,4
         B     L337
L336     EQU   *
         LA    5,1(0,0)
L337     EQU   *
         LR    9,7
         MR    8,5
         LR    3,9
         CR    9,7
         BNH   L338
         L     2,32(6)
         N     2,=F'-8323073'
         O     2,=F'65536'
         B     L351
L338     EQU   *
         ST    7,88(13)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(ZZZ@1575)
         BALR  14,15
         N     15,=F'127'
         SLL   15,16
         L     2,32(6)
         N     2,=F'-8323073'
         OR    2,15
L351     EQU   *
         ST    2,32(6)
         ST    3,88(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,16(6)
         LR    2,3
         LTR   3,3
         BNL   L340
         A     2,=F'7'
L340     EQU   *
         SRA   2,3
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1921)
         BALR  14,15
         ST    15,20(6)
         ST    7,36(6)
         L     3,104(13)
         SLL   3,23
         L     2,32(6)
         N     2,=F'8388606'
L357     EQU   *
         OR    2,3
         B     L352
L341     EQU   *
         MVC   36(4,6),=F'64'
         L     2,32(6)
         N     2,=F'-8323074'
         O     2,=F'65536'
L352     EQU   *
         ST    2,32(6)
         B     L285
L342     EQU   *
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1795'
L354     EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L285     EQU   *
         IC    4,8(6)
         LA    2,236(,4)
         CLM   2,1,=XL1'02'
         BNH   L344
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@F5)
         BALR  14,15
L344     EQU   *
         L     2,=A(@@V3)
         L     2,0(2)
         LTR   2,2
         BNE   L345
         ST    2,88(13)
         ST    6,92(13)
         L     2,=A(@@V4)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,0(2)
L345     EQU   *
         IC    2,8(6)
         CLM   2,1,=XL1'12'
         BE    L347
         CLM   2,1,=XL1'14'
         BE    L347
         CLM   2,1,=XL1'15'
         BE    L347
         CLM   2,1,=XL1'16'
         BE    L347
         CLM   2,1,=XL1'13'
         BNE   L282
L347     EQU   *
         L     2,80(6)
         L     5,=F'-1'
         CLR   2,5
         BE    L282
         MVC   80(4,6),=F'0'
L282     EQU   *
* Function layout_type epilogue
         PDPEPIL
* Function layout_type literal pool
         DS    0F
         LTORG
* Function layout_type page table
         DS    0F
PGT29    EQU   *
         DC    A(PG29)
         DS    0F
* X-func finish_builtin_struct prologue
FINISH@B PDPPRLG CINDEX=30,FRAME=104,BASER=12,ENTRY=YES
         B     FEN30
         LTORG
FEN30    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG30     EQU   *
         LR    11,1
         L     10,=A(PGT30)
* Function finish_builtin_struct code
         L     4,0(11)
         L     3,8(11)
         L     5,12(11)
         SLR   15,15
L366     EQU   *
         LTR   3,3
         BE    L365
         ST    4,48(3)
         L     2,0(3)
         ST    15,0(3)
         LR    15,3
         LR    3,2
         B     L366
L365     EQU   *
         ST    15,12(4)
         LTR   5,5
         BE    L363
         MVC   36(4,4),36(5)
         L     3,32(5)
         N     3,=F'1'
         L     2,32(4)
         N     2,=F'-2'
         OR    2,3
         ST    2,32(4)
L363     EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(LAYOUT@T)
         BALR  14,15
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GET@IDEN)
         BALR  14,15
         MVC   88(4,13),=F'33'
         ST    15,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@72)
         BALR  14,15
         ST    15,52(4)
         ST    15,0(4)
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(LAYOUT@D)
         BALR  14,15
* Function finish_builtin_struct epilogue
         PDPEPIL
* Function finish_builtin_struct literal pool
         DS    0F
         LTORG
* Function finish_builtin_struct page table
         DS    0F
PGT30    EQU   *
         DC    A(PG30)
         DS    0F
* X-func ZZZ_1447 prologue
ZZZ@1447 PDPPRLG CINDEX=31,FRAME=96,BASER=12,ENTRY=YES
         B     FEN31
         LTORG
FEN31    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG31     EQU   *
         LR    11,1
         L     10,=A(PGT31)
* Function ZZZ_1447 code
         MVC   88(4,13),=F'6'
         LA    1,88(,13)
         L     15,=V(MAKE@NOD)
         BALR  14,15
         LR    2,15
         L     5,=V(ZZZ@1483)
         ST    15,20(5)
         L     3,32(15)
         N     3,=F'-8323073'
         O     3,=F'393216'
         ST    3,32(15)
         MVC   88(4,13),=F'6'
         LA    1,88(,13)
         L     15,=A(GET@MODE)
         BALR  14,15
         ST    15,36(2)
         N     3,=F'-7929858'
         ST    3,32(2)
         L     3,=V(MODE@SIZ)
         SLR   4,4
         IC    4,6(3)
         LR    3,4
         SLL   4,3
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    15,16(2)
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    15,20(2)
         OC    8(4,2),=F'262144'
         SLL   4,23
         L     3,32(2)
         N     3,=F'8388607'
         OR    3,4
         ST    3,32(2)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    15,56(2)
         OC    32(4,2),=F'16384'
         MVC   88(4,13),=F'1000'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    15,60(2)
         L     3,=A(SIZETYPE)
         ST    2,0(3)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(COPY@NOD)
         BALR  14,15
         ST    15,12(3)
         MVC   20(4,5),=F'0'
* Function ZZZ_1447 epilogue
         PDPEPIL
* Function ZZZ_1447 literal pool
         DS    0F
         LTORG
* Function ZZZ_1447 page table
         DS    0F
PGT31    EQU   *
         DC    A(PG31)
         DS    0F
* X-func set_min_and_max_values_for_integral_type prologue
SET@MIN@ PDPPRLG CINDEX=32,FRAME=96,BASER=12,ENTRY=YES
         B     FEN32
         LTORG
FEN32    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG32     EQU   *
         LR    11,1
         L     10,=A(PGT32)
* Function set_min_and_max_values_for_integral_type code
         L     7,0(11)
         L     3,4(11)
         LR    5,3
         A     5,=F'-32'
         CLI   11(11),0
         BE    L369
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         LR    6,15
         L     2,=F'-1'
         LTR   5,5
         BNL   L371
         LA    2,1(0,0)
         SLL   2,0(3)
         BCTR  2,0
L371     EQU   *
         ST    2,88(13)
         SLR   15,15
         LTR   5,5
         BNH   L373
         LA    2,64(0,0)
         SR    2,3
         L     15,=F'-1'
         SRL   15,0(2)
L373     EQU   *
         ST    15,92(13)
         B     L382
L369     EQU   *
         SLR   2,2
         LTR   5,5
         BH    L376
         BCTR  3,0
         L     2,=F'-1'
         SLL   2,0(3)
         A     3,=F'1'
L376     EQU   *
         ST    2,88(13)
         LR    4,3
         A     4,=F'-33'
         LR    2,4
         BNL   L377
         SLR   2,2
L377     EQU   *
         L     6,=F'-1'
         SLL   6,0(2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         LR    6,15
         L     2,=F'-1'
         LTR   5,5
         BH    L379
         AR    3,2
         LA    2,1(0,0)
         SLL   2,0(3)
         BCTR  2,0
L379     EQU   *
         ST    2,88(13)
         SLR   2,2
         LTR   4,4
         BNH   L381
         LA    2,1(0,0)
         SLL   2,0(4)
         BCTR  2,0
L381     EQU   *
         ST    2,92(13)
L382     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@84)
         BALR  14,15
         ST    7,4(6)
         ST    7,4(15)
         ST    6,56(7)
         ST    15,60(7)
* Function set_min_and_max_values_for_integral_type epilogue
         PDPEPIL
* Function set_min_and_max_values_for_integral_type literal pool
         DS    0F
         LTORG
* Function set_min_and_max_values_for_integral_type page table
         DS    0F
PGT32    EQU   *
         DC    A(PG32)
         DS    0F
* X-func fixup_unsigned_type prologue
FIXUP@UN PDPPRLG CINDEX=33,FRAME=104,BASER=12,ENTRY=YES
         B     FEN33
         LTORG
FEN33    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG33     EQU   *
         LR    11,1
         L     10,=A(PGT33)
* Function fixup_unsigned_type code
         L     2,0(11)
         L     15,32(2)
         SRL   15,23
         LA    3,64(0,0)
         CR    15,3
         BNH   L384
         LR    15,3
L384     EQU   *
         ST    2,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(SET@MIN@)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(LAYOUT@T)
         BALR  14,15
* Function fixup_unsigned_type epilogue
         PDPEPIL
* Function fixup_unsigned_type literal pool
         DS    0F
         LTORG
* Function fixup_unsigned_type page table
         DS    0F
PGT33    EQU   *
         DC    A(PG33)
         DS    0F
* X-func make_unsigned_type prologue
MAKE@UNS PDPPRLG CINDEX=34,FRAME=96,BASER=12,ENTRY=YES
         B     FEN34
         LTORG
FEN34    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG34     EQU   *
         LR    11,1
         L     10,=A(PGT34)
* Function make_unsigned_type code
         L     4,0(11)
         MVC   88(4,13),=F'6'
         LA    1,88(,13)
         L     15,=V(MAKE@NOD)
         BALR  14,15
         LR    3,15
         SLL   4,23
         L     2,32(15)
         N     2,=F'8388607'
         OR    2,4
         ST    2,32(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(FIXUP@UN)
         BALR  14,15
         LR    15,3
* Function make_unsigned_type epilogue
         PDPEPIL
* Function make_unsigned_type literal pool
         DS    0F
         LTORG
* Function make_unsigned_type page table
         DS    0F
PGT34    EQU   *
         DC    A(PG34)
         DS    0F
* X-func fixup_signed_type prologue
FIXUP@SI PDPPRLG CINDEX=35,FRAME=104,BASER=12,ENTRY=YES
         B     FEN35
         LTORG
FEN35    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG35     EQU   *
         LR    11,1
         L     10,=A(PGT35)
* Function fixup_signed_type code
         L     2,0(11)
         L     15,32(2)
         SRL   15,23
         LA    3,64(0,0)
         CR    15,3
         BNH   L387
         LR    15,3
L387     EQU   *
         ST    2,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(SET@MIN@)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(LAYOUT@T)
         BALR  14,15
* Function fixup_signed_type epilogue
         PDPEPIL
* Function fixup_signed_type literal pool
         DS    0F
         LTORG
* Function fixup_signed_type page table
         DS    0F
PGT35    EQU   *
         DC    A(PG35)
         DS    0F
* X-func make_signed_type prologue
MAKE@SIG PDPPRLG CINDEX=36,FRAME=96,BASER=12,ENTRY=YES
         B     FEN36
         LTORG
FEN36    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG36     EQU   *
         LR    11,1
         L     10,=A(PGT36)
* Function make_signed_type code
         L     4,0(11)
         MVC   88(4,13),=F'6'
         LA    1,88(,13)
         L     15,=V(MAKE@NOD)
         BALR  14,15
         LR    3,15
         SLL   4,23
         L     2,32(15)
         N     2,=F'8388607'
         OR    2,4
         ST    2,32(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(FIXUP@SI)
         BALR  14,15
         LR    15,3
* Function make_signed_type epilogue
         PDPEPIL
* Function make_signed_type literal pool
         DS    0F
         LTORG
* Function make_signed_type page table
         DS    0F
PGT36    EQU   *
         DC    A(PG36)
LC17     EQU   *
         DC    C'bit_size_type'
         DC    X'0'
         DS    0F
* X-func set_sizetype prologue
SET@SIZE PDPPRLG CINDEX=37,FRAME=104,BASER=12,ENTRY=YES
         B     FEN37
         LTORG
FEN37    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG37     EQU   *
         LR    11,1
         L     10,=A(PGT37)
* Function set_sizetype code
         L     7,0(11)
         L     8,32(7)
         SRL   8,23
         LR    6,8
         A     6,=F'4'
         LA    2,64(0,0)
         CR    6,2
         BNH   L390
         LR    6,2
L390     EQU   *
         L     9,=A(@@V3)
         L     2,0(9)
         LTR   2,2
         BE    L391
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1896'
         B     L410
L391     EQU   *
         L     5,=A(SIZETYPE)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(COPY@NOD)
         BALR  14,15
         ST    15,0(5)
         ST    7,12(15)
         L     2,0(5)
         OC    32(4,2),=F'16384'
         MVC   88(4,13),=F'6'
         LA    1,88(,13)
         L     15,=V(MAKE@NOD)
         BALR  14,15
         ST    15,12(5)
         MVC   52(4,15),52(7)
         L     3,12(5)
         LR    4,6
         SLL   4,23
         L     2,32(3)
         N     2,=F'8388607'
         OR    2,4
         ST    2,32(3)
         L     2,12(5)
         OC    32(4,2),=F'16384'
         L     2,8(7)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BE    L392
         MVC   88(4,13),12(5)
         LA    1,88(,13)
         L     15,=A(FIXUP@UN)
         BALR  14,15
         B     L393
L392     EQU   *
         MVC   88(4,13),12(5)
         LA    1,88(,13)
         L     15,=A(FIXUP@SI)
         BALR  14,15
L393     EQU   *
         L     3,=A(SIZETYPE)
         MVC   88(4,13),12(5)
         LA    1,88(,13)
         L     15,=A(LAYOUT@T)
         BALR  14,15
         L     2,8(7)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         BE    L394
         MVC   8(4,5),0(5)
         MVC   20(4,5),12(5)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(MAKE@SIG)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(COPY@NOD)
         BALR  14,15
         ST    15,4(5)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(MAKE@SIG)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(COPY@NOD)
         BALR  14,15
         ST    15,16(5)
         B     L395
L394     EQU   *
         MVC   4(4,3),0(3)
         MVC   16(4,3),12(3)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(MAKE@UNS)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(COPY@NOD)
         BALR  14,15
         ST    15,8(3)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(MAKE@UNS)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(COPY@NOD)
         BALR  14,15
         ST    15,20(3)
L395     EQU   *
         L     2,12(5)
         MVC   88(4,13),=A(LC17)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         MVC   88(4,13),=A(LC17)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1025)
         BALR  14,15
         ST    15,52(2)
         SLR   4,4
L399     EQU   *
         LR    3,4
         SLL   3,2
         L     2,0(3,5)
         OC    32(4,2),=F'16384'
         L     2,0(3,5)
         ST    2,68(2)
         L     2,0(3,5)
         MVC   64(4,2),=F'0'
         L     2,0(3,5)
         MVC   40(4,2),=F'0'
         L     2,0(3,5)
         MVC   44(4,2),=F'0'
         A     4,=F'1'
         LA    2,5(0,0)
         CLR   4,2
         BNH   L399
         L     6,=A(@@V4)
         L     3,0(6)
L409     EQU   *
         LTR   3,3
         BE    L408
         L     4,16(3)
         IC    2,8(4)
         CLM   2,1,=XL1'06'
         BE    L403
         CLM   2,1,=XL1'0B'
         BE    L403
         MVC   88(4,13),=A(LC0)
         MVC   92(4,13),=F'1947'
L410     EQU   *
         MVC   96(4,13),=A(LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L403     EQU   *
         L     2,16(4)
         MVC   4(4,2),12(5)
         L     2,16(3)
         L     2,20(2)
         MVC   4(4,2),0(5)
         L     3,0(3)
         B     L409
L408     EQU   *
         MVC   0(4,6),=F'0'
         MVC   0(4,9),=F'1'
* Function set_sizetype epilogue
         PDPEPIL
* Function set_sizetype literal pool
         DS    0F
         LTORG
* Function set_sizetype page table
         DS    0F
PGT37    EQU   *
         DC    A(PG37)
         DS    0F
* X-func get_best_mode prologue
GET@BEST PDPPRLG CINDEX=38,FRAME=104,BASER=12,ENTRY=YES
         B     FEN38
         LTORG
FEN38    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG38     EQU   *
         LR    11,1
         L     10,=A(PGT38)
* Function get_best_mode code
         SLR   2,2
         SLR   3,3
         ST    2,96(13)
         ST    3,4+96(13)
         SLR   3,3
         L     4,=V(CLASS@NA)
         SLR   5,5
         IC    5,2(4)
         ST    5,88(13)
         LTR   5,5
         BE    L413
L419     EQU   *
         L     2,=V(MODE@SIZ)
         L     15,88(13)
         SLR   3,3
         IC    3,0(2,15)
         SLL   3,3
         L     2,4(11)
         ST    2,96(13)
         CLR   3,2
         BH    L418
         LA    5,1(0,0)
         CLR   3,5
         BE    L416
         L     4,96(13)
         L     5,4+96(13)
         SRDL  4,32
         DR    4,3
         ST    4,96(13)
         ST    5,4+96(13)
         B     L418
L416     EQU   *
         SLR   5,5
         ST    5,96(13)
L418     EQU   *
         L     2,96(13)
         A     2,0(11)
         CLR   2,3
         BNH   L413
         L     15,88(13)
         L     2,=V(MODE@WID)
         SLR   4,4
         IC    4,0(2,15)
         ST    4,88(13)
         LTR   4,4
         BNE   L419
L413     EQU   *
         L     5,88(13)
         LTR   5,5
         BE    L421
         LR    2,3
         LA    15,64(0,0)
         CLR   3,15
         BNH   L422
         LR    2,15
L422     EQU   *
         CL    2,8(11)
         BH    L421
         L     2,12(11)
         LTR   2,2
         BE    L420
         L     2,=V(MODE@SIZ)
         L     4,12(11)
         SLR   5,5
         IC    5,0(2,4)
         LR    2,5
         SLL   2,3
         CLR   3,2
         BNH   L420
L421     EQU   *
         SLR   15,15
         B     L411
L420     EQU   *
         L     15,16(11)
         LTR   15,15
         BNE   L423
         ST    15,92(13)
         L     2,=V(CLASS@NA)
         SLR   4,4
         IC    4,2(2)
         LTR   4,4
         BE    L423
L436     EQU   *
         L     5,=V(MODE@SIZ)
         SLR   3,3
         IC    3,0(5,4)
         SLL   3,3
         L     8,4(11)
         SLR   9,9
         CLR   3,8
         BH    L430
         LA    15,1(0,0)
         CLR   3,15
         BE    L428
         SRDL  8,32
         DR    8,3
         B     L430
L428     EQU   *
         LR    9,8
L430     EQU   *
         LR    5,9
         L     2,4(11)
         A     2,0(11)
         LR    6,2
         BCTR  6,0
         SLR   7,7
         CLR   3,6
         BH    L433
         LA    2,1(0,0)
         CLR   3,2
         BE    L431
         SRDL  6,32
         DR    6,3
         B     L433
L431     EQU   *
         LR    7,6
L433     EQU   *
         CLR   5,7
         BNE   L426
         LA    5,32(0,0)
         CLR   3,5
         BH    L426
         L     2,8(11)
         LA    15,64(0,0)
         CLR   2,15
         BNH   L434
         LR    2,15
L434     EQU   *
         CLR   3,2
         BH    L426
         L     2,12(11)
         LTR   2,2
         BE    L435
         LR    5,2
         L     15,=V(MODE@SIZ)
         SLR   2,2
         IC    2,0(15,5)
         SLL   2,3
         CLR   3,2
         BH    L426
L435     EQU   *
         ST    4,92(13)
L426     EQU   *
         L     2,=V(MODE@WID)
         SLR   3,3
         IC    3,0(2,4)
         LR    4,3
         LTR   3,3
         BNE   L436
         L     15,92(13)
         LTR   15,15
         BNE   L411
L423     EQU   *
         L     15,88(13)
L411     EQU   *
* Function get_best_mode epilogue
         PDPEPIL
* Function get_best_mode literal pool
         DS    0F
         LTORG
* Function get_best_mode page table
         DS    0F
PGT38    EQU   *
         DC    A(PG38)
* X-var sizetype_tab
         ENTRY SIZETYPE
         DS    0F
SIZETYPE EQU   *
         DC    24X'00'
* X-var maximum_field_alignment
         ENTRY MAXIMUM@
         DS    0F
MAXIMUM@ EQU   *
         DC    4X'00'
* X-var ZZZ_1439
         ENTRY ZZZ@1439
         DS    0F
ZZZ@1439 EQU   *
         DC    4X'00'
         DS    0F
@@V3     EQU   *
         DC    4X'00'
         DS    0F
@@V4     EQU   *
         DC    4X'00'
         DS    0F
@@V1     EQU   *
         DC    4X'00'
         END
