         COPY  PDPTOP
         CSECT
* Program data area
         DS    0F
@@V1     EQU   *
         DC    F'2'
         DC    F'0'
         DC    F'3'
         DC    F'0'
         DC    F'5'
         DC    F'0'
         DC    F'7'
         DC    F'0'
* Program text area
         DS    0F
* Function init_reg_map,F2 prologue
@@F2     PDPPRLG CINDEX=0,FRAME=88,BASER=12,ENTRY=NO
         B     FEN0
         LTORG
FEN0     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG0      EQU   *
         LR    11,1
         L     10,=A(PGT0)
* Function init_reg_map code
         L     5,0(11)
         L     15,4(11)
         BCTR  15,0
         LA    2,24(0,0)
         CR    15,2
         BNH   L11
         LR    4,15
         SLL   4,2
         A     4,16(5)
L5       EQU   *
         LR    3,15
         SLL   3,2
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         L     2,0(3,2)
         ST    2,0(4)
         BCTR  15,0
         A     4,=F'-4'
         LA    2,24(0,0)
         CR    15,2
         BH    L5
L11      EQU   *
         LA    15,24(0,0)
         L     3,16(5)
         LR    2,3
         A     2,=F'96'
L9       EQU   *
         MVC   0(4,2),=F'0'
         BCTR  15,0
         A     2,=F'-4'
         LTR   15,15
         BNL   L9
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         MVC   84(4,3),84(2)
         MVC   80(4,3),80(2)
* Function init_reg_map epilogue
         PDPEPIL
* Function init_reg_map literal pool
         DS    0F
         LTORG
* Function init_reg_map page table
         DS    0F
PGT0     EQU   *
         DC    A(PG0)
         DS    0F
* Function remap_split_bivs,F14 prologue
@@F14    PDPPRLG CINDEX=1,FRAME=104,BASER=12,ENTRY=NO
         B     FEN1
         LTORG
FEN1     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG1      EQU   *
         LR    11,1
         L     10,=A(PGT1)
* Function remap_split_bivs code
         L     2,0(11)
         L     4,180(2)
         A     4,=F'140'
         L     15,4(11)
         LTR   15,15
         BE    L14
         LH    5,0(15)
         N     5,=XL4'0000FFFF'
         LR    2,5
         A     2,=F'-67'
         LA    3,15(0,0)
         CLR   2,3
         BH    L16
         LA    3,1(0,0)
         SLL   3,0(2)
         LR    2,3
         N     2,=F'57651'
         LTR   2,2
         BNE   L14
         N     3,=F'128'
         LTR   3,3
         BE    L16
         L     2,4(15)
         CL    2,4(4)
         BNL   L16
         L     4,0(4)
         LR    3,2
         SLL   3,3
         L     2,0(3,4)
         LA    6,1(0,0)
         CLR   2,6
         BNE   L16
         L     2,4(3,4)
         L     2,8(2)
         L     15,8(2)
         B     L14
L16      EQU   *
         LR    2,5
         SLL   2,2
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         ST    3,96(13)
         L     2,=V(RTX@LENG)
         SLR   7,7
         IC    7,0(2,5)
         BCTR  7,0
         LTR   7,7
         BL    L41
         LR    9,7
         SLL   9,2
         L     6,4(11)
         AR    6,9
         A     6,=F'4'
L39      EQU   *
         L     3,96(13)
         IC    2,0(3,7)
         CLM   2,1,=XL1'85'
         BNE   L31
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(6)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         ST    15,0(6)
         B     L30
L31      EQU   *
         SLL   2,24
         SRA   2,24
         C     2,=F'-59'
         BNE   L30
         SLR   8,8
         L     2,0(6)
L43      EQU   *
         C     8,0(2)
         BNL   L30
         L     3,4(11)
         AR    3,9
         A     3,=F'4'
         L     5,0(3)
         LR    4,8
         SLL   4,2
         MVC   88(4,13),0(11)
         L     2,0(3)
         L     2,4(4,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         ST    15,4(4,5)
         A     8,=F'1'
         L     2,0(3)
         B     L43
L30      EQU   *
         BCTR  7,0
         A     6,=F'-4'
         A     9,=F'-4'
         LTR   7,7
         BNL   L39
L41      EQU   *
         L     15,4(11)
L14      EQU   *
* Function remap_split_bivs epilogue
         PDPEPIL
* Function remap_split_bivs literal pool
         DS    0F
         LTORG
* Function remap_split_bivs page table
         DS    0F
PGT1     EQU   *
         DC    A(PG1)
         DS    0F
* Function simplify_cmp_and_jump_insns,F1 prologue
@@F1     PDPPRLG CINDEX=2,FRAME=120,BASER=12,ENTRY=NO
         B     FEN2
         LTORG
FEN2     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG2      EQU   *
         LR    11,1
         L     10,=A(PGT2)
* Function simplify_cmp_and_jump_insns code
         L     5,0(11)
         L     7,4(11)
         L     2,8(11)
         L     6,12(11)
         L     4,16(11)
         ST    5,88(13)
         ST    7,92(13)
         ST    2,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1913)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   L45
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(SIGNED@C)
         BALR  14,15
         ST    2,88(13)
         ST    6,92(13)
         ST    15,96(13)
         ST    3,100(13)
         ST    7,104(13)
         LR    2,3
         CLR   5,15
         BE    L46
         LA    2,1(0,0)
L46      EQU   *
         ST    2,108(13)
         ST    4,112(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@540)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    4,40(15)
         L     3,20(4)
         A     3,=F'1'
         ST    3,20(4)
         B     L44
L45      EQU   *
         L     2,=V(CONST@TR)
         CL    15,0(2)
         BNE   L47
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@554)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(ZZZ@530)
         BALR  14,15
         ST    4,40(2)
         L     2,20(4)
         A     2,=F'1'
         ST    2,20(4)
L47      EQU   *
         SLR   15,15
L44      EQU   *
* Function simplify_cmp_and_jump_insns epilogue
         PDPEPIL
* Function simplify_cmp_and_jump_insns literal pool
         DS    0F
         LTORG
* Function simplify_cmp_and_jump_insns page table
         DS    0F
PGT2     EQU   *
         DC    A(PG2)
LC0      EQU   *
         DC    C'Preconditioning: Success, number of iterations k'
         DC    C'nown, %ld.'
         DC    X'15'
         DC    X'0'
LC1      EQU   *
         DC    C'Preconditioning: Could not find iteration variab'
         DC    C'le.'
         DC    X'15'
         DC    X'0'
LC2      EQU   *
         DC    C'Preconditioning: Could not find initial value.'
         DC    X'15'
         DC    X'0'
LC3      EQU   *
         DC    C'Preconditioning: Could not find increment value.'
         DC    X'15'
         DC    X'0'
LC4      EQU   *
         DC    C'Preconditioning: Increment not a constant.'
         DC    X'15'
         DC    X'0'
LC5      EQU   *
         DC    C'Preconditioning: Increment not a constant power '
         DC    C'of 2.'
         DC    X'15'
         DC    X'0'
LC6      EQU   *
         DC    C'Preconditioning: EQ comparison loop.'
         DC    X'15'
         DC    X'0'
LC7      EQU   *
         DC    C'Preconditioning: Final value not invariant.'
         DC    X'15'
         DC    X'0'
LC8      EQU   *
         DC    C'Preconditioning: Floating point final or initial'
         DC    C' value.'
         DC    X'15'
         DC    X'0'
LC9      EQU   *
         DC    C'<stdin>'
         DC    X'0'
LC10     EQU   *
         DC    C'?'
         DC    X'0'
LC11     EQU   *
         DC    C'Preconditioning: Iteration var not live before l'
         DC    C'oop start.'
         DC    X'15'
         DC    X'0'
LC12     EQU   *
         DC    C'Preconditioning: Successful.'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func precondition_loop_p prologue
PRECONDI PDPPRLG CINDEX=3,FRAME=112,BASER=12,ENTRY=YES
         B     FEN3
         LTORG
FEN3     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG3      EQU   *
         LR    11,1
         L     10,=A(PGT3)
* Function precondition_loop_p code
         L     6,0(11)
         L     7,4(11)
         L     9,8(11)
         L     8,16(11)
         MVC   104(4,13),196(6)
         L     4,180(6)
         L     5,68(4)
         LTR   5,5
         BE    L50
         L     2,60(4)
         L     2,4(2)
         L     3,=V(ZZZ@206)
         LTR   2,2
         BNH   L51
         MVC   0(4,7),256(3)
         L     2,12(11)
         MVC   0(4,2),260(3)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),68(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@947)
         BALR  14,15
         ST    15,0(9)
         B     L52
L51      EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),68(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@947)
         BALR  14,15
         ST    15,0(7)
         L     5,12(11)
         MVC   0(4,5),252(3)
         MVC   0(4,9),256(3)
L52      EQU   *
         L     2,=V(WORD@MOD)
         MVC   0(4,8),0(2)
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L88
         ST    2,88(13)
         MVC   92(4,13),=A(LC0)
         MVC   96(4,13),68(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     L88
L50      EQU   *
         L     3,56(4)
         LTR   3,3
         BNE   L54
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L69
         ST    2,88(13)
         MVC   92(4,13),=A(LC1)
         B     L91
L54      EQU   *
         L     3,36(4)
         LTR   3,3
         BNE   L57
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L69
         ST    2,88(13)
         MVC   92(4,13),=A(LC2)
         B     L91
L57      EQU   *
         L     3,60(4)
         LTR   3,3
         BNE   L60
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L69
         ST    2,88(13)
         MVC   92(4,13),=A(LC3)
         B     L91
L60      EQU   *
         LH    2,0(3)
         CLM   2,3,=H'67'
         BE    L63
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L67
         ST    2,88(13)
         MVC   92(4,13),=A(LC4)
         B     L90
L63      EQU   *
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BNL   L56
         L     2,60(4)
         L     2,4(2)
         LCR   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BNL   L56
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L67
         ST    2,88(13)
         MVC   92(4,13),=A(LC5)
L90      EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L67      EQU   *
         LR    15,5
         B     L49
L56      EQU   *
         L     3,44(4)
         LTR   3,3
         BNE   L68
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L69
         ST    2,88(13)
         MVC   92(4,13),=A(LC6)
L91      EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L69      EQU   *
         LR    15,3
         B     L49
L68      EQU   *
         LH    2,0(3)
         CLM   2,3,=H'74'
         BNE   L72
         L     3,4(3)
         B     L89
L72      EQU   *
         CLM   2,3,=H'88'
         BNE   L73
         L     2,4(3)
         L     3,4(2)
L89      EQU   *
         L     2,=V(ZZZ@1563)
         CL    3,0(2)
         BNL   L71
L73      EQU   *
         ST    6,88(13)
         MVC   92(4,13),44(4)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BNE   L70
L71      EQU   *
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L83
         ST    2,88(13)
         MVC   92(4,13),=A(LC7)
         B     L92
L70      EQU   *
         L     3,=V(MODE@CLA)
         L     2,44(4)
         SLR   5,5
         IC    5,2(2)
         IC    2,0(3,5)
         CLM   2,1,=XL1'04'
         BE    L76
         L     2,36(4)
         SLR   5,5
         IC    5,2(2)
         IC    2,0(3,5)
         CLM   2,1,=XL1'04'
         BNE   L75
L76      EQU   *
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L83
         ST    2,88(13)
         MVC   92(4,13),=A(LC8)
         B     L92
L75      EQU   *
         L     2,56(4)
         L     2,4(2)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     2,16(2)
         L     15,=V(MAX@UID@)
         L     3,0(2)
         SLR   5,5
         C     3,0(15)
         BNL   L80
         L     2,=V(UID@LUID)
         L     2,0(2)
         SLL   3,2
         L     5,0(3,2)
L80      EQU   *
         L     2,104(13)
         L     3,4(2)
         C     3,0(15)
         BNL   L81
         L     2,=V(UID@LUID)
         L     2,0(2)
         SLL   3,2
         C     5,0(3,2)
         BH    L82
         B     L78
L81      EQU   *
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'1494'
         MVC   96(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L82      EQU   *
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L83
         ST    2,88(13)
         MVC   92(4,13),=A(LC11)
L92      EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L83      EQU   *
         SLR   15,15
         B     L49
L78      EQU   *
         MVC   0(4,7),36(4)
         L     3,12(11)
         MVC   0(4,3),60(4)
         MVC   0(4,9),44(4)
         L     2,0(9)
         SLR   5,5
         IC    5,2(2)
         ST    5,0(8)
         L     3,0(7)
         LTR   5,5
         BNE   L84
         SLR   2,2
         IC    2,2(3)
         ST    2,0(8)
         LTR   2,2
         BNE   L86
         L     2,=V(WORD@MOD)
         MVC   0(4,8),0(2)
         B     L86
L84      EQU   *
         SLR   15,15
         IC    15,2(3)
         CLR   5,15
         BE    L86
         L     3,=V(MODE@SIZ)
         IC    2,0(3,5)
         IC    3,0(3,15)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BNL   L86
         ST    15,0(8)
L86      EQU   *
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L88
         ST    2,88(13)
         MVC   92(4,13),=A(LC12)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L88      EQU   *
         LA    15,1(0,0)
L49      EQU   *
* Function precondition_loop_p epilogue
         PDPEPIL
* Function precondition_loop_p literal pool
         DS    0F
         LTORG
* Function precondition_loop_p page table
         DS    0F
PGT3     EQU   *
         DC    A(PG3)
         DS    0F
* Function calculate_giv_inc,F3 prologue
@@F3     PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=NO
         B     FEN4
         LTORG
FEN4     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG4      EQU   *
         LR    11,1
         L     10,=A(PGT4)
* Function calculate_giv_inc code
         L     6,0(11)
         L     9,8(11)
         SLR   7,7
         LR    8,7
L94      EQU   *
         L     2,8(6)
         LH    2,0(2)
         CLM   2,3,=H'88'
         BE    L95
         L     2,4(11)
         L     4,8(2)
         ST    4,4(11)
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         SLR   6,6
         CLM   2,1,=XL1'89'
         BNE   L97
         L     2,24(4)
         LH    3,0(2)
         LR    6,2
         CLM   3,3,=H'60'
         BE    L97
         ST    4,88(13)
         MVC   92(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    6,15
L97      EQU   *
         L     2,8(6)
         LH    2,0(2)
         CLM   2,3,=H'88'
         BE    L100
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'1583'
         B     L128
L100     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L95      EQU   *
         L     2,8(6)
         L     3,8(2)
         LH    2,0(3)
         CLM   2,3,=H'67'
         BE    L101
         ST    3,88(13)
         LR    2,11
         A     2,=F'4'
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FIND@LAS)
         BALR  14,15
         LR    3,15
         LH    2,0(15)
         CLM   2,3,=H'152'
         BNE   L102
         L     3,8(15)
         B     L103
L102     EQU   *
         CLM   2,3,=H'79'
         BNE   L104
         MVC   88(4,13),4(11)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@701)
         BALR  14,15
         LTR   15,15
         BE    L103
         L     3,4(15)
         B     L103
L104     EQU   *
         CLM   2,3,=H'97'
         BE    L108
         CLM   2,3,=H'88'
         BE    L108
         CLM   2,3,=H'100'
         BE    L108
         CLM   2,3,=H'103'
         BNE   L103
L108     EQU   *
         L     4,8(3)
         LH    5,0(3)
         N     5,=XL4'0000FFFF'
         MVC   88(4,13),4(3)
         LR    2,11
         A     2,=F'4'
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FIND@LAS)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         LH    2,0(4)
         CLM   2,3,=H'67'
         BNE   L110
         LH    2,0(3)
         CLM   2,3,=H'67'
         BE    L109
L110     EQU   *
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'1631'
         B     L128
L109     EQU   *
         LA    2,97(0,0)
         CLR   5,2
         BNE   L111
         MVC   88(4,13),=F'0'
         L     3,4(3)
         O     3,4(4)
         B     L127
L111     EQU   *
         LA    2,88(0,0)
         CLR   5,2
         BNE   L113
         MVC   88(4,13),=F'0'
         L     3,4(3)
         A     3,4(4)
         B     L127
L113     EQU   *
         LA    2,100(0,0)
         CLR   5,2
         BNE   L115
         MVC   88(4,13),=F'0'
         L     3,4(3)
         L     4,4(4)
         SLL   3,0(4)
         B     L127
L115     EQU   *
         MVC   88(4,13),=F'0'
         L     3,4(3)
         L     4,4(4)
         SRL   3,0(4)
L127     EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@947)
         BALR  14,15
         LR    3,15
L103     EQU   *
         LH    2,0(3)
         CLM   2,3,=H'67'
         BE    L117
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'1644'
         B     L128
L117     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L101     EQU   *
         LTR   7,7
         BE    L118
         MVC   88(4,13),=F'0'
         L     7,4(7)
         A     7,4(3)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@947)
         BALR  14,15
         LR    7,15
         B     L119
L118     EQU   *
         LR    7,3
L119     EQU   *
         L     2,8(6)
         L     15,4(2)
         LH    2,0(15)
         CLM   2,3,=H'74'
         BNE   L121
         L     2,4(15)
         CLR   2,9
         BE    L120
L121     EQU   *
         LTR   8,8
         BNE   L122
         LA    8,1(0,0)
         L     2,4(11)
         MVC   4(4,11),8(2)
         L     4,4(11)
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         SLR   6,6
         CLM   2,1,=XL1'89'
         BNE   L124
         L     2,24(4)
         LH    3,0(2)
         LR    6,2
         CLM   3,3,=H'60'
         BE    L124
         ST    4,88(13)
         MVC   92(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    6,15
L124     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         B     L94
L122     EQU   *
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'1677'
L128     EQU   *
         MVC   96(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L120     EQU   *
         LR    15,7
* Function calculate_giv_inc epilogue
         PDPEPIL
* Function calculate_giv_inc literal pool
         DS    0F
         LTORG
* Function calculate_giv_inc page table
         DS    0F
PGT4     EQU   *
         DC    A(PG4)
         DS    0F
* Function initial_reg_note_copy,F4 prologue
@@F4     PDPPRLG CINDEX=5,FRAME=104,BASER=12,ENTRY=NO
         B     FEN5
         LTORG
FEN5     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG5      EQU   *
         LR    11,1
         L     10,=A(PGT5)
* Function initial_reg_note_copy code
         L     3,0(11)
         L     4,4(11)
         LR    15,3
         LTR   3,3
         BE    L129
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(RTX@ALLO)
         BALR  14,15
         LR    2,15
         MVC   2(1,15),2(3)
         LH    15,0(3)
         CLM   15,3,=H'3'
         BNE   L131
         MVC   88(4,13),4(3)
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@223)
         BALR  14,15
         B     L136
L131     EQU   *
         CLM   15,3,=H'4'
         BNE   L133
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@222)
         BALR  14,15
         B     L136
L133     EQU   *
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'1704'
         MVC   96(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L136     EQU   *
         ST    15,4(2)
         MVC   88(4,13),8(3)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         ST    15,8(2)
         LR    15,2
L129     EQU   *
* Function initial_reg_note_copy epilogue
         PDPEPIL
* Function initial_reg_note_copy literal pool
         DS    0F
         LTORG
* Function initial_reg_note_copy page table
         DS    0F
PGT5     EQU   *
         DC    A(PG5)
         DS    0F
* X-func emit_unrolled_add prologue
EMIT@UNR PDPPRLG CINDEX=6,FRAME=120,BASER=12,ENTRY=YES
         B     FEN6
         LTORG
FEN6     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG6      EQU   *
         LR    11,1
         L     10,=A(PGT6)
* Function emit_unrolled_add code
         L     2,0(11)
         SLR   3,3
         IC    3,2(2)
         ST    3,88(13)
         MVC   92(4,13),=F'88'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         ST    2,104(13)
         MVC   108(4,13),=F'0'
         MVC   112(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@658)
         BALR  14,15
         CLR   2,15
         BE    L137
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@567)
         BALR  14,15
L137     EQU   *
* Function emit_unrolled_add epilogue
         PDPEPIL
* Function emit_unrolled_add literal pool
         DS    0F
         LTORG
* Function emit_unrolled_add page table
         DS    0F
PGT6     EQU   *
         DC    A(PG6)
         DS    0F
* Function copy_loop_body,F6 prologue
@@F6     PDPPRLG CINDEX=7,FRAME=152,BASER=12,ENTRY=NO
         B     FEN7
         LTORG
FEN7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG7      EQU   *
         LR    11,1
         L     10,=A(PGT7)
* Function copy_loop_body code
         SLR   2,2
         SLR   3,3
         ST    2,136(13)
         ST    3,4+136(13)
         ST    2,144(13)
         ST    3,4+144(13)
         L     3,0(11)
         L     4,180(3)
         A     4,=F'140'
         ST    4,104(13)
         SLR   7,7
         ST    7,116(13)
         ST    7,120(13)
         L     5,20(11)
         LTR   5,5
         BNE   L140
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,120(13)
         L     2,12(11)
         L     3,20(2)
         L     4,28(11)
         L     2,28(4)
         SLL   2,2
         ST    15,0(2,3)
         B     L141
L140     EQU   *
         L     5,12(11)
         L     3,20(5)
         L     4,28(11)
         L     2,28(4)
         SLL   2,2
         ST    4,0(2,3)
L141     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         L     6,4(11)
L142     EQU   *
         L     12,0(,10)
         L     6,12(6)
         L     5,12(11)
         MVC   48(4,5),=F'0'
         L     4,0(6)
         LR    3,4
         SRL   3,16
         A     3,=F'-45'
         LA    2,5(0,0)
         CLR   3,2
         L     14,=A(L230)
         BHR   14
         SLL   3,2
         L     2,=A(L231)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
L231     EQU   *
         DC    A(L146)
         DC    A(L187)
         DC    A(L217)
         DC    A(L225)
         DC    A(L223)
         DC    A(L226)
L146     EQU   *
         MVC   108(4,13),24(6)
         MVC   124(4,13),=F'0'
         L     8,=V(RTX@CLAS)
         SRL   4,16
         IC    2,0(8,4)
         CLM   2,1,=XL1'89'
         BNE   L147
         L     3,108(13)
         LH    2,0(3)
         LR    9,3
         CLM   2,3,=H'60'
         BE    L149
         ST    6,88(13)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    9,15
L149     EQU   *
         LTR   9,9
         BE    L147
         L     3,4(9)
         LH    2,0(3)
         CLM   2,3,=H'74'
         BNE   L147
         L     4,4(3)
         L     2,=A(@@V2)
         L     3,0(2)
         LR    2,4
         SLL   2,2
         L     7,0(2,3)
         LTR   7,7
         BE    L147
         L     2,8(7)
         L     5,104(13)
         L     3,0(5)
         L     2,4(2)
         SLL   2,3
         L     2,4(2,3)
         ST    9,88(13)
         ST    6,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         ST    15,124(13)
         L     4,16(2)
L257     EQU   *
         LTR   4,4
         BE    L147
         L     2,12(4)
         LTR   2,2
         BNE   L154
         L     2,72(4)
         CLR   2,7
         BNE   L154
         L     2,20(4)
         L     9,0(2)
         CL    9,16(4)
         BNE   L154
         L     2,124(13)
         L     3,4(2)
         L     5,32(4)
         L     15,32(7)
         CLR   5,15
         BE    L157
         ST    3,136(13)
         L     2,136(13)
         L     3,4+136(13)
         SRDA  2,32
         ST    2,136(13)
         ST    3,4+136(13)
         D     2,4(15)
         ST    2,136(13)
         ST    3,4+136(13)
         L     5,4(5)
         ST    5,148(13)
         L     2,144(13)
         L     3,4+144(13)
         L     5,140(13)
         MR    2,5
         ST    2,144(13)
         ST    3,4+144(13)
         L     3,148(13)
L157     EQU   *
         ST    9,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
         ST    15,16(4)
         L     2,20(4)
         ST    15,0(2)
         L     2,20(11)
         LTR   2,2
         BE    L154
         L     3,24(11)
         LTR   3,3
         BE    L154
         L     3,16(4)
         LH    2,0(3)
         LR    5,3
         CLM   2,3,=H'74'
         BE    L160
         L     5,4(3)
L160     EQU   *
         L     2,80(4)
         LTR   2,2
         BNE   L161
         L     2,52(4)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   L161
         MVC   88(4,13),16(4)
         MVC   92(4,13),76(4)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'88'
         BNE   L161
         ST    5,88(13)
         MVC   92(4,13),4(15)
         MVC   96(4,13),8(15)
         LA    1,88(,13)
         L     15,=A(EMIT@UNR)
         BALR  14,15
L161     EQU   *
         ST    5,88(13)
         L     5,76(4)
         LCR   5,5
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
         ST    15,16(4)
         L     2,20(4)
         ST    15,0(2)
L154     EQU   *
         L     4,68(4)
         B     L257
L147     EQU   *
         MVC   112(4,13),=F'0'
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         IC    2,0(8,2)
         SLR   9,9
         CLM   2,1,=XL1'89'
         BNE   L164
         L     2,24(6)
         LH    3,0(2)
         LR    9,2
         CLM   3,3,=H'60'
         BE    L166
         ST    6,88(13)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    9,15
L166     EQU   *
         LTR   9,9
         BE    L164
         L     3,4(9)
         LH    2,0(3)
         CLM   2,3,=H'74'
         BNE   L164
         L     7,4(3)
         L     4,=A(@@V3)
         L     2,0(4)
         LR    8,7
         SLL   8,2
         L     2,0(8,2)
         LTR   2,2
         BE    L164
         MVC   112(4,13),=F'1'
         LR    4,3
         ST    3,128(13)
         L     5,124(13)
         LTR   5,5
         BNE   L169
         ST    9,88(13)
         ST    6,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@F3)
         BALR  14,15
         ST    15,124(13)
L169     EQU   *
         L     15,4(4)
         L     2,24(11)
         LTR   2,2
         BNE   L170
         L     3,=A(@@V3)
         L     2,0(3)
         SLL   15,2
         L     2,0(15,2)
         ST    2,88(13)
         L     4,124(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
         L     2,0(3)
         ST    15,0(8,2)
         LH    2,0(15)
         CLM   2,3,=H'88'
         BNE   L171
         L     4,4(15)
         MVC   124(4,13),8(15)
         B     L173
L171     EQU   *
         LR    4,15
         L     2,=V(ZZZ@206)
         MVC   124(4,13),256(2)
         B     L173
L170     EQU   *
         L     5,104(13)
         CL    7,4(5)
         BNL   L174
         L     5,0(5)
         LR    3,7
         SLL   3,3
         L     2,0(3,5)
         LA    7,1(0,0)
         CLR   2,7
         BNE   L174
         L     2,4(3,5)
         L     2,8(2)
         L     4,8(2)
         ST    4,128(13)
L174     EQU   *
         MVC   88(4,13),=F'88'
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         MVC   96(4,13),124(13)
         L     3,=A(@@V3)
         L     2,0(3)
         SLL   15,2
         L     2,0(15,2)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1908)
         BALR  14,15
         L     2,0(3)
         ST    15,0(8,2)
         ST    15,124(13)
         L     5,20(11)
         LTR   5,5
         BE    L176
         L     2,=A(@@V4)
         L     2,0(2)
         L     3,0(8,2)
         LR    7,3
         BCTR  7,0
         ST    7,0(8,2)
         LA    2,1(0,0)
         CLR   3,2
         BE    L175
L176     EQU   *
         SLR   3,3
         IC    3,2(4)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    3,15
         ST    15,128(13)
         L     5,12(11)
         L     2,16(5)
         ST    15,0(8,2)
         LR    15,4
         L     2,=V(ZZZ@206)
         L     7,124(13)
         CL    7,256(2)
         BE    L178
         MVC   88(4,13),=F'88'
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         ST    4,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
L178     EQU   *
         MVC   88(4,13),4(3)
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@1759)
         BALR  14,15
         B     L173
L175     EQU   *
         L     3,12(11)
         L     2,16(3)
         ST    4,0(8,2)
L173     EQU   *
         MVC   88(4,13),128(13)
         ST    4,92(13)
         MVC   96(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(EMIT@UNR)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1034)
         BALR  14,15
         B     L258
L164     EQU   *
         MVC   88(4,13),108(13)
         MVC   92(4,13),12(11)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@223)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@545)
         BALR  14,15
L258     EQU   *
         LR    7,15
         MVC   88(4,13),36(6)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         ST    15,36(7)
         MVC   20(4,7),20(6)
         ST    7,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@701)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L181
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(15)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BNE   L181
         ST    7,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1817)
         BALR  14,15
L181     EQU   *
         MVC   88(4,13),24(7)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    L182
         ST    7,116(13)
         B     L183
L182     EQU   *
         L     4,116(13)
         LTR   4,4
         BE    L184
         ST    4,88(13)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(TRY@CONS)
         BALR  14,15
L184     EQU   *
         ST    2,116(13)
         ST    7,88(13)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(TRY@CONS)
         BALR  14,15
L183     EQU   *
         L     5,112(13)
         LTR   5,5
         L     14,=A(L145)
         BER   14
         L     2,4(9)
         L     2,4(2)
         L     4,12(11)
         L     3,36(4)
         CL    2,0(3)
         L     14,=A(L145)
         BNLR  14
         LR    15,2
         SLL   15,3
         AR    15,3
         A     15,=F'20'
         L     2,0(15)
         CL    2,40(4)
         L     14,=A(L145)
         BNER  14
         MVC   0(4,15),=F'-1'
         L     14,=A(L145)
         BR    14
L187     EQU   *
         MVC   88(4,13),24(6)
         MVC   92(4,13),12(11)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@223)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@554)
         BALR  14,15
         LR    7,15
         MVC   88(4,13),36(6)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         ST    15,36(7)
         MVC   20(4,7),20(6)
         L     2,40(6)
         LTR   2,2
         BE    L188
         MVC   88(4,13),12(11)
         L     2,40(6)
         MVC   92(4,13),28(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1033)
         BALR  14,15
         ST    15,40(7)
         L     5,20(15)
         A     5,=F'1'
         ST    5,20(15)
L188     EQU   *
         L     2,40(6)
         CL    2,28(11)
         BNE   L189
         CL    6,8(11)
         BNE   L189
         L     2,20(11)
         LTR   2,2
         BNE   L189
         ST    7,88(13)
         MVC   92(4,13),16(11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1487)
         BALR  14,15
         LTR   15,15
         BNE   L189
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),16(11)
         LA    1,88(,13)
         L     15,=V(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@555)
         BALR  14,15
         MVC   40(4,15),16(11)
         L     3,16(11)
         L     4,20(3)
         A     4,=F'1'
         ST    4,20(3)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@531)
         BALR  14,15
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@562)
         BALR  14,15
         MVC   20(4,2),20(11)
         ST    7,88(13)
         ST    2,92(13)
         MVC   96(4,13),20(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@1767)
         BALR  14,15
         LTR   15,15
         BNE   L189
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'2099'
         L     14,=A(L264)
         BR    14
L189     EQU   *
         L     5,116(13)
         LTR   5,5
         BE    L192
         ST    5,88(13)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(TRY@CONS)
         BALR  14,15
L192     EQU   *
         MVC   116(4,13),=F'0'
         ST    7,88(13)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(TRY@CONS)
         BALR  14,15
         L     2,40(6)
         LTR   2,2
         BE    L193
         LH    2,0(7)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L204
         L     2,24(7)
         LH    3,0(2)
         LR    9,2
         CLM   3,3,=H'60'
         BE    L196
         ST    7,88(13)
         MVC   92(4,13),24(7)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    9,15
L196     EQU   *
         LTR   9,9
         BE    L204
         L     3,8(9)
         LH    2,0(3)
         CLM   2,3,=H'80'
         BNE   L199
         L     15,4(3)
         B     L194
L199     EQU   *
         CLM   2,3,=H'85'
         BNE   L204
         L     15,8(3)
         L     2,=V(ZZZ@1074)
         CL    15,0(2)
         BE    L202
         L     15,4(15)
         B     L194
L202     EQU   *
         L     2,12(3)
         L     15,4(2)
L194     EQU   *
         LTR   15,15
         BE    L204
         LH    2,0(15)
         CLM   2,3,=H'49'
         BE    L259
L204     EQU   *
         MVC   88(4,13),12(11)
         L     2,40(6)
         MVC   92(4,13),28(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1033)
         BALR  14,15
L259     EQU   *
         ST    15,40(7)
         L     2,40(7)
         L     3,20(2)
         A     3,=F'1'
         ST    3,20(2)
         B     L206
L193     EQU   *
         L     8,24(7)
         LH    3,0(8)
         LR    2,3
         AH    2,=H'-57'
         CLM   2,3,=H'1'
         BH    L206
         X     3,=F'58'
         SLL   3,16
         SRA   3,16
         LPR   2,3
         BCTR  2,0
         N     2,=XL4'0000FFFF'
         SRL   2,15
         LR    4,2
         SLL   4,16
         SRA   4,16
         SLL   4,2
         L     2,4(8,4)
         L     9,0(2)
         L     5,116(13)
L260     EQU   *
         CR    5,9
         BNL   L206
         L     3,4(8,4)
         LR    2,5
         SLL   2,2
         L     2,4(2,3)
         L     2,4(2)
         L     3,20(2)
         A     3,=F'1'
         ST    3,20(2)
         A     5,=F'1'
         B     L260
L206     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LTR   15,15
         L     14,=A(L145)
         BER   14
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ONLYJUMP)
         BALR  14,15
         LTR   15,15
         L     14,=A(L145)
         BER   14
         L     4,12(11)
         L     2,316(4)
         LTR   2,2
         L     14,=A(L145)
         BER   14
         MVC   88(4,13),8(7)
         LA    1,88(,13)
         L     15,=V(ONLY@SET)
         BALR  14,15
         LTR   15,15
         BE    L214
         MVC   88(4,13),8(7)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L214     EQU   *
         L     5,12(11)
         L     3,316(5)
         L     2,=V(ZZZ@1074)
         CL    3,0(2)
         BNE   L215
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@451)
         BALR  14,15
         L     14,=A(L227)
         BR    14
L215     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@530)
         BALR  14,15
         L     14,=A(L145)
         BR    14
L217     EQU   *
         MVC   88(4,13),24(6)
         MVC   92(4,13),12(11)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@223)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@533)
         BALR  14,15
         LR    7,15
         MVC   88(4,13),36(6)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@F4)
         BALR  14,15
         ST    15,36(7)
         MVC   20(4,7),20(6)
         L     2,0(6)
         N     2,=F'128'
         L     3,0(7)
         N     3,=F'-129'
         OR    3,2
         ST    3,0(7)
         L     2,0(6)
         N     2,=F'32'
         N     3,=F'-33'
         OR    3,2
         ST    3,0(7)
         MVC   88(4,13),40(6)
         MVC   92(4,13),12(11)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@223)
         BALR  14,15
         ST    15,40(7)
         L     2,116(13)
         LTR   2,2
         BE    L218
         ST    2,88(13)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(TRY@CONS)
         BALR  14,15
L218     EQU   *
         MVC   116(4,13),=F'0'
         ST    7,88(13)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(TRY@CONS)
         BALR  14,15
         L     3,116(13)
L222     EQU   *
         LR    2,3
         SLL   2,3
         L     4,12(11)
         A     2,36(4)
         MVC   16(4,2),=F'0'
         A     3,=F'1'
         LA    5,19(0,0)
         CR    3,5
         BNH   L222
         L     14,=A(L145)
         BR    14
L223     EQU   *
         CL    6,28(11)
         L     14,=A(L145)
         BER   14
         MVC   88(4,13),12(11)
         MVC   92(4,13),28(6)
         LA    1,88(,13)
         L     15,=V(ZZZ@1033)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
         LR    7,15
         L     2,12(11)
         L     3,40(2)
         A     3,=F'1'
         ST    3,40(2)
         B     L145
L225     EQU   *
         LA    1,88(,13)
         L     15,=V(ZZZ@530)
         BALR  14,15
         B     L261
L226     EQU   *
         L     2,24(6)
         L     4,=F'-99'
         CLR   2,4
         BE    L227
         L     5,=F'-88'
         CLR   2,5
         BE    L227
         L     7,=F'-83'
         CLR   2,7
         BE    L227
         A     2,=F'94'
         LA    3,1(0,0)
         CLR   2,3
         BH    L228
         L     4,20(11)
         LTR   4,4
         BE    L227
         L     5,24(11)
         LTR   5,5
         BE    L227
L228     EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@572)
         BALR  14,15
L261     EQU   *
         LR    7,15
         B     L145
L227     EQU   *
         SLR   7,7
         B     L145
L230     EQU   *
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'2247'
         L     14,=A(L264)
         BR    14
L145     EQU   *
         L     2,12(11)
         L     3,24(2)
         L     2,4(6)
         SLL   2,2
         ST    7,0(2,3)
         CL    6,8(11)
         BNE   L142
         L     6,4(11)
L232     EQU   *
         L     12,0(,10)
         L     6,12(6)
         LH    2,0(6)
         AH    2,=H'-45'
         CLM   2,3,=H'2'
         L     14,=A(L234)
         BHR   14
         L     4,12(11)
         L     3,24(4)
         L     2,4(6)
         SLL   2,2
         L     2,0(2,3)
         LTR   2,2
         L     14,=A(L234)
         BER   14
         LR    3,2
         A     3,=F'36'
L262     EQU   *
         L     12,0(,10)
         L     2,0(3)
         LTR   2,2
         L     14,=A(L234)
         BER   14
         L     4,0(3)
         LH    2,0(4)
         CLM   2,3,=H'4'
         L     14,=A(L238)
         BNER  14
         L     2,4(4)
         L     5,12(11)
         L     3,24(5)
         L     2,4(2)
         SLL   2,2
         L     2,0(2,3)
         LTR   2,2
         L     14,=A(L239)
         BNER  14
         CLI   2(4),12
         L     14,=A(L238)
         BER   14
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'1730'
L264     EQU   *
         MVC   96(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L239     EQU   *
         ST    2,4(4)
L238     EQU   *
         LR    3,4
         A     3,=F'8'
         B     L262
L234     EQU   *
         CL    6,8(11)
         BNE   L232
         L     7,20(11)
         LTR   7,7
         L     14,=A(L244)
         BNER  14
         L     6,40(11)
L263     EQU   *
         L     12,0(,10)
         CL    6,32(11)
         B     PGE7
         DS    0F
         LTORG
         DS    0F
PGE7     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG8      EQU   *
         BE    L244
         LH    2,0(6)
         CLM   2,3,=H'50'
         BNE   L247
         L     2,24(6)
         L     3,=F'-99'
         CLR   2,3
         BE    L247
         L     4,=F'-83'
         CLR   2,4
         BE    L247
         L     5,=F'-93'
         CLR   2,5
         BE    L247
         L     7,=F'-94'
         CLR   2,7
         BE    L247
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@572)
         BALR  14,15
L247     EQU   *
         L     12,4(,10)
         L     6,12(6)
         L     14,=A(L263)
         BR    14
L244     EQU   *
         L     12,4(,10)
         L     2,120(13)
         LTR   2,2
         BE    L250
         LR    3,2
         L     2,20(2)
         LTR   2,2
         BNH   L250
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@561)
         BALR  14,15
L250     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),36(11)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1545)
         BALR  14,15
* Function copy_loop_body epilogue
         PDPEPIL
* Function copy_loop_body literal pool
         DS    0F
         LTORG
* Function copy_loop_body page table
         DS    0F
PGT7     EQU   *
         DC    A(PG7)
         DC    A(PG8)
         DS    0F
* X-func back_branch_in_range_p prologue
BACK@BRA PDPPRLG CINDEX=9,FRAME=96,BASER=12,ENTRY=YES
         B     FEN9
         LTORG
FEN9     EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG9      EQU   *
         LR    11,1
         L     10,=A(PGT9)
* Function back_branch_in_range_p code
         L     2,0(11)
         L     4,4(11)
         L     6,196(2)
         L     15,200(2)
         LR    3,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'48'
         BNE   L266
         L     15,8(15)
L266     EQU   *
         L     2,0(4)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BE    L283
         L     4,12(4)
         B     L266
L283     EQU   *
         CLR   4,15
         BE    L285
         CLR   4,3
         BNE   L270
         B     L285
L287     EQU   *
         LA    15,1(0,0)
         B     L265
L270     EQU   *
         L     3,12(4)
L288     EQU   *
         CLR   3,15
         BE    L285
         LH    2,0(3)
         CLM   2,3,=H'46'
         BNE   L274
         L     5,40(3)
         LR    2,6
L289     EQU   *
         CLR   2,4
         BE    L274
         CLR   2,5
         BE    L287
         L     2,12(2)
         B     L289
L274     EQU   *
         L     3,12(3)
         B     L288
L285     EQU   *
         SLR   15,15
L265     EQU   *
* Function back_branch_in_range_p epilogue
         PDPEPIL
* Function back_branch_in_range_p literal pool
         DS    0F
         LTORG
* Function back_branch_in_range_p page table
         DS    0F
PGT9     EQU   *
         DC    A(PG9)
         DS    0F
* Function fold_rtx_mult_add,F7 prologue
@@F7     PDPPRLG CINDEX=10,FRAME=104,BASER=12,ENTRY=NO
         B     FEN10
         LTORG
FEN10    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG10     EQU   *
         LR    11,1
         L     10,=A(PGT10)
* Function fold_rtx_mult_add code
         L     4,0(11)
         L     6,4(11)
         L     5,8(11)
         L     7,12(11)
         SLR   2,2
         IC    2,2(4)
         CLR   2,7
         BE    L293
         IC    2,2(4)
         CLM   2,1,=XL1'00'
         BNE   L292
L293     EQU   *
         SLR   2,2
         IC    2,2(6)
         CLR   2,7
         BE    L294
         IC    2,2(6)
         CLM   2,1,=XL1'00'
         BNE   L292
L294     EQU   *
         SLR   2,2
         IC    2,2(5)
         CLR   2,7
         BE    L291
         IC    2,2(5)
         CLM   2,1,=XL1'00'
         BE    L291
L292     EQU   *
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'2384'
         MVC   96(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L291     EQU   *
         LH    2,0(4)
         CLM   2,3,=H'67'
         BNE   L295
         LR    2,6
         LR    6,4
         LR    4,2
L295     EQU   *
         MVC   88(4,13),=F'91'
         ST    7,92(13)
         ST    4,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1907)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   L296
         MVC   88(4,13),=F'91'
         ST    7,92(13)
         ST    4,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
         LR    3,15
L296     EQU   *
         LH    2,0(5)
         CLM   2,3,=H'67'
         BNE   L297
         LR    2,5
         LR    5,3
         LR    3,2
L297     EQU   *
         MVC   88(4,13),=F'88'
         ST    7,92(13)
         ST    5,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1907)
         BALR  14,15
         LTR   15,15
         BNE   L298
         MVC   88(4,13),=F'88'
         ST    7,92(13)
         ST    5,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
L298     EQU   *
* Function fold_rtx_mult_add epilogue
         PDPEPIL
* Function fold_rtx_mult_add literal pool
         DS    0F
         LTORG
* Function fold_rtx_mult_add page table
         DS    0F
PGT10    EQU   *
         DC    A(PG10)
         DS    0F
* X-func biv_total_increment prologue
BIV@TOTA PDPPRLG CINDEX=11,FRAME=104,BASER=12,ENTRY=YES
         B     FEN11
         LTORG
FEN11    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG11     EQU   *
         LR    11,1
         L     10,=A(PGT11)
* Function biv_total_increment code
         L     6,=V(ZZZ@206)
         L     15,256(6)
         L     2,0(11)
         L     4,8(2)
         LTR   4,4
         BE    L299
L306     EQU   *
         L     3,52(4)
         LR    2,3
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BE    L303
         L     5,32(4)
         CL    5,260(6)
         BNE   L303
         SRL   3,26
         N     3,=F'1'
         LTR   3,3
         BNE   L303
         L     2,24(4)
         L     3,=V(MODE@CLA)
         IC    3,0(3,2)
         LA    2,254(,3)
         CLM   2,1,=XL1'01'
         BH    L303
         L     2,72(4)
         LTR   2,2
         BNE   L302
         ST    15,88(13)
         ST    5,92(13)
         MVC   96(4,13),36(4)
         MVC   100(4,13),24(4)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         B     L302
L303     EQU   *
         SLR   15,15
         B     L299
L302     EQU   *
         L     4,68(4)
         LTR   4,4
         BNE   L306
L299     EQU   *
* Function biv_total_increment epilogue
         PDPEPIL
* Function biv_total_increment literal pool
         DS    0F
         LTORG
* Function biv_total_increment page table
         DS    0F
PGT11    EQU   *
         DC    A(PG11)
         DS    0F
* Function reg_dead_after_loop,F10 prologue
@@F10    PDPPRLG CINDEX=12,FRAME=104,BASER=12,ENTRY=NO
         B     FEN12
         LTORG
FEN12    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG12     EQU   *
         LR    11,1
         L     10,=A(PGT12)
* Function reg_dead_after_loop code
         L     3,0(11)
         L     8,4(11)
         SLR   7,7
         LR    2,7
         L     5,216(3)
L343     EQU   *
         LTR   5,5
         BE    L337
         A     2,=F'1'
         L     5,8(5)
         B     L343
L337     EQU   *
         SLR   15,15
         CL    2,220(3)
         BNE   L309
         B     L314
L342     EQU   *
         LR    15,2
         B     L309
L314     EQU   *
         MVC   88(4,13),=F'80'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),200(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@987)
         BALR  14,15
         LR    5,15
         MVC   8(4,15),216(3)
L344     EQU   *
         LTR   5,5
         BE    L339
         L     2,4(5)
         L     4,12(2)
L345     EQU   *
         LTR   4,4
         BE    L319
         LH    6,0(4)
         N     6,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,6)
         CLM   2,1,=XL1'89'
         BNE   L320
         ST    8,88(13)
         MVC   92(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@1795)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   L332
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@699)
         BALR  14,15
         LTR   15,15
         BE    L322
         ST    8,88(13)
         MVC   92(4,13),4(15)
         LA    1,88(,13)
         L     15,=V(ZZZ@1793)
         BALR  14,15
         LTR   15,15
         BNE   L342
L322     EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L320
         L     2,24(4)
         LH    3,0(2)
         CLM   3,3,=H'60'
         BE    L324
         ST    4,88(13)
         MVC   92(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
L324     EQU   *
         LTR   2,2
         BE    L320
         MVC   88(4,13),4(2)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1849)
         BALR  14,15
         LTR   15,15
         BNE   L319
L320     EQU   *
         LA    2,46(0,0)
         CLR   6,2
         BNE   L328
         L     2,24(4)
         LH    2,0(2)
         CLM   2,3,=H'64'
         BE    L319
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@UNCO)
         BALR  14,15
         LTR   15,15
         BE    L332
         LR    2,7
         A     7,=F'1'
         LA    3,20(0,0)
         CR    2,3
         BNH   L331
L332     EQU   *
         SLR   15,15
         B     L309
L331     EQU   *
         L     4,40(4)
L328     EQU   *
         L     4,12(4)
         B     L345
L319     EQU   *
         L     5,8(5)
         B     L344
L339     EQU   *
         LA    15,1(0,0)
L309     EQU   *
* Function reg_dead_after_loop epilogue
         PDPEPIL
* Function reg_dead_after_loop literal pool
         DS    0F
         LTORG
* Function reg_dead_after_loop page table
         DS    0F
PGT12    EQU   *
         DC    A(PG12)
LC13     EQU   *
         DC    C'Final biv value for %d, reversed biv.'
         DC    X'15'
         DC    X'0'
LC14     EQU   *
         DC    C'Final biv value for %d, calculated.'
         DC    X'15'
         DC    X'0'
LC15     EQU   *
         DC    C'Final biv value for %d, biv dead after loop exit'
         DC    C'.'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func final_biv_value prologue
FINAL@BI PDPPRLG CINDEX=13,FRAME=112,BASER=12,ENTRY=YES
         B     FEN13
         LTORG
FEN13    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG13     EQU   *
         LR    11,1
         L     10,=A(PGT13)
* Function final_biv_value code
         L     7,0(11)
         L     6,4(11)
         L     2,180(7)
         L     8,68(2)
         L     2,8(6)
         L     3,24(2)
         L     2,=V(MODE@CLA)
         IC    2,0(2,3)
         SLR   15,15
         CLM   2,1,=XL1'02'
         BNE   L346
         L     2,48(6)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BE    L348
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L354
         ST    2,88(13)
         MVC   92(4,13),=A(LC13)
         B     L355
L348     EQU   *
         LTR   8,8
         BE    L350
         L     5,220(7)
         LTR   5,5
         BNE   L350
         ST    7,88(13)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BE    L350
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(BIV@TOTA)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L350
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BE    L350
         L     2,8(6)
         MVC   88(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),4(15)
         L     2,8(6)
         MVC   92(4,13),36(2)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1759)
         BALR  14,15
         ST    5,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@947)
         BALR  14,15
         ST    7,88(13)
         ST    3,92(13)
         ST    15,96(13)
         MVC   100(4,13),24(6)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1551)
         BALR  14,15
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L352
         ST    2,88(13)
         MVC   92(4,13),=A(LC14)
         MVC   96(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L352     EQU   *
         LR    15,4
         B     L346
L350     EQU   *
         ST    7,88(13)
         L     2,8(6)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         LTR   15,15
         BE    L346
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L354
         ST    2,88(13)
         MVC   92(4,13),=A(LC15)
L355     EQU   *
         MVC   96(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L354     EQU   *
         L     2,=V(ZZZ@206)
         L     15,256(2)
L346     EQU   *
* Function final_biv_value epilogue
         PDPEPIL
* Function final_biv_value literal pool
         DS    0F
         LTORG
* Function final_biv_value page table
         DS    0F
PGT13    EQU   *
         DC    A(PG13)
LC16     EQU   *
         DC    C'Final giv value for %d, depends on reversed biv'
         DC    X'15'
         DC    X'0'
LC17     EQU   *
         DC    C'Final giv value for %d, calc from biv''s value.'
         DC    X'15'
         DC    X'0'
LC18     EQU   *
         DC    C'Final giv value for %d, giv dead after loop exit'
         DC    C'.'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func final_giv_value prologue
FINAL@GI PDPPRLG CINDEX=14,FRAME=128,BASER=12,ENTRY=YES
         B     FEN14
         LTORG
FEN14    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG14     EQU   *
         LR    11,1
         L     10,=A(PGT14)
* Function final_giv_value code
         L     8,0(11)
         L     7,4(11)
         L     3,180(8)
         MVC   120(4,13),200(8)
         L     9,68(3)
         L     2,8(7)
         L     3,140(3)
         L     2,4(2)
         SLL   2,3
         L     6,4(2,3)
         L     2,48(6)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BE    L357
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L373
         ST    2,88(13)
         MVC   92(4,13),=A(LC16)
         B     L380
L357     EQU   *
         LTR   9,9
         BE    L359
         L     5,220(8)
         LTR   5,5
         BNE   L359
         L     2,52(7)
         SRL   2,27
         N     2,=F'1'
         LTR   2,2
         BE    L359
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(BIV@TOTA)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    L359
         ST    8,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BE    L359
         ST    8,88(13)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BE    L359
         MVC   88(4,13),24(7)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),4(15)
         L     2,8(6)
         MVC   92(4,13),36(2)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1759)
         BALR  14,15
         ST    7,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(EXTEND@V)
         BALR  14,15
         LR    3,15
         ST    5,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@947)
         BALR  14,15
         LR    2,15
         ST    7,88(13)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(EXTEND@V)
         BALR  14,15
         ST    8,88(13)
         ST    3,92(13)
         ST    2,96(13)
         ST    15,100(13)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1551)
         BALR  14,15
         L     2,0(7)
         L     5,12(2)
L378     EQU   *
         CL    5,120(13)
         BE    L375
         L     3,8(6)
L379     EQU   *
         LTR   3,3
         BE    L377
         L     2,0(3)
         CLR   2,5
         BNE   L366
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         SLR   2,2
         IC    2,2(4)
         ST    2,88(13)
         MVC   92(4,13),=F'89'
         ST    4,96(13)
         MVC   100(4,13),36(3)
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         MVC   112(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(ZZZ@658)
         BALR  14,15
         LR    4,15
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    8,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1548)
         BALR  14,15
L366     EQU   *
         L     3,68(3)
         B     L379
L377     EQU   *
         L     5,12(5)
         B     L378
L375     EQU   *
         ST    8,88(13)
         ST    4,92(13)
         MVC   96(4,13),32(7)
         MVC   100(4,13),36(7)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1551)
         BALR  14,15
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L370
         ST    2,88(13)
         MVC   92(4,13),=A(LC17)
         L     2,16(7)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L370     EQU   *
         LR    15,4
         B     L356
L359     EQU   *
         L     2,52(7)
         SRL   2,31
         LTR   2,2
         BE    L371
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'3124'
         MVC   96(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L371     EQU   *
         ST    8,88(13)
         MVC   92(4,13),16(7)
         LA    1,88(,13)
         L     15,=A(@@F10)
         BALR  14,15
         LTR   15,15
         BE    L356
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L373
         ST    2,88(13)
         MVC   92(4,13),=A(LC18)
L380     EQU   *
         L     2,16(7)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L373     EQU   *
         L     2,=V(ZZZ@206)
         L     15,256(2)
L356     EQU   *
* Function final_giv_value epilogue
         PDPEPIL
* Function final_giv_value literal pool
         DS    0F
         LTORG
* Function final_giv_value page table
         DS    0F
PGT14    EQU   *
         DC    A(PG14)
         DS    0F
* Function loop_find_equiv_value,F11 prologue
@@F11    PDPPRLG CINDEX=15,FRAME=104,BASER=12,ENTRY=NO
         B     FEN15
         LTORG
FEN15    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG15     EQU   *
         LR    11,1
         L     10,=A(PGT15)
* Function loop_find_equiv_value code
         L     7,4(11)
         L     2,0(11)
         L     8,196(2)
         LR    6,7
         L     4,8(8)
L399     EQU   *
         LTR   4,4
         BE    L383
         LH    2,0(4)
         CLM   2,3,=H'49'
         BE    L383
         L     3,=V(RTX@CLAS)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L384
         ST    7,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1800)
         BALR  14,15
         LTR   15,15
         BE    L384
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L383
         L     2,24(4)
         LH    3,0(2)
         LR    5,2
         CLM   3,3,=H'60'
         BE    L390
         ST    4,88(13)
         MVC   92(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    5,15
L390     EQU   *
         LTR   5,5
         BE    L383
         L     2,4(5)
         CLR   2,7
         BNE   L383
         ST    4,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@701)
         BALR  14,15
         LTR   15,15
         BE    L393
         L     15,4(15)
         LH    3,0(15)
         CLM   3,3,=H'3'
         BE    L393
         LR    2,3
         AH    2,=H'-80'
         CLM   2,3,=H'1'
         BNH   L394
         CLM   3,3,=H'67'
         BE    L394
         CLM   3,3,=H'68'
         BE    L394
         CLM   3,3,=H'71'
         BE    L394
         CLM   3,3,=H'151'
         BE    L394
         CLM   3,3,=H'69'
         BE    L394
         CLM   3,3,=H'157'
         BNE   L393
L394     EQU   *
         LR    6,15
         B     L395
L393     EQU   *
         L     6,8(5)
L395     EQU   *
         ST    6,88(13)
         ST    4,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1577)
         BALR  14,15
         LTR   15,15
         BE    L383
         LR    6,7
         B     L383
L384     EQU   *
         L     4,8(4)
         B     L399
L383     EQU   *
         LR    15,6
* Function loop_find_equiv_value epilogue
         PDPEPIL
* Function loop_find_equiv_value literal pool
         DS    0F
         LTORG
* Function loop_find_equiv_value page table
         DS    0F
PGT15    EQU   *
         DC    A(PG15)
         DS    0F
* Function subtract_reg_term,F12 prologue
@@F12    PDPPRLG CINDEX=16,FRAME=104,BASER=12,ENTRY=NO
         B     FEN16
         LTORG
FEN16    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG16     EQU   *
         LR    11,1
         L     10,=A(PGT16)
* Function subtract_reg_term code
         L     15,0(11)
         L     4,4(11)
         CLR   15,4
         BNE   L401
         L     2,=V(ZZZ@206)
         L     15,256(2)
         B     L400
L401     EQU   *
         LH    2,0(15)
         CLM   2,3,=H'88'
         BNE   L402
         L     2,4(15)
         L     3,8(15)
         LR    15,3
         CLR   2,4
         BE    L400
         LR    15,2
         CLR   3,4
         BE    L400
L402     EQU   *
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'3210'
         MVC   96(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L400     EQU   *
* Function subtract_reg_term epilogue
         PDPEPIL
* Function subtract_reg_term literal pool
         DS    0F
         LTORG
* Function subtract_reg_term page table
         DS    0F
PGT16    EQU   *
         DC    A(PG16)
         DS    0F
* Function find_common_reg_term,F13 prologue
@@F13    PDPPRLG CINDEX=17,FRAME=88,BASER=12,ENTRY=NO
         B     FEN17
         LTORG
FEN17    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG17     EQU   *
         LR    11,1
         L     10,=A(PGT17)
* Function find_common_reg_term code
         L     4,0(11)
         L     6,4(11)
         LH    2,0(4)
         CLM   2,3,=H'74'
         BE    L408
         CLM   2,3,=H'88'
         BNE   L407
L408     EQU   *
         LH    3,0(6)
         CLM   3,3,=H'74'
         BE    L409
         CLM   3,3,=H'88'
         BNE   L407
L409     EQU   *
         CLM   2,3,=H'88'
         BNE   L410
         L     5,8(4)
         L     15,4(4)
         B     L411
L410     EQU   *
         L     2,=V(ZZZ@206)
         L     5,256(2)
         LR    15,4
L411     EQU   *
         CLM   3,3,=H'88'
         BNE   L412
         L     4,8(6)
         L     3,4(6)
         B     L413
L412     EQU   *
         L     2,=V(ZZZ@206)
         L     4,256(2)
         LR    3,6
L413     EQU   *
         LH    2,0(15)
         CLM   2,3,=H'74'
         BNE   L414
         CLR   15,3
         BE    L406
         CLR   15,4
         BE    L406
L414     EQU   *
         LH    2,0(5)
         CLM   2,3,=H'74'
         BNE   L407
         CLR   5,3
         BE    L418
         CLR   5,4
         BNE   L407
L418     EQU   *
         LR    15,5
         B     L406
L407     EQU   *
         SLR   15,15
L406     EQU   *
* Function find_common_reg_term epilogue
         PDPEPIL
* Function find_common_reg_term literal pool
         DS    0F
         LTORG
* Function find_common_reg_term page table
         DS    0F
PGT17    EQU   *
         DC    A(PG17)
LC19     EQU   *
         DC    C'Loop iterations: No final conditional branch fou'
         DC    C'nd.'
         DC    X'15'
         DC    X'0'
LC21     EQU   *
         DC    C'Loop iterations: Jump insn has null JUMP_LABEL.'
         DC    X'15'
         DC    X'0'
LC20     EQU   *
         DC    C'Loop iterations: Loop has multiple back edges.'
         DC    X'15'
         DC    X'0'
LC22     EQU   *
         DC    C'Loop iterations: No final comparison found.'
         DC    X'15'
         DC    X'0'
LC23     EQU   *
         DC    C'Loop iterations: Comparison not against register'
         DC    C'.'
         DC    X'15'
         DC    X'0'
LC24     EQU   *
         DC    C'Loop iterations: No reg_iv_type entry for iterat'
         DC    C'ion var.'
         DC    X'15'
         DC    X'0'
LC25     EQU   *
         DC    C'Loop iterations: Iteration var rejected because '
         DC    C'mode too large.'
         DC    X'15'
         DC    X'0'
LC26     EQU   *
         DC    C'Loop iterations: Iteration var not an integer.'
         DC    X'15'
         DC    X'0'
LC27     EQU   *
         DC    C'Loop iterations: Basic induction var not set onc'
         DC    C'e in each iteration.'
         DC    X'15'
         DC    X'0'
LC28     EQU   *
         DC    C'Loop iterations: General induction var not set o'
         DC    C'nce in each iteration.'
         DC    X'15'
         DC    X'0'
LC29     EQU   *
         DC    C'Loop iterations: Basic induction var add_val is '
         DC    C'REG %d.'
         DC    X'15'
         DC    X'0'
LC30     EQU   *
         DC    C'Loop iterations: Giv iterator, initial value bia'
         DC    C's %ld.'
         DC    X'15'
         DC    X'0'
LC31     EQU   *
         DC    C'Loop iterations: Not basic or general induction '
         DC    C'var.'
         DC    X'15'
         DC    X'0'
LC32     EQU   *
         DC    C'Loop iterations: Increment value can''t be calcu'
         DC    C'lated.'
         DC    X'15'
         DC    X'0'
LC33     EQU   *
         DC    C'Loop iterations: Increment value not constant '
         DC    X'0'
LC35     EQU   *
         DC    C'Loop iterations: Initial value not constant '
         DC    X'0'
LC36     EQU   *
         DC    C'Loop iterations: Final value not constant '
         DC    X'0'
LC34     EQU   *
         DC    C'.'
         DC    X'15'
         DC    X'0'
LC37     EQU   *
         DC    C'Loop iterations: EQ comparison loop.'
         DC    X'15'
         DC    X'0'
LC38     EQU   *
         DC    C'Loop iterations: Not normal loop.'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func loop_iterations prologue
LOOP@ITE PDPPRLG CINDEX=18,FRAME=192,BASER=12,ENTRY=YES
         B     FEN18
         LTORG
FEN18    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG18     EQU   *
         LR    11,1
         L     10,=A(PGT18)
* Function loop_iterations code
         SLR   2,2
         SLR   3,3
         ST    2,128(13)
         ST    3,4+128(13)
         ST    2,136(13)
         ST    3,4+136(13)
         ST    2,144(13)
         ST    3,4+144(13)
         ST    2,152(13)
         ST    3,4+152(13)
         ST    2,160(13)
         ST    3,4+160(13)
         ST    2,168(13)
         ST    3,4+168(13)
         L     3,0(11)
         L     6,180(3)
         LR    8,6
         A     8,=F'140'
         MVC   68(4,6),=F'0'
         MVC   36(4,6),=F'0'
         MVC   48(4,6),=F'0'
         MVC   40(4,6),=F'0'
         MVC   44(4,6),=F'0'
         MVC   52(4,6),=F'0'
         MVC   60(4,6),=F'0'
         MVC   56(4,6),=F'0'
         MVC   72(4,6),=F'1'
         MVC   80(4,6),=F'0'
         L     2,200(3)
         L     7,8(2)
         LH    2,0(7)
         CLM   2,3,=H'46'
         BE    L420
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L543)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC19)
         L     14,=A(L568)
         BR    14
L420     EQU   *
         L     2,40(7)
         L     2,20(2)
         LA    4,1(0,0)
         CR    2,4
         BH    L439
         L     5,0(11)
         MVC   184(4,13),204(5)
         L     9,184(13)
         LTR   9,9
         BE    L424
         L     2,188(5)
         LTR   2,2
         BE    L424
         L     5,8(7)
L425     EQU   *
         LH    2,0(5)
         CLM   2,3,=H'46'
         BNE   L427
         L     3,40(5)
         LTR   3,3
         BNE   L429
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L419)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC21)
         B     L565
L429     EQU   *
         L     15,4(3)
         L     2,=V(MAX@UID@)
         L     4,0(2)
         CR    15,4
         BNL   L427
         L     2,=V(UID@LUID)
         L     3,0(2)
         SLL   15,2
         L     15,0(15,3)
         L     9,184(13)
         L     2,4(9)
         CR    2,4
         BNL   L434
         SLL   2,2
         C     15,0(2,3)
         BH    L560
         B     L427
L434     EQU   *
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'3333'
         L     14,=A(L566)
         BR    14
L560     EQU   *
         L     2,0(11)
         L     9,188(2)
         L     2,4(9)
         CR    2,4
         BNL   L438
         SLL   2,2
         C     15,0(2,3)
         BL    L439
         B     L427
L438     EQU   *
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'3334'
         L     14,=A(L566)
         BR    14
L439     EQU   *
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L543)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC20)
         L     14,=A(L568)
         BR    14
L427     EQU   *
         L     5,8(5)
         L     2,0(11)
         CL    5,188(2)
         BNE   L425
L424     EQU   *
         MVC   88(4,13),0(11)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1011)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   L441
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L419)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC22)
L565     EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(L419)
         BR    14
L441     EQU   *
         LH    4,0(15)
         N     4,=XL4'0000FFFF'
         ST    4,112(13)
         MVC   108(4,13),4(15)
         MVC   104(4,13),8(15)
         L     5,108(13)
         LH    2,0(5)
         CLM   2,3,=H'74'
         BE    L443
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L543)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC23)
         L     14,=A(L568)
         BR    14
L443     EQU   *
         L     7,108(13)
         L     3,4(7)
         L     5,4(8)
         CLR   3,5
         BL    L445
         L     2,0(7)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   L445
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'3383'
         L     14,=A(L566)
         BR    14
L445     EQU   *
         SLR   9,9
         CLR   3,5
         BL    L446
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L463
         ST    2,88(13)
         MVC   92(4,13),=A(LC24)
         B     L567
L446     EQU   *
         L     2,108(13)
         SLR   4,4
         IC    4,2(2)
         L     7,=V(MODE@SIZ)
         SLR   2,2
         IC    2,0(7,4)
         SLL   2,3
         SLL   2,16
         SRA   2,16
         CLM   2,3,=H'32'
         BNH   L449
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L463
         ST    2,88(13)
         MVC   92(4,13),=A(LC25)
         B     L567
L449     EQU   *
         L     2,=V(MODE@CLA)
         IC    2,0(2,4)
         CLM   2,1,=XL1'02'
         BE    L448
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L463
         ST    2,88(13)
         MVC   92(4,13),=A(LC26)
         B     L567
L448     EQU   *
         L     2,0(8)
         SLL   3,3
         L     2,0(3,2)
         LA    9,1(0,0)
         CLR   2,9
         BE    L454
         LA    3,3(0,0)
         CLR   2,3
         BE    L454
         L     4,104(13)
         LH    2,0(4)
         CLM   2,3,=H'74'
         BNE   L454
         L     2,4(4)
         CLR   2,5
         BNL   L454
         MVC   88(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         ST    15,112(13)
         MVC   104(4,13),108(13)
         ST    4,108(13)
L454     EQU   *
         L     5,108(13)
         L     4,4(5)
         L     15,0(8)
         LR    3,4
         SLL   3,3
         L     2,0(3,15)
         LA    7,1(0,0)
         CLR   2,7
         BNE   L455
         CL    4,4(8)
         BL    L456
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'3441'
         L     14,=A(L566)
         BR    14
L456     EQU   *
         L     8,4(3,15)
         L     9,24(8)
         L     2,8(8)
         L     2,52(2)
         N     2,=F'201326592'
         L     3,=F'134217728'
         CLR   2,3
         BE    L457
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L543)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC27)
         L     14,=A(L568)
         BR    14
L457     EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(BIV@TOTA)
         BALR  14,15
         LR    7,15
         B     L459
L455     EQU   *
         LA    4,3(0,0)
         CLR   2,4
         BNE   L460
         SLR   9,9
         L     4,4(3,15)
         L     2,8(4)
         L     3,4(2)
         CL    3,4(8)
         BL    L461
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'3463'
         L     14,=A(L566)
         BR    14
L461     EQU   *
         L     2,52(4)
         N     2,=F'201326592'
         L     5,=F'134217728'
         CLR   2,5
         BE    L462
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L463
         ST    2,88(13)
         MVC   92(4,13),=A(LC28)
L567     EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L463     EQU   *
         LR    3,9
         L     14,=A(L419)
         BR    14
L462     EQU   *
         SLL   3,3
         L     8,4(3,15)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(BIV@TOTA)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BE    L464
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EXTEND@V)
         BALR  14,15
         MVC   88(4,13),32(4)
         ST    15,92(13)
         L     2,=V(ZZZ@206)
         MVC   96(4,13),256(2)
         MVC   100(4,13),24(4)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         LR    7,15
         L     3,8(8)
L562     EQU   *
         LTR   3,3
         BE    L464
         MVC   88(4,13),0(4)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1546)
         BALR  14,15
         LTR   15,15
         BE    L467
         L     5,36(3)
         LH    2,0(5)
         CLM   2,3,=H'74'
         BNE   L469
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L543)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC29)
         L     2,36(3)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(L543)
         BR    14
L469     EQU   *
         L     2,72(3)
         LTR   2,2
         BNE   L467
         S     9,4(5)
L467     EQU   *
         L     3,68(3)
         B     L562
L464     EQU   *
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L473
         ST    2,88(13)
         MVC   92(4,13),=A(LC30)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L473     EQU   *
         ST    4,88(13)
         MVC   92(4,13),24(8)
         LA    1,88(,13)
         L     15,=V(EXTEND@V)
         BALR  14,15
         ST    15,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
         MVC   88(4,13),32(4)
         ST    15,92(13)
         MVC   96(4,13),36(4)
         MVC   100(4,13),24(4)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         LR    9,15
         B     L459
L460     EQU   *
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L543)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC31)
         L     14,=A(L568)
         BR    14
L459     EQU   *
         LR    3,9
         LTR   9,9
         L     14,=A(L419)
         BER   14
         MVC   116(4,13),=F'0'
         SLR   4,4
         L     3,112(13)
         A     3,=F'-115'
         LA    2,9(0,0)
         CLR   3,2
         BH    L488
         SLL   3,2
         L     2,=A(L489)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
L489     EQU   *
         DC    A(L487)
         DC    A(L487)
         DC    A(L481)
         DC    A(L486)
         DC    A(L479)
         DC    A(L484)
         DC    A(L480)
         DC    A(L485)
         DC    A(L478)
         DC    A(L483)
L478     EQU   *
         MVC   116(4,13),=F'1'
L479     EQU   *
         MVC   120(4,13),=F'1'
         LA    4,1(0,0)
         B     L477
L480     EQU   *
         MVC   116(4,13),=F'1'
L481     EQU   *
         MVC   120(4,13),=F'-1'
         L     4,=F'-1'
         B     L477
L483     EQU   *
         MVC   116(4,13),=F'1'
L484     EQU   *
         MVC   120(4,13),=F'1'
         B     L477
L485     EQU   *
         MVC   116(4,13),=F'1'
L486     EQU   *
         MVC   120(4,13),=F'-1'
         B     L477
L487     EQU   *
         MVC   120(4,13),=F'0'
         B     L477
L488     EQU   *
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'3570'
         L     14,=A(L566)
         BR    14
L477     EQU   *
         L     5,104(13)
         LH    2,0(5)
         CLM   2,3,=H'74'
         BNE   L490
         MVC   88(4,13),0(11)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BE    L490
         MVC   88(4,13),0(11)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BNE   L490
         L     5,104(13)
L490     EQU   *
         LTR   4,4
         BE    L492
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
         LR    5,15
L492     EQU   *
         ST    9,36(6)
         MVC   40(4,6),104(13)
         MVC   88(4,13),104(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
         ST    15,44(6)
         ST    7,60(6)
         MVC   56(4,6),108(13)
         MVC   64(4,6),112(13)
         ST    8,80(6)
         LH    2,0(9)
         CLM   2,3,=H'74'
         BNE   L493
         LH    2,0(5)
         CLM   2,3,=H'88'
         BNE   L494
         L     3,4(5)
         L     8,8(5)
         B     L495
L494     EQU   *
         LR    3,5
         L     2,=V(ZZZ@206)
         L     8,256(2)
L495     EQU   *
         LH    4,0(3)
         CLM   4,3,=H'74'
         BNE   L496
         CLR   3,9
         BE    L496
         MVC   88(4,13),0(11)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         LTR   15,15
         BE    L497
         LR    9,2
         B     L493
L497     EQU   *
         MVC   88(4,13),0(11)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BE    L493
         MVC   88(4,13),0(11)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         LR    2,15
         CL    15,56(6)
         BNE   L500
         LR    2,9
L500     EQU   *
         CLR   2,9
         BNE   L493
         LR    5,9
         L     2,=V(ZZZ@206)
         CL    8,256(2)
         BE    L493
         MVC   88(4,13),=F'88'
         SLR   3,3
         IC    3,2(9)
         ST    3,92(13)
         ST    9,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@957)
         BALR  14,15
         LR    5,15
         B     L493
L496     EQU   *
         L     3,0(11)
         L     2,184(3)
         LTR   2,2
         BE    L493
         CLM   4,3,=H'67'
         BNE   L493
         ST    3,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         LR    3,15
         LH    2,0(15)
         CLM   2,3,=H'89'
         BNE   L493
         L     2,4(15)
         LH    2,0(2)
         CLM   2,3,=H'74'
         BNE   L493
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(15)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'88'
         BNE   L493
         L     2,4(15)
         CL    2,8(3)
         BNE   L493
         L     9,8(15)
L493     EQU   *
         L     4,0(11)
         L     2,184(4)
         LTR   2,2
         BE    L508
         ST    9,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@F13)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    L508
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BE    L508
         ST    9,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
         LR    9,15
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@F12)
         BALR  14,15
         LR    5,15
L508     EQU   *
         ST    9,48(6)
         ST    5,52(6)
         L     3,112(13)
         LA    2,116(0,0)
         CLR   3,2
         BNE   L509
         MVC   44(4,6),=F'0'
         MVC   52(4,6),=F'0'
L509     EQU   *
         LTR   7,7
         BNE   L510
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L511
         ST    2,88(13)
         MVC   92(4,13),=A(LC32)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L511     EQU   *
         LR    3,7
         L     14,=A(L419)
         BR    14
L510     EQU   *
         LH    2,0(7)
         CLM   2,3,=H'67'
         BE    L512
         CLM   2,3,=H'74'
         BE    L514
         CLM   2,3,=H'76'
         BNE   L513
L514     EQU   *
         MVC   88(4,13),0(11)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@F11)
         BALR  14,15
         LR    7,15
L513     EQU   *
         LH    2,0(7)
         CLM   2,3,=H'67'
         BE    L515
         L     3,=V(LOOP@DUM)
         L     2,0(3)
         LTR   2,2
         L     14,=A(L543)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC33)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         ST    7,92(13)
         B     L569
L515     EQU   *
         ST    7,60(6)
L512     EQU   *
         LH    2,0(9)
         CLM   2,3,=H'67'
         BE    L517
         L     3,=V(LOOP@DUM)
         L     2,0(3)
         LTR   2,2
         L     14,=A(L543)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC35)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         ST    9,92(13)
         B     L569
L517     EQU   *
         LH    2,0(5)
         CLM   2,3,=H'67'
         BE    L520
         L     3,=V(LOOP@DUM)
         L     2,0(3)
         LTR   2,2
         L     14,=A(L543)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC36)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         ST    5,92(13)
L569     EQU   *
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(LC34)
         L     14,=A(L568)
         BR    14
L520     EQU   *
         L     2,112(13)
         LA    4,116(0,0)
         CLR   2,4
         L     14,=A(L519)
         BNER  14
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L524
         ST    2,88(13)
         MVC   92(4,13),=A(LC37)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L524     EQU   *
         L     3,4(9)
         A     3,4(7)
         ST    3,88(13)
         L     4,108(13)
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@INT@)
         BALR  14,15
         CLR   15,5
         BNE   L525
         SLR   3,3
         L     2,=V(ZZZ@206)
         CL    7,256(2)
         L     14,=A(L419)
         BER   14
         MVC   68(4,6),=F'2'
         B     L527
L525     EQU   *
         MVC   68(4,6),=F'1'
L527     EQU   *
         L     3,36(6)
         LH    2,0(3)
         CLM   2,3,=H'67'
         BNE   L528
         L     4,4(7)
         ST    4,132(13)
         L     4,128(13)
         L     5,4+128(13)
         M     4,68(6)
         ST    4,128(13)
         ST    5,4+128(13)
         A     5,4(3)
         ST    5,88(13)
         L     5,108(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@INT@)
         BALR  14,15
         B     L563
L528     EQU   *
         ST    3,88(13)
         L     3,4(7)
         ST    3,140(13)
         L     4,136(13)
         L     5,4+136(13)
         M     4,68(6)
         ST    4,136(13)
         ST    5,4+136(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
L563     EQU   *
         ST    15,44(6)
         L     7,4(7)
         ST    7,148(13)
         L     2,144(13)
         L     3,4+144(13)
         M     2,68(6)
         ST    2,144(13)
         ST    3,4+144(13)
         A     3,4(9)
         ST    3,88(13)
         L     3,108(13)
         SLR   4,4
         IC    4,2(3)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@INT@)
         BALR  14,15
         ST    15,52(6)
         L     3,68(6)
         L     14,=A(L419)
         BR    14
L519     EQU   *
         L     15,4(5)
         L     2,4(9)
         L     3,116(13)
         LTR   3,3
         BE    L530
         SLR   3,3
         CLR   15,2
         BNH   L531
         LA    3,1(0,0)
L531     EQU   *
         CLR   15,2
         BNL   L533
         B     L564
L530     EQU   *
         L     3,116(13)
         CR    15,2
         BNH   L534
         LA    3,1(0,0)
L534     EQU   *
         CR    15,2
         BNL   L533
L564     EQU   *
         BCTR  3,0
L533     EQU   *
         L     2,4(7)
         LA    4,1(0,0)
         LTR   2,2
         BH    L537
         LR    4,2
         BE    L537
         L     4,=F'-1'
L537     EQU   *
         CLR   3,4
         L     14,=A(L540)
         BNER  14
         LTR   3,3
         BE    L540
         CL    3,120(13)
         L     14,=A(L542)
         BER   14
         L     4,120(13)
         LTR   4,4
         L     14,=A(L542)
         BER   14
L540     EQU   *
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L543)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC38)
L568     EQU   *
         B     PGE18
         DS    0F
         LTORG
         DS    0F
PGE18    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG19     EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L543     EQU   *
         L     12,4(,10)
         SLR   3,3
         B     L419
L542     EQU   *
         L     12,4(,10)
         LTR   2,2
         BNH   L544
         L     4,4(5)
         S     4,4(9)
         LR    15,2
         B     L545
L544     EQU   *
         L     12,4(,10)
         LTR   2,2
         BNL   L546
         L     4,4(9)
         S     4,4(5)
         LCR   15,2
         B     L545
L546     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'3872'
L566     EQU   *
         L     12,4(,10)
         MVC   96(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L545     EQU   *
         L     12,4(,10)
         L     5,108(13)
         SLR   2,2
         IC    2,2(5)
         L     7,=V(MODE@SIZ)
         SLR   3,3
         IC    3,0(7,2)
         SLL   3,3
         BCTR  3,0
         LA    2,2(0,0)
         SLL   2,0(3)
         BCTR  2,0
         NR    4,2
         L     9,120(13)
         LTR   9,9
         BNE   L548
         ST    4,152(13)
         CLR   15,4
         BH    L551
         LTR   15,15
         BL    L550
         LA    5,1(0,0)
         CLR   15,5
         BE    L549
         L     2,152(13)
         L     3,4+152(13)
         SRDL  2,32
         DR    2,15
         ST    2,152(13)
         ST    3,4+152(13)
         B     L551
L549     EQU   *
         L     12,4(,10)
         L     3,120(13)
         ST    3,152(13)
         B     L551
L550     EQU   *
         L     12,4(,10)
         L     5,152(13)
         SR    5,15
         ST    5,152(13)
L551     EQU   *
         L     12,4(,10)
         SLR   3,3
         L     7,152(13)
         LTR   7,7
         BNE   L419
L548     EQU   *
         L     12,4(,10)
         ST    4,160(13)
         SLR   2,2
         ST    2,164(13)
         CLR   15,4
         BH    L554
         LTR   15,15
         BL    L553
         LA    5,1(0,0)
         CLR   15,5
         BE    L552
         L     2,160(13)
         L     3,4+160(13)
         SRDL  2,32
         DR    2,15
         ST    2,160(13)
         ST    3,4+160(13)
         B     L554
L552     EQU   *
         L     12,4(,10)
         L     3,160(13)
         ST    3,164(13)
         B     L554
L553     EQU   *
         L     12,4(,10)
         LA    5,1(0,0)
         ST    5,164(13)
L554     EQU   *
         L     12,4(,10)
         L     2,164(13)
         ST    4,168(13)
         CLR   15,4
         BH    L558
         LTR   15,15
         BL    L557
         LA    9,1(0,0)
         CLR   15,9
         BE    L556
         L     4,168(13)
         L     5,4+168(13)
         SRDL  4,32
         DR    4,15
         ST    4,168(13)
         ST    5,4+168(13)
         B     L558
L556     EQU   *
         L     12,4(,10)
         SLR   5,5
         ST    5,168(13)
         B     L558
L557     EQU   *
         L     12,4(,10)
         L     7,168(13)
         SR    7,15
         ST    7,168(13)
L558     EQU   *
         L     12,4(,10)
         L     9,168(13)
         LTR   9,9
         BE    L555
         A     2,=F'1'
L555     EQU   *
         L     12,4(,10)
         ST    2,68(6)
         LR    3,2
L419     EQU   *
         L     12,4(,10)
         LR    15,3
* Function loop_iterations epilogue
         PDPEPIL
* Function loop_iterations literal pool
         DS    0F
         LTORG
* Function loop_iterations page table
         DS    0F
PGT18    EQU   *
         DC    A(PG18)
         DC    A(PG19)
         DS    0F
* X-func set_dominates_use prologue
SET@DOMI PDPPRLG CINDEX=20,FRAME=96,BASER=12,ENTRY=YES
         B     FEN20
         LTORG
FEN20    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG20     EQU   *
         LR    11,1
         L     10,=A(PGT20)
* Function set_dominates_use code
         L     3,4(11)
         L     7,8(11)
         L     6,16(11)
         SLR   5,5
         L     2,12(11)
         L     4,12(2)
L593     EQU   *
         L     2,4(4)
         CLR   2,3
         BE    L587
         LH    2,0(4)
         CLM   2,3,=H'46'
         BNE   L574
         LA    5,1(0,0)
L574     EQU   *
         CLR   4,6
         BE    L591
         L     4,12(4)
         B     L593
L587     EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L591
         ST    4,88(13)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(ZZZ@355)
         BALR  14,15
         LTR   15,15
         BE    L591
         LA    15,1(0,0)
         LTR   5,5
         BE    L571
         B     L579
L591     EQU   *
         SLR   15,15
         B     L571
L579     EQU   *
         L     2,4(4)
         CLR   2,7
         BE    L589
         LH    2,0(4)
         CLM   2,3,=H'49'
         BE    L591
         CLR   4,6
         BE    L589
         L     4,12(4)
         B     L579
L589     EQU   *
         LA    15,1(0,0)
L571     EQU   *
* Function set_dominates_use epilogue
         PDPEPIL
* Function set_dominates_use literal pool
         DS    0F
         LTORG
* Function set_dominates_use page table
         DS    0F
PGT20    EQU   *
         DC    A(PG20)
LC39     EQU   *
         DC    C'Unrolling failure: Loop too big.'
         DC    X'15'
         DC    X'0'
LC40     EQU   *
         DC    C'Loop unrolling: %ld iterations.'
         DC    X'15'
         DC    X'0'
LC41     EQU   *
         DC    C'Loop unrolling: No factors found.'
         DC    X'15'
         DC    X'0'
LC42     EQU   *
         DC    C'Unrolling loop %d times.'
         DC    X'15'
         DC    X'0'
LC43     EQU   *
         DC    C'Unrolling failure: loop does not end with a JUMP'
         DC    C'_INSN.'
         DC    X'15'
         DC    X'0'
LC44     EQU   *
         DC    C'Splitting not safe, because loop not entered at '
         DC    C'top.'
         DC    X'15'
         DC    X'0'
LC45     EQU   *
         DC    C'Unrolling failure: unknown insns between BEG not'
         DC    C'e and loop label.'
         DC    X'15'
         DC    X'0'
LC46     EQU   *
         DC    C'Unrolling failure: loop start label is gone'
         DC    X'15'
         DC    X'0'
LC47     EQU   *
         DC    C'Unrolling failure: final conditional branch not '
         DC    C'to loop start'
         DC    X'15'
         DC    X'0'
LC48     EQU   *
         DC    C'Marked reg %d as local'
         DC    X'15'
         DC    X'0'
LC49     EQU   *
         DC    C'Did not mark reg %d as local'
         DC    X'15'
         DC    X'0'
LC50     EQU   *
         DC    C'unroll_loop_precondition'
         DC    X'0'
LC51     EQU   *
         DC    C'Unrolling failure: Naive unrolling not being don'
         DC    C'e.'
         DC    X'15'
         DC    X'0'
LC52     EQU   *
         DC    C'Biv %d initial value remapped to %d.'
         DC    X'15'
         DC    X'0'
LC53     EQU   *
         DC    C'Biv %d safe to split.'
         DC    X'15'
         DC    X'0'
LC54     EQU   *
         DC    C'giv combined with unreduced giv not split.'
         DC    X'15'
         DC    X'0'
LC55     EQU   *
         DC    C'Giv %d at insn %d safe to split.'
         DC    X'15'
         DC    X'0'
LC56     EQU   *
         DC    C'Biv %d mapped to %d for split.'
         DC    X'15'
         DC    X'0'
LC57     EQU   *
         DC    C'unroll_loop'
         DC    X'0'
         DS    0F
* X-func unroll_loop prologue
UNROLL@L PDPPRLG CINDEX=21,FRAME=360,BASER=12,ENTRY=YES
         B     FEN21
         LTORG
FEN21    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG21     EQU   *
         LR    11,1
         L     10,=A(PGT21)
* Function unroll_loop code
         SLR   2,2
         SLR   3,3
         ST    2,232(13)
         ST    3,4+232(13)
         ST    2,240(13)
         ST    3,4+240(13)
         ST    2,248(13)
         ST    3,4+248(13)
         ST    2,256(13)
         ST    3,4+256(13)
         ST    2,264(13)
         ST    3,4+264(13)
         ST    2,288(13)
         ST    3,4+288(13)
         ST    2,296(13)
         ST    3,4+296(13)
         ST    2,304(13)
         ST    3,4+304(13)
         ST    2,312(13)
         ST    3,4+312(13)
         ST    2,344(13)
         ST    3,4+344(13)
         L     9,4(11)
         L     3,0(11)
         MVC   152(4,13),180(3)
         L     4,152(13)
         A     4,=F'140'
         ST    4,156(13)
         MVC   188(4,13),=F'0'
         MVC   200(4,13),188(13)
         MVC   208(4,13),188(13)
         MVC   212(4,13),=F'2'
         MVC   216(4,13),188(13)
         MVC   224(4,13),196(3)
         MVC   228(4,13),200(3)
         L     8,=V(COMPILER)
         L     3,0(8)
         L     2,136(3)
         SRL   2,31
         A     2,136(3)
         SRA   2,1
         CR    9,2
         BNH   L595
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L594)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC39)
         L     14,=A(L1013)
         BR    14
L595     EQU   *
         L     5,8(11)
         LTR   5,5
         BNE   L597
         L     2,152(13)
         MVC   68(4,2),188(13)
L597     EQU   *
         L     4,=V(LOOP@DUM)
         L     3,0(4)
         LTR   3,3
         BE    L598
         L     5,152(13)
         L     2,68(5)
         LTR   2,2
         BE    L598
         ST    3,88(13)
         MVC   92(4,13),=A(LC40)
         MVC   96(4,13),68(5)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L598     EQU   *
         MVC   88(4,13),228(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         ST    15,220(13)
         L     3,152(13)
         L     2,68(3)
         LA    4,1(0,0)
         CLR   2,4
         BNE   L599
         L     5,0(11)
         L     2,188(5)
         MVC   88(4,13),196(5)
         LA    1,88(,13)
         L     15,=V(NEXT@NON)
         BALR  14,15
         LR    4,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(PC@SET)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    L601
         L     3,8(15)
         LR    5,3
         LTR   3,3
         BE    L601
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(NEXT@NON)
         BALR  14,15
         LTR   15,15
         BE    L989
         LH    2,0(15)
         CLM   2,3,=H'49'
         BNE   L989
         L     3,4(3)
         L     2,28(15)
         LR    5,4
         CL    2,28(3)
         BE    L601
L989     EQU   *
         SLR   5,5
L601     EQU   *
         L     3,220(13)
         LH    2,0(3)
         CLM   2,3,=H'48'
         BNE   L607
         MVC   220(4,13),8(3)
L607     EQU   *
         LTR   5,5
         BE    L599
         L     4,220(13)
         LH    2,0(4)
         CLM   2,3,=H'46'
         BNE   L599
         L     2,8(4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ONLY@SET)
         BALR  14,15
         LTR   15,15
         BE    L609
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L609     EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         L     5,0(11)
         L     2,184(5)
         LTR   2,2
         BE    L610
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L610     EQU   *
         L     6,0(11)
         L     2,188(6)
         LTR   2,2
         BE    L611
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L611     EQU   *
         L     7,224(13)
         LTR   7,7
         BE    L612
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L612     EQU   *
         L     8,228(13)
         LTR   8,8
         L     14,=A(L594)
         BER   14
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         L     14,=A(L594)
         BR    14
L599     EQU   *
         L     2,152(13)
         L     4,68(2)
         LTR   4,4
         BE    L614
         L     2,0(8)
         L     5,136(2)
         CLR   4,5
         BNL   L614
         ST    9,236(13)
         L     2,232(13)
         L     3,4+232(13)
         MR    2,4
         ST    2,232(13)
         ST    3,4+232(13)
         CLR   5,3
         BNH   L614
         ST    4,160(13)
         MVC   212(4,13),=F'0'
         B     L646
L614     EQU   *
         LTR   4,4
         BE    L981
         L     2,=A(@@V1+4)
         LA    8,3(0,0)
L620     EQU   *
         MVC   0(4,2),=F'0'
         BCTR  8,0
         A     2,=F'8'
         LTR   8,8
         BNL   L620
         LR    5,4
         LA    8,3(0,0)
         B     L1017
L632     EQU   *
         LR    2,4
         A     2,=A(@@V1)
         L     4,4(2)
         A     4,=F'1'
         ST    4,4(2)
         L     2,0(2)
         LR    6,5
         LR    7,3
         CLR   2,5
         BH    L631
         LTR   2,2
         BL    L630
         LA    5,1(0,0)
         CLR   2,5
         BE    L629
         SRDL  6,32
         DR    6,2
         B     L631
L629     EQU   *
         LR    7,6
         B     L631
L630     EQU   *
         LA    7,1(0,0)
L631     EQU   *
         LR    5,7
L1017    EQU   *
         LR    4,8
         SLL   4,3
         L     2,=A(@@V1)
         L     15,0(4,2)
         ST    5,240(13)
         CLR   15,5
         BH    L628
         LTR   15,15
         BL    L627
         LA    2,1(0,0)
         CLR   15,2
         BE    L626
         L     2,240(13)
         L     3,4+240(13)
         SRDL  2,32
         DR    2,15
         ST    2,240(13)
         ST    3,4+240(13)
         B     L628
L626     EQU   *
         SLR   3,3
         ST    3,240(13)
         B     L628
L627     EQU   *
         L     2,240(13)
         SR    2,15
         ST    2,240(13)
L628     EQU   *
         L     3,240(13)
         LTR   3,3
         BE    L632
         BCTR  8,0
         LTR   8,8
         BNL   L1017
         MVC   160(4,13),=F'1'
         LR    5,9
         LA    8,3(0,0)
         L     4,=A(@@V1+28)
L642     EQU   *
         L     7,=A(@@V1)
         LR    6,8
         SLL   6,3
L990     EQU   *
         L     3,0(4)
         BCTR  3,0
         ST    3,0(4)
         LR    2,3
         L     3,=F'-1'
         CLR   2,3
         BE    L638
         L     15,0(6,7)
         ST    15,252(13)
         L     2,248(13)
         L     3,4+248(13)
         MR    2,5
         ST    2,248(13)
         ST    3,4+248(13)
         L     2,=V(COMPILER)
         L     2,0(2)
         L     2,136(2)
         CLR   2,3
         BNH   L638
         ST    15,260(13)
         L     2,256(13)
         L     3,4+256(13)
         M     2,160(13)
         ST    2,256(13)
         ST    3,4+256(13)
         ST    3,160(13)
         ST    15,268(13)
         L     2,264(13)
         L     3,4+264(13)
         MR    2,5
         ST    2,264(13)
         ST    3,4+264(13)
         LR    5,3
         B     L990
L638     EQU   *
         BCTR  8,0
         A     4,=F'-8'
         LTR   8,8
         BNL   L642
         L     5,160(13)
         LA    4,1(0,0)
         CLR   5,4
         BNE   L643
         L     6,=V(LOOP@DUM)
         L     2,0(6)
         LTR   2,2
         BE    L981
         ST    2,88(13)
         MVC   92(4,13),=A(LC41)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     L981
L643     EQU   *
         MVC   212(4,13),=F'1'
         B     L646
L981     EQU   *
         LR    2,9
         SLL   2,3
         L     3,=V(COMPILER)
         L     3,0(3)
         L     3,136(3)
         MVC   160(4,13),=F'8'
         CR    2,3
         BL    L646
         SLL   9,2
         MVC   160(4,13),=F'4'
         CR    9,3
         BL    L646
         MVC   160(4,13),=F'2'
L646     EQU   *
         L     3,=V(LOOP@DUM)
         L     2,0(3)
         LTR   2,2
         BE    L651
         ST    2,88(13)
         MVC   92(4,13),=A(LC42)
         MVC   96(4,13),160(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L651     EQU   *
         L     8,212(13)
         LA    7,1(0,0)
         CLR   8,7
         BH    L652
         L     5,224(13)
         B     L992
L991     EQU   *
         CLM   2,3,=H'46'
         BE    L654
         L     5,12(5)
L992     EQU   *
         LH    2,0(5)
         CLM   2,3,=H'49'
         BNE   L991
L654     EQU   *
         LH    2,0(5)
         CLM   2,3,=H'46'
         L     14,=A(L594)
         BER   14
L652     EQU   *
         L     9,212(13)
         LTR   9,9
         BNE   L657
         MVC   164(4,13),224(13)
         L     2,220(13)
         MVC   180(4,13),12(2)
         LH    2,0(2)
         CLM   2,3,=H'48'
         BNE   L658
         L     3,220(13)
         L     2,8(3)
         MVC   168(4,13),8(2)
         B     L664
L658     EQU   *
         CLM   2,3,=H'46'
         BNE   L660
         L     4,220(13)
         MVC   168(4,13),8(4)
         L     5,168(13)
         MVC   88(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         BE    L664
         MVC   168(4,13),8(5)
         B     L664
L660     EQU   *
         L     2,0(3)
         LTR   2,2
         L     14,=A(L594)
         BER   14
         B     L1016
L657     EQU   *
         L     6,220(13)
         LH    2,0(6)
         L     8,212(13)
         LA    7,1(0,0)
         CLR   8,7
         BNE   L665
         MVC   164(4,13),224(13)
         CLM   2,3,=H'48'
         BNE   L666
         MVC   180(4,13),8(6)
         L     9,180(13)
         MVC   168(4,13),8(9)
         B     L664
L666     EQU   *
         CLM   2,3,=H'46'
         BNE   L668
         MVC   180(4,13),220(13)
         L     2,220(13)
         MVC   88(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         BE    L669
         MVC   180(4,13),8(2)
L669     EQU   *
         L     3,180(13)
         MVC   168(4,13),8(3)
         B     L664
L668     EQU   *
         L     2,0(3)
         LTR   2,2
         L     14,=A(L594)
         BER   14
         B     L1016
L665     EQU   *
         CLM   2,3,=H'48'
         BNE   L673
         L     4,220(13)
         MVC   180(4,13),8(4)
         L     5,180(13)
         MVC   168(4,13),8(5)
         B     L674
L673     EQU   *
         CLM   2,3,=H'46'
         BNE   L675
         L     6,220(13)
         MVC   180(4,13),12(6)
         ST    6,168(13)
         B     L674
L675     EQU   *
         L     2,0(3)
         LTR   2,2
         L     14,=A(L594)
         BER   14
L1016    EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(LC43)
         B     L1013
L674     EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,200(13)
         L     5,224(13)
         B     L994
L993     EQU   *
         CLM   2,3,=H'46'
         BE    L679
         L     5,12(5)
L994     EQU   *
         LH    2,0(5)
         CLM   2,3,=H'49'
         BNE   L993
L679     EQU   *
         LH    2,0(5)
         MVC   164(4,13),224(13)
         CLM   2,3,=H'46'
         BNE   L664
         MVC   164(4,13),12(5)
         MVC   208(4,13),=F'1'
         L     2,0(3)
         LTR   2,2
         BE    L664
         ST    2,88(13)
         MVC   92(4,13),=A(LC44)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L664     EQU   *
         L     7,164(13)
         MVC   204(4,13),12(7)
         L     8,204(13)
         LH    2,0(8)
L995     EQU   *
         CLM   2,3,=H'50'
         BNE   L947
         L     9,204(13)
         MVC   204(4,13),12(9)
         L     3,204(13)
         LH    2,0(3)
         B     L995
L947     EQU   *
         L     4,204(13)
         LH    2,0(4)
         CLM   2,3,=H'49'
         BE    L687
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L594)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC45)
         B     L1013
L687     EQU   *
         L     5,204(13)
         L     2,32(5)
         LTR   2,2
         BE    L689
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L594)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC46)
         B     L1013
L689     EQU   *
         L     7,212(13)
         LA    6,2(0,0)
         CLR   7,6
         BNE   L692
         L     8,220(13)
         LH    2,0(8)
         CLM   2,3,=H'48'
         BNE   L982
         L     3,8(8)
         LH    2,0(3)
         CLM   2,3,=H'46'
         BNE   L982
         L     9,204(13)
         CL    9,40(3)
         BE    L982
         MVC   180(4,13),12(8)
         ST    8,168(13)
L982     EQU   *
         L     3,220(13)
         LH    2,0(3)
         CLM   2,3,=H'46'
         BNE   L692
         L     4,204(13)
         CL    4,40(3)
         BE    L692
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L594)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC47)
L1013    EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(L594)
         BR    14
L692     EQU   *
         LA    1,88(,13)
         L     15,=V(MAX@LABE)
         BALR  14,15
         ST    15,172(13)
         LA    1,88(,13)
         L     15,=V(GET@MAX@)
         BALR  14,15
         ST    15,176(13)
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'332'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,184(13)
         L     5,172(13)
         LTR   5,5
         BNH   L694
         ST    5,88(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     6,184(13)
         ST    15,20(6)
         MVC   88(4,13),172(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,188(13)
L694     EQU   *
         L     5,164(13)
L996     EQU   *
         CL    5,228(13)
         BE    L949
         LH    2,0(5)
         CLM   2,3,=H'49'
         BNE   L698
         L     2,28(5)
         LA    8,1(0,0)
         L     7,188(13)
         STC   8,0(7,2)
         B     L699
L698     EQU   *
         CLM   2,3,=H'46'
         BNE   L699
         L     15,40(5)
         LTR   15,15
         BE    L701
         L     9,184(13)
         L     3,20(9)
         L     2,28(15)
         SLL   2,2
         ST    15,0(2,3)
         B     L699
L701     EQU   *
         L     6,24(5)
         LH    3,0(6)
         LR    2,3
         AH    2,=H'-57'
         CLM   2,3,=H'1'
         BH    L699
         X     3,=F'58'
         SLL   3,16
         SRA   3,16
         LPR   2,3
         BCTR  2,0
         N     2,=XL4'0000FFFF'
         SRL   2,15
         LR    4,2
         SLL   4,16
         SRA   4,16
         SLL   4,2
         L     2,4(6,4)
         L     7,0(2)
         LR    8,15
         CR    15,7
         BNL   L699
         L     2,184(13)
         L     15,20(2)
L708     EQU   *
         L     3,4(6,4)
         LR    2,8
         SLL   2,2
         L     2,4(2,3)
         L     3,4(2)
         L     2,28(3)
         SLL   2,2
         ST    3,0(2,15)
         A     8,=F'1'
         CR    8,7
         BL    L708
L699     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'12'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@701)
         BALR  14,15
         LTR   15,15
         BE    L697
         L     2,4(15)
         L     3,184(13)
         L     4,20(3)
         L     3,28(2)
         SLL   3,2
         ST    2,0(3,4)
L697     EQU   *
         L     5,12(5)
         B     L996
L949     EQU   *
         L     4,176(13)
         SLL   4,2
         ST    4,272(13)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     5,184(13)
         ST    15,24(5)
         MVC   44(4,5),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1564)
         BALR  14,15
         ST    15,196(13)
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     2,=A(@@V3)
         ST    15,0(2)
         MVC   88(4,13),196(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     2,=A(@@V4)
         ST    15,0(2)
         MVC   88(4,13),196(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     6,=A(@@V2)
         ST    15,0(6)
         MVC   88(4,13),196(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,192(13)
         L     7,168(13)
         L     4,4(7)
         L     2,=V(MAX@UID@)
         L     2,0(2)
         CR    4,2
         L     14,=A(L711)
         BNLR  14
         L     8,164(13)
         L     3,4(8)
         CR    3,2
         BL    L935
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'760'
         L     14,=A(L1014)
         BR    14
L935     EQU   *
         L     2,=V(UID@LUID)
         L     2,0(2)
         SLL   3,2
         L     3,0(3,2)
         ST    3,276(13)
         SLL   4,2
         L     2,0(4,2)
         ST    2,280(13)
         L     9,168(13)
         LH    2,0(9)
         CLM   2,3,=H'46'
         BNE   L717
         L     2,280(13)
         BCTR  2,0
         ST    2,280(13)
         MVC   88(4,13),8(9)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         BE    L717
         BCTR  2,0
         ST    2,280(13)
L717     EQU   *
         L     3,164(13)
         CL    3,224(13)
         BNE   L718
         L     4,276(13)
         A     4,=F'1'
         ST    4,276(13)
L718     EQU   *
         LA    5,20(0,0)
         L     6,=V(ZZZ@1563)
         CL    5,0(6)
         L     14,=A(L711)
         BNLR  14
         L     9,192(13)
         AR    9,5
L731     EQU   *
         L     12,0(,10)
         LR    4,5
         SLL   4,2
         L     2,=V(REG@N@IN)
         A     4,0(2)
         A     4,=F'16'
         L     8,0(4)
         L     3,0(8)
         LTR   3,3
         L     14,=A(L721)
         BNHR  14
         L     2,=V(MAX@UID@)
         L     7,0(2)
         CR    3,7
         L     14,=A(L721)
         BNLR  14
         L     2,=V(UID@LUID)
         L     6,0(2)
         SLL   3,2
         L     2,0(3,6)
         C     2,276(13)
         BL    L721
         L     2,4(8)
         LTR   2,2
         BNH   L721
         CR    2,7
         BNL   L721
         SLL   2,2
         L     2,0(2,6)
         C     2,280(13)
         BH    L721
         ST    5,88(13)
         L     2,0(4)
         MVC   92(4,13),0(2)
         L     2,0(4)
         MVC   96(4,13),4(2)
         MVC   100(4,13),164(13)
         MVC   104(4,13),168(13)
         LA    1,88(,13)
         L     15,=A(SET@DOMI)
         BALR  14,15
         LTR   15,15
         BE    L727
         MVI   0(9),1
L727     EQU   *
         L     2,=V(LOOP@DUM)
         L     3,0(2)
         LTR   3,3
         BE    L721
         IC    2,0(9)
         CLM   2,1,=XL1'00'
         BE    L729
         ST    3,88(13)
         MVC   92(4,13),=A(LC48)
         B     L997
L729     EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(LC49)
L997     EQU   *
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L721     EQU   *
         A     5,=F'1'
         A     9,=F'1'
         L     7,=V(ZZZ@1563)
         CL    5,0(7)
         BL    L731
L711     EQU   *
         L     9,212(13)
         LA    8,2(0,0)
         CLR   9,8
         L     14,=A(L795)
         BNER  14
         L     2,208(13)
         LTR   2,2
         L     14,=A(L984)
         BNER  14
         L     3,8(11)
         LTR   3,3
         L     14,=A(L984)
         BER   14
         MVC   88(4,13),0(11)
         LR    4,13
         A     4,=F'136'
         ST    4,92(13)
         LR    5,13
         A     5,=F'140'
         ST    5,96(13)
         LR    6,13
         A     6,=F'144'
         ST    6,100(13)
         LR    7,13
         A     7,=F'148'
         ST    7,104(13)
         LA    1,88(,13)
         L     15,=A(PRECONDI)
         BALR  14,15
         LTR   15,15
         L     14,=A(L984)
         BER   14
         L     8,152(13)
         L     3,64(8)
         MVC   352(4,13),208(13)
         LA    9,119(0,0)
         CLR   3,9
         BE    L735
         LA    2,123(0,0)
         CLR   3,2
         BE    L735
         LA    4,120(0,0)
         CLR   3,4
         BE    L735
         LA    5,124(0,0)
         CLR   3,5
         BNE   L734
L735     EQU   *
         MVC   352(4,13),=F'1'
L734     EQU   *
         SLR   4,4
         LA    6,123(0,0)
         CLR   3,6
         BE    L737
         LA    7,121(0,0)
         CLR   3,7
         BE    L737
         LA    8,124(0,0)
         CLR   3,8
         BE    L737
         LA    9,122(0,0)
         CLR   3,9
         BNE   L736
L737     EQU   *
         LA    4,1(0,0)
L736     EQU   *
         L     2,196(13)
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     5,184(13)
         ST    15,16(5)
         MVC   88(4,13),196(13)
         MVC   92(4,13),=F'17'
         MVC   96(4,13),=A(LC50)
         LA    1,88(,13)
         L     15,=V(VARRAY@I)
         BALR  14,15
         ST    15,36(5)
         L     2,=V(GLOBAL@C)
         ST    15,0(2)
         B     PGE21
         DS    0F
         LTORG
         DS    0F
PGE21    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG22     EQU   *
         MVC   88(4,13),184(13)
         MVC   92(4,13),196(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         L     7,160(13)
         LA    6,4(0,0)
         CR    7,6
         BNH   L738
         ST    6,160(13)
L738     EQU   *
         L     12,4(,10)
         MVC   284(4,13),=F'0'
         L     2,144(13)
         L     6,4(2)
         LTR   6,6
         BNL   L739
         LCR   6,6
         MVC   284(4,13),=F'1'
L739     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(ZZZ@1945)
         BALR  14,15
         MVC   88(4,13),140(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@222)
         BALR  14,15
         ST    15,140(13)
         MVC   88(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@222)
         BALR  14,15
         ST    15,136(13)
         MVC   88(4,13),140(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         ST    15,140(13)
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(NONMEMOR)
         BALR  14,15
         LTR   15,15
         BNE   L740
         MVC   88(4,13),148(13)
         MVC   92(4,13),140(13)
         LA    1,88(,13)
         L     15,=V(FORCE@RE)
         BALR  14,15
         ST    15,140(13)
L740     EQU   *
         L     12,4(,10)
         LA    8,115(0,0)
         CLR   3,8
         BE    L742
         L     9,352(13)
         CL    9,284(13)
         BE    L741
L742     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'89'
         MVC   92(4,13),148(13)
         MVC   96(4,13),140(13)
         MVC   100(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1908)
         BALR  14,15
         B     L998
L741     EQU   *
         L     12,4(,10)
         LA    2,99(0,0)
         L     5,284(13)
         LTR   5,5
         BNE   L745
         LA    2,90(0,0)
L745     EQU   *
         L     12,4(,10)
         ST    2,88(13)
         MVC   92(4,13),148(13)
         MVC   96(4,13),136(13)
         MVC   100(4,13),148(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1912)
         BALR  14,15
L998     EQU   *
         L     12,4(,10)
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),=F'0'
         ST    6,292(13)
         L     8,288(13)
         L     9,4+288(13)
         M     8,160(13)
         ST    8,288(13)
         ST    9,4+288(13)
         BCTR  9,0
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@947)
         BALR  14,15
         MVC   88(4,13),=F'96'
         MVC   92(4,13),148(13)
         ST    5,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1908)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         LR    5,15
         L     9,160(13)
         SLL   9,2
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    7,15
         SLR   8,8
         C     8,160(13)
         BNL   L953
         LR    2,15
L749     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,0(2)
         A     8,=F'1'
         A     2,=F'4'
         C     8,160(13)
         BL    L749
L953     EQU   *
         L     12,4(,10)
         LA    2,115(0,0)
         CLR   3,2
         BE    L750
         MVC   88(4,13),=F'88'
         MVC   92(4,13),148(13)
         MVC   96(4,13),136(13)
         MVC   100(4,13),144(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1908)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         L     3,352(13)
         LTR   3,3
         BE    L751
         LA    2,121(0,0)
         LTR   4,4
         BNE   L752
         LA    2,117(0,0)
         B     L752
L751     EQU   *
         L     12,4(,10)
         LA    2,123(0,0)
         LTR   4,4
         BNE   L752
         LA    2,119(0,0)
L752     EQU   *
         L     12,4(,10)
         ST    2,88(13)
         MVC   92(4,13),148(13)
         ST    15,96(13)
         MVC   100(4,13),140(13)
         MVC   104(4,13),4(7)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LTR   15,15
         BE    L750
         ST    15,88(13)
         MVC   92(4,13),=F'11'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ZZZ@1685)
         BALR  14,15
L750     EQU   *
         L     12,4(,10)
         SLR   8,8
         L     9,160(13)
         BCTR  9,0
         CR    8,9
         BNL   L955
         LR    4,7
L766     EQU   *
         L     12,4(,10)
         LTR   8,8
         BNE   L761
         LR    2,8
         MVC   356(4,13),=F'116'
         B     L762
L761     EQU   *
         L     12,4(,10)
         L     2,284(13)
         LTR   2,2
         BE    L763
         L     2,160(13)
         SR    2,8
         MVC   356(4,13),=F'117'
         B     L762
L763     EQU   *
         L     12,4(,10)
         LR    2,8
         MVC   356(4,13),=F'119'
L762     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'0'
         ST    2,300(13)
         L     2,296(13)
         L     3,4+296(13)
         MR    2,6
         ST    2,296(13)
         ST    3,4+296(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@947)
         BALR  14,15
         MVC   88(4,13),356(13)
         MVC   92(4,13),148(13)
         ST    5,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(4)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
         LTR   15,15
         BE    L760
         ST    15,88(13)
         MVC   92(4,13),=F'12'
         L     15,160(13)
         SR    15,8
         SLR   3,3
         ST    3,304(13)
         L     2,=F'10000'
         ST    2,308(13)
         L     2,304(13)
         L     3,4+304(13)
         DR    2,15
         ST    2,304(13)
         ST    3,4+304(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1684)
         BALR  14,15
L760     EQU   *
         L     12,4(,10)
         A     8,=F'1'
         A     4,=F'4'
         CR    8,9
         BL    L766
L955     EQU   *
         L     12,4(,10)
         LA    3,1(0,0)
         CLR   6,3
         BE    L767
         L     4,284(13)
         LTR   4,4
         BE    L768
         LR    2,6
         BCTR  2,0
         LA    3,119(0,0)
         B     L769
L768     EQU   *
         L     12,4(,10)
         L     8,160(13)
         BCTR  8,0
         ST    8,316(13)
         L     2,312(13)
         L     3,4+312(13)
         MR    2,6
         ST    2,312(13)
         ST    3,4+312(13)
         L     2,316(13)
         A     2,=F'1'
         LA    3,117(0,0)
L769     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@947)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),148(13)
         ST    5,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(7)
         LA    1,88(,13)
         L     15,=A(@@F1)
         BALR  14,15
L767     EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(ZZZ@1028)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1547)
         BALR  14,15
         L     3,220(13)
         LH    2,0(3)
         CLM   2,3,=H'48'
         BNE   L770
         L     2,8(3)
         MVC   168(4,13),8(2)
         B     L771
L770     EQU   *
         L     12,4(,10)
         CLM   2,3,=H'46'
         BNE   L772
         L     4,220(13)
         MVC   168(4,13),8(4)
         L     5,168(13)
         MVC   88(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         BE    L771
         MVC   168(4,13),8(5)
         B     L771
L772     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'1049'
         L     14,=A(L1014)
         BR    14
L771     EQU   *
         L     12,4(,10)
         LA    8,1(0,0)
         C     8,160(13)
         BNL   L957
         L     6,160(13)
         SLL   6,2
         AR    6,7
         A     6,=F'-4'
L791     EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(6)
         L     9,224(13)
         MVC   92(4,13),8(9)
         LA    1,88(,13)
         L     15,=V(ZZZ@562)
         BALR  14,15
         L     2,184(13)
         MVC   88(4,13),24(2)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),272(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     3,184(13)
         L     2,36(3)
         LR    4,2
         A     4,=F'16'
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         L     2,0(2)
         SLL   2,3
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         MVC   40(4,3),=F'0'
         SLR   4,4
L999     EQU   *
         L     12,4(,10)
         C     4,172(13)
         BNL   L959
         L     5,188(13)
         IC    2,0(5,4)
         CLM   2,1,=XL1'00'
         BE    L780
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         L     9,184(13)
         L     3,20(9)
         LR    2,4
         SLL   2,2
         ST    15,0(2,3)
L780     EQU   *
         L     12,4(,10)
         A     4,=F'1'
         B     L999
L959     EQU   *
         L     12,4(,10)
         LA    5,20(0,0)
L1000    EQU   *
         L     12,4(,10)
         CL    5,196(13)
         BNL   L961
         L     3,192(13)
         IC    2,0(3,5)
         CLM   2,1,=XL1'00'
         BE    L785
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,12(2)
         L     2,44(2)
         LR    3,5
         SLL   3,2
         L     2,0(3,2)
         SLR   9,9
         IC    9,2(2)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         L     9,184(13)
         L     2,16(9)
         ST    15,0(3,2)
         MVC   88(4,13),4(15)
         L     2,0(4)
         L     2,12(2)
         L     2,44(2)
         L     2,0(3,2)
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1759)
         BALR  14,15
L785     EQU   *
         L     12,4(,10)
         A     5,=F'1'
         B     L1000
L961     EQU   *
         L     12,4(,10)
         L     2,160(13)
         BCTR  2,0
         CLR   8,2
         BNE   L788
         L     3,220(13)
         LH    2,0(3)
         ST    3,168(13)
         CLM   2,3,=H'48'
         BNE   L788
         L     2,8(3)
         MVC   168(4,13),8(2)
L788     EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(11)
         MVC   92(4,13),164(13)
         MVC   96(4,13),168(13)
         MVC   100(4,13),184(13)
         MVC   104(4,13),200(13)
         MVC   108(4,13),=F'0'
         MVC   112(4,13),=F'2'
         MVC   116(4,13),204(13)
         MVC   120(4,13),228(13)
         MVC   124(4,13),224(13)
         MVC   128(4,13),168(13)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         A     8,=F'1'
         A     6,=F'-4'
         C     8,160(13)
         BL    L791
L957     EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(7)
         L     4,224(13)
         MVC   92(4,13),8(4)
         LA    1,88(,13)
         L     15,=V(ZZZ@562)
         BALR  14,15
         L     5,220(13)
         LH    2,0(5)
         CLM   2,3,=H'48'
         BNE   L792
         MVC   180(4,13),8(5)
         L     6,180(13)
         MVC   168(4,13),8(6)
         B     L793
L792     EQU   *
         L     12,4(,10)
         MVC   180(4,13),220(13)
         L     8,220(13)
         MVC   88(4,13),8(8)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         BE    L794
         MVC   180(4,13),8(8)
L794     EQU   *
         L     12,4(,10)
         L     9,180(13)
         MVC   168(4,13),8(9)
L793     EQU   *
         L     12,4(,10)
         MVC   212(4,13),=F'1'
         MVC   216(4,13),212(13)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     L795
L984     EQU   *
         L     12,4(,10)
         L     2,=V(ZZZ@770)
         L     2,0(2)
         LTR   2,2
         BNE   L795
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(L925)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(LC51)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(L925)
         BR    14
L795     EQU   *
         L     12,4(,10)
         L     2,152(13)
         MVC   72(4,2),160(13)
         MVC   32(4,2),216(13)
         L     3,0(11)
         L     2,200(3)
         MVC   20(4,2),216(13)
         SLR   5,5
         L     4,208(13)
         LTR   4,4
         L     14,=A(L799)
         BNER  14
         L     2,180(3)
         A     2,=F'140'
         ST    4,332(13)
         L     5,8(2)
L1001    EQU   *
         L     12,4(,10)
         LTR   5,5
         L     14,=A(L963)
         BER   14
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(BIV@TOTA)
         BALR  14,15
         ST    15,320(13)
         LTR   15,15
         L     14,=A(L802)
         BER   14
         LH    2,0(15)
         CLM   2,3,=H'67'
         L     14,=A(L802)
         BNER  14
         MVC   328(4,13),=F'1'
         MVC   324(4,13),=F'0'
         L     6,212(13)
         LTR   6,6
         BE    L805
         L     7,0(11)
         L     2,220(7)
         LTR   2,2
         BNE   L806
         LA    8,2(0,0)
         CR    6,8
         BNE   L805
L806     EQU   *
         L     12,4(,10)
         L     15,=V(REG@N@IN)
         L     6,0(5)
         LR    2,6
         SLL   2,2
         A     2,0(15)
         L     2,16(2)
         L     8,=V(MAX@UID@)
         L     3,4(2)
         L     4,=F'2147483647'
         C     3,0(8)
         BNL   L809
         L     2,=V(UID@LUID)
         L     2,0(2)
         SLL   3,2
         L     4,0(3,2)
L809     EQU   *
         L     12,4(,10)
         L     9,0(11)
         L     2,200(9)
         L     3,4(2)
         C     3,0(8)
         BNL   L810
         L     9,=V(UID@LUID)
         L     2,0(9)
         SLL   3,2
         C     4,0(3,2)
         BNL   L807
         B     L811
L810     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'2511'
         L     14,=A(L1014)
         BR    14
L811     EQU   *
         L     12,4(,10)
         L     4,40(5)
         LTR   4,4
         BE    L807
         L     2,4(4)
         L     7,0(8)
         CR    2,7
         BNL   L807
         SLL   6,2
         A     6,0(15)
         L     2,16(6)
         L     3,0(2)
         SLR   6,6
         CR    3,7
         BNL   L813
         L     2,0(9)
         SLL   3,2
         L     6,0(3,2)
L813     EQU   *
         L     12,4(,10)
         L     3,4(4)
         C     3,0(8)
         BNL   L814
         L     2,=V(UID@LUID)
         L     2,0(2)
         SLL   3,2
         C     6,0(3,2)
         BL    L807
         B     L815
L814     EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'2515'
         L     14,=A(L1014)
         BR    14
L815     EQU   *
         L     12,4(,10)
         L     2,8(5)
         MVC   88(4,13),16(2)
         L     2,44(5)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    L805
L807     EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(11)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(FINAL@BI)
         BALR  14,15
         ST    15,324(13)
         LTR   15,15
         BNE   L805
         ST    15,328(13)
L805     EQU   *
         L     12,4(,10)
         L     6,8(5)
         L     2,328(13)
         LTR   2,2
         BE    L817
L1002    EQU   *
         L     12,4(,10)
         LTR   6,6
         BE    L817
         L     4,0(6)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   L820
         L     2,24(4)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'60'
         BE    L822
         ST    4,88(13)
         L     2,0(6)
         MVC   92(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
L822     EQU   *
         L     12,4(,10)
         LTR   15,15
         BE    L820
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'74'
         BNE   L820
         L     2,4(3)
         CL    2,0(5)
         BNE   L820
         L     2,8(15)
         LH    2,0(2)
         CLM   2,3,=H'88'
         BE    L818
L820     EQU   *
         L     12,4(,10)
         MVC   328(4,13),=F'0'
L818     EQU   *
         L     12,4(,10)
         L     6,68(6)
         L     3,328(13)
         LTR   3,3
         BNE   L1002
L817     EQU   *
         L     12,4(,10)
         L     6,328(13)
         LA    4,1(0,0)
         CLR   6,4
         L     14,=A(L826)
         BNER  14
         L     7,212(13)
         LTR   7,7
         L     14,=A(L827)
         BNER  14
         L     3,24(5)
         LH    2,0(3)
         CLM   2,3,=H'74'
         L     14,=A(L828)
         BNER  14
         L     2,4(3)
         CL    2,0(5)
         BE    L829
         LA    8,19(0,0)
         CLR   2,8
         BNH   L829
         MVC   88(4,13),0(11)
         MVC   92(4,13),24(5)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BNE   L828
L829     EQU   *
         L     12,4(,10)
         L     2,8(5)
         MVC   88(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),4(15)
         L     2,8(5)
         MVC   92(4,13),36(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1759)
         BALR  14,15
         ST    4,88(13)
         L     2,8(5)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1547)
         BALR  14,15
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L830
         ST    2,88(13)
         MVC   92(4,13),=A(LC52)
         MVC   96(4,13),0(5)
         MVC   100(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L830     EQU   *
         L     12,4(,10)
         L     2,=A(@@V3)
         L     3,0(2)
         L     2,0(5)
         SLL   2,2
         ST    4,0(2,3)
         B     L832
L828     EQU   *
         L     12,4(,10)
         L     2,=A(@@V3)
         L     3,0(2)
         L     2,0(5)
         SLL   2,2
         L     9,24(5)
         ST    9,0(2,3)
         B     L832
L827     EQU   *
         L     12,4(,10)
         L     2,=A(@@V3)
         L     4,0(2)
         L     3,0(5)
         SLL   3,2
         L     2,=V(ZZZ@206)
         L     2,256(2)
         ST    2,0(3,4)
L832     EQU   *
         L     12,4(,10)
         L     2,=A(@@V4)
         L     3,0(2)
         L     2,0(5)
         SLL   2,2
         L     4,4(5)
         ST    4,0(2,3)
         L     6,332(13)
         A     6,4(5)
         ST    6,332(13)
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L826
         ST    2,88(13)
         MVC   92(4,13),=A(LC53)
         MVC   96(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L826     EQU   *
         L     12,4(,10)
         L     7,0(11)
         L     8,180(7)
         A     8,=F'140'
         ST    8,336(13)
         SLR   9,9
         L     4,16(5)
L1003    EQU   *
         L     12,4(,10)
         LTR   4,4
         L     14,=A(L966)
         BER   14
         L     3,68(4)
L1004    EQU   *
         L     12,4(,10)
         LTR   3,3
         L     14,=A(L968)
         BER   14
         L     2,0(4)
         CL    2,0(3)
         BNE   L839
         MVC   88(4,13),4(4)
         MVC   92(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(ZZZ@1849)
         BALR  14,15
         LTR   15,15
         BE    L839
         L     2,80(3)
         LTR   2,2
         BNE   L839
         ST    4,80(3)
L839     EQU   *
         L     12,4(,10)
         L     3,68(3)
         B     L1004
L968     EQU   *
         L     12,4(,10)
         L     4,68(4)
         B     L1003
L966     EQU   *
         L     12,4(,10)
         L     4,16(5)
L1005    EQU   *
         L     12,4(,10)
         LTR   4,4
         L     14,=A(L970)
         BER   14
         L     2,212(13)
         LTR   2,2
         L     14,=A(L846)
         BER   14
         L     2,52(4)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         L     14,=A(L845)
         BNER  14
L846     EQU   *
         L     12,4(,10)
         L     2,12(4)
         LTR   2,2
         L     14,=A(L847)
         BER   14
         L     2,52(4)
         SRL   2,28
         N     2,=F'1'
         B     PGE22
         DS    0F
         LTORG
         DS    0F
PGE22    EQU   *
         DROP  12
         BALR  12,0
         USING *,12
PG23     EQU   *
         LTR   2,2
         BE    L845
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(4)
         LA    1,88(,13)
         L     15,=A(BACK@BRA)
         BALR  14,15
         LTR   15,15
         BNE   L845
L847     EQU   *
         L     12,8(,10)
         MVC   88(4,13),32(4)
         MVC   92(4,13),320(13)
         L     8,=V(ZZZ@206)
         MVC   96(4,13),256(8)
         MVC   100(4,13),24(4)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         LTR   15,15
         BE    L845
         LH    2,0(15)
         CLM   2,3,=H'67'
         BNE   L845
         SLR   7,7
         L     3,212(13)
         LTR   3,3
         BE    L851
         L     6,0(11)
         L     2,220(6)
         LTR   2,2
         BNE   L852
         LA    2,2(0,0)
         CLR   3,2
         BNE   L851
L852     EQU   *
         L     12,8(,10)
         L     2,12(4)
         LTR   2,2
         BE    L851
         L     2,16(4)
         L     3,4(2)
         L     2,=V(ZZZ@1563)
         CL    3,0(2)
         BNL   L853
         L     6,=V(REG@N@IN)
         SLL   3,2
         A     3,0(6)
         L     2,16(3)
         L     3,0(4)
         L     2,0(2)
         CL    2,4(3)
         BE    L854
         ST    3,88(13)
         MVC   92(4,13),=F'5'
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@701)
         BALR  14,15
         LTR   15,15
         BE    L853
         L     2,16(4)
         L     2,4(2)
         SLL   2,2
         A     2,0(6)
         L     2,16(2)
         L     3,4(15)
         L     2,0(2)
         C     2,4(3)
         BNE   L853
L854     EQU   *
         L     12,8(,10)
         L     2,16(4)
         L     2,4(2)
         SLL   2,2
         A     2,0(6)
         L     2,16(2)
         L     7,=V(MAX@UID@)
         L     3,4(2)
         L     6,=F'2147483647'
         C     3,0(7)
         BNL   L856
         L     2,=V(UID@LUID)
         L     2,0(2)
         SLL   3,2
         L     6,0(3,2)
L856     EQU   *
         L     12,8(,10)
         L     3,0(11)
         L     2,200(3)
         L     3,4(2)
         C     3,0(7)
         BNL   L857
         L     2,=V(UID@LUID)
         L     2,0(2)
         SLL   3,2
         C     6,0(3,2)
         BNL   L853
         B     L851
L857     EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'2706'
         L     14,=A(L1014)
         BR    14
L853     EQU   *
         L     12,8(,10)
         L     7,44(4)
         LTR   7,7
         BE    L845
L851     EQU   *
         L     12,8(,10)
         L     6,212(13)
         LTR   6,6
         BNE   L859
         L     6,0(5)
         L     2,=A(@@V3)
         L     3,0(2)
         LR    2,6
         SLL   2,2
         L     2,0(2,3)
         LTR   2,2
         BNE   L861
         L     3,24(5)
         LH    2,0(3)
         CLM   2,3,=H'74'
         BNE   L1006
         L     2,4(3)
         CLR   2,6
         BE    L862
         LA    7,19(0,0)
         CLR   2,7
         BH    L1006
L862     EQU   *
         L     12,8(,10)
         L     2,8(5)
         MVC   88(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),4(15)
         L     2,8(5)
         MVC   92(4,13),36(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1759)
         BALR  14,15
         ST    3,88(13)
         L     2,8(5)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1547)
         BALR  14,15
L1006    EQU   *
         L     12,8(,10)
         LR    2,3
L861     EQU   *
         L     12,8(,10)
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(EXTEND@V)
         BALR  14,15
         MVC   88(4,13),32(4)
         ST    15,92(13)
         MVC   96(4,13),36(4)
         MVC   100(4,13),24(4)
         LA    1,88(,13)
         L     15,=A(@@F7)
         BALR  14,15
         LR    3,15
         B     L865
L859     EQU   *
         L     12,8(,10)
         L     3,256(8)
L865     EQU   *
         L     12,8(,10)
         L     2,4(4)
         LTR   2,2
         BE    L845
         L     2,72(4)
         LTR   2,2
         BE    L867
         L     2,4(2)
         LTR   2,2
         BNE   L867
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L845
         ST    2,88(13)
         MVC   92(4,13),=A(LC54)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     L845
L867     EQU   *
         L     12,8(,10)
         L     2,12(4)
         LA    8,1(0,0)
         CLR   2,8
         BNE   L845
         L     2,212(13)
         LTR   2,2
         BNE   L871
         LH    2,0(3)
         CLM   2,3,=H'67'
         BE    L871
         CLM   2,3,=H'74'
         BE    L871
         CLM   2,3,=H'88'
         BNE   L872
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'74'
         BNE   L872
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'67'
         BE    L871
L872     EQU   *
         L     12,8(,10)
         MVC   88(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(15)
         MVC   92(4,13),36(4)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1759)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),24(5)
         LA    1,88(,13)
         L     15,=V(EXTEND@V)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         MVC   96(4,13),32(4)
         MVC   100(4,13),36(4)
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1550)
         BALR  14,15
         LR    3,2
L871     EQU   *
         L     12,8(,10)
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(REG@OR@S)
         BALR  14,15
         L     2,=A(@@V3)
         L     2,0(2)
         SLL   15,2
         ST    3,0(15,2)
         L     6,4(4)
         LH    2,0(6)
         CLM   2,3,=H'74'
         BNE   L875
         LA    3,1(0,0)
         L     2,52(4)
         SRL   2,29
         NR    2,3
         LTR   2,2
         BNE   L876
         L     2,8(4)
         L     7,336(13)
         L     3,0(7)
         L     2,4(2)
         SLL   2,3
         L     2,4(2,3)
         L     3,4(2)
L876     EQU   *
         L     12,8(,10)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(REG@OR@S)
         BALR  14,15
         L     2,=A(@@V4)
         L     2,0(2)
         SLL   15,2
         ST    3,0(15,2)
L875     EQU   *
         L     12,8(,10)
         A     9,=F'1'
         L     7,=V(LOOP@DUM)
         L     2,0(7)
         LTR   2,2
         BE    L845
         L     2,16(4)
         LH    3,0(2)
         L     6,=F'-1'
         CLM   3,3,=H'67'
         BE    L879
         L     2,4(2)
         LR    6,2
         CLM   3,3,=H'74'
         BE    L879
         L     6,4(2)
L879     EQU   *
         L     12,8(,10)
         MVC   88(4,13),0(7)
         MVC   92(4,13),=A(LC55)
         ST    6,96(13)
         L     2,0(4)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L845     EQU   *
         L     12,8(,10)
         L     4,68(4)
         L     14,=A(L1005)
         BR    14
L970     EQU   *
         L     12,8(,10)
         A     9,332(13)
         ST    9,332(13)
         L     8,324(13)
         LTR   8,8
         BE    L802
         L     9,0(11)
         L     2,220(9)
         L     3,8(5)
         LTR   2,2
         BNE   L885
         MVC   88(4,13),8(3)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1548)
         BALR  14,15
         B     L802
L885     EQU   *
         L     12,8(,10)
         MVC   88(4,13),24(3)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),4(15)
         L     2,8(5)
         MVC   92(4,13),36(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1759)
         BALR  14,15
         ST    3,88(13)
         L     2,8(5)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1547)
         BALR  14,15
         L     2,8(5)
         MVC   88(4,13),8(2)
         MVC   92(4,13),324(13)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@1547)
         BALR  14,15
         L     2,=V(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    L887
         ST    2,88(13)
         MVC   92(4,13),=A(LC56)
         L     2,8(5)
         L     2,8(2)
         MVC   96(4,13),4(2)
         MVC   100(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
L887     EQU   *
         L     12,8(,10)
         L     2,8(5)
         ST    3,8(2)
L802     EQU   *
         L     12,8(,10)
         L     5,36(5)
         L     14,=A(L1001)
         BR    14
L963     EQU   *
         L     12,8(,10)
         L     5,332(13)
L799     EQU   *
         L     12,8(,10)
         LA    1,88(,13)
         L     15,=V(ZZZ@1564)
         BALR  14,15
         LR    3,15
         LR    2,15
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     4,184(13)
         ST    15,16(4)
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@F2)
         BALR  14,15
         L     2,36(4)
         LTR   2,2
         BNE   L890
         L     6,160(13)
         ST    6,348(13)
         L     8,344(13)
         L     9,4+344(13)
         MR    8,5
         ST    8,344(13)
         ST    9,4+344(13)
         L     2,348(13)
         SLL   2,1
         AR    3,2
         ST    3,88(13)
         MVC   92(4,13),=F'17'
         MVC   96(4,13),=A(LC57)
         LA    1,88(,13)
         L     15,=V(VARRAY@I)
         BALR  14,15
         ST    15,36(4)
L890     EQU   *
         L     12,8(,10)
         L     2,=V(GLOBAL@C)
         L     9,184(13)
         MVC   0(4,2),36(9)
         L     2,156(13)
         L     4,8(2)
L1007    EQU   *
         L     12,8(,10)
         LTR   4,4
         BE    L972
         L     2,8(4)
         L     5,8(2)
         L     2,4(5)
         L     3,0(4)
         CLR   2,3
         BE    L893
         L     6,184(13)
         L     2,16(6)
         SLL   3,2
         ST    5,0(3,2)
L893     EQU   *
         L     12,8(,10)
         L     4,36(4)
         B     L1007
L972     EQU   *
         L     12,8(,10)
         L     6,=V(CFUN)
         L     2,0(6)
         L     2,12(2)
         L     7,184(13)
         MVC   64(4,7),40(2)
         MVC   68(4,7),44(2)
         L     9,212(13)
         LA    8,1(0,0)
         CLR   9,8
         BNE   L896
         L     2,168(13)
         L     5,12(2)
         LH    2,0(5)
         AH    2,=H'-45'
         CLM   2,3,=H'1'
         BH    L896
         MVC   88(4,13),0(11)
         MVC   92(4,13),24(5)
         LA    1,88(,13)
         L     15,=A(@@F14)
         BALR  14,15
         ST    15,24(5)
L896     EQU   *
         L     12,8(,10)
         SLR   8,8
L1008    EQU   *
         L     12,8(,10)
         C     8,160(13)
         BNL   L974
         L     3,184(13)
         MVC   88(4,13),24(3)
         MVC   92(4,13),=F'0'
         L     4,176(13)
         SLL   4,2
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     2,36(3)
         LR    5,2
         A     5,=F'16'
         ST    5,88(13)
         MVC   92(4,13),=F'0'
         L     2,0(2)
         SLL   2,3
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         MVC   40(4,3),=F'0'
         SLR   4,4
L1009    EQU   *
         L     12,8(,10)
         C     4,172(13)
         BNL   L976
         L     7,188(13)
         IC    2,0(7,4)
         CLM   2,1,=XL1'00'
         BE    L903
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         L     9,184(13)
         L     3,20(9)
         LR    2,4
         SLL   2,2
         ST    15,0(2,3)
L903     EQU   *
         L     12,8(,10)
         A     4,=F'1'
         B     L1009
L976     EQU   *
         L     12,8(,10)
         LA    5,20(0,0)
L1010    EQU   *
         L     12,8(,10)
         CL    5,196(13)
         BNL   L978
         L     3,192(13)
         IC    2,0(3,5)
         CLM   2,1,=XL1'00'
         BE    L908
         L     2,0(6)
         L     2,12(2)
         L     2,44(2)
         LR    3,5
         SLL   3,2
         L     2,0(3,2)
         SLR   4,4
         IC    4,2(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         L     7,184(13)
         L     2,16(7)
         ST    15,0(3,2)
         MVC   88(4,13),4(15)
         L     2,0(6)
         L     2,12(2)
         L     2,44(2)
         L     2,0(3,2)
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ZZZ@1759)
         BALR  14,15
L908     EQU   *
         L     12,8(,10)
         A     5,=F'1'
         B     L1010
L978     EQU   *
         L     12,8(,10)
         LTR   8,8
         BNE   L911
         L     9,224(13)
         CL    9,164(13)
         BE    L911
         L     2,164(13)
         L     5,8(2)
         L     3,24(5)
         MVC   88(4,13),184(13)
         L     2,8(3)
         L     2,4(2)
         MVC   92(4,13),28(2)
         LA    1,88(,13)
         L     15,=V(ZZZ@1033)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'80'
         ST    8,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@987)
         BALR  14,15
         ST    15,8(3)
         ST    2,40(5)
         L     3,20(2)
         A     3,=F'1'
         ST    3,20(2)
L911     EQU   *
         L     12,8(,10)
         MVC   88(4,13),0(11)
         MVC   92(4,13),164(13)
         MVC   96(4,13),168(13)
         MVC   100(4,13),184(13)
         MVC   104(4,13),200(13)
         SLR   3,3
         L     2,160(13)
         BCTR  2,0
         CLR   8,2
         BNE   L912
         LA    3,1(0,0)
L912     EQU   *
         L     12,8(,10)
         ST    3,108(13)
         MVC   112(4,13),212(13)
         MVC   116(4,13),204(13)
         MVC   120(4,13),228(13)
         MVC   124(4,13),180(13)
         MVC   128(4,13),180(13)
         LA    1,88(,13)
         L     15,=A(@@F6)
         BALR  14,15
         A     8,=F'1'
         B     L1008
L974     EQU   *
         L     12,8(,10)
         L     4,212(13)
         LTR   4,4
         BNE   L914
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),220(13)
         B     L1011
L914     EQU   *
         L     12,8(,10)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),168(13)
L1011    EQU   *
         L     12,8(,10)
         LA    1,88(,13)
         L     15,=V(ZZZ@562)
         BALR  14,15
         LR    3,15
         L     6,164(13)
         L     5,12(6)
L1018    EQU   *
         L     12,8(,10)
         CLR   5,3
         BE    L980
         CL    5,204(13)
         BE    L918
         LH    2,0(5)
         CLM   2,3,=H'49'
         BNE   L919
         L     2,32(5)
         LTR   2,2
         BNE   L918
         B     L920
L919     EQU   *
         L     12,8(,10)
         CLM   2,3,=H'50'
         BNE   L920
         L     2,24(5)
         L     7,=F'-88'
         CLR   2,7
         BE    L918
L920     EQU   *
         L     12,8(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         LR    5,15
         B     L1018
L918     EQU   *
         L     12,8(,10)
         L     5,12(5)
         B     L1018
L980     EQU   *
         L     12,8(,10)
         L     2,0(3)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BE    L923
         MVC   88(4,13),=A(LC9)
         MVC   92(4,13),=F'1288'
L1014    EQU   *
         L     12,8(,10)
         MVC   96(4,13),=A(LC10)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
L923     EQU   *
         L     12,8(,10)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         L     8,200(13)
         LTR   8,8
         BE    L797
         ST    8,88(13)
         MVC   92(4,13),228(13)
         LA    1,88(,13)
         L     15,=V(ZZZ@562)
         BALR  14,15
L797     EQU   *
         L     12,8(,10)
         L     9,212(13)
         LTR   9,9
         BNE   L925
         L     3,0(11)
         L     2,184(3)
         LTR   2,2
         BE    L926
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L926     EQU   *
         L     12,8(,10)
         L     4,0(11)
         L     2,188(4)
         LTR   2,2
         BE    L927
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L927     EQU   *
         L     12,8(,10)
         L     5,224(13)
         LTR   5,5
         BE    L928
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L928     EQU   *
         L     12,8(,10)
         L     6,228(13)
         LTR   6,6
         BE    L925
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
L925     EQU   *
         L     12,8(,10)
         L     7,184(13)
         L     2,36(7)
         LTR   2,2
         BE    L930
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   36(4,7),=F'0'
L930     EQU   *
         L     12,8(,10)
         L     8,184(13)
         L     2,20(8)
         LTR   2,2
         BE    L933
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),188(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L933     EQU   *
         L     12,8(,10)
         L     9,184(13)
         MVC   88(4,13),24(9)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@V3)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@V4)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@V2)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),192(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,16(9)
         LTR   2,2
         BE    L934
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L934     EQU   *
         L     12,8(,10)
         MVC   88(4,13),184(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
L594     EQU   *
         L     12,8(,10)
* Function unroll_loop epilogue
         PDPEPIL
* Function unroll_loop literal pool
         DS    0F
         LTORG
* Function unroll_loop page table
         DS    0F
PGT21    EQU   *
         DC    A(PG21)
         DC    A(PG22)
         DC    A(PG23)
         DS    0F
@@V2     EQU   *
         DC    4X'00'
         DS    0F
@@V3     EQU   *
         DC    4X'00'
         DS    0F
@@V4     EQU   *
         DC    4X'00'
         END
