//TSO0571 JOB (T951V40),'INSTIN1',MSGCLASS=T,CLASS=Z,NOTIFY=TSO057,
//          SCHENV=SYSAFF
// INCLUDE MEMBER=SYSLEV
//*
//*
//*      INSTSET/INSTGET INSTALLATION
//*
//*
//*
//* 1) MODIFY AND RUN THIS JOB.   INSTUJI MUST BE IN A LINKLIST
//* LIBRARY.  INSTSET MUST BE IN AN AUTHORISED LIBRARY.  HERE I PUT
//* THEM BOTH IN SYS1.LINKLIB
//*
//* 2) F LLA,REFRESH
//*
//* 3) INCLUDE IN A PROGXX MEMBER
//*
//*  EXIT ADD    EXITNAME(SYS.IEFUJI) MODNAME(INSTUJI)
//*
//* 4) ISSUE   SET PROG=XX    (WHATEVER XX IS)
//*
//* 5) RUN INSTNT02 THE IVP PROGRAM
//*
//*
//ASM    EXEC PGM=ASMA90,PARM=(OBJ,NODECK),COND=(0,NE)
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.&SYSLEV..AMODGEN,DISP=SHR
//         DD  DSN=SFT.INSTASM.ASM,DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=VIO,SPACE=(9999,(600,100))
//SYSUT2   DD  DSN=&&SYSUT2,UNIT=VIO,SPACE=(1700,(300,50))
//SYSUT3   DD  DSN=&&SYSUT3,UNIT=VIO,SPACE=(1700,(300,50))
//SYSPRINT DD  SYSOUT=*,DCB=BLKSIZE=1089
//SYSPUNCH DD  SYSOUT=B
//SYSLIN   DD  DSN=&&OBJSET,UNIT=SYSSQ,SPACE=(80,(200,50)),
//             DISP=(MOD,PASS)
//SYSIN    DD  DISP=SHR,DSN=SFT.INSTASM.ASM(INSTSET)
//LKED    EXEC PGM=IEWL,PARM='XREF,LIST,AC=1,RENT,REFR',
//             COND=(4,LT)
//SYSLIN   DD  DSN=&&OBJSET,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=VIO,SPACE=(1024,(50,20))
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=121,BLKSIZE=1210)
//SYSLIB   DD  DSN=SYS1.&SYSLEV..CSSLIB,DISP=SHR
//SYSLMOD  DD  DSN=SYS1.LINKLIB,DISP=SHR
   SETCODE AC(1)
   NAME  INSTSET(R)
//ASM    EXEC PGM=ASMA90,PARM=(OBJ,NODECK),COND=(4,LT)
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.&SYSLEV..AMODGEN,DISP=SHR
//         DD  DSN=SFT.INSTASM.ASM,DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=VIO,SPACE=(9999,(600,100))
//SYSUT2   DD  DSN=&&SYSUT2,UNIT=VIO,SPACE=(1700,(300,50))
//SYSUT3   DD  DSN=&&SYSUT3,UNIT=VIO,SPACE=(1700,(300,50))
//SYSPRINT DD  SYSOUT=*,DCB=BLKSIZE=1089
//SYSPUNCH DD  SYSOUT=B
//SYSLIN   DD  DSN=&&OBJSET,UNIT=SYSSQ,SPACE=(80,(200,50)),
//             DISP=(MOD,PASS)
//SYSIN    DD  DISP=SHR,DSN=SFT.INSTASM.ASM(INSTUJI)
//LKED    EXEC PGM=IEWL,PARM='XREF,LIST,RENT,REFR',
//             COND=(4,LT,ASM)
//SYSLIN   DD  DSN=&&OBJSET,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=VIO,SPACE=(1024,(50,20))
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=121,BLKSIZE=1210)
//SYSLIB   DD  DSN=SYS1.&SYSLEV..CSSLIB,DISP=SHR
//SYSLMOD  DD  DSN=SYS1.LINKLIB,DISP=SHR
   NAME  INSTUJI(R)
