DISTEST  CSECT
         USING DISTEST,R15
         STM   R14,R12,12(R13)                      000000 90ECD00C
         LR    R3,R15                               000004 183F
A000005  EQU   *-1
         DROP  R15
         USING DISTEST,R3
         LA    R4,4095(R3)                          000006 41430FFF
         LA    R4,1(R4)                             00000A 41440001
         LA    R15,SAVEAREA                         00000E 41F03038
         ST    R15,8(R13)                           000012 50FD0008
         ST    R13,4(R15)                           000016 50DF0004
         LR    R13,R15                              00001A 18DF
         B     EINST                                00001C 47F03080
         DC    CL24'DISTEST 03/25/0209.06   '       000020 C4C9E2E3...
SAVEAREA DC    XL16'00000000000000000000000000000000' 0038 00000000...
         DC    XL16'00000000000000000000000000000000' 0048 00000000...
         DC    XL16'00000000000000000000000000000000' 0058 00000000...
         DC    XL16'00000000000000000000000000000000' 0068 00000000...
         DC    XL8'0000000000000000'                000078 00000000...
EINST    UPT                                        000080 0102
RR1INST  BALR  R14,R15                              000082 05EF
         BCTR  R1,R10                               000084 061A
         MVCL  R0,R2                                000086 0E02
         CLCL  R6,R12                               000088 0F6C
RR2INST  SVC   251           UNKNOWN SVC            00008A 0AFB
         SVC   2             POST/PRTO              00008C 0A02
         SVC   25            TRKBAL                 00008E 0A19
RR3INST  EQU   *
MYLBL90  SPM   R13                                  000090 04D0
         SPM   R4                                   000092 0440
RR4INST  NOPR  R15                                  000094 070F
         BCR   1,R14                                000096 071E
         BCR   2,R13                                000098 072D
         BCR   3,R12                                00009A 073C
         BCR   4,R11                                00009C 074B
         BCR   5,R10                                00009E 075A
         BCR   6,R9                                 0000A0 0769
         BCR   7,R8                                 0000A2 0778
         BCR   8,R7                                 0000A4 0787
         BCR   9,R6                                 0000A6 0796
         BCR   10,R5                                0000A8 07A5
         BCR   11,R4                                0000AA 07B4
         BCR   12,R3                                0000AC 07C3
         BCR   13,R2                                0000AE 07D2
         BCR   14,R1                                0000B0 07E1
         BR    0                                    0000B2 07F0
RRE1INST IPTE  R1,R2                                0000B4 B2210012
         IVSK  R9,R10                               0000B8 B223009A
         PT    R11,R8                               0000BC B22800B8
         ISKE  R14,R15                              0000C0 B22900EF
RRE2INST IPM   R1                                   0000C4 B2220010
         IAC   R14                                  0000C8 B22400E0
RRE3INST PALB                                       0000CC B2480000
RRF1INST MAEBR R1,R3,R0                             0000D0 B30E1032
         MSEBR R10,R13,R0                           0000D4 B30FA0DC
         MADBR R4,R13,R0                            0000D8 B31E40D9
         MSDBR R11,R7,R0                            0000DC B31FB07D
RRF2INST FIXBR R1,1,R9                              0000E0 B3471019
         DC    XL4'B350E0AD'                        0000E4 B350E0AD
         TBDR  R1,4,R12                             0000E8 B351401C
         FIEBR R14,5,R6                             0000EC B35750E6
RRF3INST DIEBR R1,R3,R2,0                           0000F0 B3533012
         DIDBR R15,R14,R13,1                        0000F4 B35BE1FD
RX1INST  STH   R1,A0002C8                           0000F8 401032C8
         LA    R15,MYLBL2CA                         0000FC 41F032CA
         STC   R4,A0002CC(R7)                       000100 424732CC
         IC    R13,A000314(R5)                      000104 43D53314
         EX    R2,A000005(R4)                       000108 44243005
         BAL   R10,250(,R9)                         00010C 45A090FA
         BCT   R14,128(R2)                          000110 46E20080
RX2INST  NOP   A000118                              000114 47003118
A000118  BC    1,A00011C(R1)                        000118 4711311C
A00011C  BC    2,A000120                            00011C 47203120
A000120  BC    3,A000124(R10)                       000120 473A3124
A000124  BC    4,54(R7)                             000124 47470036
         BC    5,MYLBL12C(R12)                      000128 475C312C
MYLBL12C BC    6,128(R4,R2)                         00012C 47642080
         BC    7,A000134(R6)                        000130 47763134
A000134  BC    8,16(,R5)                            000134 47805010
         BC    9,A00013C(R3)                        000138 4793313C
A00013C  BC    11,A000140                           00013C 47B03140
A000140  BC    12,A000144(R4)                       000140 47C43144
A000144  BC    13,4(R2,R4)                          000144 47D24004
         BC    14,8(,R6)                            000148 47E06008
         B     0(R1)                                00014C 47F10000
RXEINST  LDEB  R1,122(R4,R8)                        000150 ED14807A0004
         LXDB  R12,0(,R12)                          000156 EDC0C0000005
         LXEB  R9,A000324                           00015C ED9033240006
         MXDB  R1,A000328(R8)                       000162 ED1833280007
         KEB   R12,9(R5)                            000168 EDC500090008
RXFINST  MAEB  R1,R3,100(R4,R7)                     00016E ED347064100E
         MSEB  R12,R13,A000338                      000174 EDD03338C00F
         MADB  R7,R12,RXFINST(R11)                  00017A EDCB316E701E
         MSDB  R1,R6,33(,R12)                       000180 ED60C021101F
RS1INST  BXH   R1,R3,20(R6)                         000186 86136014
         BXLE  R10,R14,A00018E                      00018A 87AE318E
A00018E  STM   R0,R15,A000348                       00018E 900F3348
         LM    R15,R6,A000388                       000192 98F63388
         DC    XL2'8810'                            000196 8810
         STD   R15,2464(R10,R8)                     000198 60FA89A0
         DC    XL2'000C'                            00019C 000C
         SRA   R13,7                                00019E 8AD00007
         DC    XL4'8B90E02C'                        0001A2 8B90E02C
RS3INST  ICM   R1,1,A0003A8                         0001A6 BF1133A8
         ICM   R2,15,45(R2)                         0001AA BF2F202D
         ICM   R7,13,40(R13)                        0001AE BF7DD028
         ICM   R5,8,A0003A9                         0001B2 BF5833A9
         ICM   R13,7,56                             0001B6 BFD70038
RSIINST  BRXH  R1,R3,*+16                           0001BA 84130008
         BRXLE R10,R11,*+12                         0001BE 85AB0006
         BRXH  R1,R3,*-8                            0001C2 8413FFFC
         BRXLE R10,R11,*-16                         0001C6 85ABFFF8
RIINST   TMH   R1,X'02BC'                           0001CA A71002BC
         TML   R10,X'0003'                          0001CE A7A10003
         BRC   R1,*-64                              0001D2 A714FFE0
         BRAS  R9,*+4                               0001D6 A7950002
SIINST   TM    A0003AA,X'50'                        0001DA 915033AA
         MVI   0(R8),X'02'                          0001DE 92028000
         NI    SIINST,X'C1'                         0001E2 94C131DA
         CLI   A0003AB,X'01'                        0001E6 950133AB
S1INST   SSM   A0003AC                              0001EA 800033AC
         LPSW  A0003B0                              0001EE 820033B0
         TS    5(R7)                                0001F2 93007005
         STIDP 256(R12)                             0001F6 B202C100
         SCK   240(R4)                              0001FA B20440F0
         STCK  40(R9)                               0001FE B2059028
S2INST   IPK                                        000202 B20B0000
         PTLB                                       000206 B20D0000
         CSCH                                       00020A B2300000
         HSCH                                       00020E B2310000
         SAL                                        000212 B2370000
         RSCH                                       000216 B2380000
         RCHP                                       00021A B23B0000
         SCHM                                       00021E B23C0000
SS1INST  MVN   A0003B8(18),A0003CA                  000222 D11133B833CA
         MVC   2(12,R4),9(R8)                       000228 D20B40028009
         MVZ   A0003EB(12),7(R9)                    00022E D30B33EB9007
         NC    2031(245,R5),A0003FF                 000234 D4F457EF33FF
SS2INST  MVO   A0004F4(5),A0004F9(4)                00023A F14334F434F9
         PACK  4(3,R5),2(7,R12)                     000240 F2265004C002
         UNPK  A0004FF(4),0(6,R9)                   000246 F33534FF9000
         ZAP   12(5,R8),A000506(4)                  00024C F843800C3506
SS3INST  PLO   R1,A00050A,R7,A00050F                000252 EE17350A350F
         PLO   R12,34(R6),R9,A000514                000258 EEC960223514
         PLO   R8,12(R9),R13,63(R2)                 00025E EE8D900C203F
         PLO   R4,A000519,R1,12(R12)                000264 EE413519C00C
SS4INST  MVCK  A000520(R8),A000528,R9               00026A D98935203528
         MVCP  12(R1,R2),34(R7),R4                  000270 DA14200C7022
         MVCS  A000530,128(R8),R15                  000276 DB0F35308080
SS5INST  SRP   A000538(5),64-32,5                   00027C F04535380020
         SRP   A00053D(3),31,5                      000282 F025353D001F
         SRP   73(7,R4),64-1,5                      000288 F0654049003F
         SRP   4(5,R6),1,5                          00028E F04560040001
         SRP   3(5,R9),0,5                          000294 F04590030000
         DC    XL2'F046'                            00029A F046
         LEDR  R3,R8                                00029C 3538
         DC    XL2'0020'                            00029E 0020
         DC    XL2'F044'                            0002A0 F044
         LEDR  R3,R8                                0002A2 3538
         DC    XL2'0020'                            0002A4 0020
         DC    XL2'F025'                            0002A6 F025
         LEDR  R1,R13                               0002A8 351D
         DC    XL2'009F'                            0002AA 009F
SSEINST  LASP  A000540,A000554                      0002AC E50035403554
         TPROT A000580,6(R7)                        0002B2 E50135807006
         MVCSK 32(R15),A000564                      0002B8 E50EF0203564
         MVCDK 12(R7),15(R2)                        0002BE E50F700C200F
         DC    XL4'00000000'                        0002C4 00000000
A0002C8  DC    XL2'0001'                            0002C8 0001
MYLBL2CA DC    XL2'0002'                            0002CA 0002
A0002CC  DC    XL16'000C000C000C000C000C000C000C000C' 02CC 000C000C...
         DC    XL16'000C000C000C000C000C000C000C000C' 02DC 000C000C...
         DC    XL16'000C000C000C000C000C000C000C000C' 02EC 000C000C...
         DC    XL16'000C000C000C000C000C000C000C000C' 02FC 000C000C...
         DC    XL8'000C000C000C000C'                00030C 000C000C...
A000314  DC    XL16'00010002000300040005000600070000' 0314 00010002...
A000324  DC    XL4'431F4000'                        000324 431F4000
A000328  DC    XL16'4612D687000000003800000000000000' 0328 4612D687...
A000338  DC    XL16'41C0000000000000432853B2FEC56D5D' 0338 41C00000...
A000348  DC    AL4(A000388)                         000348 00000388
NOLBL34C EQU   *,004
         DC    VL4(SUBRTN)                          00034C 00000000
         DC    XL1'80'                              000350 80
         DC    AL3(A000506)                         000351 000506
         DC    XL16'00000000000000000000000000000000' 0354 00000000...
         DC    XL16'00000000000000000000000000000000' 0364 00000000...
         DC    XL16'00000000000000000000000000000000' 0374 00000000...
NOLBL384 DC    XL4'00000000'                        000384 00000000
A000388  DC    XL16'00000064000000640000006400000064' 0388 00000064...
         DC    XL16'00000064000000640000006400000064' 0398 00000064...
A0003A8  DC    CL1'X'                               0003A8 E7
A0003A9  DC    XL1'E9'                              0003A9 E9
A0003AA  DC    XL1'D2'                              0003AA D2
A0003AB  DC    XL1'00'                              0003AB 00
A0003AC  DC    XL4'80000000'                        0003AC 80000000
A0003B0  DC    XL8'0000000000000000'                0003B0 00000000...
A0003B8  DC    CL18'A Z B Y L M Q     '             0003B8 C140E940...
A0003CA  DC    CL32'S T U V                         ' 03CA E240E340...
         DC    CL1' '                               0003EA 40
A0003EB  DC    CL20'A B C D             '           0003EB C140C240...
A0003FF  DC    XL16'80808080808080808080808080808080' 03FF 80808080...
         DC    XL16'80808080808080808080808080808080' 040F 80808080...
         DC    XL16'80808080808080808080808080808080' 041F 80808080...
         DC    XL16'80808080808080808080808080808080' 042F 80808080...
         DC    XL16'80808080808080808080808080808080' 043F 80808080...
         DC    XL16'80808080808080808080808080808080' 044F 80808080...
         DC    XL16'80808080808080808080808080808080' 045F 80808080...
         DC    XL16'80808080808080808080808080808080' 046F 80808080...
         DC    XL16'80808080808080808080808080808080' 047F 80808080...
         DC    XL16'80808080808080808080808080808080' 048F 80808080...
         DC    XL16'80808080808080808080808080808080' 049F 80808080...
         DC    XL16'80808080808080808080808080808080' 04AF 80808080...
         DC    XL16'80808080808080808080808080808080' 04BF 80808080...
         DC    XL16'80808080808080808080808080808080' 04CF 80808080...
         DC    XL16'80808080808080808080808080808080' 04DF 80808080...
         DC    XL5'8080808080'                      0004EF 80808080...
A0004F4  DC    XL5'000000017C'                      0004F4 00000001...
A0004F9  DC    XL5'0000010321'                      0004F9 00000103...
         DC    CL1'@'                               0004FE 7C
A0004FF  DC    CL6'000000'                          0004FF F0F0F0F0...
         DC    XL1'C0'                              000505 C0
A000506  DC    XL4'0112233C'                        000506 0112233C
A00050A  DC    CL5'ABCDE'                           00050A C1C2C3C4...
A00050F  DC    CL5'WXYZ '                           00050F E6E7E8E9...
A000514  DC    CL5'FGH  '                           000514 C6C7C840...
A000519  DC    CL5'ST   '                           000519 E2E34040...
         DC    XL2'0000'                            00051E 0000
A000520  DC    XL8'427B000000000000'                000520 427B0000...
A000528  DC    XL8'431C800000000000'                000528 431C8000...
A000530  DC    XL8'4331500000000000'                000530 43315000...
A000538  DC    XL5'000000000C'                      000538 00000000...
A00053D  DC    XL3'00000C'                          00053D 00000C
A000540  DC    CL20'SSE TARGET FIELD    '           000540 E2E2C540...
A000554  DC    CL16'SSE SOURCE FIELD'               000554 E2E2C540...
A000564  DC    CL28'ANOTHER SSE SOURCE          '   000564 C1D5D6E3...
A000580  DC    CL2'AN'                              000580 C1D5
         OC    2245(228,R12),2368(R13)              000582 D6E3C8C5D940
         DC    CL6'SSE TA'                          000588 E2E2C540...
         MVCK  1507(R12,R12),64(R4),R7              00058E D9C7C5E34040
         STH   R4,64(,R4)                           000594 40404040
         STH   R4,64(,R4)                           000598 40404040
         STH   R4,64(,R4)                           00059C 40404040
R0       EQU   0
R1       EQU   1
R2       EQU   2
R3       EQU   3
R4       EQU   4
R5       EQU   5
R6       EQU   6
R7       EQU   7
R8       EQU   8
R9       EQU   9
R10      EQU   10
R11      EQU   11
R12      EQU   12
R13      EQU   13
R14      EQU   14
R15      EQU   15
         END
