//T800960Y JOB (99999,T),'JOHN SOSTROM',CLASS=I,MSGCLASS=X,
//         NOTIFY=T800960
//*-------------------------------------------------------------------*
//*                                                                   *
//* ASSEMBLE AND LINK SESSION 00 PARAMETERS                           *
//*                                                                   *
//*-------------------------------------------------------------------*
//JSTP0010 EXEC ASMHCL
//C.SYSLIB  DD DSN=SYSPOPRD.INFO.BLGMACS,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=SYS1.AMODGEN,DISP=SHR
//C.SYSIN   DD DSN=SYSPOPRD.LISTCAT.SOURCE(INFSS00),DISP=SHR
//L.SYSLMOD DD DSN=SYSPOPRD.INFO.LINKLIB,DISP=SHR
//L.SYSIN   DD *
 ENTRY BLGVDSN
 NAME BLGSES00(R)
//*-------------------------------------------------------------------*
//*                                                                   *
//* ASSEMBLE AND LINK SESSION 11 PARAMETERS                           *
//*                                                                   *
//*-------------------------------------------------------------------*
//JSTP0020 EXEC ASMHCL
//C.SYSLIB  DD DSN=SYSPOPRD.INFO.BLGMACS,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=SYS1.AMODGEN,DISP=SHR
//C.SYSIN   DD DSN=SYSPOPRD.LISTCAT.SOURCE(INFSS11),DISP=SHR
//L.SYSLMOD DD DSN=SYSPOPRD.INFO.LINKLIB,DISP=SHR
//L.SYSIN   DD *
 ENTRY BLGVDSN
 NAME BLGSES11(R)
