)ATTR
 _ TYPE(INPUT)  INTENS(HIGH) CAPS(ON)  JUST(LEFT)  COLOR(TURQ)
 ! TYPE(INPUT)  INTENS(HIGH) CAPS(ON)  JUST(LEFT)  COLOR(TURQ) PAD('.')
 $ TYPE(OUTPUT) INTENS(LOW)  CAPS(OFF) JUST(LEFT)
 @ TYPE(OUTPUT) INTENS(LOW)  CAPS(OFF) JUST(ASIS)
 ~ TYPE(OUTPUT) INTENS(LOW)  CAPS(OFF) JUST(RIGHT) COLOR(GREEN)
 | TYPE(OUTPUT) INTENS(LOW)  CAPS(OFF) JUST(LEFT)  COLOR(GREEN)
 * TYPE(OUTPUT) INTENS(LOW)  CAPS(OFF) JUST(RIGHT) COLOR(RED)
 # TYPE(OUTPUT) INTENS(LOW)  CAPS(OFF) JUST(ASIS)  COLOR(GREEN)
 ` TYPE(OUTPUT) INTENS(LOW)  CAPS(OFF) JUST(RIGHT)
 % TYPE(TEXT)   INTENS(HIGH)
 + TYPE(TEXT)   INTENS(LOW)
 { TYPE(TEXT)   INTENS(LOW)  CAPS(OFF) JUST(LEFT)  COLOR(TURQ)
 } TYPE(TEXT)   INTENS(LOW)  CAPS(OFF) JUST(LEFT)  COLOR(GREEN)
)BODY EXPAND(\\)
                       +LPALNK Post CLPA Modules -$LLMODE
}Command ===>_ZCMD                                            }Scroll ===>_ZSCML
{  Actions:    Primary(L-Locate) Line(S-Select)
+
{     R24C       R24S   RANYC      RANYS    MODC       MODS    ALIC
  *Z      *Z         *Z      *Z         *Z      *Z         *Z      +LPA
  *Z      *Z         *Z      *Z         *Z      *Z         *Z      +LPALST
  *Z      *Z         *Z      *Z         *Z      *Z         *Z      +LNKLST
  *Z      *Z         *Z      *Z         *Z      *Z         *Z      +Total
+
{  Name         Size Location   Alias-of AC  AM  RM ---Attributes-- Product
)MODEL
!Z@Z       ~Z       |Z         |Z       |Z ~Z  ~Z  #Z              |Z
)INIT
 VGET (ZSCML) PROFILE
 IF (&ZSCML = ' ')
    &ZSCML = 'CSR'
 &Z1       = 'T124C,T124S,T1ANC,T1ANS,T1MOC,T1MOS,T1ALC'
 &Z2       = 'T224C,T224S,T2ANC,T2ANS,T2MOC,T2MOS,T2ALC'
 &Z3       = 'T324C,T324S,T3ANC,T3ANS,T3MOC,T3MOS,T3ALC'
 &Z4       = 'T424C,T424S,T4ANC,T4ANS,T4MOC,T4MOS,T4ALC'
 &Z5       = 'LLPCMLC,LLMNAME,LLSIZE,LLLOC,LLALIAS'
 &Z6       = 'LLAC,LLAM,LLRM,LLATTR,LLPROD'
 .ZVARS    = '(&Z1,&Z2,&Z3,&Z4,&Z5,&Z6)'
 &M1       = '********************'
 &M2       = '************ End of Modules ************'
 &ZTDMARK  = '&M1&M2&M1'
 &ZCMD     = ' '
 &LLPCMLC  =' '
)REINIT
 &LLPCMLC  =' '
)PROC
 VPUT (ZSCML) PROFILE
 VER(&LLPCMLC,LIST,S)
)END
