/* rexx */
Rexx_DRISFAP2:
  rexxpgm_version = "01.01"           /* ver lev */

  PARSE ARG all_my_arguments

/* <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
=======================================================================
 This code drives Initialization, Process, and Termination routines.
=======================================================================
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> */
Main_Routine:
  return_code = Initialization_Routine()
  IF (return_code = 0) THEN DO
    return_code = Process_Routine()
  END
  return_code = Termination_Routine()
  RETURN return_code

/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

 Dataset:  DEMO.REXX(DRISFAP2)
 Author:   KTomiak
 Contact:  "Kenneth Tomiak"<CBT_Ken@KTomiak.BIZ>
 Syntax:   %DRISFAP2 |isfprefix|
 Overview: Capture all matching jobnames to a sequential dataset
           in IEBUPDTE format.

=======================================================================

 History of Modifications
 ------------------------
vv.mm WHEN     Who / What you did ... (Newest change at the top.)
----- -------- --------------------------------------------------------
01.01 20180428 KTOMIAK "Kenneth Tomiak"<CBT_Ken@KTomiak.BIZ>
               1) Stylize using template $putktm:
                  Programming Using The Kenneth Tomiak Method.
               2) Stylize using Edit Macro @putktm:
                  Programming Using The Kenneth Tomiak Method.
----- -------- --------------------------------------------------------
01.00 20090627 KTomiak  Original code basd on DRISFAPI.
----- -------- --------------------------------------------------------

-----------------------------------------------------------------------

STANDARD GLOBAL DISCLAIMER
--------------------------
The author explicitly disavows any claim whatsoever about the
correctness or functionality of this program, and disclaims liability
for anything and everything bad that might happen in connection with,
before, during, or after using it. I have tried to make it work right,
and I am personally pretty confident that it does, but everybody makes
mistakes, so if you use it, you do so at your own risk.

=======================================================================
<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< */

/* <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
=======================================================================
 This routine initializes constants and variables.
=======================================================================
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> */
Initialization_Routine:
  return_code = 0
  PARSE VERSION,
    version_rexx_name,
    version_rexx_version,
    version_rexx_date
  PARSE SOURCE,
    source_host_env,
    source_call_type,
    source_uc_exec_name,
    source_hostdd,
    source_hostdsn,
    source_nf_exec_name,
    source_initial_cmd_env,
    source_asid_name,
    source_char8_user_token,
    source_hostother
  mvsvar_sysname = MVSVAR("SYSNAME")
  sysvar_syspref = SYSVAR("SYSPREF")
  sysvar_sysuid = SYSVAR("SYSUID")
  sysvar_sysenv = SYSVAR("SYSENV")
  sysvar_sysispf = SYSVAR("SYSISPF")
  SAY ""
  SAY COPIES("=",77)
  SAY LEFT("=" source_uc_exec_name rexxpgm_version,77) "="
  SAY LEFT("= executing under" source_host_env,77) "="
  SAY LEFT("= as a" source_call_type,77) "="
  SAY LEFT("= on" DATE() "at" TIME()".",77) "="
  SAY COPIES("=",77)
  SAY LEFT("= SYSNAME" mvsvar_sysname,77) "="
  SAY LEFT("= SYSPREF" sysvar_syspref,77) "="
  SAY LEFT("= SYSUID" sysvar_sysuid,77) "="
  SAY LEFT("= SYSENV" sysvar_sysenv,77) "="
  SAY LEFT("= SYSISPF" sysvar_sysispf,77) "="
  IF (sys_sysispf <> "ACTIVE") THEN DO
    SAY "You must be using ISPF to use COLSHELP."
  END
  SAY COPIES("=",77)
  PARSE VAR all_my_arguments isfprefix +8 .
  isfprefix = SPACE(isfprefix,0)
  SAY LEFT("= JOB Prefix:" isfprefix,77) "="
  SAY COPIES("=",77)
  SAY ""
  return_code = 0

  IF (source_host_env <> "TSO") THEN DO
    SAY "Wrong host environment" source_host_env
    return_code = 16
    RETURN return_code
  END

  isfcalls_rc = ISFCALLS("ON")
  SAY "ISFcalls RC("isfcalls_rc")"
  IF (isfcalls_rc <> 0) THEN DO
    SAY "ISFCALLS("ON") failed, RC("isfcalls_rc")."
    return_code = 16
    RETURN return_code
  END

/* <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
00 Function completed successfully
01 Host command environment query failed, environment not added
02 Host command environment add failed
03 Host command environment delete failed
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> */

  ADDRESS MVS ,
    "EXECIO * DISKR SYSIN (STEM myinput. FINIS)"

  ps_dsname = WORD(myinput.1,1)
  apost_dsn = "'"ps_dsname"'"
  dsi_rc =  Check_Dsname("ps_")  /* ps_ will prepend variables. */

  IF (dsi_rc > 4) THEN DO
    IF (ps_sysreason > 0) THEN DO
      SAY source_uc_exec_name": ERROR:" ps_sysreason":" apost_dsn
      SAY source_uc_exec_name":             " ps_sysmsglvl1
      SAY source_uc_exec_name":             " ps_sysmsglvl2
      return_code = sysreason
    END
    ELSE DO
      "ALLOC FILE(PS) DATASET('"ps_dsname"')",
        "NEW CATALOG UNIT(SYSALLDA) SPACE(5000, 5000) TRACKS",
        "DSORG(PS) RECFM(V B A) BLKSIZE(0) LRECL(255)"
      alloc_rc = RC
      IF (alloc_rc <> 0) THEN DO
        SAY "Allocate of" ps_dsname "failed."
        return_code = 16
        RETURN return_code
      END
      apost_dsn = "'"ps_dsname"'"
    END
  END
  ELSE DO
    "ALLOC FILE(PS) DATASET('"ps_dsname"') MOD"
  END
  dsi_rc =  Check_Dsname("ps_")  /* ps_ will prepend variables. */
  SAY "ALLOC="ps_sysalloc

  ADDRESS SDSF "ISFEXEC WHO"
  sdsf_rc = RC
  IF (sdsf_rc > 8) THEN DO
    SAY "sdsf RC("sdsf_rc")"
    show_rc = Show_Isf_Message()
    SAY "DIAG("isfdiag")"
    return_code = sdsf_rc
    RETURN return_code
  END
  IF (isfresp.0 > 0) THEN DO
    SAY "Output from WHO:"
    DO _ix = 1 TO isfresp.0
      SAY "  "isfresp._ix
    END
  END
  ELSE DO
    SAY "WHO worked but had no output."
    SAY "HOW can that be?"
    SAY "Ow  the last shift-logical-left combination."
    SAY ""
  END

/* <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> */
  ADDRESS SDSF "ISFEXEC COLSHELP (VERBOSE)"
  sdsf_rc = RC
  IF (sdsf_rc > 8) THEN DO
    SAY "sdsf RC("sdsf_rc")"
    show_rc = Show_Isf_Message()
    SAY "DIAG("isfdiag")"
    SAY "Oh well, I tried."
    SAY ""
  END
  SAY "COLUMNS:" ISFCOLS
  SAY "TITLES: " ISFTITLES
  IF (isfresp.0 > 0) THEN DO
    SAY "Output from COLSHELP:"
    DO _ix = 1 TO isfresp.0
      SAY "  "isfresp._ix
    END
  END
  ELSE DO
    SAY "COLSHELP worked but had no output."
    SAY "HOW can that be?"
    show_rc = Show_Isf_Message()
    SAY "DIAG("isfdiag")"
    SAY "OWH the last shift-logical-left combination."
    SAY ""
  END
/* <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> */

  write_rc = 0

  RETURN return_code

/* <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
=======================================================================
 This routine does the processing.
=======================================================================
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> */

/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

  SDSF command:
  -------------
  isfserver  = "SDSF"
  isfjesname = "IP7JES2"

  Filter commands:
  ----------------
  isfdest = ""
  isffilter = ""
  isfinput = ""
  isfowner = ""
  isfprefix = ""
  isfsysname = ""

  OPTIONS commands:
  -----------------
  isfactions
  isfcons
  isfdelay
  isfdisplay
  isfinput
  isfchars
  isftimeout

  Trace commands:
  ---------------
  isftrace
  isftrmask

  Messages:
  ---------
  isfmsg
  isfmsg2.
  isfjesname = "IP7JES2"
<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< */
Process_Routine:
  SAY ""
/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
  isfcols = "JNAME TOKEN POS JOBID OWNERID DSDATE RETCODE"
<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< */
  ADDRESS SDSF "ISFEXEC H (ALTERNATE DELAYED VERBOSE)"
/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
00 The request completed successfully.
08 An incorrect or invalid parameter was specified for an
   option or command.
12 A SYNTAX ERROR occurred parsing a host environment command.
16 The user is not authorized to invoke SDSF.
20 A request failed due to an environmental error.
24 Insufficient storage was available to complete a request.
<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< */
  sdsf_rc = RC
  SAY "COLUMNS:" ISFCOLS
  SAY "D-COLs :" ISFDCOLS
  SAY "D-COLs2:" ISFDCOLS2
  SAY "R-COLs :" ISFRCOLS
  SAY "U-COLs :" ISFUCOLS
  SAY "U-COLs2:" ISFUCOLS2
  SAY "Display:" ISFDISPLAY
  SAY "Sort:  :" ISFSORT
  SAY "TITLES: " ISFTITLES
  SAY "TLine:  " ISFTLINE
  SAY "Rows:   " ISFROWS
  IF (sdsf_rc > 8) THEN DO
    SAY "sdsf RC("sdsf_rc")"
    show_rc = Show_Isf_Message()
    SAY "DIAG("isfdiag")"
    return_code = sdsf_rc
    RETURN return_code
  END

  IF (isfrows = 0) THEN DO
    SAY ""
    SAY "No rows returned, sorry. Play again?"
    SAY ""
    return_code = 1214
  END
  ELSE DO
    SAY "Output from H has" isfrows "rows."
    this_job_name = WORD(isfcols,1)
    this_job_nbr  = WORD(isfcols,4)

    DO job_ctr = 1 TO JNAME.0
      SAY "Job:" VALUE(this_job_name"."job_ctr) JOBID.job_ctr,
        OWNERID.job_ctr DSDATE.job_ctr RETCODE.job_ctr
      get_rc = Get_All_Output()
      IF (get_rc <> 0) THEN DO
        SAY "Error in Get_All_Output, RC("get_Rc")."
        job_ctr = Show_Remainder()
        return_code = get_rc
        RETURN return_code
      END
    END
  END

  RETURN return_code

/* <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
=======================================================================
 This routine does cleanup before exiting.
=======================================================================
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> */
Termination_Routine:
  RC = ISFCALLS("OFF")
  "EXECIO 0 DISKW PS (FINIS"
  IF (Sysvar_SYSISPF = "ACTIVE") THEN DO
    ZISPFRC = return_code
    ADDRESS ISPEXEC "VPUT (ZISPFRC) SHARED"
  END
  RETURN return_code

/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
 Loop through and show what was not processed.
<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< */
Show_Remainder:
  DO _my_ctr = job_ctr TO JNAME.0
    SAY "Job:" VALUE(this_job_name"."_my_ctr) JOBID._my_ctr,
      OWNERID._my_ctr DSDATE._my_ctr RETCODE._my_ctr
  END
  RETURN _my_ctr

/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
 Loop through each job and get the output.
<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< */
  /*****************************************/
  /* Issue the ? (JDS) action against the  */
  /* row to list the data sets in the job. */
  /*****************************************/
    /*****************************************/
    /* Process each DDNAME of the job.       */
    /*****************************************/
      /*****************************************************/
      /* Read the records from the data set and list them. */
      /* The ddname for each allocated data set will be in */
      /* the isfddname stem.  Since the SA action was done */
      /* from JDS, only one data set will be allocated.    */
      /*****************************************************/
    /*****************************************/
  /*****************************************/
Get_All_Output:
  IF (write_rc > 1) then return write_rc
  get_rc = 0
  ADDRESS SDSF "ISFACT H TOKEN('"TOKEN.job_ctr"') PARM(NP SA)" ,
    "( prefix jds_"
  isfact_rc = RC
  IF (LEFT(isfmsg2.2,7) = "ISF747E") THEN DO
    SAY "It is not nice to purge output while I am running."
    SAY "This is your only warning you do not play nice with others."
    RETURN 0
  END
  IF (isfact_rc <> 0) THEN DO
    SAY "Error in PARM(NP SA), RC("isfact_rc")."
    show_rc = Show_Isf_Message()
    return_code = isfact_rc
    RETURN return_code
  END

  _jobname = jobid.job_ctr
  updte.0=1
  updt = "./"_jobname "ADD NAME="_jobname ,
    jname.job_ctr","||,
    DSDATE.job_ctr",RC("RETCODE.job_ctr"),"||,
    ownerid.job_ctr
  updte.1 = LEFT(updt,72)
  "EXECIO" updte.0 "DISKW PS (STEM updte."
  write_rc = RC
  IF (write_rc > 1) THEN DO
    SAY ""
    SAY "You are going to need a bigger data set."
    SAY "Write of updte.1 failed."
    SAY ""
    return_code = write_rc
    RETURN return_code
  END

  DO isf_dd_ctr = 1 TO isfddname.0
    SAY "    " isfdsname.isf_dd_ctr
 /* ????????.ERASCA00.JOB00824.D0000002.JESMSGLG */
 /* ownerid  jobname  jobnbr   ddnbr    ddname   */
    PARSE VAR isfdsname.isf_dd_ctr,
      job_ownerid "." ,
      job_jobname ".",
      job_jobnbr "." ,
      job_ddnbr  "." ,
      job_ddname "."      .
    myline.0 = 5
    myline.1 = " "
    myline.2 = "1"COPIES("*",135)
    myline.3 = "                " job_jobnbr"-"job_ddnbr"-"job_ddname
    myline.4 = "1"COPIES("*",135)
    myline.5 = " "
    ADDRESS MVS ,
      "EXECIO" myline.0 "DISKW PS (STEM myline."
    write_rc = RC
    IF (write_rc > 1) THEN DO
      SAY ""
      SAY "You are going to need a bigger data set."
      SAY "Write of myline.0 failed."
      SAY ""
      return_code = write_rc
      RETURN return_code
    END

    ADDRESS MVS ,
      "EXECIO * DISKR" isfddname.isf_dd_ctr "(STEM line. FINIS"

    ADDRESS MVS ,
      "EXECIO" line.0 "DISKW PS (STEM line."
    write_rc = RC
    IF (write_rc > 1) THEN DO
      SAY ""
      SAY "You are going to need a bigger data set."
      SAY "Write of line.0 failed."
      SAY ""
      return_code = write_rc
      RETURN return_code
    END

  END
  RETURN get_rc

/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
 Show extended ERROR help.
<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< */
Show_Isf_Message:
  SAY "isfmsg is:" isfmsg
  IF (isfmsg2.0 > 0) THEN DO
    DO isfmsg_ctr = 1 TO isfmsg2.0
      SAY "isfmsg2."isfmsg_ctr "is:" isfmsg2.isfmsg_ctr
    END
  END
  RETURN 0

/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
 Use listdsi to see if data set exists, if so we mod to it.
<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< */
Check_Dsname:
  var_prefix = ARG(1)
  dsi_opt = "DIRECTORY RECALL SMSINFO" /* last-reference date updated */
  quietly = MSG("OFF")
  dsi_rc = LISTDSI(apost_dsn dsi_opt)
  quietly = MSG("ON")
  IF (dsi_rc > 4) THEN DO
    IF (sysreason > 0) THEN DO
      RETURN sysreason
    END
  END
  null = VALUE(var_prefix"rc",rc          )
  null = VALUE(var_prefix"sysdsname",SYSDSNAME   )
  null = VALUE(var_prefix"sysvolume",SYSVOLUME   )
  null = VALUE(var_prefix"sysunit",SYSUNIT     )
  null = VALUE(var_prefix"sysdsorg",SYSDSORG    )
  null = VALUE(var_prefix"sysrecfm",SYSRECFM    )
  null = VALUE(var_prefix"syslrecl",SYSLRECL    )
  null = VALUE(var_prefix"sysblksize",SYSBLKSIZE  )
  null = VALUE(var_prefix"syskeylen",SYSKEYLEN   )
  null = VALUE(var_prefix"sysalloc",SYSALLOC    )
  null = VALUE(var_prefix"sysused",SYSUSED     )
  null = VALUE(var_prefix"sysusedpages",SYSUSEDPAGES)
  null = VALUE(var_prefix"sysprimary",SYSPRIMARY  )
  null = VALUE(var_prefix"sysseconds",SYSSECONDS  )
  null = VALUE(var_prefix"sysunits",SYSUNITS    )
  null = VALUE(var_prefix"sysextents",SYSEXTENTS  )
  null = VALUE(var_prefix"syscreate",SYSCREATE   )
  null = VALUE(var_prefix"sysrefdate",SYSREFDATE  )
  null = VALUE(var_prefix"sysexdate",SYSEXDATE   )
  null = VALUE(var_prefix"syspassword",SYSPASSWORD )
  null = VALUE(var_prefix"sysracfa",SYSRACFA    )
  null = VALUE(var_prefix"sysupdated",SYSUPDATED  )
  null = VALUE(var_prefix"systrkscyl",SYSTRKSCYL  )
  null = VALUE(var_prefix"sysblkstrk",SYSBLKSTRK  )
  null = VALUE(var_prefix"sysadirblk",SYSADIRBLK  )
  null = VALUE(var_prefix"sysudirblk",SYSUDIRBLK  )
  null = VALUE(var_prefix"sysmembers",SYSMEMBERS  )
  null = VALUE(var_prefix"sysreason",SYSREASON   )
  null = VALUE(var_prefix"sysmsglvl1",SYSMSGLVL1  )
  null = VALUE(var_prefix"sysmsglvl2",SYSMSGLVL2  )
  null = VALUE(var_prefix"sysdssms",SYSDSSMS    )
  null = VALUE(var_prefix"sysdataclass",SYSDATACLASS)
  null = VALUE(var_prefix"sysstorclass",SYSSTORCLASS)
  null = VALUE(var_prefix"sysmgmtclass",SYSMGMTCLASS)
  RETURN 0
/*
     RC           (0=good, 4=partial, 16=failure)
     sysdsorg     (ps, psu, da, dau, is, isu, po, pou, vs)
     sysrecfm     (u, f, v, t, b, s, a, m)
     syscreate    yyyy/doy
     sysrefdate   yyyy/doy
     sysexdate    yyyy/doy
     syspassword  (none, read, write)
     sysracfa     (none, generic, discrete)
     sysupdated   (yes, no)
     systrkscyl   (for unit type)
     sysblkstrk   (for unit type)
*/

/* >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
=======================================================================
__DATA__
=======================================================================
<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< */
/*

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
CK     NAME        NAME
CK     OWNER       CheckOwner
CK     STATE       State
CK     STATUS      Status
CK     RESULT      RESULT
CK     DIAG1       Diag1
CK     DIAG2       Diag2
CK     DIAGFROM    DiagFrom
CK     GLOBAL      Global
CK     GLOBALSYS   GlobalSys
CK     EXCOUNT     ExcCount
CK     COUNT       RunCount
CK     FAIL        Fail
CK     SEVERITY    Severity                      X
CK     SEVCODE     SevCode
CK     WTOTYPE     WTOType                       X
CK     MODIFIED    ModifiedBy
CK     POLSTAT     PolicyStatus
CK     WTONUM      WTONum
CK     NUMCAT      NumCat
CK     CATEGORY    Category                      X
CK     CATEGORY2   Category2
CK     CATEGORY3   Category3
CK     CATEGORY4   Category4
CK     CATEGORY5   Category5
CK     CATEGORY6   Category6
CK     CATEGORY7   Category7
CK     CATEGORY8   Category8
CK     CATEGORY9   Category9
CK     CATEGORY10  Category10
CK     CATEGORY11  Category11
CK     CATEGORY12  Category12
CK     CATEGORY13  Category13
CK     CATEGORY14  Category14
CK     CATEGORY15  Category15
CK     CATEGORY16  Category16
CK     EXITNAME    ExitName
CK     MODNAME     ModName
CK     MSGNAME     MsgName
CK     USERDATE    UserDate                      X
CK     DEFDATE     DefDate
CK     DEBUG       Debug                         X
CK     DATEE       Start-Date-Time
CK     INTERVAL    Interval                      X
CK     SCHDATE     NextSch-Date-Time
CK     SCHINT      NextSch-Int
CK     LOGDATE     Log-Date-Time
CK     DELDATE     Deleted-Date-Time
CK     PROCNAME    ProcName
CK     STCID       TaskID
CK     REASON      Reason
CK     UPDREAS     UpdateReason
CK     PARMLEN     ParmLen
CK     PARM        Parameters
CK     SYSLEVEL    SysLevel
CK     SYSNAME     SysName
CK     EINTERVAL   EInterval                     X
CK     EXECNAME    ExecName
CK     LOCALE      Locale
CK     VERBOSE     Verbose                       X
CK     ORIGIN      Origin

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
DA     JNAME       JOBNAME
DA     STEPN       StepName
DA     PROCS       ProcStep
DA     JTYPE       Type
DA     JNUM        JNum
DA     JOBID       JobID
DA     OWNERID     Owner
DA     JCLASS      C
DA     POS         Pos
DA     DP          DP
DA     REAL        Real
DA     PAGING      Paging
DA     EXCPRT      SIO
DA     CPUPR       CPU%
DA     ASID        ASID
DA     ASIDX       ASIDX
DA     EXCP        EXCP-Cnt
DA     CPU         CPU-Time
DA     SWAPR       SR
DA     STATUS      Status
DA     SYSNAME     SysName
DA     SPAGING     Spag
DA     SCPU        SCPU%
DA     WORKLOAD    Workload
DA     SRVCLASS    SrvClass                      X
DA     PERIOD      SP
DA     RESGROUP    ResGroup
DA     SERVER      Server
DA     QUIESCE     Quiesce                       X
DA     ECPU        ECPU-Time
DA     ECPUPR      ECPU%
DA     CPUCRIT     CPUCrit
DA     STORCRIT    StorCrit
DA     RPTCLASS    RptClass
DA     MEMLIMIT    MemLimit
DA     TRANACT     Tran-Act
DA     TRANRES     Tran-Res
DA     SPIN        Spin                X
DA     SECLABEL    SecLabel
DA     GCPTIME     GCP-Time
DA     ZAAPTIME    zAAP-Time
DA     ZAAPCPTM    zACP-Time
DA     GCPUSE      GCP-Use%
DA     ZAAPUSE     zAAP-Use%
DA     SZAAP       SzAAP%
DA     SZIIP       SzIIP%

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
ENC    NAME        NAME
ENC    SSTYPE      SSType
ENC    STATUS      Status
ENC    ESRVCLS     SrvClass                      X
ENC    PERIOD      Per
ENC    PGN         PGN
ENC    RPTCLS      RptClass
ENC    RESGROUP    ResGroup
ENC    CPU         CPU-Time
ENC    OWNSYS      OwnerSys
ENC    JNAME       OwnerJob
ENC    ASID        OwnerAS
ENC    ASIDX       OwnerASX
ENC    ORIGINAL    Original
ENC    SCOPE       Scope
ENC    TYPE        Type
ENC    WORKLOAD    Workload
ENC    QUIESCE     Quiesce
ENC    SYSNAME     SysName
ENC    SYSLEVEL    SysLevel
ENC    SUBSYS      Subsys
ENC    ZAAPTIME    zAAP-Time
ENC    ZAAPCPTM    zACP-Time
ENC    ZIIPTIME    zIIP-Time
ENC    ZICPTIME    zICP-Time

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
H      JNAME       JOBNAME
H      JTYPE       Type
H      JNUM        JNum
H      JOBID       JobID
H      OWNERID     Owner
H      DPRIO       Prty                          X
H      OCLASS      C                             X
H      OUTDISP     ODisp                         X
H      RECCNT      Tot-Rec
H      DESTN       Dest                          X
H      PAGECNT     Tot-Page
H      FORMS       Forms                         X
H      FCBID       FCB                           X
H      STATUS      Status
H      UCSID       UCS                           X
H      WTRID       Wtr                           X
H      FLASHID     Flash                         X
H      BURST       Burst                         X
H      PRMODE      PrMode                        X
H      DEST        Rmt
H      NODE        Node
H      SECLABEL    SecLabel
H      OGNAME      O-Grp-N
H      OGID        OGID1
H      OGID2       OGID2
H      JPRIO       JP
H      DATEE       CrDate
H      OHREASON    OHR
H      OHRSNTXT    Output-Hold-Text
H      OFFDEVS     OffS
H      DEVID       Device
H      DSYSID      SysID
H      RETCODE     Max-RC
H      ROOMN       RNum                X
H      PNAME       Programmer-Name     X
H      ACCTN       Acct                X
H      NOTIFY      Notify              X
H      ISYSID      ISys                X
H      TIMER       Rd-Time             X
H      DATER       Rd-Date             X
H      ESYSID      ESys                X
H      TIMEE       St-Time             X
H      DATEE       St-Date             X
H      TIMEN       End-Time            X
H      DATEN       End-Date            X
H      ICARDS      Cards               X
H      JCLASS      JC                  X
H      MCLASS      MC                  X
H      SUBGROUP    SubGroup            X

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
I      JNAME       JOBNAME
I      JOBID       JobID
I      JTYPE       Type
I      JNUM        JNum
I      OWNERID     Owner
I      JPRIO       Prty                          X
I      JCLASS      C                             X
I      POS         Pos
I      PRTDEST     PrtDest                       X
I      ROUTE       Rmt
I      NODE        Node
I      SYSAFF      SAff                          X
I      ACTSYS      ASys
I      STATUS      Status
I      SECLABEL    SecLabel
I      TGNUM       TGNum
I      TGPCT       TGPct
I      ORIGNODE    OrigNode
I      EXECNODE    ExecNode                      X
I      DEVID       Device
I      SRVCLS      SrvClass                      X
I      WLMPOS      WPos
I      SCHENV      Scheduling-Env                X
I      DELAY       Dly
I      SSMODE      Mode
I      ROOMN       RNum                X
I      PNAME       Programmer-Name     X
I      ACCTN       Acct                X
I      NOTIFY      Notify              X
I      ISYSID      ISys                X
I      TIMER       Rd-Time             X
I      DATER       Rd-Date             X
I      ESYSID      ESys                X
I      TIMEE       St-Time             X
I      DATEE       St-Date             X
I      ICARDS      Cards               X
I      MCLASS      MC                  X
I      TSREC       Tot-Lines           X
I      SPIN        Spin
I      SUBGROUP    SubGroup            X

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
INIT   INTNAME     ID
INIT   STATUS      Status
INIT   ICLASS      Classes                       X
INIT   JNAME       JobName
INIT   STEPN       StepName
INIT   PROCS       ProcStep
INIT   JTYPE       Type
INIT   JNUM        JNum
INIT   JOBID       JobID
INIT   JCLASS      C
INIT   ASID        ASID
INIT   ASIDX       ASIDX
INIT   OWNERID     Owner
INIT   SYSNAME     SysName
INIT   DSYSID      SysID
INIT   JESNAME     JESN
INIT   JESLEVEL    JESLevel
INIT   SECLABEL    SecLabel

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
JC     JOBCL       CLASS
JC     JSTATUS     Status
JC     JMODE       Mode                          X
JC     WAITCNT     Wait-Cnt
JC     XEQCNT      Xeq-Cnt
JC     HOLDCNT     Hold-Cnt
JC     JCODISP     ODisp                         X
JC     QHELD       QHld                          X
JC     JHOLD       Hold                          X
JC     XBM         XBM                           X
JC     JCLIM       JCLim                         X
JC     JPGN        PGN                           X
JC     JAUTH       Auth                          X
JC     BLP         BLP                           X
JC     COMMAND     Command                       X
JC     JLOG        Log                           X
JC     MSGLEVEL    MsgLV                         X
JC     OUTPUT      Out                           X
JC     PROCLIB     PL                            X
JC     REGION      Region                        X
JC     SWA         SWA                           X
JC     TIME        Max-Time                      X
JC     ACCT        Acct                          X
JC     COPY        Cpy                           X
JC     JOURNAL     Jrnl                          X
JC     PGMRNAME    PgNm                          X
JC     RESTART     Rst                           X
JC     SCAN        Scn                           X
JC     IEFUJP      UJP                           X
JC     IEFUSO      USO                           X
JC     TYPE6       Tp6                           X
JC     TYPE26      Tp26                          X
JC     CONDPURG    CPr                           X
JC     JMCLASS     MC                            X
JC     SCHENJC     Scheduling-Env                X
JC     JESLOG      JESLog                        X

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
JDS    DDNAME      DDNAME
JDS    STEPN       StepName            X
JDS    PROCS       ProcStep            X
JDS    DSID        DSID                X
JDS    OWNERID     Owner
JDS    OCLASS      C
JDS    DESTN       Dest
JDS    RECCNT      Rec-Cnt             X
JDS    PAGECNT     Page-Cnt            X
JDS    BYTECNT     Byte-Cnt            X
JDS    COPYCNT     CC                  X
JDS    DEST        Rmt
JDS    NODE        Node
JDS    OGNAME      O-Grp-N
JDS    SECLABEL    SecLabel
JDS    PRMODE      PrMode
JDS    BURST       Burst
JDS    DATEE       CrDate-CrTime
JDS    FORMS       Forms
JDS    FCBID       FCB
JDS    UCSID       UCS
JDS    WTRID       Wtr
JDS    FLASHID     Flash
JDS    FLASHC      FlashC              X
JDS    SEGID       SegID               X
JDS    DSNAME      DSName              X
JDS    CHARS       Chars               X
JDS    CPYMOD      CpyMod              X
JDS    CPYMODFT    CpyModFT            X
JDS    PAGEDEF     PageDef             X
JDS    FORMDEF     FormDef             X
JDS    ODTITLE     Title               X
JDS    ODNAME      Name                X
JDS    ODBLDG      Building            X
JDS    ODDEPT      Department          X
JDS    ODROOM      Room                X
JDS    ODADDR      Address-Line1       X
JDS    ODADDR2     Address-Line2       X
JDS    ODADDR3     Address-Line3       X
JDS    ODADDR4     Address-Line4       X
JDS    OUTBIN      OutBn               X
JDS    COMSETUP    ComSetup            X
JDS    FORMLEN     FormLen             X
JDS    COLORMAP    ColorMap            X
JDS    INTRAY      ITy                 X
JDS    OVERLAYB    OverlayB            X
JDS    OVERLAYF    OverlayF            X
JDS    OFFSETXB    OffsetXB            X
JDS    OFFSETXF    OffsetXF            X
JDS    OFFSETYB    OffsetYB            X
JDS    OFFSETYF    OffsetYF            X
JDS    PORTNO      Port                X
JDS    ODNOTIFY    Notify              X
JDS    ODUSRLIB    UserLib             X
JDS    USERDATA    UserData1           X
JDS    AFPPARMS    AFPParms            X

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
LI     DEVNAME     DEVICE
LI     STATUS      Status
LI     UNIT        Unit                          X
LI     NNODE       Node                          X
LI     JNAME       JobName
LI     JOBID       JobID
LI     JTYPE       n/a
LI     JNUM        JNum
LI     OWNERID     Owner
LI     RECPRT      Proc-Lines
LI     RECCNT      Tot-Lines
LI     TYPE        Type
LI     LINELIM     Line-Limit                    X
LI     PAGELIM     Page-Limit                    X
LI     PRTWS       Work-Selection                X
LI     SESSION     Session
LI     TOTERRS     Tot-Errs
LI     AUTODISC    ADisc                         X
LI     CODE        Code                          X
LI     COMPRESS    Comp                          X
LI     APPLID      ApplID                        X
LI     DUPLEX      Duplex                        X
LI     INTERFAC    Intf                          X
LI     LINECCHR    LineCChr                      X
LI     LOG         Log                           X
LI     REST        Rest                          X
LI     SPEED       Speed                         X
LI     PTRACE      Tr                            X
LI     TRANSPAR    Transp                        X
LI     PSWD        Password                      X
LI     DISC        Discon
LI     RMTSHR      RmtShr
LI     JRNUM       JRNum                         X
LI     JTNUM       JTNum                         X
LI     SRNUM       SRNum                         X
LI     STNUM       STNum                         X
LI     SYSNAME     SysName
LI     DSYSID      SysID
LI     JESNAME     JESN
LI     JESLEVEL    JESLevel
LI     DEVSECLB    DSecLabel
LI     SOCKETN     SocketN
LI     IPADDR      IPAddr
LI     IPNAME      IPName
LI     PORT        Port
LI     PORTNAME    PortName
LI     SECURE      Secure
LI     NSNAME      NSName

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
MAS    NAME        NAME
MAS    STATUS      Status
MAS    SYSID       SID
MAS    PREVCKPT    PrevCkpt
MAS    CKPTHOLD    Hold                          X
MAS    ACTHOLD     ActHold
MAS    DORMANCY    Dormancy                      X
MAS    ACTDORM     ActDorm
MAS    SYNCTOL     SyncTol                       X
MAS    SYSMODE     Ind
MAS    RSYSID      RSID
MAS    SYSNAME     SysName
MAS    VERSION     Version
MAS    LASTCKPT    Last-checkpoint
MAS    COMCHAR     C
MAS    SLEVEL      Slevel
MAS    JESNAME     JESN
MAS    BOSS        Boss
MAS    COMMAND     Command
MAS    TYPE        Start-type
MAS    DATE        Start-Date-Time

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
NO     NUMBER      NUMBER
NO     NODENAME    NodeName                      X
NO     STATUS      Status
NO     AUTH        Authority                     X
NO     TRANS       Trans                         X
NO     RECV        Recv                          X
NO     HOLD        Hold                          X
NO     PENCRYPT    PEn                           X
NO     ENDNODE     END                           X
NO     RESIST      Rest                          X
NO     SENTREST    SentRs                        X
NO     COMPACT     Cp                            X
NO     LINE        Line                          X
NO     LOGMODE     LogMode                       X
NO     PATHMGR     PMg                           X
NO     PRIVATE     Prv                           X
NO     SUBNET      Subnet                        X
NO     NTRACE      Tr                            X
NO     LOGON       Logon                         X
NO     SYSNAME     SysName
NO     DSYSID      SysID
NO     JESNAME     JESN
NO     JESLEVEL    JESLevel
NO     NETSRV      NetSrv                        X
NO     DEVSECLB    DSecLabel

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
O      JNAME       JOBNAME
O      JTYPE       Type
O      JNUM        JNum
O      JOBID       JobID
O      OWNERID     Owner
O      DPRIO       Prty                          X
O      OCLASS      C                             X
O      FORMS       Forms                         X
O      FCBID       FCB                           X
O      DESTN       Dest                          X
O      RECCNT      Tot-Rec
O      RECPRT      Prt-Rec
O      PAGECNT     Tot-Page
O      PAGEPRT     Prt-Page
O      DEVID       Device
O      STATUS      Status
O      SECLABEL    SecLabel
O      DSYSID      SysID
O      DEST        Rmt
O      NODE        Node
O      OGNAME      O-Grp-N
O      OGID        OGID1
O      OGID2       OGID2
O      JPRIO       JP
O      UCSID       UCS                           X
O      WTRID       Wtr                           X
O      FLASHID     Flash                         X
O      BURST       Burst                         X
O      PRMODE      PrMode                        X
O      OUTDISP     ODisp                         X
O      DATEE       CrDate
O      OHREASON    OHR
O      OHRSNTXT    Output-Hold-Text
O      OFFDEVS     OffS
O      RETCODE     Max-RC
O      ROOMN       RNum                X
O      PNAME       Programmer-Name     X
O      ACCTN       Acct                X
O      NOTIFY      Notify              X
O      ISYSID      ISys                X
O      TIMER       Rd-Time             X
O      DATER       Rd-Date             X
O      ESYSID      ESys                X
O      TIMEE       St-Time             X
O      DATEE       St-Date             X
O      TIMEN       End-Time            X
O      DATEN       End-Date            X
O      ICARDS      Cards               X
O      JCLASS      JC                  X
O      MCLASS      MC                  X
O      SUBGROUP    SubGroup            X

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
PR     DEVNAME     PRINTER
PR     STATUS      Status
PR     SFORMS      SForms                        X
PR     SFORM2      SForm2
PR     SFORM3      SForm3
PR     SFORM4      SForm4
PR     SFORM5      SForm5
PR     SFORM6      SForm6
PR     SFORM7      SForm7
PR     SFORM8      SForm8
PR     SCLASS      SClass                        X
PR     JNAME       JobName
PR     JTYPE       Type
PR     JNUM        JNum
PR     JOBID       JobID
PR     OWNERID     Owner
PR     RECCNT      Rec-Cnt
PR     RECPRT      Rec-Prt
PR     PAGECNT     Page-Cnt
PR     PAGEPRT     Page-Prt
PR     JPRIO       JP
PR     DPRIO       DP
PR     OCLASS      C
PR     SECLABEL    SecLabel
PR     FORMS       Forms
PR     FCBID       FCB
PR     UCSID       UCS
PR     WTRID       Writer
PR     FLASHID     Flash
PR     DESTN       Dest
PR     BURST       Burst
PR     SEP         Sep                           X
PR     SEPDS       SepDS                         X
PR     PRMODE      PrMode
PR     SFCBID      SFCB                          X
PR     SUCSID      SUCS                          X
PR     SWTRID      SWriter                       X
PR     SFLASHID    SFlh                          X
PR     PRTWS       Work-Selection                X
PR     SBURST      SBurst                        X
PR     SPRMODE1    SPrMode1                      X
PR     SPRMODE2    SPrMode2
PR     SPRMODE3    SPrMode3
PR     SPRMODE4    SPrMode4
PR     SDESTN1     SDest1                        X
PR     SDESTN2     SDest2
PR     SDESTN3     SDest3
PR     SDESTN4     SDest4
PR     SJOBNAME    SJobName                      X
PR     SOWNER      SOwner                        X
PR     SRANGE      SRange                        X
PR     SEPMK       M                             X
PR     NPRO        NPro                          X
PR     MODE        Mode                          X
PR     CKPTLINE    CkptLine                      X
PR     CKPTPAGE    CkptPage                      X
PR     CKPTSEC     CkptSec                       X
PR     CKPTMODE    CkptMode                      X
PR     CPYMOD      CpyMod                        X
PR     UNIT        Unit                          X
PR     PSEL        PSel                          X
PR     OGNAME      O-Grp-N
PR     LINELIM     Line-Limit                    X
PR     PAGELIM     Page-Limit                    X
PR     DEVFCB      DFCB                          X
PR     PSETUP      Setup                         X
PR     COPYMARK    CopyMark                      X
PR     PAUSE       Pau                           X
PR     PSPACE      K                             X
PR     PTRACE      Tr                            X
PR     SEPCHARS    SepChar                       X
PR     UCSVERFY    UCSV                          X
PR     DEST        Rmt
PR     NODE        Node
PR     SYSNAME     SysName
PR     DSYSID      SysID
PR     JESNAME     JESN
PR     JESLEVEL    JESLevel
PR     FSSNAME     FSSName                       X
PR     FSSPROC     FSSProc
PR     FSATRACE    FSATrace                      X
PR     DEVSECLB    DSecLabel

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
PS     JOBNAME     JOBNAME
PS     JOBID       JobID
PS     STATUS      Status
PS     OWNERID     Owner
PS     STATE       State
PS     CPU         CPU-Time
PS     PID         PID
PS     PPID        PPID
PS     ASID        ASID
PS     ASIDX       ASIDX
PS     LATCHPID    LatchWaitPID
PS     COMMAND     Command
PS     SERVER      ServerName
PS     TYPE        Type
PS     ACTFILES    ActFiles
PS     MAXFILES    MaxFiles
PS     TIMEE       St-Time
PS     DATEE       St-Date
PS     SYSLEVEL    SysLevel
PS     SYSNAME     SysName
PS     SECLABEL    SecLabel

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
PUN    DEVNAME     PUNCH
PUN    STATUS      Status
PUN    SFORMS      SForms                        X
PUN    SCLASS      SClass                        X
PUN    JNAME       JobName
PUN    JOBID       JobID
PUN    JTYPE       Type
PUN    JNUM        JNum
PUN    OWNERID     Owner
PUN    RECCNT      Rec-Cnt
PUN    RECPRT      Rec-Prt
PUN    PAGECNT     Page-Cnt
PUN    PAGEPRT     Page-Prt
PUN    SEP         Sep                           X
PUN    SEPDS       SepDS                         X
PUN    CCTL        CCtl                          X
PUN    CMPCT       Cmpct                         X
PUN    COMP        Comp                          X
PUN    COMPAC      Compact                       X
PUN    FLUSH       Fls                           X
PUN    SWTRID      SWriter                       X
PUN    PRTWS       Work-Selection                X
PUN    SPRMODE1    SPrMode1                      X
PUN    SPRMODE2    SPrMode2
PUN    SPRMODE3    SPrMode3
PUN    SPRMODE4    SPrMode4
PUN    SDESTN1     SDest1                        X
PUN    SDESTN2     SDest2
PUN    SDESTN3     SDest3
PUN    SDESTN4     SDest4
PUN    SJOBNAME    SJobName                      X
PUN    SRANGE      SRange                        X
PUN    SOWNER      SOwner                        X
PUN    SVOL        SVol                          X
PUN    SELECT      SELECT                        X
PUN    CKPTLINE    CkptLine                      X
PUN    CKPTPAGE    CkptPage                      X
PUN    UNIT        Unit                          X
PUN    LINELIM     Line-Limit                    X
PUN    LRECL       LRecL                         X
PUN    PSETUP      Setup                         X
PUN    PAUSE       Pau                           X
PUN    SUSPEND     Sus                           X
PUN    PTRACE      Tr                            X
PUN    SYSNAME     SysName
PUN    DSYSID      SysID
PUN    JESNAME     JESN
PUN    JESLEVEL    JESLevel
PUN    SECLABEL    SecLabel
PUN    DEVSECLB    DSecLabel

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
RDR    DEVNAME     READER
RDR    STATUS      Status
RDR    JNAME       JobName
RDR    JOBID       JobID
RDR    JTYPE       Type
RDR    JNUM        JNum
RDR    OWNERID     Owner
RDR    RECCNT      Rec-Cnt
RDR    RECPRT      Rec-Proc
RDR    RCLASS      C                             X
RDR    RHOLD       Hold                          X
RDR    RMCLASS     MC                            X
RDR    RPRTDST     PrtDest                       X
RDR    RPUNDST     PunDest                       X
RDR    RSYSAFF     SAff                          X
RDR    RAUTH       Authority                     X
RDR    PRIOINC     PI                            X
RDR    PRIOLIM     PL                            X
RDR    RUNIT       Unit                          X
RDR    XREQDEST    XReqDest                      X
RDR    RTRACE      Tr                            X
RDR    SYSNAME     SysName
RDR    DSYSID      SysID
RDR    JESNAME     JESN
RDR    JESLEVEL    JESLevel
RDR    DEVSECLB    DSecLabel
RDR    SECLABEL    SecLabel

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
RES    RESOURCE    RESOURCE
RES    REQSTATE    ReqState                      X
RES    SYS1-SYS32  *Resolved*

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
RM     RESNAME     RESOURCE
RM     DSYSID      SysID
RM     STATUS      Status              X
RM     LIMIT       Limit               X         X
RM     USENUM      InUse               X
RM     USEPCT      InUse%              X
RM     WARNPCT     Warn%               X         X
RM     INTAVG      IntAvg              X
RM     INTHIGH     IntHigh             X
RM     INTLOW      IntLow              X
RM     OVERWARN    OverWarn%           X
RM     TIMEE       Time                X
RM     DATEE       Date                X
RM     SYSNAME     SysName
RM     JESNAME     JESN
RM     JESLEVEL    JESLevel

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
SE     SCHENV      SCHEDULING-ENV
SE     DESCRIPT    Description
SE     SYSTEMS     Systems

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
SO     DEVNAME     DEVICE
SO     STATUS      Status
SO     TYPE        Type
SO     JNAME       Jobname
SO     JOBID       JobID
SO     JTYPE       n/a
SO     JNUM        JNum
SO     OWNERID     Owner
SO     LINELIM     Line-Limit                    X
SO     PAGELIM     Page-Limit                    X
SO     RECPRT      Proc-Lines
SO     RECCNT      Tot-Lines
SO     SCLASS      SClass                        X
SO     SOWNER      SOwner                        X
SO     SHOLD       SHold                         X
SO     SJOBNAME    SJobName                      X
SO     SRANGE      SRange                        X
SO     SDESTN1     SDest1                        X
SO     SSAFF       SSAff                         X
SO     SDISP       SDisp                         X
SO     SVOL        SVol                          X
SO     SBURST      SBurst                        X
SO     SFCBID      SFCB                          X
SO     SFLASHID    SFlh                          X
SO     SFORMS      SForms                        X
SO     SPRMODE1    SPrMode                       X
SO     SODISP      SODsp                         X
SO     SWTRID      SWriter                       X
SO     SUCSID      SUCS                          X
SO     PRTWS       Work-Selection                X
SO     NOTIFY      Notify                        X
SO     ODSNAME     DSName                        X
SO     SSRVCLS     SSrvClass                     X
SO     SSCHENV     SScheduling-Env               X
SO     MBURST      MBurst                        X
SO     MDEST       MDest                         X
SO     MFCB        MFCB                          X
SO     MFLASH      MFlh                          X
SO     MFORMS      MForms                        X
SO     MHOLD       MHold                         X
SO     MSCLASS     MClass                        X
SO     MODISP      MODsp                         X
SO     MPRMODE     MPrMode                       X
SO     MSAFF       MSAff                         X
SO     MUCS        MUCS                          X
SO     MWRITER     MWriter                       X
SO     LABEL       Label                         X
SO     PROTECT     Prot                          X
SO     RETENT      RtPd                          X
SO     ARCHIVE     Archive                       X
SO     VALIDAT     Validate                      X
SO     UNIT        Unit                          X
SO     VOLS        Vols                          X
SO     SYSNAME     SysName
SO     DSYSID      SysID
SO     JESNAME     JESN
SO     JESLEVEL    JESLevel
SO     DEVSECLB    DSecLabel

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
SP     DEVNAME     VOLUME
SP     STATUS      Status
SP     TGPCT       TGPct               X
SP     TGNUM       TGNum               X
SP     TGUSE       TGUse
SP     COMMAND     Command
SP     SPSYSAF     SAff
SP     EXTENT      Ext
SP     TRKLO       LoTrk
SP     TRKHI       HiTrk
SP     TCYL        TrkPerCyl
SP     TREC        RecPerTrk
SP     TGTRK       TrkPerTG

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
SR     REPLYID     REPLYID
SR     SYSNAME     SysName
SR     JNAME       JobName
SR     MSGTEXT     Message-Text
SR     JOBID       JobID
SR     DATEE       Date
SR     TIMEE       Time
SR     CONSOLE     CONSOLE
SR     ROUTECD     RouteCd
SR     DESC        Desc
SR     MSGTYPE     Type
SR     QUEUE       QUEUE

Panel  Column      Title               Delayed?  Overtype?
------ ----------- ------------------- --------- ---------
ST     JNAME       JOBNAME
ST     JTYPE       Type
ST     JNUM        JNum
ST     JOBID       JobID
ST     OWNERID     Owner
ST     JPRIO       Prty                          X
ST     QUEUE       QUEUE
ST     JCLASS      C
ST     POS         Pos
ST     SYSAFF      SAff                          X
ST     ACTSYS      ASys
ST     STATUS      Status
ST     PRTDEST     PrtDest                       X
ST     SECLABEL    SecLabel
ST     TGNUM       TGNum
ST     TGPCT       TGPct
ST     ORIGNODE    OrigNode
ST     EXECNODE    ExecNode                      X
ST     DEVID       Device
ST     RETCODE     Max-RC
ST     SRVCLS      SrvClass                      X
ST     WLMPOS      WPos                X
ST     SCHENV      Scheduling-Env      X         X
ST     DELAY       Dly
ST     SSMODE      Mode
ST     ROOMN       RNum                X
ST     PNAME       Programmer-Name     X
ST     ACCTN       Acct                X
ST     NOTIFY      Notify              X
ST     ISYSID      ISys                X
ST     TIMER       Rd-Time             X
ST     DATER       Rd-Date             X
ST     ESYSID      ESys                X
ST     TIMEE       St-Time             X
ST     DATEE       St-Date             X
ST     TIMEN       End-Time            X
ST     DATEN       End-Date            X
ST     ICARDS      Cards               X
ST     MCLASS      MC                  X
ST     TSREC       Tot-Lines           X
ST     OFFDEVS     OffS
ST     SPIN        Spin                X
ST     SUBGROUP    SubGroup            X

*/

/* <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
=======================================================================
End of code.
=======================================================================
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> */
