/* REXX */
/* We first need rexx in comment if compiled or read from SYSPROC. */
REXX_ISPG0202:
  rexxpgm_version = "01.00"          /* Set with 'ver 1' and 'lev 0'. */

  SAY "BRIFþrowse interface"
  SAY "===================="

  ADDRESS ISPEXEC "CONTROL ERRORS RETURN"

Example_1:
  SAY "Example 1:"
  SAY "=========="
  SAY "Sorry, there was no good example from IBM to put here."

  RETURN 0
