//SBGOLOBK JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//*STEP1   EXEC  PGM=UATAPE,PARM='PRINT,PRINTMAX=1000,CRT'
//*STEP1   EXEC  PGM=UATAPE,PARM='DUMP,DUMPMAX=5,CRT'
//STEP1    EXEC  PGM=UATAPE,PARM='CRT,BLOCKS'
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.W$$.LINKLIB
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSUT1   DD  UNIT=562,DISP=OLD,VOL=SER=DATAF3,LABEL=EXPDT=98000
//*                  THIS IS AN FDR TAPE.
//
