PROC 0 FNUM PREF(SBGOLOB) OUTPUT(X) NUMB(500) CBT(CBT)            -
       DSNM(CBT.EDIT)
/* ------------------------------------------------------------- */
/* CLIST TO FIX COLUMNS 73-80 IN THE CBT DOCUMENTATION, FOR      */
/* THE ENTIRE FILE 001.                                          */
/* ------------------------------------------------------------- */
     WRITE INPUT DATASET NAME WITHOUT THE PREFIX &PREF
     READ &INPTDSN
     WRITE INPUT MEMBER NAME
     READ &INPTMEM
     SET &INPT = &STR(&&PREF..&INPTDSN(&INPTMEM))
     WRITE INPUT TO DOCFILE PROGRAM IS &INPT
     WRITE OUTPUT DATASET NAME WITHOUT THE PREFIX &PREF
     SET &VER    = &SUBSTR(1:1,&NUMB)
     SET &MODIF  = &SUBSTR(2:3,&NUMB)
     READ &OTPTDSN
     WRITE OUTPUT MEMBER NAME
     READ &OTPTMEM
     SET &OTPT = &STR(&PREF..&OTPTDSN(&OTPTMEM))
     WRITE OUTPUT OF DOCFILE PROGRAM IS &OTPT
     SET &FILVER = &STR(CBT&NUMB)
     SET &FILNAM = &STR(&FILVER..FILE&FNUM)
     ALLOC F(INPUT)  SH REUSE DA('&INPT')
     ALLOC F(OUTPUT) SH REUSE DA('&OTPT')
     WRITE FIXING COLUMNS 73-80 FOR CBTDOC IN DATASET &INPT
     WRITE OUTPUT DATASET NAME :  &OTPT
     CALL 'SBGOLOB.LOAD(DOCFILE)'
     WRITE PDS86 BEING CALLED TO ADD ISPF STATS
     WRITE ISPF STATS:  VERSION    IS &VER
     WRITE ISPF STATS:  MODIF LVL  IS &MODIF
     PDS86 '&PREF..&OTPTDSN' XISPM
     ATTRIB &OTPTMEM ADDSTATS ID(&CBT-&NUMB) VER(&VER) MOD(&MODIF)
     END
     WRITE MEMBER &OTPTMEM STATISTICS ADDED
     FREE FI(INPUT OUTPUT)
     WRITE INPUT AND OUTPUT FILES FREED
     WRITE DOCFIL EXECUTION COMPLETED WITH RETURN CODE &LASTCC
