//SBGOLOBP  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//COL7380 EXEC PGM=DOCFILE
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.LOAD
//INPUT    DD  DISP=SHR,DSN=SBGOLOB.CBT.EDIT(FILE001$)
//OUTPUT   DD  DISP=SHR,DSN=SBGOLOB.CBT.EDIT(FILE001#)
