//TST2LSG$ JOB ,'TECH-S.GOLOB',CLASS=M,NOTIFY=TST2SSG,
//        MSGLEVEL=(1,1),MSGCLASS=T TYPRUN=HOLD
//*******************************************************************
//*   LINKEDIT SOFTWARE
//*******************************************************************
//S02ASM  EXEC ASMVCL,PARM.ASM='ALIGN',
//        PARM.LKED='LIST,LET,XREF,NCAL'
//ASM.SYSLIB DD DISP=SHR,DSN=SYS1.MACLIB,DCB=BLKSIZE=32760
//       DD DSN=TSY2.ATSOMAC,DISP=SHR
//       DD DSN=TSY2.AMODGEN,DISP=SHR
//       DD DISP=SHR,DSN=TST2SSG.OFFLOAD.SHIP <==SPECIAL MACROS
//ASM.SYSIN DD DSN=TST2SSG.OFFLOAD.SHIP(PDSLOADW),DISP=SHR
//LKED.SYSLMOD DD DSN=TST.TSO.CMDLIB,DISP=SHR
//LKED.SYSIN DD *
 SETCODE AC(0)
 SETSSI CC260316
 NAME PDSLOADW(R)
/*
//
