//SBGOLOBM JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//PARMDRV  EXEC PGM=PARMLINK,PARM='READ,LABADDIN'
//STEPLIB   DD  DISP=SHR,DSN=SBGOLOB.LOAD
//PARMREPT  DD  SYSOUT=*
//SYSPRINT  DD  SYSOUT=*
//SYSIN     DD  *
LABELS SYSIN LABLDUMP OPTIONS CUMTOT BYTES NOSUPPWT
FILELIMIT=377
LABELIMIT=4
