//SBGOLOBM JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//PARMCHK  EXEC PGM=PARMDRVR
//STEPLIB   DD  DISP=SHR,DSN=SBGOLOB.LOAD
//PARMREPT  DD  SYSOUT=*
//SYSPRINT  DD  SYSOUT=*
//SYSIN     DD  *
READ LABELS LABLDUMP OPTIONS CUMTOT BYTES NOSUPPWT
/*
