//**********************************************************************
//*  PROC JXPR300
//*  UPDATE CHANGE HISTORY FILE FROM SCLM ACCOUNT FILE
//*  CREATE CHANGE HISTORY REPORTS
//**********************************************************************
//*
//*   PROC JXPR300 WILL UPDATE THE CHANGE HISTORY FILE
//*
//*   THIS PROC USES THE SCLM ACCOUNT FILE AS INPUT
//*
//*   THIS PROC IS USED BY JOB JXD300
//*
//*   IF STEPS STEP0130 THRU STEP0170 ABEND, YOU NEED TO
//*        RESTART IN STEP0130.
//*
//*   IF YOU RESTART AFTER STEP0170,
//*        CHANGE SYMBOLIC GENHO TO '(+0)'
//*
//*   IT WON'T REALLY HURT ANYTHING IF YOU RESTART FROM THE BEGINNING
//*      WITHOUT DELETING THE GDGS FOR THE FILES THAT HAVE ALREADY
//*      BEEN CREATED.  DUPLICATE UPDATES WILL BE DISCARDED.
//********************************************************************
//*  MODIFICATION LOG
//*  2004-12  SHH  RENAME LASTCHG FILE. ADD DELDATE TO JXC320JX.
//*
//********************************************************************
//JXPR300  PROC  MDL='MDLDSCB,',
//        PREFHI='JX.ALL',                    PREFIX FOR INPUT HISTORY
//        GENHI='(+0)',                       GEN OF CHG HISTORY
//        PREFO='JX.ALL',                     PREFIX FOR OUTPUT FILES
//        PREFR='JX.ALL',                     PREFIX FOR REPORT FILES
//        PREFW='JX.CHGWRK',                  PREFIX FOR WORK FILES
//        SUFR='R5',                          SUFFIX FOR REPORT FILES
//        SUFW='R5',                          SUFFIX FOR WORK FILES
//        PREFHO='JX.ALL',                    PREFIX FOR OUTPUT HISTORY
//        GENHO='(+1)',                       GEN OF NEW CHG HISTORY
//        SCLMFL='SCLM.PROD.ACCOUNT',         SCLM ACCOUNT FILE
//        JX300RUN=JXSD300C,                  *  CHANGED 00015
//*       JX300RUN=JXSD300D,                  *  ALL
//        JX320RUN=JXSD320C,                  *  12 MONTHS OF DELETES
//*       JX320RUN=JXSD320A,                  *  ALL    ALL DELETES
//*       JX320RUN=JXSD320B,                  *  NONE   NO DELETES
//        PGM300=JXC300SC,DBG300='N 00000 00000',
//        PGM310=JXC310JX,DBG310='N 00000 00000',
//        PGM315=JXC315JX,DBG315='N 00000 00000',
//        PGM320=JXC320JX,DBG320='N 00000 00000',
//        PGM370=JXC370JX,DBG370='N 00000 00000',
//        ENV='PROD',                         LOADLIB
//        SOUT='X',                           REPORT CLASS -MESSAGES
//        RPT='X',                            REPORT CLASS -REPORTS
//        SDUMP='D',                          REPORT CLASS -ABENDS
//        HSRECL='200',                       LRECL HISTORY FILE
//        UNITF=SYSDA,                        OUTPUT FILE UNIT TYPE
//        UNITT=SYSDA,                        WORK FILE UNIT TYPE
//        UNITS=SYSDA,                        SORTWORK UNIT TYPE
//        UNITR=SYSDA,                        REPORT UNIT TYPE
//        VOLSERR=VSAM05,                     VOLSER FOR REPORTS
//        VOLSERF=VSAM05,                     VOLSER FOR OUTPUT FILES
//        CARDLIB='ZY06.CHGWIZ',              CARDLIB FOR PGM PARMS
//        SRTPRM='ZY06.CHGWIZ'                CARDLIB FOR SORTS
//*
//**********************************************************************
//*   REFWIZ  JXREF   REL 5.0 VER 01
//*   (C) 2005 RENAISSANCE DATA SYSTEMS INC.
//*
//*  PROC JXPR300  - UPDATE CHANGE HISTORY FILE AND CREATE REPORTS
//*
//*  EXECUTE PROGRAMS
//*      JXC300SC        EXTRACT SCLM INFO
//*      JXC310JX        UPDATE HISTORY FROM DAILY FILE
//*      JXC315JX        IDENTIFY DELETED ELEMENTS
//*      JXC320JX        CREATE LAST MAINT FILE FROM CHANGE HISTORY
//*      JXC370JX        CREATE CHANGE HISTORY REPORTS
//*
//*  INPUT FILES
//*      &SCLMFL                                 SCLM.PROD.ACCOUNT
//*      &PREFHI..XTRCT.CHGCTRL.SCLM&GENHI       CHANGE HISTORY FILE
//*  OUTPUT FILES
//*      &PREFHO..XTRCT.CHGCTRL.SCLM&GENHO       UPD CHANGE HISTORY FILE
//*      &PREFO..XTRCT.CHGCTRL.LASTCHG.SCLM      LAST MAINT FILE
//*      &PREFR..RPT.CHGCTRL.DAILY.SCLM.&SUFR    DAILY CHANGES
//*      &PREFR..RPT.CHGCTRL.MTD.SCLM.&SUFR      MTD CHANGES
//*      &PREFR..RPT.CHGCTRL.PREVMTD.SCLM.&SUFR  PREVIOUS MTD CHANGES
//*
//**********************************************************************
//*     DELETE WORK FILE
//*     IF STEP ABENDS, RESTART FROM BEGINNING OF JOB
//**********************************************************************
//STEP0010 EXEC PGM=IEFBR14
//*JX*  DELETE ACCOUNT BACKUP
//FILEOT01 DD DSN=&PREFW..SCDLY.ACCOUNT.BKUP.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     COPY VSAM ACCOUNT FILE
//*     IF STEP ABENDS, RESTART FROM BEGINNING OF JOB
//**********************************************************************
//STEP0020 EXEC PGM=IDCAMS
//*JX*  COPY VSAM ACCOUNT FILE
//SYSPRINT DD SYSOUT=&SOUT
//SYSUDUMP DD SYSOUT=&SDUMP
//SYSOUT   DD SYSOUT=&SOUT
//*
//FILEIN01 DD DSN=&SCLMFL,
//            DISP=SHR
//FILEOT01 DD DSN=&PREFW..SCDLY.ACCOUNT.BKUP.&SUFW,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=&UNITT,SPACE=(TRK,(2500,250),RLSE),
//            DCB=(RECFM=VB,LRECL=32004)
//*
//SYSIN    DD DSN=&SRTPRM(JXSR300A),DISP=SHR
//*
//**********************************************************************
//*     DELETE SORTED ACCOUNT FILE
//*     IF STEP ABENDS, RESTART FROM STEP0030
//**********************************************************************
//STEP0030 EXEC PGM=IEFBR14
//SORTOUT  DD DSN=&PREFW..SCDLY.ACCOUNT.SRTD.&SUFW,
//*JX*  DELETE SORTED ACCOUNT FILE
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     SORT ACCOUNT FILE TO EXCLUDE UNNEEDED RECORDS
//*     IF STEP ABENDS, RESTART FROM STEP0030
//**********************************************************************
//STEP0040 EXEC PGM=SORT
//*JX*  SORT ACCOUNT FILE TO EXCLUDE UNNEEDED RECORDS
//SYSPRINT DD SYSOUT=&SOUT
//SYSUDUMP DD SYSOUT=&SDUMP
//SYSOUT   DD SYSOUT=&SOUT
//*
//SORTIN   DD DSN=&PREFW..SCDLY.ACCOUNT.BKUP.&SUFW,
//            DISP=SHR
//SORTOUT  DD DSN=&PREFW..SCDLY.ACCOUNT.SRTD.&SUFW,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=&UNITT,SPACE=(TRK,(2500,250),RLSE),
//            DCB=(RECFM=VB,LRECL=32004)
//SYSIN    DD DSN=&SRTPRM(JXSR300B),DISP=SHR
//*
//SORTWK01 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK02 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK03 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK04 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK05 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK06 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK07 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK08 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK09 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK10 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//*
//**********************************************************************
//*     DELETE DAILY EXTRACT
//*     IF RESTARTING, START AT STEP0050
//**********************************************************************
//STEP0050 EXEC PGM=IEFBR14
//*JX*  DELETE DAILY EXTRACT
//SRCXTRT  DD DSN=&PREFW..SCDLY.XTRCT.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//SRCLIST  DD DSN=&PREFW..SCDLY.LIST.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     CREATE DAILY EXTRACT OF ELEMENTS IN SCLM FILE
//*     IF RESTARTING, START AT STEP0050
//**********************************************************************
//STEP0060 EXEC PGM=&PGM300,PARM='&DBG300'
//*JX*  CREATE DAILY EXTRACT OF ELEMENTS IN SCLM ACCOUNT FILE
//*STEPLIB  DD DSN=SYS2.DUMMY.LOADLIB,DISP=SHR
//         INCLUDE MEMBER=JXIS&ENV
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//RDBUG    DD SYSOUT=&RPT
//*
//RUNTYPE  DD DSN=&CARDLIB(&JX300RUN),DISP=SHR
//SCACCT   DD DSN=&PREFW..SCDLY.ACCOUNT.SRTD.&SUFW,
//            DISP=SHR
//*
//SRCXTRT  DD DSN=&PREFW..SCDLY.XTRCT.&SUFW,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=&UNITT,SPACE=(CYL,(50,25),RLSE),
//            DCB=(RECFM=FB,LRECL=&HSRECL,BLKSIZE=0)
//SRCLIST  DD DSN=&PREFW..SCDLY.LIST.&SUFW,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=&UNITT,SPACE=(CYL,(50,25),RLSE),
//            DCB=(RECFM=FB,LRECL=20,BLKSIZE=0)
//**********************************************************************
//*     DELETE SORTED DAILY SCLM EXTRACT
//*     IF RESTARTING, START AT STEP0070
//**********************************************************************
//STEP0070 EXEC PGM=IEFBR14
//*JX*  DELETE SORTED DAILY SCLM EXTRACT
//SORTOUT  DD DSN=&PREFW..SCDLY.XTRCT.SRTD.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     SORT DAILY SCLM EXTRACT
//*     IF RESTARTING, START AT STEP0070
//**********************************************************************
//STEP0080 EXEC PGM=SORT
//*JX*  SORT DAILY SCLM EXTRACT
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//SORTIN   DD DSN=&PREFW..SCDLY.XTRCT.&SUFW,
//            DISP=SHR
//SORTOUT  DD DSN=&PREFW..SCDLY.XTRCT.SRTD.&SUFW,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=&UNITT,SPACE=(CYL,(150,50),RLSE),
//            DCB=(RECFM=FB,LRECL=&HSRECL,BLKSIZE=0)
//SYSIN    DD DSN=&SRTPRM(JXSRSMS1),DISP=SHR
//*
//SORTWK01 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK02 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK03 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK04 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK05 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK06 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK07 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK08 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK09 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK10 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//*
//**********************************************************************
//*     DELETE DUMMY ELEMENT RECORD
//*     IF RESTARTING, START AT STEP0090
//**********************************************************************
//STEP0090 EXEC PGM=IEFBR14
//*JX*  DELETE DUMMY ELEMENT RECORD
//SORTOUT  DD DSN=&PREFW..SCDLY.XTRCT.DUMMY.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     EXTRACT DUMMY ELEMENT RECORD FOR DAILY DATE
//*     IF RESTARTING, START AT STEP0090
//**********************************************************************
//STEP0100 EXEC PGM=SORT
//*JX*  EXTRACT DUMMY ELEMENT RECORD FOR DAILY DATE
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//SORTIN   DD DSN=&PREFW..SCDLY.XTRCT.SRTD.&SUFW,
//            DISP=SHR
//SORTOUT  DD DSN=&PREFW..SCDLY.XTRCT.DUMMY.&SUFW,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=&UNITT,SPACE=(TRK,(1,5),RLSE),
//            DCB=(RECFM=FB,LRECL=&HSRECL,BLKSIZE=0)
//SYSIN    DD DSN=&SRTPRM(JXSR310B),DISP=SHR
//*
//**********************************************************************
//*     DELETE SORTED CHANGE HISTORY FILE
//*     IF RESTARTING, START AT STEP0110
//**********************************************************************
//STEP0110 EXEC PGM=IEFBR14
//*JX*  DELETE SORTED CHANGE HISTORY FILE
//SORTOUT  DD DSN=&PREFW..XTRCT.CHGCTRL.SCLMSRT.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     SORT CHANGE HISTORY FILE
//*     IF RESTARTING, START AT STEP0110
//**********************************************************************
//STEP0120 EXEC PGM=SORT
//*JX*  SORT CHANGE HISTORY FILE
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//SORTIN   DD DSN=&PREFHI..XTRCT.CHGCTRL.SCLM&GENHI,
//            DISP=SHR
//SORTOUT  DD DSN=&PREFW..XTRCT.CHGCTRL.SCLMSRT.&SUFW,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=&UNITT,SPACE=(CYL,(150,50),RLSE),
//            DCB=(RECFM=FB,LRECL=&HSRECL,BLKSIZE=0)
//SYSIN    DD DSN=&SRTPRM(JXSRSMS1),DISP=SHR
//*
//SORTWK01 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK02 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK03 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK04 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK05 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK06 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK07 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK08 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK09 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK10 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//*
//**********************************************************************
//*     UPDATE SCLM HISTORY FROM DAILY FILE
//*     IF RESTARTING, START AT STEP0130
//**********************************************************************
//STEP0130 EXEC PGM=&PGM310,PARM='&DBG310'
//*JX*  UPDATE SCLM HISTORY FROM DAILY FILE
//*STEPLIB  DD DSN=SYS2.DUMMY.LOADLIB,DISP=SHR
//         INCLUDE MEMBER=JXIS&ENV
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//RDBUG    DD SYSOUT=&RPT
//*
//CHGHIST  DD DSN=&PREFW..XTRCT.CHGCTRL.SCLMSRT.&SUFW,
//            DISP=SHR
//CHGDLY   DD DSN=&PREFW..SCDLY.XTRCT.SRTD.&SUFW,
//            DISP=SHR
//*
//RUNTYPE  DD DSN=&CARDLIB(JXSD3SCL),DISP=SHR
//*
//NEWCHG   DD DSN=&&NEWHST,
//            DISP=(NEW,PASS,DELETE),
//            UNIT=&UNITT,SPACE=(CYL,(150,30),RLSE),
//            DCB=(RECFM=FB,LRECL=&HSRECL,BLKSIZE=0)
//*
//**********************************************************************
//*     SORT UPDATED SCLM HISTORY FILE
//*     IF RESTARTING, START AT STEP0130
//**********************************************************************
//STEP0140 EXEC PGM=SORT
//*JX*  SORT UPDATED CHANGE HISTORY FILE
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//SORTIN   DD DSN=&&NEWHST,
//            DISP=(OLD,DELETE,DELETE)
//*
//SORTOUT  DD DSN=&&HST2,
//            DISP=(NEW,PASS,DELETE),
//            UNIT=&UNITT,SPACE=(CYL,(150,30),RLSE),
//            DCB=(RECFM=FB,LRECL=&HSRECL,BLKSIZE=0)
//SYSIN    DD DSN=&SRTPRM(JXSRSMS1),DISP=SHR
//*
//SORTWK01 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK02 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK03 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK04 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK05 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK06 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK07 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK08 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK09 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK10 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//*
//**********************************************************************
//*     SORT ELEMENT LIST FROM ACCOUNT FILE
//*     IF RESTARTING, START AT STEP0130
//**********************************************************************
//STEP0150 EXEC PGM=SORT
//*JX*  SORT ELEMENT LIST FROM ACCOUNT FILE
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//SORTIN   DD DSN=&PREFW..SCDLY.LIST.&SUFW,
//            DISP=SHR
//SORTOUT  DD DSN=&&LSTSRT,
//            DISP=(NEW,PASS,DELETE),
//            UNIT=&UNITT,SPACE=(CYL,(150,50),RLSE),
//            DCB=(RECFM=FB,LRECL=20)
//SYSIN    DD DSN=&SRTPRM(JXSR315A),DISP=SHR
//*
//SORTWK01 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK02 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK03 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK04 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK05 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK06 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK07 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK08 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK09 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//SORTWK10 DD UNIT=&UNITS,SPACE=(CYL,(50,25))
//*
//**********************************************************************
//*     IDENTIFY DELETED ELEMENTS
//*     IF RESTARTING, START AT STEP0130
//**********************************************************************
//STEP0160 EXEC PGM=&PGM315,PARM='&DBG315'
//*JX*  IDENTIFY DELETED ELEMENTS
//*STEPLIB  DD DSN=SYS2.DUMMY.LOADLIB,DISP=SHR
//         INCLUDE MEMBER=JXIS&ENV
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//RDBUG    DD SYSOUT=&RPT
//*
//CHGHIST  DD DSN=&&HST2,
//            DISP=(OLD,DELETE,DELETE)
//SRCLIST  DD DSN=&&LSTSRT,
//            DISP=(OLD,DELETE,DELETE)
//CHGDATE  DD DSN=&PREFW..SCDLY.XTRCT.DUMMY.&SUFW,
//            DISP=SHR
//*
//NEWCHG   DD DSN=&&HST3,
//            DISP=(NEW,PASS,DELETE),
//            UNIT=&UNITT,SPACE=(CYL,(150,30),RLSE),
//            DCB=(RECFM=FB,LRECL=&HSRECL,BLKSIZE=0)
//*
//**********************************************************************
//*     CREATE FINAL CHANGE HISTORY FILE
//*     IF RESTARTING, START AT STEP0130
//**********************************************************************
//STEP0170 EXEC PGM=SORT
//*JX*  CREATE FINAL CHANGE HISTORY FILE
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//SORTIN   DD DSN=&&HST3,
//            DISP=(OLD,DELETE,DELETE)
//*
//SORTOUT  DD DSN=&PREFHO..XTRCT.CHGCTRL.SCLM&GENHO,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=&UNITF,SPACE=(CYL,(150,30),RLSE),
//            VOL=SER=&VOLSERF,
//            DCB=(&MDL.RECFM=FB,LRECL=&HSRECL,BLKSIZE=0)
//SYSIN    DD DSN=&SRTPRM(JXSRSMS1),DISP=SHR
//*
//SORTWK01 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK02 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK03 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK04 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK05 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK06 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK07 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK08 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK09 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK10 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//*
//**********************************************************************
//*     DELETE LAST-MAINT FILE
//*     IF RESTARTING, START AT STEP0180 AND CHANGE GENHO TO '(+0)'
//**********************************************************************
//STEP0180 EXEC PGM=IEFBR14
//*JX*  DELETE LAST-MAINT FILE
//NEWCHG   DD DSN=&PREFO..XTRCT.CHGCTRL.LASTCHG.SCLM,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     CREATE LAST-MAINT FILE
//*     IF RESTARTING, START AT STEP0180 AND CHANGE GENHO TO '(+0)'
//**********************************************************************
//STEP0190 EXEC PGM=&PGM320,PARM='&DBG320'
//*JX*  CREATE LAST-MAINT FILE FOR SCLM SOURCE
//*STEPLIB  DD DSN=SYS2.DUMMY.LOADLIB,DISP=SHR
//         INCLUDE MEMBER=JXIS&ENV
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//RDBUG    DD SYSOUT=&RPT
//*
//CHGHIST  DD DSN=&PREFHO..XTRCT.CHGCTRL.SCLM&GENHO,
//            DISP=SHR
//DELDATE  DD DSN=&SRTPRM(&JX320RUN),DISP=SHR
//*
//NEWCHG   DD DSN=&PREFO..XTRCT.CHGCTRL.LASTCHG.SCLM,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=&UNITF,SPACE=(CYL,(150,30),RLSE),
//            VOL=SER=&VOLSERF,
//            DCB=(RECFM=FB,LRECL=&HSRECL,BLKSIZE=0)
//*
//**********************************************************************
//*     DELETE DAILY REPORT OF ELEMENTS CHANGED
//*     IF RESTARTING, START AT STEP0200 AND CHANGE GENHO TO '(+0)'
//**********************************************************************
//STEP0200 EXEC PGM=IEFBR14
//*JX*  DELETE DAILY REPORT OF ELEMENTS CHANGED
//NEWCHG   DD DSN=&PREFR..RPT.CHGCTRL.DAILY.SCLM.&SUFR,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     CREATE A DAILY REPORT OF ELEMENTS CHANGED
//*     IF RESTARTING, START AT STEP0200 AND CHANGE GENHO TO '(+0)'
//**********************************************************************
//STEP0210 EXEC PGM=&PGM370,PARM='&DBG370'
//*JX*  CREATE A DAILY REPORT OF ELEMENTS CHANGED
//*STEPLIB  DD DSN=SYS2.DUMMY.LOADLIB,DISP=SHR
//         INCLUDE MEMBER=JXIS&ENV
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//RDBUG    DD SYSOUT=&RPT
//*
//CHGHIST  DD DSN=&PREFHO..XTRCT.CHGCTRL.SCLM&GENHO,
//            DISP=SHR
//*
//LIBNAME  DD DSN=&SRTPRM(JXSD370S),
//            DISP=SHR
//*
//RPTRANGE DD DSN=&SRTPRM(JXSD370D),
//            DISP=SHR
//         DD DSN=&SRTPRM(JXSD3SCL),
//            DISP=SHR
//*
//CHGRPT   DD DSN=&PREFR..RPT.CHGCTRL.DAILY.SCLM.&SUFR,
//            DISP=(NEW,CATLG,CATLG),
//            UNIT=&UNITR,SPACE=(TRK,(250,150),RLSE),
//            VOL=SER=&VOLSERR,
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=0)
//*
//**********************************************************************
//*     DELETE MTD REPORT OF ELEMENTS CHANGED
//*     IF RESTARTING, START AT STEP0220 AND CHANGE GENHO TO '(+0)'
//**********************************************************************
//STEP0220 EXEC PGM=IEFBR14
//*JX*  DELETE MTD REPORT OF ELEMENTS CHANGED
//NEWCHG   DD DSN=&PREFR..RPT.CHGCTRL.MTD.SCLM.&SUFR,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     CREATE A MTD REPORT OF ELEMENTS CHANGED
//*     IF RESTARTING, START AT STEP0220 AND CHANGE GENHO TO '(+0)'
//**********************************************************************
//STEP0230 EXEC PGM=&PGM370,PARM='&DBG370'
//*JX*  CREATE A MTD REPORT OF ELEMENTS CHANGED
//*STEPLIB  DD DSN=SYS2.DUMMY.LOADLIB,DISP=SHR
//         INCLUDE MEMBER=JXIS&ENV
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//RDBUG    DD SYSOUT=&RPT
//*
//CHGHIST  DD DSN=&PREFHO..XTRCT.CHGCTRL.SCLM&GENHO,
//            DISP=SHR
//*
//LIBNAME  DD DSN=&SRTPRM(JXSD370S),
//            DISP=SHR
//*
//RPTRANGE DD DSN=&SRTPRM(JXSD370M),
//            DISP=SHR
//         DD DSN=&SRTPRM(JXSD3SCL),
//            DISP=SHR
//*
//CHGRPT   DD DSN=&PREFR..RPT.CHGCTRL.MTD.SCLM.&SUFR,
//            DISP=(NEW,CATLG,CATLG),
//            UNIT=&UNITR,SPACE=(TRK,(250,150),RLSE),
//            VOL=SER=&VOLSERR,
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=0)
//*
//**********************************************************************
//*     DELETE PREVMTD REPORT OF ELEMENTS CHANGED
//*     IF RESTARTING, START AT STEP0240 AND CHANGE GENHO TO '(+0)'
//**********************************************************************
//STEP0240 EXEC PGM=IEFBR14
//*JX*  DELETE PREVMTD REPORT OF ELEMENTS CHANGED
//NEWCHG   DD DSN=&PREFR..RPT.CHGCTRL.PREVMTD.SCLM.&SUFR,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     CREATE A PREVMTD REPORT OF ELEMENTS CHANGED
//*     IF RESTARTING, START AT STEP0240 AND CHANGE GENHO TO '(+0)'
//**********************************************************************
//STEP0250 EXEC PGM=&PGM370,PARM='&DBG370'
//*JX*  CREATE A REPORT OF ELEMENTS CHANGED IN PREVIOUS MONTH
//*STEPLIB  DD DSN=SYS2.DUMMY.LOADLIB,DISP=SHR
//         INCLUDE MEMBER=JXIS&ENV
//SYSUDUMP DD SYSOUT=&SDUMP
//ABNLTERM DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//RDBUG    DD SYSOUT=&RPT
//*
//CHGHIST  DD DSN=&PREFHO..XTRCT.CHGCTRL.SCLM&GENHO,
//            DISP=SHR
//*
//LIBNAME  DD DSN=&SRTPRM(JXSD370S),
//            DISP=SHR
//*
//RPTRANGE DD DSN=&SRTPRM(JXSD370V),
//            DISP=SHR
//         DD DSN=&SRTPRM(JXSD3SCL),
//            DISP=SHR
//*
//CHGRPT   DD DSN=&PREFR..RPT.CHGCTRL.PREVMTD.SCLM.&SUFR,
//            DISP=(NEW,CATLG,CATLG),
//            UNIT=&UNITR,SPACE=(TRK,(250,150),RLSE),
//            VOL=SER=&VOLSERR,
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=0)
//*
//**********************************************************************
//*     DELETE WORK FILES
//*     IF RESTARTING, START AT STEP0260
//**********************************************************************
//STEP0260 EXEC PGM=IEFBR14
//*JX*  DELETE WORK FILES
//DD1      DD DSN=&PREFW..SCDLY.ACCOUNT.BKUP.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//DD2      DD DSN=&PREFW..SCDLY.ACCOUNT.SRTD.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//DD3      DD DSN=&PREFW..SCDLY.XTRCT.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//DD4      DD DSN=&PREFW..SCDLY.LIST.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//DD5      DD DSN=&PREFW..SCDLY.XTRCT.SRTD.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//DD6      DD DSN=&PREFW..SCDLY.XTRCT.DUMMY.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//DD7      DD DSN=&PREFW..XTRCT.CHGCTRL.SCLMSRT.&SUFW,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//*
//**********************************************************************
//*     DELETE BACKUP FILES
//*     IF RESTARTING, START AT STEP0270
//**********************************************************************
//STEP0270 EXEC PGM=IEFBR14
//DD1      DD DSN=&PREFHO..XTRCT.CHGCTRL.SCLMBKUP,
//            DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,1)
//**********************************************************************
//*     COPY SCLM CHANGE HISTORY TO BACKUP
//*     IF RESTARTING, START AT STEP0270 AND CHANGE GENHO TO +0
//**********************************************************************
//STEP0280 EXEC PGM=SORT
//*JX*  COPY SCLM CHANGE HISTORY TO BACKUP
//SYSUDUMP DD SYSOUT=&SDUMP
//SYSPRINT DD SYSOUT=&SOUT
//SYSOUT   DD SYSOUT=&SOUT
//*
//SORTIN   DD DSN=&PREFHO..XTRCT.CHGCTRL.SCLM&GENHO,
//            DISP=SHR
//*
//SORTOUT  DD DSN=&PREFHO..XTRCT.CHGCTRL.SCLMBKUP,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=&UNITF,SPACE=(CYL,(150,30),RLSE),
//            DCB=(RECFM=FB,LRECL=&HSRECL,BLKSIZE=0)
//SYSIN    DD DSN=&SRTPRM(JXSR001A),DISP=SHR
//*
//SORTWK01 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK02 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//SORTWK03 DD UNIT=&UNITS,SPACE=(CYL,(50,50))
//*
//**********************************************************************
//*   END OF PROC JXPR300
//**********************************************************************
