++USERMOD(SDFP230) REWORK(1993313) .  /* DFP 2.3.0 - UY14845   */
++VER(Z038)        FMID(HDP2230)
  PRE(UY14845) .
++ZAP(IDCLC01).
 NAME IDCLC01
 VER 206E  58F0,704C
 VER 2072  5920,F058
 VER 2076  4770,A0C8
 REP 2076  4700,A0C8
