
These are linkage editor control cards which correspond to
actual installed (and working) load modules.  The CCSS load
module goes into LPA.  The others go into the Link List.
Of course, you can assemble them from the source.  This is
how they go together.  (Tested and working on OS/390 1.3 - JES3)
See member DOC on IEFSSNxx table entries needed.


** MAP      CCSS
//LKED   EXEC  PGM=IEWL,
//       PARM='NCAL,MAP,LIST,LET,RENT,REUS'
//SYSUT1   DD  UNIT=SYSDA,SPACE=(2048,(200,20))
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DSN=SBGOLOB.CCSS.LIB
//SYSLMOD  DD  DISP=SHR,DSN=SBGOLOB.CCSS.LIB
//SYSLIN   DD  *
 INCLUDE SYSLIB(CCSS)
 ORDER   CCSSVT,CCCI0000,CCAG0000,CCDA0000,SSIO0000
 MODE    RMODE(24),AMODE(31)
 ENTRY   CCSSVT
 NAME    CCSS(R)

** MAP      CCSSINIT
//LKED   EXEC  PGM=IEWL,
//       PARM='NCAL,MAP,LIST,LET,RENT,REUS'
//SYSUT1   DD  UNIT=SYSDA,SPACE=(2048,(200,20))
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DSN=SBGOLOB.CCSS.LIB
//SYSLMOD  DD  DISP=SHR,DSN=SBGOLOB.CCSS.LIB
//SYSLIN   DD  *
 INCLUDE SYSLIB(MTSSA00)
 ORDER   TSSACTV
 MODE    RMODE(24),AMODE(31)
 ENTRY   TSSACTV
 ALIAS   CCSSINIT(TSSACTV)
 NAME    MTSSA00(R)

** MAP      MTSS
//LKED   EXEC  PGM=IEWL,
//       PARM='NCAL,MAP,LIST,LET,RENT,REUS'
//SYSUT1   DD  UNIT=SYSDA,SPACE=(2048,(200,20))
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DSN=SBGOLOB.CCSS.LIB
//SYSLMOD  DD  DISP=SHR,DSN=SBGOLOB.CCSS.LIB
//SYSLIN   DD  *
 INCLUDE SYSLIB(MTSS)
 ORDER   MTSSVT,TSSNAMES
 MODE    RMODE(24),AMODE(31)
 ENTRY   MTSSVT
 NAME    MTSS(R)

** MAP      MTSSA00
//LKED   EXEC  PGM=IEWL,
//       PARM='NCAL,MAP,LIST,LET,RENT,REUS'
//SYSUT1   DD  UNIT=SYSDA,SPACE=(2048,(200,20))
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DSN=SBGOLOB.CCSS.LIB
//SYSLMOD  DD  DISP=SHR,DSN=SBGOLOB.CCSS.LIB
//SYSLIN   DD  *
 INCLUDE SYSLIB(MTSSA00)
 ORDER   TSSACTV
 MODE    RMODE(24),AMODE(31)
 ENTRY   TSSACTV
 ALIAS   CCSSINIT(TSSACTV)
 NAME    MTSSA00(R)
