PROC 0 DEBUG(     )
IF &DEBUG = DEBUG THEN CONTROL LIST CONLIST SYMLIST
CONTROL MAIN
ISPEXEC LIBDEF ISPPLIB DATASET ID('EOY.SEOYPENU')
ISPEXEC LIBDEF ISPTLIB DATASET ID('EOY.SEOYTENU')
ISPEXEC LIBDEF ISPMLIB DATASET ID('EOY.SEOYMENU')
ISPEXEC LIBDEF ISPLLIB DATASET ID('EOY.SEOYLOAD' 'EOY.SEOYLPA' -
                       'CEE.SCEERUN' 'CBC.SCLBDLL' 'GDDM.SADMMOD')
ALTLIB  ACT    APP(EXEC)      DSN('EOY.SEOYCLIB')
STEPLIB CLOSE
FREE FI(STEPLIBX)
ALLOC FI(STEPLIBX) DA('EOY.SEOYLOAD' 'EOY.SEOYLPA' 'CEE.SCEERUN' -
                              'CBC.SCLBDLL' 'GDDM.SADMMOD') SHR
STEPLIB CLOSE
ERROR GOTO FREESL
STEPLIB OPEN(STEPLIBX)
ISPEXEC SELECT CMD(%EOXVSTRT &ZALTTR) MODE(FSCR) SUSPEND -
                           NEWAPPL(EOXR) NOCHECK PASSLIB
STEPLIB CLOSE
ISPEXEC LIBDEF ISPPLIB
ISPEXEC LIBDEF ISPTLIB
ISPEXEC LIBDEF ISPMLIB
ISPEXEC LIBDEF ISPLLIB
ALTLIB  DEA    APP(EXEC)
EXIT CODE(0)
/* */
FREESL: ERROR OFF
STEPLIB CLOSE
FREE FI(STEPLIBX)
FREEIS: ISPEXEC LIBDEF ISPPLIB
ISPEXEC LIBDEF ISPTLIB
ISPEXEC LIBDEF ISPMLIB
ALTLIB  DEA    APP(EXEC)
