PROC 0
CONTROL LIST MSG SYMLIST CONLIST
FREEALL
SET MSG = &MSG
SET P =
SET &P = &STR((+1))
SET CNTR = 4
E1:SET &DSN =
ISPEXEC CONTROL DISPLAY REFRESH
ISPEXEC DISPLAY PANEL(XREF1) MSG(&MSG)
VPUT (&GROUPID &NAME) PROFILE
IF &DSN =  THEN GOTO E1
IF &DSN = QUIT THEN GOTO EXIT
SET LEN = &LENGTH(&DSN)
ALLOC FI(XREF) DA(XREF) SHR LRECL(80) BLKSIZE(80)
OPENFILE XREF OUT
SET &XREF = &STR(&DSN)
PUTFILE XREF
CLOSFILE XREF
