//Z531415L JOB 01,RPF,CLASS=A,MSGCLASS=X,NOTIFY=Z531415
//*
//*      Desc: load the members ASM, JCL, HELP, OBJ and SYS1 into
//*            a PDS
//*            Please tailor this job against your own environment.
//*            Change 'uuuu','vvvvvv', 'your-prefix'  and 'hlq'
>>*            as required.
//*
//STEP01 EXEC PGM=PDSLOAD
//SYSPRINT DD SYSOUT=*
//SYSUT2 DD DSN=hlq.V1R8M6.SRPFASM,DISP=(NEW,CATLG,DELETE),
//          DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//          UNIT=uuuu,VOL=SER=vvvvvv,
//          SPACE=(CYL,(10,2,30))
//SYSUT1 DD DSN=your-prefix.FILE415(ASM),DISP=SHR
//*
//STEP02 EXEC PGM=PDSLOAD
//SYSPRINT DD SYSOUT=*
//SYSUT2 DD DSN=hlq.V1R8M6.SRPFOBJ,DISP=(NEW,CATLG,DELETE),
//          DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200),
//          UNIT=uuuu,VOL=SER=vvvvvv,
//          SPACE=(CYL,(2,2,30))
//SYSUT1 DD DSN=your-prefix.FILE415(OBJ),DISP=SHR
//*
//STEP03 EXEC PGM=PDSLOAD
//SYSPRINT DD SYSOUT=*
//SYSUT2 DD DSN=hlq.V1R8M6.SYS1MAC,DISP=(NEW,CATLG,DELETE),
//          DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//          UNIT=uuuu,VOL=SER=vvvvvv,
//          SPACE=(CYL,(1,1,5))
//SYSUT1 DD DSN=your-prefix.FILE415(SYS1MAC),DISP=SHR
//*
//STEP04 EXEC PGM=PDSLOAD
//SYSPRINT DD SYSOUT=*
//SYSUT2 DD DSN=hlq.V1R8M6.SRPFHELP,DISP=(NEW,CATLG,DELETE),
//          DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//          UNIT=uuuu,VOL=SER=vvvvvv,
//          SPACE=(CYL,(1,1,5))
//SYSUT1 DD DSN=your-prefix.FILE415(HELP),DISP=SHR
//*
//STEP05 EXEC PGM=PDSLOAD
//SYSPRINT DD SYSOUT=*
//SYSUT2 DD DSN=hlq.V1R8M6.SRPFJCL,DISP=(NEW,CATLG,DELETE),
//          DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//          UNIT=uuuu,VOL=SER=vvvvvv,
//          SPACE=(CYL,(1,1,5))
//SYSUT1 DD DSN=your-prefix.FILE415(JCL),DISP=SHR
