//SBGOLOBK JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//VTOCLIST PROC SOUT='SYSOUT=*'
//VOL      EXEC  PGM=VTOCLIST,PARM='MAP,VOLDD',REGION=6000K
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.W$$.LINKLIB
//SYSUT1   DD  DISP=SHR,UNIT=SYSDA,VOL=SER=&VOL
//SYSPRINT DD  &SOUT,
//             SPACE=(CYL,(1,2)),
//             DCB=BLKSIZE=990
//         PEND
//*
//VOL001   EXEC VTOCLIST,VOL=DATA01
//VOL002   EXEC VTOCLIST,VOL=DATA02
//VOL003   EXEC VTOCLIST,VOL=DATA03
//VOL004   EXEC VTOCLIST,VOL=DATA04
//VOL005   EXEC VTOCLIST,VOL=DATA05
//VOL006   EXEC VTOCLIST,VOL=DATA06
