//P390COB JOB (40700),'P390',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//        NOTIFY=P390
//*
//* COMPILE AND LINK MATRIX COBOL EXAMPLE PROGRAM
//*
//JCL1    JCLLIB ORDER=(IGY310.SIGYPROC)
//COBL1   EXEC IGYWCL,LNGPRFX='IGY310'
//COBOL.SYSIN DD DSN=DIST.MATRIX.V2.SAMPLE.SOURCE(COBTBL),DISP=SHR
//COBOL.SYSLIB DD DSN=DIST.MATRIX.V2.COBOL.COPYLIB(MXPLIST),DISP=SHR
//LKED.SYSLMOD DD DSN=DIST.MATRIX.V2.SAMPLE.LOAD,DISP=SHR
//LKED.STUBLIB DD DSN=DIST.MATRIX.V2.OBJECT,DISP=SHR
//             DD DSN=SYS1.CSSLIB,DISP=SHR
//LKED.SYSIN DD *
  ENTRY COBTBL
  INCLUDE STUBLIB(MXTABLEC)
  INCLUDE STUBLIB(MXTABLES)
  INCLUDE STUBLIB(MXSTUB)
  INCLUDE STUBLIB(SRSTUBA)
  INCLUDE STUBLIB(IEANTRT)
  NAME COBTBL(R)
/*
