//P390TBL JOB (40700),'P390',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//        NOTIFY=P390
//JCL1    JCLLIB ORDER=(DIST.MATRIX.V2.PROCLIB)
//ASM20   EXEC ASMBAT,MEMBER=ASMTCRTT
// EXEC BATLINK,LIB='DIST.MATRIX.V2.SAMPLE.LOAD'
//LKED.SYSIN  DD  *
  ENTRY ASMTCRTT
  INCLUDE SYSLIB(ASMTCRTT)
  NAME ASMTCRTT(R)
/*
