//P390COBX JOB (40700),'P390',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//        NOTIFY=P390
//*
//* RUN COBOL EXAMPLE
//*
//RUN1    EXEC PGM=COBEXMP
//STEPLIB DD DSN=DIST.MATRIX.V2.SAMPLE.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//*SYSABEND DD SYSOUT=*
//*SYSUDUMP DD SYSOUT=*
