PROC 1 DATA_SET_NAME
/* CLIST NAME:  CDNLD ------------------------------------------------*/
/* INITIATE MAINFRAME FILE DOWNLOAD PROCESS                           */
/* GRAB DATA SET NAME (INCLUDING MEMBER NAME IF APPLICABLE) FROM THE  */
/* DSLIST SCREEN OR FROM MANUAL USER ENTRY.                           */
/* -------------------------------------------------------------------*/
CONTROL MSG
SET &DLMFDSN = &STR(&DATA_SET_NAME)
SET &DLWSDSN = &STR(&DATA_SET_NAME)
ISPEXEC VGET (DLTXT DLBTCH DLAUTO DLEXT)
IF &DLTXT¬=T AND &DLTXT¬=B THEN +
  SET &DLTXT=T
IF &DLBTCH¬=I AND &DLBTCH¬=B THEN +
  SET &DLBTCH=I
IF &DLAUTO¬=Y AND &DLAUTO¬=N THEN +
  SET &DLAUTO=N
IF &DLEXT¬=Y AND &DLEXT¬=N THEN +
  SET &DLEXT=Y
ISPEXEC VPUT (DLMFDSN DLWSDSN DLTXT DLBTCH DLAUTO DLEXT) PROFILE
ISPEXEC LIBDEF ISPPLIB +
    DATASET ID('KCTSHARE.TECH.ISPFCS.DISTLIB') STACK
/*  DATASET ID('KCMOC.TSO.PROD.ISPPLIB')     STACK */
/*  DATASET ID('KCTSHARE.TECH.DVLP.ISPPLIB') STACK */
/*  DATASET ID('KCTSHARE.TECH.QLTY.ISPPLIB') STACK */
ISPEXEC LIBDEF ISPMLIB +
    DATASET ID('KCTSHARE.TECH.ISPFCS.DISTLIB') STACK
/*  DATASET ID('KCMOC.TSO.PROD.ISPMLIB') STACK */
/*  DATASET ID('KCTSHARE.TECH.DVLP.ISPMLIB') STACK */
/*  DATASET ID('KCTSHARE.TECH.QLTY.ISPMLIB') STACK */
ISPEXEC LIBDEF ISPSLIB +
    DATASET ID('KCTSHARE.TECH.ISPFCS.DISTLIB') STACK
/*  DATASET ID('KCMOC.TSO.PROD.ISPSLIB')     STACK */
/*  DATASET ID('KCTSHARE.TECH.DVLP.ISPSLIB') STACK */
/*  DATASET ID('KCTSHARE.TECH.QLTY.ISPSLIB') STACK */
ISPEXEC SELECT PANEL(DNLDPANL)
ISPEXEC LIBDEF ISPPLIB DATASET
ISPEXEC LIBDEF ISPMLIB DATASET
ISPEXEC LIBDEF ISPSLIB DATASET
END
