)CM MEMBER NAME:  FILEXFER
)CM PURPOSE:  TRANSFER FILE IN BATCH MODE
)CM AUTHOR:   JIM HALLEY, 05/09/2012
//&USEID.FT JOB (FKCQBCBT,PROG),'FILEXFER',REGION=0M,
//    CLASS=K,MSGCLASS=R,NOTIFY=&USEID
//********************************************************************
//*
//*  SUBMIT THIS JOB - &USEID.FT - TO START THE FILE TRANSFER.
//*
//*  YOU WILL BE NOTIFIED WHEN &USEID.FT HAS ENDED.
//*
//*  DISPLAY OF THIS JCL MAY BE SUPPRESSED BY SELECTING
//*  AUTO-SUBMIT ON THE PREVIOUS PANEL.
//*
//*         PRESS PF3 TO RETURN TO THE PREVIOUS PANEL
//*                AFTER SUBMITTING THIS JOB.
//********************************************************************
//PRINTCTL    EXEC PGM=IEBGENER,COND=(0,NE)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
--- BEGINNING OF GENERATED FILEXFER REXX EXEC STATEMENTS --------------
//         DD DISP=SHR,
//            DSN=&REXXPDS(FILEXFER)
//         DD *
--- END OF GENERATED FILEXFER REXX EXEC STATEMENTS --------------------
//SYSUT2   DD SYSOUT=*
//SYSIN    DD DUMMY
//*
//MOVEFILE EXEC PGM=IKJEFT1B,DYNAMNBR=128,COND=(0,NE)
//ISPPROF  DD RECFM=FB,LRECL=80,SPACE=(TRK,(2,2,2))
//ISPMLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPMENU
//ISPPLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPPENU
//ISPSLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPSLIB
//         DD DISP=SHR,DSN=SYS1.ISP.SISPSENU
//ISPTLIB  DD RECFM=FB,LRECL=80,SPACE=(TRK,(1,0,1))
//         DD DISP=SHR,DSN=SYS1.ISP.SISPTENU
//ISPLOG   DD SYSOUT=*,RECFM=FB,LRECL=133
//SYSEXEC  DD DISP=(OLD,DELETE,DELETE),
//            DSN=&REXXPDS
//         DD DISP=SHR,DSN=SYS1.ISP.SISPEXEC
//SYSPROC  DD DISP=SHR,DSN=SYS1.ISP.SISPCLIB
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN  DD *
 ISPSTART CMD(FILEXFER)
