//PL1LFLG  PROC LR=150K,GR=
//*********************************************************************
//LKED     EXEC  PGM=IEWL,PARM='XREF,LIST',REGION=&LR
//SYSLIB   DD DSN=SYS1.PL1LIB,DISP=SHR
//SYSLMOD  DD DSNAME=&&GOSET(GO),DISP=(MOD,PASS),
//            UNIT=SYSDA,SPACE=(CYL,(4,,16))
//SYSUT1   DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(2,1),,CONTIG),
//            SEP=(SYSLMOD,SYSLIB),DCB=BLKSIZE=1024
//SYSPRINT DD SYSOUT=A
//SYSLIN   DD DDNAME=SYSIN
//*********************************************************************
//GO       EXEC  PGM=*.LKED.SYSLMOD,COND=(9,LT,LKED),REGION=&GR
//GOSET    DD DSN=&&GOSET,UNIT=SYSDA,DISP=(MOD,DELETE),SPACE=(TRK,0)
//SYSPRINT DD SYSOUT=A
