//DEFAULT  PROC RGREGN=512K,RGPARM='NODECK,LOAD,LIST,NOSEQN',
//         RGU3SPC='(600,(100,20))',RGU2SPC='(600,(100,20))',
//         RGU1SPC='(600,(100,20))',RGGOSPC='(80,(200,50))'
//*-------------------------------------------------------------------*
//RPG      EXEC PGM=IESRPG,REGION=&RGREGN,PARM=(&RGPARM)
//SYSPRINT DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSUT3   DD DSNAME=&&SYSUT3,UNIT=SYSDA,SPACE=&RGU3SPC
//SYSUT2   DD DSNAME=&&SYSUT2,UNIT=SYSDA,SPACE=&RGU2SPC
//SYSUT1   DD DSNAME=&&SYSUT1,UNIT=SYSDA,SPACE=&RGU1SPC
//SYSGO    DD DSNAME=&&LOADSET,UNIT=(SYSDA),
//            DISP=(MOD,PASS,DELETE),SPACE=&RGGOSPC
