//PDSCLEAN  PROC
//*******************************************************************
//* THIS PROGRAM DOES THE FOLLOWING THREE FUNCTIONS:
//*   1) EMPTY A PDS OR PDS/E DATASET
//*   2) ALTER THE ALLOCATED DIRECTORY BLOCKS OF A PDS DATASET
//*   3) COMPRESS A PDS OR PDS/E DATASET
//*
//* ENTER ONE OF THE FOLLOWING TWO COMMANDS ON THE //SYSIN DDNAME
//*    STATEMENT. MULTIPLE COMMANDS CAN BE ENTERED TO PERFORM MORE
//*    THAN ONE FUNCTION.
//*
//* ZERODIR  DDNAME
//* COMPRESS DDNAME
//* ALTERDIR DDNAME +NNN (WHERE NNNN IS ADDITIONAL DIRECTORY BLOCKS
//*                       NNNN IS A NUMERIC NUMBER FROM 1-8 DIGITS.
//*                       NEGATIVE DIRBLKS VALUES NOT ALLOWED.)
//*
//*******************************************************************
//PDSCLEAN    EXEC PGM=PDSCLEAN
//SYSPRINT    DD SYSOUT=*,DCB=(RECFM=FBA,LRECL=125,BLKSIZE=2000)
//$SYSPRT$    DD SYSOUT=*,DCB=(RECFM=FBA,LRECL=125,BLKSIZE=2000)
//SYSUDUMP    DD SYSOUT=*,DCB=(RECFM=FBA,BLKSIZE=1995)
//UNLOAD      DD UNIT=SYSALLDA,SPACE=(CYL,(050,050))
//SYSUT1      DD UNIT=SYSALLDA,SPACE=(CYL,(050,050))
//SYSUT2      DD UNIT=SYSALLDA,SPACE=(CYL,(050,050))
