***********************************************************************
*                                                                     *
*              INVOCATION PARAMETER OPTIONS                           *
*                                                                     *
***********************************************************************
         SPACE
OPTPSTR  EQU   0                   PARM STRING
OPTPLEN  EQU   OPTPSTR+12          MINIMUM LENGTH MINUS ONE
OPTPADDR EQU   OPTPLEN+0           ROUTINE ADDRESS
OPTPBITS EQU   OPTPADDR+4          SWITCHING BITS
OPTPEND  EQU   OPTPBITS+4          THE END
         SPACE
OPTEST1  DS    0F                  POSITIONAL PARMS
         DC    CL12'ADJUST',AL1(1),AL3(SWTCHEX)
         B     ADJUST
         DC    CL12'NOADJUST',AL1(3),AL3(SWTCHEX)
         B     UNADJUST
         DC    CL12'CENTER',AL1(1),AL3(SWTCHEX)
         B     ADJUST
         DC    CL12'CENTRE',AL1(4),AL3(SWTCHEX)
         B     ADJUST
         DC    CL12'NOCENTER',AL1(3),AL3(SWTCHEX)
         B     UNADJUST
         DC    CL12'NOCENTRE',AL1(6),AL3(SWTCHEX)
         B     SWTCHNNM
         DC    CL12'CONTINUE',AL1(1),AL3(SWTCHEX)
         B     SWCONT
         DC    CL12'NOCONTINUE',AL1(3),AL3(SWTCHEX)
         B     SWCONTNO
         DC    CL12'DEBUG',AL1(4),AL3(SWTCHEX)
        $ON    PARMSWCH,DBSWS
         DC    CL12'NODEBUG',AL1(6),AL3(SWTCHEX)
        $OFF   PARMSWCH,DBSWS
         DC    CL12'FORMATTED',AL1(1),AL3(SWTCHFO)
         DC    AL1(0,0,0,0)
         DC    CL12'UNFORMATTED',AL1(1),AL3(SWTCHNF)
         DC    AL1(0,0,0,0)
         DC    CL12'NOFORMATTED',AL1(3),AL3(SWTCHNF)
         DC    AL1(0,0,0,0)
         DC    CL12'LOCAL',AL1(2),AL3(SWTCHEX)
        $OFF   PARMSWCH,GBLSWS
         DC    CL12'GLOBAL',AL1(2),AL3(SWTCHEX)
        $ON    PARMSWCH,GBLSWS
         DC    CL12'MARK',AL1(1),AL3(SWTCHEX)
        $ON    PARMSWCH,MASWS
         DC    CL12'NOMARK',AL1(3),AL3(SWTCHEX)
        $OFF   PARMSWCH,MASWS
         DC    CL12'NUMBER',AL1(1),AL3(SWTCHEX)
         B     SWTCHNM
         DC    CL12'NONUMBER',AL1(3),AL3(SWTCHEX)
         B     SWTCHNNM
         DC    CL12'PROFILE',AL1(3),AL3(SWTCHEX)
        $ON    PARMSWCH,PROFSW
         DC    CL12'NOPROFILE',AL1(5),AL3(SWTCHEX)
        $OFF   PARMSWCH,PROFSW
         DC    CL12'QUIET',AL1(1),AL3(SWTCHEX)
        $ON    PARMSWCH,QUSWS
         DC    CL12'NOQUIET',AL1(3),AL3(SWTCHEX)
        $OFF   PARMSWCH,QUSWS
         DC    CL12'SCREEN',AL1(3),AL3(SWTCHEX)
        $ON    TTYPE,TSCREEN
         DC    CL12'NOSCREEN',AL1(5),AL3(SWTCHEX)
        $OFF   TTYPE,TSCREEN
         DC    CL12'SIX',AL1(2),AL3(SWTCHEX)
         B     SWTCHP6
         DC    CL12'EIGHT',AL1(2),AL3(SWTCHEX)
         B     SWTCHP8
         DC    CL12'SPIE',AL1(3),AL3(SWTCHEX)
        $OFF   PARMSWCH,DBSWS
         DC    CL12'NOSPIE',AL1(5),AL3(SWTCHEX)
        $ON    PARMSWCH,DBSWS
         DC    CL12'STATISTICS',AL1(3),AL3(SWTCHEX)
        $ON    PARMSWCH,STATSWS
         DC    CL12'NOSTATISTICS',AL1(5),AL3(SWTCHEX)
        $OFF   PARMSWCH,STATSWS
         DC    CL12'STOP',AL1(1),AL3(SWTCHEX)
        $ON    PARMSWCH,STSWS
         DC    CL12'NOSTOP',AL1(3),AL3(SWTCHEX)
        $OFF   PARMSWCH,STSWS
         DC    CL12'TRANSLATE',AL1(1),AL3(SWTCHEX)
        $ON    PARMSWCH,TROSWS
         DC    CL12'NOTRANSLATE',AL1(3),AL3(SWTCHEX)
        $OFF   PARMSWCH,TROSWS
         DC    CL12'TWOPASS',AL1(3),AL3(SWTCHEX)
         MVI   DEFPASOF+TAB3DEF+3,X'02'
         DC    CL12'ONEPASS',AL1(3),AL3(SWTCHEX)
         MVI   DEFPASOF+TAB3DEF+3,X'01'
         DC    CL12'2PASS',AL1(1),AL3(SWTCHEX)
         MVI   DEFPASOF+TAB3DEF+3,X'02'
         DC    CL12'1PASS',AL1(1),AL3(SWTCHEX)
         MVI   DEFPASOF+TAB3DEF+3,X'01'
         DC    CL12'UPCASE',AL1(1),AL3(SWTCHEX)
        $ON    PARMSWCH,TROSWS
         DC    CL12'NOUPCASE',AL1(3),AL3(SWTCHEX)
        $OFF   PARMSWCH,TROSWS
         DC    CL12'UPPER',AL1(2),AL3(SWTCHEX)
        $OFF   PARMSWCH,NUPSWS
         DC    CL12'NOUPPER',AL1(4),AL3(SWTCHEX)
        $ON    PARMSWCH,NUPSWS
         DC    CL12'NOWAIT',AL1(2),AL3(SWTCHEX)
        $ON    PARMSWCH,NOSWS
         DC    CL12'WAIT',AL1(1),AL3(SWTCHEX)
        $OFF   PARMSWCH,NOSWS
         SPACE
         DC    CL12'TERMINAL',AL1(1),AL3(SWTCHEX)
        $ON    TTYPE,TONLINE
         DC    CL12'ONLINE',AL1(1),AL3(SWTCHEX)
        $ON    TTYPE,TONLINE
         DC    CL12'PRINTER',AL1(1),AL3(SWTCHEX)
        $OFF   TTYPE,TONLINE
         DC    CL12'PRT',AL1(1),AL3(SWTCHEX)
        $OFF   TTYPE,TONLINE
         DC    CL12'OFFLINE',AL1(1),AL3(SWTCHEX)
        $OFF   TTYPE,TONLINE
         DC    CL12'FILE',AL1(1),AL3(SWTCHEX)
        $ON    TTYPE,TFILE
         DC    CL12'NOFILE',AL1(3),AL3(SWTCHEX)
        $OFF   TTYPE,TFILE
         SPACE
         DC    CL12'X1620',AL1(4),AL3(SWTCHEX)
         MVI   TDEVICE,TX1620
         DC    CL12'MULTI3',AL1(5),AL3(SWTCHEX)
         MVI   TDEVICE,TXASM3
         DC    CL12'QUME',AL1(3),AL3(SWTCHEX)
         MVI   TDEVICE,TQUME
         DC    CL12'ASISTERM',AL1(3),AL3(SWTCHEX)
         MVI   TDEVICE,TXASIS
         DC    CL12'MYTERM',AL1(5),AL3(SWTCHEX)
         MVI   TDEVICE,TMYTE
         DC    4AL1(FF)            THE END
         SPACE
OPTEST2  DS    0F
         DC    CL12'ADJUST',AL1(1),AL3(SWTCHDGT)
         DC    AL4(DEFADJ-DEFAULTS)
         DC    CL12'BMARGIN',AL1(1),AL3(SWTCHDGT)
         DC    AL4(DEFBM-DEFAULTS)
         DC    CL12'CENTER',AL1(1),AL3(SWTCHDGT)
         DC    AL4(DEFADJ-DEFAULTS)
         DC    CL12'CENTRE',AL1(4),AL3(SWTCHDGT)
         DC    AL4(DEFADJ-DEFAULTS)
         DC    CL12'CONTINUE',AL1(1),AL3(SWTCHDGT)
         DC    AL4(DEFCONT-DEFAULTS)
         DC    CL12'CPINCH',AL1(2),AL3(SWTCHDGT)
         DC    AL4(DEFCPI-DEFAULTS)
         DC    CL12'DARK',AL1(1),AL3(SWTCHDGT)
         DC    AL4(DEFDARK-DEFAULTS)
         DC    CL12'FFCHANNEL',AL1(2),AL3(SWTCHDGT)
         DC    AL4(DEFFFCH-DEFAULTS)
         DC    CL12'FFTOP',AL1(2),AL3(SWTCHDGT)
         DC    AL4(DEFFFTO-DEFAULTS)
         DC    CL12'FMARGIN',AL1(1),AL3(SWTCHDGT)
         DC    AL4(DEFFTMG-DEFAULTS)
         DC    CL12'FNSIZE',AL1(2),AL3(SWTCHDGT)
         DC    AL4(DEFFNSIZ-DEFAULTS)
         DC    CL12'HMARGIN',AL1(1),AL3(SWTCHDGT)
         DC    AL4(DEFHDMG-DEFAULTS)
         DC    CL12'HSFSOVER',AL1(3),AL3(SWTCHDGT)
         DC    AL4(DEFHSFS-DEFAULTS)
         DC    CL12'LEGALNUMBER',AL1(2),AL3(LEGDGT)
         DC    AL4(DEFLNUM-DEFAULTS)
         DC    CL12'LINENUMBER',AL1(2),AL3(LINDGT)
         DC    AL4(DEFLNUM-DEFAULTS)
         DC    CL12'LLENGTH',AL1(1),AL3(SWTCHDGT)
         DC    AL4(DEFLL-DEFAULTS)
         DC    CL12'NUMBER',AL1(1),AL3(NUMDGT)
         DC    AL4(DEFNUM-DEFAULTS)
         DC    CL12'PAGES',AL1(1),AL3(PAGPARM)
         DC    AL4(DEFPAGS-DEFAULTS)
OPTPAGEL DC    CL12'PAGELAST',AL1(4),AL3(PAGPARML)
         DC    AL4(DEFPAGL-DEFAULTS)
         DC    CL12'PASSES',AL1(2),AL3(SWTCHDGT)
         DC    AL4(DEFPASOF-DEFAULTS)
         DC    CL12'PLENGTH',AL1(1),AL3(SWTCHDGT)
         DC    AL4(DEFPL-DEFAULTS)
         DC    CL12'RMSIZE',AL1(2),AL3(SWTCHDGT)
         DC    AL4(DEFRMSIZ-DEFAULTS)
         DC    CL12'SEQCOLUMN',AL1(3),AL3(SWTCHDGT)
         DC    AL4(DEFSEQC-DEFAULTS)
         DC    CL12'SRLENGTH',AL1(2),AL3(SWTCHDGT)
         DC    AL4(DEFRNLEN-DEFAULTS)
         DC    CL12'TABLEFT',AL1(3),AL3(SWTCHDGT)
         DC    AL4(DEFTABL-DEFAULTS)
         DC    CL12'TMARGIN',AL1(1),AL3(SWTCHDGT)
         DC    AL4(DEFTM-DEFAULTS)
         DC    4AL1(FF)            THE END
