000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    COB1.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. IBM-3090.
000600 OBJECT-COMPUTER. IBM-3090.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900     SELECT REPORT-FILE ASSIGN TO UT-S-REPORT.
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD  REPORT-FILE
001300     RECORDING MODE IS V
001400     BLOCK CONTAINS 0 RECORDS.
001500 01  RPTSYSTABAUTH.
001600     10 GRANTOR              PIC X(8).
001700     10 GRANTEE              PIC X(8).
001800     10 TCREATOR             PIC X(8).
001900     10 TTNAME.
002000        49 TTNAME-LEN        PIC S9(4) USAGE COMP.
002100        49 TTNAME-TEXT       PIC X(18).
002200     10 FILLER               PIC X(2).
002300     10 DATEGRANTED          PIC X(6).
002400     10 FILLER               PIC X(8).
002500     10 UPDATECOLS           PIC X(1).
002600     10 FILLER               PIC X(8).
002700     10 ALTERAUTH            PIC X(1).
002800     10 FILLER               PIC X(8).
002900     10 DELETEAUTH           PIC X(1).
003000     10 FILLER               PIC X(8).
003100     10 INDEXAUTH            PIC X(1).
003200     10 FILLER               PIC X(8).
003300     10 INSERTAUTH           PIC X(1).
003400     10 FILLER               PIC X(8).
003500     10 SELECTAUTH           PIC X(1).
003600     10 FILLER               PIC X(8).
003700     10 UPDATEAUTH           PIC X(1).
003800 01  RPT-HEADINGS            PIC X(132).
003900 WORKING-STORAGE SECTION.
004000 01  WS-START             PIC X(16)  VALUE 'XXXXXXXXXXXXXXXX'.
004100 01  ALPHA-FIELDS.
004200   05  USERID             PIC X(8)   VALUE SPACES.
004300   05  CURRENT-DATE.
004400       10  YR             PIC X(2).
004500       10  MO             PIC X(2).
004600       10  DY             PIC X(2).
004700   05  TIME-OF-DAY.
004800       10  HH             PIC X(2).
004900       10  MM             PIC X(2).
005000       10  SS             PIC X(2).
005100       10  CC             PIC X(2).
005200   05  PRINT-DATE         PIC X(8).
005300   05  PRINT-TIME         PIC X(8).
005400 01  ALPHA-LITERALS.
005500   05  DUMMY              PIC X(4)   VALUE SPACES.
005600 01  NUMERIC-FIELDS.
005700   05  GROUP-COUNTER        PIC S9(8) COMP VALUE +0.
005800   05  COUNTER              PIC S9(8)      VALUE +0.
005900   05  PRINT-RC             PIC  9(3).
006000 01  RPT-HEADER1.
006100     10 GRANTOR-H            PIC X(8)  VALUE 'GRANTOR'.
006200     10 GRANTEE-H            PIC X(8)  VALUE 'GRANTEE'.
006300     10 TCREATOR-H           PIC X(8)  VALUE 'CREATOR'.
006400     10 TTNAME-H.
006500        49 TTNAME-LEN-H      PIC S9(4) USAGE COMP.
006600        49 TTNAME-TEXT-H     PIC X(18) VALUE 'TABLENAME'.
006700     10 DATEGRANTED-H        PIC X(6)  VALUE 'DATE'.
006800     10 FILLER               PIC X(8).
006900     10 UPDATECOLS-H         PIC X(9)  VALUE 'COLUMNS'.
007000     10 ALTERAUTH-H          PIC X(9)  VALUE 'ALTER'.
007100     10 DELETEAUTH-H         PIC X(9)  VALUE 'DELETE'.
007200     10 INDEXAUTH-H          PIC X(9)  VALUE 'INDEX'.
007300     10 INSERTAUTH-H         PIC X(9)  VALUE 'INSERT'.
007400     10 SELECTAUTH-H         PIC X(9)  VALUE 'SELECT'.
007500     10 UPDATEAUTH-H         PIC X(9)  VALUE 'UPDATE'.
007600******************************************************************
007700*    SQLCA INCLUDE                                               *
007800******************************************************************
007900     EXEC SQL INCLUDE SQLCA END-EXEC.
008000******************************************************************
008100*    DCLGEN TABLE(SYSIBM.SYSTABAUTH)                             *
008200******************************************************************
008300     EXEC SQL DECLARE SYSIBM.SYSTABAUTH TABLE
008400     ( GRANTOR                        CHAR(8) NOT NULL,
008500       GRANTEE                        CHAR(8) NOT NULL,
008600       GRANTEETYPE                    CHAR(1) NOT NULL,
008700       DBNAME                         CHAR(8) NOT NULL,
008800       SCREATOR                       CHAR(8) NOT NULL,
008900       STNAME                         VARCHAR(18) NOT NULL,
009000       TCREATOR                       CHAR(8) NOT NULL,
009100       TTNAME                         VARCHAR(18) NOT NULL,
009200       AUTHHOWGOT                     CHAR(1) NOT NULL,
009300       TIMESTAMP                      CHAR(12) NOT NULL,
009400       DATEGRANTED                    CHAR(6) NOT NULL,
009500       TIMEGRANTED                    CHAR(8) NOT NULL,
009600       UPDATECOLS                     CHAR(1) NOT NULL,
009700       ALTERAUTH                      CHAR(1) NOT NULL,
009800       DELETEAUTH                     CHAR(1) NOT NULL,
009900       INDEXAUTH                      CHAR(1) NOT NULL,
010000       INSERTAUTH                     CHAR(1) NOT NULL,
010100       SELECTAUTH                     CHAR(1) NOT NULL,
010200       UPDATEAUTH                     CHAR(1) NOT NULL,
010300       IBMREQD                        CHAR(1) NOT NULL,
010400       GRANTEELOCATION                CHAR(16) NOT NULL,
010500       LOCATION                       CHAR(16) NOT NULL,
010600       COLLID                         CHAR(18) NOT NULL,
010700       CONTOKEN                       CHAR(8) NOT NULL,
010800       CAPTUREAUTH                    CHAR(1) NOT NULL
010900     ) END-EXEC.
011000******************************************************************
011100* COBOL DECLARATION FOR TABLE SYSIBM.SYSTABAUTH                  *
011200******************************************************************
011300 01  DCLSYSTABAUTH.
011400     10 GRANTOR              PIC X(8).
011500     10 GRANTEE              PIC X(8).
011600     10 GRANTEETYPE          PIC X(1).
011700     10 DBNAME               PIC X(8).
011800     10 SCREATOR             PIC X(8).
011900     10 STNAME.
012000        49 STNAME-LEN        PIC S9(4) USAGE COMP.
012100        49 STNAME-TEXT       PIC X(18).
012200     10 TCREATOR             PIC X(8).
012300     10 TTNAME.
012400        49 TTNAME-LEN        PIC S9(4) USAGE COMP.
012500        49 TTNAME-TEXT       PIC X(18).
012600     10 AUTHHOWGOT           PIC X(1).
012700     10 TIMESTAMP            PIC X(12).
012800     10 DATEGRANTED          PIC X(6).
012900     10 TIMEGRANTED          PIC X(8).
013000     10 UPDATECOLS           PIC X(1).
013100     10 ALTERAUTH            PIC X(1).
013200     10 DELETEAUTH           PIC X(1).
013300     10 INDEXAUTH            PIC X(1).
013400     10 INSERTAUTH           PIC X(1).
013500     10 SELECTAUTH           PIC X(1).
013600     10 UPDATEAUTH           PIC X(1).
013700     10 IBMREQD              PIC X(1).
013800     10 GRANTEELOCATION      PIC X(16).
013900     10 LOCATION             PIC X(16).
014000     10 COLLID               PIC X(18).
014100     10 CONTOKEN             PIC X(8).
014200     10 CAPTUREAUTH          PIC X(1).
014300******************************************************************
014400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 25      *
014500******************************************************************
014600******************************************************************
014700* DCLGEN TABLE(SYSIBM.SYSUSERAUTH)                               *
014800******************************************************************
014900     EXEC SQL DECLARE SYSIBM.SYSUSERAUTH TABLE
015000     ( GRANTOR                        CHAR(8) NOT NULL,
015100       GRANTEE                        CHAR(8) NOT NULL,
015200       TIMESTAMP                      CHAR(12) NOT NULL,
015300       DATEGRANTED                    CHAR(6) NOT NULL,
015400       TIMEGRANTED                    CHAR(8) NOT NULL,
015500       GRANTEETYPE                    CHAR(1) NOT NULL,
015600       AUTHHOWGOT                     CHAR(1) NOT NULL,
015700       ALTERBPAUTH                    CHAR(1) NOT NULL,
015800       BINDADDAUTH                    CHAR(1) NOT NULL,
015900       BSDSAUTH                       CHAR(1) NOT NULL,
016000       CREATEDBAAUTH                  CHAR(1) NOT NULL,
016100       CREATEDBCAUTH                  CHAR(1) NOT NULL,
016200       CREATESGAUTH                   CHAR(1) NOT NULL,
016300       DISPLAYAUTH                    CHAR(1) NOT NULL,
016400       RECOVERAUTH                    CHAR(1) NOT NULL,
016500       STOPALLAUTH                    CHAR(1) NOT NULL,
016600       STOSPACEAUTH                   CHAR(1) NOT NULL,
016700       SYSADMAUTH                     CHAR(1) NOT NULL,
016800       SYSOPRAUTH                     CHAR(1) NOT NULL,
016900       TRACEAUTH                      CHAR(1) NOT NULL,
017000       IBMREQD                        CHAR(1) NOT NULL,
017100       MON1AUTH                       CHAR(1) NOT NULL,
017200       MON2AUTH                       CHAR(1) NOT NULL,
017300       CREATEALIASAUTH                CHAR(1) NOT NULL,
017400       SYSCTRLAUTH                    CHAR(1) NOT NULL,
017500       BINDAGENTAUTH                  CHAR(1) NOT NULL,
017600       ARCHIVEAUTH                    CHAR(1) NOT NULL,
017700       CAPTURE1AUTH                   CHAR(1) NOT NULL,
017800       CAPTURE2AUTH                   CHAR(1) NOT NULL
017900     ) END-EXEC.
018000******************************************************************
018100* COBOL DECLARATION FOR TABLE SYSIBM.SYSUSERAUTH                 *
018200******************************************************************
018300 01  DCLSYSUSERAUTH.
018400     10 GRANTOR              PIC X(8).
018500     10 GRANTEE              PIC X(8).
018600     10 TIMESTAMP            PIC X(12).
018700     10 DATEGRANTED          PIC X(6).
018800     10 TIMEGRANTED          PIC X(8).
018900     10 GRANTEETYPE          PIC X(1).
019000     10 AUTHHOWGOT           PIC X(1).
019100     10 ALTERBPAUTH          PIC X(1).
019200     10 BINDADDAUTH          PIC X(1).
019300     10 BSDSAUTH             PIC X(1).
019400     10 CREATEDBAAUTH        PIC X(1).
019500     10 CREATEDBCAUTH        PIC X(1).
019600     10 CREATESGAUTH         PIC X(1).
019700     10 DISPLAYAUTH          PIC X(1).
019800     10 RECOVERAUTH          PIC X(1).
019900     10 STOPALLAUTH          PIC X(1).
020000     10 STOSPACEAUTH         PIC X(1).
020100     10 SYSADMAUTH           PIC X(1).
020200     10 SYSOPRAUTH           PIC X(1).
020300     10 TRACEAUTH            PIC X(1).
020400     10 IBMREQD              PIC X(1).
020500     10 MON1AUTH             PIC X(1).
020600     10 MON2AUTH             PIC X(1).
020700     10 CREATEALIASAUTH      PIC X(1).
020800     10 SYSCTRLAUTH          PIC X(1).
020900     10 BINDAGENTAUTH        PIC X(1).
021000     10 ARCHIVEAUTH          PIC X(1).
021100     10 CAPTURE1AUTH         PIC X(1).
021200     10 CAPTURE2AUTH         PIC X(1).
021300******************************************************************
021400* THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 29      *
021500******************************************************************
021600 01  WS-NULL-INDICATORS.
021700   02  NI25             PIC S9(2)  COMP  OCCURS  25 TIMES.
021800   02  NI29             PIC S9(2)  COMP  OCCURS  29 TIMES.
021900******************************************************************
022000     EXEC SQL DECLARE C1 CURSOR FOR
022100       SELECT
022200       GRANTOR,
022300       GRANTEE,
022400       GRANTEETYPE,
022500       DBNAME,
022600       SCREATOR,
022700       STNAME,
022800       TCREATOR,
022900       TTNAME,
023000       AUTHHOWGOT,
023100       TIMESTAMP,
023200       DATEGRANTED,
023300       TIMEGRANTED,
023400       UPDATECOLS,
023500       ALTERAUTH,
023600       DELETEAUTH,
023700       INDEXAUTH,
023800       INSERTAUTH,
023900       SELECTAUTH,
024000       UPDATEAUTH,
024100       IBMREQD,
024200       GRANTEELOCATION,
024300       LOCATION,
024400       COLLID,
024500       CONTOKEN,
024600       CAPTUREAUTH
024700       FROM SYSIBM.SYSTABAUTH A
024800       WHERE GRANTEE = :USERID
024900       END-EXEC.
025000*
025100     EXEC SQL DECLARE C2 CURSOR FOR
025200       SELECT
025300     B.GRANTOR,
025400     B.GRANTEE,
025500     B.TIMESTAMP,
025600     B.DATEGRANTED,
025700     B.TIMEGRANTED,
025800     B.GRANTEETYPE,
025900     B.AUTHHOWGOT,
026000     B.ALTERBPAUTH,
026100     B.BINDADDAUTH,
026200     B.BSDSAUTH,
026300     B.CREATEDBAAUTH,
026400     B.CREATEDBCAUTH,
026500     B.CREATESGAUTH,
026600     B.DISPLAYAUTH,
026700     B.RECOVERAUTH,
026800     B.STOPALLAUTH,
026900     B.STOSPACEAUTH,
027000     B.SYSADMAUTH,
027100     B.SYSOPRAUTH,
027200     B.TRACEAUTH,
027300     B.IBMREQD,
027400     B.MON1AUTH,
027500     B.MON2AUTH,
027600     B.CREATEALIASAUTH,
027700     B.SYSCTRLAUTH,
027800     B.BINDAGENTAUTH,
027900     B.ARCHIVEAUTH,
028000     B.CAPTURE1AUTH,
028100     B.CAPTURE2AUTH
028200       FROM SYSIBM.SYSUSERAUTH B
028300       WHERE B.GRANTEE = :USERID
028400       END-EXEC.
028500 01  WS-END             PIC X(16)  VALUE 'XXXXXXXXXXXXXXXX'.
028600*
028700 LINKAGE SECTION.
028800 01  EXEC-PARM.
028900   05  PARM-LENGTH          PIC S9(4) COMP.
029000   05  PARM-DATA            PIC X(8).
029100*
029200 PROCEDURE DIVISION USING EXEC-PARM.
029300     DISPLAY 'EXECUTION STARTED'.
029400 SIGNON.
029500     IF PARM-LENGTH LESS THAN 4
029600     THEN GO TO SIGNOFF
029700     ELSE STRING PARM-DATA DELIMITED X'00' INTO USERID.
029800     DISPLAY 'USERID ' USERID.
029900     DISPLAY 'SEARCH FOR TABLE ACCESS'.
030000     OPEN OUTPUT REPORT-FILE.
030100     ACCEPT CURRENT-DATE FROM DATE.
030200     ACCEPT TIME-OF-DAY FROM TIME.
030300     STRING HH ':' MM ':' SS DELIMITED SIZE INTO PRINT-TIME.
030400     STRING YR '/' MO '/' DY DELIMITED SIZE INTO PRINT-DATE.
030500     EXEC SQL OPEN C1 END-EXEC.
030600     EXEC SQL OPEN C2 END-EXEC.
030700     MOVE RPT-HEADER1 TO RPT-HEADINGS.
030800     WRITE RPT-HEADINGS.
030900     MOVE SPACES TO RPT-HEADINGS.
031000     WRITE RPT-HEADINGS.
031100 MAINLINE.
031200 REPORT1.
031300     EXEC SQL FETCH C1 INTO :DCLSYSTABAUTH :NI25 END-EXEC.
031400     PERFORM PTSQLCA.
031500     IF SQLCODE NOT EQUAL ZERO
031600     THEN GO TO REPORT1-END.
031700     MOVE SPACES TO TTNAME-TEXT OF RPTSYSTABAUTH.
031800     MOVE CORRESPONDING DCLSYSTABAUTH TO RPTSYSTABAUTH.
031900     WRITE RPTSYSTABAUTH.
032000     GO TO REPORT1.
032100 REPORT1-END.
032200     DISPLAY 'SEARCH FOR AUTHORIZATIONS'.
032300 REPORT2.
032400     EXEC SQL FETCH C2 INTO :DCLSYSUSERAUTH :NI29 END-EXEC.
032500     PERFORM PTSQLCA.
032600     IF SQLCODE NOT EQUAL ZERO
032700     THEN GO TO REPORT2-END.
032800     IF SYSOPRAUTH = 'Y'
032900     THEN DISPLAY 'USERID ' USERID ' HAS SYSOPER ' .
033000     IF SYSADMAUTH = 'Y'
033100     THEN DISPLAY 'USERID ' USERID ' HAS SYSADAM '  .
033200     GO TO REPORT2.
033300 REPORT2-END.
033400 SIGNOFF.
033500     EXEC SQL CLOSE C1 END-EXEC.
033600     EXEC SQL CLOSE C2 END-EXEC.
033700     CLOSE REPORT-FILE.
033800     DISPLAY 'EXECUTION COMPLETE'.
033900     GOBACK.
034000 PTSQLCA.
034100     MOVE SQLCODE TO PRINT-RC.
034200     DISPLAY 'RC=' PRINT-RC.
034300 PTSQLCA-EXIT.
034400     EXIT.
034500*END*
