//XXXXXXXH JOB (TYYYYY,XXXX),'D.LEES.X4392',CLASS=R,
//      MSGCLASS=T,MSGLEVEL=1,NOTIFY=XXXXXXX,TIME=(30),
//      REGION=17M
//*====================================================*//
//* ALL ASSEMBLED AND RUN ON OS/390 2.5 SYSTEM         *//
//*====================================================*//
//ASM    EXEC   ASMACL,PARM.ASM='XREF(SHORT)',
//       PARM.LKED='LET,LIST,XREF,AMODE=24,RMODE=24,AC=0',
//       COND.LKED=(5,LT)
//*STEPLIB DD  DSN=SYS1.ASMA.V1R2M0.SASMMOD1,DISP=SHR
//SYSLIB DD    BLKSIZE=32760                        SYS1.MACLIB
//       DD    DSN=SYS1.MODGEN,DISP=SHR
//       DD    DSN=SYS1.AMODGEN,DISP=SHR,UNIT=SYSDA,VOL=SER=(DLB001)
//       DD    DSN=SYS1.AMACLIB,DISP=SHR,UNIT=SYSDA,VOL=SER=(DLB001)
//       DD    DSN=TST.DZL.XMIT,DISP=SHR
//ASM.SYSPRINT DD SYSOUT=*  (A,,XXX)
//SYSIN  DD    DISP=SHR,DSN=TST.DZL.XMIT(MEMLIST)
//LKED.SYSLMOD  DD DISP=SHR,DSN=TST.DZL.XMIT.LOAD(MEMLIST)
//LKED.SYSLIB   DD DISP=SHR,DSN=TST.DZL.XMIT.LOAD
