/*REXX*/
/* VERY SIMPLE EXEC TO DELETE AN ALIAS FROM THE MCAT */
SIGNAL OFF ERROR
CALL OFF ERROR
ARG ALIAS MCAT PWD
CMD = " DELETE ('"ALIAS"') ALIAS"
CMD = CMD " CATALOG('"MCAT"'/"PWD")"
/* CMD = "DELETE ('"ALIAS"'/"PWD")"*/
SAY CMD
ADDRESS TSO  "  "CMD
RCODE = RC
SAY RCODE
EXIT RCODE
