/* rexx */
allvars = "title title1 title2 title3 title4 title5 title6 sname"
signal off error
allvars = allvars "vname1 vname2 vname3 vname4 vname5 vname6"
address  ispexec "verase ("allvars") profile"
title   = "STC ACID addition screen"
title1  = "Specify the STC name ( member name ) "
vname1  = "STC name"
title2  = "Specify the ACID name to be associated with the STC"
vname2  = "ACID name"
DATAREQ = "CHAR CHAR"
putvars = "title title1 title2"
putvars = putvars "vname1 vname2 datareq"
address  ispexec "vput ("putvars") profile"
exit 0
