/** REXX THE WONDER DOGG                                 **/
/**********************************************************/
/** REMOVED THE CODE TO DELETE ALIAS FROM IMS            **/
/**********************************************************/
/** BASELINE BASELINE BASELINE BASELINE BASELINE BASELINE**/
/**********************************************************/
/** EXEC NAME        : T50DEL                            **/
/** LAST MODIFIED    : 07 DEC 94                         **/
/**----------------INPUT REQUIRED -----------------------**/
/** PASSED ARGS        VALID VALUES                      **/
/** ACID    : THE ACID YOU WISH DELETED.                 **/
/** MODE    : THE CURRENT MODE "BATCH" OR "ONLINE"       **/
/** ISPF VGETS         VALID VALUES                      **/
/** UIDTABLE : THE GROUP OF 2 CHR NON TSS ID PREFIXES    **/
/** TVER     : THE CURRENT TSS VERSION VARIABLE          **/
/** DSBACK   : THE DS WHERE TO TAKE A BACKUP COPY        **/
/** DS5      : THE DS WHERE TO PUT BATCH SYSIN UPDATES   **/
/**----------------OUTPUT PRODUCED-----------------------**/
/** VALID CONDITION CODES - 00                           **/
/** ISPF VARIABLES        - SECRC                        **/
/**                                                      **/
/**----------------REQUIREMENTS--------------------------**/
/** CAN RUN STANDALONE : YES ( NOTE VGETS )              **/
/** ISPF ENVIRONMENT   : YES                             **/
/** EXECS CALLED WITHIN THIS EXEC : T4?LSTO TSSAUDR      **/
/**                                 TSSACNT              **/
/**********************************************************/
ARG ACID MODE
SIGNAL OFF ERROR
SECRC = "T50DEL HAS ENDED ABNORMALLY."
ADDRESS ISPEXEC "VPUT SECRC PROFILE"
ADDRESS ISPEXEC "VGET UADSBACK PROFILE"
ADDRESS ISPEXEC "VGET UIDTABLE PROFILE"
ADDRESS ISPEXEC "VGET TVER PROFILE"
ADDRESS ISPEXEC "VGET AUD PROFILE"
ADDRESS ISPEXEC "VGET DSBACK PROFILE"
ADDRESS ISPEXEC "VGET DS5 PROFILE"
UIDENTRY = LENGTH(UIDTABLE)/2
UIDSTART = 1
ACID2 = SUBSTR(ACID,1,2)
DSLIST = "'"DSBACK"("||ACID||")'"
SAY "T50DEL: BUILDING UID BYPASS TABLE ARRAY OF " UIDENTRY "ENTRIES"
DO X = 1 TO UIDENTRY
  UID.X = SUBSTR(UIDTABLE,UIDSTART,2)
  UIDSTART = UIDSTART + 2
END
NONTSS = "NO"
DO T = 1 TO UIDENTRY
  IF (ACID2 = UID.T) THEN NONTSS = "YES"
END
IF NONTSS =  "NO" THEN DO
  ADDRESS TSO "%T50GDAT " ACID "TSOLACCT  TSO"
  ADDRESS ISPEXEC "VGET SECRC PROFILE"
  IF SECRC = "$BADTSS" THEN SIGNAL BADTSS
  IF SECRC /= "$NOTFOUND" THEN DO
    BOOK = SECRC
    X5 = TSSCHECK("BOOKNUM",BOOK,"UPDATE")  /* CAN THEY DO THIS */
    SAY "T50DEL: TSSCHECK RETURN CODE IS " X5
    IF X5 /= "OK"  THEN SIGNAL BOOKAUTH
  END
END
IF MODE = "BATCH" THEN DO
  SAY "T50DEL: BATCH MODE DETECTED. ALLOCATING " DS5 "TO BJCL DDN"
  ADDRESS TSO "ALLOC DDN(BJCL) DSN("DS5") MOD REUS"
  BJCL.1 = "%"TVER"LSTO" ACID "ALLPW"  DSLIST
  BJCL.2 = "%RXREPRO SYS1.UADS("ACID"0) "UADSBACK"("ACID"0)"
  BJCL.2 = " "
  BJCL.3 = "TSS DEL( "ACID")"
  BJCL.4 = "ACCOUNT"
  BJCL.5 = "DEL ("ACID ")"
  BJCL.6 = "E"
  BJCL.7 = "%TSSAUDR " ACID AUD
  BJCL.8 = "%IMSDALIA" ACID
  BJCL.8 = "  "
  IF NONTSS = "YES"  THEN DO
    BJCL.1 = "%"TVER"LSTO" ACID||"@  ALLPW"  DSLIST
    BJCL.2 = "TSS DEL( "ACID"@)"
  END
  ADDRESS MVS "EXECIO 8 DISKW BJCL (FINIS STEM BJCL.)"
  SECRC = "BATCH FILE UPDATED WITH DELETE COMMAND STREAM FOR " ACID
END
ELSE DO
  TOTCODE = 0
  SIGNAL OFF ERROR
  SAY "T50DEL: ONLINE MODE DETECTED. EXECUTING DELETE STREAM"
  SECRC = "DELETE COMMAND STREAM FOR " ACID "FLUSHED."
  /***************************************************/
  /** IF NONTSS = YES THEN I DO NOT CARE IF THE TSS **/
  /** PORTION OF THE DELETE STREAM FUNCTIONS        **/
  /** CORRECTLY..      HENCE ALL THE IFS BELOW      **/
  /***************************************************/
  ADDRESS TSO  "%"TVER"LSTO" ACID "ALLPW"  DSLIST
  IF NONTSS = "YES" THEN  /* TRY TO DELETE THE @ GHOST ENTRY */
    ADDRESS TSO  "%"TVER"LSTO" ACID"@ ALLPW"  DSLIST
  IF NONTSS = "NO" THEN TOTCODE = RC + TOTCODE
  /* "%RXREPRO SYS1.UADS("ACID"0) "UADSBACK"("ACID"0)"*/
  ADDRESS TSO  "%TSSAUDR " ACID
  TOTCODE = RC + TOTCODE
  /* ADDRESS TSO  "%IMSDALIA" ACID */
  /* TOTCODE = RC + TOTCODE */
  ADDRESS TSO  "TSS DEL(" ACID ")"
  IF NONTSS = "YES" THEN ADDRESS TSO  "TSS DEL(" ACID"@)"
  IF NONTSS = "NO" THEN TOTCODE = RC + TOTCODE
  ADDRESS TSO  "%TSSACNT " ACID "DELETE"
  TOTCODE = RC + TOTCODE
  SECRC = "COMMAND STREAM FOR " ACID "COMPLETED NORMALLY."
  IF TOTCODE > 0 THEN
  SECRC = "STREAM HAD PARTIAL FAILURE, CHECK IDS STATUS. CODE=" TOTCODE
  IF TOTCODE = 16 THEN
  SECRC = "ID MAY NOT EXIST OR YOUR AUTHORITY MAY BE INVALID."
  SAY SECRC
END
ADDRESS ISPEXEC "VPUT SECRC PROFILE"
EXIT 0

BADTSS: NOP
SECRC = "THE TSS ID YOU SPECIFIED WAS NOT LISTABLE, CHECK THE ID"
ADDRESS ISPEXEC " VPUT SECRC PROFILE"
EXIT 0

BOOKAUTH: NOP
SECRC = "YOU DONT HAVE AUTHORITY TO DELETE AN ID WITH BOOK NUMBER" BOOK
ADDRESS ISPEXEC " VPUT SECRC PROFILE"
EXIT 0

