//HMD$STAT JOB (U4757,U4757,000000),'THE SILICON SAILOR',CLASS=A,
//  MSGCLASS=2,NOTIFY=$UHMD
/*ROUTE  PRINT FETCH
/*JOBPARM  L=999,ROOM=A539,F=J002
//*
//JSASM    PROC  NODE=$UHMD,MOD=DUMMY
//*********************************************************************
//***     A S S E M B L E    J S T A T U S   C O M M A N D          ***
//***                                                               ***
//*** LAST UPDATED 05/15/85 - HOWARD M. DEAN                        ***
//*********************************************************************
//ASM      EXEC PGM=IFOX00,PARM='RENT,OBJ,BUF(MAX)',REGION=2048K
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR,DCB=BLKSIZE=19040
//         DD  DSN=SYS1.AMODGEN,DISP=SHR,DCB=BLKSIZE=19040
//         DD  DSN=SYS1.SMPMTS,DISP=SHR,UNIT=SYSDA,VOL=SER=MVS999
//         DD  DSN=SYS1.HASPSRC,DISP=SHR,UNIT=SYSDA,VOL=SER=MVS999
//         DD  DSN=&NODE..JS.PDS,DISP=SHR   << THIS PDS =========
//SYSPUNCH DD  DUMMY
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(10,1)),DSN=&SYS-UT1
//SYSUT2   DD  UNIT=SYSDA,SPACE=(CYL,(10,1)),DSN=&SYS-UT2
//SYSUT3   DD  UNIT=SYSDA,SPACE=(CYL,(5,1)),DSN=&SYS-UT3
//SYSGO    DD   DSN=&NODE..JS.OBJ(&MOD),DISP=(MOD,CATLG),
//   DCB=(BLKSIZE=3200,LRECL=80,RECFM=FB),UNIT=SYSDA,
//   SPACE=(3200,(500,100,10))
//*
//SYSIN    DD  DSN=&NODE..JS.PDS(&MOD),DISP=SHR  << THIS PDS =========
//     PEND
//*
//JSTATUS  EXEC JSASM,MOD=JSTATUS                   JSTATUS
//STATJES2 EXEC JSASM,MOD=STATJES2                  COMMAND PROCESSOR
//IGC0020H EXEC JSASM,MOD=IGC0020H                  XMEM SVC
//FINDASCB EXEC JSASM,MOD=FINDASCB                  LOCATE ASID
//RECEVSRB EXEC JSASM,MOD=RECEVSRB                  RECEIVE SRB
//*
//LKED     EXEC PGM=IEWL,COND=(0,NE),
//  PARM='MAP,LIST,XREF,NCAL,LET,RENT',
//  REGION=2048K
//SYSPRINT    DD SYSOUT=*
//SYSUT1      DD UNIT=SYSDA,SPACE=(2048,(100,500)),DSN=&&UT-1
//SYSLMOD     DD DSN=SYS1.LPALIB,DISP=SHR <<<  MUST GO IN LPALIB
//OBJECT      DD DSN=*.JSTATUS.ASM.SYSGO,DISP=SHR
//SYSLIN      DD *
  INCLUDE OBJECT(JSTATUS)
  INCLUDE OBJECT(STATJES2)
  INCLUDE OBJECT(RECEVSRB)
  INCLUDE OBJECT(IGC0020H)
  INCLUDE OBJECT(FINDASCB)
  ENTRY  STATUS
  ORDER  STATUS(P)
  ORDER  STATJES2
  ORDER  IGC0020H
  ORDER  FINDASCB
  ORDER  RECEVSRB
  ALIAS  FINDASCB
  ALIAS  IGC0020H   ** JES2 STATUS INTERFACE SVC **
  ALIAS  JS         ** REDUCE TYPING EFFORT      **
  NAME   JSTATUS(R)
/*
