         MACRO
         HACSAW
CSAWORK  DSECT                HAC CSA WORK AREA
CSAIDP   DC    CL8'HACSAW'    HAC CSA AREA IDENTIFIER       *HMD 01/85*
CSAECB   DS    F              COMMUNICATION ECB
CSASCB   DS    A              A(OUR ASCB)
CSASAVE  DS    18F            SAVE AREA FOR SRB TARGET CODE
CSARECPL DS    3A             PARAMETER LIST FOR RECEVSRB'S USE
CSAEP    DS    A              A(SRB TARGET CODE)
CSAREGSV DS    6F             REGISTER SAVE AREA FOR RECEVSRB
CSAFRRPL DS    A              A(WORD TO RECEIVE FRR PARM LIST)
CSAWORKL EQU   *-CSAWORK      LENGTH OF THE CSA WORK AREA
         MEND
