//SDFTPZ    JOB (1,18542,FMCC-1482),'FTP JOB FAC Z',
//         CLASS=A,MSGCLASS=9,REGION=6M,NOTIFY=&&SYSUID
//*MAIN LREGION=40K,SYSTEM=JGLOBAL,CLASS=SDFLASH
//*MAIN CARDS=5000,LINES=(500,W,50)
//*************************************************************
//FTPZ     EXEC PGM=FTP,PARM='SYZ1.HOSTNAME.URL.COM (EXIT=8'
//ABNLIGNR DD DUMMY
//SYSABEND DD SYSOUT=*
//OUTPUT   DD SYSOUT=*
//NETRC    DD DISP=SHR,DSN=&&SYSUID..NETRC
