//SBGOLOBT  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//*    DELETE ALL FILES ON PACK CBTA01, PRIOR TO REPLACEMENT
//*    WITH NEW FILES UNLOADED FROM THE FRESHLY-MADE NEW TAPE.
//*
//TSOBATCH EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 DELETE 'CBT.V493.FILE001.DATA'
 DELETE 'CBT.V493.FILE002.DATA'
 DELETE 'CBT.V493.FILE003.DATA'
 DELETE 'CBT.V493.FILE004.DATA'
 DELETE 'CBT.V493.FILE005.DATA'
 DELETE 'CBT.V493.FILE006.PDS'
 DELETE 'CBT.V493.FILE007.DATA'
 DELETE 'CBT.V493.FILE008.PDS'
 DELETE 'CBT.V493.FILE009.PDS'
 DELETE 'CBT.V493.FILE010.PDS'
 DELETE 'CBT.V493.FILE011.PDS'
 DELETE 'CBT.V493.FILE012.PDS'
 DELETE 'CBT.V493.FILE013.PDS'
 DELETE 'CBT.V493.FILE014.PDS'
 DELETE 'CBT.V493.FILE015.PDS'
 DELETE 'CBT.V493.FILE016.PDS'
 DELETE 'CBT.V493.FILE017.PDS'
 DELETE 'CBT.V493.FILE018.DATA'
 DELETE 'CBT.V493.FILE019.PDS'
 DELETE 'CBT.V493.FILE020.PDS'
 DELETE 'CBT.V493.FILE021.PDS'
 DELETE 'CBT.V493.FILE022.PDS'
 DELETE 'CBT.V493.FILE023.PDS'
 DELETE 'CBT.V493.FILE024.PDS'
 DELETE 'CBT.V493.FILE025.PDS'
 DELETE 'CBT.V493.FILE026.PDS'
 DELETE 'CBT.V493.FILE027.PDS'
 DELETE 'CBT.V493.FILE028.PDS'
 DELETE 'CBT.V493.FILE029.PDS'
 DELETE 'CBT.V493.FILE030.PDS'
 DELETE 'CBT.V493.FILE031.PDS'
 DELETE 'CBT.V493.FILE032.PDS'
 DELETE 'CBT.V493.FILE033.PDS'
 DELETE 'CBT.V493.FILE034.PDS'
 DELETE 'CBT.V493.FILE035.PDS'
 DELETE 'CBT.V493.FILE036.PDS'
 DELETE 'CBT.V493.FILE037.PDS'
 DELETE 'CBT.V493.FILE038.PDS'
 DELETE 'CBT.V493.FILE039.PDS'
 DELETE 'CBT.V493.FILE040.PDS'
 DELETE 'CBT.V493.FILE041.PDS'
 DELETE 'CBT.V493.FILE042.PDS'
 DELETE 'CBT.V493.FILE043.DATA'
 DELETE 'CBT.V493.FILE044.PDS'
 DELETE 'CBT.V493.FILE045.PDS'
 DELETE 'CBT.V493.FILE046.PDS'
 DELETE 'CBT.V493.FILE047.PDS'
 DELETE 'CBT.V493.FILE048.PDS'
 DELETE 'CBT.V493.FILE049.PDS'
 DELETE 'CBT.V493.FILE050.PDS'
 DELETE 'CBT.V493.FILE051.PDS'
 DELETE 'CBT.V493.FILE052.PDS'
 DELETE 'CBT.V493.FILE053.PDS'
 DELETE 'CBT.V493.FILE054.PDS'
 DELETE 'CBT.V493.FILE055.PDS'
 DELETE 'CBT.V493.FILE056.PDS'
 DELETE 'CBT.V493.FILE057.PDS'
 DELETE 'CBT.V493.FILE058.PDS'
 DELETE 'CBT.V493.FILE059.PDS'
 DELETE 'CBT.V493.FILE060.PDS'
 DELETE 'CBT.V493.FILE061.PDS'
 DELETE 'CBT.V493.FILE062.DATA'
 DELETE 'CBT.V493.FILE063.DATA'
 DELETE 'CBT.V493.FILE064.DATA'
 DELETE 'CBT.V493.FILE065.PDS'
 DELETE 'CBT.V493.FILE066.PDS'
 DELETE 'CBT.V493.FILE067.PDS'
 DELETE 'CBT.V493.FILE068.PDS'
 DELETE 'CBT.V493.FILE069.PDS'
 DELETE 'CBT.V493.FILE070.PDS'
 DELETE 'CBT.V493.FILE071.PDS'
 DELETE 'CBT.V493.FILE072.PDS'
 DELETE 'CBT.V493.FILE073.PDS'
 DELETE 'CBT.V493.FILE074.PDS'
 DELETE 'CBT.V493.FILE075.PDS'
 DELETE 'CBT.V493.FILE076.PDS'
 DELETE 'CBT.V493.FILE077.PDS'
 DELETE 'CBT.V493.FILE078.PDS'
 DELETE 'CBT.V493.FILE079.PDS'
 DELETE 'CBT.V493.FILE080.PDS'
 DELETE 'CBT.V493.FILE081.PDS'
 DELETE 'CBT.V493.FILE082.PDS'
 DELETE 'CBT.V493.FILE083.PDS'
 DELETE 'CBT.V493.FILE084.PDS'
 DELETE 'CBT.V493.FILE085.PDS'
 DELETE 'CBT.V493.FILE086.PDS'
 DELETE 'CBT.V493.FILE087.PDS'
 DELETE 'CBT.V493.FILE088.PDS'
 DELETE 'CBT.V493.FILE089.PDS'
 DELETE 'CBT.V493.FILE090.PDS'
 DELETE 'CBT.V493.FILE091.PDS'
 DELETE 'CBT.V493.FILE092.PDS'
 DELETE 'CBT.V493.FILE093.PDS'
 DELETE 'CBT.V493.FILE094.PDS'
 DELETE 'CBT.V493.FILE095.PDS'
 DELETE 'CBT.V493.FILE096.PDS'
 DELETE 'CBT.V493.FILE097.PDS'
 DELETE 'CBT.V493.FILE098.PDS'
 DELETE 'CBT.V493.FILE099.DATA'
 DELETE 'CBT.V493.FILE100.PDS'
 DELETE 'CBT.V493.FILE101.PDS'
 DELETE 'CBT.V493.FILE102.PDS'
 DELETE 'CBT.V493.FILE103.PDS'
 DELETE 'CBT.V493.FILE104.PDS'
 DELETE 'CBT.V493.FILE105.PDS'
 DELETE 'CBT.V493.FILE106.PDS'
 DELETE 'CBT.V493.FILE107.PDS'
 DELETE 'CBT.V493.FILE108.PDS'
 DELETE 'CBT.V493.FILE109.PDS'
 DELETE 'CBT.V493.FILE110.DATA'
 DELETE 'CBT.V493.FILE111.PDS'
 DELETE 'CBT.V493.FILE112.PDS'
 DELETE 'CBT.V493.FILE113.PDS'
 DELETE 'CBT.V493.FILE114.PDS'
 DELETE 'CBT.V493.FILE115.PDS'
 DELETE 'CBT.V493.FILE116.PDS'
 DELETE 'CBT.V493.FILE117.PDS'
 DELETE 'CBT.V493.FILE118.PDS'
 DELETE 'CBT.V493.FILE119.PDS'
 DELETE 'CBT.V493.FILE120.PDS'
 DELETE 'CBT.V493.FILE121.PDS'
 DELETE 'CBT.V493.FILE122.PDS'
 DELETE 'CBT.V493.FILE123.PDS'
 DELETE 'CBT.V493.FILE124.PDS'
 DELETE 'CBT.V493.FILE125.PDS'
 DELETE 'CBT.V493.FILE126.PDS'
 DELETE 'CBT.V493.FILE127.PDS'
 DELETE 'CBT.V493.FILE128.PDS'
 DELETE 'CBT.V493.FILE129.PDS'
 DELETE 'CBT.V493.FILE130.PDS'
 DELETE 'CBT.V493.FILE131.PDS'
 DELETE 'CBT.V493.FILE132.PDS'
 DELETE 'CBT.V493.FILE133.PDS'
 DELETE 'CBT.V493.FILE134.PDS'
 DELETE 'CBT.V493.FILE135.PDS'
 DELETE 'CBT.V493.FILE136.PDS'
 DELETE 'CBT.V493.FILE137.PDS'
 DELETE 'CBT.V493.FILE138.PDS'
 DELETE 'CBT.V493.FILE139.PDS'
 DELETE 'CBT.V493.FILE140.PDS'
 DELETE 'CBT.V493.FILE141.PDS'
 DELETE 'CBT.V493.FILE142.PDS'
 DELETE 'CBT.V493.FILE143.PDS'
 DELETE 'CBT.V493.FILE144.PDS'
 DELETE 'CBT.V493.FILE145.PDS'
 DELETE 'CBT.V493.FILE146.PDS'
 DELETE 'CBT.V493.FILE147.PDS'
 DELETE 'CBT.V493.FILE148.PDS'
 DELETE 'CBT.V493.FILE149.PDS'
 DELETE 'CBT.V493.FILE150.PDS'
 DELETE 'CBT.V493.FILE151.PDS'
 DELETE 'CBT.V493.FILE152.PDS'
 DELETE 'CBT.V493.FILE153.PDS'
 DELETE 'CBT.V493.FILE154.PDS'
 DELETE 'CBT.V493.FILE155.PDS'
 DELETE 'CBT.V493.FILE156.PDS'
 DELETE 'CBT.V493.FILE157.DATA'
 DELETE 'CBT.V493.FILE158.PDS'
 DELETE 'CBT.V493.FILE159.PDS'
 DELETE 'CBT.V493.FILE160.PDS'
 DELETE 'CBT.V493.FILE161.PDS'
 DELETE 'CBT.V493.FILE162.PDS'
 DELETE 'CBT.V493.FILE163.PDS'
 DELETE 'CBT.V493.FILE164.PDS'
 DELETE 'CBT.V493.FILE165.PDS'
 DELETE 'CBT.V493.FILE166.PDS'
 DELETE 'CBT.V493.FILE167.PDS'
 DELETE 'CBT.V493.FILE168.PDS'
 DELETE 'CBT.V493.FILE169.PDS'
 DELETE 'CBT.V493.FILE170.PDS'
 DELETE 'CBT.V493.FILE171.PDS'
 DELETE 'CBT.V493.FILE172.PDS'
 DELETE 'CBT.V493.FILE173.PDS'
 DELETE 'CBT.V493.FILE174.PDS'
 DELETE 'CBT.V493.FILE175.PDS'
 DELETE 'CBT.V493.FILE176.PDS'
 DELETE 'CBT.V493.FILE177.PDS'
 DELETE 'CBT.V493.FILE178.PDS'
 DELETE 'CBT.V493.FILE179.PDS'
 DELETE 'CBT.V493.FILE180.PDS'
 DELETE 'CBT.V493.FILE181.PDS'
 DELETE 'CBT.V493.FILE182.PDS'
 DELETE 'CBT.V493.FILE183.PDS'
 DELETE 'CBT.V493.FILE184.PDS'
 DELETE 'CBT.V493.FILE185.PDS'
 DELETE 'CBT.V493.FILE186.PDS'
 DELETE 'CBT.V493.FILE187.PDS'
 DELETE 'CBT.V493.FILE188.PDS'
 DELETE 'CBT.V493.FILE189.PDS'
 DELETE 'CBT.V493.FILE190.PDS'
 DELETE 'CBT.V493.FILE191.PDS'
 DELETE 'CBT.V493.FILE192.PDS'
 DELETE 'CBT.V493.FILE193.PDS'
 DELETE 'CBT.V493.FILE194.PDS'
 DELETE 'CBT.V493.FILE195.PDS'
 DELETE 'CBT.V493.FILE196.PDS'
 DELETE 'CBT.V493.FILE197.PDS'
 DELETE 'CBT.V493.FILE198.PDS'
 DELETE 'CBT.V493.FILE199.PDS'
 DELETE 'CBT.V493.FILE200.PDS'
 DELETE 'CBT.V493.FILE201.PDS'
 DELETE 'CBT.V493.FILE202.PDS'
 DELETE 'CBT.V493.FILE203.PDS'
 DELETE 'CBT.V493.FILE204.PDS'
 DELETE 'CBT.V493.FILE205.PDS'
 DELETE 'CBT.V493.FILE206.PDS'
 DELETE 'CBT.V493.FILE207.PDS'
 DELETE 'CBT.V493.FILE208.PDS'
 DELETE 'CBT.V493.FILE209.PDS'
 DELETE 'CBT.V493.FILE210.PDS'
 DELETE 'CBT.V493.FILE211.PDS'
 DELETE 'CBT.V493.FILE212.PDS'
 DELETE 'CBT.V493.FILE213.PDS'
 DELETE 'CBT.V493.FILE214.PDS'
 DELETE 'CBT.V493.FILE215.PDS'
 DELETE 'CBT.V493.FILE216.PDS'
 DELETE 'CBT.V493.FILE217.PDS'
 DELETE 'CBT.V493.FILE218.PDS'
 DELETE 'CBT.V493.FILE219.PDS'
 DELETE 'CBT.V493.FILE220.PDS'
 DELETE 'CBT.V493.FILE221.PDS'
 DELETE 'CBT.V493.FILE222.PDS'
 DELETE 'CBT.V493.FILE223.PDS'
 DELETE 'CBT.V493.FILE224.PDS'
 DELETE 'CBT.V493.FILE225.PDS'
 DELETE 'CBT.V493.FILE226.PDS'
 DELETE 'CBT.V493.FILE227.PDS'
 DELETE 'CBT.V493.FILE228.PDS'
 DELETE 'CBT.V493.FILE229.PDS'
 DELETE 'CBT.V493.FILE230.DATA'
 DELETE 'CBT.V493.FILE231.PDS'
 DELETE 'CBT.V493.FILE232.PDS'
 DELETE 'CBT.V493.FILE233.PDS'
 DELETE 'CBT.V493.FILE234.PDS'
 DELETE 'CBT.V493.FILE235.PDS'
 DELETE 'CBT.V493.FILE236.PDS'
 DELETE 'CBT.V493.FILE237.PDS'
 DELETE 'CBT.V493.FILE238.PDS'
 DELETE 'CBT.V493.FILE239.PDS'
 DELETE 'CBT.V493.FILE240.PDS'
 DELETE 'CBT.V493.FILE241.PDS'
 DELETE 'CBT.V493.FILE242.PDS'
 DELETE 'CBT.V493.FILE243.PDS'
 DELETE 'CBT.V493.FILE244.PDS'
 DELETE 'CBT.V493.FILE245.PDS'
 DELETE 'CBT.V493.FILE246.PDS'
 DELETE 'CBT.V493.FILE247.PDS'
 DELETE 'CBT.V493.FILE248.PDS'
 DELETE 'CBT.V493.FILE249.PDS'
 DELETE 'CBT.V493.FILE250.PDS'
 DELETE 'CBT.V493.FILE251.PDS'
 DELETE 'CBT.V493.FILE252.PDS'
 DELETE 'CBT.V493.FILE253.PDS'
 DELETE 'CBT.V493.FILE254.PDS'
 DELETE 'CBT.V493.FILE255.PDS'
 DELETE 'CBT.V493.FILE256.PDS'
 DELETE 'CBT.V493.FILE257.PDS'
 DELETE 'CBT.V493.FILE258.PDS'
 DELETE 'CBT.V493.FILE259.PDS'
 DELETE 'CBT.V493.FILE260.PDS'
 DELETE 'CBT.V493.FILE261.PDS'
 DELETE 'CBT.V493.FILE262.PDS'
 DELETE 'CBT.V493.FILE263.PDS'
 DELETE 'CBT.V493.FILE264.PDS'
 DELETE 'CBT.V493.FILE265.PDS'
 DELETE 'CBT.V493.FILE266.PDS'
 DELETE 'CBT.V493.FILE267.PDS'
 DELETE 'CBT.V493.FILE268.PDS'
 DELETE 'CBT.V493.FILE269.PDS'
 DELETE 'CBT.V493.FILE270.PDS'
 DELETE 'CBT.V493.FILE271.PDS'
 DELETE 'CBT.V493.FILE272.PDS'
 DELETE 'CBT.V493.FILE273.PDS'
 DELETE 'CBT.V493.FILE274.PDS'
 DELETE 'CBT.V493.FILE275.PDS'
 DELETE 'CBT.V493.FILE276.PDS'
 DELETE 'CBT.V493.FILE277.PDS'
 DELETE 'CBT.V493.FILE278.PDS'
 DELETE 'CBT.V493.FILE279.PDS'
 DELETE 'CBT.V493.FILE280.PDS'
 DELETE 'CBT.V493.FILE281.PDS'
 DELETE 'CBT.V493.FILE282.PDS'
 DELETE 'CBT.V493.FILE283.PDS'
 DELETE 'CBT.V493.FILE284.PDS'
 DELETE 'CBT.V493.FILE285.PDS'
 DELETE 'CBT.V493.FILE286.PDS'
 DELETE 'CBT.V493.FILE287.PDS'
 DELETE 'CBT.V493.FILE288.PDS'
 DELETE 'CBT.V493.FILE289.PDS'
 DELETE 'CBT.V493.FILE290.PDS'
 DELETE 'CBT.V493.FILE291.PDS'
 DELETE 'CBT.V493.FILE292.PDS'
 DELETE 'CBT.V493.FILE293.PDS'
 DELETE 'CBT.V493.FILE294.PDS'
 DELETE 'CBT.V493.FILE295.PDS'
 DELETE 'CBT.V493.FILE296.PDS'
 DELETE 'CBT.V493.FILE297.PDS'
 DELETE 'CBT.V493.FILE298.PDS'
 DELETE 'CBT.V493.FILE299.PDS'
 DELETE 'CBT.V493.FILE300.PDS'
 DELETE 'CBT.V493.FILE301.PDS'
 DELETE 'CBT.V493.FILE302.PDS'
 DELETE 'CBT.V493.FILE303.PDS'
 DELETE 'CBT.V493.FILE304.PDS'
 DELETE 'CBT.V493.FILE305.PDS'
 DELETE 'CBT.V493.FILE306.PDS'
 DELETE 'CBT.V493.FILE307.PDS'
 DELETE 'CBT.V493.FILE308.PDS'
 DELETE 'CBT.V493.FILE309.PDS'
 DELETE 'CBT.V493.FILE310.PDS'
 DELETE 'CBT.V493.FILE311.PDS'
 DELETE 'CBT.V493.FILE312.PDS'
 DELETE 'CBT.V493.FILE313.PDS'
 DELETE 'CBT.V493.FILE314.PDS'
 DELETE 'CBT.V493.FILE315.PDS'
 DELETE 'CBT.V493.FILE316.PDS'
 DELETE 'CBT.V493.FILE317.PDS'
 DELETE 'CBT.V493.FILE318.PDS'
 DELETE 'CBT.V493.FILE319.PDS'
 DELETE 'CBT.V493.FILE320.PDS'
 DELETE 'CBT.V493.FILE321.PDS'
 DELETE 'CBT.V493.FILE322.PDS'
 DELETE 'CBT.V493.FILE323.PDS'
 DELETE 'CBT.V493.FILE324.PDS'
 DELETE 'CBT.V493.FILE325.PDS'
 DELETE 'CBT.V493.FILE326.PDS'
 DELETE 'CBT.V493.FILE327.PDS'
 DELETE 'CBT.V493.FILE328.PDS'
 DELETE 'CBT.V493.FILE329.PDS'
 DELETE 'CBT.V493.FILE330.PDS'
 DELETE 'CBT.V493.FILE331.PDS'
 DELETE 'CBT.V493.FILE332.PDS'
 DELETE 'CBT.V493.FILE333.PDS'
 DELETE 'CBT.V493.FILE334.PDS'
 DELETE 'CBT.V493.FILE335.PDS'
 DELETE 'CBT.V493.FILE336.PDS'
 DELETE 'CBT.V493.FILE337.PDS'
 DELETE 'CBT.V493.FILE338.PDS'
 DELETE 'CBT.V493.FILE339.PDS'
 DELETE 'CBT.V493.FILE340.PDS'
 DELETE 'CBT.V493.FILE341.PDS'
 DELETE 'CBT.V493.FILE342.PDS'
 DELETE 'CBT.V493.FILE343.PDS'
 DELETE 'CBT.V493.FILE344.PDS'
 DELETE 'CBT.V493.FILE345.PDS'
 DELETE 'CBT.V493.FILE346.PDS'
 DELETE 'CBT.V493.FILE347.PDS'
 DELETE 'CBT.V493.FILE348.PDS'
 DELETE 'CBT.V493.FILE349.PDS'
 DELETE 'CBT.V493.FILE350.PDS'
 DELETE 'CBT.V493.FILE351.PDS'
 DELETE 'CBT.V493.FILE352.PDS'
 DELETE 'CBT.V493.FILE353.PDS'
 DELETE 'CBT.V493.FILE354.PDS'
 DELETE 'CBT.V493.FILE355.PDS'
 DELETE 'CBT.V493.FILE356.PDS'
 DELETE 'CBT.V493.FILE357.PDS'
 DELETE 'CBT.V493.FILE358.PDS'
 DELETE 'CBT.V493.FILE359.PDS'
 DELETE 'CBT.V493.FILE360.PDS'
 DELETE 'CBT.V493.FILE361.PDS'
 DELETE 'CBT.V493.FILE362.PDS'
 DELETE 'CBT.V493.FILE363.PDS'
 DELETE 'CBT.V493.FILE364.PDS'
 DELETE 'CBT.V493.FILE365.PDS'
 DELETE 'CBT.V493.FILE366.PDS'
 DELETE 'CBT.V493.FILE367.PDS'
 DELETE 'CBT.V493.FILE368.PDS'
 DELETE 'CBT.V493.FILE369.PDS'
 DELETE 'CBT.V493.FILE370.PDS'
 DELETE 'CBT.V493.FILE371.PDS'
 DELETE 'CBT.V493.FILE372.PDS'
 DELETE 'CBT.V493.FILE373.PDS'
 DELETE 'CBT.V493.FILE374.PDS'
 DELETE 'CBT.V493.FILE375.PDS'
 DELETE 'CBT.V493.FILE376.PDS'
 DELETE 'CBT.V493.FILE377.PDS'
 DELETE 'CBT.V493.FILE378.PDS'
 DELETE 'CBT.V493.FILE379.PDS'
 DELETE 'CBT.V493.FILE380.PDS'
 DELETE 'CBT.V493.FILE381.PDS'
 DELETE 'CBT.V493.FILE382.PDS'
 DELETE 'CBT.V493.FILE383.PDS'
 DELETE 'CBT.V493.FILE384.PDS'
 DELETE 'CBT.V493.FILE385.PDS'
 DELETE 'CBT.V493.FILE386.PDS'
 DELETE 'CBT.V493.FILE387.PDS'
 DELETE 'CBT.V493.FILE388.PDS'
 DELETE 'CBT.V493.FILE389.PDS'
 DELETE 'CBT.V493.FILE390.PDS'
 DELETE 'CBT.V493.FILE391.PDS'
 DELETE 'CBT.V493.FILE392.PDS'
 DELETE 'CBT.V493.FILE393.PDS'
 DELETE 'CBT.V493.FILE394.PDS'
 DELETE 'CBT.V493.FILE395.PDS'
 DELETE 'CBT.V493.FILE396.PDS'
 DELETE 'CBT.V493.FILE397.PDS'
 DELETE 'CBT.V493.FILE398.PDS'
 DELETE 'CBT.V493.FILE399.PDS'
 DELETE 'CBT.V493.FILE400.PDS'
 DELETE 'CBT.V493.FILE401.PDS'
 DELETE 'CBT.V493.FILE402.PDS'
 DELETE 'CBT.V493.FILE403.PDS'
 DELETE 'CBT.V493.FILE404.PDS'
 DELETE 'CBT.V493.FILE405.PDS'
 DELETE 'CBT.V493.FILE406.PDS'
 DELETE 'CBT.V493.FILE407.PDS'
 DELETE 'CBT.V493.FILE408.PDS'
 DELETE 'CBT.V493.FILE409.PDS'
 DELETE 'CBT.V493.FILE410.PDS'
 DELETE 'CBT.V493.FILE411.PDS'
 DELETE 'CBT.V493.FILE412.PDS'
 DELETE 'CBT.V493.FILE413.PDS'
 DELETE 'CBT.V493.FILE414.PDS'
 DELETE 'CBT.V493.FILE415.PDS'
 DELETE 'CBT.V493.FILE416.PDS'
 DELETE 'CBT.V493.FILE417.PDS'
 DELETE 'CBT.V493.FILE418.PDS'
 DELETE 'CBT.V493.FILE419.PDS'
 DELETE 'CBT.V493.FILE420.PDS'
 DELETE 'CBT.V493.FILE421.PDS'
 DELETE 'CBT.V493.FILE422.PDS'
 DELETE 'CBT.V493.FILE423.PDS'
 DELETE 'CBT.V493.FILE424.PDS'
 DELETE 'CBT.V493.FILE425.PDS'
 DELETE 'CBT.V493.FILE426.PDS'
 DELETE 'CBT.V493.FILE427.PDS'
 DELETE 'CBT.V493.FILE428.PDS'
 DELETE 'CBT.V493.FILE429.PDS'
 DELETE 'CBT.V493.FILE430.PDS'
 DELETE 'CBT.V493.FILE431.PDS'
 DELETE 'CBT.V493.FILE432.PDS'
 DELETE 'CBT.V493.FILE433.PDS'
 DELETE 'CBT.V493.FILE434.PDS'
 DELETE 'CBT.V493.FILE435.PDS'
 DELETE 'CBT.V493.FILE436.PDS'
 DELETE 'CBT.V493.FILE437.PDS'
 DELETE 'CBT.V493.FILE438.PDS'
 DELETE 'CBT.V493.FILE439.PDS'
 DELETE 'CBT.V493.FILE440.PDS'
 DELETE 'CBT.V493.FILE441.PDS'
 DELETE 'CBT.V493.FILE442.PDS'
 DELETE 'CBT.V493.FILE443.PDS'
 DELETE 'CBT.V493.FILE444.PDS'
 DELETE 'CBT.V493.FILE445.PDS'
 DELETE 'CBT.V493.FILE446.PDS'
 DELETE 'CBT.V493.FILE447.PDS'
 DELETE 'CBT.V493.FILE448.PDS'
 DELETE 'CBT.V493.FILE449.PDS'
 DELETE 'CBT.V493.FILE450.PDS'
 DELETE 'CBT.V493.FILE451.PDS'
 DELETE 'CBT.V493.FILE452.PDS'
 DELETE 'CBT.V493.FILE453.PDS'
 DELETE 'CBT.V493.FILE454.PDS'
 DELETE 'CBT.V493.FILE455.PDS'
 DELETE 'CBT.V493.FILE456.PDS'
 DELETE 'CBT.V493.FILE457.PDS'
 DELETE 'CBT.V493.FILE458.PDS'
 DELETE 'CBT.V493.FILE459.PDS'
 DELETE 'CBT.V493.FILE460.PDS'
 DELETE 'CBT.V493.FILE461.PDS'
 DELETE 'CBT.V493.FILE462.PDS'
 DELETE 'CBT.V493.FILE463.PDS'
 DELETE 'CBT.V493.FILE464.PDS'
 DELETE 'CBT.V493.FILE465.PDS'
 DELETE 'CBT.V493.FILE466.PDS'
 DELETE 'CBT.V493.FILE467.PDS'
 DELETE 'CBT.V493.FILE468.PDS'
 DELETE 'CBT.V493.FILE469.PDS'
 DELETE 'CBT.V493.FILE470.PDS'
 DELETE 'CBT.V493.FILE471.PDS'
 DELETE 'CBT.V493.FILE472.PDS'
 DELETE 'CBT.V493.FILE473.PDS'
 DELETE 'CBT.V493.FILE474.PDS'
 DELETE 'CBT.V493.FILE475.PDS'
 DELETE 'CBT.V493.FILE476.PDS'
 DELETE 'CBT.V493.FILE477.PDS'
 DELETE 'CBT.V493.FILE478.PDS'
 DELETE 'CBT.V493.FILE479.PDS'
 DELETE 'CBT.V493.FILE480.PDS'
 DELETE 'CBT.V493.FILE481.PDS'
 DELETE 'CBT.V493.FILE482.PDS'
 DELETE 'CBT.V493.FILE483.PDS'
 DELETE 'CBT.V493.FILE484.PDS'
 DELETE 'CBT.V493.FILE485.PDS'
 DELETE 'CBT.V493.FILE486.PDS'
 DELETE 'CBT.V493.FILE487.PDS'
 DELETE 'CBT.V493.FILE488.PDS'
 DELETE 'CBT.V493.FILE489.PDS'
 DELETE 'CBT.V493.FILE490.PDS'
 DELETE 'CBT.V493.FILE491.PDS'
 DELETE 'CBT.V493.FILE492.PDS'
 DELETE 'CBT.V493.FILE493.PDS'
 DELETE 'CBT.V493.FILE494.PDS'
 DELETE 'CBT.V493.FILE495.PDS'
 DELETE 'CBT.V493.FILE496.PDS'
 DELETE 'CBT.V493.FILE497.PDS'
 DELETE 'CBT.V493.FILE498.PDS'
 DELETE 'CBT.V493.FILE499.PDS'
 DELETE 'CBT.V493.FILE500.PDS'
 DELETE 'CBT.V493.FILE501.PDS'
 DELETE 'CBT.V493.FILE502.PDS'
 DELETE 'CBT.V493.FILE503.PDS'
 DELETE 'CBT.V493.FILE504.PDS'
 DELETE 'CBT.V493.FILE505.PDS'
 DELETE 'CBT.V493.FILE506.PDS'
 DELETE 'CBT.V493.FILE507.PDS'
 DELETE 'CBT.V493.FILE508.PDS'
 DELETE 'CBT.V493.FILE509.PDS'
 DELETE 'CBT.V493.FILE510.PDS'
 DELETE 'CBT.V493.FILE511.PDS'
 DELETE 'CBT.V493.FILE512.PDS'
 DELETE 'CBT.V493.FILE513.PDS'
 DELETE 'CBT.V493.FILE514.PDS'
 DELETE 'CBT.V493.FILE515.PDS'
 DELETE 'CBT.V493.FILE516.PDS'
 DELETE 'CBT.V493.FILE517.PDS'
 DELETE 'CBT.V493.FILE518.PDS'
 DELETE 'CBT.V493.FILE519.PDS'
 DELETE 'CBT.V493.FILE520.PDS'
 DELETE 'CBT.V493.FILE521.PDS'
 DELETE 'CBT.V493.FILE522.PDS'
 DELETE 'CBT.V493.FILE523.PDS'
 DELETE 'CBT.V493.FILE524.PDS'
 DELETE 'CBT.V493.FILE525.PDS'
 DELETE 'CBT.V493.FILE526.PDS'
 DELETE 'CBT.V493.FILE527.PDS'
 DELETE 'CBT.V493.FILE528.PDS'
 DELETE 'CBT.V493.FILE529.PDS'
 DELETE 'CBT.V493.FILE530.PDS'
 DELETE 'CBT.V493.FILE531.PDS'
 DELETE 'CBT.V493.FILE532.PDS'
 DELETE 'CBT.V493.FILE533.PDS'
 DELETE 'CBT.V493.FILE534.PDS'
 DELETE 'CBT.V493.FILE535.PDS'
 DELETE 'CBT.V493.FILE536.PDS'
 DELETE 'CBT.V493.FILE537.PDS'
 DELETE 'CBT.V493.FILE538.PDS'
 DELETE 'CBT.V493.FILE539.PDS'
 DELETE 'CBT.V493.FILE540.PDS'
 DELETE 'CBT.V493.FILE541.PDS'
 DELETE 'CBT.V493.FILE542.PDS'
 DELETE 'CBT.V493.FILE543.PDS'
 DELETE 'CBT.V493.FILE544.PDS'
 DELETE 'CBT.V493.FILE545.PDS'
 DELETE 'CBT.V493.FILE546.PDS'
 DELETE 'CBT.V493.FILE547.PDS'
 DELETE 'CBT.V493.FILE548.PDS'
 DELETE 'CBT.V493.FILE549.PDS'
 DELETE 'CBT.V493.FILE550.PDS'
 DELETE 'CBT.V493.FILE551.PDS'
 DELETE 'CBT.V493.FILE552.PDS'
 DELETE 'CBT.V493.FILE553.PDS'
 DELETE 'CBT.V493.FILE554.PDS'
 DELETE 'CBT.V493.FILE555.PDS'
 DELETE 'CBT.V493.FILE556.PDS'
 DELETE 'CBT.V493.FILE557.PDS'
 DELETE 'CBT.V493.FILE558.PDS'
 DELETE 'CBT.V493.FILE559.PDS'
 DELETE 'CBT.V493.FILE560.PDS'
 DELETE 'CBT.V493.FILE561.PDS'
 DELETE 'CBT.V493.FILE562.PDS'
 DELETE 'CBT.V493.FILE563.PDS'
 DELETE 'CBT.V493.FILE564.PDS'
 DELETE 'CBT.V493.FILE565.PDS'
 DELETE 'CBT.V493.FILE566.PDS'
 DELETE 'CBT.V493.FILE567.PDS'
 DELETE 'CBT.V493.FILE568.PDS'
 DELETE 'CBT.V493.FILE569.PDS'
 DELETE 'CBT.V493.FILE570.PDS'
 DELETE 'CBT.V493.FILE571.PDS'
 DELETE 'CBT.V493.FILE572.PDS'
 DELETE 'CBT.V493.FILE573.PDS'
 DELETE 'CBT.V493.FILE574.PDS'
 DELETE 'CBT.V493.FILE575.PDS'
 DELETE 'CBT.V493.FILE576.PDS'
 DELETE 'CBT.V493.FILE577.PDS'
 DELETE 'CBT.V493.FILE578.PDS'
 DELETE 'CBT.V493.FILE579.PDS'
 DELETE 'CBT.V493.FILE580.PDS'
 DELETE 'CBT.V493.FILE581.PDS'
 DELETE 'CBT.V493.FILE582.PDS'
 DELETE 'CBT.V493.FILE583.PDS'
 DELETE 'CBT.V493.FILE584.PDS'
 DELETE 'CBT.V493.FILE585.PDS'
 DELETE 'CBT.V493.FILE586.PDS'
 DELETE 'CBT.V493.FILE587.PDS'
 DELETE 'CBT.V493.FILE588.PDS'
 DELETE 'CBT.V493.FILE589.PDS'
 DELETE 'CBT.V493.FILE590.PDS'
 DELETE 'CBT.V493.FILE591.PDS'
 DELETE 'CBT.V493.FILE592.PDS'
 DELETE 'CBT.V493.FILE593.PDS'
 DELETE 'CBT.V493.FILE594.PDS'
 DELETE 'CBT.V493.FILE595.PDS'
 DELETE 'CBT.V493.FILE596.PDS'
 DELETE 'CBT.V493.FILE597.PDS'
 DELETE 'CBT.V493.FILE598.PDS'
 DELETE 'CBT.V493.FILE599.PDS'
 DELETE 'CBT.V493.FILE600.PDS'
 DELETE 'CBT.V493.FILE601.PDS'
 DELETE 'CBT.V493.FILE602.PDS'
 DELETE 'CBT.V493.FILE603.PDS'
 DELETE 'CBT.V493.FILE604.PDS'
 DELETE 'CBT.V493.FILE605.PDS'
 DELETE 'CBT.V493.FILE606.PDS'
 DELETE 'CBT.V493.FILE607.PDS'
 DELETE 'CBT.V493.FILE608.PDS'
 DELETE 'CBT.V493.FILE609.PDS'
 DELETE 'CBT.V493.FILE610.PDS'
 DELETE 'CBT.V493.FILE611.PDS'
 DELETE 'CBT.V493.FILE612.PDS'
 DELETE 'CBT.V493.FILE613.PDS'
 DELETE 'CBT.V493.FILE614.PDS'
 DELETE 'CBT.V493.FILE615.PDS'
 DELETE 'CBT.V493.FILE616.PDS'
 DELETE 'CBT.V493.FILE617.PDS'
 DELETE 'CBT.V493.FILE618.PDS'
 DELETE 'CBT.V493.FILE619.PDS'
 DELETE 'CBT.V493.FILE620.PDS'
 DELETE 'CBT.V493.FILE621.PDS'
 DELETE 'CBT.V493.FILE622.PDS'
 DELETE 'CBT.V493.FILE623.PDS'
 DELETE 'CBT.V493.FILE624.PDS'
 DELETE 'CBT.V493.FILE625.PDS'
 DELETE 'CBT.V493.FILE626.PDS'
 DELETE 'CBT.V493.FILE627.PDS'
 DELETE 'CBT.V493.FILE628.PDS'
 DELETE 'CBT.V493.FILE629.PDS'
 DELETE 'CBT.V493.FILE630.PDS'
 DELETE 'CBT.V493.FILE631.PDS'
 DELETE 'CBT.V493.FILE632.PDS'
 DELETE 'CBT.V493.FILE633.PDS'
 DELETE 'CBT.V493.FILE634.PDS'
 DELETE 'CBT.V493.FILE635.PDS'
 DELETE 'CBT.V493.FILE636.PDS'
 DELETE 'CBT.V493.FILE637.PDS'
 DELETE 'CBT.V493.FILE638.PDS'
 DELETE 'CBT.V493.FILE639.PDS'
 DELETE 'CBT.V493.FILE640.PDS'
 DELETE 'CBT.V493.FILE641.PDS'
 DELETE 'CBT.V493.FILE642.PDS'
 DELETE 'CBT.V493.FILE643.PDS'
 DELETE 'CBT.V493.FILE644.PDS'
 DELETE 'CBT.V493.FILE645.PDS'
 DELETE 'CBT.V493.FILE646.PDS'
 DELETE 'CBT.V493.FILE647.PDS'
 DELETE 'CBT.V493.FILE648.PDS'
 DELETE 'CBT.V493.FILE649.PDS'
 DELETE 'CBT.V493.FILE650.PDS'
 DELETE 'CBT.V493.FILE651.PDS'
 DELETE 'CBT.V493.FILE652.PDS'
 DELETE 'CBT.V493.FILE653.PDS'
 DELETE 'CBT.V493.FILE654.PDS'
 DELETE 'CBT.V493.FILE655.PDS'
 DELETE 'CBT.V493.FILE656.PDS'
 DELETE 'CBT.V493.FILE657.PDS'
 DELETE 'CBT.V493.FILE658.PDS'
 DELETE 'CBT.V493.FILE659.PDS'
 DELETE 'CBT.V493.FILE660.PDS'
 DELETE 'CBT.V493.FILE661.PDS'
 DELETE 'CBT.V493.FILE662.PDS'
 DELETE 'CBT.V493.FILE663.PDS'
 DELETE 'CBT.V493.FILE664.PDS'
 DELETE 'CBT.V493.FILE665.PDS'
 DELETE 'CBT.V493.FILE666.PDS'
 DELETE 'CBT.V493.FILE667.PDS'
 DELETE 'CBT.V493.FILE668.PDS'
 DELETE 'CBT.V493.FILE669.PDS'
 DELETE 'CBT.V493.FILE670.PDS'
 DELETE 'CBT.V493.FILE671.PDS'
 DELETE 'CBT.V493.FILE672.PDS'
 DELETE 'CBT.V493.FILE673.PDS'
 DELETE 'CBT.V493.FILE674.PDS'
 DELETE 'CBT.V493.FILE675.PDS'
 DELETE 'CBT.V493.FILE676.PDS'
 DELETE 'CBT.V493.FILE677.PDS'
 DELETE 'CBT.V493.FILE678.PDS'
 DELETE 'CBT.V493.FILE679.PDS'
 DELETE 'CBT.V493.FILE680.PDS'
 DELETE 'CBT.V493.FILE681.PDS'
 DELETE 'CBT.V493.FILE682.PDS'
 DELETE 'CBT.V493.FILE683.PDS'
 DELETE 'CBT.V493.FILE684.PDS'
 DELETE 'CBT.V493.FILE685.PDS'
 DELETE 'CBT.V493.FILE686.PDS'
 DELETE 'CBT.V493.FILE687.PDS'
 DELETE 'CBT.V493.FILE688.PDS'
 DELETE 'CBT.V493.FILE689.PDS'
 DELETE 'CBT.V493.FILE690.PDS'
 DELETE 'CBT.V493.FILE691.PDS'
 DELETE 'CBT.V493.FILE692.PDS'
 DELETE 'CBT.V493.FILE693.PDS'
 DELETE 'CBT.V493.FILE694.PDS'
 DELETE 'CBT.V493.FILE695.PDS'
 DELETE 'CBT.V493.FILE696.PDS'
 DELETE 'CBT.V493.FILE697.PDS'
 DELETE 'CBT.V493.FILE698.PDS'
 DELETE 'CBT.V493.FILE699.PDS'
 DELETE 'CBT.V493.FILE700.PDS'
 DELETE 'CBT.V493.FILE701.PDS'
 DELETE 'CBT.V493.FILE702.PDS'
 DELETE 'CBT.V493.FILE703.PDS'
 DELETE 'CBT.V493.FILE704.PDS'
 DELETE 'CBT.V493.FILE705.PDS'
 DELETE 'CBT.V493.FILE706.PDS'
 DELETE 'CBT.V493.FILE707.PDS'
 DELETE 'CBT.V493.FILE708.PDS'
 DELETE 'CBT.V493.FILE709.PDS'
 DELETE 'CBT.V493.FILE710.PDS'
 DELETE 'CBT.V493.FILE711.PDS'
 DELETE 'CBT.V493.FILE712.PDS'
 DELETE 'CBT.V493.FILE713.PDS'
 DELETE 'CBT.V493.FILE714.PDS'
 DELETE 'CBT.V493.FILE715.PDS'
 DELETE 'CBT.V493.FILE716.PDS'
 DELETE 'CBT.V493.FILE717.PDS'
 DELETE 'CBT.V493.FILE718.PDS'
 DELETE 'CBT.V493.FILE719.PDS'
 DELETE 'CBT.V493.FILE720.PDS'
 DELETE 'CBT.V493.FILE721.PDS'
 DELETE 'CBT.V493.FILE722.PDS'
 DELETE 'CBT.V493.FILE723.PDS'
 DELETE 'CBT.V493.FILE724.PDS'
 DELETE 'CBT.V493.FILE725.PDS'
 DELETE 'CBT.V493.FILE726.PDS'
 DELETE 'CBT.V493.FILE727.PDS'
 DELETE 'CBT.V493.FILE728.PDS'
 DELETE 'CBT.V493.FILE729.PDS'
 DELETE 'CBT.V493.FILE730.PDS'
 DELETE 'CBT.V493.FILE731.PDS'
 DELETE 'CBT.V493.FILE732.PDS'
 DELETE 'CBT.V493.FILE733.PDS'
 DELETE 'CBT.V493.FILE734.PDS'
 DELETE 'CBT.V493.FILE735.PDS'
 DELETE 'CBT.V493.FILE736.PDS'
 DELETE 'CBT.V493.FILE737.PDS'
 DELETE 'CBT.V493.FILE738.PDS'
 DELETE 'CBT.V493.FILE739.PDS'
 DELETE 'CBT.V493.FILE740.PDS'
 DELETE 'CBT.V493.FILE741.PDS'
 DELETE 'CBT.V493.FILE742.PDS'
 DELETE 'CBT.V493.FILE743.PDS'
 DELETE 'CBT.V493.FILE744.PDS'
 DELETE 'CBT.V493.FILE745.PDS'
 DELETE 'CBT.V493.FILE746.PDS'
 DELETE 'CBT.V493.FILE747.PDS'
 DELETE 'CBT.V493.FILE748.PDS'
 DELETE 'CBT.V493.FILE749.PDS'
 DELETE 'CBT.V493.FILE750.PDS'
 DELETE 'CBT.V493.FILE751.PDS'
 DELETE 'CBT.V493.FILE752.PDS'
 DELETE 'CBT.V493.FILE753.PDS'
 DELETE 'CBT.V493.FILE754.PDS'
 DELETE 'CBT.V493.FILE755.PDS'
 DELETE 'CBT.V493.FILE756.PDS'
 DELETE 'CBT.V493.FILE757.PDS'
 DELETE 'CBT.V493.FILE758.PDS'
 DELETE 'CBT.V493.FILE759.PDS'
 DELETE 'CBT.V493.FILE760.PDS'
 DELETE 'CBT.V493.FILE761.PDS'
 DELETE 'CBT.V493.FILE762.PDS'
 DELETE 'CBT.V493.FILE763.PDS'
 DELETE 'CBT.V493.FILE764.PDS'
 DELETE 'CBT.V493.FILE765.PDS'
 DELETE 'CBT.V493.FILE766.PDS'
 DELETE 'CBT.V493.FILE767.PDS'
 DELETE 'CBT.V493.FILE768.PDS'
 DELETE 'CBT.V493.FILE769.PDS'
 DELETE 'CBT.V493.FILE770.PDS'
 DELETE 'CBT.V493.FILE771.PDS'
 DELETE 'CBT.V493.FILE772.PDS'
 DELETE 'CBT.V493.FILE773.PDS'
 DELETE 'CBT.V493.FILE774.PDS'
 DELETE 'CBT.V493.FILE775.PDS'
 DELETE 'CBT.V493.FILE776.PDS'
 DELETE 'CBT.V493.FILE777.PDS'
 DELETE 'CBT.V493.FILE778.PDS'
 DELETE 'CBT.V493.FILE779.PDS'
 DELETE 'CBT.V493.FILE780.PDS'
 DELETE 'CBT.V493.FILE781.PDS'
 DELETE 'CBT.V493.FILE782.PDS'
 DELETE 'CBT.V493.FILE783.PDS'
 DELETE 'CBT.V493.FILE784.PDS'
 DELETE 'CBT.V493.FILE785.PDS'
 DELETE 'CBT.V493.FILE786.PDS'
 DELETE 'CBT.V493.FILE787.PDS'
 DELETE 'CBT.V493.FILE788.PDS'
 DELETE 'CBT.V493.FILE789.PDS'
 DELETE 'CBT.V493.FILE790.PDS'
 DELETE 'CBT.V493.FILE791.PDS'
 DELETE 'CBT.V493.FILE792.PDS'
 DELETE 'CBT.V493.FILE793.PDS'
 DELETE 'CBT.V493.FILE794.PDS'
 DELETE 'CBT.V493.FILE795.PDS'
 DELETE 'CBT.V493.FILE796.PDS'
 DELETE 'CBT.V493.FILE797.PDS'
 DELETE 'CBT.V493.FILE798.PDS'
 DELETE 'CBT.V493.FILE799.PDS'
 DELETE 'CBT.V493.FILE800.PDS'
 DELETE 'CBT.V493.FILE801.PDS'
 DELETE 'CBT.V493.FILE802.PDS'
 DELETE 'CBT.V493.FILE803.PDS'
 DELETE 'CBT.V493.FILE804.PDS'
 DELETE 'CBT.V493.FILE805.PDS'
 DELETE 'CBT.V493.FILE806.PDS'
 DELETE 'CBT.V493.FILE807.PDS'
 DELETE 'CBT.V493.FILE808.DATA'
 DELETE 'CBT.V493.FILE809.PDS'
 DELETE 'CBT.V493.FILE810.PDS'
 DELETE 'CBT.V493.FILE811.PDS'
 DELETE 'CBT.V493.FILE812.PDS'
 DELETE 'CBT.V493.FILE813.PDS'
 DELETE 'CBT.V493.FILE814.PDS'
 DELETE 'CBT.V493.FILE815.PDS'
 DELETE 'CBT.V493.FILE816.PDS'
 DELETE 'CBT.V493.FILE817.PDS'
 DELETE 'CBT.V493.FILE818.PDS'
 DELETE 'CBT.V493.FILE819.PDS'
 DELETE 'CBT.V493.FILE820.PDS'
 DELETE 'CBT.V493.FILE821.PDS'
 DELETE 'CBT.V493.FILE822.PDS'
 DELETE 'CBT.V493.FILE823.PDS'
 DELETE 'CBT.V493.FILE824.PDS'
 DELETE 'CBT.V493.FILE825.PDS'
 DELETE 'CBT.V493.FILE826.PDS'
 DELETE 'CBT.V493.FILE827.PDS'
 DELETE 'CBT.V493.FILE828.PDS'
 DELETE 'CBT.V493.FILE829.PDS'
 DELETE 'CBT.V493.FILE830.PDS'
 DELETE 'CBT.V493.FILE831.PDS'
 DELETE 'CBT.V493.FILE832.PDS'
 DELETE 'CBT.V493.FILE833.PDS'
 DELETE 'CBT.V493.FILE834.PDS'
 DELETE 'CBT.V493.FILE835.PDS'
 DELETE 'CBT.V493.FILE836.PDS'
 DELETE 'CBT.V493.FILE837.PDS'
 DELETE 'CBT.V493.FILE838.PDS'
 DELETE 'CBT.V493.FILE839.PDS'
 DELETE 'CBT.V493.FILE840.PDS'
 DELETE 'CBT.V493.FILE841.PDS'
 DELETE 'CBT.V493.FILE842.PDS'
 DELETE 'CBT.V493.FILE843.PDS'
 DELETE 'CBT.V493.FILE844.PDS'
 DELETE 'CBT.V493.FILE845.PDS'
 DELETE 'CBT.V493.FILE846.PDS'
 DELETE 'CBT.V493.FILE847.PDS'
 DELETE 'CBT.V493.FILE848.PDS'
 DELETE 'CBT.V493.FILE849.PDS'
 DELETE 'CBT.V493.FILE850.PDS'
 DELETE 'CBT.V493.FILE851.PDS'
 DELETE 'CBT.V493.FILE852.PDS'
 DELETE 'CBT.V493.FILE853.PDS'
 DELETE 'CBT.V493.FILE854.PDS'
 DELETE 'CBT.V493.FILE855.PDS'
 DELETE 'CBT.V493.FILE856.PDS'
 DELETE 'CBT.V493.FILE857.PDS'
 DELETE 'CBT.V493.FILE858.PDS'
 DELETE 'CBT.V493.FILE859.PDS'
 DELETE 'CBT.V493.FILE860.PDS'
 DELETE 'CBT.V493.FILE861.PDS'
 DELETE 'CBT.V493.FILE862.PDS'
 DELETE 'CBT.V493.FILE863.PDS'
 DELETE 'CBT.V493.FILE864.PDS'
 DELETE 'CBT.V493.FILE865.PDS'
 DELETE 'CBT.V493.FILE866.PDS'
 DELETE 'CBT.V493.FILE867.PDS'
 DELETE 'CBT.V493.FILE868.PDS'
 DELETE 'CBT.V493.FILE869.PDS'
 DELETE 'CBT.V493.FILE870.PDS'
 DELETE 'CBT.V493.FILE871.PDS'
 DELETE 'CBT.V493.FILE872.PDS'
 DELETE 'CBT.V493.FILE873.PDS'
 DELETE 'CBT.V493.FILE874.PDS'
 DELETE 'CBT.V493.FILE875.PDS'
 DELETE 'CBT.V493.FILE876.PDS'
 DELETE 'CBT.V493.FILE877.PDS'
 DELETE 'CBT.V493.FILE878.PDS'
 DELETE 'CBT.V493.FILE879.PDS'
 DELETE 'CBT.V493.FILE880.PDS'
 DELETE 'CBT.V493.FILE881.PDS'
 DELETE 'CBT.V493.FILE882.PDS'
 DELETE 'CBT.V493.FILE883.PDS'
 DELETE 'CBT.V493.FILE884.PDS'
 DELETE 'CBT.V493.FILE885.PDS'
 DELETE 'CBT.V493.FILE886.PDS'
 DELETE 'CBT.V493.FILE887.PDS'
 DELETE 'CBT.V493.FILE888.PDS'
 DELETE 'CBT.V493.FILE889.PDS'
 DELETE 'CBT.V493.FILE890.PDS'
 DELETE 'CBT.V493.FILE891.PDS'
 DELETE 'CBT.V493.FILE892.PDS'
 DELETE 'CBT.V493.FILE893.PDS'
 DELETE 'CBT.V493.FILE894.PDS'
 DELETE 'CBT.V493.FILE895.PDS'
 DELETE 'CBT.V493.FILE896.PDS'
 DELETE 'CBT.V493.FILE897.PDS'
 DELETE 'CBT.V493.FILE898.PDS'
 DELETE 'CBT.V493.FILE899.PDS'
 DELETE 'CBT.V493.FILE900.PDS'
 DELETE 'CBT.V493.FILE901.PDS'
 DELETE 'CBT.V493.FILE902.PDS'
 DELETE 'CBT.V493.FILE903.PDS'
 DELETE 'CBT.V493.FILE904.PDS'
 DELETE 'CBT.V493.FILE905.PDS'
 DELETE 'CBT.V493.FILE906.PDS'
 DELETE 'CBT.V493.FILE907.PDS'
 DELETE 'CBT.V493.FILE908.PDS'
 DELETE 'CBT.V493.FILE909.PDS'
 DELETE 'CBT.V493.FILE910.PDS'
 DELETE 'CBT.V493.FILE911.PDS'
 DELETE 'CBT.V493.FILE912.PDS'
 DELETE 'CBT.V493.FILE913.PDS'
 DELETE 'CBT.V493.FILE914.PDS'
 DELETE 'CBT.V493.FILE915.PDS'
 DELETE 'CBT.V493.FILE916.PDS'
 DELETE 'CBT.V493.FILE917.PDS'
 DELETE 'CBT.V493.FILE918.PDS'
 DELETE 'CBT.V493.FILE919.PDS'
 DELETE 'CBT.V493.FILE920.PDS'
 DELETE 'CBT.V493.FILE921.PDS'
 DELETE 'CBT.V493.FILE922.PDS'
 DELETE 'CBT.V493.FILE923.PDS'
 DELETE 'CBT.V493.FILE924.PDS'
 DELETE 'CBT.V493.FILE925.PDS'
 DELETE 'CBT.V493.FILE926.PDS'
 DELETE 'CBT.V493.FILE927.PDS'
 DELETE 'CBT.V493.FILE928.PDS'
 DELETE 'CBT.V493.FILE929.PDS'
 DELETE 'CBT.V493.FILE930.PDS'
 DELETE 'CBT.V493.FILE931.PDS'
 DELETE 'CBT.V493.FILE932.DATA'
 DELETE 'CBT.V493.FILE933.DATA'
 DELETE 'CBT.V493.FILE934.PDS'
 DELETE 'CBT.V493.FILE935.PDS'
 DELETE 'CBT.V493.FILE936.PDS'
 DELETE 'CBT.V493.FILE937.PDS'
 DELETE 'CBT.V493.FILE938.PDS'
 DELETE 'CBT.V493.FILE939.PDS'
 DELETE 'CBT.V493.FILE940.PDS'
 DELETE 'CBT.V493.FILE941.PDS'
 DELETE 'CBT.V493.FILE942.PDS'
 DELETE 'CBT.V493.FILE943.PDS'
 DELETE 'CBT.V493.FILE944.PDS'
 DELETE 'CBT.V493.FILE945.PDS'
 DELETE 'CBT.V493.FILE946.PDS'
 DELETE 'CBT.V493.FILE947.PDS'
 DELETE 'CBT.V493.FILE948.PDS'
 DELETE 'CBT.V493.FILE949.PDS'
 DELETE 'CBT.V493.FILE950.PDS'
 DELETE 'CBT.V493.FILE951.PDS'
 DELETE 'CBT.V493.FILE952.PDS'
 DELETE 'CBT.V493.FILE953.PDS'
