//SBGOLOBT  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//*    DELETE ALL FILES ON PACK CBTA02, PRIOR TO REPLACEMENT
//*    WITH NEW FILES UNLOADED FROM THE FRESHLY-MADE NEW TAPE,
//*    WHICH WERE THEN CONVERTED INTO XMIT FORMAT.
//*
//TSOBATCH EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 DELETE 'CBT.V493.FILE006.XMI'
 DELETE 'CBT.V493.FILE007.XMI'
 DELETE 'CBT.V493.FILE008.XMI'
 DELETE 'CBT.V493.FILE009.XMI'
 DELETE 'CBT.V493.FILE010.XMI'
 DELETE 'CBT.V493.FILE011.XMI'
 DELETE 'CBT.V493.FILE012.XMI'
 DELETE 'CBT.V493.FILE013.XMI'
 DELETE 'CBT.V493.FILE014.XMI'
 DELETE 'CBT.V493.FILE015.XMI'
 DELETE 'CBT.V493.FILE016.XMI'
 DELETE 'CBT.V493.FILE017.XMI'
 DELETE 'CBT.V493.FILE019.XMI'
 DELETE 'CBT.V493.FILE020.XMI'
 DELETE 'CBT.V493.FILE021.XMI'
 DELETE 'CBT.V493.FILE022.XMI'
 DELETE 'CBT.V493.FILE023.XMI'
 DELETE 'CBT.V493.FILE024.XMI'
 DELETE 'CBT.V493.FILE025.XMI'
 DELETE 'CBT.V493.FILE026.XMI'
 DELETE 'CBT.V493.FILE027.XMI'
 DELETE 'CBT.V493.FILE028.XMI'
 DELETE 'CBT.V493.FILE029.XMI'
 DELETE 'CBT.V493.FILE030.XMI'
 DELETE 'CBT.V493.FILE031.XMI'
 DELETE 'CBT.V493.FILE032.XMI'
 DELETE 'CBT.V493.FILE033.XMI'
 DELETE 'CBT.V493.FILE034.XMI'
 DELETE 'CBT.V493.FILE035.XMI'
 DELETE 'CBT.V493.FILE036.XMI'
 DELETE 'CBT.V493.FILE037.XMI'
 DELETE 'CBT.V493.FILE038.XMI'
 DELETE 'CBT.V493.FILE039.XMI'
 DELETE 'CBT.V493.FILE040.XMI'
 DELETE 'CBT.V493.FILE041.XMI'
 DELETE 'CBT.V493.FILE042.XMI'
 DELETE 'CBT.V493.FILE044.XMI'
 DELETE 'CBT.V493.FILE045.XMI'
 DELETE 'CBT.V493.FILE046.XMI'
 DELETE 'CBT.V493.FILE047.XMI'
 DELETE 'CBT.V493.FILE048.XMI'
 DELETE 'CBT.V493.FILE049.XMI'
 DELETE 'CBT.V493.FILE050.XMI'
 DELETE 'CBT.V493.FILE051.XMI'
 DELETE 'CBT.V493.FILE052.XMI'
 DELETE 'CBT.V493.FILE053.XMI'
 DELETE 'CBT.V493.FILE054.XMI'
 DELETE 'CBT.V493.FILE055.XMI'
 DELETE 'CBT.V493.FILE056.XMI'
 DELETE 'CBT.V493.FILE057.XMI'
 DELETE 'CBT.V493.FILE058.XMI'
 DELETE 'CBT.V493.FILE059.XMI'
 DELETE 'CBT.V493.FILE060.XMI'
 DELETE 'CBT.V493.FILE061.XMI'
 DELETE 'CBT.V493.FILE065.XMI'
 DELETE 'CBT.V493.FILE066.XMI'
 DELETE 'CBT.V493.FILE067.XMI'
 DELETE 'CBT.V493.FILE068.XMI'
 DELETE 'CBT.V493.FILE069.XMI'
 DELETE 'CBT.V493.FILE070.XMI'
 DELETE 'CBT.V493.FILE071.XMI'
 DELETE 'CBT.V493.FILE072.XMI'
 DELETE 'CBT.V493.FILE073.XMI'
 DELETE 'CBT.V493.FILE074.XMI'
 DELETE 'CBT.V493.FILE075.XMI'
 DELETE 'CBT.V493.FILE076.XMI'
 DELETE 'CBT.V493.FILE077.XMI'
 DELETE 'CBT.V493.FILE078.XMI'
 DELETE 'CBT.V493.FILE079.XMI'
 DELETE 'CBT.V493.FILE080.XMI'
 DELETE 'CBT.V493.FILE081.XMI'
 DELETE 'CBT.V493.FILE082.XMI'
 DELETE 'CBT.V493.FILE083.XMI'
 DELETE 'CBT.V493.FILE084.XMI'
 DELETE 'CBT.V493.FILE085.XMI'
 DELETE 'CBT.V493.FILE086.XMI'
 DELETE 'CBT.V493.FILE087.XMI'
 DELETE 'CBT.V493.FILE088.XMI'
 DELETE 'CBT.V493.FILE089.XMI'
 DELETE 'CBT.V493.FILE090.XMI'
 DELETE 'CBT.V493.FILE091.XMI'
 DELETE 'CBT.V493.FILE092.XMI'
 DELETE 'CBT.V493.FILE093.XMI'
 DELETE 'CBT.V493.FILE094.XMI'
 DELETE 'CBT.V493.FILE095.XMI'
 DELETE 'CBT.V493.FILE096.XMI'
 DELETE 'CBT.V493.FILE097.XMI'
 DELETE 'CBT.V493.FILE098.XMI'
 DELETE 'CBT.V493.FILE100.XMI'
 DELETE 'CBT.V493.FILE101.XMI'
 DELETE 'CBT.V493.FILE102.XMI'
 DELETE 'CBT.V493.FILE103.XMI'
 DELETE 'CBT.V493.FILE104.XMI'
 DELETE 'CBT.V493.FILE105.XMI'
 DELETE 'CBT.V493.FILE106.XMI'
 DELETE 'CBT.V493.FILE107.XMI'
 DELETE 'CBT.V493.FILE108.XMI'
 DELETE 'CBT.V493.FILE109.XMI'
 DELETE 'CBT.V493.FILE111.XMI'
 DELETE 'CBT.V493.FILE112.XMI'
 DELETE 'CBT.V493.FILE113.XMI'
 DELETE 'CBT.V493.FILE114.XMI'
 DELETE 'CBT.V493.FILE115.XMI'
 DELETE 'CBT.V493.FILE116.XMI'
 DELETE 'CBT.V493.FILE117.XMI'
 DELETE 'CBT.V493.FILE118.XMI'
 DELETE 'CBT.V493.FILE119.XMI'
 DELETE 'CBT.V493.FILE120.XMI'
 DELETE 'CBT.V493.FILE121.XMI'
 DELETE 'CBT.V493.FILE122.XMI'
 DELETE 'CBT.V493.FILE123.XMI'
 DELETE 'CBT.V493.FILE124.XMI'
 DELETE 'CBT.V493.FILE125.XMI'
 DELETE 'CBT.V493.FILE126.XMI'
 DELETE 'CBT.V493.FILE127.XMI'
 DELETE 'CBT.V493.FILE128.XMI'
 DELETE 'CBT.V493.FILE129.XMI'
 DELETE 'CBT.V493.FILE130.XMI'
 DELETE 'CBT.V493.FILE131.XMI'
 DELETE 'CBT.V493.FILE132.XMI'
 DELETE 'CBT.V493.FILE133.XMI'
 DELETE 'CBT.V493.FILE134.XMI'
 DELETE 'CBT.V493.FILE135.XMI'
 DELETE 'CBT.V493.FILE136.XMI'
 DELETE 'CBT.V493.FILE137.XMI'
 DELETE 'CBT.V493.FILE138.XMI'
 DELETE 'CBT.V493.FILE139.XMI'
 DELETE 'CBT.V493.FILE140.XMI'
 DELETE 'CBT.V493.FILE141.XMI'
 DELETE 'CBT.V493.FILE142.XMI'
 DELETE 'CBT.V493.FILE143.XMI'
 DELETE 'CBT.V493.FILE144.XMI'
 DELETE 'CBT.V493.FILE145.XMI'
 DELETE 'CBT.V493.FILE146.XMI'
 DELETE 'CBT.V493.FILE147.XMI'
 DELETE 'CBT.V493.FILE148.XMI'
 DELETE 'CBT.V493.FILE149.XMI'
 DELETE 'CBT.V493.FILE150.XMI'
 DELETE 'CBT.V493.FILE151.XMI'
 DELETE 'CBT.V493.FILE152.XMI'
 DELETE 'CBT.V493.FILE153.XMI'
 DELETE 'CBT.V493.FILE154.XMI'
 DELETE 'CBT.V493.FILE155.XMI'
 DELETE 'CBT.V493.FILE156.XMI'
 DELETE 'CBT.V493.FILE158.XMI'
 DELETE 'CBT.V493.FILE159.XMI'
 DELETE 'CBT.V493.FILE160.XMI'
 DELETE 'CBT.V493.FILE161.XMI'
 DELETE 'CBT.V493.FILE162.XMI'
 DELETE 'CBT.V493.FILE163.XMI'
 DELETE 'CBT.V493.FILE164.XMI'
 DELETE 'CBT.V493.FILE165.XMI'
 DELETE 'CBT.V493.FILE166.XMI'
 DELETE 'CBT.V493.FILE167.XMI'
 DELETE 'CBT.V493.FILE168.XMI'
 DELETE 'CBT.V493.FILE169.XMI'
 DELETE 'CBT.V493.FILE170.XMI'
 DELETE 'CBT.V493.FILE171.XMI'
 DELETE 'CBT.V493.FILE172.XMI'
 DELETE 'CBT.V493.FILE173.XMI'
 DELETE 'CBT.V493.FILE174.XMI'
 DELETE 'CBT.V493.FILE175.XMI'
 DELETE 'CBT.V493.FILE176.XMI'
 DELETE 'CBT.V493.FILE177.XMI'
 DELETE 'CBT.V493.FILE178.XMI'
 DELETE 'CBT.V493.FILE179.XMI'
 DELETE 'CBT.V493.FILE180.XMI'
 DELETE 'CBT.V493.FILE181.XMI'
 DELETE 'CBT.V493.FILE182.XMI'
 DELETE 'CBT.V493.FILE183.XMI'
 DELETE 'CBT.V493.FILE184.XMI'
 DELETE 'CBT.V493.FILE185.XMI'
 DELETE 'CBT.V493.FILE186.XMI'
 DELETE 'CBT.V493.FILE187.XMI'
 DELETE 'CBT.V493.FILE188.XMI'
 DELETE 'CBT.V493.FILE189.XMI'
 DELETE 'CBT.V493.FILE190.XMI'
 DELETE 'CBT.V493.FILE191.XMI'
 DELETE 'CBT.V493.FILE192.XMI'
 DELETE 'CBT.V493.FILE193.XMI'
 DELETE 'CBT.V493.FILE194.XMI'
 DELETE 'CBT.V493.FILE195.XMI'
 DELETE 'CBT.V493.FILE196.XMI'
 DELETE 'CBT.V493.FILE197.XMI'
 DELETE 'CBT.V493.FILE198.XMI'
 DELETE 'CBT.V493.FILE199.XMI'
 DELETE 'CBT.V493.FILE200.XMI'
 DELETE 'CBT.V493.FILE201.XMI'
 DELETE 'CBT.V493.FILE202.XMI'
 DELETE 'CBT.V493.FILE203.XMI'
 DELETE 'CBT.V493.FILE204.XMI'
 DELETE 'CBT.V493.FILE205.XMI'
 DELETE 'CBT.V493.FILE206.XMI'
 DELETE 'CBT.V493.FILE207.XMI'
 DELETE 'CBT.V493.FILE208.XMI'
 DELETE 'CBT.V493.FILE209.XMI'
 DELETE 'CBT.V493.FILE210.XMI'
 DELETE 'CBT.V493.FILE211.XMI'
 DELETE 'CBT.V493.FILE212.XMI'
 DELETE 'CBT.V493.FILE213.XMI'
 DELETE 'CBT.V493.FILE214.XMI'
 DELETE 'CBT.V493.FILE215.XMI'
 DELETE 'CBT.V493.FILE216.XMI'
 DELETE 'CBT.V493.FILE217.XMI'
 DELETE 'CBT.V493.FILE218.XMI'
 DELETE 'CBT.V493.FILE219.XMI'
 DELETE 'CBT.V493.FILE220.XMI'
 DELETE 'CBT.V493.FILE221.XMI'
 DELETE 'CBT.V493.FILE222.XMI'
 DELETE 'CBT.V493.FILE223.XMI'
 DELETE 'CBT.V493.FILE224.XMI'
 DELETE 'CBT.V493.FILE225.XMI'
 DELETE 'CBT.V493.FILE226.XMI'
 DELETE 'CBT.V493.FILE227.XMI'
 DELETE 'CBT.V493.FILE228.XMI'
 DELETE 'CBT.V493.FILE229.XMI'
 DELETE 'CBT.V493.FILE231.XMI'
 DELETE 'CBT.V493.FILE232.XMI'
 DELETE 'CBT.V493.FILE233.XMI'
 DELETE 'CBT.V493.FILE234.XMI'
 DELETE 'CBT.V493.FILE235.XMI'
 DELETE 'CBT.V493.FILE236.XMI'
 DELETE 'CBT.V493.FILE237.XMI'
 DELETE 'CBT.V493.FILE238.XMI'
 DELETE 'CBT.V493.FILE239.XMI'
 DELETE 'CBT.V493.FILE240.XMI'
 DELETE 'CBT.V493.FILE241.XMI'
 DELETE 'CBT.V493.FILE242.XMI'
 DELETE 'CBT.V493.FILE243.XMI'
 DELETE 'CBT.V493.FILE244.XMI'
 DELETE 'CBT.V493.FILE245.XMI'
 DELETE 'CBT.V493.FILE246.XMI'
 DELETE 'CBT.V493.FILE247.XMI'
 DELETE 'CBT.V493.FILE248.XMI'
 DELETE 'CBT.V493.FILE249.XMI'
 DELETE 'CBT.V493.FILE250.XMI'
 DELETE 'CBT.V493.FILE251.XMI'
 DELETE 'CBT.V493.FILE252.XMI'
 DELETE 'CBT.V493.FILE253.XMI'
 DELETE 'CBT.V493.FILE254.XMI'
 DELETE 'CBT.V493.FILE255.XMI'
 DELETE 'CBT.V493.FILE256.XMI'
 DELETE 'CBT.V493.FILE257.XMI'
 DELETE 'CBT.V493.FILE258.XMI'
 DELETE 'CBT.V493.FILE259.XMI'
 DELETE 'CBT.V493.FILE260.XMI'
 DELETE 'CBT.V493.FILE261.XMI'
 DELETE 'CBT.V493.FILE262.XMI'
 DELETE 'CBT.V493.FILE263.XMI'
 DELETE 'CBT.V493.FILE264.XMI'
 DELETE 'CBT.V493.FILE265.XMI'
 DELETE 'CBT.V493.FILE266.XMI'
 DELETE 'CBT.V493.FILE267.XMI'
 DELETE 'CBT.V493.FILE268.XMI'
 DELETE 'CBT.V493.FILE269.XMI'
 DELETE 'CBT.V493.FILE270.XMI'
 DELETE 'CBT.V493.FILE271.XMI'
 DELETE 'CBT.V493.FILE272.XMI'
 DELETE 'CBT.V493.FILE273.XMI'
 DELETE 'CBT.V493.FILE274.XMI'
 DELETE 'CBT.V493.FILE275.XMI'
 DELETE 'CBT.V493.FILE276.XMI'
 DELETE 'CBT.V493.FILE277.XMI'
 DELETE 'CBT.V493.FILE278.XMI'
 DELETE 'CBT.V493.FILE279.XMI'
 DELETE 'CBT.V493.FILE280.XMI'
 DELETE 'CBT.V493.FILE281.XMI'
 DELETE 'CBT.V493.FILE282.XMI'
 DELETE 'CBT.V493.FILE283.XMI'
 DELETE 'CBT.V493.FILE284.XMI'
 DELETE 'CBT.V493.FILE285.XMI'
 DELETE 'CBT.V493.FILE286.XMI'
 DELETE 'CBT.V493.FILE287.XMI'
 DELETE 'CBT.V493.FILE288.XMI'
 DELETE 'CBT.V493.FILE289.XMI'
 DELETE 'CBT.V493.FILE290.XMI'
 DELETE 'CBT.V493.FILE291.XMI'
 DELETE 'CBT.V493.FILE292.XMI'
 DELETE 'CBT.V493.FILE293.XMI'
 DELETE 'CBT.V493.FILE294.XMI'
 DELETE 'CBT.V493.FILE295.XMI'
 DELETE 'CBT.V493.FILE296.XMI'
 DELETE 'CBT.V493.FILE297.XMI'
 DELETE 'CBT.V493.FILE298.XMI'
 DELETE 'CBT.V493.FILE299.XMI'
 DELETE 'CBT.V493.FILE300.XMI'
 DELETE 'CBT.V493.FILE301.XMI'
 DELETE 'CBT.V493.FILE302.XMI'
 DELETE 'CBT.V493.FILE303.XMI'
 DELETE 'CBT.V493.FILE304.XMI'
 DELETE 'CBT.V493.FILE305.XMI'
 DELETE 'CBT.V493.FILE306.XMI'
 DELETE 'CBT.V493.FILE307.XMI'
 DELETE 'CBT.V493.FILE308.XMI'
 DELETE 'CBT.V493.FILE309.XMI'
 DELETE 'CBT.V493.FILE310.XMI'
 DELETE 'CBT.V493.FILE311.XMI'
 DELETE 'CBT.V493.FILE312.XMI'
 DELETE 'CBT.V493.FILE313.XMI'
 DELETE 'CBT.V493.FILE314.XMI'
 DELETE 'CBT.V493.FILE315.XMI'
 DELETE 'CBT.V493.FILE316.XMI'
 DELETE 'CBT.V493.FILE317.XMI'
 DELETE 'CBT.V493.FILE318.XMI'
 DELETE 'CBT.V493.FILE319.XMI'
 DELETE 'CBT.V493.FILE320.XMI'
 DELETE 'CBT.V493.FILE321.XMI'
 DELETE 'CBT.V493.FILE322.XMI'
 DELETE 'CBT.V493.FILE323.XMI'
 DELETE 'CBT.V493.FILE324.XMI'
 DELETE 'CBT.V493.FILE325.XMI'
 DELETE 'CBT.V493.FILE326.XMI'
 DELETE 'CBT.V493.FILE327.XMI'
 DELETE 'CBT.V493.FILE328.XMI'
 DELETE 'CBT.V493.FILE329.XMI'
 DELETE 'CBT.V493.FILE330.XMI'
 DELETE 'CBT.V493.FILE331.XMI'
 DELETE 'CBT.V493.FILE332.XMI'
 DELETE 'CBT.V493.FILE333.XMI'
 DELETE 'CBT.V493.FILE334.XMI'
 DELETE 'CBT.V493.FILE335.XMI'
 DELETE 'CBT.V493.FILE336.XMI'
 DELETE 'CBT.V493.FILE337.XMI'
 DELETE 'CBT.V493.FILE338.XMI'
 DELETE 'CBT.V493.FILE339.XMI'
 DELETE 'CBT.V493.FILE340.XMI'
 DELETE 'CBT.V493.FILE341.XMI'
 DELETE 'CBT.V493.FILE342.XMI'
 DELETE 'CBT.V493.FILE343.XMI'
 DELETE 'CBT.V493.FILE344.XMI'
 DELETE 'CBT.V493.FILE345.XMI'
 DELETE 'CBT.V493.FILE346.XMI'
 DELETE 'CBT.V493.FILE347.XMI'
 DELETE 'CBT.V493.FILE348.XMI'
 DELETE 'CBT.V493.FILE349.XMI'
 DELETE 'CBT.V493.FILE350.XMI'
 DELETE 'CBT.V493.FILE351.XMI'
 DELETE 'CBT.V493.FILE352.XMI'
 DELETE 'CBT.V493.FILE353.XMI'
 DELETE 'CBT.V493.FILE354.XMI'
 DELETE 'CBT.V493.FILE355.XMI'
 DELETE 'CBT.V493.FILE356.XMI'
 DELETE 'CBT.V493.FILE357.XMI'
 DELETE 'CBT.V493.FILE358.XMI'
 DELETE 'CBT.V493.FILE359.XMI'
 DELETE 'CBT.V493.FILE360.XMI'
 DELETE 'CBT.V493.FILE361.XMI'
 DELETE 'CBT.V493.FILE362.XMI'
 DELETE 'CBT.V493.FILE363.XMI'
 DELETE 'CBT.V493.FILE364.XMI'
 DELETE 'CBT.V493.FILE365.XMI'
 DELETE 'CBT.V493.FILE366.XMI'
 DELETE 'CBT.V493.FILE367.XMI'
 DELETE 'CBT.V493.FILE368.XMI'
 DELETE 'CBT.V493.FILE369.XMI'
 DELETE 'CBT.V493.FILE370.XMI'
 DELETE 'CBT.V493.FILE371.XMI'
 DELETE 'CBT.V493.FILE372.XMI'
 DELETE 'CBT.V493.FILE373.XMI'
 DELETE 'CBT.V493.FILE374.XMI'
 DELETE 'CBT.V493.FILE375.XMI'
 DELETE 'CBT.V493.FILE376.XMI'
 DELETE 'CBT.V493.FILE377.XMI'
 DELETE 'CBT.V493.FILE378.XMI'
 DELETE 'CBT.V493.FILE379.XMI'
 DELETE 'CBT.V493.FILE380.XMI'
 DELETE 'CBT.V493.FILE381.XMI'
 DELETE 'CBT.V493.FILE382.XMI'
 DELETE 'CBT.V493.FILE383.XMI'
 DELETE 'CBT.V493.FILE384.XMI'
 DELETE 'CBT.V493.FILE385.XMI'
 DELETE 'CBT.V493.FILE386.XMI'
 DELETE 'CBT.V493.FILE387.XMI'
 DELETE 'CBT.V493.FILE388.XMI'
 DELETE 'CBT.V493.FILE389.XMI'
 DELETE 'CBT.V493.FILE390.XMI'
 DELETE 'CBT.V493.FILE391.XMI'
 DELETE 'CBT.V493.FILE392.XMI'
 DELETE 'CBT.V493.FILE393.XMI'
 DELETE 'CBT.V493.FILE394.XMI'
 DELETE 'CBT.V493.FILE395.XMI'
 DELETE 'CBT.V493.FILE396.XMI'
 DELETE 'CBT.V493.FILE397.XMI'
 DELETE 'CBT.V493.FILE398.XMI'
 DELETE 'CBT.V493.FILE399.XMI'
 DELETE 'CBT.V493.FILE400.XMI'
 DELETE 'CBT.V493.FILE401.XMI'
 DELETE 'CBT.V493.FILE402.XMI'
 DELETE 'CBT.V493.FILE403.XMI'
 DELETE 'CBT.V493.FILE404.XMI'
 DELETE 'CBT.V493.FILE405.XMI'
 DELETE 'CBT.V493.FILE406.XMI'
 DELETE 'CBT.V493.FILE407.XMI'
 DELETE 'CBT.V493.FILE408.XMI'
 DELETE 'CBT.V493.FILE409.XMI'
 DELETE 'CBT.V493.FILE410.XMI'
 DELETE 'CBT.V493.FILE411.XMI'
 DELETE 'CBT.V493.FILE412.XMI'
 DELETE 'CBT.V493.FILE413.XMI'
 DELETE 'CBT.V493.FILE414.XMI'
 DELETE 'CBT.V493.FILE415.XMI'
 DELETE 'CBT.V493.FILE416.XMI'
 DELETE 'CBT.V493.FILE417.XMI'
 DELETE 'CBT.V493.FILE418.XMI'
 DELETE 'CBT.V493.FILE419.XMI'
 DELETE 'CBT.V493.FILE420.XMI'
 DELETE 'CBT.V493.FILE421.XMI'
 DELETE 'CBT.V493.FILE422.XMI'
 DELETE 'CBT.V493.FILE423.XMI'
 DELETE 'CBT.V493.FILE424.XMI'
 DELETE 'CBT.V493.FILE425.XMI'
 DELETE 'CBT.V493.FILE426.XMI'
 DELETE 'CBT.V493.FILE427.XMI'
 DELETE 'CBT.V493.FILE428.XMI'
 DELETE 'CBT.V493.FILE429.XMI'
 DELETE 'CBT.V493.FILE430.XMI'
 DELETE 'CBT.V493.FILE431.XMI'
 DELETE 'CBT.V493.FILE432.XMI'
 DELETE 'CBT.V493.FILE433.XMI'
 DELETE 'CBT.V493.FILE434.XMI'
 DELETE 'CBT.V493.FILE435.XMI'
 DELETE 'CBT.V493.FILE436.XMI'
 DELETE 'CBT.V493.FILE437.XMI'
 DELETE 'CBT.V493.FILE438.XMI'
 DELETE 'CBT.V493.FILE439.XMI'
 DELETE 'CBT.V493.FILE440.XMI'
 DELETE 'CBT.V493.FILE441.XMI'
 DELETE 'CBT.V493.FILE442.XMI'
 DELETE 'CBT.V493.FILE443.XMI'
 DELETE 'CBT.V493.FILE444.XMI'
 DELETE 'CBT.V493.FILE445.XMI'
 DELETE 'CBT.V493.FILE446.XMI'
 DELETE 'CBT.V493.FILE447.XMI'
 DELETE 'CBT.V493.FILE448.XMI'
 DELETE 'CBT.V493.FILE449.XMI'
 DELETE 'CBT.V493.FILE450.XMI'
 DELETE 'CBT.V493.FILE451.XMI'
 DELETE 'CBT.V493.FILE452.XMI'
 DELETE 'CBT.V493.FILE453.XMI'
 DELETE 'CBT.V493.FILE454.XMI'
 DELETE 'CBT.V493.FILE455.XMI'
 DELETE 'CBT.V493.FILE456.XMI'
 DELETE 'CBT.V493.FILE457.XMI'
 DELETE 'CBT.V493.FILE458.XMI'
 DELETE 'CBT.V493.FILE459.XMI'
 DELETE 'CBT.V493.FILE460.XMI'
 DELETE 'CBT.V493.FILE461.XMI'
 DELETE 'CBT.V493.FILE462.XMI'
 DELETE 'CBT.V493.FILE463.XMI'
 DELETE 'CBT.V493.FILE464.XMI'
 DELETE 'CBT.V493.FILE465.XMI'
 DELETE 'CBT.V493.FILE466.XMI'
 DELETE 'CBT.V493.FILE467.XMI'
 DELETE 'CBT.V493.FILE468.XMI'
 DELETE 'CBT.V493.FILE469.XMI'
 DELETE 'CBT.V493.FILE470.XMI'
 DELETE 'CBT.V493.FILE471.XMI'
 DELETE 'CBT.V493.FILE472.XMI'
 DELETE 'CBT.V493.FILE473.XMI'
 DELETE 'CBT.V493.FILE474.XMI'
 DELETE 'CBT.V493.FILE475.XMI'
 DELETE 'CBT.V493.FILE476.XMI'
 DELETE 'CBT.V493.FILE477.XMI'
 DELETE 'CBT.V493.FILE478.XMI'
 DELETE 'CBT.V493.FILE479.XMI'
 DELETE 'CBT.V493.FILE480.XMI'
 DELETE 'CBT.V493.FILE481.XMI'
 DELETE 'CBT.V493.FILE482.XMI'
 DELETE 'CBT.V493.FILE483.XMI'
 DELETE 'CBT.V493.FILE484.XMI'
 DELETE 'CBT.V493.FILE485.XMI'
 DELETE 'CBT.V493.FILE486.XMI'
 DELETE 'CBT.V493.FILE487.XMI'
 DELETE 'CBT.V493.FILE488.XMI'
 DELETE 'CBT.V493.FILE489.XMI'
 DELETE 'CBT.V493.FILE490.XMI'
 DELETE 'CBT.V493.FILE491.XMI'
 DELETE 'CBT.V493.FILE492.XMI'
 DELETE 'CBT.V493.FILE493.XMI'
 DELETE 'CBT.V493.FILE494.XMI'
 DELETE 'CBT.V493.FILE495.XMI'
 DELETE 'CBT.V493.FILE496.XMI'
 DELETE 'CBT.V493.FILE497.XMI'
 DELETE 'CBT.V493.FILE498.XMI'
 DELETE 'CBT.V493.FILE499.XMI'
 DELETE 'CBT.V493.FILE500.XMI'
 DELETE 'CBT.V493.FILE501.XMI'
 DELETE 'CBT.V493.FILE502.XMI'
 DELETE 'CBT.V493.FILE503.XMI'
 DELETE 'CBT.V493.FILE504.XMI'
 DELETE 'CBT.V493.FILE505.XMI'
 DELETE 'CBT.V493.FILE506.XMI'
 DELETE 'CBT.V493.FILE507.XMI'
 DELETE 'CBT.V493.FILE508.XMI'
 DELETE 'CBT.V493.FILE509.XMI'
 DELETE 'CBT.V493.FILE510.XMI'
 DELETE 'CBT.V493.FILE511.XMI'
 DELETE 'CBT.V493.FILE512.XMI'
 DELETE 'CBT.V493.FILE513.XMI'
 DELETE 'CBT.V493.FILE514.XMI'
 DELETE 'CBT.V493.FILE515.XMI'
 DELETE 'CBT.V493.FILE516.XMI'
 DELETE 'CBT.V493.FILE517.XMI'
 DELETE 'CBT.V493.FILE518.XMI'
 DELETE 'CBT.V493.FILE519.XMI'
 DELETE 'CBT.V493.FILE520.XMI'
 DELETE 'CBT.V493.FILE521.XMI'
 DELETE 'CBT.V493.FILE522.XMI'
 DELETE 'CBT.V493.FILE523.XMI'
 DELETE 'CBT.V493.FILE524.XMI'
 DELETE 'CBT.V493.FILE525.XMI'
 DELETE 'CBT.V493.FILE526.XMI'
 DELETE 'CBT.V493.FILE527.XMI'
 DELETE 'CBT.V493.FILE528.XMI'
 DELETE 'CBT.V493.FILE529.XMI'
 DELETE 'CBT.V493.FILE530.XMI'
 DELETE 'CBT.V493.FILE531.XMI'
 DELETE 'CBT.V493.FILE532.XMI'
 DELETE 'CBT.V493.FILE533.XMI'
 DELETE 'CBT.V493.FILE534.XMI'
 DELETE 'CBT.V493.FILE535.XMI'
 DELETE 'CBT.V493.FILE536.XMI'
 DELETE 'CBT.V493.FILE537.XMI'
 DELETE 'CBT.V493.FILE538.XMI'
 DELETE 'CBT.V493.FILE539.XMI'
 DELETE 'CBT.V493.FILE540.XMI'
 DELETE 'CBT.V493.FILE541.XMI'
 DELETE 'CBT.V493.FILE542.XMI'
 DELETE 'CBT.V493.FILE543.XMI'
 DELETE 'CBT.V493.FILE544.XMI'
 DELETE 'CBT.V493.FILE545.XMI'
 DELETE 'CBT.V493.FILE546.XMI'
 DELETE 'CBT.V493.FILE547.XMI'
 DELETE 'CBT.V493.FILE548.XMI'
 DELETE 'CBT.V493.FILE549.XMI'
 DELETE 'CBT.V493.FILE550.XMI'
 DELETE 'CBT.V493.FILE551.XMI'
 DELETE 'CBT.V493.FILE552.XMI'
 DELETE 'CBT.V493.FILE553.XMI'
 DELETE 'CBT.V493.FILE554.XMI'
 DELETE 'CBT.V493.FILE555.XMI'
 DELETE 'CBT.V493.FILE556.XMI'
 DELETE 'CBT.V493.FILE557.XMI'
 DELETE 'CBT.V493.FILE558.XMI'
 DELETE 'CBT.V493.FILE559.XMI'
 DELETE 'CBT.V493.FILE560.XMI'
 DELETE 'CBT.V493.FILE561.XMI'
 DELETE 'CBT.V493.FILE562.XMI'
 DELETE 'CBT.V493.FILE563.XMI'
 DELETE 'CBT.V493.FILE564.XMI'
 DELETE 'CBT.V493.FILE565.XMI'
 DELETE 'CBT.V493.FILE566.XMI'
 DELETE 'CBT.V493.FILE567.XMI'
 DELETE 'CBT.V493.FILE568.XMI'
 DELETE 'CBT.V493.FILE569.XMI'
 DELETE 'CBT.V493.FILE570.XMI'
 DELETE 'CBT.V493.FILE571.XMI'
 DELETE 'CBT.V493.FILE572.XMI'
 DELETE 'CBT.V493.FILE573.XMI'
 DELETE 'CBT.V493.FILE574.XMI'
 DELETE 'CBT.V493.FILE575.XMI'
 DELETE 'CBT.V493.FILE576.XMI'
 DELETE 'CBT.V493.FILE577.XMI'
 DELETE 'CBT.V493.FILE578.XMI'
 DELETE 'CBT.V493.FILE579.XMI'
 DELETE 'CBT.V493.FILE580.XMI'
 DELETE 'CBT.V493.FILE581.XMI'
 DELETE 'CBT.V493.FILE582.XMI'
 DELETE 'CBT.V493.FILE583.XMI'
 DELETE 'CBT.V493.FILE584.XMI'
 DELETE 'CBT.V493.FILE585.XMI'
 DELETE 'CBT.V493.FILE586.XMI'
 DELETE 'CBT.V493.FILE587.XMI'
 DELETE 'CBT.V493.FILE588.XMI'
 DELETE 'CBT.V493.FILE589.XMI'
 DELETE 'CBT.V493.FILE590.XMI'
 DELETE 'CBT.V493.FILE591.XMI'
 DELETE 'CBT.V493.FILE592.XMI'
 DELETE 'CBT.V493.FILE593.XMI'
 DELETE 'CBT.V493.FILE594.XMI'
 DELETE 'CBT.V493.FILE595.XMI'
 DELETE 'CBT.V493.FILE596.XMI'
 DELETE 'CBT.V493.FILE597.XMI'
 DELETE 'CBT.V493.FILE598.XMI'
 DELETE 'CBT.V493.FILE599.XMI'
 DELETE 'CBT.V493.FILE600.XMI'
 DELETE 'CBT.V493.FILE601.XMI'
 DELETE 'CBT.V493.FILE602.XMI'
 DELETE 'CBT.V493.FILE603.XMI'
 DELETE 'CBT.V493.FILE604.XMI'
 DELETE 'CBT.V493.FILE605.XMI'
 DELETE 'CBT.V493.FILE606.XMI'
 DELETE 'CBT.V493.FILE607.XMI'
 DELETE 'CBT.V493.FILE608.XMI'
 DELETE 'CBT.V493.FILE609.XMI'
 DELETE 'CBT.V493.FILE610.XMI'
 DELETE 'CBT.V493.FILE611.XMI'
 DELETE 'CBT.V493.FILE612.XMI'
 DELETE 'CBT.V493.FILE613.XMI'
 DELETE 'CBT.V493.FILE614.XMI'
 DELETE 'CBT.V493.FILE615.XMI'
 DELETE 'CBT.V493.FILE616.XMI'
 DELETE 'CBT.V493.FILE617.XMI'
 DELETE 'CBT.V493.FILE618.XMI'
 DELETE 'CBT.V493.FILE619.XMI'
 DELETE 'CBT.V493.FILE620.XMI'
 DELETE 'CBT.V493.FILE621.XMI'
 DELETE 'CBT.V493.FILE622.XMI'
 DELETE 'CBT.V493.FILE623.XMI'
 DELETE 'CBT.V493.FILE624.XMI'
 DELETE 'CBT.V493.FILE625.XMI'
 DELETE 'CBT.V493.FILE626.XMI'
 DELETE 'CBT.V493.FILE627.XMI'
 DELETE 'CBT.V493.FILE628.XMI'
 DELETE 'CBT.V493.FILE629.XMI'
 DELETE 'CBT.V493.FILE630.XMI'
 DELETE 'CBT.V493.FILE631.XMI'
 DELETE 'CBT.V493.FILE632.XMI'
 DELETE 'CBT.V493.FILE633.XMI'
 DELETE 'CBT.V493.FILE634.XMI'
 DELETE 'CBT.V493.FILE635.XMI'
 DELETE 'CBT.V493.FILE636.XMI'
 DELETE 'CBT.V493.FILE637.XMI'
 DELETE 'CBT.V493.FILE638.XMI'
 DELETE 'CBT.V493.FILE639.XMI'
 DELETE 'CBT.V493.FILE640.XMI'
 DELETE 'CBT.V493.FILE641.XMI'
 DELETE 'CBT.V493.FILE642.XMI'
 DELETE 'CBT.V493.FILE643.XMI'
 DELETE 'CBT.V493.FILE644.XMI'
 DELETE 'CBT.V493.FILE645.XMI'
 DELETE 'CBT.V493.FILE646.XMI'
 DELETE 'CBT.V493.FILE647.XMI'
 DELETE 'CBT.V493.FILE648.XMI'
 DELETE 'CBT.V493.FILE649.XMI'
 DELETE 'CBT.V493.FILE650.XMI'
 DELETE 'CBT.V493.FILE651.XMI'
 DELETE 'CBT.V493.FILE652.XMI'
 DELETE 'CBT.V493.FILE653.XMI'
 DELETE 'CBT.V493.FILE654.XMI'
 DELETE 'CBT.V493.FILE655.XMI'
 DELETE 'CBT.V493.FILE656.XMI'
 DELETE 'CBT.V493.FILE657.XMI'
 DELETE 'CBT.V493.FILE658.XMI'
 DELETE 'CBT.V493.FILE659.XMI'
 DELETE 'CBT.V493.FILE660.XMI'
 DELETE 'CBT.V493.FILE661.XMI'
 DELETE 'CBT.V493.FILE662.XMI'
 DELETE 'CBT.V493.FILE663.XMI'
 DELETE 'CBT.V493.FILE664.XMI'
 DELETE 'CBT.V493.FILE665.XMI'
 DELETE 'CBT.V493.FILE666.XMI'
 DELETE 'CBT.V493.FILE667.XMI'
 DELETE 'CBT.V493.FILE668.XMI'
 DELETE 'CBT.V493.FILE669.XMI'
 DELETE 'CBT.V493.FILE670.XMI'
 DELETE 'CBT.V493.FILE671.XMI'
 DELETE 'CBT.V493.FILE672.XMI'
 DELETE 'CBT.V493.FILE673.XMI'
 DELETE 'CBT.V493.FILE674.XMI'
 DELETE 'CBT.V493.FILE675.XMI'
 DELETE 'CBT.V493.FILE676.XMI'
 DELETE 'CBT.V493.FILE677.XMI'
 DELETE 'CBT.V493.FILE678.XMI'
 DELETE 'CBT.V493.FILE679.XMI'
 DELETE 'CBT.V493.FILE680.XMI'
 DELETE 'CBT.V493.FILE681.XMI'
 DELETE 'CBT.V493.FILE682.XMI'
 DELETE 'CBT.V493.FILE683.XMI'
 DELETE 'CBT.V493.FILE684.XMI'
 DELETE 'CBT.V493.FILE685.XMI'
 DELETE 'CBT.V493.FILE686.XMI'
 DELETE 'CBT.V493.FILE687.XMI'
 DELETE 'CBT.V493.FILE688.XMI'
 DELETE 'CBT.V493.FILE689.XMI'
 DELETE 'CBT.V493.FILE690.XMI'
 DELETE 'CBT.V493.FILE691.XMI'
 DELETE 'CBT.V493.FILE692.XMI'
 DELETE 'CBT.V493.FILE693.XMI'
 DELETE 'CBT.V493.FILE694.XMI'
 DELETE 'CBT.V493.FILE695.XMI'
 DELETE 'CBT.V493.FILE696.XMI'
 DELETE 'CBT.V493.FILE697.XMI'
 DELETE 'CBT.V493.FILE698.XMI'
 DELETE 'CBT.V493.FILE699.XMI'
 DELETE 'CBT.V493.FILE700.XMI'
 DELETE 'CBT.V493.FILE701.XMI'
 DELETE 'CBT.V493.FILE702.XMI'
 DELETE 'CBT.V493.FILE703.XMI'
 DELETE 'CBT.V493.FILE704.XMI'
 DELETE 'CBT.V493.FILE705.XMI'
 DELETE 'CBT.V493.FILE706.XMI'
 DELETE 'CBT.V493.FILE707.XMI'
 DELETE 'CBT.V493.FILE708.XMI'
 DELETE 'CBT.V493.FILE709.XMI'
 DELETE 'CBT.V493.FILE710.XMI'
 DELETE 'CBT.V493.FILE711.XMI'
 DELETE 'CBT.V493.FILE712.XMI'
 DELETE 'CBT.V493.FILE713.XMI'
 DELETE 'CBT.V493.FILE714.XMI'
 DELETE 'CBT.V493.FILE715.XMI'
 DELETE 'CBT.V493.FILE716.XMI'
 DELETE 'CBT.V493.FILE717.XMI'
 DELETE 'CBT.V493.FILE718.XMI'
 DELETE 'CBT.V493.FILE719.XMI'
 DELETE 'CBT.V493.FILE720.XMI'
 DELETE 'CBT.V493.FILE721.XMI'
 DELETE 'CBT.V493.FILE722.XMI'
 DELETE 'CBT.V493.FILE723.XMI'
 DELETE 'CBT.V493.FILE724.XMI'
 DELETE 'CBT.V493.FILE725.XMI'
 DELETE 'CBT.V493.FILE726.XMI'
 DELETE 'CBT.V493.FILE727.XMI'
 DELETE 'CBT.V493.FILE728.XMI'
 DELETE 'CBT.V493.FILE729.XMI'
 DELETE 'CBT.V493.FILE730.XMI'
 DELETE 'CBT.V493.FILE731.XMI'
 DELETE 'CBT.V493.FILE732.XMI'
 DELETE 'CBT.V493.FILE733.XMI'
 DELETE 'CBT.V493.FILE734.XMI'
 DELETE 'CBT.V493.FILE735.XMI'
 DELETE 'CBT.V493.FILE736.XMI'
 DELETE 'CBT.V493.FILE737.XMI'
 DELETE 'CBT.V493.FILE738.XMI'
 DELETE 'CBT.V493.FILE739.XMI'
 DELETE 'CBT.V493.FILE740.XMI'
 DELETE 'CBT.V493.FILE741.XMI'
 DELETE 'CBT.V493.FILE742.XMI'
 DELETE 'CBT.V493.FILE743.XMI'
 DELETE 'CBT.V493.FILE744.XMI'
 DELETE 'CBT.V493.FILE745.XMI'
 DELETE 'CBT.V493.FILE746.XMI'
 DELETE 'CBT.V493.FILE747.XMI'
 DELETE 'CBT.V493.FILE748.XMI'
 DELETE 'CBT.V493.FILE749.XMI'
 DELETE 'CBT.V493.FILE750.XMI'
 DELETE 'CBT.V493.FILE751.XMI'
 DELETE 'CBT.V493.FILE752.XMI'
 DELETE 'CBT.V493.FILE753.XMI'
 DELETE 'CBT.V493.FILE754.XMI'
 DELETE 'CBT.V493.FILE755.XMI'
 DELETE 'CBT.V493.FILE756.XMI'
 DELETE 'CBT.V493.FILE757.XMI'
 DELETE 'CBT.V493.FILE758.XMI'
 DELETE 'CBT.V493.FILE759.XMI'
 DELETE 'CBT.V493.FILE760.XMI'
 DELETE 'CBT.V493.FILE761.XMI'
 DELETE 'CBT.V493.FILE762.XMI'
 DELETE 'CBT.V493.FILE763.XMI'
 DELETE 'CBT.V493.FILE764.XMI'
 DELETE 'CBT.V493.FILE765.XMI'
 DELETE 'CBT.V493.FILE766.XMI'
 DELETE 'CBT.V493.FILE767.XMI'
 DELETE 'CBT.V493.FILE768.XMI'
 DELETE 'CBT.V493.FILE769.XMI'
 DELETE 'CBT.V493.FILE770.XMI'
 DELETE 'CBT.V493.FILE771.XMI'
 DELETE 'CBT.V493.FILE772.XMI'
 DELETE 'CBT.V493.FILE773.XMI'
 DELETE 'CBT.V493.FILE774.XMI'
 DELETE 'CBT.V493.FILE775.XMI'
 DELETE 'CBT.V493.FILE776.XMI'
 DELETE 'CBT.V493.FILE777.XMI'
 DELETE 'CBT.V493.FILE778.XMI'
 DELETE 'CBT.V493.FILE779.XMI'
 DELETE 'CBT.V493.FILE780.XMI'
 DELETE 'CBT.V493.FILE781.XMI'
 DELETE 'CBT.V493.FILE782.XMI'
 DELETE 'CBT.V493.FILE783.XMI'
 DELETE 'CBT.V493.FILE784.XMI'
 DELETE 'CBT.V493.FILE785.XMI'
 DELETE 'CBT.V493.FILE786.XMI'
 DELETE 'CBT.V493.FILE787.XMI'
 DELETE 'CBT.V493.FILE788.XMI'
 DELETE 'CBT.V493.FILE789.XMI'
 DELETE 'CBT.V493.FILE790.XMI'
 DELETE 'CBT.V493.FILE791.XMI'
 DELETE 'CBT.V493.FILE792.XMI'
 DELETE 'CBT.V493.FILE793.XMI'
 DELETE 'CBT.V493.FILE794.XMI'
 DELETE 'CBT.V493.FILE795.XMI'
 DELETE 'CBT.V493.FILE796.XMI'
 DELETE 'CBT.V493.FILE797.XMI'
 DELETE 'CBT.V493.FILE798.XMI'
 DELETE 'CBT.V493.FILE799.XMI'
 DELETE 'CBT.V493.FILE800.XMI'
 DELETE 'CBT.V493.FILE801.XMI'
 DELETE 'CBT.V493.FILE802.XMI'
 DELETE 'CBT.V493.FILE803.XMI'
 DELETE 'CBT.V493.FILE804.XMI'
 DELETE 'CBT.V493.FILE805.XMI'
 DELETE 'CBT.V493.FILE806.XMI'
 DELETE 'CBT.V493.FILE807.XMI'
 DELETE 'CBT.V493.FILE809.XMI'
 DELETE 'CBT.V493.FILE810.XMI'
 DELETE 'CBT.V493.FILE811.XMI'
 DELETE 'CBT.V493.FILE812.XMI'
 DELETE 'CBT.V493.FILE813.XMI'
 DELETE 'CBT.V493.FILE814.XMI'
 DELETE 'CBT.V493.FILE815.XMI'
 DELETE 'CBT.V493.FILE816.XMI'
 DELETE 'CBT.V493.FILE817.XMI'
 DELETE 'CBT.V493.FILE818.XMI'
 DELETE 'CBT.V493.FILE819.XMI'
 DELETE 'CBT.V493.FILE820.XMI'
 DELETE 'CBT.V493.FILE821.XMI'
 DELETE 'CBT.V493.FILE822.XMI'
 DELETE 'CBT.V493.FILE823.XMI'
 DELETE 'CBT.V493.FILE824.XMI'
 DELETE 'CBT.V493.FILE825.XMI'
 DELETE 'CBT.V493.FILE826.XMI'
 DELETE 'CBT.V493.FILE827.XMI'
 DELETE 'CBT.V493.FILE828.XMI'
 DELETE 'CBT.V493.FILE829.XMI'
 DELETE 'CBT.V493.FILE830.XMI'
 DELETE 'CBT.V493.FILE831.XMI'
 DELETE 'CBT.V493.FILE832.XMI'
 DELETE 'CBT.V493.FILE833.XMI'
 DELETE 'CBT.V493.FILE834.XMI'
 DELETE 'CBT.V493.FILE835.XMI'
 DELETE 'CBT.V493.FILE836.XMI'
 DELETE 'CBT.V493.FILE837.XMI'
 DELETE 'CBT.V493.FILE838.XMI'
 DELETE 'CBT.V493.FILE839.XMI'
 DELETE 'CBT.V493.FILE840.XMI'
 DELETE 'CBT.V493.FILE841.XMI'
 DELETE 'CBT.V493.FILE842.XMI'
 DELETE 'CBT.V493.FILE843.XMI'
 DELETE 'CBT.V493.FILE844.XMI'
 DELETE 'CBT.V493.FILE845.XMI'
 DELETE 'CBT.V493.FILE846.XMI'
 DELETE 'CBT.V493.FILE847.XMI'
 DELETE 'CBT.V493.FILE848.XMI'
 DELETE 'CBT.V493.FILE849.XMI'
 DELETE 'CBT.V493.FILE850.XMI'
 DELETE 'CBT.V493.FILE851.XMI'
 DELETE 'CBT.V493.FILE852.XMI'
 DELETE 'CBT.V493.FILE853.XMI'
 DELETE 'CBT.V493.FILE854.XMI'
 DELETE 'CBT.V493.FILE855.XMI'
 DELETE 'CBT.V493.FILE856.XMI'
 DELETE 'CBT.V493.FILE857.XMI'
 DELETE 'CBT.V493.FILE858.XMI'
 DELETE 'CBT.V493.FILE859.XMI'
 DELETE 'CBT.V493.FILE860.XMI'
 DELETE 'CBT.V493.FILE861.XMI'
 DELETE 'CBT.V493.FILE862.XMI'
 DELETE 'CBT.V493.FILE863.XMI'
 DELETE 'CBT.V493.FILE864.XMI'
 DELETE 'CBT.V493.FILE865.XMI'
 DELETE 'CBT.V493.FILE866.XMI'
 DELETE 'CBT.V493.FILE867.XMI'
 DELETE 'CBT.V493.FILE868.XMI'
 DELETE 'CBT.V493.FILE869.XMI'
 DELETE 'CBT.V493.FILE870.XMI'
 DELETE 'CBT.V493.FILE871.XMI'
 DELETE 'CBT.V493.FILE872.XMI'
 DELETE 'CBT.V493.FILE873.XMI'
 DELETE 'CBT.V493.FILE874.XMI'
 DELETE 'CBT.V493.FILE875.XMI'
 DELETE 'CBT.V493.FILE876.XMI'
 DELETE 'CBT.V493.FILE877.XMI'
 DELETE 'CBT.V493.FILE878.XMI'
 DELETE 'CBT.V493.FILE879.XMI'
 DELETE 'CBT.V493.FILE880.XMI'
 DELETE 'CBT.V493.FILE881.XMI'
 DELETE 'CBT.V493.FILE882.XMI'
 DELETE 'CBT.V493.FILE883.XMI'
 DELETE 'CBT.V493.FILE884.XMI'
 DELETE 'CBT.V493.FILE885.XMI'
 DELETE 'CBT.V493.FILE886.XMI'
 DELETE 'CBT.V493.FILE887.XMI'
 DELETE 'CBT.V493.FILE888.XMI'
 DELETE 'CBT.V493.FILE889.XMI'
 DELETE 'CBT.V493.FILE890.XMI'
 DELETE 'CBT.V493.FILE891.XMI'
 DELETE 'CBT.V493.FILE892.XMI'
 DELETE 'CBT.V493.FILE893.XMI'
 DELETE 'CBT.V493.FILE894.XMI'
 DELETE 'CBT.V493.FILE895.XMI'
 DELETE 'CBT.V493.FILE896.XMI'
 DELETE 'CBT.V493.FILE897.XMI'
 DELETE 'CBT.V493.FILE898.XMI'
 DELETE 'CBT.V493.FILE899.XMI'
 DELETE 'CBT.V493.FILE900.XMI'
 DELETE 'CBT.V493.FILE901.XMI'
 DELETE 'CBT.V493.FILE902.XMI'
 DELETE 'CBT.V493.FILE903.XMI'
 DELETE 'CBT.V493.FILE904.XMI'
 DELETE 'CBT.V493.FILE905.XMI'
 DELETE 'CBT.V493.FILE906.XMI'
 DELETE 'CBT.V493.FILE907.XMI'
 DELETE 'CBT.V493.FILE908.XMI'
 DELETE 'CBT.V493.FILE909.XMI'
 DELETE 'CBT.V493.FILE910.XMI'
 DELETE 'CBT.V493.FILE911.XMI'
 DELETE 'CBT.V493.FILE912.XMI'
 DELETE 'CBT.V493.FILE913.XMI'
 DELETE 'CBT.V493.FILE914.XMI'
 DELETE 'CBT.V493.FILE915.XMI'
 DELETE 'CBT.V493.FILE916.XMI'
 DELETE 'CBT.V493.FILE917.XMI'
 DELETE 'CBT.V493.FILE918.XMI'
 DELETE 'CBT.V493.FILE919.XMI'
 DELETE 'CBT.V493.FILE920.XMI'
 DELETE 'CBT.V493.FILE921.XMI'
 DELETE 'CBT.V493.FILE922.XMI'
 DELETE 'CBT.V493.FILE923.XMI'
 DELETE 'CBT.V493.FILE001.DATA''
 DELETE 'CBT.V493.FILE002.DATA'
 DELETE 'CBT.V493.FILE003.DATA'
 DELETE 'CBT.V493.FILE004.DATA'
 DELETE 'CBT.V493.FILE005.DATA'
 DELETE 'CBT.V493.FILE018.DATA'
 DELETE 'CBT.V493.FILE043.DATA'
 DELETE 'CBT.V493.FILE062.DATA'
 DELETE 'CBT.V493.FILE063.DATA'
 DELETE 'CBT.V493.FILE064.DATA'
 DELETE 'CBT.V493.FILE099.DATA'
 DELETE 'CBT.V493.FILE110.DATA'
 DELETE 'CBT.V493.FILE157.DATA'
 DELETE 'CBT.V493.FILE230.DATA'
 DELETE 'CBT.V493.FILE808.DATA'
 DELETE 'CBT.V493.FILE924.XMI'
 DELETE 'CBT.V493.FILE925.XMI'
 DELETE 'CBT.V493.FILE926.XMI'
 DELETE 'CBT.V493.FILE927.XMI'
 DELETE 'CBT.V493.FILE928.XMI'
 DELETE 'CBT.V493.FILE929.XMI'
 DELETE 'CBT.V493.FILE930.XMI'
 DELETE 'CBT.V493.FILE931.XMI'
 DELETE 'CBT.V493.FILE932.DATA'
 DELETE 'CBT.V493.FILE933.DATA'
 DELETE 'CBT.V493.FILE934.XMI'
 DELETE 'CBT.V493.FILE935.XMI'
 DELETE 'CBT.V493.FILE936.XMI'
 DELETE 'CBT.V493.FILE937.XMI'
 DELETE 'CBT.V493.FILE938.XMI'
 DELETE 'CBT.V493.FILE939.XMI'
 DELETE 'CBT.V493.FILE940.XMI'
 DELETE 'CBT.V493.FILE941.XMI'
 DELETE 'CBT.V493.FILE942.XMI'
 DELETE 'CBT.V493.FILE943.XMI'
 DELETE 'CBT.V493.FILE944.XMI'
 DELETE 'CBT.V493.FILE945.XMI'
 DELETE 'CBT.V493.FILE946.XMI'
 DELETE 'CBT.V493.FILE947.XMI'
 DELETE 'CBT.V493.FILE948.XMI'
 DELETE 'CBT.V493.FILE949.XMI'
 DELETE 'CBT.V493.FILE950.XMI'
 DELETE 'CBT.V493.FILE951.XMI'
 DELETE 'CBT.V493.FILE952.XMI'
 DELETE 'CBT.V493.FILE953.XMI'
