//SBGOLOBM JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//*********************************************************************
//*
//*   Back up pack CBTA01 using DFDSS, prior to TERSing.
//*
//*********************************************************************
//DUMPDASD EXEC PGM=ADRDSSU,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=SYS1.LINKLIB,UNIT=3390,VOL=SER=Z25RES
//SYSPRINT DD SYSOUT=*
//DISK1    DD UNIT=3390,VOL=SER=CBTA01,DISP=SHR
//TAPE1    DD DSN=CBT.DFDSS.CBT500.BACKUP,
//            DISP=(,CATLG,DELETE),
//            VOL=SER=(WORK93),
//            UNIT=3390,SPACE=(CYL,(600,600),RLSE)
//SYSIN    DD *
 DUMP FULL INDDNAME(DISK1) OUTDDNAME(TAPE1) CANCELERROR -
   COMPRESS OPT(4) ADMINISTRATOR
//*
