//SBGOLOB1 JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*******************************************************************//
//***  SBGOLOB.T500     :    VOL=SER=V500MT                       ***//
//*******************************************************************//
//*  THIS JOB TAKES A DISK MEMBERS OF A PDS AND OFFLOADS THEM TO    *//
//*  A SEQUENTIAL TEMPORARY DATASET.  THE CBT973 PROGRAM COMPRESSES *//
//*  THAT DATA AND THEN WRITES IT TO THE TRANS TAPE FILE.           *//
//*******************************************************************//
//GENR PROC N=001,VL=V500MT,DPFX='CBT.CBT499.',FRX='XXXXXXX',
//      TO='FILE0WWW',LR=80,BL=5600,RF=FB
//GENERIT  EXEC PGM=CKIEBGEN,REGION=3200K         <=== STEP NUMB
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.CBTCREAT.LOAD
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DSN=&DPFX&FRX,
//             DISP=SHR,
//             DCB=(DSORG=PS,LRECL=&LR,BLKSIZE=&BL,RECFM=&RF)
//SYSUT2   DD  DSN=&TO,
//             DISP=(NEW,KEEP),
//             UNIT=568,
//  DCB=(DSORG=PS,RECFM=&RF,LRECL=&LR,BLKSIZE=&BL,TRTCH=NOCOMP),
//             LABEL=(&N,SL,EXPDT=98000), <=== CHANGE FILE NUMBER
//             VOL=(,RETAIN,SER=&VL)
//SYSIN    DD  DUMMY
//GENR     PEND
//NULL PROC N=001,VL=V500MT,TO='FILE0ZZZ'
//NULFILE   EXEC  PGM=CBT973,PARM=COMPRESS,REGION=1024K  <=== STEP NUMB
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.CBTCREAT.LOAD
//INPUT    DD  DISP=SHR,DSN=SBGOLOB.CBT.EDIT(CBTNULL)
//OUTPUT   DD  DSN=&TO,
//             DISP=(NEW,KEEP),
//             UNIT=568,
//             LABEL=(&N,SL,EXPDT=98000), <=== CHANGE FILE NUMBER
//             VOL=(,RETAIN,SER=&VL),
//             DCB=(RECFM=VB,LRECL=94,BLKSIZE=32716,TRTCH=NOCOMP)
//NULL     PEND
//*
//COP1 PROC N=001,VL=V500MT,DPFX='CBT.CBT499.',FRX='XXXXXXX',
//      TO='FILE0YYY'
//COPYXXXA  EXEC  PGM=IEBCOPY,REGION=3200K         <=== STEP NUMB
//SYSPRINT DD  SYSOUT=*
//SYSUT3   DD  UNIT=SYSALLDA,
//             SPACE=(CYL,(5,5))
//SYSUT4   DD  UNIT=SYSALLDA,
//             SPACE=(CYL,(5,5))
//I        DD  DSN=&DPFX&FRX,
//             DISP=SHR
//J        DD  DSN=&TO,
//             DISP=(NEW,KEEP),
//             UNIT=568,
//             DCB=TRTCH=NOCOMP,
//             LABEL=(&N,SL,EXPDT=98000), <=== CHANGE FILE NUMBER
//             VOL=(,RETAIN,SER=&VL)
//SYSIN    DD   DISP=SHR,DSN=SBGOLOB.CBT.EDIT(XIJ)
//COP1  PEND
//*
//OFFL PROC N=001,VL=V500MT,DPFX='CBT.CBT499.',FRX='XXXXXXX',
//        TO='FILE0XXX'
//STEPXXX  EXEC PGM=LISTPDS,REGION=5000K,
//    PARM='UPDTE(><),SPF,ALIAS,NOLIST,DECK,NOSEL'
//STEPLIB  DD DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSPRINT DD SYSOUT=*
//SYSUPLOG DD DISP=SHR,DSN=CBT.V500.SYSUPLOG(FILE&N)
//SYSLIB DD  DISP=SHR,DSN=&DPFX&FRX
//SYSPUNCH DD  DSN=&&S23,
//             DISP=(NEW,PASS),
//             UNIT=SYSALLDA,
//             SPACE=(CYL,(40,40),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=23440)
//SYSIN  DD DUMMY
//SYSABEND DD SYSOUT=*
//SYSLIST  DD SYSOUT=*
//*
//STEPYYY EXEC  PGM=CBT973,PARM=COMPRESS,REGION=1024K  <= STEP NUMB
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.CBTCREAT.LOAD
//INPUT    DD  DSN=&&S23,
//             DISP=(OLD,DELETE)
//OUTPUT   DD  DSN=&TO,
//             DISP=(NEW,KEEP),
//             UNIT=568,
//             LABEL=(&N,SL,EXPDT=98000), <=== CHANGE FILE NUMBER
//             VOL=(,RETAIN,SER=&VL),
//             DCB=(RECFM=VB,LRECL=94,BLKSIZE=32716,TRTCH=NOCOMP)
//OFFL  PEND
//*
//OFFG PROC N=001,VL=V500MT,DPFX='CBT.CBT499.',FRX='XXXXXXX',
//        TO='FILE0XXX'
//*
//STEPYYY EXEC  PGM=CBT973,PARM=COMPRESS,REGION=1024K  <= STEP NUMB
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.CBTCREAT.LOAD
//INPUT    DD  DSN=&DPFX.&FRX,
//             DISP=SHR
//OUTPUT   DD  DSN=&TO,
//             DISP=(NEW,KEEP),
//             UNIT=568,
//             LABEL=(&N,SL,EXPDT=98000), <=== CHANGE FILE NUMBER
//             VOL=(,RETAIN,SER=&VL),
//             DCB=(RECFM=VB,LRECL=94,BLKSIZE=32716,TRTCH=NOCOMP)
//OFFG  PEND
//NEWJCL  PROC
//COPY1   EXEC PGM=IEBGEOLD
//SYSPRINT DD  SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=SBGOLOB.CBT.EDIT(FILE001)
//SYSUT2 DD DSN=FILE0001,
//         DISP=(NEW,KEEP),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720,TRTCH=NOCOMP),
//         UNIT=568,
//         LABEL=(1,SL,EXPDT=98000),
//         VOL=(,RETAIN,SER=V500MT)
//SYSIN  DD DUMMY
//COPY2   EXEC PGM=IEBGEOLD
//SYSPRINT DD  SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=SBGOLOB.CBT.EDIT(##CBT973)
//SYSUT2 DD DSN=FILE0002,
//         DISP=(NEW,KEEP),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720,TRTCH=NOCOMP),
//         UNIT=568,
//         LABEL=(2,SL,EXPDT=98000),
//         VOL=(,RETAIN,SER=V500MT)
//SYSIN  DD DUMMY
//COPY3   EXEC PGM=IEBGEOLD
//SYSPRINT DD  SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=SBGOLOB.CBT.EDIT($$JCL003)
//SYSUT2 DD DSN=FILE0003,
//         DISP=(NEW,KEEP),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720,TRTCH=NOCOMP),
//         UNIT=568,
//         LABEL=(3,SL,EXPDT=98000),
//         VOL=(,RETAIN,SER=V500MT)
//SYSIN  DD DUMMY
//COPY4   EXEC PGM=IEBGEOLD
//SYSPRINT DD  SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=SBGOLOB.CBT.EDIT(CBTUPD)
//SYSUT2 DD DSN=FILE0004,
//         DISP=(NEW,KEEP),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720,TRTCH=NOCOMP),
//         UNIT=568,
//         LABEL=(4,SL,EXPDT=98000),
//         VOL=(,RETAIN,SER=V500MT)
//SYSIN  DD DUMMY
//COPY5   EXEC PGM=IEBGEOLD
//SYSPRINT DD  SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=SBGOLOB.CBT.EDIT(FILE005)
//SYSUT2 DD DSN=FILE0005,
//         DISP=(NEW,KEEP),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720,TRTCH=NOCOMP),
//         UNIT=568,
//         LABEL=(5,SL,EXPDT=98000),
//         VOL=(,RETAIN,SER=V500MT)
//SYSIN  DD DUMMY
//         PEND
//S901 EXEC OFFL,N=901,TO='FILE0901',FRX='FILE901.PDS'
//S902 EXEC OFFL,N=902,TO='FILE0902',FRX='FILE902.PDS'
//S903 EXEC OFFL,N=903,TO='FILE0903',FRX='FILE903.PDS'
//S904 EXEC OFFL,N=904,TO='FILE0904',FRX='FILE904.PDS'
//S905 EXEC OFFL,N=905,TO='FILE0905',FRX='FILE905.PDS'
//S906 EXEC OFFL,N=906,TO='FILE0906',FRX='FILE906.PDS'
//S907 EXEC OFFL,N=907,TO='FILE0907',FRX='FILE907.PDS'
//S908 EXEC OFFL,N=908,TO='FILE0908',FRX='FILE908.PDS'
//S909 EXEC OFFL,N=909,TO='FILE0909',FRX='FILE909.PDS'
//S910 EXEC OFFL,N=910,TO='FILE0910',FRX='FILE910.PDS'
//S911 EXEC OFFL,N=911,TO='FILE0911',FRX='FILE911.PDS'
//S912 EXEC OFFL,N=912,TO='FILE0912',FRX='FILE912.PDS'
//S913 EXEC OFFL,N=913,TO='FILE0913',FRX='FILE913.PDS'
//S914 EXEC OFFL,N=914,TO='FILE0914',FRX='FILE914.PDS'
//S915 EXEC OFFL,N=915,TO='FILE0915',FRX='FILE915.PDS'
//S916 EXEC OFFL,N=916,TO='FILE0916',FRX='FILE916.PDS'
//S917 EXEC OFFL,N=917,TO='FILE0917',FRX='FILE917.PDS'
//S918 EXEC COP1,N=918,TO='FILE0918',FRX='FILE918.PDS'
//S919 EXEC COP1,N=919,TO='FILE0919',FRX='FILE919.PDS'
//S920 EXEC OFFL,N=920,TO='FILE0920',FRX='FILE920.PDS'
//S921 EXEC OFFL,N=921,TO='FILE0921',FRX='FILE921.PDS'
//S922 EXEC OFFL,N=922,TO='FILE0922',FRX='FILE922.PDS'
//S923 EXEC OFFL,N=923,TO='FILE0923',FRX='FILE923.PDS'
//S924 EXEC OFFL,N=924,TO='FILE0924',FRX='FILE924.PDS'
//S925 EXEC OFFL,N=925,TO='FILE0925',FRX='FILE925.PDS'
//S926 EXEC OFFL,N=926,TO='FILE0926',FRX='FILE926.PDS'
//S927 EXEC OFFL,N=927,TO='FILE0927',FRX='FILE927.PDS'
//S928 EXEC OFFL,N=928,TO='FILE0928',FRX='FILE928.PDS'
//S929 EXEC OFFL,N=929,TO='FILE0929',FRX='FILE929.PDS'
//S930 EXEC OFFL,N=930,TO='FILE0930',FRX='FILE930.PDS'
//S931 EXEC OFFL,N=931,TO='FILE0931',FRX='FILE931.PDS'
//S932 EXEC GENR,N=932,TO='FILE0932',FRX='FILE932.DATA',
//             LR=35,BL=27965,RF=FB
//S933 EXEC GENR,N=933,TO='FILE0933',FRX='FILE933.DATA',
//             LR=80,BL=5600,RF=FB
//S934 EXEC OFFL,N=934,TO='FILE0934',FRX='FILE934.PDS'
//S935 EXEC OFFL,N=935,TO='FILE0935',FRX='FILE935.PDS'
//S936 EXEC OFFL,N=936,TO='FILE0936',FRX='FILE936.PDS'
//S937 EXEC OFFL,N=937,TO='FILE0937',FRX='FILE937.PDS'
//S938 EXEC OFFL,N=938,TO='FILE0938',FRX='FILE938.PDS'
//S939 EXEC OFFL,N=939,TO='FILE0939',FRX='CBT500.FILE939',
//     DPFX='SBGOLOB.'
//S940 EXEC OFFL,N=940,TO='FILE0940',FRX='FILE940.PDS'
//S941 EXEC OFFL,N=941,TO='FILE0941',FRX='FILE941.PDS'
//S942 EXEC OFFL,N=942,TO='FILE0942',FRX='FILE942.PDS'
//S943 EXEC OFFL,N=943,TO='FILE0943',FRX='FILE943.PDS'
//S944 EXEC OFFL,N=944,TO='FILE0944',FRX='FILE944.PDS'
//S945 EXEC OFFL,N=945,TO='FILE0945',FRX='FILE945.PDS'
//S946 EXEC OFFL,N=946,TO='FILE0946',FRX='FILE946.PDS'
//S947 EXEC OFFL,N=947,TO='FILE0947',FRX='FILE947.PDS'
//S948 EXEC OFFL,N=948,TO='FILE0948',FRX='FILE948.PDS'
//S949 EXEC OFFL,N=949,TO='FILE0949',FRX='CBT500.FILE949',
//     DPFX='SBGOLOB.'
//S950 EXEC OFFL,N=950,TO='FILE0950',FRX='FILE950.PDS'
//S951 EXEC OFFL,N=951,TO='FILE0951',FRX='FILE951.PDS'
//S952 EXEC OFFL,N=952,TO='FILE0952',FRX='FILE952.PDS'
//S953 EXEC OFFL,N=953,TO='FILE0953',FRX='CBT500.FILE953',
//     DPFX='SBGOLOB.'
//S954 EXEC OFFL,N=954,TO='FILE0954',FRX='FILE954.PDS'
//S955 EXEC OFFL,N=955,TO='FILE0955',FRX='FILE955.PDS'
//S956 EXEC OFFL,N=956,TO='FILE0956',FRX='FILE956.PDS'
//S957 EXEC OFFL,N=957,TO='FILE0957',FRX='FILE957.PDS'
//S958 EXEC OFFL,N=958,TO='FILE0958',FRX='FILE958.PDS'
//S959 EXEC OFFL,N=959,TO='FILE0959',FRX='FILE959.PDS'
//S960 EXEC OFFL,N=960,TO='FILE0960',FRX='FILE960.PDS'
//S961 EXEC OFFL,N=961,TO='FILE0961',FRX='FILE961.PDS'
//S962 EXEC OFFL,N=962,TO='FILE0962',FRX='FILE962.PDS'
//S963 EXEC OFFL,N=963,TO='FILE0963',FRX='FILE963.PDS'
//S964 EXEC OFFL,N=964,TO='FILE0964',FRX='FILE964.PDS'
//S965 EXEC OFFL,N=965,TO='FILE0965',FRX='FILE965.PDS'
//S966 EXEC OFFL,N=966,TO='FILE0966',FRX='FILE966.PDS'
//S967 EXEC OFFL,N=967,TO='FILE0967',FRX='CBT500.FILE967',
//     DPFX='SBGOLOB.'
//S968 EXEC OFFL,N=968,TO='FILE0968',FRX='FILE968.PDS'
//S969 EXEC OFFL,N=969,TO='FILE0969',FRX='CBT500.FILE969',
//     DPFX='SBGOLOB.'
//S970 EXEC OFFL,N=970,TO='FILE0970',FRX='FILE970.PDS'
//S971 EXEC OFFL,N=971,TO='FILE0971',FRX='FILE971.PDS'
//S972 EXEC OFFL,N=972,TO='FILE0972',FRX='FILE972.PDS'
//S973 EXEC OFFL,N=973,TO='FILE0973',FRX='FILE973.PDS'
//S974 EXEC OFFL,N=974,TO='FILE0974',FRX='FILE974.PDS'
//S975 EXEC OFFL,N=975,TO='FILE0975',FRX='FILE975.PDS'
//S976 EXEC OFFL,N=976,TO='FILE0976',FRX='FILE976.PDS'
//S977 EXEC OFFL,N=977,TO='FILE0977',FRX='CBT500.FILE977',
//     DPFX='SBGOLOB.'
//S978 EXEC OFFL,N=978,TO='FILE0978',FRX='FILE978.PDS'
//S979 EXEC OFFL,N=979,TO='FILE0979',FRX='FILE979.PDS'
//S980 EXEC OFFL,N=980,TO='FILE0980',FRX='CBT500.FILE980',
//     DPFX='SBGOLOB.'
//S981 EXEC OFFL,N=981,TO='FILE0981',FRX='FILE981.PDS'
//S982 EXEC OFFL,N=982,TO='FILE0982',FRX='FILE982.PDS'
//S983 EXEC OFFL,N=983,TO='FILE0983',FRX='FILE983.PDS'
//S984 EXEC OFFL,N=984,TO='FILE0984',FRX='FILE984.PDS'
//S985 EXEC OFFL,N=985,TO='FILE0985',FRX='CBT500.FILE985',
//     DPFX='SBGOLOB.'
//S986 EXEC OFFL,N=986,TO='FILE0986',FRX='FILE986.PDS'
//S987 EXEC OFFL,N=987,TO='FILE0987',FRX='FILE987.PDS'
//S988 EXEC OFFL,N=988,TO='FILE0988',FRX='FILE988.PDS'
//S989 EXEC OFFL,N=989,TO='FILE0989',FRX='FILE989.PDS'
//S990 EXEC OFFL,N=990,TO='FILE0990',FRX='FILE990.PDS'
//S991 EXEC OFFL,N=991,TO='FILE0991',FRX='FILE991.PDS'
//S992 EXEC OFFL,N=992,TO='FILE0992',FRX='FILE992.PDS'
//S993 EXEC OFFL,N=993,TO='FILE0993',FRX='FILE993.PDS'
//S994 EXEC OFFL,N=994,TO='FILE0994',FRX='FILE994.PDS'
//S995 EXEC OFFL,N=995,TO='FILE0995',FRX='FILE995.PDS'
//S996 EXEC OFFL,N=996,TO='FILE0996',FRX='FILE996.PDS'
//S997 EXEC OFFL,N=997,TO='FILE0997',FRX='CBT500.FILE997',
//     DPFX='SBGOLOB.'
//S998 EXEC OFFL,N=998,TO='FILE0998',FRX='FILE998.PDS'
//S999 EXEC OFFL,N=999,TO='FILE0999',FRX='CBT500.FILE999',
//     DPFX='SBGOLOB.'
//S1000 EXEC NULL,N=1000,TO='FILE1000'
