//SBGOLOB1 JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*******************************************************************//
//***  SBGOLOB.T500     :    VOL=SER=V500MT                       ***//
//*******************************************************************//
//*  THIS JOB TAKES A DISK MEMBERS OF A PDS AND OFFLOADS THEM TO    *//
//*  A SEQUENTIAL TEMPORARY DATASET.  THE CBT973 PROGRAM COMPRESSES *//
//*  THAT DATA AND THEN WRITES IT TO THE TRANS TAPE FILE.           *//
//*******************************************************************//
//GENR PROC N=001,VL=V500MT,DPFX='CBT.CBT499.',FRX='XXXXXXX',
//      TO='FILE0WWW',LR=80,BL=5600,RF=FB
//GENERIT  EXEC PGM=CKIEBGEN,REGION=3200K         <=== STEP NUMB
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.CBTCREAT.LOAD
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DSN=&DPFX&FRX,
//             DISP=SHR,
//             DCB=(DSORG=PS,LRECL=&LR,BLKSIZE=&BL,RECFM=&RF)
//SYSUT2   DD  DSN=&TO,
//             DISP=(NEW,KEEP),
//             UNIT=568,
//  DCB=(DSORG=PS,RECFM=&RF,LRECL=&LR,BLKSIZE=&BL,TRTCH=NOCOMP),
//             LABEL=(&N,SL,EXPDT=98000), <=== CHANGE FILE NUMBER
//             VOL=(,RETAIN,SER=&VL)
//SYSIN    DD  DUMMY
//GENR     PEND
//NULL PROC N=001,VL=V500MT,TO='FILE0ZZZ'
//NULFILE   EXEC  PGM=CBT973,PARM=COMPRESS,REGION=1024K  <=== STEP NUMB
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.CBTCREAT.LOAD
//INPUT    DD  DISP=SHR,DSN=SBGOLOB.CBT.EDIT(CBTNULL)
//OUTPUT   DD  DSN=&TO,
//             DISP=(NEW,KEEP),
//             UNIT=568,
//             LABEL=(&N,SL,EXPDT=98000), <=== CHANGE FILE NUMBER
//             VOL=(,RETAIN,SER=&VL),
//             DCB=(RECFM=VB,LRECL=94,BLKSIZE=32716,TRTCH=NOCOMP)
//NULL     PEND
//*
//COP1 PROC N=001,VL=V500MT,DPFX='CBT.CBT499.',FRX='XXXXXXX',
//      TO='FILE0YYY'
//COPYXXXA  EXEC  PGM=IEBCOPY,REGION=3200K         <=== STEP NUMB
//SYSPRINT DD  SYSOUT=*
//SYSUT3   DD  UNIT=SYSALLDA,
//             SPACE=(CYL,(5,5))
//SYSUT4   DD  UNIT=SYSALLDA,
//             SPACE=(CYL,(5,5))
//I        DD  DSN=&DPFX&FRX,
//             DISP=SHR
//J        DD  DSN=&TO,
//             DISP=(NEW,KEEP),
//             UNIT=568,
//             DCB=TRTCH=NOCOMP,
//             LABEL=(&N,SL,EXPDT=98000), <=== CHANGE FILE NUMBER
//             VOL=(,RETAIN,SER=&VL)
//SYSIN    DD   DISP=SHR,DSN=SBGOLOB.CBT.EDIT(XIJ)
//COP1  PEND
//*
//OFFL PROC N=001,VL=V500MT,DPFX='CBT.CBT499.',FRX='XXXXXXX',
//        TO='FILE0XXX'
//STEPXXX  EXEC PGM=LISTPDS,REGION=5000K,
//    PARM='UPDTE(><),SPF,ALIAS,NOLIST,DECK,NOSEL'
//STEPLIB  DD DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSPRINT DD SYSOUT=*
//SYSUPLOG DD DISP=SHR,DSN=CBT.V500.SYSUPLOG(FILE&N)
//SYSLIB DD  DISP=SHR,DSN=&DPFX&FRX
//SYSPUNCH DD  DSN=&&S23,
//             DISP=(NEW,PASS),
//             UNIT=SYSALLDA,
//             SPACE=(CYL,(40,17),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=23440)
//SYSIN  DD DUMMY
//SYSABEND DD SYSOUT=*
//SYSLIST  DD SYSOUT=*
//*
//STEPYYY EXEC  PGM=CBT973,PARM=COMPRESS,REGION=1024K  <= STEP NUMB
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.CBTCREAT.LOAD
//INPUT    DD  DSN=&&S23,
//             DISP=(OLD,DELETE)
//OUTPUT   DD  DSN=&TO,
//             DISP=(NEW,KEEP),
//             UNIT=568,
//             LABEL=(&N,SL,EXPDT=98000), <=== CHANGE FILE NUMBER
//             VOL=(,RETAIN,SER=&VL),
//             DCB=(RECFM=VB,LRECL=94,BLKSIZE=32716,TRTCH=NOCOMP)
//OFFL  PEND
//*
//OFFG PROC N=001,VL=V500MT,DPFX='CBT.CBT499.',FRX='XXXXXXX',
//        TO='FILE0XXX'
//*
//STEPYYY EXEC  PGM=CBT973,PARM=COMPRESS,REGION=1024K  <= STEP NUMB
//STEPLIB  DD  DISP=SHR,DSN=SBGOLOB.CBTCREAT.LOAD
//INPUT    DD  DSN=&DPFX.&FRX,
//             DISP=SHR
//OUTPUT   DD  DSN=&TO,
//             DISP=(NEW,KEEP),
//             UNIT=568,
//             LABEL=(&N,SL,EXPDT=98000), <=== CHANGE FILE NUMBER
//             VOL=(,RETAIN,SER=&VL),
//             DCB=(RECFM=VB,LRECL=94,BLKSIZE=32716,TRTCH=NOCOMP)
//OFFG  PEND
//NEWJCL  PROC
//COPY1   EXEC PGM=IEBGEOLD
//SYSPRINT DD  SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=SBGOLOB.CBT.EDIT(FILE001)
//SYSUT2 DD DSN=FILE0001,
//         DISP=(NEW,KEEP),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720,TRTCH=NOCOMP),
//         UNIT=568,
//         LABEL=(1,SL,EXPDT=98000),
//         VOL=(,RETAIN,SER=V500MT)
//SYSIN  DD DUMMY
//COPY2   EXEC PGM=IEBGEOLD
//SYSPRINT DD  SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=SBGOLOB.CBT.EDIT(##CBT973)
//SYSUT2 DD DSN=FILE0002,
//         DISP=(NEW,KEEP),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720,TRTCH=NOCOMP),
//         UNIT=568,
//         LABEL=(2,SL,EXPDT=98000),
//         VOL=(,RETAIN,SER=V500MT)
//SYSIN  DD DUMMY
//COPY3   EXEC PGM=IEBGEOLD
//SYSPRINT DD  SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=SBGOLOB.CBT.EDIT($$JCL003)
//SYSUT2 DD DSN=FILE0003,
//         DISP=(NEW,KEEP),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720,TRTCH=NOCOMP),
//         UNIT=568,
//         LABEL=(3,SL,EXPDT=98000),
//         VOL=(,RETAIN,SER=V500MT)
//SYSIN  DD DUMMY
//COPY4   EXEC PGM=IEBGEOLD
//SYSPRINT DD  SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=SBGOLOB.CBT.EDIT(CBTUPD)
//SYSUT2 DD DSN=FILE0004,
//         DISP=(NEW,KEEP),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720,TRTCH=NOCOMP),
//         UNIT=568,
//         LABEL=(4,SL,EXPDT=98000),
//         VOL=(,RETAIN,SER=V500MT)
//SYSIN  DD DUMMY
//COPY5   EXEC PGM=IEBGEOLD
//SYSPRINT DD  SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=SBGOLOB.CBT.EDIT(FILE005)
//SYSUT2 DD DSN=FILE0005,
//         DISP=(NEW,KEEP),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720,TRTCH=NOCOMP),
//         UNIT=568,
//         LABEL=(5,SL,EXPDT=98000),
//         VOL=(,RETAIN,SER=V500MT)
//SYSIN  DD DUMMY
//         PEND
//S501 EXEC OFFL,N=501,TO='FILE0501',FRX='FILE501.PDS'
//S502 EXEC OFFL,N=502,TO='FILE0502',FRX='FILE502.PDS'
//S503 EXEC OFFL,N=503,TO='FILE0503',FRX='FILE503.PDS'
//S504 EXEC OFFL,N=504,TO='FILE0504',FRX='FILE504.PDS'
//S505 EXEC OFFL,N=505,TO='FILE0505',FRX='FILE505.PDS'
//S506 EXEC OFFL,N=506,TO='FILE0506',FRX='FILE506.PDS'
//S507 EXEC OFFL,N=507,TO='FILE0507',FRX='FILE507.PDS'
//S508 EXEC OFFL,N=508,TO='FILE0508',FRX='FILE508.PDS'
//S509 EXEC OFFL,N=509,TO='FILE0509',FRX='FILE509.PDS'
//S510 EXEC OFFL,N=510,TO='FILE0510',FRX='FILE510.PDS'
//S511 EXEC OFFL,N=511,TO='FILE0511',FRX='FILE511.PDS'
//S512 EXEC OFFL,N=512,TO='FILE0512',FRX='FILE512.PDS'
//S513 EXEC OFFL,N=513,TO='FILE0513',FRX='FILE513.PDS'
//S514 EXEC OFFL,N=514,TO='FILE0514',FRX='FILE514.PDS'
//S515 EXEC OFFL,N=515,TO='FILE0515',FRX='FILE515.PDS'
//S516 EXEC OFFL,N=516,TO='FILE0516',FRX='FILE516.PDS'
//S517 EXEC OFFL,N=517,TO='FILE0517',FRX='FILE517.PDS'
//S518 EXEC OFFL,N=518,TO='FILE0518',FRX='FILE518.PDS'
//S519 EXEC OFFL,N=519,TO='FILE0519',FRX='FILE519.PDS'
//S520 EXEC OFFL,N=520,TO='FILE0520',FRX='FILE520.PDS'
//S521 EXEC OFFL,N=521,TO='FILE0521',FRX='FILE521.PDS'
//S522 EXEC OFFL,N=522,TO='FILE0522',FRX='FILE522.PDS'
//S523 EXEC OFFL,N=523,TO='FILE0523',FRX='FILE523.PDS'
//S524 EXEC OFFL,N=524,TO='FILE0524',FRX='FILE524.PDS'
//S525 EXEC OFFL,N=525,TO='FILE0525',FRX='FILE525.PDS'
//S526 EXEC OFFL,N=526,TO='FILE0526',FRX='FILE526.PDS'
//S527 EXEC OFFL,N=527,TO='FILE0527',FRX='FILE527.PDS'
//S528 EXEC OFFL,N=528,TO='FILE0528',FRX='FILE528.PDS'
//S529 EXEC OFFL,N=529,TO='FILE0529',FRX='FILE529.PDS'
//S530 EXEC OFFL,N=530,TO='FILE0530',FRX='FILE530.PDS'
//S531 EXEC OFFL,N=531,TO='FILE0531',FRX='FILE531.PDS'
//S532 EXEC OFFL,N=532,TO='FILE0532',FRX='FILE532.PDS'
//S533 EXEC OFFL,N=533,TO='FILE0533',FRX='FILE533.PDS'
//S534 EXEC OFFL,N=534,TO='FILE0534',FRX='FILE534.PDS'
//S535 EXEC OFFL,N=535,TO='FILE0535',FRX='CBT500.FILE535',
//     DPFX='SBGOLOB.'
//S536 EXEC OFFL,N=536,TO='FILE0536',FRX='FILE536.PDS'
//S537 EXEC OFFL,N=537,TO='FILE0537',FRX='FILE537.PDS'
//S538 EXEC OFFL,N=538,TO='FILE0538',FRX='FILE538.PDS'
//S539 EXEC OFFL,N=539,TO='FILE0539',FRX='FILE539.PDS'
//S540 EXEC OFFL,N=540,TO='FILE0540',FRX='FILE540.PDS'
//S541 EXEC OFFL,N=541,TO='FILE0541',FRX='FILE541.PDS'
//S542 EXEC OFFL,N=542,TO='FILE0542',FRX='FILE542.PDS'
//S543 EXEC OFFL,N=543,TO='FILE0543',FRX='FILE543.PDS'
//S544 EXEC OFFL,N=544,TO='FILE0544',FRX='FILE544.PDS'
//S545 EXEC OFFL,N=545,TO='FILE0545',FRX='FILE545.PDS'
//S546 EXEC OFFL,N=546,TO='FILE0546',FRX='FILE546.PDS'
//S547 EXEC OFFL,N=547,TO='FILE0547',FRX='FILE547.PDS'
//S548 EXEC OFFL,N=548,TO='FILE0548',FRX='FILE548.PDS'
//S549 EXEC OFFL,N=549,TO='FILE0549',FRX='FILE549.PDS'
//S550 EXEC OFFL,N=550,TO='FILE0550',FRX='FILE550.PDS'
//S551 EXEC OFFL,N=551,TO='FILE0551',FRX='FILE551.PDS'
//S552 EXEC OFFL,N=552,TO='FILE0552',FRX='FILE552.PDS'
//S553 EXEC OFFL,N=553,TO='FILE0553',FRX='FILE553.PDS'
//S554 EXEC OFFL,N=554,TO='FILE0554',FRX='FILE554.PDS'
//S555 EXEC OFFL,N=555,TO='FILE0555',FRX='FILE555.PDS'
//S556 EXEC OFFL,N=556,TO='FILE0556',FRX='FILE556.PDS'
//S557 EXEC OFFL,N=557,TO='FILE0557',FRX='FILE557.PDS'
//S558 EXEC OFFL,N=558,TO='FILE0558',FRX='FILE558.PDS'
//S559 EXEC OFFL,N=559,TO='FILE0559',FRX='FILE559.PDS'
//S560 EXEC OFFL,N=560,TO='FILE0560',FRX='FILE560.PDS'
//S561 EXEC OFFL,N=561,TO='FILE0561',FRX='FILE561.PDS'
//S562 EXEC OFFL,N=562,TO='FILE0562',FRX='FILE562.PDS'
//S563 EXEC OFFL,N=563,TO='FILE0563',FRX='FILE563.PDS'
//S564 EXEC OFFL,N=564,TO='FILE0564',FRX='FILE564.PDS'
//S565 EXEC OFFL,N=565,TO='FILE0565',FRX='FILE565.PDS'
//S566 EXEC OFFL,N=566,TO='FILE0566',FRX='FILE566.PDS'
//S567 EXEC OFFL,N=567,TO='FILE0567',FRX='FILE567.PDS'
//S568 EXEC COP1,N=568,TO='FILE0568',FRX='FILE568.PDS'
//S569 EXEC OFFL,N=569,TO='FILE0569',FRX='FILE569.PDS'
//S570 EXEC OFFL,N=570,TO='FILE0570',FRX='FILE570.PDS'
//S571 EXEC OFFL,N=571,TO='FILE0571',FRX='FILE571.PDS'
//S572 EXEC OFFL,N=572,TO='FILE0572',FRX='FILE572.PDS'
//S573 EXEC OFFL,N=573,TO='FILE0573',FRX='FILE573.PDS'
//S574 EXEC OFFL,N=574,TO='FILE0574',FRX='FILE574.PDS'
//S575 EXEC OFFL,N=575,TO='FILE0575',FRX='FILE575.PDS'
//S576 EXEC OFFL,N=576,TO='FILE0576',FRX='FILE576.PDS'
//S577 EXEC OFFL,N=577,TO='FILE0577',FRX='FILE577.PDS'
//S578 EXEC OFFL,N=578,TO='FILE0578',FRX='FILE578.PDS'
//S579 EXEC OFFL,N=579,TO='FILE0579',FRX='FILE579.PDS'
//S580 EXEC OFFL,N=580,TO='FILE0580',FRX='FILE580.PDS'
//S581 EXEC OFFL,N=581,TO='FILE0581',FRX='FILE581.PDS'
//S582 EXEC OFFL,N=582,TO='FILE0582',FRX='FILE582.PDS'
//S583 EXEC OFFL,N=583,TO='FILE0583',FRX='FILE583.PDS'
//S584 EXEC OFFL,N=584,TO='FILE0584',FRX='FILE584.PDS'
//S585 EXEC OFFL,N=585,TO='FILE0585',FRX='FILE585.PDS'
//S586 EXEC OFFL,N=586,TO='FILE0586',FRX='FILE586.PDS'
//S587 EXEC OFFL,N=587,TO='FILE0587',FRX='FILE587.PDS'
//S588 EXEC OFFL,N=588,TO='FILE0588',FRX='FILE588.PDS'
//S589 EXEC OFFL,N=589,TO='FILE0589',FRX='FILE589.PDS'
//S590 EXEC OFFL,N=590,TO='FILE0590',FRX='FILE590.PDS'
//S591 EXEC OFFL,N=591,TO='FILE0591',FRX='FILE591.PDS'
//S592 EXEC OFFL,N=592,TO='FILE0592',FRX='FILE592.PDS'
//S593 EXEC OFFL,N=593,TO='FILE0593',FRX='FILE593.PDS'
//S594 EXEC OFFL,N=594,TO='FILE0594',FRX='FILE594.PDS'
//S595 EXEC OFFL,N=595,TO='FILE0595',FRX='FILE595.PDS'
//S596 EXEC OFFL,N=596,TO='FILE0596',FRX='FILE596.PDS'
//S597 EXEC OFFL,N=597,TO='FILE0597',FRX='FILE597.PDS'
//S598 EXEC OFFL,N=598,TO='FILE0598',FRX='FILE598.PDS'
//S599 EXEC OFFL,N=599,TO='FILE0599',FRX='FILE599.PDS'
//S600 EXEC OFFL,N=600,TO='FILE0600',FRX='FILE600.PDS'
