//SBGOLOBS  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//****************************************************
//*                                                  *
//*       TRSMAIN WITH PACK OPTION                   *
//*                                                  *
//****************************************************
//STEP     EXEC PGM=TRSMAIN,PARM=PACK
//SYSPRINT DD   SYSOUT=*
//INFILE   DD   DISP=SHR,DSN=CBT.FDR.CBT500.BACKUP
//OUTFILE  DD   DISP=(NEW,CATLG),UNIT=SYSDA,
//       DSN=CBT.FDR.CBT500.TERSED,
//       SPACE=(CYL,(90,90),RLSE),VOL=SER=WORK91
