//SBGOLOBF JOB ,'SAM GOLOB',CLASS=B,                               `
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//TSOBATCH EXEC PGM=IKJEFT01
//STEPLIB  DD DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
ALLOC F(A001) DA('CBT.V500.FILE601.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
 XMIT A.A DSN('CBT.V500.FILE601.PDS')   OUTDSN('CBT.V500.FILE601.XMI')
 RELEASE 'CBT.V500.FILE601.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE602.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
 XMIT A.A DSN('CBT.V500.FILE602.PDS')   OUTDSN('CBT.V500.FILE602.XMI')
 RELEASE 'CBT.V500.FILE602.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE603.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
 XMIT A.A DSN('CBT.V500.FILE603.PDS')   OUTDSN('CBT.V500.FILE603.XMI')
 RELEASE 'CBT.V500.FILE603.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE604.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
 XMIT A.A DSN('CBT.V500.FILE604.PDS')   OUTDSN('CBT.V500.FILE604.XMI')
 RELEASE 'CBT.V500.FILE604.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE605.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
 XMIT A.A DSN('CBT.V500.FILE605.PDS')   OUTDSN('CBT.V500.FILE605.XMI')
 RELEASE 'CBT.V500.FILE605.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE606.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
 XMIT A.A DSN('CBT.V500.FILE606.PDS')  OUTDSN('CBT.V500.FILE606.XMI')
 RELEASE 'CBT.V500.FILE606.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE607.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
 XMIT A.A DSN('CBT.V500.FILE607.PDS')  OUTDSN('CBT.V500.FILE607.XMI')
 RELEASE 'CBT.V500.FILE607.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE608.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
 XMIT A.A DSN('CBT.V500.FILE608.PDS')  OUTDSN('CBT.V500.FILE608.XMI')
 RELEASE 'CBT.V500.FILE608.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE609.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
 XMIT A.A DSN('CBT.V500.FILE609.PDS')  OUTDSN('CBT.V500.FILE609.XMI')
 RELEASE 'CBT.V500.FILE609.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE610.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
   XMIT A.A DSN('CBT.V500.FILE610.PDS') OUTDSN('CBT.V500.FILE610.XMI')
         RELEASE 'CBT.V500.FILE610.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE611.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE611.PDS') OUTDSN('CBT.V500.FILE611.XMI')
         RELEASE 'CBT.V500.FILE611.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE612.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE612.PDS') OUTDSN('CBT.V500.FILE612.XMI')
         RELEASE 'CBT.V500.FILE612.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE613.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE613.PDS') OUTDSN('CBT.V500.FILE613.XMI')
         RELEASE 'CBT.V500.FILE613.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE614.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE614.PDS') OUTDSN('CBT.V500.FILE614.XMI')
         RELEASE 'CBT.V500.FILE614.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE615.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE615.PDS') OUTDSN('CBT.V500.FILE615.XMI')
         RELEASE 'CBT.V500.FILE615.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE616.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE616.PDS') OUTDSN('CBT.V500.FILE616.XMI')
         RELEASE 'CBT.V500.FILE616.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE617.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE617.PDS') OUTDSN('CBT.V500.FILE617.XMI')
         RELEASE 'CBT.V500.FILE617.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE618.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
 XMIT A.A DSN('CBT.V500.FILE618.PDS') OUTDSN('CBT.V500.FILE618.XMI')
      RELEASE 'CBT.V500.FILE618.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE619.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE619.PDS') OUTDSN('CBT.V500.FILE619.XMI')
         RELEASE 'CBT.V500.FILE619.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE620.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE620.PDS') OUTDSN('CBT.V500.FILE620.XMI')
         RELEASE 'CBT.V500.FILE620.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE621.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE621.PDS') OUTDSN('CBT.V500.FILE621.XMI')
         RELEASE 'CBT.V500.FILE621.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE622.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE622.PDS') OUTDSN('CBT.V500.FILE622.XMI')
         RELEASE 'CBT.V500.FILE622.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE623.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE623.PDS') OUTDSN('CBT.V500.FILE623.XMI')
         RELEASE 'CBT.V500.FILE623.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE624.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE624.PDS') OUTDSN('CBT.V500.FILE624.XMI')
         RELEASE 'CBT.V500.FILE624.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE625.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE625.PDS') OUTDSN('CBT.V500.FILE625.XMI')
         RELEASE 'CBT.V500.FILE625.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE626.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE626.PDS') OUTDSN('CBT.V500.FILE626.XMI')
         RELEASE 'CBT.V500.FILE626.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE627.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE627.PDS') OUTDSN('CBT.V500.FILE627.XMI')
         RELEASE 'CBT.V500.FILE627.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE628.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE628.PDS') OUTDSN('CBT.V500.FILE628.XMI')
         RELEASE 'CBT.V500.FILE628.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE629.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE629.PDS') OUTDSN('CBT.V500.FILE629.XMI')
         RELEASE 'CBT.V500.FILE629.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE630.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
   XMIT A.A DSN('CBT.V500.FILE630.PDS') OUTDSN('CBT.V500.FILE630.XMI')
         RELEASE 'CBT.V500.FILE630.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE631.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE631.PDS') OUTDSN('CBT.V500.FILE631.XMI')
         RELEASE 'CBT.V500.FILE631.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE632.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE632.PDS') OUTDSN('CBT.V500.FILE632.XMI')
         RELEASE 'CBT.V500.FILE632.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE633.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE633.PDS') OUTDSN('CBT.V500.FILE633.XMI')
         RELEASE 'CBT.V500.FILE633.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE634.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE634.PDS') OUTDSN('CBT.V500.FILE634.XMI')
         RELEASE 'CBT.V500.FILE634.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE635.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE635.PDS') OUTDSN('CBT.V500.FILE635.XMI')
         RELEASE 'CBT.V500.FILE635.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE636.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE636.PDS') OUTDSN('CBT.V500.FILE636.XMI')
         RELEASE 'CBT.V500.FILE636.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE637.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE637.PDS') OUTDSN('CBT.V500.FILE637.XMI')
         RELEASE 'CBT.V500.FILE637.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE638.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE638.PDS') OUTDSN('CBT.V500.FILE638.XMI')
         RELEASE 'CBT.V500.FILE638.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE639.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE639.PDS') OUTDSN('CBT.V500.FILE639.XMI')
         RELEASE 'CBT.V500.FILE639.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE640.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE640.PDS') OUTDSN('CBT.V500.FILE640.XMI')
         RELEASE 'CBT.V500.FILE640.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE641.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE641.PDS') OUTDSN('CBT.V500.FILE641.XMI')
         RELEASE 'CBT.V500.FILE641.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE642.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE642.PDS') OUTDSN('CBT.V500.FILE642.XMI')
         RELEASE 'CBT.V500.FILE642.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE643.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
   XMIT A.A DSN('CBT.V500.FILE643.PDS') OUTDSN('CBT.V500.FILE643.XMI')
         RELEASE 'CBT.V500.FILE643.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE644.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE644.PDS') OUTDSN('CBT.V500.FILE644.XMI')
         RELEASE 'CBT.V500.FILE644.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE645.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE645.PDS') OUTDSN('CBT.V500.FILE645.XMI')
         RELEASE 'CBT.V500.FILE645.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE646.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE646.PDS') OUTDSN('CBT.V500.FILE646.XMI')
         RELEASE 'CBT.V500.FILE646.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE647.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE647.PDS') OUTDSN('CBT.V500.FILE647.XMI')
         RELEASE 'CBT.V500.FILE647.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE648.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE648.PDS') OUTDSN('CBT.V500.FILE648.XMI')
         RELEASE 'CBT.V500.FILE648.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE649.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE649.PDS') OUTDSN('CBT.V500.FILE649.XMI')
         RELEASE 'CBT.V500.FILE649.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE650.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE650.PDS') OUTDSN('CBT.V500.FILE650.XMI')
         RELEASE 'CBT.V500.FILE650.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE651.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE651.PDS') OUTDSN('CBT.V500.FILE651.XMI')
         RELEASE 'CBT.V500.FILE651.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE652.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE652.PDS') OUTDSN('CBT.V500.FILE652.XMI')
         RELEASE 'CBT.V500.FILE652.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE653.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE653.PDS') OUTDSN('CBT.V500.FILE653.XMI')
         RELEASE 'CBT.V500.FILE653.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE654.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE654.PDS') OUTDSN('CBT.V500.FILE654.XMI')
         RELEASE 'CBT.V500.FILE654.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE655.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE655.PDS') OUTDSN('CBT.V500.FILE655.XMI')
         RELEASE 'CBT.V500.FILE655.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE656.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE656.PDS') OUTDSN('CBT.V500.FILE656.XMI')
         RELEASE 'CBT.V500.FILE656.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE657.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
   XMIT A.A DSN('CBT.V500.FILE657.PDS') OUTDSN('CBT.V500.FILE657.XMI')
         RELEASE 'CBT.V500.FILE657.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE658.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE658.PDS') OUTDSN('CBT.V500.FILE658.XMI')
         RELEASE 'CBT.V500.FILE658.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE659.XMI') NEW TRACK SPACE(345 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE659.PDS') OUTDSN('CBT.V500.FILE659.XMI')
         RELEASE 'CBT.V500.FILE659.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE660.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE660.PDS') OUTDSN('CBT.V500.FILE660.XMI')
         RELEASE 'CBT.V500.FILE660.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE661.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE661.PDS') OUTDSN('CBT.V500.FILE661.XMI')
         RELEASE 'CBT.V500.FILE661.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE662.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
   XMIT A.A DSN('CBT.V500.FILE662.PDS') OUTDSN('CBT.V500.FILE662.XMI')
         RELEASE 'CBT.V500.FILE662.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE663.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
   XMIT A.A DSN('CBT.V500.FILE663.PDS') OUTDSN('CBT.V500.FILE663.XMI')
         RELEASE 'CBT.V500.FILE663.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE664.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
   XMIT A.A DSN('CBT.V500.FILE664.PDS') OUTDSN('CBT.V500.FILE664.XMI')
         RELEASE 'CBT.V500.FILE664.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE665.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE665.PDS') OUTDSN('CBT.V500.FILE665.XMI')
         RELEASE 'CBT.V500.FILE665.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE666.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE666.PDS') OUTDSN('CBT.V500.FILE666.XMI')
         RELEASE 'CBT.V500.FILE666.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE667.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE667.PDS') OUTDSN('CBT.V500.FILE667.XMI')
         RELEASE 'CBT.V500.FILE667.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE668.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE668.PDS') OUTDSN('CBT.V500.FILE668.XMI')
         RELEASE 'CBT.V500.FILE668.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE669.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE669.PDS') OUTDSN('CBT.V500.FILE669.XMI')
         RELEASE 'CBT.V500.FILE669.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE670.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE670.PDS') OUTDSN('CBT.V500.FILE670.XMI')
         RELEASE 'CBT.V500.FILE670.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE671.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE671.PDS') OUTDSN('CBT.V500.FILE671.XMI')
         RELEASE 'CBT.V500.FILE671.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE672.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE672.PDS') OUTDSN('CBT.V500.FILE672.XMI')
         RELEASE 'CBT.V500.FILE672.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE673.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE673.PDS') OUTDSN('CBT.V500.FILE673.XMI')
         RELEASE 'CBT.V500.FILE673.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE674.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE674.PDS') OUTDSN('CBT.V500.FILE674.XMI')
         RELEASE 'CBT.V500.FILE674.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE675.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE675.PDS') OUTDSN('CBT.V500.FILE675.XMI')
         RELEASE 'CBT.V500.FILE675.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE676.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE676.PDS') OUTDSN('CBT.V500.FILE676.XMI')
         RELEASE 'CBT.V500.FILE676.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE677.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE677.PDS') OUTDSN('CBT.V500.FILE677.XMI')
         RELEASE 'CBT.V500.FILE677.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE678.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE678.PDS') OUTDSN('CBT.V500.FILE678.XMI')
         RELEASE 'CBT.V500.FILE678.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE679.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE679.PDS') OUTDSN('CBT.V500.FILE679.XMI')
         RELEASE 'CBT.V500.FILE679.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE680.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE680.PDS') OUTDSN('CBT.V500.FILE680.XMI')
         RELEASE 'CBT.V500.FILE680.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE681.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE681.PDS') OUTDSN('CBT.V500.FILE681.XMI')
         RELEASE 'CBT.V500.FILE681.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE682.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE682.PDS') OUTDSN('CBT.V500.FILE682.XMI')
         RELEASE 'CBT.V500.FILE682.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE683.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE683.PDS') OUTDSN('CBT.V500.FILE683.XMI')
         RELEASE 'CBT.V500.FILE683.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE684.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE684.PDS') OUTDSN('CBT.V500.FILE684.XMI')
         RELEASE 'CBT.V500.FILE684.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE685.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE685.PDS') OUTDSN('CBT.V500.FILE685.XMI')
         RELEASE 'CBT.V500.FILE685.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE686.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE686.PDS') OUTDSN('CBT.V500.FILE686.XMI')
         RELEASE 'CBT.V500.FILE686.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE687.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE687.PDS') OUTDSN('CBT.V500.FILE687.XMI')
         RELEASE 'CBT.V500.FILE687.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE688.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE688.PDS') OUTDSN('CBT.V500.FILE688.XMI')
         RELEASE 'CBT.V500.FILE688.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE689.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE689.PDS') OUTDSN('CBT.V500.FILE689.XMI')
         RELEASE 'CBT.V500.FILE689.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE690.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE690.PDS') OUTDSN('CBT.V500.FILE690.XMI')
         RELEASE 'CBT.V500.FILE690.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE691.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE691.PDS') OUTDSN('CBT.V500.FILE691.XMI')
         RELEASE 'CBT.V500.FILE691.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE692.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE692.PDS') OUTDSN('CBT.V500.FILE692.XMI')
         RELEASE 'CBT.V500.FILE692.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE693.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE693.PDS') OUTDSN('CBT.V500.FILE693.XMI')
         RELEASE 'CBT.V500.FILE693.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE694.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE694.PDS') OUTDSN('CBT.V500.FILE694.XMI')
         RELEASE 'CBT.V500.FILE694.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE695.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE695.PDS') OUTDSN('CBT.V500.FILE695.XMI')
         RELEASE 'CBT.V500.FILE695.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE696.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE696.PDS') OUTDSN('CBT.V500.FILE696.XMI')
         RELEASE 'CBT.V500.FILE696.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE697.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE697.PDS') OUTDSN('CBT.V500.FILE697.XMI')
         RELEASE 'CBT.V500.FILE697.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE698.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE698.PDS') OUTDSN('CBT.V500.FILE698.XMI')
         RELEASE 'CBT.V500.FILE698.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE699.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
   XMIT A.A DSN('CBT.V500.FILE699.PDS') OUTDSN('CBT.V500.FILE699.XMI')
         RELEASE 'CBT.V500.FILE699.XMI'
     FREE FI(A001)
ALLOC F(A001) DA('CBT.V500.FILE700.XMI') NEW TRACK SPACE(45 45) +
     LRECL(80) BLKSIZE(27920) REUSE VOLUME(CBTA02)
    XMIT A.A DSN('CBT.V500.FILE700.PDS') OUTDSN('CBT.V500.FILE700.XMI')
         RELEASE 'CBT.V500.FILE700.XMI'
     FREE FI(A001)
/*
//
