//SYSJJA JOB (65003,B29),'J.JANCO',CLASS=C,MSGCLASS=T,
//            NOTIFY=SYSJJ,REGION=1096K
/*JOBPARM S=MVSC
//*********************************************************************
//*
//* INSTALL IPOUPDTE PROGRAM FROM 'IPO1.LINKLIB'
//*
//*  THIS PROGRAM IS DESCRIBED IN THE IPO SYSTEM AND INSTALLATION
//*   GUIDE VOL 1 FOR IPO SP 1.3.5 RELEASE.
//*
//*  STEP 1:   LINK EDIT PROGRAM INTO TECH.LOAD
//*
//*  STEP 2:   SPZAP THE PROGRAM TO ALLOW OPERATION ON 'NON-IPO'
//*            JCL LIBS.........
//*
//*  JOHN JANCO  03 MARCH 1986
//*
//*********************************************************************
//********************************************************************
//LKED    EXEC PGM=HEWL,PARM='LIST,MAP'
//SYSPRINT DD  SYSOUT=*
//IPOLINK  DD  DSN=IPO1.LINKLIB,DISP=SHR,VOL=SER=MVSCTD,UNIT=3380
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(200,20))
//SYSLMOD  DD  DSN=TECH.LOADLIB,DISP=SHR
//SYSLIN   DD  *
  INCLUDE IPOLINK(IPOUPDTE)     FETCH MODULE FROM IPO1.LINKLIB
  NAME  IPOUPDTE(R)             STORE IT IN TECH.LOAD
//SPZAP   EXEC PGM=AMASPZAP
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=TECH.LOADLIB,DISP=SHR
//SYSIN    DD  *
*
* SPZAP TO REMOVE REQUIREMENT THAT A '$$$COIBM' MEMBER BE THE FIRST
*  ONE IN THE PDS TO BE SCANNED.
*    J JANCO   13 MARCH 1986
*
  NAME  IPOUPDTE
*
  VER  0548 0A12        SVC  18       BLDL OR FIND
  VER  054A 12FF        LTR  15,15     CHECK RETURN
  VER  054C 4780,C55C   BZ               ......  PROCESS
*
  REP  054C 47F0,C55C   B             FORCE PROCESS......
*
//
