//DEMOJOB JOB ($2919BA,BIN070,FSH334,DEPT19BA),'RUN SQL',
//       NOTIFY=&SYSUID,MSGCLASS=H,MSGLEVEL=(1,1),TIME=5
//*
//RUN01   EXEC PGM=IKJEFT01,DYNAMNBR=50
//STEPLIB  DD DSN=MDCT.TEST.LOADLIB,DISP=SHR
//SYSTSIN  DD *
 DSN SYSTEM (DB2E)
 RUN PROG(BSPUFI) PLAN(BSPUFI) +
      PARMS('INSQL(DD:SYSIN) TAGS(DD:TAGS) OUTSQL(DD:OUTSQL)' )
/*
//TAGS     DD *                  <-- TAGS TO ADJUST INPUT SQL
--TAGS---       --VALUES--        -- THIS IS A COMMENT IN TAGS FILE
<CREATOR>       DSN8810           -- TEST TABLE CREATOR NAME
<TABLE>         EMP               -- TEST TABLE NAME
<COLUMN>        EMPNO             -- FOR CREATE UNIQUE INDEX
<NN>            2                 -- FETCH FIRST <NN> ROWS ONLY
/*
//SYSIN    DD DSN=&SYSUID..CBT484.FILE866(DEMOSQL),DISP=SHR
//INCLUDE  DD DSN=&SYSUID..CBT484.FILE866(DEMOSQL1),DISP=SHR
//OUTSQL   DD SYSOUT=*
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,(1,1))
//*
//SYSPRINT DD SYSOUT=*,LRECL=330  <-- ADJUST IF YOU NEED MORE OR LESS
//SYSTSPRT DD SYSOUT=*
//CEEDUMP  DD DUMMY
//
