//SBGOLOBL JOB (ACCT#),PDSLOAD,
// NOTIFY=&SYSUID,
// CLASS=A,MSGCLASS=X,COND=(1,LT)
//*
//LOA1 EXEC PGM=PDSLOAD            /* FROM FILE 093 - LOAD ON FILE 035
//STEPLIB  DD DISP=SHR,DSN=CBT.CBT445.FILE035.PDS
//SYSUT1   DD DISP=SHR,DSN=SBGOLOB.CBT444.FILE559($SAMPJCL)
//SYSPRINT DD SYSOUT=*
//SYSUT2   DD DISP=(NEW,CATLG,DELETE),DSN=SBGOLOB.FILE559.SAMPJCL,
//   DCB=(RECFM=FB,LRECL=80,BLKSIZE=8000),
//   SPACE=(TRK,(45,30,89),RLSE),UNIT=SYSALLDA,VOL=SER=DATA04
//*
