//AWCPAWL  JOB (AWC),PW,CLASS=M,MSGCLASS=X,REGION=7M,                   JOB62512
//         NOTIFY=&SYSUID
//*
//* AWCPAW.CBT.FILE600.C.PDS(CPRELKHF)
//* JCL FOR GENERALISED PRE-LINK/LINK OF C OBJECT TO HFS
//*
//* CUSTOMISATION
//*   1) CHANGE ALL AWCPAW TO YOUR HLQ
//*   2) CHANGE ALL SYS1 PREFIX OF IBM TARGET LIBRARIES TO YOUR OWN
//*
//*
//        JCLLIB ORDER=(SYS1.CEE.SCEEPROC)
//*
//* LINK1 - LINK NICKNC (NICKNAMES)
//LINK1    EXEC  EDCPL,
//          LIBPRFX='SYS1.CEE',
//          PPARM='NOER',
//          LPARM='AMODE=31,MAP',
//          INFILE='AWCPAW.CBT.FILE600.OBJ.PDS(NICKNC)',
//          OUTFILE=
//LKED.SYSLMOD DD PATH='/u/awcpaw/nicknc',PATHOPTS=(OWRONLY,OCREAT),
//          PATHMODE=(SIRWXU,SIRWXG,SIXOTH)
