//AWCPAWSR JOB (AWC),PW,CLASS=M,MSGCLASS=X,REGION=7M,
//         NOTIFY=&SYSUID
//*
//* AWCPAW.CBT.FILE600.C.PDS(SMFX119J)
//* EXTRACTS SMF TYPE 119 FTP SUBTYPES TO A DATASET
//*
//* CUSTOMISATION
//*   1) CHANGE ALL AWCPAW TO YOUR HLQ
//*   2) CHANGE ALL ZAZUO.DISK.ZUTA2 TO YOUR SMF TAPE DATASET NAME
//*
//SORTSMF  EXEC PGM=SORT
//SYSOUT   DD  SYSOUT=*
//SORTIN   DD  DISP=SHR,DSN=ZAZUO.DISK.ZUTA2
//SORTOUT  DD  DISP=(MOD,CATLG),UNIT=SYSALLDA,
//          SPACE=(TRK,(100,100),RLSE),
//          RECFM=VB,LRECL=27994,DSORG=PS,
//          DSN=AWCPAW.CBT.FILE600.SMF119
//SYSIN    DD  *
 INCLUDE COND=((6,1,CH,EQ,X'77'),&,
               ((24,1,CH,EQ,X'03'),|,
                (24,1,CH,EQ,X'46'),|,
                (24,1,CH,EQ,X'48')))
 OPTION COPY,VLSHRT
