//$$$$$$T  JOB (FC50690,FCFC),'ISPLPA DDDEF   ',
//             USER=,GROUP=,PASSWORD=,                         /*RACF*/
//             NOTIFY=$$$$$$,
//             CLASS=W,MSGCLASS=X,MSGLEVEL=(1,1)
//*                                                           /*JCTRL*/
//* LIB: SYS2.SMPELIB.XA223    )
//* DOC: THIS JOB RECEIVES AND APPLIES USERMODS FOR IPO UNDER RELEASE 5
//*
//UMOD1   EXEC PGM=GIMSMP,REGION=4096K,
//             TIME=120
//SMPCSI   DD  DSN=LCPSMPE.GLOBAL.CSI,DISP=SHR
//SMPOUT   DD  SYSOUT=*
//SMPRPT   DD  SYSOUT=*
//SMPLIST  DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SMPPTFIN DD  DUMMY
//SMPCNTL  DD  *
 SET BDY(TARG0).
 UCLIN.
 REP DDDEF(CAILIB) UNIT(3380) VOLUME(PAGE02)
 DA(SYS2.PHCAI.XA223.CAILIB) SHR .
 ENDUCL.
/*
//
 REP DDDEF(RESLIB13) UNIT(3380) VOLUME(XARES1)
 DA(IMSVS.RESLIB) SHR .
 REP DDDEF(LOADLIB) UNIT(3380) VOLUME(CICS04)
 DA(SYS1.CICS.LOADLIB) SHR .
 REP DDDEF(JES2LPA) UNIT(3380) VOLUME(XARES0)
 DA(SYS1.JES2LPA) SHR .
 REP DDDEF(JES2SRC) UNIT(3380) VOLUME(DLIB01)
 DA(SYS1.JES2SRC) SHR .
