++USERMOD(EXITU83).
++VER(Z038) FMID(HBB2102) REQ(FNMU834).
++JCLIN.
//EXIT83 EXEC PGM=IEV90,REGION=1024K,PARM='DECK,NOOBJ'
//SYSIN     DD DSN=SYS1.NPM.V1R3M0.SFNMSRC1(FNMU83),DISP=SHR
//SYSLIB    DD DSN=SYS1.NPM.V1R3M0.SFNMMAC1,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=SYS1.AMODGEN,DISP=SHR
//SYSUT1    DD UNIT=WORK,SPACE=(CYL,(5))
//SYSUT2    DD UNIT=WORK,SPACE=(CYL,(5))
//SYSUT3    DD UNIT=WORK,SPACE=(CYL,(5))
//SYSPRINT  DD SYSOUT=*
//SYSPUNCH  DD DSN=&&OBJ1(FNMU83),UNIT=WORK,DISP=(,PASS),
//             SPACE=(TRK,(10,1,1),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//LINK83   EXEC PGM=IEWL,PARM='RENT,LET,LIST,XREF'
//SYSPRINT  DD SYSOUT=*
//SYSUT1    DD UNIT=WORK,SPACE=(1024,(400,20))
//AFNMMOD1  DD DSN=SYS1.NPM.V1R3M0.SFNMLMD1,DISP=SHR
//OBJ       DD DSN=&&OBJ1(FNMU83),DISP=SHR
//SYSLMOD   DD DSN=SYS1.LPALIB,DISP=SHR
//SYSLIN    DD *             LINKEDIT NPM SMF EXIT ROUTINES
 INCLUDE OBJ(FNMU83)               IEFU83 EXIT INTERFACE ROUTINE
 INCLUDE AFNMMOD1(FNMU83X1)        SMF RECORD CONTROL ROUTINE
 INCLUDE AFNMMOD1(FNMU83X2)        POST RTM RECORDS TO NPM
 ENTRY FNMU83
 NAME IEFU83(R)
//EXIT84 EXEC PGM=IEV90,REGION=1024K,PARM='DECK,NOOBJ'
//SYSIN     DD DSN=SYS1.NPM.V1R3M0.SFNMSRC1(FNMU84),DISP=SHR
//SYSLIB    DD DSN=SYS1.NPM.V1R3M0.SFNMMAC1,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=SYS1.AMODGEN,DISP=SHR
//SYSUT1    DD UNIT=WORK,SPACE=(CYL,(5))
//SYSUT2    DD UNIT=WORK,SPACE=(CYL,(5))
//SYSUT3    DD UNIT=WORK,SPACE=(CYL,(5))
//SYSPRINT  DD SYSOUT=*
//SYSPUNCH  DD DSN=&&OBJ1(FNMU84),UNIT=WORK,DISP=(,PASS),
//             SPACE=(TRK,(10,1,1),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//LINK84   EXEC PGM=IEWL,PARM='RENT,LET,LIST,XREF'
//SYSPRINT  DD SYSOUT=*
//SYSUT1    DD UNIT=WORK,SPACE=(1024,(400,20))
//AFNMMOD1  DD DSN=SYS1.NPM.V1R3M0.SFNMLMD1,DISP=SHR
//OBJ       DD DSN=&&OBJ1(FNMU83),DISP=SHR
//SYSLMOD   DD DSN=SYS1.LPALIB,DISP=SHR
//SYSLIN    DD *             LINKEDIT NPM SMF EXIT ROUTINES
 INCLUDE OBJ(FNMU84)               IEFU84 EXIT INTERFACE ROUTINE
 INCLUDE AFNMMOD1(FNMU83X1)        SMF RECORD CONTROL ROUTINE
 ENTRY FNMU84
 NAME IEFU84(R)
/*
