PROC 1 DSNAME
CONTROL NOMSG NOFLUSH
IF &SUBSTR(1:1,&DSNAME) NE &STR(') THEN SET &DSNAME=&SYSPREF..&DSNAME
   ELSE SET &DSNAME=&SUBSTR(2:&LENGTH(&DSNAME)-1,&DSNAME)
ISPEXEC SELECT PGM($LISTX) PARM(&DSNAME)
IF &LASTCC NE 0 THEN ISPF PGM($LISTX) PARM(&DSNAME)
ISPEXEC CONTROL DISPLAY REFRESH
