//SBGOLOBV JOB (),'REVIEW FOR Z/OS',CLASS=A,MSGCLASS=X,
//             REGION=5M,NOTIFY=&SYSUID,COND=(0,NE)
//* ********************************************************
//* *                                                      *
//* *      INSTALL THE 'REVIEW' TSO COMMAND ON Z/OS        *
//* *                                                      *
//* ********************************************************
//*
//* BEFORE SUBMITTING: (1) VERIFY SETTINGS IN REVGEN SOURCE MEMBER.
//*                    (2) CHECK JOB NAME AND OTHER JOB CARD SETTINGS.
//*                    (3) CHECK DATA SET NAMES IN DD STATEMENTS BELOW.
//*
//ASM     EXEC PGM=ASMA90,PARM='BATCH,RENT,TERM,XREF(SHORT),NODECK'
//SYSLIN   DD  DSN=&&LOADSET,DISP=(MOD,PASS),SPACE=(CYL,(1,1)),
//             UNIT=SYSALLDA,
//             DCB=(DSORG=PS,RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSIN    DD  DSN=SBGOLOB.CBT477.FILE134(REVIEW),DISP=SHR
//         DD  DSN=SBGOLOB.CBT477.FILE134(REVCMPBF),DISP=SHR
//SYSLIB   DD  DSN=SBGOLOB.S19.MACLIB,DISP=SHR
//         DD  DSN=SBGOLOB.S19.MODGEN,DISP=SHR
//         DD  DSN=SBGOLOB.CBT477.FILE134,DISP=SHR
//SYSTERM  DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(CYL,(6,1))
//LKED    EXEC PGM=IEWL,PARM='MAP,LIST,LET,RENT,REUS,REFR,NCAL,AC=1'
//SYSLIN   DD  DSN=&&LOADSET,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSN=SBGOLOB.CBT135.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 ORDER REVIEW,REVIEW2
 ENTRY REVIEW
 ALIAS REV,REVVSAM,HEL,FSHELP,FSH,REVOUT,REVED
 NAME REVIEW(R)
/*
//
