//GREGBETA JOB (S),G.PRICE,CLASS=A,MSGCLASS=X,COND=(0,NE),
//             REGION=6144K,NOTIFY=GREG
//*
//*    TRANSMIT REVIEW/RFE - LEVEL LABEL IS R370BETA
//*
//XMITREV PROC LLQ=
//XDEL    EXEC PGM=IEFBR14
//XMITDEL  DD  DSN=GREG.REVXMIT.&LLQ,DISP=(MOD,DELETE),
//             UNIT=SYSALLDA,SPACE=(TRK,0)
//XMIT    EXEC PGM=XMIT370
//XMITLOG  DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSUT1   DD  DSN=GREG.REVIEW.&LLQ,DISP=SHR
//SYSUT2   DD  DSN=&&SYSUT2,
//             UNIT=VIO,
//             SPACE=(CYL,(10,1)),
//             DISP=(,DELETE,DELETE)
//XMITOUT  DD  DSN=GREG.REVXMIT.&LLQ,
//             UNIT=3380,VOL=SER=STG803,
//             SPACE=(CYL,(5,1),RLSE),
//             DISP=(,CATLG,DELETE)
//SYSIN    DD  DUMMY
//        PEND
//ASM     EXEC XMITREV,LLQ=ASM
//CLIST   EXEC XMITREV,LLQ=CLIST
//DATA    EXEC XMITREV,LLQ=DATA
//HELP    EXEC XMITREV,LLQ=HELP
//LOAD    EXEC XMITREV,LLQ=LOAD
//*
//RESET   EXEC PGM=IKJEFT01
//SYSTSPRT DD  SYSOUT=*
//XMITPDS  DD  DSN=GREG.REVXMIT.PDS,DISP=SHR
//SYSTSIN  DD  *
PDS 'GREG.REVXMIT.PDS' FIX RESET
/*
//*
//LOADPDS EXEC PGM=PDSLOAD,PARM=SPF
//SYSPRINT DD  SYSOUT=*
//SYSUT2   DD  DSN=GREG.REVXMIT.PDS,DISP=SHR
//SYSUT1   DD  *
./ ADD NAME=CLIST
/*
//         DD  DSN=GREG.REVXMIT.CLIST,DISP=SHR
//         DD  *
./ ADD NAME=DATA
/*
//         DD  DSN=GREG.REVXMIT.DATA,DISP=SHR
//         DD  *
./ ADD NAME=HELP
/*
//         DD  DSN=GREG.REVXMIT.HELP,DISP=SHR
//         DD  *
./ ADD NAME=LOAD
/*
//         DD  DSN=GREG.REVXMIT.LOAD,DISP=SHR
//*
//README  EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DSN=GREG.REVIEW.DATA,DISP=SHR
//SYSUT2   DD  DSN=GREG.REVXMIT.PDS,DISP=SHR
//SYSIN    DD  *
  COPY INDD=SYSUT1,OUTDD=SYSUT2
  S M=(READ@ASC,READ@EBC)
/*
//*
//MARKER  EXEC PGM=IKJEFT01,PARM='%MARKER'
//SYSTSPRT DD  SYSOUT=*
//SYSPROC  DD  DSN=GREG.REVIEW.ASM,DISP=SHR
//REVXMIT  DD  DSN=GREG.REVXMIT.PDS(R370BETA),DISP=SHR
//SYSTSIN  DD  DUMMY
//*
//DELZIPS EXEC PGM=IEFBR14
//ZIP370   DD  DSN=GREG.REV370.ZIP,DISP=(MOD,DELETE),
//             UNIT=SYSALLDA,SPACE=(TRK,0)
//ZIP370   DD  DSN=GREG.REVASM.ZIP,DISP=(MOD,DELETE),
//             UNIT=SYSALLDA,SPACE=(TRK,0)
//*
//ZIP370  EXEC PGM=MINIZIP,PARM='-O ZIPFILE XMITPDS'
//STDOUT   DD  SYSOUT=*
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(CYL,30),
//             DCB=(DSORG=PS,RECFM=FB,LRECL=128,BLKSIZE=6144)
//ZIPFILE  DD  DSN=GREG.REV370.ZIP,
//             UNIT=3390,VOL=SER=STG901,
//             SPACE=(CYL,(15,5),RLSE),
//             DCB=(DSORG=PS,RECFM=VB,LRECL=27994,BLKSIZE=27998),
//             DISP=(,CATLG,DELETE)
//XMITPDS  DD  DSN=GREG.REVXMIT.PDS,DISP=SHR
//*
//ZIPASM  EXEC PGM=MINIZIP,PARM='ZIPFILE REVASM R370BETA'
//STDOUT   DD  SYSOUT=*
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(CYL,30),
//             DCB=(DSORG=PS,RECFM=FB,LRECL=128,BLKSIZE=6144)
//ZIPFILE  DD  DSN=GREG.REVASM.ZIP,
//             UNIT=3390,VOL=SER=STG901,
//             SPACE=(CYL,(15,5),RLSE),
//             DCB=(DSORG=PS,RECFM=VB,LRECL=27994,BLKSIZE=27998),
//             DISP=(,CATLG,DELETE)
//REVASM   DD  DSN=GREG.REVXMIT.ASM,DISP=SHR
//R370BETA DD  DSN=GREG.REVXMIT.PDS(R370BETA),DISP=SHR
//*
//
