         TITLE 'MAP FOR RIAWHO'
RIAWHOM  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=(FREEKB,FRSET),    X
               TIOAPFX=YES,EXTATT=MAPONLY,COLOR=NEUTRAL
RIAWHOM  DFHMDI SIZE=(24,80)
         DFHMDF POS=(2,1),LENGTH=24,                                   X
               INITIAL=' RWHO - CICS/VS SEARCH -'
         DFHMDF POS=(2,26),LENGTH=35,                                  X
               INITIAL='ENTER USERID OR TERMINAL ID'
         DFHMDF POS=(2,62),LENGTH=16,                                  X
               INITIAL='("CLEAR" TO END)'
         DFHMDF POS=(6,6),LENGTH=7,INITIAL='USERID:'
TCTUSER  DFHMDF POS=(6,14),LENGTH=8,ATTRB=(UNPROT,IC),COLOR=TURQUOISE
         DFHMDF POS=(6,23),LENGTH=1
         DFHMDF POS=(6,32),LENGTH=12,INITIAL='TRANSACTION:'
TCTTRAN  DFHMDF POS=(6,45),LENGTH=4,COLOR=TURQUOISE
         DFHMDF POS=(6,50),LENGTH=1
         DFHMDF POS=(9,6),LENGTH=12,INITIAL='TERMINAL ID:'
TCTTERM  DFHMDF POS=(9,19),LENGTH=4,ATTRB=UNPROT,COLOR=TURQUOISE
         DFHMDF POS=(9,24),LENGTH=1
         DFHMDF POS=(9,32),LENGTH=8,INITIAL='NETNAME:'
TCTNET   DFHMDF POS=(9,41),LENGTH=8,COLOR=TURQUOISE
         DFHMDF POS=(9,50),LENGTH=1
MSG      DFHMDF POS=(18,2),LENGTH=50,INITIAL=' '
         DFHMDF POS=(22,2),LENGTH=7,INITIAL='USERID:',COLOR=BLUE
RUNUSER  DFHMDF POS=(22,10),LENGTH=8,COLOR=BLUE
         DFHMDF POS=(22,21),LENGTH=5,INITIAL='TASK:',COLOR=BLUE
RUNTASK  DFHMDF POS=(22,27),LENGTH=7,COLOR=BLUE
         DFHMDF POS=(22,42),LENGTH=4,INITIAL='CICS',COLOR=BLUE
RUNVRM   DFHMDF POS=(22,48),LENGTH=6,COLOR=BLUE
RUNAPPL  DFHMDF POS=(22,60),LENGTH=15,COLOR=BLUE
         DFHMDF POS=(23,2),LENGTH=12,INITIAL='TERMINAL ID:',COLOR=BLUE
RUNTERM  DFHMDF POS=(23,15),LENGTH=4,COLOR=BLUE
         DFHMDF POS=(23,21),LENGTH=8,INITIAL='NETNAME:',COLOR=BLUE
RUNNET   DFHMDF POS=(23,30),LENGTH=8,COLOR=BLUE
         DFHMDF POS=(23,42),LENGTH=5,INITIAL='TIME:',COLOR=BLUE
RUNTIME  DFHMDF POS=(23,49),LENGTH=8,COLOR=BLUE
         DFHMDF POS=(23,58),LENGTH=1
         DFHMDF POS=(23,60),LENGTH=5,INITIAL='DATE:',COLOR=BLUE
RUNDATE  DFHMDF POS=(23,67),LENGTH=9,COLOR=BLUE
         DFHMDF POS=(23,78),LENGTH=1
         DFHMSD TYPE=FINAL
         END
