)ATTR
   ¬ TYPE(TEXT)    INTENS(HIGH)    COLOR(WHITE)
   % TYPE(TEXT)    INTENS(HIGH)    COLOR(YELLOW)
   + TYPE(TEXT)    INTENS(LOW)     COLOR(TURQ)
   # TYPE(TEXT)    INTENS(LOW)     COLOR(BLUE)
   _ TYPE(INPUT)   INTENS(HIGH)    COLOR(PINK)
   @ TYPE(INPUT)   INTENS(NON)
)BODY
¬----------------------* SPG SMP/E Global Zone Selection *----------------------
+¬COMMAND ===>_ZCMD                                                            +
+                                                                              +
+ Select   Global Zone data set name
+   _O1+ |_DSN1
+   _O2+ |_DSN2
+   _O3+ |_DSN3
+   _O4+ |_DSN4
+   _O5+ |_DSN5
+   _O6+ |_DSN6
+   _O7+ |_DSN7
+   _O8+ |_DSN8
+   _O9+ |_DSN9
+   _O10+|_DSN10
+
+
+   Use selection code%S+to select the SMP/E Global Zone data set
)PROC
 VER (&O1,LIST,S)
 VER (&O2,LIST,S)
 VER (&O3,LIST,S)
 VER (&O4,LIST,S)
 VER (&O5,LIST,S)
 VER (&O6,LIST,S)
 VER (&O7,LIST,S)
 VER (&O8,LIST,S)
 VER (&O9,LIST,S)
 VER (&O10,LIST,S)
 IF  (&O1 ¬= ' ')
     VER (&DSN1,NONBLANK)
 IF  (&O2 ¬= ' ')
     VER (&DSN2,NONBLANK)
 IF  (&O3 ¬= ' ')
     VER (&DSN3,NONBLANK)
 IF  (&O4 ¬= ' ')
     VER (&DSN4,NONBLANK)
 IF  (&O5 ¬= ' ')
     VER (&DSN5,NONBLANK)
 IF  (&O6 ¬= ' ')
     VER (&DSN6,NONBLANK)
 IF  (&O7 ¬= ' ')
     VER (&DSN7,NONBLANK)
 IF  (&O8 ¬= ' ')
     VER (&DSN8,NONBLANK)
 IF  (&O9 ¬= ' ')
     VER (&DSN9,NONBLANK)
 IF  (&O10¬= ' ')
     VER (&DSN10,NONBLANK)
 VER (&DSN1,DSNAME)
 VER (&DSN2,DSNAME)
 VER (&DSN3,DSNAME)
 VER (&DSN4,DSNAME)
 VER (&DSN5,DSNAME)
 VER (&DSN6,DSNAME)
 VER (&DSN7,DSNAME)
 VER (&DSN8,DSNAME)
 VER (&DSN9,DSNAME)
 VER (&DSN10,DSNAME)
)END
