//ZGXP30ZP JOB (),G.PRICE,CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID.,
//             REGION=2048K,COND=(0,NE)
//ASM     EXEC PGM=ASMA90,PARM='BATCH,OBJECT,NODECK,TERM'
//SYSTERM  DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=&SYSUID..CBT134.DATA,DISP=SHR
//         DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.MODGEN,DISP=SHR
//SYSLIN   DD  DSN=&&OBJECT,DISP=(NEW,PASS),UNIT=VIO,SPACE=(CYL,(1,1)),
//             DCB=(DSORG=PS,RECFM=FB,LRECL=80,BLKSIZE=4080)
//SYSUT1   DD  UNIT=VIO,SPACE=(CYL,(5,2))
//SYSIN    DD  DSN=&SYSUID..CBT134.DATA(ZAP),DISP=SHR
//LKED    EXEC PGM=IEWL,PARM='LIST,MAP,NCAL,REUS,AC=1'
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DSN=&&OBJECT,DISP=(OLD,DELETE)
//         DD  *
 ALIAS ZAP$
 NAME ZAP(R)
/*
//SYSUT1   DD  UNIT=VIO,SPACE=(CYL,(1,1))
//SYSLMOD  DD  DSN=&SYSUID..CBT135.LOAD,DISP=SHR
//
