Since this is an automation package I thought I'd include my automated shutdown

S SHUTDOWN

//SHUTDOWN PROC
//*
//STEP01  EXEC PGM=ASKOPER,
//     PARM=',,CONFIRM YOU WANT TO BRING THE SYSTEM DOWN(YES/NO)?'
//*
//* SHUTDOWN 1ST PART OF PRODUCTS
//*
//SHUTDOW1 EXEC PGM=IEBEDIT
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD DUMMY
//SYSUT1   DD DISP=SHR,DSN=SYS1.PARMLIB(SHUTDOW1)
//SYSUT2   DD SYSOUT=(Z,INTRDR)
//*
//* PAUSE 10 SECONDS
//PAUSE  EXEC PGM=PAUSE,PARM='0010'
//*
//* SHUTDOWN BALANCE OF SOFTWARE
//*
//SHUTDOW2 EXEC PGM=IEBEDIT
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD DUMMY
//SYSUT1   DD DISP=SHR,DSN=SYS1.PARMLIB(SHUTDOW2)
//SYSUT2   DD SYSOUT=(Z,INTRDR)
//*
//* PAUSE 10 SECONDS
//PAUSE  EXEC PGM=PAUSE,PARM='0010'
//*
//* SHUTDOWN BALANCE OF SOFTWARE
//*
//SHUTDOW2 EXEC PGM=IEBEDIT
//SYSPRINT DD SYSOUT=Z
//SYSIN    DD DUMMY
//SYSUT1   DD DISP=SHR,DSN=SYS1.PARMLIB(SHUTDOW3)
//SYSUT2   DD SYSOUT=(Z,INTRDR)

SYS1.PARMLIB(SHUTDOW1):
/*$VS,'F CA7TEST,/LOGON GLENN'
/*$VS,'= SHUTDOWN ALL'
/*$VS,'P TSO'
/*$VS,'F SEMAGENT,SHUTDOWN'
/*$VS,'F MIMTAPE,SHUTDOWN FREE'
/*$VS,'F MIMDASD,SHUTDOWN FREE'
/*$VS,'F EMCSCF,INI,SHUTDOWN'
/*$VS,'F JHSMAIN,Q'
/*$VS,'P RMSCTLT'
/*$VS,'P VTP'
/*$VS,'P VTPTEST'
/*$VS,'P ABNDTDCA'
/*$VS,'P ABNDSRV2'
/*$VS,'P ENF'
/*$VS,'P RMF'
/*$VS,'S STOPOM'
/*$VS,'P VPS'
/*$VS,'P VPSTEST'
/*$VS,'S AD10STOP'
/*$VS,'C FSS1'
/*$VS,'C FSS2'
/*$VS,'C FSS4'
/*$VS,'P SYSVIEW'
/*$VS,'P SYSVUSER'
/*$VS,'P ETFA'
/*$VS,'P DRS'
/*$VS,'F GSSA,STOP'
/*$VS,'F CMNP,SH,0'
/*$VS,'F CHGMANT,SH,0'
/*$VS,'P JHSMAIN'
/*$VS,'P LRSSERV'
/*$VS,'$PPRT1-1'
/*$VS,'F SEMAGENT,SHUTDOWN,IMM'
/*$VS,'+MQSPEPX STOP QMGR'
/*$VS,'P BBMXP'
/*$VS,'F XDSSPROC,SHUTDOWN'

SYS1.PARMLIB(SHUTDOW2):
/*$VS,'F CA7TEST,/SHUTDOWN'
/*$VS,'F CA7PROD,/SHUTDOWN'
/*$VS,'F DFHSM,STOP'
/*$VS,'.SHUTDOWN'
/*$VS,'P BBMCAS'
/*$VS,'C RVRD'
/*$VS,'P CA7ICOMT'
/*$VS,'P CA7ICOM'

SYS1.PARMLIB(SHUTDOW3):
/*$VS,'F CA7PROD,/SHUTDOWN'
/*$VS,'F CA7TEST,/SHUTDOWN'
/*$VS,'F DLF,MODE=QUIESCE'
/*$VS,'P VLF'
/*$VS,'P LLA'
/*$VS,'F BPXOINIT,SHUTDOWN=FORKINIT'
/*$VS,'F OMVS,SHUTDOWN'
/*$VS,'P FFST'
/*$VS,'P DLF'
/*$VS,'P TCPIP
/*$VS,'Z NET,QUICK'
