)attr default(%+_)
   ~ type(text) intens(high) color(&clrh) hilite(&clrhr)
   _ type( input) intens(low ) just(left ) hilite(uscore) color(&clrw )
   ` type(text) intens(low ) caps(off) just(asis ) color(&clrt)
   + type(text) intens(high) caps(off) just(asis ) color(&clrt)
   % type(text) intens(high) color(&clrw)
   ! type(output) intens(high) color(&clrw)
   @ type(text) intens(high) just(left ) color(&clrw)
   $ type(output) caps(off) just(left ) color(&clrt)
   # area(SCRL) Extend(ON)
)Body Expand(¨¨)
%Tutorial -¨-¨(~PDSE V2 Member Generations%)¨-¨- Tutorial
%Command ===>_ZCMD                                                             +
%
#help -------------------------------------------------------------------------#
)Area Help
% Startup Syntax
`
` To invoke PDSEGEN the syntax is:
`
`    %PDSEGEN dataset-name filter \ options
` or
`    %PDSEGEN dataset-name(filter)
`
`     dataset-name   A PDSE dataset name or *
`
`                    If * then a selection list of previously
`                    used datasets will be presented.
`
`                    If blank then a prompting panel will
`                    be presented to enter a dataset name.
`
`                    The PDSE dataset must be cataloged.
`
`     filter         An optional member filter
`                    (see the Filter tutorial for more info)
`
`     \              delineator for options
`
`     options        Edit
`                    - providing the filter has no mask then immediately
`                      edit the base member
`
)INIT
 .cursor = &zcmd
)PROC
 &ZUP = PDSEGH0
)END
/* Copyright (c) 2018 by Lionel B. Dyck */
/* GNU GENERAL PUBLIC LICENSE V3        */
