//jobname  JOB ,'SNTP',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*
//*--------------------------------------------------------------------*
//*        Set installation specific dataset names here...
//*--------------------------------------------------------------------*
//*
//         SET LIB=your.load.library
//*
//*--------------------------------------------------------------------*
//*        Go
//*--------------------------------------------------------------------*
//SNTP    EXEC PROC=TCPSNTP
//STEPLIB   DD DISP=SHR,DSN=&LIB
