//CAJ7083D JOB (UMVESWSP,CAJ7083),'JOHNSTON',
//         CLASS=A,MSGCLASS=X,NOTIFY=CAJ7083
//ASM      EXEC PGM=ASMA90,PARM='OBJECT,NODECK',REGION=1000K
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.MODGEN,DISP=SHR
//SYSLIN   DD  DSN=&&DATEOBJ,SPACE=(3040,(40,40),,,ROUND),UNIT=VIO,
//             DISP=(MOD,PASS),
//             DCB=(BLKSIZE=3040,LRECL=80,RECFM=FBS,BUFNO=1)
//SYSUT1   DD  DSN=&&SYSUT1,SPACE=(4096,(120,120),,,ROUND),UNIT=VIO,
//             DCB=BUFNO=1
//SYSPUNCH DD  DUMMY
//SYSIN    DD  DISP=SHR,DSN=UMV42.CAJ7083.SGSOURCE(SXNRSU09)
//LKED     EXEC PGM=IEWL,
//             PARM=(XREF,LIST,NCAL,LET)
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DSN=&&DATEOBJ,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSUT1   DD  UNIT=(SYSDA,SEP=(SYSLIN,SYSLMOD)),SPACE=(1024,(200,20))
//SYSLMOD  DD  DSN=&&SUBRLIB,DISP=(,PASS),
//             DCB=(RECFM=U,BLKSIZE=13030),
//             SPACE=(CYL,(1,,1)),UNIT=SYSDA
//SYSIN    DD  *
  ALIAS TIMERTNE
  ALIAS DATETIME
  ALIAS DATERTNE
  ALIAS DATERT
  NAME SXNRSU09(R)
/*
//ASM      EXEC PGM=ASMA90,PARM='OBJECT,NODECK',REGION=1000K
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.MODGEN,DISP=SHR
//SYSLIN   DD  DSN=&&SCANOBJ,SPACE=(3040,(40,40),,,ROUND),UNIT=VIO,
//             DISP=(MOD,PASS),
//             DCB=(BLKSIZE=3040,LRECL=80,RECFM=FBS,BUFNO=1)
//SYSUT1   DD  DSN=&&SYSUT1,SPACE=(4096,(120,120),,,ROUND),UNIT=VIO,
//             DCB=BUFNO=1
//SYSPUNCH DD  DUMMY
//SYSIN    DD  DISP=SHR,DSN=UMV42.CAJ7083.SGSOURCE(CXYPSCAN)
//LKED     EXEC PGM=IEWL,
//             PARM=(XREF,LIST,LET)
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=&&SUBRLIB,DISP=(OLD,DELETE)
//SYSLIN   DD  DSN=&&SCANOBJ,DISP=(OLD,DELETE)
//SYSUT1   DD  UNIT=(SYSDA,SEP=(SYSLIN,SYSLMOD)),SPACE=(1024,(200,20))
//*YSLMOD  DD  DSN=&&LOADSET(CXYPSCAN),DISP=(,PASS),
//*            DCB=(RECFM=U,BLKSIZE=23200),
//*            SPACE=(CYL,(1,,1)),UNIT=SYSDA
//SYSLMOD  DD  DISP=SHR,DSN=UMV42.CAJ7083.LOAD(CXYPSCAN)
