PROC 1 DSNAME PARM( ) LIST( )
CONTROL NOMSG
FREE FI(SYSPRINT,SYSIN,SYSUDUMP,PROC,INDEX,MESSAGE)
CONTROL MSG
WRITE ***********************************************
WRITE * THIS IS THE DESCOM WRITTEN PROGRAM CXYPSCAN.*
WRITE * IT SCANS FOR ARGUMENT STRINGS IN ANY PDS OR *
WRITE * SEQ FILE WITH F/FB/V/VB RECFM 50-255 LRECL. *
WRITE ***********************************************
ALLOC FI(PROC) DS('&DSNAME') SHR
ALLOC FI(SYSPRINT) SYSOUT(X) HOLD
ALLOC FI(INDEX)    SYSOUT(X) HOLD &LIST
ALLOC FI(MESSAGE)  SYSOUT(X) HOLD &LIST
ALLOC FI(SYSUDUMP) DUMMY
ALLOC FI(SYSIN) DS(*) SHR
WRITE TYPE IN LENGTH AND SEARCH ARGUMENT AFTER 01000
WRITE 01000LLXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
CALL 'UMV42.CAJ7083.LOAD(CXYPSCAN)' '&PARM'
FREE FI(MESSAGE INDEX SYSPRINT PROC)
