/* REXX */
ARG SOURCE CCLIST
CCBATCH = 'Y'
ADDRESS ISPEXEC "VPUT (CCLIST,CCBATCH) SHARED"
ADDRESS ISPEXEC "EDIT DATASET('"SOURCE"') MACRO(CC)"
ADDRESS ISPEXEC "VGET (CCRESULT) SHARED"
ZISPFRC = CCRESULT
ADDRESS ISPEXEC "VPUT (ZISPFRC) SHARED"
EXIT CCRESULT
