./ ADD NAME=$DOC     0100-20110-20110-2301-00016-00016-00000-BIXJCL  01
//*
//* This JCL library contains the following members:
//* ASMxxxxx will assemble source BXAxxxxx and link it into the
//*          load modules where it belongs
//* BLDxxxxx will link load module BXAxxxxx after assembling
//*          all sources that go into it
//* CRTxxxxx will create a load module required by the BLDxxxxx
//*          jobs
//* LKDxxxxx will link load module BXAxxxxx
//*
//* Special members:
//* $DOC     this member
//* BLDALL   will submit all BLDxxxxx jobs to create the complete
//*          OBJ lib and all load modules for the GOODIES.PROD libs
//* TSTxxxxx will run the various test programs
//*
./ ADD NAME=ASMCOPY  0100-20110-20110-2301-00015-00015-00000-BIXJCL  02
//ASMCOPY  JOB (7355,710,&SYSUID),'Assemble Source',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke assembler
//ASMCOPY  EXEC BXAASM,MEMB=BXACOPY,PROJ=GOODIES,LVL=PROD
//*
//* Compile ok? Invoke linkage editor
//         IF   (ASMCOPY.ASMPROD.RC LT 4) THEN
//LNKCOPY  EXEC BXALKED,MEMB=BXACOPY,PROJ=GOODIES,LVL=PROD
//         ENDIF
./ ADD NAME=ASMIO    0100-20110-20110-2301-00015-00015-00000-BIXJCL  02
//ASMIO    JOB (7355,710,&SYSUID),'Assemble Source',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke assembler
//ASMIO    EXEC BXAASM,MEMB=BXAIO,PROJ=GOODIES,LVL=PROD
//*
//* Compile ok? Invoke linkage editor
//         IF   (ASMIO.ASMPROD.RC LT 4) THEN
//LNKIO    EXEC BXALKED,MEMB=BXAIO,PROJ=GOODIES,LVL=PROD
//         ENDIF
./ ADD NAME=ASMIO00  0100-20110-20110-2301-00017-00017-00000-BIXJCL  02
//ASMIO00  JOB (7355,710,&SYSUID),'Assemble Source',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke assembler
//ASMIO00  EXEC BXAASM,MEMB=BXAIO00,PROJ=GOODIES,LVL=PROD,
//             PARM.ASMPROD=(OBJECT,NODECK,TERM,
//             'SYSPARM(NODEBUG,OPT)')
//*
//* Compile ok? Invoke linkage editor
//         IF   (ASMIO00.ASMPROD.RC LT 4) THEN
//LNKIO00  EXEC BXALKED,MEMB=BXAIO00,PROJ=GOODIES,LVL=PROD
//         ENDIF
./ ADD NAME=ASMLOWPG 0100-20110-20110-2301-00015-00015-00000-BIXJCL  02
//ASMLOWPG JOB (7355,710,&SYSUID),'Assemble Source',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke assembler
//ASMLOWPG EXEC BXAASM,MEMB=BXALOWPG,PROJ=GOODIES,LVL=PROD
//*
//* Compile ok? Invoke linkage editor
//         IF   (ASMLOWPG.ASMPROD.RC LT 4) THEN
//LNKLOWPG EXEC BXALKED,MEMB=BXALOWPG,PROJ=GOODIES,LVL=PROD
//         ENDIF
./ ADD NAME=ASMMAPS  0100-20110-20110-2301-00021-00021-00000-BIXJCL  02
//ASMMAPS  JOB (7355,710,&SYSUID),'Assemble Source',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke assembler - with BIXXAMS maclib added
//ASMMAPS  EXEC BXAASM,MEMB=BXAMAPS,PROJ=GOODIES,LVL=PROD
//ASMPROD.SYSLIB DD
//         DD
//         DD
//         DD
//         DD   DSN=&HLQ..BIXXAMS.PROD.MACLIB,DISP=SHR
//         DD   DSN=&HLQ..BIXXAMS.PROD.MACLIB,DISP=SHR
//*
//* Compile ok? Invoke linkage editor
//         IF   (ASMMAPS.ASMPROD.RC LT 4) THEN
//LNKMAPS  EXEC BXALKED,MEMB=BXAMAPS,PROJ=GOODIES,LVL=PROD
//         ENDIF
./ ADD NAME=ASMTEST  0100-20110-20110-2301-00015-00015-00000-BIXJCL  02
//ASMTEST  JOB (7355,710,&SYSUID),'Assemble Source',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke assembler
//ASMTEST  EXEC BXAASM,MEMB=BXATEST,PROJ=GOODIES,LVL=PROD
//*
//* Compile ok? Invoke linkage editor
//         IF   (ASMTEST.ASMPROD.RC LT 4) THEN
//LNKTEST  EXEC BXALKED,MEMB=BXATEST,PROJ=GOODIES,LVL=PROD
//         ENDIF
./ ADD NAME=ASMUNLD  0100-20110-20110-2301-00015-00015-00000-BIXJCL  02
//ASMUNLD  JOB (7355,710,&SYSUID),'Assemble Source',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke assembler
//ASMUNLD  EXEC BXAASM,MEMB=BXAUNLD,PROJ=GOODIES,LVL=PROD
//*
//* Compile ok? Invoke linkage editor
//         IF   (ASMUNLD.ASMPROD.RC LT 4) THEN
//LNKUNLD  EXEC BXALKED,MEMB=BXAUNLD,PROJ=GOODIES,LVL=PROD
//         ENDIF
./ ADD NAME=BLDALL   0100-20110-20110-2301-00024-00024-00000-BIXJCL  02
//BLDALL   JOB (7355,710,&SYSUID),'Build GOODIES',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//* Submit build-jobs for all GOODIES.PROD loadmods
//* DO need to submit CRT-jobs first: these loadmods might not yet
//*    exist in the GOODIES.PROD environment
//* DO make sure the JOB cards specify a class with only 1 initiator!
//*
//SUBMIT   EXEC PGM=IKJEFT1A
//SYSTSPRT DD   SYSOUT=*
//SYSTSIN  DD   *
           SUBMIT 'TCL2KOR.BXA.GOODIES.PROD.JCL(CRTCOPY)'
           SUBMIT 'TCL2KOR.BXA.GOODIES.PROD.JCL(CRTTEST)'
           SUBMIT 'TCL2KOR.BXA.GOODIES.PROD.JCL(BLDIO)'
           SUBMIT 'TCL2KOR.BXA.GOODIES.PROD.JCL(BLDIO00)'
           SUBMIT 'TCL2KOR.BXA.GOODIES.PROD.JCL(BLDLOWPG)'
           SUBMIT 'TCL2KOR.BXA.GOODIES.PROD.JCL(BLDMAPS)'
           SUBMIT 'TCL2KOR.BXA.GOODIES.PROD.JCL(BLDUNLD)'
/*
./ ADD NAME=BLDCOPY  0100-20110-20110-2301-00011-00011-00000-BIXJCL  02
//BLDCOPY  JOB (7355,710,&SYSUID),'Build Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//* Create objects and loadmod
//ASMCOPY  EXEC BXAASM,MEMB=BXACOPY,PROJ=GOODIES,LVL=PROD
//LKDCOPY  EXEC BXALKED,MEMB=BXACOPY,PROJ=GOODIES,LVL=PROD
./ ADD NAME=BLDIO    0100-20110-20110-2301-00011-00011-00000-BIXJCL  02
//BLDIO    JOB (7355,710,&SYSUID),'Build Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//* Create objects and loadmod
//ASMIO    EXEC BXAASM,MEMB=BXAIO,PROJ=GOODIES,LVL=PROD
//LKDIO    EXEC BXALKED,MEMB=BXAIO,PROJ=GOODIES,LVL=PROD
./ ADD NAME=BLDIO00  0100-20110-20110-2301-00012-00012-00000-BIXJCL  02
//BLDIO00  JOB (7355,710,&SYSUID),'Build Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//* Create objects and loadmod
//ASMIO00  EXEC BXAASM,MEMB=BXAIO00,PROJ=GOODIES,LVL=PROD,
//             PARM.ASMPROD=(OBJECT,NODECK,TERM,'SYSPARM(NODEBUG,OPT)')
//LKDIO00  EXEC BXALKED,MEMB=BXAIO00,PROJ=GOODIES,LVL=PROD
./ ADD NAME=BLDLOWPG 0100-20110-20110-2301-00011-00011-00000-BIXJCL  02
//BLDLOWPG JOB (7355,710,&SYSUID),'Build Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//* Create objects and loadmod
//ASMLOWPG EXEC BXAASM,MEMB=BXALOWPG,PROJ=GOODIES,LVL=PROD
//LKDLOWPG EXEC BXALKED,MEMB=BXALOWPG,PROJ=GOODIES,LVL=PROD
./ ADD NAME=BLDMAPS  0100-20110-20110-2301-00017-00017-00000-BIXJCL  02
//BLDMAPS  JOB (7355,710,&SYSUID),'Build Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//* Create objects and loadmod
//ASMMAPS  EXEC BXAASM,MEMB=BXAMAPS,PROJ=GOODIES,LVL=PROD
//ASMPROD.SYSLIB DD
//         DD
//         DD
//         DD
//         DD   DSN=&HLQ..BIXXAMS.PROD.MACLIB,DISP=SHR
//         DD   DSN=&HLQ..BIXXAMS.PROD.MACLIB,DISP=SHR
//LKDMAPS  EXEC BXALKED,MEMB=BXAMAPS,PROJ=GOODIES,LVL=PROD
./ ADD NAME=BLDTEST  0100-20110-20110-2301-00011-00011-00000-BIXJCL  02
//BLDTEST  JOB (7355,710,&SYSUID),'Build Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//* Create objects and loadmod
//ASMTEST  EXEC BXAASM,MEMB=BXATEST,PROJ=GOODIES,LVL=PROD
//LKDTEST  EXEC BXALKED,MEMB=BXATEST,PROJ=GOODIES,LVL=PROD
./ ADD NAME=BLDUNLD  0100-20110-20110-2301-00011-00011-00000-BIXJCL  02
//BLDUNLD  JOB (7355,710,&SYSUID),'Build Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//* Create objects and loadmod
//ASMUNLD  EXEC BXAASM,MEMB=BXAUNLD,PROJ=GOODIES,LVL=PROD
//LKDUNLD  EXEC BXALKED,MEMB=BXAUNLD,PROJ=GOODIES,LVL=PROD
./ ADD NAME=CRTCOPY  0100-20110-20110-2301-00011-00011-00000-BIXJCL  02
//CRTCOPY  JOB (7355,710,&SYSUID),'Create Initial',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//* Create object and loadmod for BX8COPY
//ASMCOPY  EXEC BXAASMA,MEMB=BXACOPY,PROJ=GOODIES,LVL=PROD
//LKDCOPY  EXEC BXAIEWL,MEMB=BXACOPY,PROJ=GOODIES,LVL=PROD
./ ADD NAME=CRTTEST  0100-20110-20110-2301-00011-00011-00000-BIXJCL  02
//CRTTEST  JOB (7355,710,&SYSUID),'Create Initial',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//* Create object and loadmod for BX8TEST
//ASMTEST  EXEC BXAASMA,MEMB=BXATEST,PROJ=GOODIES,LVL=PROD
//LKDTEST  EXEC BXAIEWL,MEMB=BXATEST,PROJ=GOODIES,LVL=PROD
./ ADD NAME=LKDCOPY  0100-20110-20110-2301-00010-00010-00000-BIXJCL  02
//LKDCOPY  JOB (7355,710,&SYSUID),'Linkedit Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke linkage editor
//LKDCOPY  EXEC BXALKED,MEMB=BXACOPY,PROJ=GOODIES,LVL=PROD
./ ADD NAME=LKDIO    0100-20110-20110-2301-00010-00010-00000-BIXJCL  02
//LKDIO    JOB (7355,710,&SYSUID),'Linkedit Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke linkage editor
//LKDIO    EXEC BXALKED,MEMB=BXAIO,PROJ=GOODIES,LVL=PROD
./ ADD NAME=LKDIO00  0100-20110-20110-2301-00010-00010-00000-BIXJCL  02
//LKDIO00  JOB (7355,710,&SYSUID),'Linkedit Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke linkage editor
//LKDIO00  EXEC BXALKED,MEMB=BXAIO00,PROJ=GOODIES,LVL=PROD
./ ADD NAME=LKDLOWPG 0100-20110-20110-2301-00010-00010-00000-BIXJCL  02
//LKDLOWPG JOB (7355,710,&SYSUID),'Linkedit Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke linkage editor
//LKDLOWPG EXEC BXALKED,MEMB=BXALOWPG,PROJ=GOODIES,LVL=PROD
./ ADD NAME=LKDMAPS  0100-20110-20110-2301-00010-00010-00000-BIXJCL  02
//LKDMAPS  JOB (7355,710,&SYSUID),'Linkedit Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke linkage editor
//LKDMAPS  EXEC BXALKED,MEMB=BXAMAPS,PROJ=GOODIES,LVL=PROD
./ ADD NAME=LKDTEST  0100-20110-20110-2301-00010-00010-00000-BIXJCL  02
//LKDTEST  JOB (7355,710,&SYSUID),'Linkedit Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke linkage editor
//LKDTEST  EXEC BXALKED,MEMB=BXATEST,PROJ=GOODIES,LVL=PROD
./ ADD NAME=LKDUNLD  0100-20110-20110-2301-00010-00010-00000-BIXJCL  02
//LKDUNLD  JOB (7355,710,&SYSUID),'Linkedit Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//BXAPROCS JCLLIB ORDER=(&HLQ..GOODIES.TEST.PROCLIB,
//             &HLQ..GOODIES.PROD.PROCLIB)
//*
//*             Invoke linkage editor
//LKDUNLD  EXEC BXALKED,MEMB=BXAUNLD,PROJ=GOODIES,LVL=PROD
./ ADD NAME=TSTCOPY  0100-20110-20110-2301-00022-00022-00000-BIXJCL  02
//TSTCOPY  JOB (7355,710,&SYSUID),'Test Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//JOBLIB   DD   DSN=&HLQ..GOODIES.PROD.LINKLIB,DISP=SHR
//*
//* Test BPAM member copy
//BXACOPYP EXEC PGM=BXACOPY,PARM='MEMBER=TSTCOPY'
//SYSUDUMP DD   SYSOUT=*
//INPUT    DD   DSN=&HLQ..GOODIES.TEST.JCL,DISP=SHR
//         DD   DSN=&HLQ..GOODIES.PROD.JCL,DISP=SHR
//OUTPUT   DD   DSN=&&JCLMEM1,SPACE=(TRK,(10,10),RLSE),
//             DCB=(LRECL=80,BLKSIZE=27920),UNIT=SYSALLDA
//*
//* Test BSAM concatenation copy
//BXACOPY  EXEC PGM=BXACOPY,PARM='DATSET=PS'
//SYSUDUMP DD   SYSOUT=*
//INPUT    DD   DSN=&HLQ..GOODIES.TEST.JCL(TSTCOPY),DISP=SHR
//         DD   DSN=&HLQ..GOODIES.PROD.JCL(TSTCOPY),DISP=SHR
//OUTPUT   DD   DSN=&&JCLMEM2,SPACE=(TRK,(10,10),RLSE),
//             DCB=(LRECL=80,BLKSIZE=27920),UNIT=SYSALLDA
./ ADD NAME=TSTLOWPG 0100-20110-20110-2301-00009-00009-00000-BIXJCL  02
//TSTLOWPG JOB (7355,710,&SYSUID),'Test Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//JOBLIB   DD   DSN=&HLQ..GOODIES.PROD.LINKLIB,DISP=SHR
//BXALOWPG EXEC PGM=BXALOWPG
//BXASNAP  DD   SYSOUT=*
//SYSUDUMP DD   SYSOUT=*
./ ADD NAME=TSTMAPS  0100-20110-20110-2301-00009-00009-00000-BIXJCL  02
//TSTMAPS  JOB (7355,710,&SYSUID),'Test Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//JOBLIB   DD   DSN=&HLQ..GOODIES.PROD.LINKLIB,DISP=SHR
//BXAMAPS  EXEC PGM=BXAMAPS
//BXASNAP  DD   SYSOUT=*
//SYSUDUMP DD   SYSOUT=*
./ ADD NAME=TSTUNLD  0100-20110-20110-2301-00015-00015-00000-BIXJCL  02
//TSTUNLD  JOB (7355,710,&SYSUID),'Test Loadmod',NOTIFY=&SYSUID,
//             CLASS=5,MSGCLASS=T,MSGLEVEL=(1,1),REGION=0M
//*
//         SET  HLQ=TCL2KOR.BXA          High Level Qualifiers
//*
//JOBLIB   DD   DSN=&HLQ..GOODIES.PROD.LINKLIB,DISP=SHR
//*
//DELETE   EXEC PGM=IEFBR14
//EHRMAN   DD   DSN=&HLQ..EHRMAN.UNLOAD,DISP=(OLD,DELETE,DELETE)
//*
//BXAUNLD  EXEC PGM=BXAUNLD,PARM='EHRMAN'
//SYSUT1   DD   DSN=&HLQ..EHRMAN.PROD.ASM,DISP=OLD
//SYSUT2   DD   DSN=&HLQ..EHRMAN.UNLOAD,DISP=(NEW,CATLG,CATLG),
//             SPACE=(TRK,(10,10),RLSE),UNIT=SYSALLDA,
//             DCB=(LRECL=80,BLKSIZE=27920,RECFM=FB)
