//TRACEFMT JOB ,&SYSUID,NOTIFY=&SYSUID,
//    CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//    REGION=0M
//FORMAT  EXEC PGM=ARCPRPDO
//SYSPRINT DD SYSOUT=*
//ARCMSG   DD SYSOUT=*
//ARCPDO   DD DSN=MVSHSM.HSMPDOX,DISP=SHR
//ARCPRINT DD SYSOUT=*
 FORMAT
