         COPY  PDPTOP
         CSECT
* Program text area
@@LC0    EQU   *
         DC    C'<stdin>'
         DC    X'0'
@@LC1    EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* S-func do_SUBST prologue
@@0      PDPPRLG CINDEX=0,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function do_SUBST code
         L     6,0(11)
         L     5,4(11)
         L     4,0(6)
         CLR   4,5
         BE    @@L1
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L9
@@L3     EQU   *
         L     2,=A(@@1)
         L     15,4(2)
         LTR   15,15
         BE    @@L7
         MVC   4(4,2),0(15)
@@L8     EQU   *
         MVC   4(4,15),=F'0'
         ST    6,12(15)
         ST    4,8(15)
         ST    5,0(6)
         L     2,=A(@@1)
         MVC   0(4,15),0(2)
         ST    15,0(2)
         B     @@L1
@@L7     EQU   *
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         B     @@L8
@@L9     EQU   *
         LH    2,0(5)
         CLM   2,3,=H'54'
         BNE   @@L3
         MVC   88(4,13),4(5)
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         L     2,4(5)
         CLR   2,15
         BE    @@L4
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'439'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L4     EQU   *
         LH    2,0(4)
         CLM   2,3,=H'63'
         BE    @@L6
         CLM   2,3,=H'121'
         BNE   @@L3
@@L6     EQU   *
         L     2,4(4)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L3
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'451'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L3
@@L1     EQU   *
* Function do_SUBST epilogue
         PDPEPIL
* Function do_SUBST literal pool
         DS    0F
         LTORG
* Function do_SUBST page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
         DS    0F
* S-func do_SUBST_INT prologue
@@2      PDPPRLG CINDEX=1,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function do_SUBST_INT code
         L     3,0(11)
         L     5,4(11)
         L     4,0(3)
         CLR   4,5
         BE    @@L10
         L     2,=A(@@1)
         L     15,4(2)
         LTR   15,15
         BE    @@L12
         MVC   4(4,2),0(15)
@@L13    EQU   *
         MVC   4(4,15),=F'1'
         ST    3,12(15)
         ST    4,8(15)
         ST    5,0(3)
         L     2,=A(@@1)
         MVC   0(4,15),0(2)
         ST    15,0(2)
         B     @@L10
@@L12    EQU   *
         MVC   88(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         B     @@L13
@@L10    EQU   *
* Function do_SUBST_INT epilogue
         PDPEPIL
* Function do_SUBST_INT literal pool
         DS    0F
         LTORG
* Function do_SUBST_INT page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
         DS    0F
* X-func combinst prologue
COMBINST PDPPRLG CINDEX=2,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function combinst code
         L     8,0(11)
         L     4,4(11)
         SLR   5,5
         ST    5,104(13)
         L     2,=A(@@3)
         ST    5,0(2)
         L     2,=A(@@4)
         ST    5,0(2)
         L     2,=A(@@5)
         ST    5,0(2)
         L     2,=A(@@6)
         ST    5,0(2)
         L     2,=A(@@7)
         ST    4,0(2)
         ST    4,88(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     2,=A(@@8)
         ST    15,0(2)
         ST    4,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     2,=A(@@9)
         ST    15,0(2)
         LR    3,4
         MH    3,=H'4'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@10)
         ST    15,0(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@11)
         ST    15,0(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@12)
         ST    15,0(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@13)
         ST    15,0(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@14)
         ST    15,0(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@15)
         ST    15,0(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@16)
         ST    15,0(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@17)
         ST    15,0(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@18)
         ST    15,0(2)
         LA    1,88(,13)
         L     15,=A(@@19)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(IRECNOV)
         BALR  14,15
         LR    6,8
         LTR   8,8
         BE    @@L99
@@L20    EQU   *
         L     2,4(6)
         CR    2,5
         BNH   @@L17
         LR    5,2
@@L17    EQU   *
         L     6,12(6)
         LTR   6,6
         BNE   @@L20
@@L99    EQU   *
         LR    2,5
         MH    2,=H'4'
         A     2,=F'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@20)
         ST    15,0(2)
         L     2,=A(@@21)
         ST    5,0(2)
         MVC   88(4,13),=F'32'
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(MODFRSIZ)
         BALR  14,15
         L     2,=A(@@22)
         ST    15,0(2)
         L     2,=A(@@23)
         MVC   0(4,2),=F'0'
         L     2,=A(@@24)
         MVC   0(4,2),=F'1'
         L     2,=A(@@25)
         MVC   0(4,2),=F'0'
         LA    1,88(,13)
         L     15,=A(@@26)
         BALR  14,15
         L     2,=V(N@BASIC@)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(SBALLOC)
         BALR  14,15
         L     2,=A(@@27)
         ST    15,0(2)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(SBZERO)
         BALR  14,15
         L     2,=A(@@28)
         MVC   0(4,2),=F'0'
         LR    6,8
         SLR   5,5
         LTR   8,8
         BE    @@L101
@@L27    EQU   *
         L     2,=A(@@20)
         L     3,0(2)
         L     2,4(6)
         SLL   2,2
         A     5,=F'1'
         ST    5,0(2,3)
         L     2,=A(@@29)
         ST    5,0(2)
         L     2,=A(@@30)
         ST    6,0(2)
         LH    3,0(6)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L119)
         BER   14
@@L25    EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'36'
         L     14,=A(@@L120)
         BER   14
@@L23    EQU   *
         L     12,0(,10)
         L     6,12(6)
         LTR   6,6
         BNE   @@L27
@@L101   EQU   *
         L     2,=A(@@23)
         MVC   0(4,2),=F'1'
         L     2,=A(@@33)
         MVC   0(4,2),=F'-1'
         L     2,=A(@@24)
         MVC   0(4,2),=F'1'
         L     2,=A(@@34)
         MVC   0(4,2),=F'0'
         L     2,=A(@@35)
         MVC   0(4,2),=F'0'
         LA    1,88(,13)
         L     15,=A(@@19)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@26)
         BALR  14,15
         LR    6,8
         LTR   8,8
         BE    @@L103
@@L91    EQU   *
         SLR   7,7
         L     5,=A(@@33)
         L     3,0(5)
         LR    4,3
         A     4,=F'1'
         L     2,=V(N@BASIC@)
         C     4,0(2)
         BNL   @@L32
         MH    3,=H'4'
         L     2,=V(BBINFO)
         A     3,0(2)
         L     2,20(3)
         L     2,0(2)
         CLR   2,6
         L     14,=A(@@L121)
         BER   14
@@L32    EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'36'
         L     14,=A(@@L122)
         BER   14
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L123
@@L41    EQU   *
@@L30    EQU   *
         L     12,0(,10)
         LTR   7,7
         BE    @@L124
         LR    6,7
@@L28    EQU   *
         LTR   6,6
         BNE   @@L91
@@L103   EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@N)
         BALR  14,15
         L     2,=A(@@28)
         L     2,0(2)
         LTR   2,2
         BNE   @@L125
@@L92    EQU   *
         L     2,=A(@@27)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@8)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@9)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@10)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@11)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@12)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@13)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@14)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@15)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@16)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@17)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@18)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@20)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@1)
         L     3,4(2)
         LTR   3,3
         L     14,=A(@@L118)
         BER   14
@@L97    EQU   *
         L     2,0(3)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    3,2
         LTR   2,2
         BNE   @@L97
         L     14,=A(@@L118)
         BR    14
@@L125   EQU   *
         L     2,=A(@@27)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(UPDATE@L)
         BALR  14,15
         B     @@L92
@@L124   EQU   *
         L     6,12(6)
         B     @@L28
@@L123   EQU   *
         ST    6,88(13)
         MVC   92(4,13),16(6)
         LA    1,88(,13)
         L     15,=A(@@36)
         BALR  14,15
         L     4,24(6)
         LTR   4,4
         BE    @@L105
@@L42    EQU   *
         ST    6,88(13)
         MVC   92(4,13),4(4)
         MVC   96(4,13),=F'0'
         LA    2,104(,13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNE   @@L30
         L     4,8(4)
         LTR   4,4
         BNE   @@L42
@@L105   EQU   *
         L     4,24(6)
         LTR   4,4
         BE    @@L107
@@L54    EQU   *
         L     5,4(4)
         LH    2,0(5)
         CLM   2,3,=H'37'
         BE    @@L45
         L     3,24(5)
         LTR   3,3
         BE    @@L45
@@L53    EQU   *
         ST    6,88(13)
         ST    5,92(13)
         MVC   96(4,13),4(3)
         LA    2,104(,13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNE   @@L30
         L     3,8(3)
         LTR   3,3
         BNE   @@L53
@@L45    EQU   *
         L     4,8(4)
         LTR   4,4
         BNE   @@L54
@@L107   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'33'
         BE    @@L126
@@L55    EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'32'
         BE    @@L127
@@L63    EQU   *
         L     4,24(6)
         LTR   4,4
         BE    @@L112
@@L76    EQU   *
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'32'
         BE    @@L128
@@L73    EQU   *
         L     4,8(4)
         LTR   4,4
         BNE   @@L76
@@L112   EQU   *
         L     4,24(6)
         LTR   4,4
         BE    @@L114
@@L87    EQU   *
         L     3,8(4)
         LTR   3,3
         BE    @@L116
@@L86    EQU   *
         ST    6,88(13)
         MVC   92(4,13),4(4)
         MVC   96(4,13),4(3)
         LA    2,104(,13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNE   @@L30
         L     3,8(3)
         LTR   3,3
         BNE   @@L86
@@L116   EQU   *
         L     4,8(4)
         LTR   4,4
         BNE   @@L87
@@L114   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'37'
         BE    @@L30
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@32)
         BALR  14,15
         B     @@L30
@@L128   EQU   *
         L     2,16(3)
         LH    2,0(2)
         CLM   2,3,=H'47'
         BNE   @@L73
         L     2,=V(GLBRTL)
         MVC   88(4,13),4(2)
         L     2,4(4)
         L     2,16(2)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L73
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L73
         LH    2,0(15)
         CLM   2,3,=H'32'
         BNE   @@L73
         MVC   88(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         BE    @@L73
         ST    6,88(13)
         MVC   92(4,13),4(4)
         ST    5,96(13)
         LA    2,104(,13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BE    @@L73
         B     @@L30
@@L127   EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L63
         LH    2,0(15)
         CLM   2,3,=H'32'
         BNE   @@L63
         MVC   88(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         BE    @@L63
         L     2,16(6)
         LH    2,0(2)
         CLM   2,3,=H'47'
         BNE   @@L63
         L     2,=V(GLBRTL)
         MVC   88(4,13),4(2)
         L     2,16(6)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L63
         ST    6,88(13)
         ST    5,92(13)
         MVC   96(4,13),=F'0'
         LA    2,104(,13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNE   @@L30
         L     3,24(5)
         LTR   3,3
         BE    @@L63
@@L70    EQU   *
         ST    6,88(13)
         ST    5,92(13)
         MVC   96(4,13),4(3)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNE   @@L30
         L     3,8(3)
         LTR   3,3
         BNE   @@L70
         B     @@L63
@@L126   EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L55
         LH    2,0(15)
         CLM   2,3,=H'32'
         BNE   @@L55
         MVC   88(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         BE    @@L55
         ST    6,88(13)
         ST    5,92(13)
         MVC   96(4,13),=F'0'
         LA    2,104(,13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNE   @@L30
         L     3,24(5)
         LTR   3,3
         BE    @@L55
@@L62    EQU   *
         ST    6,88(13)
         ST    5,92(13)
         MVC   96(4,13),4(3)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNE   @@L30
         L     3,8(3)
         LTR   3,3
         BNE   @@L62
         B     @@L55
@@L122   EQU   *
         L     3,=A(@@24)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         B     @@L30
@@L121   EQU   *
         ST    4,0(5)
         B     @@L32
@@L120   EQU   *
         L     3,=A(@@24)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         B     @@L23
@@L119   EQU   *
         MVC   88(4,13),16(6)
         MVC   92(4,13),=A(@@31)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(NOTE@STO)
         BALR  14,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@32)
         BALR  14,15
         B     @@L25
@@L118   EQU   *
         L     2,=A(@@1)
         MVC   4(4,2),=F'0'
         L     3,=A(@@38)
         L     2,=A(@@3)
         L     4,0(3)
         A     4,0(2)
         ST    4,0(3)
         L     3,=A(@@39)
         L     2,=A(@@4)
         L     4,0(3)
         A     4,0(2)
         ST    4,0(3)
         L     3,=A(@@40)
         L     2,=A(@@5)
         L     4,0(3)
         A     4,0(2)
         ST    4,0(3)
         L     3,=A(@@41)
         L     2,=A(@@6)
         L     4,0(3)
         A     4,0(2)
         ST    4,0(3)
         L     2,=A(@@23)
         MVC   0(4,2),=F'0'
         LA    1,88(,13)
         L     15,=V(IRECOG)
         BALR  14,15
         L     15,104(13)
* Function combinst epilogue
         PDPEPIL
* Function combinst literal pool
         DS    0F
         LTORG
* Function combinst page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
         DS    0F
* S-func init_reg_last_arrays prologue
@@19     PDPPRLG CINDEX=3,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function init_reg_last_arrays code
         L     2,=A(@@7)
         L     4,0(2)
         L     2,=A(@@10)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         LR    3,4
         MH    3,=H'4'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     2,=A(@@11)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     2,=A(@@12)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     2,=A(@@13)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     2,=A(@@14)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     2,=A(@@15)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     2,=A(@@16)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     2,=A(@@17)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     2,=A(@@18)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
* Function init_reg_last_arrays epilogue
         PDPEPIL
* Function init_reg_last_arrays literal pool
         DS    0F
         LTORG
* Function init_reg_last_arrays page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
         DS    0F
* S-func setup_incoming_promotions prologue
@@26     PDPPRLG CINDEX=4,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN4
         LTORG
@@FEN4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         LR    11,1
         L     10,=A(@@PGT4)
* Function setup_incoming_promotions code
* Function setup_incoming_promotions epilogue
         PDPEPIL
* Function setup_incoming_promotions literal pool
         DS    0F
         LTORG
* Function setup_incoming_promotions page table
         DS    0F
@@PGT4   EQU   *
         DC    A(@@PG4)
         DS    0F
* S-func set_nonzero_bits_and_sign_copies prologue
@@31     PDPPRLG CINDEX=5,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN5
         LTORG
@@FEN5   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         LR    11,1
         L     10,=A(@@PGT5)
* Function set_nonzero_bits_and_sign_copies code
         L     7,0(11)
         L     6,4(11)
         LH    2,0(7)
         CLM   2,3,=H'61'
         BNE   @@L131
         L     3,4(7)
         LA    2,19(0,0)
         CLR   3,2
         BNH   @@L131
         L     2,=V(BBINFO)
         L     2,0(2)
         L     2,16(2)
         MVC   88(4,13),32(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   @@L131
         SLR   5,5
         IC    5,2(7)
         LR    2,5
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L131
         LTR   6,6
         BE    @@L134
         LH    2,0(6)
         CLM   2,3,=H'49'
         BE    @@L134
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@42)
         BALR  14,15
         LR    6,15
         L     3,4(15)
         CLR   3,7
         BE    @@L136
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L142
@@L135   EQU   *
         L     2,=A(@@8)
         L     5,0(2)
         L     4,4(7)
         SLL   4,2
         SLR   2,2
         IC    2,2(7)
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     2,0(2,3)
         ST    2,0(4,5)
@@L141   EQU   *
         L     2,=A(@@9)
         L     3,0(2)
         L     2,4(7)
         LA    4,1(0,0)
         STC   4,0(2,3)
         B     @@L131
@@L142   EQU   *
         L     4,=V(MODE@SIZ)
         SLR   2,2
         IC    2,2(3)
         L     5,4(3)
         SLR   3,3
         IC    3,2(5)
         IC    2,0(4,2)
         IC    4,0(4,3)
         STC   4,80(,13)
         CLM   2,1,80(13)
         BNH   @@L135
         CLR   5,7
         BNE   @@L135
@@L136   EQU   *
         L     5,8(6)
         L     2,=A(@@8)
         L     4,0(2)
         L     3,4(7)
         SLL   3,2
         L     2,0(3,4)
         L     8,=F'-1'
         CLR   2,8
         BE    @@L137
         ST    5,88(13)
         L     2,=A(@@22)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         O     15,0(3,4)
         ST    15,0(3,4)
@@L137   EQU   *
         MVC   88(4,13),8(6)
         SLR   2,2
         IC    2,2(7)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         L     2,=A(@@9)
         L     4,0(2)
         L     3,4(7)
         IC    2,0(3,4)
         CLM   2,1,=XL1'00'
         BE    @@L139
         N     2,=XL4'000000FF'
         CLR   2,15
         BNH   @@L131
@@L139   EQU   *
         STC   15,0(3,4)
         B     @@L131
@@L134   EQU   *
         L     2,=A(@@8)
         L     4,0(2)
         L     3,4(7)
         SLL   3,2
         MH    5,=H'4'
         L     2,=V(MODE@MAS)
         L     5,0(5,2)
         ST    5,0(3,4)
         B     @@L141
@@L131   EQU   *
* Function set_nonzero_bits_and_sign_copies epilogue
         PDPEPIL
* Function set_nonzero_bits_and_sign_copies literal pool
         DS    0F
         LTORG
* Function set_nonzero_bits_and_sign_copies page table
         DS    0F
@@PGT5   EQU   *
         DC    A(@@PG5)
         DS    0F
* S-func can_combine_p prologue
@@45     PDPPRLG CINDEX=6,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN6
         LTORG
@@FEN6   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG6    EQU   *
         LR    11,1
         L     10,=A(@@PGT6)
* Function can_combine_p code
         SLR   8,8
         L     2,12(11)
         LTR   2,2
         L     14,=A(@@L144)
         BER   14
         ST    8,104(13)
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(NEXT@ACT)
         BALR  14,15
         CLR   15,2
         L     14,=A(@@L236)
         BER   14
@@L145   EQU   *
         L     12,0(,10)
         L     3,0(11)
         L     2,16(3)
         LH    3,0(2)
         CLM   3,3,=H'47'
         L     14,=A(@@L237)
         BER   14
         CLM   3,3,=H'39'
         BE    @@L238
@@L233   EQU   *
         L     12,0(,10)
         SLR   3,3
         L     14,=A(@@L143)
         BR    14
@@L238   EQU   *
         L     3,4(2)
         L     2,4(3)
         LH    2,0(2)
         CH    2,=H'47'
         BNE   @@L233
         SLR   7,7
         C     7,0(3)
         BNL   @@L226
@@L172   EQU   *
         L     4,0(11)
         L     2,16(4)
         L     3,4(2)
         LR    2,7
         MH    2,=H'4'
         L     6,4(2,3)
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         LA    3,48(0,0)
         CLR   2,3
         L     14,=A(@@L156)
         BER   14
         L     14,=A(@@L171)
         BHR   14
         LA    4,47(0,0)
         CLR   2,4
         BNE   @@L233
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'10'
         MVC   96(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L240)
         BNER  14
@@L167   EQU   *
         L     12,0(,10)
         SLR   3,3
         LTR   8,8
         L     14,=A(@@L143)
         BNER  14
         LR    8,6
@@L153   EQU   *
         L     12,0(,10)
         A     7,=F'1'
         L     4,0(11)
         L     2,16(4)
         L     2,4(2)
         C     7,0(2)
         BL    @@L172
@@L226   EQU   *
         LTR   8,8
         BE    @@L233
         L     2,8(8)
         LH    2,0(2)
         CLM   2,3,=H'41'
         BE    @@L233
@@L149   EQU   *
         L     12,0(,10)
         LR    3,8
         LTR   8,8
         L     14,=A(@@L143)
         BER   14
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@42)
         BALR  14,15
         L     6,8(15)
         L     5,4(15)
         L     2,=V(GLBRTL)
         CL    5,8(2)
         BE    @@L233
         LH    2,0(5)
         CLM   2,3,=H'133'
         BE    @@L233
         CLM   2,3,=H'64'
         BE    @@L233
         ST    6,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L241)
         BNER  14
@@L179   EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'41'
         BE    @@L233
         CLM   2,3,=H'50'
         BE    @@L233
         L     3,4(11)
         LH    2,0(3)
         CLM   2,3,=H'34'
         L     14,=A(@@L242)
         BER   14
@@L180   EQU   *
         L     12,0(,10)
         L     2,12(11)
         LTR   2,2
         BE    @@L181
         L     3,104(13)
         LTR   3,3
         L     14,=A(@@L243)
         BER   14
@@L181   EQU   *
         L     12,0(,10)
         L     4,104(13)
         LTR   4,4
         BNE   @@L182
         LH    2,0(6)
         CH    2,=H'66'
         L     14,=A(@@L244)
         BER   14
@@L184   EQU   *
         L     12,0(,10)
         L     2,0(11)
         L     15,4(2)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L245)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L186   EQU   *
         L     12,0(,10)
         ST    6,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@47)
         BALR  14,15
         LTR   15,15
         BNE   @@L233
@@L183   EQU   *
         L     12,0(,10)
         L     2,0(6)
         N     2,=F'-65520'
         L     3,=F'2686992'
         CLR   2,3
         BE    @@L233
         LH    2,0(6)
         CLM   2,3,=H'43'
         BE    @@L233
@@L182   EQU   *
         MVC   88(4,13),4(11)
         MVC   92(4,13),=F'9'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L233
         L     4,12(11)
         LTR   4,4
         BE    @@L187
         ST    4,88(13)
         MVC   92(4,13),=F'9'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L233
@@L187   EQU   *
         L     2,0(11)
         L     3,4(2)
         L     2,=A(@@21)
         C     3,0(2)
         BH    @@L246
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         L     3,0(3,2)
         L     2,=A(@@34)
         C     3,0(2)
         BNL   @@L177
@@L189   EQU   *
         LH    3,0(6)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L177
         CLM   3,3,=H'54'
         BE    @@L177
         CLM   3,3,=H'55'
         BE    @@L177
         CLM   3,3,=H'58'
         BE    @@L177
         CLM   3,3,=H'134'
         BE    @@L177
         CLM   3,3,=H'56'
         BE    @@L177
         CLM   3,3,=H'140'
         BNE   @@L233
@@L177   EQU   *
         LH    2,0(5)
         CLM   2,3,=H'61'
         BE    @@L247
         SLR   3,3
         CLM   2,3,=H'69'
         L     14,=A(@@L143)
         BNER  14
@@L198   EQU   *
         L     2,4(11)
         L     3,16(2)
         LH    2,0(3)
         CLM   2,3,=H'39'
         BE    @@L248
@@L200   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'41'
         BE    @@L209
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(VOLREFP)
         BALR  14,15
         LTR   15,15
         BE    @@L208
@@L209   EQU   *
         L     4,12(11)
         LTR   4,4
         BE    @@L210
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(VOLREFP)
         BALR  14,15
         SLR   3,3
         LTR   15,15
         L     14,=A(@@L143)
         BNER  14
@@L210   EQU   *
         L     2,0(11)
         L     4,12(2)
         CL    4,4(11)
         BE    @@L208
@@L216   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L249
@@L213   EQU   *
         L     4,12(4)
         CL    4,4(11)
         BNE   @@L216
@@L208   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'41'
         BE    @@L250
@@L217   EQU   *
         L     2,0(11)
         L     4,12(2)
         CL    4,4(11)
         BE    @@L230
@@L223   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L251
@@L220   EQU   *
         L     4,12(4)
         CL    4,4(11)
         BNE   @@L223
@@L230   EQU   *
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LTR   15,15
         BE    @@L224
         CL    15,8(11)
         BE    @@L224
         LH    2,0(15)
         CLM   2,3,=H'32'
         BE    @@L252
@@L224   EQU   *
         L     2,16(11)
         ST    5,0(2)
         L     2,20(11)
         ST    6,0(2)
         LA    3,1(0,0)
         L     14,=A(@@L143)
         BR    14
@@L252   EQU   *
         MVC   88(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         BE    @@L224
         L     3,104(13)
         LTR   3,3
         L     14,=A(@@L143)
         BER   14
         B     @@L224
@@L251   EQU   *
         CL    4,12(11)
         BE    @@L220
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(VOLINSP)
         BALR  14,15
         LTR   15,15
         BE    @@L220
         B     @@L233
@@L250   EQU   *
         LH    2,0(5)
         CLM   2,3,=H'61'
         BNE   @@L217
         L     2,4(5)
         SLR   3,3
         LA    4,19(0,0)
         CLR   2,4
         L     14,=A(@@L143)
         BNHR  14
         B     @@L217
@@L249   EQU   *
         CL    4,12(11)
         BE    @@L213
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(VOLREFP)
         BALR  14,15
         LTR   15,15
         BE    @@L213
         B     @@L233
@@L248   EQU   *
         L     2,4(3)
         L     7,0(2)
         BCTR  7,0
         LTR   7,7
         BL    @@L200
@@L207   EQU   *
         L     3,4(11)
         L     2,16(3)
         L     2,4(2)
         LR    4,7
         MH    4,=H'4'
         L     3,4(4,2)
         LH    2,0(3)
         CH    2,=H'49'
         BE    @@L253
@@L203   EQU   *
         BCTR  7,0
         LTR   7,7
         BNL   @@L207
         B     @@L200
@@L253   EQU   *
         MVC   88(4,13),4(3)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L233
         L     3,4(11)
         L     2,16(3)
         L     2,4(2)
         L     2,4(4,2)
         MVC   88(4,13),4(2)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L203
         B     @@L233
@@L247   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'61'
         BNE   @@L198
         L     2,4(5)
         LA    3,19(0,0)
         CLR   2,3
         BH    @@L193
         LA    4,15(0,0)
         CLR   2,4
         BH    @@L194
         N     2,=F'1'
         LTR   2,2
         BE    @@L193
         IC    2,2(5)
         CLM   2,1,=XL1'05'
         BE    @@L233
         CLM   2,1,=XL1'10'
         BE    @@L233
@@L193   EQU   *
         L     2,4(6)
         LA    3,19(0,0)
         CLR   2,3
         BH    @@L198
         LA    4,15(0,0)
         CLR   2,4
         BH    @@L196
         N     2,=F'1'
         LTR   2,2
         BE    @@L198
         IC    2,2(6)
         CLM   2,1,=XL1'05'
         BE    @@L233
         CLM   2,1,=XL1'10'
         BE    @@L233
         B     @@L198
@@L196   EQU   *
         IC    3,2(6)
         LA    2,241(,3)
         CLM   2,1,=XL1'01'
         BNH   @@L198
         CLM   3,1,=XL1'15'
         BE    @@L198
         CLM   3,1,=XL1'16'
         BE    @@L198
         B     @@L233
@@L194   EQU   *
         IC    3,2(5)
         LA    2,241(,3)
         CLM   2,1,=XL1'01'
         BNH   @@L193
         CLM   3,1,=XL1'15'
         BE    @@L193
         CLM   3,1,=XL1'16'
         BNE   @@L233
         B     @@L193
@@L246   EQU   *
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         L     2,=A(@@34)
         C     15,0(2)
         BL    @@L189
         B     @@L177
@@L245   EQU   *
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L186
@@L244   EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'3'
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L183
         B     @@L184
@@L243   EQU   *
         ST    5,88(13)
         ST    2,92(13)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(REG@USED)
         BALR  14,15
         LTR   15,15
         BNE   @@L233
         B     @@L181
@@L242   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'48'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(FREGFUS)
         BALR  14,15
         LTR   15,15
         BNE   @@L233
         LH    2,0(5)
         CLM   2,3,=H'61'
         BNE   @@L180
         L     3,4(5)
         LA    4,19(0,0)
         CLR   3,4
         BH    @@L180
         L     2,=V(GLBRGS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'00'
         BNE   @@L233
         B     @@L180
@@L241   EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L233
         B     @@L179
@@L240   EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BE    @@L153
         B     @@L167
@@L171   EQU   *
         LA    3,49(0,0)
         CLR   2,3
         BE    @@L153
         B     @@L233
@@L156   EQU   *
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L153
         L     4,4(11)
         L     5,16(4)
         LH    2,0(5)
         CLM   2,3,=H'39'
         BNE   @@L153
         L     2,4(5)
         L     4,0(2)
         BCTR  4,0
         L     9,4(3)
@@L158   EQU   *
         L     2,4(5)
         LR    3,4
         MH    3,=H'4'
         L     3,4(3,2)
         LH    2,0(3)
         CH    2,=H'48'
         BE    @@L254
@@L160   EQU   *
         BCTR  4,0
         LTR   4,4
         BNL   @@L158
         B     @@L153
@@L254   EQU   *
         L     3,4(3)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L160
         L     2,4(3)
         CLR   2,9
         BE    @@L255
         LA    3,19(0,0)
         CLR   9,3
         BNH   @@L160
         B     @@L233
@@L255   EQU   *
         MVC   88(4,13),4(6)
         L     2,0(11)
         MVC   92(4,13),8(2)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(REGSTBP)
         BALR  14,15
         LTR   15,15
         BNE   @@L233
         B     @@L160
@@L237   EQU   *
         LR    8,2
         B     @@L149
@@L236   EQU   *
         MVC   88(4,13),12(11)
@@L235   EQU   *
         LA    1,88(,13)
         L     15,=V(NEXT@ACT)
         BALR  14,15
         CL    15,4(11)
         BNE   @@L145
         MVC   104(4,13),=F'1'
         B     @@L145
@@L144   EQU   *
         MVC   104(4,13),12(11)
         MVC   88(4,13),0(11)
         B     @@L235
@@L143   EQU   *
         LR    15,3
* Function can_combine_p epilogue
         PDPEPIL
* Function can_combine_p literal pool
         DS    0F
         LTORG
* Function can_combine_p page table
         DS    0F
@@PGT6   EQU   *
         DC    A(@@PG6)
         DS    0F
* S-func sets_function_arg_p prologue
@@48     PDPPRLG CINDEX=7,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN7
         LTORG
@@FEN7   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG7    EQU   *
         LR    11,1
         L     10,=A(@@PGT7)
* Function sets_function_arg_p code
         L     5,0(11)
@@L259   EQU   *
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         LA    3,39(0,0)
         CLR   2,3
         BE    @@L260
         BH    @@L274
         LA    3,32(0,0)
         CLR   2,3
         BNE   @@L257
         L     5,16(5)
         B     @@L259
@@L257   EQU   *
         SLR   15,15
         B     @@L256
@@L274   EQU   *
         LA    3,47(0,0)
         CLR   2,3
         BNE   @@L257
         L     3,4(5)
         LH    4,0(3)
         LR    2,4
         AH    2,=H'-63'
         CLM   2,3,=H'1'
         BH    @@L280
@@L271   EQU   *
         L     3,4(3)
         LH    4,0(3)
         LR    2,4
         AH    2,=H'-63'
         CLM   2,3,=H'1'
         BNH   @@L271
         CLM   4,3,=H'133'
         BE    @@L271
         B     @@L257
@@L280   EQU   *
         CLM   4,3,=H'133'
         BNE   @@L257
         B     @@L271
@@L260   EQU   *
         L     2,4(5)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    @@L257
@@L266   EQU   *
         L     2,4(5)
         LR    3,4
         MH    3,=H'4'
         L     2,4(3,2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@48)
         BALR  14,15
         LTR   15,15
         BNE   @@L278
         BCTR  4,0
         LTR   4,4
         BNL   @@L266
         B     @@L257
@@L278   EQU   *
         LA    15,1(0,0)
@@L256   EQU   *
* Function sets_function_arg_p epilogue
         PDPEPIL
* Function sets_function_arg_p literal pool
         DS    0F
         LTORG
* Function sets_function_arg_p page table
         DS    0F
@@PGT7   EQU   *
         DC    A(@@PG7)
         DS    0F
* S-func combinable_i3pat prologue
@@49     PDPPRLG CINDEX=8,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN8
         LTORG
@@FEN8   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG8    EQU   *
         LR    11,1
         L     10,=A(@@PGT8)
* Function combinable_i3pat code
         L     5,4(11)
         L     9,8(11)
         L     6,12(11)
         L     7,20(11)
         L     3,0(5)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BE    @@L309
         CLM   2,3,=H'39'
         BE    @@L310
@@L296   EQU   *
         LA    15,1(0,0)
         B     @@L281
@@L310   EQU   *
         SLR   4,4
         L     2,4(3)
         C     4,0(2)
         BNL   @@L296
@@L304   EQU   *
         MVC   88(4,13),0(11)
         LR    2,4
         MH    2,=H'4'
         A     2,4(3)
         A     2,=F'4'
         ST    2,92(13)
         ST    9,96(13)
         ST    6,100(13)
         MVC   104(4,13),16(11)
         ST    7,108(13)
         LA    1,88(,13)
         L     15,=A(@@49)
         BALR  14,15
         LTR   15,15
         BE    @@L281
         A     4,=F'1'
         L     2,4(3)
         C     4,0(2)
         BL    @@L304
         B     @@L296
@@L309   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@42)
         BALR  14,15
         L     4,4(15)
         L     8,8(15)
         LR    3,4
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         LH    15,0(4)
         LR    2,15
         AH    2,=H'-63'
         CLM   2,3,=H'1'
         BH    @@L311
@@L286   EQU   *
         L     3,4(3)
         LH    15,0(3)
         LR    2,15
         AH    2,=H'-63'
         CLM   2,3,=H'1'
         BNH   @@L286
         CLM   15,3,=H'133'
         BE    @@L286
@@L306   EQU   *
         CLR   3,4
         BE    @@L289
         ST    9,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L288
         LTR   6,6
         BE    @@L289
         ST    6,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L288
@@L289   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L312
@@L290   EQU   *
         L     2,16(11)
         LTR   2,2
         BNE   @@L313
@@L287   EQU   *
         LTR   7,7
         BE    @@L296
         LH    2,0(4)
         CLM   2,3,=H'61'
         BNE   @@L296
         ST    4,88(13)
         L     5,0(11)
         MVC   92(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         BE    @@L296
         L     15,4(4)
         LA    2,13(0,0)
         CLR   15,2
         BE    @@L296
         LA    5,11(0,0)
         CLR   15,5
         BE    @@L314
@@L294   EQU   *
         L     2,0(7)
         SLR   15,15
         LTR   2,2
         BNE   @@L281
         ST    4,0(7)
         B     @@L296
@@L314   EQU   *
         L     2,=V(FREGS)
         IC    2,0(2,15)
         CLM   2,1,=XL1'00'
         BNE   @@L296
         B     @@L294
@@L313   EQU   *
         ST    6,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         BE    @@L287
@@L288   EQU   *
         SLR   15,15
         B     @@L281
@@L312   EQU   *
         L     2,4(3)
         LA    5,19(0,0)
         CLR   2,5
         BH    @@L290
         LA    5,15(0,0)
         CLR   2,5
         BH    @@L291
         N     2,=F'1'
         LTR   2,2
         BE    @@L290
         IC    2,2(3)
         CLM   2,1,=XL1'05'
         BE    @@L288
         CLM   2,1,=XL1'10'
         BE    @@L288
         B     @@L290
@@L291   EQU   *
         IC    15,2(3)
         LA    2,241(,15)
         CLM   2,1,=XL1'01'
         BNH   @@L290
         CLM   15,1,=XL1'15'
         BE    @@L290
         CLM   15,1,=XL1'16'
         BNE   @@L288
         B     @@L290
@@L311   EQU   *
         CLM   15,3,=H'133'
         BNE   @@L306
         B     @@L286
@@L281   EQU   *
* Function combinable_i3pat epilogue
         PDPEPIL
* Function combinable_i3pat literal pool
         DS    0F
         LTORG
* Function combinable_i3pat page table
         DS    0F
@@PGT8   EQU   *
         DC    A(@@PG8)
         DS    0F
* S-func contains_muldiv prologue
@@50     PDPPRLG CINDEX=9,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN9
         LTORG
@@FEN9   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG9    EQU   *
         LR    11,1
         L     10,=A(@@PGT9)
* Function contains_muldiv code
         L     4,0(11)
@@L331   EQU   *
         L     3,0(4)
         LR    2,3
         SRL   2,16
         LA    5,78(0,0)
         CLR   2,5
         BE    @@L321
         BL    @@L324
         LA    15,1(0,0)
         LA    5,82(0,0)
         CLR   2,5
         BNH   @@L315
@@L324   EQU   *
         SRL   3,16
         L     2,=V(RTX@CLAS)
         SLR   5,5
         IC    5,0(2,3)
         LR    2,5
         LA    3,131(0,0)
         CR    5,3
         BE    @@L328
         BNH   @@L338
         LA    3,241(0,0)
         CLR   5,3
         BNE   @@L339
         L     4,4(4)
         B     @@L331
@@L339   EQU   *
         LA    5,242(0,0)
@@L337   EQU   *
         CLR   2,5
         BE    @@L328
         SLR   15,15
         B     @@L315
@@L328   EQU   *
         SLR   2,2
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=A(@@50)
         BALR  14,15
         LTR   15,15
         BE    @@L340
@@L330   EQU   *
         LA    2,1(0,0)
@@L329   EQU   *
         LR    15,2
         B     @@L315
@@L340   EQU   *
         MVC   88(4,13),8(4)
         LA    1,88(,13)
         L     15,=A(@@50)
         BALR  14,15
         LTR   15,15
         BE    @@L329
         B     @@L330
@@L338   EQU   *
         LA    5,76(0,0)
         B     @@L337
@@L321   EQU   *
         SLR   3,3
         L     15,8(4)
         LH    2,0(15)
         CLM   2,3,=H'54'
         BE    @@L341
@@L323   EQU   *
         LA    3,1(0,0)
@@L322   EQU   *
         LR    15,3
         B     @@L315
@@L341   EQU   *
         MVC   88(4,13),4(15)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BNL   @@L322
         B     @@L323
@@L315   EQU   *
* Function contains_muldiv epilogue
         PDPEPIL
* Function contains_muldiv literal pool
         DS    0F
         LTORG
* Function contains_muldiv page table
         DS    0F
@@PGT9   EQU   *
         DC    A(@@PG9)
         DS    0F
* S-func cant_combine_insn_p prologue
@@51     PDPPRLG CINDEX=10,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN10
         LTORG
@@FEN10  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG10   EQU   *
         LR    11,1
         L     10,=A(@@PGT10)
* Function cant_combine_insn_p code
         L     4,0(11)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         LA    3,1(0,0)
         CLM   2,1,=XL1'89'
         BNE   @@L342
         L     3,16(4)
         LH    2,0(3)
         LR    15,3
         CLM   2,3,=H'47'
         BE    @@L345
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
@@L345   EQU   *
         LR    3,15
         LTR   15,15
         BE    @@L342
         L     3,8(15)
         L     15,4(15)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L354
@@L349   EQU   *
         LH    2,0(15)
         CLM   2,3,=H'63'
         BE    @@L355
@@L350   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L356
@@L351   EQU   *
         SLR   3,3
         B     @@L342
@@L356   EQU   *
         LH    2,0(15)
         CLM   2,3,=H'61'
         BNE   @@L351
         L     3,4(3)
         LA    2,19(0,0)
         CLR   3,2
         BH    @@L353
         L     2,=V(FREGS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'00'
         BE    @@L352
@@L353   EQU   *
         L     15,4(15)
         LA    2,19(0,0)
         CLR   15,2
         BH    @@L351
         L     2,=V(FREGS)
         IC    2,0(2,15)
         CLM   2,1,=XL1'00'
         BNE   @@L351
@@L352   EQU   *
         LA    3,1(0,0)
         B     @@L342
@@L355   EQU   *
         L     15,4(15)
         B     @@L350
@@L354   EQU   *
         L     3,4(3)
         B     @@L349
@@L342   EQU   *
         LR    15,3
* Function cant_combine_insn_p epilogue
         PDPEPIL
* Function cant_combine_insn_p literal pool
         DS    0F
         LTORG
* Function cant_combine_insn_p page table
         DS    0F
@@PGT10  EQU   *
         DC    A(@@PG10)
         DS    0F
* S-func try_combine prologue
@@37     PDPPRLG CINDEX=11,FRAME=248,BASER=12,ENTRY=NO
         B     @@FEN11
         LTORG
@@FEN11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG11   EQU   *
         LR    11,1
         L     10,=A(@@PGT11)
* Function try_combine code
         L     9,0(11)
         SLR   2,2
         ST    2,144(13)
         ST    2,172(13)
         ST    2,168(13)
         ST    2,188(13)
         ST    2,192(13)
         ST    2,128(13)
         ST    2,120(13)
         ST    2,124(13)
         ST    2,204(13)
         ST    2,200(13)
         ST    2,208(13)
         ST    2,212(13)
         ST    2,216(13)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@51)
         BALR  14,15
         LTR   15,15
         BE    @@L720
@@L719   EQU   *
         L     12,0(,10)
         SLR   15,15
         L     14,=A(@@L357)
         BR    14
@@L720   EQU   *
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@51)
         BALR  14,15
         LTR   15,15
         BNE   @@L719
         L     2,8(11)
         LTR   2,2
         BE    @@L358
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@51)
         BALR  14,15
         LTR   15,15
         BNE   @@L719
@@L358   EQU   *
         L     3,=A(@@3)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         L     2,=A(@@1)
         MVC   8(4,2),=F'0'
         L     2,=A(@@52)
         MVC   0(4,2),=F'0'
         L     3,8(11)
         LTR   3,3
         BE    @@L360
         L     15,4(3)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L721)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     4,0(15,2)
@@L362   EQU   *
         L     12,0(,10)
         L     5,4(11)
         L     3,4(5)
         L     2,=A(@@21)
         C     3,0(2)
         L     14,=A(@@L722)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         C     4,0(3,2)
         BNH   @@L360
@@L364   EQU   *
         L     12,0(,10)
         L     5,8(11)
         MVC   8(4,11),4(11)
         ST    5,4(11)
@@L360   EQU   *
         L     12,0(,10)
         L     2,=A(@@53)
         MVC   0(4,2),=F'0'
         L     6,8(11)
         LTR   6,6
         L     14,=A(@@L723)
         BER   14
@@L365   EQU   *
         L     12,0(,10)
         L     6,8(11)
         LTR   6,6
         L     14,=A(@@L724)
         BER   14
@@L384   EQU   *
         L     12,0(,10)
         MVC   88(4,13),4(11)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),=F'0'
         LA    2,112(,13)
         ST    2,104(13)
         LA    2,116(,13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@45)
         BALR  14,15
         LTR   15,15
         BE    @@L717
         L     5,8(11)
         LTR   5,5
         BE    @@L405
         ST    5,88(13)
         ST    9,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),4(11)
         LA    2,120(,13)
         ST    2,104(13)
         LA    2,124(,13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@45)
         BALR  14,15
         LTR   15,15
         BE    @@L717
@@L405   EQU   *
         MVC   88(4,13),112(13)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         ST    15,200(13)
         MVC   204(4,13),=F'0'
         L     6,8(11)
         LTR   6,6
         BE    @@L407
         MVC   88(4,13),120(13)
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         BE    @@L407
         MVC   204(4,13),=F'1'
@@L407   EQU   *
         MVC   208(4,13),=F'0'
         L     2,8(11)
         LTR   2,2
         BE    @@L408
         MVC   88(4,13),112(13)
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         BE    @@L408
         MVC   208(4,13),=F'1'
@@L408   EQU   *
         SLR   4,4
         L     3,8(11)
         LTR   3,3
         BE    @@L409
         MVC   88(4,13),120(13)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L409
         LA    4,1(0,0)
@@L409   EQU   *
         ST    9,88(13)
         A     9,=F'16'
         ST    9,92(13)
         A     9,=F'-16'
         MVC   96(4,13),112(13)
         MVC   100(4,13),120(13)
         SLR   2,2
         L     5,8(11)
         LTR   5,5
         BE    @@L411
         L     6,208(13)
         LTR   6,6
         BE    @@L411
         LTR   4,4
         BE    @@L411
         LA    2,1(0,0)
@@L411   EQU   *
         ST    2,104(13)
         LA    2,128(,13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@49)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(@@L718)
         BER   14
         L     2,116(13)
         LH    2,0(2)
         CLM   2,3,=H'78'
         L     14,=A(@@L413)
         BER   14
         L     2,8(11)
         LTR   2,2
         BE    @@L414
         L     2,124(13)
         LH    2,0(2)
         CLM   2,3,=H'78'
         L     14,=A(@@L413)
         BER   14
@@L414   EQU   *
         L     3,16(9)
         LH    2,0(3)
         CLM   2,3,=H'47'
         L     14,=A(@@L725)
         BER   14
@@L412   EQU   *
         L     12,0(,10)
         MVC   180(4,13),=F'0'
         ST    9,88(13)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(DEDSET)
         BALR  14,15
         LTR   15,15
         BNE   @@L415
         MVC   180(4,13),=F'1'
@@L415   EQU   *
         MVC   176(4,13),=F'0'
         L     3,8(11)
         LTR   3,3
         BE    @@L416
         LTR   4,4
         L     14,=A(@@L417)
         BER   14
         ST    9,88(13)
@@L709   EQU   *
         L     12,0(,10)
         MVC   92(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(DEDSET)
         BALR  14,15
         LTR   15,15
         BNE   @@L416
         MVC   176(4,13),=F'1'
@@L416   EQU   *
         L     12,0(,10)
         L     5,4(11)
         L     15,16(5)
         LH    2,0(15)
         CLM   2,3,=H'39'
         L     14,=A(@@L726)
         BER   14
@@L419   EQU   *
         L     12,0(,10)
         ST    15,196(13)
         L     6,180(13)
         LTR   6,6
         L     14,=A(@@L727)
         BNER  14
@@L421   EQU   *
         L     12,0(,10)
         L     3,=A(@@4)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         LR    3,15
         L     2,=A(@@30)
         ST    9,0(2)
         L     2,=V(FLAG@EXP)
         L     2,0(2)
         LTR   2,2
         BE    @@L422
         L     2,8(11)
         LTR   2,2
         L     14,=A(@@L423)
         BER   14
         L     15,4(2)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L728)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L425   EQU   *
         L     12,0(,10)
         L     2,=A(@@29)
         ST    15,0(2)
         MVC   88(4,13),124(13)
         L     2,=V(GLBRTL)
         MVC   92(4,13),0(2)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         ST    15,124(13)
@@L422   EQU   *
         L     12,0(,10)
         L     2,=A(@@56)
         MVC   0(4,2),=F'0'
         L     6,4(11)
         L     15,4(6)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L729)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L430   EQU   *
         L     12,0(,10)
         L     2,=A(@@29)
         ST    15,0(2)
         MVC   88(4,13),16(9)
         MVC   92(4,13),112(13)
         MVC   96(4,13),116(13)
         MVC   100(4,13),=F'0'
         SLR   2,2
         LTR   4,4
         BNE   @@L431
         L     4,204(13)
         LTR   4,4
         BE    @@L431
         LA    2,1(0,0)
@@L431   EQU   *
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         ST    15,132(13)
         MVC   168(4,13),=F'1'
         L     5,8(11)
         LTR   5,5
         BE    @@L432
         LH    2,0(15)
         CLM   2,3,=H'49'
         BE    @@L432
         MVC   88(4,13),=F'0'
         LA    2,132(,13)
         ST    2,92(13)
         MVC   96(4,13),120(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@49)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(@@L718)
         BER   14
         L     2,=A(@@56)
         MVC   0(4,2),=F'0'
         L     6,8(11)
         L     15,4(6)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L730)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L435   EQU   *
         L     12,0(,10)
         L     2,=A(@@29)
         ST    15,0(2)
         MVC   88(4,13),132(13)
         MVC   92(4,13),120(13)
         MVC   96(4,13),124(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         ST    15,132(13)
         MVC   172(4,13),=F'1'
@@L432   EQU   *
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         CLR   15,3
         BE    @@L731
@@L717   EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(@@54)
         BALR  14,15
         B     @@L719
@@L731   EQU   *
         L     4,132(13)
         LH    2,0(4)
         CLM   2,3,=H'49'
         BE    @@L717
         CLM   2,3,=H'47'
         L     14,=A(@@L732)
         BER   14
@@L436   EQU   *
         L     12,0(,10)
         L     3,176(13)
         LTR   3,3
         BNE   @@L439
         L     5,180(13)
         LTR   5,5
         BE    @@L382
@@L439   EQU   *
         L     2,=A(@@5)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         LH    2,0(4)
         CLM   2,3,=H'39'
         L     14,=A(@@L733)
         BER   14
         L     8,176(13)
         A     8,180(13)
         A     8,=F'1'
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(RTVEC@AL)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
         ST    15,132(13)
         L     2,4(15)
         ST    4,4(2)
@@L441   EQU   *
         L     12,0(,10)
         L     6,176(13)
         LTR   6,6
         BE    @@L442
         L     2,132(13)
         L     4,4(2)
         BCTR  8,0
         LR    3,8
         MH    3,=H'4'
         L     2,8(11)
         L     15,16(2)
         LH    2,0(15)
         CLM   2,3,=H'39'
         L     14,=A(@@L734)
         BER   14
@@L444   EQU   *
         L     12,0(,10)
         ST    15,4(3,4)
@@L442   EQU   *
         L     3,180(13)
         LTR   3,3
         BE    @@L382
         L     4,8(11)
         LTR   4,4
         L     14,=A(@@L735)
         BER   14
         L     2,132(13)
         L     2,4(2)
         BCTR  8,0
         MH    8,=H'4'
         MVC   88(4,13),196(13)
         MVC   92(4,13),120(13)
         MVC   96(4,13),124(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         ST    15,4(8,2)
@@L382   EQU   *
         L     12,0(,10)
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=A(@@57)
         BALR  14,15
         LA    6,132(,13)
         ST    6,88(13)
         ST    9,92(13)
         LA    7,136(,13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,184(13)
         LTR   15,15
         L     14,=A(@@L736)
         BLR   14
@@L448   EQU   *
         L     12,0(,10)
         L     2,184(13)
         LTR   2,2
         L     14,=A(@@L737)
         BLR   14
@@L449   EQU   *
         L     12,0(,10)
         L     6,8(11)
         LTR   6,6
         BE    @@L451
         L     2,184(13)
         LTR   2,2
         L     14,=A(@@L738)
         BLR   14
@@L451   EQU   *
         L     12,0(,10)
         L     6,8(11)
         LTR   6,6
         BE    @@L497
         L     2,184(13)
         LTR   2,2
         L     14,=A(@@L739)
         BLR   14
@@L497   EQU   *
         L     12,0(,10)
         L     6,8(11)
         LTR   6,6
         BE    @@L496
         L     2,184(13)
         LTR   2,2
         L     14,=A(@@L740)
         BLR   14
@@L496   EQU   *
         L     12,0(,10)
         L     5,184(13)
         LTR   5,5
         L     14,=A(@@L741)
         BLR   14
@@L525   EQU   *
         L     12,0(,10)
         L     2,=A(@@1)
         L     3,8(2)
         LTR   3,3
         BE    @@L527
         MVC   156(4,13),16(3)
         L     2,=A(@@52)
         MVC   0(4,2),=F'0'
         LA    2,156(,13)
         ST    2,88(13)
         ST    3,92(13)
         LA    2,160(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,192(13)
         LTR   15,15
         L     14,=A(@@L742)
         BLR   14
@@L528   EQU   *
         L     12,0(,10)
         L     2,=A(@@1)
         L     3,8(2)
         MVC   16(4,3),156(13)
         L     2,8(2)
         L     4,28(2)
         LTR   4,4
         BE    @@L693
@@L535   EQU   *
         L     6,8(4)
         CLI   2(4),10
         L     14,=A(@@L743)
         BER   14
@@L531   EQU   *
         L     12,0(,10)
         LR    4,6
         LTR   6,6
         BNE   @@L535
@@L693   EQU   *
         L     4,160(13)
         LTR   4,4
         BE    @@L695
@@L541   EQU   *
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'61'
         L     14,=A(@@L744)
         BER   14
@@L538   EQU   *
         L     12,0(,10)
         L     4,8(4)
         LTR   4,4
         BNE   @@L541
@@L695   EQU   *
         MVC   88(4,13),160(13)
         L     2,=A(@@1)
         MVC   92(4,13),8(2)
         MVC   96(4,13),92(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
@@L527   EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LTR   15,15
         BE    @@L542
         CL    15,4(11)
         BE    @@L542
         LH    2,0(15)
         CLM   2,3,=H'32'
         L     14,=A(@@L745)
         BER   14
@@L542   EQU   *
         L     12,0(,10)
         MVC   232(4,13),=F'0'
         MVC   220(4,13),232(13)
         MVC   164(4,13),232(13)
         L     2,144(13)
         LTR   2,2
         L     14,=A(@@L746)
         BNER  14
@@L545   EQU   *
         L     12,0(,10)
         L     3,200(13)
         LTR   3,3
         L     14,=A(@@L543)
         BNER  14
         L     4,208(13)
         LTR   4,4
         L     14,=A(@@L543)
         BNER  14
         MVC   236(4,13),112(13)
@@L544   EQU   *
         L     12,0(,10)
         L     5,8(11)
         LTR   5,5
         L     14,=A(@@L546)
         BER   14
         L     6,204(13)
         LTR   6,6
         L     14,=A(@@L546)
         BNER  14
         L     2,144(13)
         LTR   2,2
         L     14,=A(@@L747)
         BNER  14
@@L548   EQU   *
         L     12,0(,10)
         MVC   240(4,13),120(13)
@@L547   EQU   *
         L     12,0(,10)
         L     7,28(9)
         MVC   224(4,13),24(9)
         L     2,4(11)
         L     8,28(2)
         MVC   228(4,13),24(2)
         L     3,8(11)
         LTR   3,3
         BE    @@L549
         MVC   220(4,13),28(3)
         MVC   232(4,13),24(3)
@@L549   EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(RESET@US)
         BALR  14,15
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(RESET@US)
         BALR  14,15
         MVC   88(4,13),220(13)
         LA    1,88(,13)
         L     15,=V(RESET@US)
         BALR  14,15
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(RESET@US)
         BALR  14,15
         MVC   88(4,13),144(13)
         LA    1,88(,13)
         L     15,=V(RESET@US)
         BALR  14,15
         L     3,=A(@@1)
         L     2,8(3)
         LTR   2,2
         L     14,=A(@@L748)
         BNER  14
@@L550   EQU   *
         L     12,0(,10)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(CPRTIFSH)
         BALR  14,15
         LR    7,15
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(CPRTIFSH)
         BALR  14,15
         LR    8,15
         MVC   88(4,13),220(13)
         LA    1,88(,13)
         L     15,=V(CPRTIFSH)
         BALR  14,15
         ST    15,220(13)
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(CPRTIFSH)
         BALR  14,15
         ST    15,132(13)
         MVC   88(4,13),144(13)
         LA    1,88(,13)
         L     15,=V(CPRTIFSH)
         BALR  14,15
         ST    15,144(13)
         L     2,8(3)
         LTR   2,2
         L     14,=A(@@L749)
         BNER  14
@@L551   EQU   *
         L     12,0(,10)
         MVC   20(4,9),184(13)
         MVC   16(4,9),132(13)
         LH    2,0(9)
         CLM   2,3,=H'34'
         L     14,=A(@@L750)
         BER   14
@@L552   EQU   *
         L     12,0(,10)
         L     2,=A(@@1)
         L     2,8(2)
         LTR   2,2
         BE    @@L555
         MVC   20(4,2),192(13)
@@L555   EQU   *
         L     6,212(13)
         LTR   6,6
         BE    @@L556
         SLR   6,6
         L     3,4(11)
         L     2,16(3)
         L     2,4(2)
         C     6,0(2)
         BNL   @@L697
@@L575   EQU   *
         LR    4,6
         MH    4,=H'4'
         L     3,4(4,2)
         LH    2,0(3)
         CLM   2,3,=H'48'
         BE    @@L559
         L     3,4(3)
         LH    2,0(3)
         CH    2,=H'61'
         L     14,=A(@@L751)
         BER   14
@@L559   EQU   *
         L     12,0(,10)
         A     6,=F'1'
         L     3,4(11)
         L     2,16(3)
         L     2,4(2)
         C     6,0(2)
         BL    @@L575
@@L697   EQU   *
         LTR   7,7
         L     14,=A(@@L576)
         BER   14
         LR    3,7
         L     2,8(7)
         LTR   2,2
         BE    @@L700
@@L580   EQU   *
         L     3,8(3)
         L     2,8(3)
         LTR   2,2
         BNE   @@L580
@@L700   EQU   *
         ST    8,8(3)
@@L581   EQU   *
         L     12,0(,10)
         SLR   8,8
@@L556   EQU   *
         MVC   24(4,9),=F'0'
         MVC   28(4,9),=F'0'
         L     4,4(11)
         MVC   24(4,4),=F'0'
         MVC   28(4,4),=F'0'
         L     2,144(13)
         LTR   2,2
         L     14,=A(@@L582)
         BER   14
         MVC   20(4,4),188(13)
         ST    2,16(4)
@@L583   EQU   *
         L     12,0(,10)
         L     6,8(11)
         LTR   6,6
         BE    @@L584
         MVC   24(4,6),=F'0'
         MVC   28(4,6),=F'0'
         MVC   0(2,6),=H'37'
         MVC   20(4,6),=F'-99'
         MVC   16(4,6),=F'0'
@@L584   EQU   *
         L     2,144(13)
         LTR   2,2
         L     14,=A(@@L585)
         BER   14
         L     2,8(11)
         L     15,4(2)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L752)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L587   EQU   *
         L     12,0(,10)
         MVC   88(4,13),144(13)
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         MVC   100(4,13),4(11)
         LA    3,164(,13)
         ST    3,104(13)
         LA    1,88(,13)
         L     15,=A(@@63)
         BALR  14,15
         L     4,8(11)
         L     15,4(4)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L753)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L589   EQU   *
         L     12,0(,10)
         MVC   88(4,13),132(13)
         MVC   92(4,13),144(13)
         ST    15,96(13)
         ST    9,100(13)
         ST    3,104(13)
@@L713   EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(@@63)
         BALR  14,15
         LTR   7,7
         L     14,=A(@@L597)
         BER   14
         ST    7,88(13)
         ST    9,92(13)
         ST    9,96(13)
         L     3,144(13)
         L     2,4(11)
         LTR   3,3
         BNE   @@L599
         LR    2,3
@@L599   EQU   *
         ST    2,100(13)
         MVC   104(4,13),236(13)
         MVC   108(4,13),240(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
@@L597   EQU   *
         LTR   8,8
         L     14,=A(@@L600)
         BER   14
         ST    8,88(13)
         MVC   92(4,13),4(11)
         ST    9,96(13)
         L     3,144(13)
         L     2,4(11)
         LTR   3,3
         L     14,=A(@@L602)
         BNER  14
         LR    2,3
@@L602   EQU   *
         ST    2,100(13)
         MVC   104(4,13),236(13)
         MVC   108(4,13),240(13)
         B     @@PGE11
         DS    0F
         LTORG
         DS    0F
@@PGE11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG12   EQU   *
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
@@L600   EQU   *
         L     12,4(,10)
         L     2,220(13)
         LTR   2,2
         BE    @@L603
         ST    2,88(13)
         MVC   92(4,13),8(11)
         ST    9,96(13)
         L     3,144(13)
         L     2,4(11)
         LTR   3,3
         BNE   @@L605
         LR    2,3
@@L605   EQU   *
         L     12,4(,10)
         ST    2,100(13)
         MVC   104(4,13),236(13)
         MVC   108(4,13),240(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
@@L603   EQU   *
         L     12,4(,10)
         L     2,164(13)
         LTR   2,2
         BE    @@L606
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         ST    9,96(13)
         L     3,144(13)
         L     2,4(11)
         LTR   3,3
         BNE   @@L608
         LR    2,3
@@L608   EQU   *
         L     12,4(,10)
         ST    2,100(13)
         MVC   104(4,13),236(13)
         MVC   108(4,13),240(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
@@L606   EQU   *
         L     12,4(,10)
         L     2,144(13)
         LTR   2,2
         BE    @@L609
         L     2,148(13)
         LTR   2,2
         BE    @@L609
         LR    5,2
@@L615   EQU   *
         L     12,4(,10)
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'61'
         L     14,=A(@@L754)
         BER   14
@@L612   EQU   *
         L     12,4(,10)
         L     5,8(5)
         LTR   5,5
         BNE   @@L615
         MVC   88(4,13),148(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),4(11)
         ST    5,100(13)
         ST    5,104(13)
         ST    5,108(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
@@L609   EQU   *
         L     12,4(,10)
         L     2,136(13)
         LTR   2,2
         BE    @@L616
         LR    5,2
@@L622   EQU   *
         L     12,4(,10)
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'61'
         L     14,=A(@@L755)
         BER   14
@@L619   EQU   *
         L     12,4(,10)
         L     5,8(5)
         LTR   5,5
         BNE   @@L622
         MVC   88(4,13),136(13)
         ST    9,92(13)
         ST    9,96(13)
         ST    5,100(13)
         ST    5,104(13)
         ST    5,108(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
@@L616   EQU   *
         L     12,4(,10)
         L     3,128(13)
         LTR   3,3
         BE    @@L623
         LH    2,0(3)
         CLM   2,3,=H'61'
         L     14,=A(@@L756)
         BER   14
@@L624   EQU   *
         L     12,4(,10)
         L     2,144(13)
         LTR   2,2
         BE    @@L625
         MVC   88(4,13),128(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L757)
         BNER  14
@@L625   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'1'
         MVC   96(4,13),128(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         ST    9,96(13)
         L     3,144(13)
         L     2,4(11)
         LTR   3,3
         BNE   @@L628
         LR    2,3
@@L628   EQU   *
         L     12,4(,10)
         ST    2,100(13)
@@L714   EQU   *
         L     12,4(,10)
         MVC   104(4,13),236(13)
         MVC   108(4,13),240(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
@@L623   EQU   *
         L     12,4(,10)
         L     3,200(13)
         LTR   3,3
         BE    @@L629
         L     3,112(13)
         LH    2,0(3)
         CLM   2,3,=H'61'
         L     14,=A(@@L758)
         BER   14
@@L630   EQU   *
         L     12,4(,10)
         L     2,144(13)
         LTR   2,2
         BE    @@L631
         MVC   88(4,13),112(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L759)
         BNER  14
@@L631   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'1'
         MVC   96(4,13),112(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         ST    9,96(13)
         L     3,144(13)
         L     2,4(11)
         LTR   3,3
         BNE   @@L634
         LR    2,3
@@L634   EQU   *
         L     12,4(,10)
         ST    2,100(13)
@@L715   EQU   *
         L     12,4(,10)
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
@@L629   EQU   *
         L     12,4(,10)
         L     4,204(13)
         LTR   4,4
         BE    @@L635
         L     3,120(13)
         LH    2,0(3)
         CLM   2,3,=H'61'
         L     14,=A(@@L760)
         BER   14
@@L636   EQU   *
         L     12,4(,10)
         L     2,144(13)
         LTR   2,2
         BE    @@L637
         MVC   88(4,13),120(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L761)
         BNER  14
@@L637   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'1'
         MVC   96(4,13),120(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         ST    9,96(13)
         L     3,144(13)
         L     2,4(11)
         LTR   3,3
         BNE   @@L640
         LR    2,3
@@L640   EQU   *
         L     12,4(,10)
         ST    2,100(13)
@@L716   EQU   *
         L     12,4(,10)
         MVC   104(4,13),=F'0'
         MVC   108(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
@@L635   EQU   *
         L     12,4(,10)
         MVC   88(4,13),224(13)
         LA    1,88(,13)
         L     15,=A(@@61)
         BALR  14,15
         MVC   88(4,13),228(13)
         LA    1,88(,13)
         L     15,=A(@@61)
         BALR  14,15
         MVC   88(4,13),232(13)
         LA    1,88(,13)
         L     15,=A(@@61)
         BALR  14,15
         L     2,112(13)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BE    @@L762
@@L641   EQU   *
         L     12,4(,10)
         L     2,8(11)
         LTR   2,2
         BE    @@L654
         L     2,120(13)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BE    @@L763
@@L654   EQU   *
         L     12,4(,10)
         L     2,144(13)
         LTR   2,2
         BNE   @@L764
@@L666   EQU   *
         L     12,4(,10)
         MVC   88(4,13),132(13)
         MVC   92(4,13),=A(@@31)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(NOTE@STO)
         BALR  14,15
         L     2,132(13)
         LH    2,0(2)
         CLM   2,3,=H'51'
         BE    @@L668
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@UNCO)
         BALR  14,15
         LTR   15,15
         BE    @@L667
@@L668   EQU   *
         L     12,4(,10)
         L     6,12(11)
         MVC   0(4,6),=F'1'
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BE    @@L670
         LH    2,0(15)
         CLM   2,3,=H'35'
         BE    @@L667
@@L670   EQU   *
         L     12,4(,10)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(EMBAF)
         BALR  14,15
@@L667   EQU   *
         L     12,4(,10)
         L     3,132(13)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BE    @@L765
@@L671   EQU   *
         L     12,4(,10)
         L     3,=A(@@6)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         LA    1,88(,13)
         L     15,=A(@@65)
         BALR  14,15
         L     2,=A(@@25)
         MVC   0(4,2),=F'0'
         L     2,=A(@@53)
         L     3,0(2)
         LTR   3,3
         BE    @@L672
         L     2,144(13)
         LTR   2,2
         BE    @@L673
         L     15,4(3)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L766
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     4,0(15,2)
@@L675   EQU   *
         L     12,4(,10)
         L     5,4(11)
         L     3,4(5)
         L     2,=A(@@21)
         C     3,0(2)
         BH    @@L767
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         C     4,0(3,2)
         BNL   @@L672
@@L673   EQU   *
         L     12,4(,10)
         L     2,=A(@@53)
         L     3,0(2)
         L     15,4(3)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L768
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     4,0(15,2)
@@L679   EQU   *
         L     12,4(,10)
         L     3,4(9)
         L     2,=A(@@21)
         C     3,0(2)
         BH    @@L769
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         C     4,0(3,2)
         BNL   @@L672
@@L681   EQU   *
         L     12,4(,10)
         L     2,=A(@@53)
         L     15,0(2)
         L     14,=A(@@L357)
         BR    14
@@L672   EQU   *
         L     12,4(,10)
         L     15,4(11)
         L     2,144(13)
         LTR   2,2
         L     14,=A(@@L357)
         BNER  14
         LR    15,9
         L     14,=A(@@L357)
         BR    14
@@L769   EQU   *
         L     12,4(,10)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         CR    4,15
         BL    @@L681
         B     @@L672
@@L768   EQU   *
         L     12,4(,10)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         LR    4,15
         B     @@L679
@@L767   EQU   *
         L     12,4(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         CR    4,15
         BL    @@L673
         B     @@L672
@@L766   EQU   *
         L     12,4(,10)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         LR    4,15
         B     @@L675
@@L765   EQU   *
         L     12,4(,10)
         L     4,8(3)
         L     2,=V(GLBRTL)
         CL    4,0(2)
         BNE   @@L671
         L     2,4(3)
         CLR   2,4
         BNE   @@L671
         L     2,12(11)
         MVC   0(4,2),=F'1'
         B     @@L671
@@L764   EQU   *
         L     12,4(,10)
         ST    2,88(13)
         MVC   92(4,13),=A(@@31)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(NOTE@STO)
         BALR  14,15
         B     @@L666
@@L763   EQU   *
         L     12,4(,10)
         SLR   6,6
         LR    7,6
         L     4,24(9)
         LTR   4,4
         BE    @@L708
@@L664   EQU   *
         L     12,4(,10)
         L     5,4(4)
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L770
         SLR   2,2
@@L661   EQU   *
         L     12,4(,10)
         LTR   2,2
         BE    @@L657
         MVC   88(4,13),120(13)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L657
         L     7,4(4)
         L     6,8(2)
@@L657   EQU   *
         L     12,4(,10)
         L     4,8(4)
         LTR   4,4
         BNE   @@L664
@@L708   EQU   *
         L     12,4(,10)
         MVC   88(4,13),120(13)
         ST    7,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@64)
         BALR  14,15
         L     2,120(13)
         L     3,4(2)
         L     4,176(13)
         LTR   4,4
         BNE   @@L654
         L     5,204(13)
         LTR   5,5
         BNE   @@L654
         MH    3,=H'4'
         L     2,=V(REG@N@IN)
         A     3,0(2)
         L     3,16(3)
         L     2,12(3)
         BCTR  2,0
         ST    2,12(3)
         B     @@L654
@@L770   EQU   *
         L     12,4(,10)
         L     2,16(5)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L661
         ST    5,88(13)
         L     2,4(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
         B     @@L661
@@L762   EQU   *
         L     12,4(,10)
         SLR   6,6
         LR    7,6
         L     4,24(9)
         LTR   4,4
         BE    @@L706
@@L651   EQU   *
         L     12,4(,10)
         L     5,4(4)
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L771
         SLR   2,2
@@L648   EQU   *
         L     12,4(,10)
         LTR   2,2
         BE    @@L644
         MVC   88(4,13),112(13)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L644
         L     7,4(4)
         L     6,8(2)
@@L644   EQU   *
         L     12,4(,10)
         L     4,8(4)
         LTR   4,4
         BNE   @@L651
@@L706   EQU   *
         L     12,4(,10)
         MVC   88(4,13),112(13)
         ST    7,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@64)
         BALR  14,15
         L     5,180(13)
         LTR   5,5
         BNE   @@L641
         L     2,144(13)
         LTR   2,2
         BNE   @@L772
@@L653   EQU   *
         L     12,4(,10)
         L     6,200(13)
         LTR   6,6
         BNE   @@L641
         L     2,112(13)
         L     2,4(2)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,12(3)
         BCTR  2,0
         ST    2,12(3)
         B     @@L641
@@L772   EQU   *
         L     12,4(,10)
         MVC   88(4,13),112(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BNE   @@L641
         B     @@L653
@@L771   EQU   *
         L     12,4(,10)
         L     2,16(5)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L648
         ST    5,88(13)
         L     2,4(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
         B     @@L648
@@L761   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'1'
         MVC   96(4,13),120(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),4(11)
         MVC   100(4,13),=F'0'
         B     @@L716
@@L760   EQU   *
         L     12,4(,10)
         L     2,4(3)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,24(3)
         A     2,=F'1'
         ST    2,24(3)
         B     @@L636
@@L759   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'1'
         MVC   96(4,13),112(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),4(11)
         MVC   100(4,13),=F'0'
         B     @@L715
@@L758   EQU   *
         L     12,4(,10)
         L     2,4(3)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,24(3)
         A     2,=F'1'
         ST    2,24(3)
         B     @@L630
@@L757   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'1'
         MVC   96(4,13),128(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),4(11)
         MVC   100(4,13),=F'0'
         B     @@L714
@@L756   EQU   *
         L     12,4(,10)
         L     2,4(3)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,24(3)
         A     2,=F'1'
         ST    2,24(3)
         B     @@L624
@@L755   EQU   *
         L     12,4(,10)
         L     2,4(3)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,24(3)
         A     2,=F'1'
         ST    2,24(3)
         B     @@L619
@@L754   EQU   *
         L     12,4(,10)
         L     2,4(3)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,24(3)
         A     2,=F'1'
         ST    2,24(3)
         B     @@L612
@@L753   EQU   *
         L     12,4(,10)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         L     14,=A(@@L589)
         BR    14
@@L752   EQU   *
         L     12,4(,10)
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         L     14,=A(@@L587)
         BR    14
@@L585   EQU   *
         L     12,4(,10)
         L     5,8(11)
         LTR   5,5
         BE    @@L591
         L     15,4(5)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L773
@@L595   EQU   *
         L     12,4(,10)
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L592   EQU   *
         L     12,4(,10)
         MVC   88(4,13),132(13)
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         ST    9,100(13)
         LA    2,164(,13)
         ST    2,104(13)
         L     14,=A(@@L713)
         BR    14
@@L773   EQU   *
         L     12,4(,10)
         ST    5,88(13)
@@L712   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L592
@@L591   EQU   *
         L     12,4(,10)
         L     6,4(11)
         L     15,4(6)
         L     2,=A(@@21)
         C     15,0(2)
         BNH   @@L595
         ST    6,88(13)
         B     @@L712
@@L582   EQU   *
         L     12,4(,10)
         L     5,4(11)
         MVC   0(2,5),=H'37'
         MVC   20(4,5),=F'-99'
         ST    2,16(5)
         L     14,=A(@@L583)
         BR    14
@@L576   EQU   *
         L     12,4(,10)
         LR    7,8
         L     14,=A(@@L581)
         BR    14
@@L751   EQU   *
         L     12,4(,10)
         CL    3,112(13)
         L     14,=A(@@L559)
         BER   14
         MVC   88(4,13),4(11)
         MVC   92(4,13),=F'10'
         L     5,4(11)
         L     2,16(5)
         L     2,4(2)
         L     2,4(4,2)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L559)
         BNER  14
         L     2,4(11)
         L     5,12(2)
@@L562   EQU   *
         L     12,4(,10)
         LTR   5,5
         L     14,=A(@@L559)
         BER   14
         L     2,=V(N@BASIC@)
         L     3,0(2)
         BCTR  3,0
         L     2,=A(@@33)
         L     4,0(2)
         CLR   4,3
         BE    @@L574
         MH    4,=H'4'
         L     2,=V(BBINFO)
         A     4,0(2)
         L     2,16(4)
         L     2,0(2)
         CLR   2,5
         L     14,=A(@@L559)
         BER   14
@@L574   EQU   *
         L     12,4(,10)
         CLR   5,9
         BE    @@L564
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L774
@@L564   EQU   *
         L     12,4(,10)
         L     5,12(5)
         B     @@L562
@@L774   EQU   *
         L     12,4(,10)
         L     3,24(5)
         LTR   3,3
         BE    @@L564
@@L573   EQU   *
         L     12,4(,10)
         L     2,4(3)
         CL    2,4(11)
         BE    @@L775
@@L570   EQU   *
         L     12,4(,10)
         L     3,8(3)
         LTR   3,3
         BNE   @@L573
         B     @@L564
@@L775   EQU   *
         L     12,4(,10)
         ST    9,4(3)
         B     @@L570
@@L750   EQU   *
         L     12,4(,10)
         L     15,32(9)
         LTR   15,15
         L     14,=A(@@L552)
         BER   14
         LR    2,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(RESET@US)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         LR    2,15
         L     4,168(13)
         LTR   4,4
         L     14,=A(@@L776)
         BNER  14
@@L553   EQU   *
         L     12,4(,10)
         L     5,172(13)
         LTR   5,5
         BNE   @@L777
@@L554   EQU   *
         L     12,4(,10)
         ST    2,32(9)
         L     14,=A(@@L552)
         BR    14
@@L777   EQU   *
         L     12,4(,10)
         ST    2,88(13)
         MVC   92(4,13),120(13)
         MVC   96(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(RPLRTX)
         BALR  14,15
         B     @@L554
@@L776   EQU   *
         L     12,4(,10)
         ST    15,88(13)
         MVC   92(4,13),112(13)
         MVC   96(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(RPLRTX)
         BALR  14,15
         B     @@L553
@@L749   EQU   *
         L     12,4(,10)
         MVC   88(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(RESET@US)
         BALR  14,15
         L     14,=A(@@L551)
         BR    14
@@L748   EQU   *
         L     12,4(,10)
         MVC   88(4,13),16(2)
         B     @@PGE12
         DS    0F
         LTORG
         DS    0F
@@PGE12  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG13   EQU   *
         LA    1,88(,13)
         L     15,=V(RESET@US)
         BALR  14,15
         L     14,=A(@@L550)
         BR    14
@@L747   EQU   *
         L     12,8(,10)
         MVC   88(4,13),120(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L548)
         BER   14
@@L546   EQU   *
         L     12,8(,10)
         MVC   240(4,13),=F'0'
         L     14,=A(@@L547)
         BR    14
@@L543   EQU   *
         L     12,8(,10)
         MVC   236(4,13),=F'0'
         L     14,=A(@@L544)
         BR    14
@@L746   EQU   *
         L     12,8(,10)
         MVC   88(4,13),112(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         BNE   @@L543
         L     14,=A(@@L545)
         BR    14
@@L745   EQU   *
         L     12,8(,10)
         L     2,144(13)
         LTR   2,2
         L     14,=A(@@L542)
         BER   14
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L542)
         BER   14
         L     14,=A(@@L717)
         BR    14
@@L744   EQU   *
         L     12,8(,10)
         L     2,4(3)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,24(3)
         A     2,=F'1'
         ST    2,24(3)
         L     14,=A(@@L538)
         BR    14
@@L743   EQU   *
         L     12,8(,10)
         MVC   88(4,13),4(4)
         L     5,=A(@@1)
         L     2,8(5)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L531)
         BNER  14
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L778
@@L534   EQU   *
         L     12,8(,10)
         MVC   88(4,13),8(5)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(REMNOTE)
         BALR  14,15
         L     14,=A(@@L531)
         BR    14
@@L778   EQU   *
         L     12,8(,10)
         L     2,4(3)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,24(3)
         BCTR  2,0
         ST    2,24(3)
         B     @@L534
@@L742   EQU   *
         L     12,8(,10)
         MVC   88(4,13),156(13)
         LA    1,88(,13)
         L     15,=V(CHECK@AS)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(@@L528)
         BNER  14
@@L718   EQU   *
         L     12,8(,10)
         LA    1,88(,13)
         L     15,=A(@@54)
         BALR  14,15
         LR    15,2
         L     14,=A(@@L357)
         BR    14
@@L741   EQU   *
         L     12,8(,10)
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(CHECK@AS)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L717)
         BER   14
         L     6,176(13)
         LTR   6,6
         L     14,=A(@@L717)
         BNER  14
         L     2,180(13)
         LTR   2,2
         L     14,=A(@@L717)
         BNER  14
         L     14,=A(@@L525)
         BR    14
@@L740   EQU   *
         L     12,8(,10)
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(ASM@NOPE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L496)
         BNLR  14
         L     3,132(13)
         LH    2,0(3)
         CLM   2,3,=H'39'
         L     14,=A(@@L496)
         BNER  14
         L     4,4(3)
         L     2,0(4)
         LA    3,2(0,0)
         CLR   2,3
         L     14,=A(@@L496)
         BNER  14
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'47'
         L     14,=A(@@L496)
         BNER  14
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'133'
         L     14,=A(@@L496)
         BER   14
         CLM   2,3,=H'64'
         L     14,=A(@@L496)
         BER   14
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'47'
         L     14,=A(@@L496)
         BNER  14
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'133'
         L     14,=A(@@L496)
         BER   14
         CH    2,=H'64'
         L     14,=A(@@L496)
         BER   14
         L     4,4(11)
         L     15,4(4)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L779
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L520   EQU   *
         L     12,8(,10)
         L     2,132(13)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),8(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@47)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L496)
         BNER  14
         L     5,132(13)
         L     3,4(5)
         L     2,8(3)
         L     4,4(2)
         LH    2,0(4)
         CLM   2,3,=H'48'
         L     14,=A(@@L496)
         BER   14
         L     2,4(3)
         L     2,4(2)
         LH    2,0(2)
         CLM   2,3,=H'48'
         L     14,=A(@@L496)
         BER   14
         ST    4,88(13)
         L     2,4(5)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L496)
         BNER  14
         L     3,132(13)
         L     2,4(3)
         L     2,4(2)
         MVC   88(4,13),4(2)
         L     2,4(3)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L496)
         BNER  14
         L     2,132(13)
         L     2,4(2)
         L     2,4(2)
         MVC   88(4,13),8(2)
         LA    1,88(,13)
         L     15,=A(@@50)
         BALR  14,15
         LTR   15,15
         BE    @@L521
         L     2,132(13)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),8(2)
         LA    1,88(,13)
         L     15,=A(@@50)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L496)
         BNER  14
@@L521   EQU   *
         L     12,8(,10)
         L     2,=V(GLBRTL)
         MVC   88(4,13),4(2)
         L     2,132(13)
         L     2,4(2)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         BE    @@L522
         L     2,132(13)
         L     2,4(2)
         MVC   144(4,13),4(2)
         MVC   132(4,13),8(2)
@@L523   EQU   *
         L     12,8(,10)
         LA    2,144(,13)
         ST    2,88(13)
         MVC   92(4,13),4(11)
         LA    2,148(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,188(13)
         LTR   15,15
         L     14,=A(@@L496)
         BLR   14
         LA    2,132(,13)
         ST    2,88(13)
@@L711   EQU   *
         L     12,8(,10)
         ST    9,92(13)
         LA    2,136(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,184(13)
         L     14,=A(@@L496)
         BR    14
@@L522   EQU   *
         L     12,8(,10)
         L     2,132(13)
         L     2,4(2)
         MVC   144(4,13),8(2)
         MVC   132(4,13),4(2)
         B     @@L523
@@L779   EQU   *
         L     12,8(,10)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L520
@@L739   EQU   *
         L     12,8(,10)
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(ASM@NOPE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L497)
         BNLR  14
         L     5,132(13)
         LH    2,0(5)
         CLM   2,3,=H'39'
         L     14,=A(@@L497)
         BNER  14
         L     3,4(5)
         L     2,0(3)
         LA    4,2(0,0)
         CLR   2,4
         L     14,=A(@@L497)
         BNER  14
         L     4,4(3)
         LH    2,0(4)
         CLM   2,3,=H'47'
         L     14,=A(@@L497)
         BNER  14
         L     2,8(4)
         LH    2,0(2)
         CLM   2,3,=H'120'
         L     14,=A(@@L497)
         BNER  14
         L     3,8(3)
         LH    2,0(3)
         CLM   2,3,=H'47'
         L     14,=A(@@L497)
         BNER  14
         MVC   88(4,13),8(3)
         L     2,4(5)
         L     2,4(2)
         L     2,8(2)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L497)
         BER   14
         L     5,4(11)
         L     15,4(5)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L780)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L499   EQU   *
         L     12,8(,10)
         L     2,132(13)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),8(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@47)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L497)
         BNER  14
         L     6,132(13)
         L     2,4(6)
         L     2,8(2)
         L     2,4(2)
         LH    3,0(2)
         CLM   3,3,=H'133'
         L     14,=A(@@L497)
         BER   14
         CLM   3,3,=H'64'
         L     14,=A(@@L497)
         BER   14
         LR    5,2
         CLM   3,3,=H'61'
         BE    @@L781
@@L500   EQU   *
         L     12,8(,10)
         L     2,4(6)
         L     2,8(2)
         L     15,4(2)
         LH    2,0(15)
         CLM   2,3,=H'63'
         BE    @@L782
@@L501   EQU   *
         L     12,8(,10)
         L     2,4(6)
         L     2,8(2)
         MVC   88(4,13),4(2)
         L     2,4(6)
         L     2,8(2)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L497)
         BNER  14
         ST    9,88(13)
         MVC   92(4,13),=F'10'
         L     2,132(13)
         L     2,4(2)
         L     2,4(2)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    4,15
         LTR   15,15
         L     14,=A(@@L497)
         BNER  14
         L     2,132(13)
         L     3,4(2)
         MVC   144(4,13),4(3)
         L     2,144(13)
         L     6,4(2)
         MVC   132(4,13),8(3)
         L     2,132(13)
         L     2,8(2)
         SLR   3,3
         IC    3,2(2)
         ST    3,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         L     2,132(13)
         A     2,=F'8'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         LA    2,144(,13)
         ST    2,88(13)
         MVC   92(4,13),4(11)
         LA    2,148(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,188(13)
         LTR   15,15
         BL    @@L502
         LA    2,132(,13)
         ST    2,88(13)
         ST    9,92(13)
         LA    2,136(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,184(13)
@@L502   EQU   *
         L     12,8(,10)
         L     5,184(13)
         LTR   5,5
         L     14,=A(@@L496)
         BLR   14
         MVC   16(4,9),132(13)
         MVC   88(4,13),=F'4'
         ST    4,92(13)
         ST    9,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(GRFMUE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@61)
         BALR  14,15
         L     5,12(9)
@@L504   EQU   *
         L     12,8(,10)
         LTR   5,5
         L     14,=A(@@L496)
         BER   14
         L     2,=V(N@BASIC@)
         L     3,0(2)
         BCTR  3,0
         L     2,=A(@@33)
         L     4,0(2)
         CLR   4,3
         BE    @@L516
         MH    4,=H'4'
         L     2,=V(BBINFO)
         A     4,0(2)
         L     2,20(4)
         CL    5,0(2)
         L     14,=A(@@L496)
         BER   14
@@L516   EQU   *
         L     12,8(,10)
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L784
@@L506   EQU   *
         L     12,8(,10)
         L     5,12(5)
         B     @@L504
@@L784   EQU   *
         L     12,8(,10)
         ST    6,88(13)
         MVC   92(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         BE    @@L506
         L     3,24(5)
         LTR   3,3
         L     14,=A(@@L496)
         BER   14
@@L515   EQU   *
         L     12,8(,10)
         L     2,4(3)
         CLR   2,9
         BE    @@L785
@@L512   EQU   *
         L     12,8(,10)
         L     3,8(3)
         LTR   3,3
         BNE   @@L515
         L     14,=A(@@L496)
         BR    14
@@L785   EQU   *
         L     12,8(,10)
         MVC   4(4,3),8(11)
         B     @@L512
@@L782   EQU   *
         L     12,8(,10)
         L     5,4(15)
         LH    2,0(5)
         CLM   2,3,=H'61'
         BNE   @@L501
         L     2,=A(@@8)
         L     3,0(2)
         L     2,4(5)
         SLL   2,2
         L     4,0(2,3)
         LTR   4,4
         BE    @@L501
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'31'
         BH    @@L501
         L     2,=V(WORD@MOD)
         L     3,0(2)
         SLL   3,2
         L     2,=V(MODE@MAS)
         CL    4,0(3,2)
         L     14,=A(@@L497)
         BNER  14
         B     @@L501
@@L781   EQU   *
         L     12,8(,10)
         L     2,=A(@@8)
         L     3,0(2)
         L     2,4(5)
         SLL   2,2
         L     4,0(2,3)
         LTR   4,4
         BE    @@L500
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'31'
         BH    @@L500
         L     2,=V(WORD@MOD)
         L     3,0(2)
         SLL   3,2
         L     2,=V(MODE@MAS)
         CL    4,0(3,2)
         L     14,=A(@@L497)
         BNER  14
         B     @@L500
@@L780   EQU   *
         L     12,8(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L499
@@L738   EQU   *
         L     12,8(,10)
         L     3,132(13)
         LH    2,0(3)
         CLM   2,3,=H'47'
         L     14,=A(@@L451)
         BNER  14
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ASM@NOPE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L451)
         BNLR  14
         L     8,112(13)
         MVC   88(4,13),132(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(SPLIT@IN)
         BALR  14,15
         ST    15,140(13)
         LTR   15,15
         L     14,=A(@@L786)
         BER   14
@@L452   EQU   *
         L     12,8(,10)
         L     3,140(13)
         LTR   3,3
         BE    @@L456
         LH    2,0(3)
         CLM   2,3,=H'24'
         L     14,=A(@@L787)
         BER   14
@@L456   EQU   *
         L     12,8(,10)
         L     3,140(13)
         LTR   3,3
         L     14,=A(@@L457)
         BER   14
         LH    2,0(3)
         CLM   2,3,=H'24'
         L     14,=A(@@L457)
         BER   14
         LA    2,140(,13)
         ST    2,88(13)
         ST    9,92(13)
         LA    2,136(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,184(13)
         LTR   15,15
         BL    @@L459
         MVC   132(4,13),140(13)
@@L459   EQU   *
         L     12,8(,10)
         L     5,184(13)
         LTR   5,5
         L     14,=A(@@L496)
         BNLR  14
         LA    6,132(,13)
         ST    6,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@59)
         BALR  14,15
         LR    5,15
         LTR   15,15
         L     14,=A(@@L496)
         BER   14
         L     4,112(13)
         LH    2,0(4)
         CLM   2,3,=H'61'
         L     14,=A(@@L496)
         BNER  14
         L     2,0(15)
         IC    2,2(2)
         CLM   2,1,2(4)
         BE    @@L487
         CLM   2,1,=XL1'00'
         BE    @@L487
         L     3,4(4)
         LA    2,19(0,0)
         CLR   3,2
         BNH   @@L487
         MH    3,=H'4'
         L     2,=V(REG@N@IN)
         A     3,0(2)
         L     2,16(3)
         L     2,12(2)
         LA    3,1(0,0)
         CLR   2,3
         L     14,=A(@@L496)
         BNER  14
         L     6,180(13)
         LTR   6,6
         L     14,=A(@@L496)
         BNER  14
         L     2,0(4)
         SRL   2,4
         NR    2,3
         LTR   2,2
         L     14,=A(@@L496)
         BNER  14
@@L487   EQU   *
         L     12,8(,10)
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         CR    15,9
         BE    @@L488
         L     2,4(11)
         L     15,4(2)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L788)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L490   EQU   *
         L     12,8(,10)
         MVC   88(4,13),0(5)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@47)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L496)
         BNER  14
@@L488   EQU   *
         L     12,8(,10)
         MVC   88(4,13),112(13)
         MVC   92(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L496)
         BNER  14
         L     7,112(13)
         L     2,0(5)
         L     2,0(2)
         LR    8,2
         SRL   8,16
         LR    4,2
         SRL   4,8
         N     4,=F'255'
         SLR   2,2
         IC    2,2(7)
         CLR   2,4
         BE    @@L491
         LTR   4,4
         L     14,=A(@@L789)
         BNER  14
@@L491   EQU   *
         L     12,8(,10)
         LA    2,78(0,0)
         CLR   8,2
         BE    @@L790
@@L493   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    7,96(13)
         MVC   100(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,144(13)
         ST    5,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         LA    2,144(,13)
         ST    2,88(13)
         MVC   92(4,13),4(11)
         LA    2,148(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,188(13)
         LTR   15,15
         L     14,=A(@@L496)
         BLR   14
         LA    3,78(0,0)
         CLR   8,3
         BE    @@L791
@@L495   EQU   *
         L     12,8(,10)
         LA    5,132(,13)
         ST    5,88(13)
         B     @@L711
@@L791   EQU   *
         L     12,8(,10)
         L     4,216(13)
         LTR   4,4
         L     14,=A(@@L496)
         BER   14
         B     @@L495
@@L790   EQU   *
         L     12,8(,10)
         L     2,0(5)
         L     3,8(2)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L493
         L     2,4(3)
         LTR   2,2
         BNH   @@L493
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L493
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'87'
         ST    4,92(13)
         L     2,0(5)
         MVC   96(4,13),4(2)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     2,0(5)
         LH    8,0(2)
         N     8,=XL4'0000FFFF'
         B     @@L493
@@L789   EQU   *
         L     12,8(,10)
         ST    4,88(13)
         MVC   92(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
         LR    7,15
         L     2,112(13)
         L     3,4(2)
         LA    6,19(0,0)
         CLR   3,6
         BNH   @@L491
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         MH    3,=H'4'
         A     3,48(2)
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L491
@@L788   EQU   *
         L     12,8(,10)
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L490
@@L457   EQU   *
         L     12,8(,10)
         LTR   3,3
         BE    @@L459
         LH    2,0(3)
         CLM   2,3,=H'24'
         BNE   @@L459
         L     2,4(3)
         L     2,0(2)
         B     @@PGE13
         DS    0F
         LTORG
         DS    0F
@@PGE13  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG14   EQU   *
         LA    5,2(0,0)
         CLR   2,5
         L     14,=A(@@L459)
         BNER  14
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         CR    15,9
         BE    @@L461
         L     6,4(11)
         L     15,4(6)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L792
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L463   EQU   *
         L     12,12(,10)
         L     2,140(13)
         L     2,4(2)
         L     2,4(2)
         MVC   88(4,13),16(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@47)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L459)
         BNER  14
@@L461   EQU   *
         L     12,12(,10)
         L     5,140(13)
         L     2,4(5)
         L     4,8(2)
         L     15,16(4)
         ST    15,152(13)
         L     2,4(2)
         MVC   144(4,13),16(2)
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'89'
         BE    @@L793
         SLR   7,7
@@L465   EQU   *
         L     12,12(,10)
         L     6,140(13)
         L     2,4(6)
         L     4,4(2)
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'89'
         BE    @@L794
         SLR   5,5
@@L469   EQU   *
         L     12,12(,10)
         L     2,112(13)
         L     3,4(2)
         LA    2,19(0,0)
         CLR   3,2
         BH    @@L795
@@L472   EQU   *
         L     12,12(,10)
         LA    2,144(,13)
         ST    2,88(13)
         MVC   92(4,13),4(11)
         LA    2,148(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,188(13)
         LTR   15,15
         BL    @@L473
         LTR   5,5
         BE    @@L473
         LTR   7,7
         BE    @@L473
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         CLR   15,9
         BE    @@L474
         MVC   88(4,13),4(5)
         MVC   92(4,13),4(11)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=V(REG@USED)
         BALR  14,15
         LTR   15,15
         BNE   @@L473
@@L474   EQU   *
         L     12,12(,10)
         LA    2,152(,13)
         ST    2,88(13)
         ST    9,92(13)
         LA    2,136(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,184(13)
@@L473   EQU   *
         L     12,12(,10)
         L     3,184(13)
         LTR   3,3
         BL    @@L475
         MVC   132(4,13),152(13)
@@L475   EQU   *
         L     12,12(,10)
         L     4,184(13)
         LTR   4,4
         L     14,=A(@@L459)
         BLR   14
         L     15,4(7)
         L     3,4(5)
         LH    2,0(15)
         CLM   2,3,=H'133'
         BE    @@L480
         CLM   2,3,=H'64'
         BE    @@L480
         CLM   2,3,=H'63'
         BE    @@L480
@@L688   EQU   *
         L     12,12(,10)
         LH    2,0(3)
         CLM   2,3,=H'133'
         BE    @@L484
         CLM   2,3,=H'64'
         BE    @@L484
         CLM   2,3,=H'63'
         BE    @@L484
@@L690   EQU   *
         L     12,12(,10)
         LH    2,0(15)
         CLM   2,3,=H'61'
         L     14,=A(@@L459)
         BNER  14
         LH    2,0(3)
         CLM   2,3,=H'61'
         L     14,=A(@@L459)
         BNER  14
         L     15,4(15)
         CL    15,4(3)
         L     14,=A(@@L459)
         BNER  14
         MH    15,=H'4'
         L     2,=V(REG@N@IN)
         A     15,0(2)
         L     3,16(15)
         L     2,12(3)
         A     2,=F'1'
         ST    2,12(3)
         L     14,=A(@@L459)
         BR    14
@@L484   EQU   *
         L     12,12(,10)
         L     3,4(3)
         LH    2,0(3)
         CLM   2,3,=H'133'
         BE    @@L484
         CLM   2,3,=H'64'
         BE    @@L484
         CLM   2,3,=H'63'
         BE    @@L484
         B     @@L690
@@L480   EQU   *
         L     12,12(,10)
         L     15,4(15)
         LH    2,0(15)
         CLM   2,3,=H'133'
         BE    @@L480
         CLM   2,3,=H'64'
         BE    @@L480
         CLM   2,3,=H'63'
         BE    @@L480
         B     @@L688
@@L795   EQU   *
         L     12,12(,10)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         MH    3,=H'4'
         A     3,48(2)
         ST    3,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L472
@@L794   EQU   *
         L     12,12(,10)
         L     2,16(4)
         LH    3,0(2)
         LR    5,2
         CLM   3,3,=H'47'
         BE    @@L469
         ST    4,88(13)
         L     2,4(6)
         L     2,4(2)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    5,15
         B     @@L469
@@L793   EQU   *
         L     12,12(,10)
         LH    2,0(15)
         LR    7,15
         CLM   2,3,=H'47'
         BE    @@L465
         ST    4,88(13)
         L     2,4(5)
         L     2,8(2)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    7,15
         B     @@L465
@@L792   EQU   *
         L     12,12(,10)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L463
@@L787   EQU   *
         L     12,12(,10)
         L     3,4(3)
         L     2,0(3)
         LA    4,1(0,0)
         CLR   2,4
         L     14,=A(@@L456)
         BNER  14
         L     2,4(3)
         MVC   140(4,13),16(2)
         L     14,=A(@@L456)
         BR    14
@@L786   EQU   *
         L     12,12(,10)
         ST    8,88(13)
         MVC   92(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L452)
         BNER  14
         L     2,132(13)
         L     5,4(2)
         L     4,112(13)
         IC    2,2(5)
         CLM   2,1,2(4)
         BE    @@L453
         CLM   2,1,=XL1'00'
         BE    @@L453
         LH    2,0(4)
         CLM   2,3,=H'61'
         BE    @@L796
@@L453   EQU   *
         L     12,12(,10)
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'2'
         MVC   92(4,13),132(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GENRV)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
         ST    15,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(SPLIT@IN)
         BALR  14,15
         LR    3,15
         ST    15,140(13)
         LTR   15,15
         L     14,=A(@@L452)
         BNER  14
         L     2,112(13)
         CLR   8,2
         L     14,=A(@@L452)
         BER   14
         LR    8,2
         MVC   88(4,13),=F'49'
         ST    15,92(13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'2'
         MVC   92(4,13),132(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GENRV)
         BALR  14,15
         MVC   88(4,13),=F'39'
         ST    3,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
         ST    15,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(SPLIT@IN)
         BALR  14,15
         ST    15,140(13)
         L     14,=A(@@L452)
         BR    14
@@L796   EQU   *
         L     12,12(,10)
         L     3,4(4)
         LA    6,19(0,0)
         CLR   3,6
         BNH   @@L454
         MH    3,=H'4'
         L     2,=V(REG@N@IN)
         A     3,0(2)
         L     2,16(3)
         L     2,12(2)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L453
         L     6,180(13)
         LTR   6,6
         BNE   @@L453
         L     2,0(4)
         SRL   2,4
         NR    2,3
         LTR   2,2
         BNE   @@L453
@@L454   EQU   *
         L     12,12(,10)
         SLR   2,2
         IC    2,2(5)
         ST    2,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
         LR    8,15
         B     @@L453
@@L737   EQU   *
         L     12,12(,10)
         L     4,132(13)
         LH    2,0(4)
         CLM   2,3,=H'39'
         L     14,=A(@@L449)
         BNER  14
         L     3,4(4)
         L     2,0(3)
         LA    5,2(0,0)
         CLR   2,5
         L     14,=A(@@L449)
         BNER  14
         L     5,4(3)
         LH    2,0(5)
         CLM   2,3,=H'47'
         L     14,=A(@@L449)
         BNER  14
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'47'
         L     14,=A(@@L449)
         BNER  14
         L     2,4(5)
         LH    2,0(2)
         CLM   2,3,=H'61'
         L     14,=A(@@L449)
         BNER  14
         ST    9,88(13)
         MVC   92(4,13),=F'10'
         L     2,4(4)
         L     2,4(2)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L449)
         BER   14
         L     2,132(13)
         L     2,4(2)
         L     2,4(2)
         MVC   88(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L449)
         BNER  14
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(ASM@NOPE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L449)
         BNLR  14
         L     2,132(13)
         L     2,4(2)
         MVC   132(4,13),8(2)
@@L710   EQU   *
         L     12,12(,10)
         ST    6,88(13)
         ST    9,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         ST    15,184(13)
         L     14,=A(@@L449)
         BR    14
@@L736   EQU   *
         L     12,12(,10)
         L     4,132(13)
         LH    2,0(4)
         CLM   2,3,=H'39'
         L     14,=A(@@L448)
         BNER  14
         L     3,4(4)
         L     2,0(3)
         LA    5,2(0,0)
         CLR   2,5
         L     14,=A(@@L448)
         BNER  14
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'47'
         L     14,=A(@@L448)
         BNER  14
         L     3,8(3)
         LH    2,0(3)
         CLM   2,3,=H'47'
         L     14,=A(@@L448)
         BNER  14
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'61'
         L     14,=A(@@L448)
         BNER  14
         ST    9,88(13)
         MVC   92(4,13),=F'10'
         L     2,4(4)
         L     2,8(2)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L448)
         BER   14
         L     2,132(13)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L448)
         BNER  14
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(ASM@NOPE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L448)
         BNLR  14
         L     2,132(13)
         L     2,4(2)
         MVC   132(4,13),4(2)
         B     @@L710
@@L735   EQU   *
         L     12,12(,10)
         L     2,132(13)
         L     2,4(2)
         BCTR  8,0
         MH    8,=H'4'
         L     5,196(13)
         ST    5,4(8,2)
         L     14,=A(@@L382)
         BR    14
@@L734   EQU   *
         L     12,12(,10)
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),120(13)
         MVC   100(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     14,=A(@@L444)
         BR    14
@@L733   EQU   *
         L     12,12(,10)
         L     3,4(4)
         L     8,176(13)
         A     8,0(3)
         A     8,180(13)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(RTVEC@AL)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
         ST    15,132(13)
         L     2,0(3)
         SLL   2,2
         L     6,4(15)
         A     6,=F'4'
         LR    7,2
         LR    4,3
         A     4,=F'4'
         LR    5,2
         MVCL  6,4
         L     14,=A(@@L441)
         BR    14
@@L732   EQU   *
         L     12,12(,10)
         L     2,8(4)
         LH    2,0(2)
         CLM   2,3,=H'78'
         L     14,=A(@@L436)
         BNER  14
         L     2,216(13)
         LTR   2,2
         L     14,=A(@@L717)
         BER   14
         L     14,=A(@@L436)
         BR    14
@@L730   EQU   *
         L     12,12(,10)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         L     14,=A(@@L435)
         BR    14
@@L729   EQU   *
         L     12,12(,10)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         L     14,=A(@@L430)
         BR    14
@@L728   EQU   *
         L     12,12(,10)
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         L     14,=A(@@L425)
         BR    14
@@L423   EQU   *
         L     12,12(,10)
         L     5,4(11)
         L     15,4(5)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L797
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L428   EQU   *
         L     12,12(,10)
         L     2,=A(@@29)
         ST    15,0(2)
         MVC   88(4,13),116(13)
         L     2,=V(GLBRTL)
         MVC   92(4,13),0(2)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         ST    15,116(13)
         L     14,=A(@@L422)
         BR    14
@@L797   EQU   *
         L     12,12(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L428
@@L727   EQU   *
         L     12,12(,10)
         MVC   88(4,13),196(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,196(13)
         L     14,=A(@@L421)
         BR    14
@@L726   EQU   *
         L     12,12(,10)
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),112(13)
         MVC   100(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     14,=A(@@L419)
         BR    14
@@L417   EQU   *
         L     12,12(,10)
         ST    9,88(13)
         MVC   92(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(DEDSET)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L416)
         BNER  14
         MVC   88(4,13),4(11)
         L     14,=A(@@L709)
         BR    14
@@L725   EQU   *
         L     12,12(,10)
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'78'
         L     14,=A(@@L412)
         BNER  14
@@L413   EQU   *
         L     12,12(,10)
         MVC   216(4,13),=F'1'
         L     14,=A(@@L412)
         BR    14
@@L724   EQU   *
         L     12,12(,10)
         L     3,4(11)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L798)
         BER   14
         L     5,8(11)
@@L386   EQU   *
         L     12,12(,10)
         LTR   5,5
         L     14,=A(@@L384)
         BER   14
         L     8,8(5)
         LH    7,0(8)
         LR    2,7
         AH    2,=H'-54'
         CLM   2,3,=H'1'
         L     14,=A(@@L384)
         BHR   14
         L     4,4(5)
         LH    2,0(4)
         CLM   2,3,=H'61'
         L     14,=A(@@L384)
         BNER  14
         SLR   3,3
         IC    3,2(4)
         LR    2,3
         MH    2,=H'4'
         L     6,=V(MODE@CLA)
         L     2,0(2,6)
         LA    6,1(0,0)
         CLR   2,6
         L     14,=A(@@L384)
         BNER  14
         L     15,=V(MODE@SIZ)
         IC    2,0(15,3)
         CLM   2,1,=XL1'08'
         L     14,=A(@@L384)
         BNER  14
         L     6,16(9)
         LH    2,0(6)
         CLM   2,3,=H'47'
         L     14,=A(@@L384)
         BNER  14
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'63'
         L     14,=A(@@L384)
         BNER  14
         L     2,4(3)
         CLR   2,4
         L     14,=A(@@L384)
         BNER  14
         SLR   2,2
         IC    2,2(3)
         LR    3,2
         MH    2,=H'4'
         L     4,=V(MODE@CLA)
         L     2,0(2,4)
         LA    4,1(0,0)
         CLR   2,4
         L     14,=A(@@L384)
         BNER  14
         IC    2,0(15,3)
         CLM   2,1,=XL1'04'
         L     14,=A(@@L384)
         BNER  14
         L     2,8(6)
         LH    2,0(2)
         CLM   2,3,=H'54'
         L     14,=A(@@L384)
         BNER  14
         CLM   7,3,=H'54'
         L     14,=A(@@L799)
         BER   14
         L     7,8(8)
         L     4,12(8)
@@L392   EQU   *
         L     12,12(,10)
         MVC   88(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L393)
         BER   14
         L     2,16(9)
         L     2,8(2)
         L     7,4(2)
@@L395   EQU   *
         L     12,12(,10)
         L     3,=A(@@4)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         L     2,=A(@@30)
         ST    9,0(2)
         L     6,4(11)
         L     15,4(6)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L800
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L404   EQU   *
         L     12,12(,10)
         L     2,=A(@@29)
         ST    15,0(2)
         MVC   176(4,13),=F'0'
         MVC   180(4,13),176(13)
         MVC   112(4,13),4(5)
         ST    7,88(13)
         ST    4,92(13)
         L     2,4(5)
         SLR   3,3
         IC    3,2(2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(IMMED@DO)
         BALR  14,15
         A     5,=F'8'
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     4,4(11)
         MVC   132(4,13),16(4)
         L     14,=A(@@L382)
         BR    14
@@L800   EQU   *
         L     12,12(,10)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L404
@@L393   EQU   *
         L     12,12(,10)
         L     2,16(9)
         L     2,8(2)
         L     4,4(2)
         B     @@L395
@@L799   EQU   *
         L     12,12(,10)
         L     7,4(8)
         LR    4,7
         X     4,=F'-1'
         SRL   4,31
         BCTR  4,0
         B     @@L392
@@L798   EQU   *
         L     12,12(,10)
         L     4,4(11)
         L     2,16(4)
         LH    3,0(2)
         LR    5,2
         CLM   3,3,=H'47'
         BE    @@L386
         MVC   88(4,13),4(11)
         L     5,4(11)
         MVC   92(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    5,15
         B     @@L386
@@L723   EQU   *
         L     12,12(,10)
         LH    2,0(9)
         CLM   2,3,=H'32'
         L     14,=A(@@L365)
         BNER  14
         L     4,16(9)
         LH    2,0(4)
         CLM   2,3,=H'47'
         L     14,=A(@@L365)
         BNER  14
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'61'
         L     14,=A(@@L365)
         BNER  14
         L     2,4(3)
         LA    3,19(0,0)
         CLR   2,3
         L     14,=A(@@L365)
         BNHR  14
         ST    9,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),8(4)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L365)
         BER   14
         L     4,4(11)
         L     2,16(4)
         LH    2,0(2)
         CLM   2,3,=H'39'
         L     14,=A(@@L365)
         BNER  14
         L     2,16(9)
         MVC   88(4,13),4(2)
         B     @@PGE14
         DS    0F
         LTORG
         DS    0F
@@PGE14  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG15   EQU   *
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L365)
         BNER  14
         L     3,16(9)
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'133'
         L     14,=A(@@L365)
         BER   14
         CLM   2,3,=H'64'
         L     14,=A(@@L365)
         BER   14
         MVC   88(4,13),8(3)
         MVC   92(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L365)
         BNER  14
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         CR    15,9
         L     14,=A(@@L365)
         BNER  14
         L     7,16(4)
         L     6,8(11)
         L     2,4(7)
         C     6,0(2)
         BNL   @@L367
@@L372   EQU   *
         L     12,16(,10)
         LR    3,6
         MH    3,=H'4'
         L     2,4(3,2)
         LH    2,0(2)
         CLM   2,3,=H'47'
         BE    @@L371
         CH    2,=H'49'
         BE    @@L371
@@L368   EQU   *
         L     12,16(,10)
         A     6,=F'1'
         L     2,4(7)
         C     6,0(2)
         BL    @@L372
@@L367   EQU   *
         L     12,16(,10)
         L     2,4(7)
         LR    5,2
         L     2,0(2)
         CR    6,2
         L     14,=A(@@L365)
         BNER  14
         SLR   6,6
         CR    6,2
         L     14,=A(@@L365)
         BNLR  14
@@L383   EQU   *
         L     12,16(,10)
         LR    8,6
         MH    8,=H'4'
         L     4,4(8,5)
         LH    2,0(4)
         CLM   2,3,=H'47'
         BE    @@L379
         CH    2,=H'49'
         BE    @@L379
@@L376   EQU   *
         L     12,16(,10)
         A     6,=F'1'
         C     6,0(5)
         BL    @@L383
         L     14,=A(@@L365)
         BR    14
@@L379   EQU   *
         L     12,16(,10)
         L     3,16(9)
         L     2,4(4)
         C     2,8(3)
         BNE   @@L376
         L     3,=A(@@4)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         L     2,=A(@@30)
         ST    9,0(2)
         L     5,4(11)
         L     15,4(5)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L801
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L381   EQU   *
         L     12,16(,10)
         L     2,=A(@@29)
         ST    15,0(2)
         MVC   176(4,13),=F'0'
         MVC   180(4,13),176(13)
         L     3,16(9)
         MVC   112(4,13),8(3)
         L     2,4(7)
         L     2,4(8,2)
         A     2,=F'4'
         ST    2,88(13)
         MVC   92(4,13),4(3)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         ST    7,132(13)
         MVC   212(4,13),=F'1'
         L     14,=A(@@L382)
         BR    14
@@L801   EQU   *
         L     12,16(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L381
@@L371   EQU   *
         L     12,16(,10)
         L     2,16(9)
         MVC   88(4,13),4(2)
         L     2,4(7)
         L     2,4(3,2)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         BE    @@L368
         B     @@L367
@@L722   EQU   *
         L     12,16(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         CR    4,15
         L     14,=A(@@L364)
         BHR   14
         L     14,=A(@@L360)
         BR    14
@@L721   EQU   *
         L     12,16(,10)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         LR    4,15
         L     14,=A(@@L362)
         BR    14
@@L357   EQU   *
         L     12,16(,10)
* Function try_combine epilogue
         PDPEPIL
* Function try_combine literal pool
         DS    0F
         LTORG
* Function try_combine page table
         DS    0F
@@PGT11  EQU   *
         DC    A(@@PG11)
         DC    A(@@PG12)
         DC    A(@@PG13)
         DC    A(@@PG14)
         DC    A(@@PG15)
         DS    0F
* S-func undo_all prologue
@@54     PDPPRLG CINDEX=16,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN16
         LTORG
@@FEN16  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG16   EQU   *
         LR    11,1
         L     10,=A(@@PGT16)
* Function undo_all code
         L     2,=A(@@1)
         L     15,0(2)
         LTR   15,15
         BE    @@L811
@@L809   EQU   *
         L     3,0(15)
         L     2,12(15)
         MVC   0(4,2),8(15)
         L     2,=A(@@1)
         MVC   0(4,15),4(2)
         ST    15,4(2)
         LR    15,3
         LTR   3,3
         BNE   @@L809
@@L811   EQU   *
         L     2,=A(@@1)
         MVC   0(4,2),=F'0'
         L     2,=A(@@25)
         MVC   0(4,2),=F'0'
* Function undo_all epilogue
         PDPEPIL
* Function undo_all literal pool
         DS    0F
         LTORG
* Function undo_all page table
         DS    0F
@@PGT16  EQU   *
         DC    A(@@PG16)
         DS    0F
* S-func undo_commit prologue
@@65     PDPPRLG CINDEX=17,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN17
         LTORG
@@FEN17  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG17   EQU   *
         LR    11,1
         L     10,=A(@@PGT17)
* Function undo_commit code
         L     2,=A(@@1)
         L     15,0(2)
         LTR   15,15
         BE    @@L819
@@L817   EQU   *
         L     3,0(15)
         L     2,=A(@@1)
         MVC   0(4,15),4(2)
         ST    15,4(2)
         LR    15,3
         LTR   3,3
         BNE   @@L817
@@L819   EQU   *
         L     2,=A(@@1)
         MVC   0(4,2),=F'0'
* Function undo_commit epilogue
         PDPEPIL
* Function undo_commit literal pool
         DS    0F
         LTORG
* Function undo_commit page table
         DS    0F
@@PGT17  EQU   *
         DC    A(@@PG17)
         DS    0F
* S-func find_split_point prologue
@@59     PDPPRLG CINDEX=18,FRAME=168,BASER=12,ENTRY=NO
         B     @@FEN18
         LTORG
@@FEN18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG18   EQU   *
         LR    11,1
         L     10,=A(@@PGT18)
* Function find_split_point code
         MVC   120(4,13),0(11)
         MVC   124(4,13),4(11)
@@L823   EQU   *
         L     2,120(13)
         L     7,0(2)
         L     4,0(7)
         LR    9,4
         SRL   9,16
         MVC   132(4,13),=F'0'
         MVC   128(4,13),132(13)
         MVC   136(4,13),132(13)
         MVC   140(4,13),136(13)
         LR    3,9
         A     3,=F'-47'
         LA    6,37(0,0)
         CLR   3,6
         L     14,=A(@@L821)
         BHR   14
         MH    3,=H'4'
         L     2,=A(@@L881)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L881   EQU   *
         DC    A(@@L834)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L822)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L824)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L875)
         DC    A(@@L875)
@@L822   EQU   *
         A     7,=F'4'
         ST    7,120(13)
         B     @@L823
@@L834   EQU   *
         L     3,4(7)
         L     2,=V(GLBRTL)
         CL    3,4(2)
         L     14,=A(@@L902)
         BER   14
@@L835   EQU   *
         L     12,0(,10)
         LR    6,7
         A     6,=F'8'
         ST    6,148(13)
         ST    6,88(13)
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@59)
         BALR  14,15
         LTR   15,15
         BE    @@L837
         CLR   15,6
         L     14,=A(@@L820)
         BNER  14
@@L837   EQU   *
         LR    2,7
         A     2,=F'4'
         ST    2,152(13)
         ST    2,88(13)
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@59)
         BALR  14,15
         LTR   15,15
         BE    @@L838
         CLR   15,2
         L     14,=A(@@L820)
         BNER  14
@@L838   EQU   *
         L     3,4(7)
         LH    2,0(3)
         CLM   2,3,=H'133'
         L     14,=A(@@L903)
         BER   14
@@L839   EQU   *
         L     12,0(,10)
         L     4,8(7)
         LH    9,0(4)
         N     9,=XL4'0000FFFF'
         LR    3,9
         A     3,=F'-83'
         LA    6,50(0,0)
         CLR   3,6
         BH    @@L844
         MH    3,=H'4'
         L     2,=A(@@L860)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L860   EQU   *
         DC    A(@@L845)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L851)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L844)
         DC    A(@@L855)
         DC    A(@@L855)
@@L845   EQU   *
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L844
         L     2,4(4)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L844
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         ST    15,132(13)
         LA    2,6(0,0)
         CR    15,2
         BNH   @@L844
         L     3,4(7)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L844
         ST    3,88(13)
         MVC   92(4,13),124(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FIND@SIN)
         BALR  14,15
         LTR   15,15
         BE    @@L844
         L     15,0(15)
         LH    2,0(15)
         AH    2,=H'-102'
         CLM   2,3,=H'1'
         BH    @@L844
         L     4,4(15)
         CL    4,4(7)
         BNE   @@L844
         L     3,8(15)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L844
         SLR   2,2
         IC    2,2(4)
         ST    2,88(13)
         L     2,8(7)
         MVC   92(4,13),4(2)
         MVC   96(4,13),132(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'1'
         MVC   112(4,13),=F'0'
         MVC   116(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@67)
         BALR  14,15
         LTR   15,15
         BE    @@L844
         A     7,=F'8'
         ST    7,88(13)
@@L897   EQU   *
         L     12,0(,10)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L823
@@L844   EQU   *
         L     12,0(,10)
         L     6,128(13)
         LTR   6,6
         BE    @@L861
         L     2,132(13)
         LTR   2,2
         BL    @@L861
         LR    4,2
         AR    4,6
         L     3,140(13)
         SLR   2,2
         IC    2,2(3)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CLR   4,2
         BH    @@L861
         L     2,8(7)
         SLR   5,5
         IC    5,2(2)
         L     4,136(13)
         LTR   4,4
         BE    @@L862
         LA    2,8(0,0)
         CLR   6,2
         BNH   @@L904
@@L862   EQU   *
         ST    5,88(13)
         MVC   92(4,13),140(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'0'
         LR    3,5
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         N     3,=XL4'0000FFFF'
         S     3,128(13)
         LR    2,3
         S     2,132(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'87'
         ST    5,92(13)
         ST    4,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'0'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         XC    136(4,13),=F'1'
         LA    2,90(0,0)
         S     2,136(13)
         ST    2,88(13)
         ST    5,92(13)
         ST    4,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,7
         A     2,=F'8'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@59)
         BALR  14,15
         LTR   15,15
         BE    @@L861
         CLR   15,2
         L     14,=A(@@L820)
         BNER  14
@@L861   EQU   *
         L     15,8(7)
         LH    3,0(15)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'F2'
         BE    @@L869
         CLM   2,1,=XL1'83'
         BE    @@L869
         CLM   2,1,=XL1'4C'
         BE    @@L869
@@L868   EQU   *
         L     4,8(7)
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'F2'
         BE    @@L873
         CLM   2,1,=XL1'83'
         BE    @@L873
         CLM   2,1,=XL1'4C'
         BE    @@L873
         CLM   2,1,=XL1'F1'
         BE    @@L873
@@L882   EQU   *
         L     12,0(,10)
         SLR   15,15
         L     14,=A(@@L820)
         BR    14
@@L873   EQU   *
         MVC   88(4,13),4(4)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(REGISTER)
         BALR  14,15
         LTR   15,15
         BNE   @@L882
         L     15,8(7)
@@L901   EQU   *
         L     12,0(,10)
         A     15,=F'4'
         L     14,=A(@@L820)
         BR    14
@@L869   EQU   *
         L     2,8(15)
         LH    3,0(2)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L870
         CLM   3,3,=H'54'
         BE    @@L870
         CLM   3,3,=H'55'
         BE    @@L870
         CLM   3,3,=H'58'
         BE    @@L870
         CLM   3,3,=H'134'
         BE    @@L870
         CLM   3,3,=H'56'
         BE    @@L870
         CLM   3,3,=H'140'
         BNE   @@L868
@@L870   EQU   *
         L     4,=V(RTX@CLAS)
         L     3,4(15)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BE    @@L871
         LH    2,0(3)
         CLM   2,3,=H'63'
         BNE   @@L868
         L     2,4(3)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BNE   @@L868
@@L871   EQU   *
         L     12,0(,10)
         A     15,=F'8'
         L     14,=A(@@L820)
         BR    14
@@L904   EQU   *
         ST    5,88(13)
         MVC   92(4,13),140(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'90'
         ST    5,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'0'
         LA    2,1(0,0)
         SLL   2,0(6)
         BCTR  2,0
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    5,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,7
         A     2,=F'8'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@59)
         BALR  14,15
         LTR   15,15
         BE    @@L861
         CLR   15,2
         L     14,=A(@@L820)
         BNER  14
         B     @@L861
@@L851   EQU   *
         MVC   140(4,13),4(4)
         L     5,=V(MODE@CLA)
         L     6,140(13)
         SLR   3,3
         IC    3,2(6)
         LR    2,3
         MH    2,=H'4'
         L     2,0(2,5)
         LA    6,3(0,0)
         CLR   2,6
         BE    @@L844
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'4'
         L     2,0(2,5)
         CLR   2,6
         BE    @@L844
         MVC   132(4,13),=F'0'
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         N     3,=XL4'0000FFFF'
         ST    3,128(13)
         MVC   136(4,13),132(13)
         B     @@L844
@@L855   EQU   *
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L844
         L     5,12(4)
         LH    2,0(5)
         CLM   2,3,=H'54'
         BNE   @@L844
         MVC   140(4,13),4(4)
         MVC   128(4,13),4(3)
         L     3,140(13)
         SLR   2,2
         IC    2,2(3)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         S     2,128(13)
         S     2,4(5)
         ST    2,132(13)
         X     9,=F'133'
         LR    4,9
         BCTR  4,0
         SRL   4,31
         ST    4,136(13)
         B     @@L844
@@L903   EQU   *
         L     6,4(3)
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         L     4,=V(MODE@BIT)
         LH    5,0(2,4)
         CLM   5,3,=H'32'
         BH    @@L839
         L     4,8(3)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BNE   @@L839
         L     3,12(3)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L839
         L     2,8(7)
         LH    2,0(2)
         CH    2,=H'54'
         BNE   @@L839
         L     4,4(4)
         A     4,4(3)
         LR    2,5
         N     2,=XL4'0000FFFF'
         CR    4,2
         BH    @@L839
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         ST    15,156(13)
         LTR   15,15
         BNE   @@L839
         L     3,4(7)
         L     5,12(3)
         L     2,8(3)
         L     4,4(2)
         L     2,8(7)
         L     8,4(2)
         MVC   160(4,13),4(3)
         L     6,160(13)
         SLR   9,9
         IC    9,2(6)
         LA    15,1(0,0)
         SLL   15,0(4)
         BCTR  15,0
         LR    2,9
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    6,0(2,3)
         N     6,=XL4'0000FFFF'
         SR    6,4
         S     6,4(5)
         CLR   8,15
         BE    @@L905
         SLL   15,0(6)
         X     15,=F'-1'
         LR    3,9
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         N     15,0(3,2)
         ST    15,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         MVC   88(4,13),156(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    9,92(13)
         MVC   96(4,13),160(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),156(13)
         SLL   8,0(6)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'84'
         ST    9,92(13)
         ST    2,96(13)
@@L899   EQU   *
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),148(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         MVC   88(4,13),152(13)
         MVC   92(4,13),160(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         LR    2,7
         A     2,=F'8'
         ST    2,88(13)
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@59)
         BALR  14,15
         LTR   15,15
         BE    @@L839
         CLR   15,2
         BE    @@L839
         L     14,=A(@@L820)
         BR    14
@@L905   EQU   *
         MVC   88(4,13),156(13)
         SLL   8,0(6)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'84'
         ST    9,92(13)
         MVC   96(4,13),160(13)
         B     @@L899
@@L902   EQU   *
         L     4,8(7)
         LH    3,0(4)
         CLM   3,3,=H'74'
         BE    @@L835
         CLM   3,3,=H'133'
         BE    @@L835
         L     5,=V(RTX@CLAS)
         LR    2,3
         N     2,=XL4'0000FFFF'
         IC    2,0(5,2)
         CLM   2,1,=XL1'96'
         BE    @@L835
         CLM   3,3,=H'63'
         BNE   @@L836
         L     2,4(4)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(5,2)
         CLM   2,1,=XL1'96'
         BE    @@L835
@@L836   EQU   *
         LR    15,7
         B     @@L871
@@L824   EQU   *
         L     3,4(7)
         LH    2,0(3)
         CLM   2,3,=H'75'
         BE    @@L906
@@L821   EQU   *
         L     12,0(,10)
         L     2,=V(RTX@CLAS)
         SLR   3,3
         IC    3,0(2,9)
         LR    2,3
         LA    4,131(0,0)
         CR    3,4
         BE    @@L888
         BH    @@L895
         LA    6,76(0,0)
         CLR   3,6
         BE    @@L888
         LA    3,130(0,0)
@@L900   EQU   *
         CLR   2,3
         BNE   @@L882
         A     7,=F'12'
         ST    7,88(13)
         A     7,=F'-12'
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@59)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L820)
         BNER  14
@@L888   EQU   *
         A     7,=F'8'
         ST    7,88(13)
         A     7,=F'-8'
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@59)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L820)
         BNER  14
@@L890   EQU   *
         LH    2,0(7)
         CLM   2,3,=H'83'
         BE    @@L891
         L     2,4(7)
         LH    2,0(2)
         LR    15,7
         A     15,=F'4'
         CLM   2,3,=H'83'
         L     14,=A(@@L820)
         BER   14
@@L891   EQU   *
         A     7,=F'4'
         ST    7,88(13)
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@59)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L820)
         BNER  14
         L     15,120(13)
         L     14,=A(@@L820)
         BR    14
@@L895   EQU   *
         LA    4,242(0,0)
         CR    3,4
         BE    @@L888
         BH    @@L896
         LA    6,241(0,0)
         CLR   3,6
         BE    @@L890
         B     @@L882
@@L896   EQU   *
         LA    3,243(0,0)
         B     @@L900
@@L906   EQU   *
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L821
         SRL   4,8
         N     4,=F'255'
         ST    4,88(13)
         MVC   92(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(MEMADP)
         BALR  14,15
         LTR   15,15
         BNE   @@L821
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     2,48(2)
         L     6,80(2)
         MVC   88(4,13),=F'47'
         ST    15,92(13)
         ST    6,96(13)
         MVC   100(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         L     2,=A(@@30)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(SPLIT@IN)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L826
         L     3,4(15)
         L     2,0(3)
         LA    4,2(0,0)
         CLR   2,4
         BE    @@L907
@@L826   EQU   *
         L     12,0(,10)
         L     4,=V(RTX@CLAS)
         L     15,4(7)
         L     3,4(15)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BE    @@L821
         LH    2,0(3)
         CLM   2,3,=H'63'
         BNE   @@L901
         L     2,4(3)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BE    @@L821
         B     @@L901
@@L907   EQU   *
         L     3,4(3)
         LH    2,0(3)
         CLM   2,3,=H'32'
         BNE   @@L826
         L     3,16(3)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BNE   @@L826
         L     4,4(3)
         CLR   4,6
         BNE   @@L826
         ST    4,88(13)
         L     2,4(15)
         L     2,4(2)
         L     2,16(2)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         ST    15,144(13)
         LTR   15,15
         BNE   @@L826
         L     2,4(5)
         L     3,8(2)
         LH    2,0(3)
         CLM   2,3,=H'32'
         BNE   @@L826
         L     3,16(3)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BNE   @@L826
         L     8,4(3)
         CLR   8,4
         BNE   @@L826
         SLR   2,2
         IC    2,2(7)
         ST    2,88(13)
         L     2,4(5)
         L     2,8(2)
         L     2,16(2)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(MEMADP)
         BALR  14,15
         LTR   15,15
         BE    @@L826
         L     3,4(5)
         L     2,4(3)
         L     2,16(2)
         L     6,8(2)
         L     2,8(3)
         L     2,16(2)
         MVC   88(4,13),8(2)
         ST    8,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(RPLRTX)
         BALR  14,15
         L     4,144(13)
         L     5,4(15)
         CLR   5,6
         L     14,=A(@@L908)
         BER   14
         LH    2,0(5)
         B     @@PGE18
         DS    0F
         LTORG
         DS    0F
@@PGE18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG19   EQU   *
         N     2,=XL4'0000FFFF'
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     2,0(2,3)
         CLI   0(2),133
         BE    @@L909
@@L828   EQU   *
         L     12,4(,10)
         LTR   4,4
         L     14,=A(@@L821)
         BER   14
         A     7,=F'4'
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         LR    15,4
         B     @@L820
@@L909   EQU   *
         L     12,4(,10)
         L     2,4(5)
         CLR   2,6
         BNE   @@L828
         LR    4,5
@@L898   EQU   *
         L     12,4(,10)
         A     4,=F'4'
         B     @@L828
@@L908   EQU   *
         L     12,4(,10)
         LR    4,15
         B     @@L898
@@L875   EQU   *
         L     12,4(,10)
         L     3,4(7)
         LH    2,0(3)
         CLM   2,3,=H'86'
         BNE   @@L876
         L     2,8(7)
         LH    2,0(2)
         CLM   2,3,=H'86'
         BNE   @@L876
         X     9,=F'84'
         LCR   2,9
         SRL   2,31
         A     2,=F'83'
         ST    2,88(13)
         SLR   2,2
         IC    2,2(7)
         ST    2,92(13)
         L     2,4(7)
         MVC   96(4,13),4(2)
         L     2,8(7)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'86'
         SLR   2,2
         IC    2,2(7)
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),120(13)
         L     14,=A(@@L897)
         BR    14
@@L876   EQU   *
         L     12,4(,10)
         L     2,8(7)
         LH    2,0(2)
         CLM   2,3,=H'86'
         L     14,=A(@@L821)
         BNER  14
         A     7,=F'4'
         ST    7,88(13)
         A     7,=F'-4'
         MVC   92(4,13),8(7)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         A     7,=F'8'
         ST    7,88(13)
         A     7,=F'-8'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     14,=A(@@L821)
         BR    14
@@L820   EQU   *
         L     12,4(,10)
* Function find_split_point epilogue
         PDPEPIL
* Function find_split_point literal pool
         DS    0F
         LTORG
* Function find_split_point page table
         DS    0F
@@PGT18  EQU   *
         DC    A(@@PG18)
         DC    A(@@PG19)
@@LC2    EQU   *
         DC    C'ie'
         DC    X'0'
         DS    0F
* S-func subst prologue
@@55     PDPPRLG CINDEX=20,FRAME=128,BASER=12,ENTRY=NO
         B     @@FEN20
         LTORG
@@FEN20  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG20   EQU   *
         LR    11,1
         L     10,=A(@@PGT20)
* Function subst code
         L     5,0(11)
         L     9,4(11)
         LH    7,0(5)
         N     7,=XL4'0000FFFF'
         MVC   112(4,13),=F'0'
         L     2,12(11)
         LTR   2,2
         BNE   @@L911
         CLR   5,9
         L     14,=A(@@L912)
         BER   14
         LH    2,0(5)
         CLM   2,3,=H'61'
         L     14,=A(@@L995)
         BER   14
@@L911   EQU   *
         L     12,0(,10)
         L     2,12(11)
         LTR   2,2
         BNE   @@L914
         LA    3,61(0,0)
         CLR   7,3
         L     14,=A(@@L996)
         BER   14
@@L914   EQU   *
         L     12,0(,10)
         LA    4,66(0,0)
         CLR   7,4
         BE    @@L915
         LA    8,135(0,0)
         CLR   7,8
         BE    @@L915
         L     2,=V(RTX@CLAS)
         IC    2,0(2,7)
         LR    15,5
         CLM   2,1,=XL1'96'
         L     14,=A(@@L910)
         BER   14
@@L915   EQU   *
         CL    5,8(11)
         L     14,=A(@@L917)
         BER   14
         LH    2,0(5)
         CLM   2,3,=H'61'
         L     14,=A(@@L997)
         BER   14
@@L916   EQU   *
         L     12,0(,10)
         LA    4,39(0,0)
         CLR   7,4
         L     14,=A(@@L998)
         BER   14
@@L918   EQU   *
         L     12,0(,10)
         L     2,=V(RTX@LENG)
         SLR   8,8
         IC    8,0(2,7)
         ST    8,120(13)
         LR    3,7
         MH    3,=H'4'
         L     2,=V(RTX@FORM)
         L     2,0(3,2)
         ST    2,116(13)
         LA    2,47(0,0)
         CLR   7,2
         L     14,=A(@@L999)
         BER   14
@@L929   EQU   *
         L     12,0(,10)
         L     3,116(13)
         IC    2,0(3)
         SLL   2,24
         SRA   2,24
         C     2,=F'-123'
         L     14,=A(@@L1000)
         BER   14
@@L931   EQU   *
         L     12,0(,10)
         SLR   6,6
         C     6,120(13)
         BNL   @@L928
         ST    6,124(13)
@@L978   EQU   *
         L     8,116(13)
         IC    2,0(6,8)
         CLM   2,1,=XL1'C5'
         BE    @@L1001
         CLM   2,1,=XL1'85'
         BE    @@L1002
@@L934   EQU   *
         L     12,0(,10)
         L     2,124(13)
         A     2,=F'4'
         ST    2,124(13)
         A     6,=F'1'
         C     6,120(13)
         BL    @@L978
@@L928   EQU   *
         L     12,0(,10)
         SLR   6,6
@@L986   EQU   *
         LA    3,54(0,0)
         CLR   7,3
         BE    @@L983
         LA    4,61(0,0)
         CLR   7,4
         BE    @@L983
         LA    8,49(0,0)
         CLR   7,8
         BE    @@L983
         ST    5,88(13)
         MVC   92(4,13),112(13)
         LR    2,6
         X     2,=F'3'
         LPR   2,2
         BCTR  2,0
         SRL   2,31
         ST    2,96(13)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@68)
         BALR  14,15
         LR    5,15
@@L983   EQU   *
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         CR    2,7
         BE    @@L980
         LR    7,2
         MVC   112(4,13),=F'0'
         A     6,=F'1'
         LA    2,3(0,0)
         CR    6,2
         BNH   @@L986
@@L980   EQU   *
         LR    15,5
         L     14,=A(@@L910)
         BR    14
@@L1002  EQU   *
         L     4,124(13)
         L     15,4(5,4)
         L     8,12(11)
         LTR   8,8
         BE    @@L950
         LR    2,7
         A     2,=F'-63'
         LA    3,1(0,0)
         CLR   2,3
         BNH   @@L951
         LA    8,133(0,0)
         CLR   7,8
         BE    @@L951
@@L950   EQU   *
         L     3,4(5,4)
         CLR   3,9
         BE    @@L954
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L1003
@@L953   EQU   *
         L     4,4(5,4)
         ST    4,88(13)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         SLR   3,3
         L     8,12(11)
         LTR   8,8
         BE    @@L970
         LR    2,7
         A     2,=F'-63'
         LA    4,1(0,0)
         CLR   2,4
         BNH   @@L969
         LA    8,133(0,0)
         CLR   7,8
         BE    @@L969
@@L970   EQU   *
         LA    2,47(0,0)
         CLR   7,2
         BE    @@L969
@@L968   EQU   *
         ST    3,100(13)
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
@@L952   EQU   *
         LH    4,0(15)
         CLM   4,3,=H'49'
         BE    @@L1004
@@L971   EQU   *
         CLM   4,3,=H'54'
         BE    @@L1005
@@L972   EQU   *
         CLM   4,3,=H'54'
         BE    @@L1006
@@L975   EQU   *
         L     2,124(13)
         AR    2,5
         A     2,=F'4'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L934
@@L1006  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'121'
         BNE   @@L975
         MVC   88(4,13),=F'121'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         ST    15,96(13)
         L     2,4(5)
         SLR   8,8
         IC    8,2(2)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(SUNARYOP)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BNE   @@L934
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3555'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L934
@@L1005  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'63'
         BNE   @@L972
         SLR   3,3
         IC    3,2(5)
         ST    3,88(13)
         ST    15,92(13)
         L     2,4(5)
         SLR   4,4
         IC    4,2(2)
         ST    4,96(13)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SSUBREG)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BNE   @@L934
         MVC   88(4,13),=F'49'
         ST    3,92(13)
         L     2,=V(CIRTX)
         MVC   96(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    5,15
         B     @@L934
@@L1004  EQU   *
         L     3,4(15)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L971
         L     14,=A(@@L910)
         BR    14
@@L969   EQU   *
         LTR   6,6
         BNE   @@L968
         LA    3,1(0,0)
         B     @@L968
@@L1003  EQU   *
         LH    2,0(9)
         CLM   2,3,=H'61'
         BNE   @@L953
         L     2,4(3)
         CL    2,4(9)
         BNE   @@L953
         CLC   2(1,3),2(9)
         BNE   @@L953
@@L954   EQU   *
         L     3,8(11)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L1007
@@L955   EQU   *
         L     4,16(11)
         LTR   4,4
         BE    @@L962
         L     2,=A(@@56)
         L     2,0(2)
         LTR   2,2
         BNE   @@L1008
@@L962   EQU   *
         L     15,8(11)
@@L963   EQU   *
         L     3,=A(@@56)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         B     @@L952
@@L1008  EQU   *
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         B     @@L963
@@L1007  EQU   *
         SLR   15,15
         IC    4,2(3)
         LA    2,241(,4)
         CLM   2,1,=XL1'01'
         BH    @@L956
         LA    15,1(0,0)
@@L956   EQU   *
         SLR   3,3
         L     8,8(11)
         L     2,4(8)
         IC    2,2(2)
         LA    4,241(,2)
         CLM   4,1,=XL1'01'
         BH    @@L957
         LA    3,1(0,0)
@@L957   EQU   *
         CLR   15,3
         BE    @@L955
         LA    2,63(0,0)
         CLR   7,2
         BE    @@L1009
@@L958   EQU   *
         LA    2,47(0,0)
         CLR   7,2
         BNE   @@L961
         LA    3,1(0,0)
         CLR   6,3
         BNE   @@L961
         L     3,4(5)
         L     2,=V(GLBRTL)
         CL    3,4(2)
         BE    @@L955
@@L961   EQU   *
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
@@L994   EQU   *
         L     12,0(,10)
         L     2,=V(CIRTX)
         MVC   96(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         L     14,=A(@@L910)
         BR    14
@@L1009  EQU   *
         SLR   3,3
         IC    8,2(5)
         LA    2,241(,8)
         CLM   2,1,=XL1'01'
         BH    @@L959
         LA    3,1(0,0)
@@L959   EQU   *
         SLR   2,2
         CLM   4,1,=XL1'01'
         BH    @@L960
         LA    2,1(0,0)
@@L960   EQU   *
         CLR   3,2
         BE    @@L955
         B     @@L958
@@L951   EQU   *
         LTR   6,6
         BNE   @@L950
         LH    2,0(15)
         CLM   2,3,=H'61'
         BNE   @@L950
         B     @@L952
@@L1001  EQU   *
         L     3,124(13)
         L     2,4(5,3)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    @@L934
@@L947   EQU   *
         L     8,124(13)
         L     2,4(5,8)
         LR    15,4
         MH    15,=H'4'
         L     3,4(15,2)
         CLR   3,9
         BE    @@L942
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L1010
@@L941   EQU   *
         L     2,4(5,8)
         L     2,4(15,2)
         ST    2,88(13)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'49'
         BE    @@L1011
@@L945   EQU   *
         LR    2,4
         MH    2,=H'4'
         L     3,124(13)
         A     2,4(5,3)
         A     2,=F'4'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         BCTR  4,0
         LTR   4,4
         BNL   @@L947
         B     @@L934
@@L1011  EQU   *
         L     3,4(15)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L945
         B     @@L910
@@L1010  EQU   *
         LH    2,0(9)
         CLM   2,3,=H'61'
         BNE   @@L941
         L     2,4(3)
         CL    2,4(9)
         BNE   @@L941
         CLC   2(1,3),2(9)
         BNE   @@L941
@@L942   EQU   *
         L     8,16(11)
         LTR   8,8
         BE    @@L943
         L     2,=A(@@56)
         L     2,0(2)
         LTR   2,2
         BNE   @@L1012
@@L943   EQU   *
         L     15,8(11)
@@L944   EQU   *
         L     3,=A(@@56)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         B     @@L945
@@L1012  EQU   *
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         B     @@L944
@@L1000  EQU   *
         L     2,4(5)
         SLR   4,4
         IC    4,2(2)
         ST    4,112(13)
         B     @@L931
@@L999   EQU   *
         L     2,4(5)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BE    @@L930
         CLM   2,3,=H'69'
         BE    @@L930
         CLM   2,3,=H'59'
         BNE   @@L929
@@L930   EQU   *
         MVC   116(4,13),=A(@@LC2)
         B     @@L929
@@L998   EQU   *
         L     2,4(5)
         L     3,4(2)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BNE   @@L918
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'41'
         BNE   @@L918
         ST    3,88(13)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'49'
         BE    @@L1013
@@L920   EQU   *
         L     2,4(5)
         A     2,=F'4'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     2,4(5)
         L     6,0(2)
         BCTR  6,0
         LTR   6,6
         BNH   @@L928
@@L927   EQU   *
         L     2,4(5)
         LR    4,6
         MH    4,=H'4'
         L     2,4(4,2)
         L     3,4(2)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L923
         CLM   2,3,=H'69'
         BE    @@L923
         CLM   2,3,=H'59'
         BE    @@L923
         ST    3,88(13)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'49'
         BE    @@L1014
@@L926   EQU   *
         L     2,4(5)
         L     2,4(4,2)
         A     2,=F'4'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
@@L923   EQU   *
         BCTR  6,0
         LTR   6,6
         BH    @@L927
         B     @@L928
@@L1014  EQU   *
         L     3,4(15)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L926
         B     @@L910
@@L1013  EQU   *
         L     3,4(15)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L920
         B     @@L910
@@L997   EQU   *
         L     3,8(11)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L916
         L     2,4(5)
         CL    2,4(3)
         BNE   @@L916
         CLC   2(1,5),2(3)
         BNE   @@L916
@@L917   EQU   *
         L     15,8(11)
         B     @@L910
@@L996   EQU   *
         LH    2,0(9)
         CLM   2,3,=H'61'
         BNE   @@L914
         L     2,4(5)
         CL    2,4(9)
         BNE   @@L914
         MVC   88(4,13),=F'49'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         B     @@L994
@@L995   EQU   *
         LH    2,0(9)
         CLM   2,3,=H'61'
         BNE   @@L911
         L     2,4(5)
         CL    2,4(9)
         BNE   @@L911
         CLC   2(1,5),2(9)
         BNE   @@L911
@@L912   EQU   *
         L     2,=A(@@56)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         L     4,16(11)
         LTR   4,4
         BE    @@L917
         LA    8,1(0,0)
         CR    3,8
         BNH   @@L917
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
@@L910   EQU   *
* Function subst epilogue
         PDPEPIL
* Function subst literal pool
         DS    0F
         LTORG
* Function subst page table
         DS    0F
@@PGT20  EQU   *
         DC    A(@@PG20)
         DS    0F
* S-func combine_simplify_rtx prologue
@@68     PDPPRLG CINDEX=21,FRAME=152,BASER=12,ENTRY=NO
         B     @@FEN21
         LTORG
@@FEN21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG21   EQU   *
         LR    11,1
         L     10,=A(@@PGT21)
* Function combine_simplify_rtx code
         SLR   2,2
         SLR   3,3
         ST    2,144(13)
         ST    3,4+144(13)
         L     5,0(11)
         L     9,4(11)
         L     2,0(5)
         LR    8,2
         SRL   8,16
         LR    7,2
         SRL   7,8
         N     7,=F'255'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,8)
         CLM   2,1,=XL1'83'
         L     14,=A(@@L1253)
         BER   14
@@L1016  EQU   *
         L     12,0(,10)
         LR    2,8
         A     2,=F'-75'
         LA    3,1(0,0)
         CLR   2,3
         L     14,=A(@@L1018)
         BNHR  14
         LA    4,78(0,0)
         CLR   8,4
         L     14,=A(@@L1018)
         BER   14
@@L1017  EQU   *
         L     12,0(,10)
         L     2,=V(RTX@CLAS)
         IC    2,0(2,8)
         CLM   2,1,=XL1'F2'
         L     14,=A(@@L1022)
         BER   14
         CLM   2,1,=XL1'83'
         L     14,=A(@@L1022)
         BER   14
         CLM   2,1,=XL1'4C'
         L     14,=A(@@L1022)
         BER   14
@@L1021  EQU   *
         L     12,0(,10)
         L     4,=V(RTX@CLAS)
         IC    2,0(4,8)
         CLM   2,1,=XL1'F1'
         L     14,=A(@@L1254)
         BER   14
@@L1019  EQU   *
         L     12,0(,10)
         SLR   4,4
         L     2,=V(RTX@CLAS)
         SLR   3,3
         IC    3,0(2,8)
         LR    2,3
         LA    6,131(0,0)
         CR    3,6
         L     14,=A(@@L1042)
         BER   14
         L     14,=A(@@L1047)
         BHR   14
         LA    3,76(0,0)
         CLR   2,3
         L     14,=A(@@L1038)
         BER   14
         LA    6,130(0,0)
         CLR   2,6
         L     14,=A(@@L1044)
         BER   14
@@L1036  EQU   *
         L     12,0(,10)
         LTR   4,4
         BE    @@L1049
         LR    5,4
         L     2,0(4)
         LR    8,2
         SRL   8,16
         SLR   9,9
         LR    7,2
         SRL   7,8
         N     7,=F'255'
@@L1049  EQU   *
         LR    2,8
         A     2,=F'-75'
         LA    3,1(0,0)
         CLR   2,3
         L     14,=A(@@L1051)
         BNHR  14
         LA    4,83(0,0)
         CLR   8,4
         L     14,=A(@@L1051)
         BER   14
         LA    6,84(0,0)
         CLR   8,6
         L     14,=A(@@L1051)
         BER   14
         LA    2,85(0,0)
         CLR   8,2
         L     14,=A(@@L1051)
         BER   14
@@L1050  EQU   *
         L     12,0(,10)
         LR    2,8
         A     2,=F'-75'
         LA    3,1(0,0)
         CLR   2,3
         L     14,=A(@@L1053)
         BNHR  14
         LA    4,78(0,0)
         CLR   8,4
         L     14,=A(@@L1053)
         BER   14
         LA    6,79(0,0)
         CLR   8,6
         L     14,=A(@@L1053)
         BER   14
         LA    2,83(0,0)
         CLR   8,2
         L     14,=A(@@L1053)
         BER   14
         LA    3,84(0,0)
         CLR   8,3
         L     14,=A(@@L1053)
         BER   14
         LA    4,85(0,0)
         CLR   8,4
         L     14,=A(@@L1053)
         BER   14
         LA    6,93(0,0)
         CLR   8,6
         L     14,=A(@@L1053)
         BER   14
         LA    2,92(0,0)
         CLR   8,2
         L     14,=A(@@L1053)
         BER   14
         LA    3,95(0,0)
         CLR   8,3
         L     14,=A(@@L1053)
         BER   14
         LA    4,94(0,0)
         CLR   8,4
         L     14,=A(@@L1053)
         BER   14
@@L1052  EQU   *
         L     12,0(,10)
         LR    3,8
         A     3,=F'-47'
         LA    4,96(0,0)
         CLR   3,4
         BH    @@L1066
         MH    3,=H'4'
         L     2,=A(@@L1227)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1227  EQU   *
         DC    A(@@L1195)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1120)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1068)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1067)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1189)
         DC    A(@@L1066)
         DC    A(@@L1117)
         DC    A(@@L1122)
         DC    A(@@L1136)
         DC    A(@@L1089)
         DC    A(@@L1141)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1147)
         DC    A(@@L1066)
         DC    A(@@L1198)
         DC    A(@@L1198)
         DC    A(@@L1198)
         DC    A(@@L1076)
         DC    A(@@L1213)
         DC    A(@@L1213)
         DC    A(@@L1213)
         DC    A(@@L1213)
         DC    A(@@L1213)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1167)
         DC    A(@@L1193)
         DC    A(@@L1193)
         DC    A(@@L1101)
         DC    A(@@L1066)
         DC    A(@@L1112)
         DC    A(@@L1207)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1199)
         DC    A(@@L1066)
         DC    A(@@L1205)
         DC    A(@@L1193)
         DC    A(@@L1193)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1066)
         DC    A(@@L1215)
@@L1067  EQU   *
         MVC   88(4,13),4(5)
         MVC   92(4,13),=F'66'
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         A     5,=F'4'
         ST    5,88(13)
         A     5,=F'-4'
         ST    15,92(13)
@@L1234  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
@@L1066  EQU   *
         L     12,0(,10)
         LR    15,5
         L     14,=A(@@L1015)
         BR    14
@@L1195  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@80)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1120  EQU   *
         L     2,4(5)
         LH    2,0(2)
         CLM   2,3,=H'58'
         BNE   @@L1066
@@L1233  EQU   *
         L     12,0(,10)
         LR    2,5
         A     2,=F'4'
         ST    2,88(13)
         L     2,0(2)
         MVC   92(4,13),4(2)
         B     @@L1234
@@L1068  EQU   *
         LTR   9,9
         BNE   @@L1069
         L     2,4(5)
         SLR   9,9
         IC    9,2(2)
@@L1069  EQU   *
         L     2,4(5)
         LH    3,0(2)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1071
         CLM   3,3,=H'54'
         BE    @@L1071
         CLM   3,3,=H'55'
         BE    @@L1071
         CLM   3,3,=H'58'
         BE    @@L1071
         CLM   3,3,=H'134'
         BE    @@L1071
         CLM   3,3,=H'56'
         BE    @@L1071
         CLM   3,3,=H'140'
         BE    @@L1071
@@L1070  EQU   *
         L     2,4(5)
         SLR   3,3
         IC    3,2(2)
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    6,4(0,0)
         CLR   2,6
         BE    @@L1066
         ST    7,88(13)
         MVC   92(4,13),4(5)
         ST    9,96(13)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SSUBREG)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1015)
         BNER  14
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'66'
         BNE   @@L1066
         L     2,0(3)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1075
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(MODE@DEP)
         BALR  14,15
         LTR   15,15
         BE    @@L1066
@@L1075  EQU   *
         MVC   88(4,13),=F'49'
         ST    7,92(13)
         L     2,=V(CIRTX)
         MVC   96(4,13),256(2)
@@L1240  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1071  EQU   *
         ST    7,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(SLOPOFF)
         BALR  14,15
         CL    15,8(5)
         BNE   @@L1070
@@L1243  EQU   *
         L     12,0(,10)
         ST    7,88(13)
         MVC   92(4,13),4(5)
@@L1238  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1189  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@79)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1117  EQU   *
         L     4,8(5)
         L     2,=V(CIRTX)
         CL    4,256(2)
         BE    @@L1203
         L     15,4(5)
         SLR   3,3
         IC    3,2(15)
         MH    3,=H'4'
         L     2,=V(CONST@TI)
         CL    4,0(3,2)
         BNE   @@L1066
         L     14,=A(@@L1015)
         BR    14
@@L1203  EQU   *
         L     12,0(,10)
         L     15,4(5)
         L     14,=A(@@L1015)
         BR    14
@@L1122  EQU   *
         L     6,4(5)
         LH    2,0(6)
         CLM   2,3,=H'75'
         L     14,=A(@@L1255)
         BER   14
@@L1123  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'85'
         BE    @@L1256
@@L1126  EQU   *
         L     12,0(,10)
         L     4,4(5)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BE    @@L1257
@@L1130  EQU   *
         L     4,=V(CIRTX)
         L     2,8(5)
         CL    2,252(4)
         BE    @@L1258
@@L1131  EQU   *
         LR    2,7
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L1066
         MVC   88(4,13),4(5)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),8(5)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    2,15
         LTR   2,2
         BNE   @@L1066
         MVC   88(4,13),=F'84'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         ST    7,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@68)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'49'
         BE    @@L1066
         CLR   15,3
         L     14,=A(@@L1015)
         BNER  14
         B     @@L1066
@@L1258  EQU   *
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L1131
         CLM   2,3,=H'63'
         BE    @@L1259
@@L1132  EQU   *
         ST    3,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BNE   @@L1131
         MVC   88(4,13),=F'85'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         MVC   100(4,13),260(4)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'87'
         ST    7,96(13)
         ST    15,100(13)
         LR    3,7
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
@@L1250  EQU   *
         BCTR  2,0
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'89'
         ST    7,96(13)
         ST    15,100(13)
         ST    2,104(13)
@@L1235  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1259  EQU   *
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L1132
         B     @@L1131
@@L1257  EQU   *
         L     3,8(5)
         L     2,=V(CIRTX)
         CL    3,252(2)
         BNE   @@L1130
         ST    4,88(13)
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         L     2,4(5)
         MVC   100(4,13),8(2)
         LA    1,88(,13)
         L     15,=A(@@77)
         BALR  14,15
         LTR   15,15
         BE    @@L1130
         MVC   88(4,13),=F'77'
         ST    7,92(13)
         ST    15,96(13)
@@L1237  EQU   *
         L     12,0(,10)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1256  EQU   *
         L     4,8(5)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BNE   @@L1126
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1126
         L     3,4(3)
         LCR   2,3
         CL    2,4(4)
         BNE   @@L1126
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BL    @@L1260
@@L1127  EQU   *
         LR    8,7
         MH    8,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(8,2)
         CLM   2,3,=H'32'
         BH    @@L1126
         L     4,4(5)
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'83'
         BE    @@L1261
@@L1129  EQU   *
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'121'
         BNE   @@L1126
         L     2,4(3)
         SLR   3,3
         IC    3,2(2)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         N     3,=XL4'0000FFFF'
         LR    2,6
         A     2,=F'1'
         CLR   3,2
         BNE   @@L1126
@@L1128  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'87'
         ST    7,96(13)
         L     2,4(5)
         L     2,4(2)
         MVC   100(4,13),4(2)
         L     2,=V(MODE@BIT)
         LH    2,0(8,2)
         N     2,=XL4'0000FFFF'
         SR    2,6
         B     @@L1250
@@L1261  EQU   *
         L     3,8(3)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1129
         A     6,=F'1'
         LA    2,1(0,0)
         SLL   2,0(6)
         BCTR  6,0
         BCTR  2,0
         CL    2,4(3)
         BNE   @@L1129
         B     @@L1128
@@L1260  EQU   *
         L     2,8(5)
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BNL   @@L1127
         B     @@L1126
@@L1255  EQU   *
         L     4,8(6)
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1124
         CLM   3,3,=H'54'
         BE    @@L1124
         CLM   3,3,=H'55'
         BE    @@L1124
         CLM   3,3,=H'58'
         BE    @@L1262
@@L1125  EQU   *
         CLM   3,3,=H'58'
         BNE   @@L1123
         L     2,4(4)
         L     2,4(2)
         L     2,0(2)
         N     2,=F'-65520'
         L     8,=F'4456448'
         CLR   2,8
         BNE   @@L1123
@@L1124  EQU   *
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'75'
@@L1252  EQU   *
         L     12,0(,10)
         ST    7,92(13)
         ST    15,96(13)
@@L1251  EQU   *
         L     12,0(,10)
         L     2,4(5)
@@L1247  EQU   *
         MVC   100(4,13),8(2)
@@L1236  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1262  EQU   *
         L     2,4(4)
         L     2,4(2)
         LH    2,0(2)
         CLM   2,3,=H'67'
         BNE   @@L1125
         B     @@L1124
@@L1136  EQU   *
         L     3,4(5)
         L     2,=V(CIRTX)
         CL    3,260(2)
         L     14,=A(@@L1263)
         BER   14
@@L1137  EQU   *
         L     12,0(,10)
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'83'
         BE    @@L1264
@@L1138  EQU   *
         L     2,8(5)
         LH    2,0(2)
         CLM   2,3,=H'75'
         BNE   @@L1066
         LR    3,7
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L1140
         LA    4,3(0,0)
         CLR   2,4
         BE    @@L1140
         LA    6,5(0,0)
         CLR   2,6
         BE    @@L1140
         LA    8,7(0,0)
         CLR   2,8
         BNE   @@L1066
@@L1140  EQU   *
         MVC   88(4,13),=F'76'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         L     2,8(5)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'76'
         ST    7,92(13)
         ST    15,96(13)
         L     2,8(5)
         B     @@L1247
@@L1264  EQU   *
         L     3,8(3)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1138
         L     3,4(3)
         LCR   2,3
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L1138
         L     2,8(5)
         MVC   88(4,13),4(2)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1138
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         L     2,8(5)
         L     2,8(2)
         L     2,4(2)
         X     2,=F'-1'
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1263  EQU   *
         L     4,8(5)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L1137
         ST    4,88(13)
         ST    7,92(13)
         L     2,8(5)
         MVC   96(4,13),4(2)
         L     2,8(5)
         MVC   100(4,13),8(2)
         LA    1,88(,13)
         L     15,=A(@@77)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1015)
         BNER  14
         B     @@L1137
@@L1089  EQU   *
         L     4,4(5)
         LH    2,0(4)
         CLM   2,3,=H'75'
         L     14,=A(@@L1265)
         BER   14
@@L1090  EQU   *
         L     12,0(,10)
         LH    2,0(4)
         CLM   2,3,=H'86'
         L     14,=A(@@L1266)
         BER   14
         CLM   2,3,=H'76'
         L     14,=A(@@L1267)
         BER   14
         CLM   2,3,=H'85'
         L     14,=A(@@L1268)
         BER   14
@@L1093  EQU   *
         L     12,0(,10)
         L     2,4(5)
         LH    2,0(2)
         CLM   2,3,=H'87'
         L     14,=A(@@L1269)
         BER   14
@@L1094  EQU   *
         L     12,0(,10)
         MVC   88(4,13),4(5)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         LR    4,15
         LH    6,0(15)
         CLM   6,3,=H'89'
         L     14,=A(@@L1270)
         BER   14
@@L1096  EQU   *
         L     12,0(,10)
         CLM   6,3,=H'61'
         BE    @@L1066
         CLM   6,3,=H'63'
         L     14,=A(@@L1271)
         BER   14
@@L1098  EQU   *
         L     12,0(,10)
         ST    4,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L1066
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'87'
         ST    7,96(13)
         ST    4,100(13)
         LR    3,7
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         SR    2,15
         BCTR  2,0
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'89'
         ST    7,96(13)
         ST    15,100(13)
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'89'
         L     14,=A(@@L1015)
         BNER  14
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'87'
         L     14,=A(@@L1015)
         BNER  14
         L     2,4(3)
         CLR   2,4
         BE    @@L1066
         L     14,=A(@@L1015)
         BR    14
@@L1271  EQU   *
         L     2,4(4)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L1098
         B     @@L1066
@@L1270  EQU   *
         L     8,8(15)
         LH    2,0(8)
         CLM   2,3,=H'54'
         BNE   @@L1096
         LR    3,7
         B     @@PGE21
         DS    0F
         LTORG
         DS    0F
@@PGE21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG22   EQU   *
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         BCTR  2,0
         CL    2,4(8)
         L     14,=A(@@L1096)
         BNER  14
         ST    15,88(13)
         MVC   92(4,13),=F'90'
         ST    7,96(13)
         MVC   100(4,13),4(15)
         L     2,8(15)
@@L1249  EQU   *
         L     12,4(,10)
         MVC   104(4,13),4(2)
         L     14,=A(@@L1235)
         BR    14
@@L1269  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'77'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(SUNARYOP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1094)
         BER   14
         MVC   88(4,13),=F'87'
         ST    7,92(13)
         ST    15,96(13)
         L     14,=A(@@L1251)
         BR    14
@@L1268  EQU   *
         L     12,4(,10)
         L     3,=V(CIRTX)
         L     2,8(4)
         CL    2,260(3)
         L     14,=A(@@L1093)
         BNER  14
         MVC   88(4,13),4(4)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LA    8,1(0,0)
         CLR   15,8
         L     14,=A(@@L1093)
         BNER  14
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         MVC   100(4,13),252(3)
         L     14,=A(@@L1236)
         BR    14
@@L1267  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'76'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),8(2)
         L     2,4(5)
         MVC   100(4,13),4(2)
         L     14,=A(@@L1236)
         BR    14
@@L1266  EQU   *
         L     12,4(,10)
         MVC   88(4,13),4(4)
         MVC   92(4,13),=F'1'
@@L1239  EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1265  EQU   *
         L     12,4(,10)
         L     3,8(4)
         L     2,=V(CIRTX)
         CL    3,260(2)
         L     14,=A(@@L1090)
         BNER  14
         MVC   88(4,13),=F'86'
@@L1248  EQU   *
         L     12,4(,10)
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         L     14,=A(@@L1240)
         BR    14
@@L1141  EQU   *
         L     12,4(,10)
         L     2,4(5)
         LH    2,0(2)
         CLM   2,3,=H'75'
         BE    @@L1272
@@L1142  EQU   *
         L     12,4(,10)
         LR    3,7
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    3,2(0,0)
         CLR   2,3
         BE    @@L1145
         LA    4,6(0,0)
         CLR   2,4
         BE    @@L1145
         LA    6,8(0,0)
         CLR   2,6
         L     14,=A(@@L1066)
         BNER  14
@@L1145  EQU   *
         L     12,4(,10)
         L     2,=V(FLAG@UNS)
         L     2,0(2)
         LTR   2,2
         L     14,=A(@@L1066)
         BER   14
         L     2,4(5)
         LH    2,0(2)
         CLM   2,3,=H'79'
         L     14,=A(@@L1066)
         BNER  14
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1066)
         BER   14
         MVC   88(4,13),=F'79'
         L     14,=A(@@L1252)
         BR    14
@@L1272  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),8(2)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@72)
         BALR  14,15
         LR    5,15
         LH    2,0(15)
         CLM   2,3,=H'78'
         L     14,=A(@@L1015)
         BNER  14
         B     @@L1142
@@L1147  EQU   *
         L     12,4(,10)
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L1066)
         BNER  14
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    6,15
         LTR   15,15
         L     14,=A(@@L1066)
         BLR   14
         L     2,4(5)
         LH    2,0(2)
         CLM   2,3,=H'87'
         BE    @@L1149
         CLM   2,3,=H'90'
         BE    @@L1149
         CLM   2,3,=H'89'
         BE    @@L1149
         CLM   2,3,=H'88'
         BE    @@L1149
         CLM   2,3,=H'91'
         L     14,=A(@@L1066)
         BNER  14
@@L1149  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'90'
         ST    7,96(13)
         MVC   100(4,13),4(5)
         ST    6,104(13)
         L     14,=A(@@L1235)
         BR    14
@@L1198  EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1076  EQU   *
         L     12,4(,10)
         L     4,4(5)
         LH    2,0(4)
         CLM   2,3,=H'75'
         BE    @@L1273
@@L1077  EQU   *
         L     12,4(,10)
         LH    2,0(4)
         CLM   2,3,=H'77'
         BE    @@L1274
         CLM   2,3,=H'85'
         BE    @@L1275
@@L1079  EQU   *
         L     12,4(,10)
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'87'
         BE    @@L1276
@@L1080  EQU   *
         L     12,4(,10)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L1277
@@L1083  EQU   *
         L     12,4(,10)
         L     15,4(5)
         LH    2,0(15)
         AH    2,=H'-83'
         CLM   2,3,=H'1'
         L     14,=A(@@L1066)
         BHR   14
         L     3,4(15)
         L     4,8(15)
         SLR   2,2
         IC    2,2(3)
         MVC   88(4,13),=F'86'
         ST    2,92(13)
         ST    3,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         LR    3,15
         SLR   2,2
         IC    2,2(4)
         LTR   2,2
         BNE   @@L1085
         LR    2,7
@@L1085  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'86'
         ST    2,92(13)
         ST    4,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         LR    4,15
         LH    2,0(15)
         CLM   2,3,=H'86'
         BE    @@L1278
@@L1086  EQU   *
         L     12,4(,10)
         L     2,4(5)
         LH    2,0(2)
         X     2,=F'84'
         SLL   2,16
         SRA   2,16
         LPR   2,2
         SLL   2,16
         SRA   2,16
         LCR   2,2
         N     2,=XL4'0000FFFF'
         SRL   2,15
         A     2,=F'83'
         ST    2,88(13)
         ST    7,92(13)
         ST    3,96(13)
         ST    4,100(13)
@@L1241  EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1278  EQU   *
         L     12,4(,10)
         LH    2,0(3)
         CLM   2,3,=H'86'
         BE    @@L1086
         LR    4,3
         LR    3,15
         B     @@L1086
@@L1277  EQU   *
         L     12,4(,10)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1083
         L     4,=V(MODE@SIZ)
         L     2,4(5)
         SLR   3,3
         IC    3,2(2)
         L     15,4(2)
         SLR   6,6
         IC    6,2(15)
         IC    2,0(4,3)
         IC    4,0(4,6)
         STC   4,80(,13)
         CLM   2,1,80(13)
         BNL   @@L1083
         LH    2,0(15)
         CLM   2,3,=H'87'
         BNE   @@L1083
         L     3,4(15)
         L     2,=V(CIRTX)
         CL    3,260(2)
         BNE   @@L1083
         MVC   88(4,13),=F'86'
         ST    6,92(13)
         ST    3,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         MVC   88(4,13),=F'88'
         ST    6,92(13)
         ST    15,96(13)
         L     2,4(5)
         L     2,4(2)
         MVC   100(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         L     14,=A(@@L1238)
         BR    14
@@L1276  EQU   *
         L     12,4(,10)
         L     4,4(3)
         L     2,=V(CIRTX)
         CL    4,260(2)
         BNE   @@L1080
         MVC   88(4,13),=F'86'
         ST    7,92(13)
         ST    4,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         MVC   88(4,13),=F'88'
         ST    7,92(13)
         ST    15,96(13)
         L     2,4(5)
         MVC   100(4,13),8(2)
         B     @@L1241
@@L1275  EQU   *
         L     12,4(,10)
         L     2,8(4)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L1079
         MVC   88(4,13),=F'86'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),8(2)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(SUNARYOP)
         BALR  14,15
         LTR   15,15
         BE    @@L1079
         MVC   88(4,13),=F'85'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         ST    15,100(13)
         L     14,=A(@@L1236)
         BR    14
@@L1274  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         L     2,=V(CIRTX)
         MVC   100(4,13),252(2)
         B     @@L1241
@@L1273  EQU   *
         L     12,4(,10)
         L     3,8(4)
         L     2,=V(CIRTX)
         CL    3,252(2)
         BNE   @@L1077
         MVC   88(4,13),=F'77'
         B     @@L1248
@@L1213  EQU   *
         L     12,4(,10)
         L     2,8(5)
         LH    2,0(2)
         CLM   2,3,=H'54'
         L     14,=A(@@L1066)
         BNER  14
         ST    5,88(13)
         ST    8,92(13)
         ST    7,96(13)
         MVC   100(4,13),4(5)
         L     2,8(5)
         B     @@L1249
@@L1167  EQU   *
         L     12,4(,10)
         L     4,4(5)
         LH    6,0(4)
         CLM   6,3,=H'74'
         BE    @@L1169
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,4(0,0)
         CLR   2,3
         L     14,=A(@@L1066)
         BER   14
         L     2,=V(GLBRTL)
         CL    4,4(2)
         L     14,=A(@@L1066)
         BER   14
@@L1169  EQU   *
         L     12,4(,10)
         ST    4,128(13)
         MVC   132(4,13),8(5)
         CLM   6,3,=H'74'
         L     14,=A(@@L1279)
         BER   14
@@L1170  EQU   *
         L     12,4(,10)
         ST    8,88(13)
         LA    2,128(,13)
         ST    2,92(13)
         LA    2,132(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@71)
         BALR  14,15
         LR    9,15
         LA    4,102(0,0)
         CLR   15,4
         L     14,=A(@@L1280)
         BER   14
@@L1171  EQU   *
         L     12,4(,10)
         LA    2,102(0,0)
         CLR   9,2
         L     14,=A(@@L1281)
         BER   14
@@L1173  EQU   *
         L     12,4(,10)
         LA    4,103(0,0)
         CLR   9,4
         L     14,=A(@@L1282)
         BER   14
@@L1175  EQU   *
         L     12,4(,10)
         LA    2,103(0,0)
         CLR   9,2
         BE    @@L1283
@@L1179  EQU   *
         L     12,4(,10)
         LA    4,102(0,0)
         CLR   9,4
         BE    @@L1284
@@L1185  EQU   *
         L     12,4(,10)
         CLR   9,8
         BE    @@L1188
         ST    9,88(13)
         ST    7,92(13)
         MVC   96(4,13),128(13)
         MVC   100(4,13),132(13)
         B     @@L1241
@@L1188  EQU   *
         L     12,4(,10)
         A     5,=F'4'
         ST    5,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         A     5,=F'4'
         ST    5,88(13)
         A     5,=F'-8'
         MVC   92(4,13),132(13)
         L     14,=A(@@L1234)
         BR    14
@@L1284  EQU   *
         L     12,4(,10)
         LR    6,7
         MH    6,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(6,2)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L1185
         LR    3,7
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    4,0(3,2)
         CLM   4,3,=H'32'
         BH    @@L1185
         L     2,=V(MODE@MAS)
         L     3,0(6,2)
         N     3,=F'1'
         N     4,=XL4'0000FFFF'
         BCTR  4,0
         LA    2,1(0,0)
         SLL   2,0(4)
         A     4,=F'1'
         CLR   3,2
         BNE   @@L1185
         L     3,=V(CIRTX)
         L     2,132(13)
         CL    2,256(3)
         BNE   @@L1185
         L     3,128(13)
         SLR   2,2
         IC    2,2(3)
         CLR   7,2
         BNE   @@L1185
         ST    3,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BL    @@L1185
         MVC   88(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'87'
         ST    7,96(13)
         ST    15,100(13)
         SR    4,6
         BCTR  4,0
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         LR    5,15
         LH    2,0(15)
         CLM   2,3,=H'83'
         L     14,=A(@@L1066)
         BNER  14
         L     3,8(15)
         L     2,=V(CONST@TR)
         CL    3,0(2)
         L     14,=A(@@L1203)
         BER   14
         L     14,=A(@@L1066)
         BR    14
@@L1283  EQU   *
         L     12,4(,10)
         LR    3,7
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     4,0(3,2)
         LA    3,1(0,0)
         CLR   4,3
         BNE   @@L1179
         L     3,=V(CIRTX)
         L     2,132(13)
         CL    2,256(3)
         BNE   @@L1179
         L     3,128(13)
         SLR   2,2
         IC    2,2(3)
         CLR   7,2
         BNE   @@L1179
         ST    3,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    3,7
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         BNE   @@L1179
         MVC   88(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         ST    15,128(13)
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         ST    15,88(13)
         ST    4,92(13)
         B     @@L1239
@@L1282  EQU   *
         L     12,4(,10)
         LR    2,7
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    6,1(0,0)
         CLR   2,6
         BNE   @@L1175
         L     4,=V(CIRTX)
         L     2,132(13)
         CL    2,256(4)
         BNE   @@L1175
         L     3,128(13)
         SLR   2,2
         IC    2,2(3)
         CLR   7,2
         BNE   @@L1175
         ST    3,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         CLR   15,6
         BNE   @@L1175
         MVC   88(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         ST    15,128(13)
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         MVC   88(4,13),=F'85'
         ST    7,92(13)
         ST    15,96(13)
         MVC   100(4,13),260(4)
         L     14,=A(@@L1236)
         BR    14
@@L1281  EQU   *
         L     12,4(,10)
         LR    2,7
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L1173
         L     3,=V(CIRTX)
         L     2,132(13)
         CL    2,256(3)
         BNE   @@L1173
         L     3,128(13)
         SLR   2,2
         IC    2,2(3)
         CLR   7,2
         BNE   @@L1173
         ST    3,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    3,7
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         BNE   @@L1173
         MVC   88(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         ST    15,128(13)
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         MVC   88(4,13),=F'77'
         ST    7,92(13)
         ST    15,96(13)
         L     14,=A(@@L1237)
         BR    14
@@L1280  EQU   *
         L     12,4(,10)
         LR    2,7
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    6,1(0,0)
         CLR   2,6
         BNE   @@L1171
         L     3,=V(CIRTX)
         L     2,132(13)
         CL    2,256(3)
         BNE   @@L1171
         L     3,128(13)
         SLR   2,2
         IC    2,2(3)
         CLR   7,2
         BNE   @@L1171
         ST    3,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         CLR   15,6
         BNE   @@L1171
         MVC   88(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         L     14,=A(@@L1238)
         BR    14
@@L1279  EQU   *
         L     12,4(,10)
         MVC   132(4,13),8(4)
         MVC   128(4,13),4(4)
         B     @@L1170
@@L1101  EQU   *
         L     12,4(,10)
         LR    8,7
         MH    8,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(8,2)
         LA    3,3(0,0)
         CLR   2,3
         L     14,=A(@@L1066)
         BER   14
         LR    6,7
         MH    6,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(6,2)
         CLM   2,3,=H'32'
         BH    @@L1103
         CLM   2,3,=H'16'
         BE    @@L1103
         MVC   88(4,13),4(5)
         L     2,4(5)
         SLR   4,4
         IC    4,2(2)
         ST    4,92(13)
         L     2,=V(MODE@MAS)
         L     2,0(8,2)
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         A     5,=F'4'
         ST    5,88(13)
         A     5,=F'-4'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
@@L1103  EQU   *
         L     12,4(,10)
         L     4,4(5)
         LH    2,0(4)
         AH    2,=H'-120'
         CLM   2,3,=H'1'
         BH    @@L1104
         L     2,4(4)
         SLR   3,3
         IC    3,2(2)
         LR    15,2
         CLR   3,7
         L     14,=A(@@L1015)
         BER   14
@@L1104  EQU   *
         L     12,4(,10)
         LH    2,0(4)
         CLM   2,3,=H'129'
         L     14,=A(@@L1106)
         BER   14
         CLM   2,3,=H'77'
         L     14,=A(@@L1106)
         BER   14
@@L1105  EQU   *
         L     12,4(,10)
         LH    2,0(4)
         CLM   2,3,=H'63'
         L     14,=A(@@L1285)
         BER   14
@@L1107  EQU   *
         L     12,4(,10)
         L     2,=V(MODE@BIT)
         LH    3,0(6,2)
         CLM   3,3,=H'16'
         L     14,=A(@@L1108)
         BER   14
         MVC   88(4,13),4(5)
         L     2,4(5)
         SLR   4,4
         IC    4,2(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    2,3
         N     2,=XL4'0000FFFF'
         A     2,=F'1'
         CLR   15,2
         L     14,=A(@@L1108)
         BLR   14
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'90'
         L     14,=A(@@L1243)
         BNER  14
         L     2,4(3)
         LH    2,0(2)
         B     @@PGE22
         DS    0F
         LTORG
         DS    0F
@@PGE22  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG23   EQU   *
         CLM   2,3,=H'78'
         L     14,=A(@@L1243)
         BNER  14
@@L1108  EQU   *
         L     12,8(,10)
         L     2,=V(MODE@BIT)
         LH    2,0(6,2)
         CLM   2,3,=H'32'
         BH    @@L1110
         L     2,4(5)
         LH    3,0(2)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'4C'
         BE    @@L1286
@@L1110  EQU   *
         L     12,8(,10)
         L     2,=V(MODE@BIT)
         LH    2,0(6,2)
         CLM   2,3,=H'32'
         L     14,=A(@@L1066)
         BHR   14
         LR    3,7
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     2,0(3,2)
         X     2,=F'-1'
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L1066)
         BNER  14
         MVC   88(4,13),4(5)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1066)
         BER   14
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         L     14,=A(@@L1066)
         BNER  14
         L     14,=A(@@L1243)
         BR    14
@@L1286  EQU   *
         L     12,8(,10)
         L     2,=V(MODE@MAS)
         L     2,0(8,2)
         X     2,=F'-1'
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1110
         L     14,=A(@@L1243)
         BR    14
@@L1285  EQU   *
         L     12,8(,10)
         L     2,4(4)
         LH    2,0(2)
         CLM   2,3,=H'122'
         L     14,=A(@@L1107)
         BNER  14
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1107)
         BER   14
         L     2,4(5)
         L     15,4(2)
         L     14,=A(@@L1015)
         BR    14
@@L1106  EQU   *
         L     12,8(,10)
         L     3,4(4)
         LH    2,0(3)
         AH    2,=H'-120'
         CLM   2,3,=H'1'
         L     14,=A(@@L1105)
         BHR   14
         L     2,4(3)
         SLR   3,3
         IC    3,2(2)
         CLR   3,7
         L     14,=A(@@L1105)
         BNER  14
@@L1244  EQU   *
         L     12,8(,10)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         ST    7,92(13)
         L     2,4(5)
         L     2,4(2)
         MVC   96(4,13),4(2)
         L     14,=A(@@L1237)
         BR    14
@@L1112  EQU   *
         L     12,8(,10)
         L     4,4(5)
         LH    2,0(4)
         CLM   2,3,=H'123'
         BE    @@L1287
@@L1113  EQU   *
         L     12,8(,10)
         LH    2,0(4)
         CLM   2,3,=H'129'
         BE    @@L1115
         CLM   2,3,=H'77'
         BE    @@L1115
@@L1114  EQU   *
         L     12,8(,10)
         LH    2,0(4)
         CLM   2,3,=H'63'
         L     14,=A(@@L1066)
         BNER  14
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1066)
         BER   14
         L     2,4(5)
         L     2,4(2)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'124'
         L     14,=A(@@L1015)
         BER   14
         L     14,=A(@@L1066)
         BR    14
@@L1115  EQU   *
         L     12,8(,10)
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'123'
         BNE   @@L1114
         L     2,4(3)
         SLR   6,6
         IC    6,2(2)
         CLR   6,7
         BNE   @@L1114
         B     @@L1244
@@L1287  EQU   *
         L     12,8(,10)
         L     2,4(4)
         SLR   3,3
         IC    3,2(2)
         LR    15,2
         CLR   3,7
         BNE   @@L1113
         L     14,=A(@@L1015)
         BR    14
@@L1207  EQU   *
         L     12,8(,10)
         L     2,4(5)
         LH    2,0(2)
         CLM   2,3,=H'120'
         L     14,=A(@@L1066)
         BNER  14
         L     14,=A(@@L1233)
         BR    14
@@L1199  EQU   *
         L     12,8(,10)
         L     2,4(5)
         LH    2,0(2)
         CLM   2,3,=H'77'
         BE    @@L1288
@@L1200  EQU   *
         L     12,8(,10)
         L     3,4(5)
         IC    2,2(3)
         CLM   2,1,=XL1'00'
         L     14,=A(@@L1066)
         BER   14
         LH    2,0(3)
         CLM   2,3,=H'131'
         L     14,=A(@@L1203)
         BER   14
         CLM   2,3,=H'129'
         L     14,=A(@@L1203)
         BER   14
         L     4,=V(MODE@BIT)
         SLR   2,2
         IC    2,2(3)
         MH    2,=H'2'
         LH    2,0(2,4)
         CLM   2,3,=H'32'
         BH    @@L1202
         ST    3,88(13)
         L     2,4(5)
         SLR   6,6
         IC    6,2(2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     2,4(5)
         SLR   8,8
         IC    8,2(2)
         LR    2,8
         MH    2,=H'2'
         LH    3,0(2,4)
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LA    2,1(0,0)
         SLL   2,0(3)
         NR    2,15
         LTR   2,2
         L     14,=A(@@L1203)
         BER   14
@@L1202  EQU   *
         L     12,8(,10)
         MVC   88(4,13),4(5)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    3,7
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         L     14,=A(@@L1066)
         BNER  14
         MVC   88(4,13),=F'77'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         L     14,=A(@@L1240)
         BR    14
@@L1288  EQU   *
         L     12,8(,10)
         LR    2,5
         A     2,=F'4'
         ST    2,88(13)
         L     2,0(2)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L1200
@@L1205  EQU   *
         L     12,8(,10)
         L     2,4(5)
         LH    2,0(2)
         AH    2,=H'-120'
         CLM   2,3,=H'1'
         L     14,=A(@@L1066)
         BHR   14
         L     14,=A(@@L1233)
         BR    14
@@L1193  EQU   *
         L     12,8(,10)
         LR    15,5
         L     4,12(11)
         LTR   4,4
         L     14,=A(@@L1015)
         BNER  14
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1215  EQU   *
         L     12,8(,10)
         L     4,4(5)
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'39'
         BE    @@L1216
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'4598'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L1216  EQU   *
         L     12,8(,10)
         L     3,4(3)
         L     2,0(3)
         LA    6,1(0,0)
         CLR   2,6
         L     14,=A(@@L1066)
         BNER  14
         L     6,4(3)
         LH    2,0(6)
         CLM   2,3,=H'54'
         L     14,=A(@@L1066)
         BNER  14
         LH    2,0(4)
         CLM   2,3,=H'144'
         L     14,=A(@@L1066)
         BNER  14
         SLR   3,3
         IC    3,2(5)
         L     2,=V(MODE@SIZ)
         SLR   7,7
         IC    7,0(2,3)
         ST    7,148(13)
         L     2,144(13)
         L     3,4+144(13)
         M     2,4(6)
         ST    2,144(13)
         ST    3,4+144(13)
         LR    7,3
@@L1218  EQU   *
         L     12,8(,10)
         CLC   2(1,4),2(5)
         BE    @@L1228
         LH    2,0(4)
         CH    2,=H'144'
         L     14,=A(@@L1066)
         BNER  14
         L     6,4(4)
         SLR   3,3
         IC    3,2(6)
         L     2,=V(MODE@SIZ)
         SLR   8,8
         IC    8,0(2,3)
         CR    8,7
         BL    @@L1289
         SR    7,8
         L     4,8(4)
         B     @@L1218
@@L1289  EQU   *
         L     12,8(,10)
         LR    4,6
         B     @@L1218
@@L1228  EQU   *
         L     12,8(,10)
         LR    15,4
         L     14,=A(@@L1015)
         BR    14
@@L1053  EQU   *
         L     12,8(,10)
         LR    3,7
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    6,1(0,0)
         CLR   2,6
         BE    @@L1056
         LA    4,3(0,0)
         CLR   2,4
         BE    @@L1056
         LA    6,5(0,0)
         CLR   2,6
         BE    @@L1056
         LA    4,7(0,0)
         CLR   2,4
         BE    @@L1056
@@L1055  EQU   *
         L     12,8(,10)
         L     2,=V(FLAG@UNS)
         L     2,0(2)
         LTR   2,2
         L     14,=A(@@L1052)
         BER   14
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    3,2(0,0)
         CLR   2,3
         BE    @@L1054
         LA    4,6(0,0)
         CLR   2,4
         BE    @@L1054
         LA    6,8(0,0)
         CLR   2,6
         L     14,=A(@@L1052)
         BNER  14
@@L1054  EQU   *
         L     12,8(,10)
         L     3,4(5)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         CLR   2,8
         L     14,=A(@@L1052)
         BNER  14
         MVC   136(4,13),4(3)
         L     4,8(3)
         L     6,8(5)
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1059
         CLM   3,3,=H'54'
         BE    @@L1059
         CLM   3,3,=H'55'
         BE    @@L1059
         CLM   3,3,=H'58'
         BE    @@L1059
         CLM   3,3,=H'134'
         BE    @@L1059
         CLM   3,3,=H'56'
         BE    @@L1059
         CLM   3,3,=H'140'
         BE    @@L1059
@@L1058  EQU   *
         L     12,8(,10)
         LA    2,75(0,0)
         LA    3,76(0,0)
         CLR   8,3
         BE    @@L1061
         LR    2,8
         LA    3,79(0,0)
         CLR   8,3
         BE    @@L1290
@@L1061  EQU   *
         L     12,8(,10)
         ST    2,88(13)
         ST    7,92(13)
         ST    4,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LTR   15,15
         BE    @@L1291
@@L1064  EQU   *
         L     12,8(,10)
         LTR   15,15
         L     14,=A(@@L1052)
         BER   14
         ST    8,88(13)
         ST    7,92(13)
         MVC   96(4,13),136(13)
         ST    15,100(13)
         L     14,=A(@@L1236)
         BR    14
@@L1291  EQU   *
         L     12,8(,10)
         L     2,=V(RTX@CLAS)
         IC    2,0(2,8)
         CLM   2,1,=XL1'83'
         BNE   @@L1064
         L     2,4(5)
         MVC   136(4,13),8(2)
         ST    8,88(13)
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         B     @@L1064
@@L1290  EQU   *
         L     12,8(,10)
         LA    2,78(0,0)
         B     @@L1061
@@L1059  EQU   *
         L     12,8(,10)
         L     2,=V(RTX@CLAS)
         IC    2,0(2,8)
         CLM   2,1,=XL1'83'
         BNE   @@L1058
         LR    2,4
         LR    4,6
         LR    6,2
         B     @@L1058
@@L1056  EQU   *
         L     12,8(,10)
         LA    6,79(0,0)
         CLR   8,6
         BNE   @@L1054
         B     @@L1055
@@L1051  EQU   *
         L     12,8(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@72)
         BALR  14,15
         LR    5,15
         LH    8,0(15)
         N     8,=XL4'0000FFFF'
         SLR   9,9
         L     14,=A(@@L1050)
         BR    14
@@L1044  EQU   *
         L     12,8(,10)
         ST    8,88(13)
         ST    7,92(13)
         ST    9,96(13)
         MVC   100(4,13),4(5)
         MVC   104(4,13),8(5)
         MVC   108(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(STERNOP)
         BALR  14,15
@@L1232  EQU   *
         L     12,8(,10)
         LR    4,15
         L     14,=A(@@L1036)
         BR    14
@@L1038  EQU   *
         L     12,8(,10)
         L     2,4(5)
         SLR   4,4
         IC    4,2(2)
         LR    2,4
         LTR   4,4
         BNE   @@L1039
         L     2,8(5)
         SLR   6,6
         IC    6,2(2)
         LR    2,6
         LTR   6,6
         BNE   @@L1039
         LR    2,9
@@L1039  EQU   *
         L     12,8(,10)
         ST    8,88(13)
         ST    2,92(13)
         MVC   96(4,13),4(5)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SRELOPER)
         BALR  14,15
         B     @@L1232
@@L1047  EQU   *
         L     12,8(,10)
         LA    3,242(0,0)
         CR    2,3
         BE    @@L1042
         BH    @@L1048
         LA    6,241(0,0)
         CLR   2,6
         L     14,=A(@@L1036)
         BNER  14
         ST    8,88(13)
         ST    7,92(13)
         MVC   96(4,13),4(5)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(SUNARYOP)
         BALR  14,15
         B     @@L1232
@@L1048  EQU   *
         L     12,8(,10)
         LA    3,243(0,0)
         CLR   2,3
         BE    @@L1044
         L     14,=A(@@L1036)
         BR    14
@@L1042  EQU   *
         L     12,8(,10)
         ST    8,88(13)
         ST    7,92(13)
         MVC   96(4,13),4(5)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         B     @@L1232
@@L1254  EQU   *
         L     12,8(,10)
         L     3,4(5)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         L     14,=A(@@L1019)
         BER   14
         LH    2,0(3)
         CLM   2,3,=H'63'
         L     14,=A(@@L1292)
         BER   14
@@L1020  EQU   *
         L     12,8(,10)
         ST    5,88(13)
         LA    2,112(,13)
         ST    2,92(13)
         LA    2,116(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@70)
         BALR  14,15
         ST    15,120(13)
         LTR   15,15
         L     14,=A(@@L1019)
         BER   14
         L     3,=V(RTX@CLAS)
         IC    2,0(3,8)
         CLM   2,1,=XL1'4C'
         L     14,=A(@@L1293)
         BER   14
@@L1025  EQU   *
         L     12,8(,10)
         L     2,=V(CIRTX)
         MVC   124(4,13),256(2)
         MVC   88(4,13),=F'102'
         LA    2,120(,13)
         ST    2,92(13)
         LA    2,124(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@71)
         BALR  14,15
         LR    6,15
         LA    2,102(0,0)
         CLR   15,2
         L     14,=A(@@L1294)
         BER   14
@@L1026  EQU   *
         L     12,8(,10)
         MVC   88(4,13),112(13)
         L     2,=V(GLBRTL)
         MVC   92(4,13),0(2)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         ST    15,112(13)
         MVC   88(4,13),116(13)
         MVC   92(4,13),0(2)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         ST    15,116(13)
         MVC   88(4,13),112(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GENERAL@)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1019)
         BER   14
         MVC   88(4,13),116(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GENERAL@)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1019)
         BER   14
         L     4,112(13)
         L     2,=V(CONST@TR)
         CL    4,0(2)
         L     14,=A(@@L1295)
         BER   14
@@L1028  EQU   *
         L     12,8(,10)
         L     2,=V(CIRTX)
         CL    4,256(2)
         BE    @@L1296
@@L1030  EQU   *
         L     12,8(,10)
         L     4,112(13)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L1297
@@L1032  EQU   *
         L     12,8(,10)
         L     3,116(13)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L1298
@@L1034  EQU   *
         L     12,8(,10)
         ST    6,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),120(13)
         MVC   100(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'72'
         ST    7,92(13)
         ST    15,96(13)
         MVC   100(4,13),112(13)
         MVC   104(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         L     14,=A(@@L1015)
         BR    14
@@L1298  EQU   *
         L     12,8(,10)
         L     2,4(3)
         L     8,=F'-1'
         CLR   2,8
         BNE   @@L1034
         L     2,=V(CIRTX)
         CL    4,256(2)
         BNE   @@L1034
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(REVCOND)
         BALR  14,15
         ST    15,88(13)
@@L1229  EQU   *
         L     12,8(,10)
         ST    7,92(13)
         MVC   96(4,13),120(13)
         MVC   100(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'77'
         ST    7,92(13)
         ST    15,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
@@L1230  EQU   *
         L     12,8(,10)
         LR    5,15
         LH    8,0(15)
         N     8,=XL4'0000FFFF'
         SLR   9,9
         L     14,=A(@@L1019)
         BR    14
@@L1297  EQU   *
         L     12,8(,10)
         L     2,4(4)
         L     3,=F'-1'
         CLR   2,3
         BNE   @@L1032
         L     3,=V(CIRTX)
         L     2,116(13)
         CL    2,256(3)
         BNE   @@L1032
         ST    6,88(13)
         B     @@L1229
@@L1296  EQU   *
         L     12,8(,10)
         L     3,=V(CONST@TR)
         L     2,116(13)
         CL    2,0(3)
         BNE   @@L1030
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(REVCOND)
         BALR  14,15
         LTR   15,15
         BE    @@L1030
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(REVCOND)
         BALR  14,15
         ST    15,88(13)
@@L1231  EQU   *
         L     12,8(,10)
         ST    7,92(13)
         MVC   96(4,13),120(13)
         MVC   100(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         B     @@L1230
@@L1295  EQU   *
         L     12,8(,10)
         L     3,=V(CIRTX)
         L     2,116(13)
         CL    2,256(3)
         BNE   @@L1028
         ST    6,88(13)
         B     @@L1231
@@L1294  EQU   *
         L     12,8(,10)
         L     2,120(13)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         LR    15,5
         CLM   2,1,=XL1'4C'
         BNE   @@L1026
         L     14,=A(@@L1015)
         BR    14
@@L1293  EQU   *
         L     12,8(,10)
         L     2,112(13)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         L     14,=A(@@L1019)
         BER   14
         L     2,116(13)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L1025
         L     14,=A(@@L1019)
         BR    14
@@L1292  EQU   *
         L     12,8(,10)
         L     2,4(3)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BNE   @@L1020
         L     14,=A(@@L1019)
         BR    14
@@L1022  EQU   *
         L     12,8(,10)
         L     4,=V(RTX@CLAS)
         L     3,4(5)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BE    @@L1023
         LH    2,0(3)
         CLM   2,3,=H'63'
         BNE   @@L1020
         L     2,4(3)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BNE   @@L1020
@@L1023  EQU   *
         L     12,8(,10)
         L     3,8(5)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         L     14,=A(@@L1021)
         BER   14
         LH    2,0(3)
         CLM   2,3,=H'63'
         BNE   @@L1020
         L     2,4(3)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BNE   @@L1020
         L     14,=A(@@L1021)
         BR    14
@@L1018  EQU   *
         L     12,8(,10)
         L     4,4(5)
         LH    2,0(4)
         CLM   2,3,=H'89'
         L     14,=A(@@L1017)
         BNER  14
         L     6,4(4)
         LH    2,0(6)
         CLM   2,3,=H'75'
         L     14,=A(@@L1017)
         BNER  14
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'87'
         L     14,=A(@@L1017)
         BNER  14
         L     15,8(3)
         LH    2,0(15)
         CLM   2,3,=H'54'
         L     14,=A(@@L1017)
         BNER  14
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L1017)
         BNER  14
         CLR   15,3
         L     14,=A(@@L1017)
         BNER  14
         L     2,8(6)
         LH    2,0(2)
         CLM   2,3,=H'54'
         L     14,=A(@@L1017)
         BNER  14
         MVC   88(4,13),=F'89'
         ST    7,92(13)
         L     2,4(5)
         L     2,4(2)
         MVC   96(4,13),8(2)
         L     2,4(5)
         MVC   100(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LR    4,15
         LTR   15,15
         L     14,=A(@@L1017)
         BER   14
         MVC   88(4,13),=F'0'
         B     @@PGE23
         DS    0F
         LTORG
         DS    0F
@@PGE23  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG24   EQU   *
         MVC   92(4,13),=F'87'
         ST    7,96(13)
         L     2,4(5)
         L     2,4(2)
         L     2,4(2)
         MVC   100(4,13),4(2)
         L     2,4(5)
         L     2,8(2)
         MVC   104(4,13),4(2)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'89'
         ST    7,96(13)
         ST    15,100(13)
         L     2,4(5)
         L     2,8(2)
         MVC   104(4,13),4(2)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         ST    15,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         A     5,=F'4'
         ST    5,88(13)
         A     5,=F'-4'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     14,=A(@@L1017)
         BR    14
@@L1253  EQU   *
         L     12,12(,10)
         MVC   88(4,13),4(5)
         MVC   92(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SWAP@COM)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1016)
         BER   14
         L     4,4(5)
         A     5,=F'4'
         ST    5,88(13)
         A     5,=F'-4'
         MVC   92(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         A     5,=F'8'
         ST    5,88(13)
         A     5,=F'-8'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     14,=A(@@L1016)
         BR    14
@@L1015  EQU   *
         L     12,12(,10)
* Function combine_simplify_rtx epilogue
         PDPEPIL
* Function combine_simplify_rtx literal pool
         DS    0F
         LTORG
* Function combine_simplify_rtx page table
         DS    0F
@@PGT21  EQU   *
         DC    A(@@PG21)
         DC    A(@@PG22)
         DC    A(@@PG23)
         DC    A(@@PG24)
         DS    0F
* S-func simplify_if_then_else prologue
@@79     PDPPRLG CINDEX=25,FRAME=176,BASER=12,ENTRY=NO
         B     @@FEN25
         LTORG
@@FEN25  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG25   EQU   *
         LR    11,1
         L     10,=A(@@PGT25)
* Function simplify_if_then_else code
         L     2,0(11)
         SLR   3,3
         IC    3,2(2)
         ST    3,112(13)
         L     9,4(2)
         L     8,8(2)
         MVC   116(4,13),12(2)
         LH    4,0(9)
         N     4,=XL4'0000FFFF'
         ST    4,120(13)
         MVC   124(4,13),=F'0'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,4)
         CLM   2,1,=XL1'4C'
         L     14,=A(@@L1385)
         BER   14
@@L1300  EQU   *
         L     12,0(,10)
         L     5,124(13)
         LTR   5,5
         BE    @@L1301
         L     2,=V(CONST@TR)
         CL    8,0(2)
         L     14,=A(@@L1386)
         BER   14
@@L1301  EQU   *
         L     12,0(,10)
         L     2,124(13)
         LTR   2,2
         BE    @@L1302
         L     2,=V(CIRTX)
         CL    8,256(2)
         L     14,=A(@@L1387)
         BER   14
@@L1302  EQU   *
         L     12,0(,10)
         L     4,124(13)
         LTR   4,4
         L     14,=A(@@L1388)
         BNER  14
@@L1303  EQU   *
         L     12,0(,10)
         L     3,124(13)
         LTR   3,3
         L     14,=A(@@L1389)
         BNER  14
@@L1314  EQU   *
         L     12,0(,10)
         ST    8,88(13)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1390)
         BNER  14
@@L1321  EQU   *
         L     12,0(,10)
         L     5,120(13)
         LA    15,103(0,0)
         CLR   5,15
         L     14,=A(@@L1391)
         BER   14
@@L1322  EQU   *
         L     12,0(,10)
         L     15,120(13)
         LA    2,102(0,0)
         CLR   15,2
         L     14,=A(@@L1392)
         BER   14
@@L1325  EQU   *
         L     12,0(,10)
         L     3,112(13)
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    15,1(0,0)
         CLR   2,15
         L     14,=A(@@L1393)
         BER   14
@@L1329  EQU   *
         L     12,0(,10)
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    15,2(0,0)
         CLR   2,15
         L     14,=A(@@L1339)
         BER   14
         LA    3,6(0,0)
         CLR   2,3
         L     14,=A(@@L1339)
         BER   14
         LA    4,8(0,0)
         CLR   2,4
         L     14,=A(@@L1339)
         BER   14
@@L1338  EQU   *
         L     12,0(,10)
         L     5,124(13)
         LTR   5,5
         L     14,=A(@@L1394)
         BNER  14
@@L1337  EQU   *
         L     12,0(,10)
         L     2,124(13)
         LTR   2,2
         BE    @@L1351
         L     3,112(13)
         LTR   3,3
         BNE   @@L1395
@@L1351  EQU   *
         L     3,120(13)
         LA    4,102(0,0)
         CLR   3,4
         BE    @@L1396
@@L1371  EQU   *
         L     2,0(11)
         L     14,=A(@@L1299)
         BR    14
@@L1396  EQU   *
         L     3,8(9)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L1371
         L     5,116(13)
         CLR   5,3
         BNE   @@L1371
         LH    2,0(8)
         CLM   2,3,=H'54'
         BNE   @@L1371
         MVC   88(4,13),4(9)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BE    @@L1397
@@L1373  EQU   *
         MVC   88(4,13),4(9)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         L     3,112(13)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         BNE   @@L1371
         L     8,4(8)
         LCR   2,8
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BL    @@L1371
@@L1372  EQU   *
         MVC   88(4,13),112(13)
         MVC   92(4,13),4(9)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'87'
         MVC   96(4,13),112(13)
         ST    15,100(13)
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
@@L1378  EQU   *
         L     12,0(,10)
         LR    2,15
         L     14,=A(@@L1299)
         BR    14
@@L1397  EQU   *
         MVC   88(4,13),4(8)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNL   @@L1372
         B     @@L1373
@@L1395  EQU   *
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   @@L1351
         ST    8,88(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LR    6,15
         MVC   88(4,13),116(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LR    7,15
         MVC   136(4,13),4(9)
         MVC   140(4,13),8(9)
         MVC   148(4,13),=F'1'
         MVC   144(4,13),148(13)
         MVC   152(4,13),112(13)
         ST    2,156(13)
         ST    2,160(13)
         LH    3,0(6)
         LR    2,3
         AH    2,=H'-75'
         CLM   2,3,=H'1'
         L     14,=A(@@L1353)
         BNHR  14
         CLM   3,3,=H'84'
         L     14,=A(@@L1353)
         BER   14
         CLM   3,3,=H'85'
         L     14,=A(@@L1353)
         BER   14
         CLM   3,3,=H'87'
         L     14,=A(@@L1353)
         BER   14
         CLM   3,3,=H'90'
         L     14,=A(@@L1353)
         BER   14
         CLM   3,3,=H'89'
         L     14,=A(@@L1353)
         BER   14
@@L1352  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'75'
         L     14,=A(@@L1356)
         BER   14
         CLM   2,3,=H'84'
         L     14,=A(@@L1356)
         BER   14
         CLM   2,3,=H'85'
         L     14,=A(@@L1356)
         BER   14
@@L1355  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'120'
         L     14,=A(@@L1398)
         BER   14
@@L1358  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'120'
         BE    @@L1399
@@L1361  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'121'
         BE    @@L1400
@@L1364  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'121'
         BE    @@L1401
@@L1354  EQU   *
         L     12,0(,10)
         L     5,156(13)
         LTR   5,5
         BE    @@L1351
         MVC   88(4,13),120(13)
         MVC   92(4,13),152(13)
         MVC   96(4,13),136(13)
         MVC   100(4,13),140(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,88(13)
         L     3,=V(GLBRTL)
         MVC   92(4,13),0(3)
         MVC   96(4,13),0(3)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'78'
         MVC   92(4,13),152(13)
         MVC   96(4,13),160(13)
         L     2,=V(CONST@TR)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'78'
         MVC   92(4,13),152(13)
         ST    4,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),0(3)
         MVC   96(4,13),0(3)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),152(13)
         MVC   92(4,13),156(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         MVC   88(4,13),144(13)
         MVC   92(4,13),152(13)
         ST    15,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    4,15
         L     2,148(13)
         LA    15,1(0,0)
         CLR   2,15
         BE    @@L1370
         ST    2,88(13)
         MVC   92(4,13),112(13)
         ST    4,96(13)
         MVC   100(4,13),152(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         LR    4,15
@@L1370  EQU   *
         LR    2,4
         L     14,=A(@@L1299)
         BR    14
@@L1401  EQU   *
         L     2,4(6)
         LH    3,0(2)
         CLM   3,3,=H'75'
         BE    @@L1368
         CLM   3,3,=H'84'
         BE    @@L1368
         CLM   3,3,=H'85'
         BNE   @@L1354
@@L1368  EQU   *
         L     4,8(2)
         LH    2,0(4)
         CLM   2,3,=H'63'
         BNE   @@L1354
         L     2,112(13)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L1354
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1354
         L     2,4(6)
         L     2,8(2)
         MVC   88(4,13),4(2)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1354
         ST    7,88(13)
         SLR   2,2
         IC    2,2(7)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     4,4(6)
         L     2,8(4)
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     2,0(2,3)
         X     2,=F'-1'
         NR    2,15
         LTR   2,2
         BNE   @@L1354
         MVC   160(4,13),4(4)
         ST    7,156(13)
         L     2,0(4)
         LR    4,2
         SRL   4,16
         ST    4,144(13)
@@L1374  EQU   *
         MVC   148(4,13),=F'121'
@@L1375  EQU   *
         SRL   2,8
         ST    2,152(13)
         NC    152(4,13),=F'255'
         B     @@L1354
@@L1400  EQU   *
         L     4,4(6)
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-75'
         CLM   2,3,=H'1'
         BNH   @@L1365
         CLM   3,3,=H'84'
         BE    @@L1365
         CLM   3,3,=H'85'
         BE    @@L1365
         CLM   3,3,=H'87'
         BE    @@L1365
         CLM   3,3,=H'90'
         BE    @@L1365
         CLM   3,3,=H'89'
         BNE   @@L1364
@@L1365  EQU   *
         L     4,4(4)
         LH    2,0(4)
         CLM   2,3,=H'63'
         BNE   @@L1364
         L     2,112(13)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L1364
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1364
         L     2,4(6)
         L     2,4(2)
         MVC   88(4,13),4(2)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1364
         ST    7,88(13)
         SLR   2,2
         IC    2,2(7)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     4,4(6)
         L     2,4(4)
         SLR   5,5
         IC    5,2(2)
         LR    2,5
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     2,0(2,3)
         X     2,=F'-1'
         NR    2,15
         LTR   2,2
         BNE   @@L1364
         MVC   160(4,13),8(4)
         ST    7,156(13)
         L     2,0(4)
         LR    15,2
         SRL   15,16
         ST    15,144(13)
         B     @@L1374
@@L1399  EQU   *
         L     2,4(6)
         LH    3,0(2)
         CLM   3,3,=H'75'
         BE    @@L1362
         CLM   3,3,=H'84'
         BE    @@L1362
         CLM   3,3,=H'85'
         BNE   @@L1361
@@L1362  EQU   *
         L     3,8(2)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BNE   @@L1361
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1361
         L     2,4(6)
         L     2,8(2)
         MVC   88(4,13),4(2)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1361
         ST    7,88(13)
         SLR   2,2
         IC    2,2(7)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         ST    15,168(13)
         L     4,=V(MODE@BIT)
         L     2,112(13)
         MH    2,=H'2'
         LH    3,0(2,4)
         N     3,=XL4'0000FFFF'
         L     5,4(6)
         L     2,8(5)
         SLR   15,15
         IC    15,2(2)
         LR    2,15
         MH    2,=H'2'
         LH    2,0(2,4)
         N     2,=XL4'0000FFFF'
         SR    3,2
         L     2,168(13)
         CLR   2,3
         BNH   @@L1361
         MVC   160(4,13),4(5)
@@L1377  EQU   *
         ST    7,156(13)
         L     2,0(5)
         LR    3,2
         SRL   3,16
         ST    3,144(13)
         MVC   148(4,13),=F'120'
         B     @@L1375
@@L1398  EQU   *
         L     4,4(6)
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-75'
         CLM   2,3,=H'1'
         BNH   @@L1359
         CLM   3,3,=H'84'
         BE    @@L1359
         CLM   3,3,=H'85'
         BE    @@L1359
         CLM   3,3,=H'87'
         BE    @@L1359
         CLM   3,3,=H'90'
         BE    @@L1359
         CLM   3,3,=H'89'
         BNE   @@L1358
@@L1359  EQU   *
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BNE   @@L1358
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1358
         L     2,4(6)
         L     2,4(2)
         MVC   88(4,13),4(2)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1358
         ST    7,88(13)
         SLR   2,2
         IC    2,2(7)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         ST    15,168(13)
         L     4,=V(MODE@BIT)
         L     2,112(13)
         MH    2,=H'2'
         LH    3,0(2,4)
         N     3,=XL4'0000FFFF'
         L     5,4(6)
         L     2,4(5)
         SLR   15,15
         IC    15,2(2)
         LR    2,15
         MH    2,=H'2'
         LH    2,0(2,4)
         N     2,=XL4'0000FFFF'
         SR    3,2
         L     2,168(13)
         CLR   2,3
         BNH   @@L1358
         MVC   160(4,13),8(5)
         B     @@L1377
@@L1356  EQU   *
         MVC   88(4,13),8(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1355
         MVC   160(4,13),4(6)
@@L1376  EQU   *
         LH    6,0(6)
         N     6,=XL4'0000FFFF'
         ST    6,144(13)
         ST    7,156(13)
         B     @@L1354
@@L1353  EQU   *
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1352
         MVC   160(4,13),8(6)
         B     @@L1376
@@L1394  EQU   *
         MVC   88(4,13),4(9)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1337
         MVC   88(4,13),8(9)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1337
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1337
         L     3,120(13)
         A     3,=F'-104'
         LA    15,7(0,0)
         CLR   3,15
         BH    @@L1337
         MH    3,=H'4'
         L     2,=A(@@L1350)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1350  EQU   *
         DC    A(@@L1342)
         DC    A(@@L1342)
         DC    A(@@L1344)
         DC    A(@@L1344)
         DC    A(@@L1346)
         DC    A(@@L1346)
         DC    A(@@L1348)
         DC    A(@@L1348)
@@L1342  EQU   *
         MVC   88(4,13),=F'93'
@@L1384  EQU   *
         MVC   92(4,13),112(13)
         ST    8,96(13)
         MVC   100(4,13),116(13)
@@L1383  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         B     @@L1378
@@L1344  EQU   *
         MVC   88(4,13),=F'92'
         B     @@L1384
@@L1346  EQU   *
         MVC   88(4,13),=F'95'
         B     @@L1384
@@L1348  EQU   *
         MVC   88(4,13),=F'94'
         B     @@L1384
@@L1339  EQU   *
         L     2,=V(FLAG@UNS)
         L     2,0(2)
         LTR   2,2
         BE    @@L1337
         B     @@L1338
@@L1393  EQU   *
         L     4,116(13)
         LH    2,0(4)
         CLM   2,3,=H'77'
         BNE   @@L1329
         ST    8,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1329
         L     5,124(13)
         LTR   5,5
         BE    @@L1329
         ST    8,88(13)
         MVC   92(4,13),4(9)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1329
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1329
         L     15,120(13)
         LA    2,104(0,0)
         CLR   15,2
         BL    @@L1329
         LA    4,105(0,0)
         CLR   15,4
         BNH   @@L1332
         LA    5,107(0,0)
         CLR   15,5
         BH    @@L1329
         MVC   88(4,13),=F'129'
         MVC   92(4,13),112(13)
         ST    8,96(13)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         MVC   88(4,13),=F'77'
         MVC   92(4,13),112(13)
         ST    15,96(13)
@@L1380  EQU   *
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         B     @@L1378
@@L1332  EQU   *
         MVC   88(4,13),=F'129'
         MVC   92(4,13),112(13)
         ST    8,96(13)
         B     @@L1380
@@L1392  EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1325
         L     3,112(13)
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    3,2(0,0)
         CLR   2,3
         BE    @@L1328
         LA    4,6(0,0)
         CLR   2,4
         BE    @@L1328
         LA    5,8(0,0)
         CLR   2,5
         BE    @@L1328
@@L1327  EQU   *
         MVC   88(4,13),4(9)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1325
         MVC   88(4,13),8(9)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LR    2,8
         LTR   15,15
         L     14,=A(@@L1299)
         BNER  14
         B     @@L1325
@@L1328  EQU   *
         L     2,=V(FLAG@UNS)
         L     2,0(2)
         LTR   2,2
         BE    @@L1325
         B     @@L1327
@@L1391  EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1322
         L     3,112(13)
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    3,2(0,0)
         CLR   2,3
         L     14,=A(@@L1324)
         BER   14
         LA    4,6(0,0)
         CLR   2,4
         BE    @@L1324
         LA    5,8(0,0)
         CLR   2,5
         BE    @@L1324
@@L1323  EQU   *
         MVC   88(4,13),4(9)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1322
         MVC   88(4,13),8(9)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         L     2,116(13)
         LTR   15,15
         L     14,=A(@@L1299)
         BNER  14
         B     @@L1322
@@L1324  EQU   *
         L     2,=V(FLAG@UNS)
         L     2,0(2)
         LTR   2,2
         BE    @@L1322
         B     @@L1323
@@L1390  EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LR    2,8
         LTR   15,15
         L     14,=A(@@L1299)
         BER   14
         B     @@L1321
@@L1389  EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         LTR   15,15
         BE    @@L1314
         L     2,=V(GLBRTL)
         CL    8,0(2)
         L     14,=A(@@L1315)
         BER   14
         LH    3,0(8)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         L     14,=A(@@L1317)
         BNHR  14
         CLM   3,3,=H'54'
         L     14,=A(@@L1317)
         BER   14
         CLM   3,3,=H'55'
         L     14,=A(@@L1317)
         BER   14
         CLM   3,3,=H'58'
         B     @@PGE25
         DS    0F
         LTORG
         DS    0F
@@PGE25  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG26   EQU   *
         BE    @@L1317
         CLM   3,3,=H'134'
         BE    @@L1317
         CLM   3,3,=H'56'
         BE    @@L1317
         CLM   3,3,=H'140'
         BE    @@L1317
@@L1316  EQU   *
         L     12,4(,10)
         L     2,=V(CIRTX)
         CL    8,256(2)
         BE    @@L1315
         L     4,=V(RTX@CLAS)
         LH    2,0(8)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BE    @@L1402
@@L1318  EQU   *
         L     12,4(,10)
         CLM   3,3,=H'63'
         BE    @@L1403
@@L1319  EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L1404
@@L1315  EQU   *
         L     12,4(,10)
         ST    9,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         ST    9,88(13)
         SLR   2,2
         IC    2,2(9)
         ST    2,92(13)
         MVC   96(4,13),4(9)
         MVC   100(4,13),8(9)
         LA    1,88(,13)
         L     15,=A(@@77)
         BALR  14,15
         L     2,0(11)
         A     2,=F'4'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     3,0(11)
         A     3,=F'8'
         ST    3,0(11)
         ST    3,88(13)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         A     3,=F'4'
         ST    3,88(13)
         A     3,=F'-12'
         ST    3,0(11)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         LR    4,8
         L     8,116(13)
         ST    4,116(13)
         L     9,0(2)
         LH    4,0(9)
         N     4,=XL4'0000FFFF'
         ST    4,120(13)
         MVC   124(4,13),=F'0'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,4)
         CLM   2,1,=XL1'4C'
         L     14,=A(@@L1314)
         BNER  14
         MVC   124(4,13),=F'1'
         L     14,=A(@@L1314)
         BR    14
@@L1404  EQU   *
         L     12,4(,10)
         MVC   88(4,13),116(13)
         MVC   92(4,13),4(9)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1314)
         BER   14
         B     @@L1315
@@L1403  EQU   *
         L     12,4(,10)
         L     2,4(8)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BNE   @@L1319
         L     15,116(13)
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BNE   @@L1315
         B     @@L1319
@@L1402  EQU   *
         L     12,4(,10)
         L     5,116(13)
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BNE   @@L1315
         B     @@L1318
@@L1317  EQU   *
         L     12,4(,10)
         L     4,116(13)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L1316
         L     2,=V(GLBRTL)
         CL    4,0(2)
         BNE   @@L1315
         B     @@L1316
@@L1388  EQU   *
         L     12,4(,10)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         LR    6,15
         LTR   15,15
         L     14,=A(@@L1303)
         BER   14
         L     5,4(9)
         LH    2,0(5)
         CLM   2,3,=H'61'
         L     14,=A(@@L1303)
         BNER  14
         L     7,8(9)
         ST    7,128(13)
         MVC   132(4,13),=F'0'
         LA    15,103(0,0)
         CLR   6,15
         BE    @@L1405
@@L1304  EQU   *
         L     12,4(,10)
         L     2,120(13)
         LA    3,103(0,0)
         CLR   2,3
         BE    @@L1406
@@L1305  EQU   *
         L     12,4(,10)
         L     4,120(13)
         LA    15,103(0,0)
         CLR   4,15
         BE    @@L1407
@@L1306  EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BNE   @@L1408
@@L1308  EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BNE   @@L1409
@@L1309  EQU   *
         L     12,4(,10)
         L     2,0(11)
         A     2,=F'8'
         ST    2,88(13)
         A     2,=F'-8'
         ST    2,0(11)
         L     2,116(13)
         L     3,132(13)
         LTR   3,3
         BNE   @@L1311
         LR    2,8
@@L1311  EQU   *
         L     12,4(,10)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     4,0(11)
         A     4,=F'12'
         ST    4,88(13)
         A     4,=F'-12'
         ST    4,0(11)
         LR    15,8
         L     5,132(13)
         LTR   5,5
         BNE   @@L1313
         L     15,116(13)
@@L1313  EQU   *
         L     12,4(,10)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     15,0(11)
         L     8,8(15)
         MVC   116(4,13),12(15)
         LH    2,0(9)
         N     2,=XL4'0000FFFF'
         ST    2,120(13)
         L     14,=A(@@L1303)
         BR    14
@@L1409  EQU   *
         L     12,4(,10)
         MVC   88(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,88(13)
         ST    6,92(13)
         ST    5,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=A(@@83)
         BALR  14,15
         ST    15,88(13)
         L     2,=V(GLBRTL)
         MVC   92(4,13),0(2)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         ST    15,116(13)
         B     @@L1309
@@L1408  EQU   *
         L     12,4(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),120(13)
         ST    5,96(13)
         MVC   100(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@83)
         BALR  14,15
         ST    15,88(13)
         L     2,=V(GLBRTL)
         MVC   92(4,13),0(2)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         LR    8,15
         B     @@L1308
@@L1407  EQU   *
         L     12,4(,10)
         L     4,=V(CIRTX)
         CL    7,256(4)
         BNE   @@L1306
         ST    5,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         BNE   @@L1306
         L     6,120(13)
         L     7,252(4)
         B     @@L1306
@@L1406  EQU   *
         L     12,4(,10)
         L     2,=V(CIRTX)
         CL    7,256(2)
         BNE   @@L1305
         ST    5,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L1305
         L     6,120(13)
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    7,15
         B     @@L1306
@@L1405  EQU   *
         L     12,4(,10)
         MVC   132(4,13),=F'1'
         ST    6,120(13)
         LA    6,102(0,0)
         LR    4,8
         L     8,116(13)
         ST    4,116(13)
         B     @@L1304
@@L1387  EQU   *
         L     12,4(,10)
         L     2,=V(CONST@TR)
         L     3,116(13)
         CL    3,0(2)
         L     14,=A(@@L1302)
         BNER  14
         ST    9,88(13)
         MVC   92(4,13),112(13)
         MVC   96(4,13),4(9)
         MVC   100(4,13),8(9)
         LA    1,88(,13)
         L     15,=A(@@77)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   @@L1299
         L     14,=A(@@L1302)
         BR    14
@@L1386  EQU   *
         L     12,4(,10)
         L     2,=V(CIRTX)
         L     15,116(13)
         CL    15,256(2)
         L     14,=A(@@L1301)
         BNER  14
         MVC   88(4,13),120(13)
         MVC   92(4,13),112(13)
         MVC   96(4,13),4(9)
         MVC   100(4,13),8(9)
         L     14,=A(@@L1383)
         BR    14
@@L1385  EQU   *
         L     12,4(,10)
         MVC   124(4,13),=F'1'
         L     14,=A(@@L1300)
         BR    14
@@L1299  EQU   *
         L     12,4(,10)
         LR    15,2
* Function simplify_if_then_else epilogue
         PDPEPIL
* Function simplify_if_then_else literal pool
         DS    0F
         LTORG
* Function simplify_if_then_else page table
         DS    0F
@@PGT25  EQU   *
         DC    A(@@PG25)
         DC    A(@@PG26)
         DS    0F
* S-func simplify_set prologue
@@80     PDPPRLG CINDEX=27,FRAME=136,BASER=12,ENTRY=NO
         B     @@FEN27
         LTORG
@@FEN27  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG27   EQU   *
         LR    11,1
         L     10,=A(@@PGT27)
* Function simplify_set code
         L     8,0(11)
         L     6,8(8)
         L     7,4(8)
         IC    2,2(6)
         CLM   2,1,=XL1'00'
         L     14,=A(@@L1411)
         BER   14
         SLR   4,4
         IC    4,2(6)
@@L1412  EQU   *
         L     12,0(,10)
         LH    2,0(7)
         CLM   2,3,=H'59'
         L     14,=A(@@L1454)
         BER   14
@@L1413  EQU   *
         L     12,0(,10)
         LR    2,4
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         L     14,=A(@@L1455)
         BER   14
@@L1414  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'74'
         L     14,=A(@@L1416)
         BER   14
         L     2,=V(GLBRTL)
         CL    7,4(2)
         L     14,=A(@@L1416)
         BER   14
@@L1415  EQU   *
         L     12,0(,10)
         ST    6,88(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LR    6,15
         A     8,=F'8'
         ST    8,88(13)
         A     8,=F'-8'
         ST    15,92(13)
@@L1452  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
@@L1431  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'63'
         BE    @@L1456
@@L1432  EQU   *
         LH    2,0(7)
         CLM   2,3,=H'59'
         BE    @@L1436
         LH    2,0(6)
         CLM   2,3,=H'72'
         BE    @@L1457
@@L1436  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'49'
         BE    @@L1458
@@L1448  EQU   *
         LH    2,0(7)
         CLM   2,3,=H'49'
         BE    @@L1459
@@L1450  EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@84)
         BALR  14,15
         L     14,=A(@@L1410)
         BR    14
@@L1459  EQU   *
         L     3,4(7)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L1450
         LR    15,7
         L     14,=A(@@L1410)
         BR    14
@@L1458  EQU   *
         L     3,4(6)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L1448
         LR    15,6
         L     14,=A(@@L1410)
         BR    14
@@L1457  EQU   *
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L1436
         L     4,4(6)
         LH    2,0(4)
         AH    2,=H'-102'
         CLM   2,3,=H'1'
         BH    @@L1436
         L     3,8(4)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L1436
         L     2,4(4)
         CLC   2(1,6),2(2)
         BNE   @@L1436
         ST    2,88(13)
         L     2,4(6)
         L     2,4(2)
         SLR   4,4
         IC    4,2(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         L     2,4(6)
         L     2,4(2)
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         BNE   @@L1436
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1436
         L     4,4(6)
         LH    2,0(4)
         CLM   2,3,=H'102'
         BE    @@L1460
         L     3,12(6)
@@L1438  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'102'
         BE    @@L1461
         L     5,8(6)
@@L1440  EQU   *
         L     4,=V(CIRTX)
         L     9,256(4)
         LH    2,0(3)
         CLM   2,3,=H'84'
         BE    @@L1462
@@L1441  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'84'
         BE    @@L1463
@@L1443  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'84'
         BE    @@L1464
@@L1445  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'84'
         BE    @@L1465
@@L1442  EQU   *
         MVC   88(4,13),=F'83'
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         L     2,4(6)
         MVC   96(4,13),4(2)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'86'
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         L     2,4(6)
         MVC   96(4,13),4(2)
         SLR   2,2
         IC    2,2(6)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         MVC   88(4,13),=F'83'
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         ST    15,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'84'
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         ST    9,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'84'
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         ST    15,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    2,8
         A     2,=F'8'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     6,0(2)
         B     @@L1436
@@L1465  EQU   *
         MVC   88(4,13),8(5)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1442
         LR    9,3
         L     5,4(5)
@@L1453  EQU   *
         L     2,=V(CIRTX)
         L     3,256(2)
         B     @@L1442
@@L1464  EQU   *
         MVC   88(4,13),4(5)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1445
         LR    9,3
         L     5,8(5)
         B     @@L1453
@@L1463  EQU   *
         MVC   88(4,13),8(3)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1443
         LR    9,5
         L     3,4(3)
         L     2,=V(CIRTX)
         L     5,256(2)
         B     @@L1442
@@L1462  EQU   *
         MVC   88(4,13),4(3)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1441
         LR    9,5
         L     3,8(3)
         L     5,256(4)
         B     @@L1442
@@L1461  EQU   *
         L     5,12(6)
         B     @@L1440
@@L1460  EQU   *
         L     3,8(6)
         B     @@L1438
@@L1456  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1432
         L     2,4(6)
         L     5,0(2)
         LR    3,5
         SRL   3,16
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'96'
         BE    @@L1432
         L     4,=V(MODE@SIZ)
         SLR   2,2
         IC    2,2(6)
         IC    15,0(4,2)
         LR    3,15
         N     3,=XL4'000000FF'
         A     3,=F'3'
         SRA   3,2
         SRL   5,8
         N     5,=F'255'
         IC    4,0(4,5)
         LR    2,4
         N     2,=XL4'000000FF'
         A     2,=F'3'
         SRA   2,2
         CLR   3,2
         BNE   @@L1432
         STC   4,80(,13)
         CLM   15,1,80(13)
         BNL   @@L1432
         LH    2,0(7)
         CLM   2,3,=H'61'
         BE    @@L1435
         CLM   2,3,=H'63'
         BNE   @@L1432
         L     2,4(7)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L1432
@@L1435  EQU   *
         ST    5,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    3,8
         A     3,=F'4'
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         LR    2,8
         A     2,=F'8'
         ST    2,88(13)
         MVC   92(4,13),4(6)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     6,0(2)
         L     7,0(3)
         B     @@L1432
@@L1416  EQU   *
         ST    7,88(13)
         L     2,=A(@@30)
         MVC   92(4,13),0(2)
         LA    2,112(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(FIND@SIN)
         BALR  14,15
         LR    9,15
         LTR   15,15
         BE    @@L1415
         L     2,=A(@@1)
         L     3,8(2)
         LTR   3,3
         BE    @@L1417
         L     2,112(13)
         CLR   2,3
         BNE   @@L1415
@@L1417  EQU   *
         L     4,0(9)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L1415
         MVC   88(4,13),4(4)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1415
         L     2,0(9)
         LH    5,0(2)
         N     5,=XL4'0000FFFF'
         SLR   4,4
         SLR   2,2
         IC    2,2(7)
         ST    2,132(13)
         LH    2,0(6)
         CLM   2,3,=H'74'
         BE    @@L1466
         ST    6,116(13)
         L     2,=V(CIRTX)
         MVC   120(4,13),256(2)
@@L1419  EQU   *
         ST    5,88(13)
         LA    2,116(,13)
         ST    2,92(13)
         LA    2,120(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@71)
         BALR  14,15
         LR    3,15
         CLR   15,5
         BE    @@L1420
         ST    15,88(13)
         L     2,0(9)
         SLR   4,4
         IC    4,2(2)
         ST    4,92(13)
         ST    7,96(13)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         LA    2,102(0,0)
         CLR   5,2
         BE    @@L1467
@@L1423  EQU   *
         LA    2,103(0,0)
         CLR   5,2
         BE    @@L1468
@@L1421  EQU   *
         LA    4,1(0,0)
@@L1420  EQU   *
         LTR   4,4
         BE    @@L1425
         L     2,=A(@@1)
         MVC   8(4,2),112(13)
@@L1425  EQU   *
         L     3,=V(CIRTX)
         L     2,120(13)
         CL    2,256(3)
         BE    @@L1469
@@L1426  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'74'
         BE    @@L1470
@@L1429  EQU   *
         MVC   88(4,13),=F'74'
         MVC   92(4,13),132(13)
         MVC   96(4,13),116(13)
         MVC   100(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,8
         A     2,=F'8'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     6,0(2)
         B     @@L1431
@@L1470  EQU   *
         SLR   2,2
         IC    2,2(6)
         CL    2,132(13)
         BNE   @@L1429
         A     6,=F'4'
         ST    6,88(13)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         A     6,=F'4'
         ST    6,88(13)
         A     6,=F'-8'
         MVC   92(4,13),120(13)
         B     @@L1452
@@L1469  EQU   *
         L     2,=V(GLBRTL)
         CL    7,4(2)
         BNE   @@L1426
         A     8,=F'8'
         ST    8,88(13)
         A     8,=F'-8'
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     6,116(13)
         B     @@L1431
@@L1468  EQU   *
         LA    4,102(0,0)
         CLR   3,4
         BNE   @@L1421
@@L1422  EQU   *
         L     3,=V(CIRTX)
         L     2,120(13)
         CL    2,256(3)
         BNE   @@L1421
         L     4,116(13)
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L1421
         ST    4,88(13)
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    4,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L1421
         L     3,112(13)
         MVC   124(4,13),16(3)
         MVC   128(4,13),=F'0'
         LA    2,124(,13)
         ST    2,88(13)
         ST    3,92(13)
         LA    2,128(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         LTR   15,15
         BNL   @@L1421
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(CHECK@AS)
         BALR  14,15
         LTR   15,15
         BNE   @@L1421
         L     2,0(9)
         STH   5,0(2)
         ST    15,112(13)
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'85'
         L     3,116(13)
         SLR   2,2
         IC    2,2(3)
         ST    2,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,116(13)
         B     @@L1421
@@L1467  EQU   *
         LA    4,103(0,0)
         CLR   3,4
         BNE   @@L1423
         B     @@L1422
@@L1466  EQU   *
         MVC   116(4,13),4(6)
         MVC   120(4,13),8(6)
         B     @@L1419
@@L1455  EQU   *
         ST    6,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'-1'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         LR    6,15
         A     8,=F'8'
         ST    8,88(13)
         A     8,=F'-8'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L1414
@@L1454  EQU   *
         LH    2,0(6)
         LR    15,6
         CLM   2,3,=H'51'
         BNE   @@L1413
         B     @@L1410
@@L1411  EQU   *
         SLR   4,4
         IC    4,2(7)
         B     @@L1412
@@L1410  EQU   *
* Function simplify_set epilogue
         PDPEPIL
* Function simplify_set literal pool
         DS    0F
         LTORG
* Function simplify_set page table
         DS    0F
@@PGT27  EQU   *
         DC    A(@@PG27)
         DS    0F
* S-func simplify_logical prologue
@@81     PDPPRLG CINDEX=28,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN28
         LTORG
@@FEN28  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG28   EQU   *
         LR    11,1
         L     10,=A(@@PGT28)
* Function simplify_logical code
         L     8,0(11)
         SLR   7,7
         IC    7,2(8)
         L     5,4(8)
         L     6,8(8)
         LH    3,0(8)
         N     3,=XL4'0000FFFF'
         LA    2,84(0,0)
         CLR   3,2
         L     14,=A(@@L1492)
         BER   14
         L     14,=A(@@L1522)
         BHR   14
         LA    2,83(0,0)
         CLR   3,2
         BE    @@L1473
@@L1520  EQU   *
         L     12,0(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'5541'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L1472  EQU   *
         L     12,0(,10)
         LR    3,8
         L     14,=A(@@L1471)
         BR    14
@@L1473  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'85'
         L     14,=A(@@L1533)
         BER   14
@@L1474  EQU   *
         L     12,0(,10)
         LH    2,0(5)
         CLM   2,3,=H'85'
         L     14,=A(@@L1534)
         BER   14
@@L1475  EQU   *
         L     12,0(,10)
         LH    2,0(5)
         CLM   2,3,=H'86'
         BE    @@L1535
@@L1476  EQU   *
         L     12,0(,10)
         LH    2,0(5)
         CLM   2,3,=H'86'
         BE    @@L1536
@@L1477  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'54'
         BE    @@L1537
@@L1478  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'84'
         BE    @@L1538
@@L1484  EQU   *
         LH    2,0(5)
         AH    2,=H'-84'
         CLM   2,3,=H'1'
         BNH   @@L1539
@@L1486  EQU   *
         LH    3,0(6)
         LR    2,3
         AH    2,=H'-84'
         CLM   2,3,=H'1'
         BNH   @@L1540
         LH    2,0(5)
         CLM   2,3,=H'86'
         BE    @@L1541
@@L1489  EQU   *
         CLM   3,3,=H'86'
         BNE   @@L1472
         CLM   2,3,=H'85'
         BNE   @@L1472
         MVC   88(4,13),=F'84'
         ST    7,92(13)
         MVC   96(4,13),4(6)
         MVC   100(4,13),4(5)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         MVC   88(4,13),=F'84'
         ST    7,92(13)
         ST    15,96(13)
         MVC   100(4,13),8(5)
@@L1530  EQU   *
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'85'
         ST    7,92(13)
         ST    2,96(13)
@@L1526  EQU   *
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@72)
         BALR  14,15
@@L1523  EQU   *
         L     12,0(,10)
         LR    3,15
         L     14,=A(@@L1471)
         BR    14
@@L1541  EQU   *
         CLM   3,3,=H'85'
         BNE   @@L1489
         MVC   88(4,13),=F'84'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         MVC   100(4,13),4(6)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         MVC   88(4,13),=F'84'
         ST    7,92(13)
         ST    15,96(13)
         MVC   100(4,13),8(6)
         B     @@L1530
@@L1540  EQU   *
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         MVC   96(4,13),4(6)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    3,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         MVC   96(4,13),8(6)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         ST    7,92(13)
         ST    3,96(13)
         B     @@L1526
@@L1539  EQU   *
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    3,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         MVC   96(4,13),8(5)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         ST    7,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@72)
         BALR  14,15
         LR    8,15
         LH    2,0(15)
         LR    3,15
         CLM   2,3,=H'83'
         L     14,=A(@@L1471)
         BNER  14
         B     @@L1486
@@L1538  EQU   *
         MVC   88(4,13),4(5)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L1485
         MVC   88(4,13),8(5)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1484
@@L1485  EQU   *
         MVC   88(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1484
         MVC   88(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LR    3,6
         LTR   15,15
         L     14,=A(@@L1471)
         BER   14
         B     @@L1484
@@L1537  EQU   *
         LR    2,7
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BNH   @@L1479
         L     2,4(6)
         LTR   2,2
         BNH   @@L1478
@@L1479  EQU   *
         ST    8,88(13)
         ST    7,92(13)
         ST    5,96(13)
         MVC   100(4,13),4(6)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         LR    8,15
         L     2,4(11)
         LTR   2,2
         BE    @@L1480
         LH    2,0(15)
         CLM   2,3,=H'84'
         BE    @@L1542
@@L1480  EQU   *
         LH    2,0(8)
         LR    3,8
         CLM   2,3,=H'83'
         L     14,=A(@@L1471)
         BNER  14
         LH    3,0(8)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'83'
         BE    @@L1483
         CLM   2,1,=XL1'F2'
         BNE   @@L1478
@@L1483  EQU   *
         L     5,4(8)
         L     6,8(8)
         B     @@L1478
@@L1542  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'83'
         BNE   @@L1480
         L     2,8(5)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L1480
         LH    2,0(6)
         CLM   2,3,=H'54'
         BNE   @@L1480
         MVC   88(4,13),=F'0'
         L     3,8(5)
         L     2,4(6)
         X     2,=F'-1'
         N     2,4(3)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'84'
@@L1531  EQU   *
         L     12,0(,10)
         ST    7,92(13)
         ST    15,96(13)
@@L1529  EQU   *
         L     12,0(,10)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         B     @@L1523
@@L1536  EQU   *
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'85'
         BNE   @@L1477
         MVC   88(4,13),8(3)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1477
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1477
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    8,15
         B     @@L1477
@@L1535  EQU   *
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'85'
         BNE   @@L1476
         MVC   88(4,13),4(3)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1476
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1476
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         L     2,4(5)
         MVC   96(4,13),8(2)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    8,15
         B     @@L1476
@@L1534  EQU   *
         MVC   88(4,13),8(5)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1475
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1475
         MVC   88(4,13),=F'86'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         ST    15,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    8,15
         B     @@L1475
@@L1533  EQU   *
         MVC   88(4,13),4(5)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1474
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1474
         MVC   88(4,13),=F'86'
         ST    7,92(13)
         MVC   96(4,13),8(5)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         ST    3,88(13)
         ST    7,92(13)
         ST    15,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    8,15
         B     @@L1474
@@L1522  EQU   *
         LA    2,85(0,0)
         CLR   3,2
         BNE   @@L1520
         LR    9,7
         MH    9,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(9,2)
         CLM   2,3,=H'32'
         L     14,=A(@@L1543)
         BNHR  14
@@L1508  EQU   *
         L     12,0(,10)
         SLR   3,3
         LH    2,0(5)
         CLM   2,3,=H'86'
         L     14,=A(@@L1544)
         BER   14
@@L1509  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'86'
         L     14,=A(@@L1545)
         BER   14
@@L1510  EQU   *
         L     12,0(,10)
         LA    2,2(0,0)
         CLR   3,2
         L     14,=A(@@L1546)
         BER   14
         LA    2,1(0,0)
         CLR   3,2
         BE    @@L1547
@@L1512  EQU   *
         L     12,0(,10)
         LH    2,0(5)
         CLM   2,3,=H'83'
         BE    @@L1548
@@L1514  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'83'
         BE    @@L1549
@@L1515  EQU   *
         L     2,=V(CIRTX)
         CL    6,260(2)
         BE    @@L1550
@@L1517  EQU   *
         L     4,=V(CIRTX)
         CL    6,260(4)
         BE    @@L1551
@@L1518  EQU   *
         LR    3,7
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    15,0(3,2)
         CLM   15,3,=H'32'
         BH    @@L1472
         LR    3,7
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     4,0(3,2)
         N     4,=F'1'
         LR    3,15
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LA    2,1(0,0)
         SLL   2,0(3)
         CLR   4,2
         BNE   @@L1472
         L     2,=V(CONST@TR)
         CL    6,0(2)
         BNE   @@L1472
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L1472
         ST    5,88(13)
         ST    7,92(13)
         MVC   96(4,13),4(5)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(@@77)
         BALR  14,15
         LR    3,15
         LTR   15,15
         L     14,=A(@@L1471)
         BNER  14
         B     @@L1472
@@L1551  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'90'
         BNE   @@L1518
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1518
         L     2,=V(MODE@BIT)
         LH    2,0(9,2)
         N     2,=XL4'0000FFFF'
         BCTR  2,0
         CL    2,4(3)
         BNE   @@L1518
         MVC   88(4,13),=F'104'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         MVC   100(4,13),256(4)
@@L1527  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L1523
@@L1550  EQU   *
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L1517
         ST    5,88(13)
         ST    7,92(13)
         MVC   96(4,13),4(5)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(@@77)
         BALR  14,15
         LR    3,15
         LTR   15,15
         L     14,=A(@@L1471)
         BNER  14
         B     @@L1517
@@L1549  EQU   *
         MVC   88(4,13),4(5)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1515
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1515
         MVC   88(4,13),=F'86'
         ST    7,92(13)
         MVC   96(4,13),8(5)
@@L1532  EQU   *
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         MVC   88(4,13),=F'83'
         B     @@L1531
@@L1548  EQU   *
         MVC   88(4,13),8(5)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1514
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1514
         MVC   88(4,13),=F'86'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         B     @@L1532
@@L1547  EQU   *
         MVC   88(4,13),=F'85'
         ST    7,92(13)
         ST    5,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'86'
         ST    7,92(13)
         ST    15,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         B     @@L1523
@@L1546  EQU   *
         A     8,=F'4'
         ST    8,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         A     8,=F'4'
         ST    8,88(13)
         A     8,=F'-8'
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L1512
@@L1545  EQU   *
         A     3,=F'1'
         L     6,4(6)
         B     @@L1510
@@L1544  EQU   *
         LA    3,1(0,0)
         L     5,4(5)
         B     @@L1509
@@L1543  EQU   *
         ST    5,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    2,15
         ST    6,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    2,15
         LTR   2,2
         BNE   @@L1508
         MVC   88(4,13),=F'84'
         ST    7,92(13)
         ST    5,96(13)
         B     @@L1529
@@L1492  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'54'
         L     14,=A(@@L1552)
         BER   14
@@L1493  EQU   *
         L     12,0(,10)
         LH    2,0(5)
         CLM   2,3,=H'83'
         L     14,=A(@@L1553)
         BER   14
@@L1494  EQU   *
         L     12,0(,10)
         LH    2,0(5)
         CLM   2,3,=H'83'
         L     14,=A(@@L1554)
         BER   14
@@L1496  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'83'
         L     14,=A(@@L1555)
         BER   14
@@L1498  EQU   *
         L     12,0(,10)
         LH    3,0(5)
         CLM   3,3,=H'87'
         L     14,=A(@@L1556)
         BER   14
@@L1502  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'87'
         BE    @@L1557
@@L1500  EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'54'
         BNE   @@L1472
         LH    2,0(5)
         CLM   2,3,=H'89'
         BNE   @@L1472
         L     15,4(5)
         LH    2,0(15)
         CLM   2,3,=H'75'
         BNE   @@L1472
         L     2,8(15)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L1472
         L     3,8(5)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L1472
         L     2,4(3)
         LA    3,31(0,0)
         CR    2,3
         BH    @@L1472
         L     3,4(6)
         LR    4,3
         SLL   4,0(2)
         LR    6,4
         SRA   6,0(2)
         CLR   6,3
         BNE   @@L1472
         ST    15,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    15,4
         LTR   15,15
         BNE   @@L1472
         ST    15,88(13)
         L     2,4(5)
         L     2,8(2)
         O     4,4(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         L     2,4(5)
         A     2,=F'8'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         LR    3,5
         L     14,=A(@@L1471)
         BR    14
@@L1557  EQU   *
         CLM   3,3,=H'90'
         BNE   @@L1500
@@L1501  EQU   *
         L     12,0(,10)
         MVC   88(4,13),4(5)
         MVC   92(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1500
         L     4,8(5)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BNE   @@L1500
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1500
         L     4,4(4)
         A     4,4(3)
         LR    3,7
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         CLR   4,2
         BNE   @@L1500
         MVC   88(4,13),=F'88'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         LH    2,0(5)
         CLM   2,3,=H'87'
         BE    @@L1558
         L     2,8(6)
@@L1504  EQU   *
         ST    2,100(13)
         B     @@L1527
@@L1558  EQU   *
         L     2,8(5)
         B     @@L1504
@@L1556  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'90'
         BNE   @@L1502
         B     @@L1501
@@L1555  EQU   *
         MVC   88(4,13),=F'84'
         ST    7,92(13)
         MVC   96(4,13),4(6)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         MVC   88(4,13),=F'84'
         ST    7,92(13)
         MVC   96(4,13),8(6)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@72)
         BALR  14,15
         LR    8,15
         LH    2,0(15)
         LR    3,15
         CLM   2,3,=H'84'
         L     14,=A(@@L1471)
         BNER  14
         B     @@L1498
@@L1554  EQU   *
         MVC   88(4,13),=F'84'
         ST    7,92(13)
         MVC   96(4,13),4(5)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    2,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         MVC   88(4,13),=F'84'
         ST    7,92(13)
         MVC   96(4,13),8(5)
         ST    15,100(13)
         B     @@PGE28
         DS    0F
         LTORG
         DS    0F
@@PGE28  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG29   EQU   *
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@72)
         BALR  14,15
         LR    8,15
         LH    2,0(15)
         LR    3,15
         CLM   2,3,=H'84'
         BNE   @@L1471
         L     14,=A(@@L1496)
         BR    14
@@L1553  EQU   *
         L     12,4(,10)
         MVC   88(4,13),4(5)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L1495
         MVC   88(4,13),8(5)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1494)
         BER   14
@@L1495  EQU   *
         L     12,4(,10)
         MVC   88(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1494)
         BNER  14
         MVC   88(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LR    3,6
         LTR   15,15
         BE    @@L1471
         L     14,=A(@@L1494)
         BR    14
@@L1552  EQU   *
         L     12,4(,10)
         LR    2,7
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         L     14,=A(@@L1493)
         BHR   14
         ST    5,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     2,4(6)
         X     2,=F'-1'
         NR    2,15
         LR    3,6
         LTR   2,2
         L     14,=A(@@L1493)
         BNER  14
@@L1471  EQU   *
         L     12,4(,10)
         LR    15,3
* Function simplify_logical epilogue
         PDPEPIL
* Function simplify_logical literal pool
         DS    0F
         LTORG
* Function simplify_logical page table
         DS    0F
@@PGT28  EQU   *
         DC    A(@@PG28)
         DC    A(@@PG29)
         DS    0F
* S-func expand_compound_operation prologue
@@74     PDPPRLG CINDEX=30,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN30
         LTORG
@@FEN30  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG30   EQU   *
         LR    11,1
         L     10,=A(@@PGT30)
* Function expand_compound_operation code
         L     5,0(11)
@@L1577  EQU   *
         SLR   8,8
         LR    9,8
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         LA    3,121(0,0)
         CLR   2,3
         L     14,=A(@@L1561)
         BER   14
         BH    @@L1575
         LA    6,120(0,0)
         CLR   2,6
         BNE   @@L1587
@@L1562  EQU   *
         L     12,0(,10)
         L     3,4(5)
         LH    2,0(3)
         LR    15,5
         CLM   2,3,=H'54'
         L     14,=A(@@L1559)
         BER   14
         SLR   2,2
         IC    2,2(3)
         LR    3,2
         L     2,=V(MODE@SIZ)
         IC    2,0(2,3)
         LR    15,5
         CLM   2,1,=XL1'04'
         L     14,=A(@@L1559)
         BHR   14
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    7,0(3,2)
         N     7,=XL4'0000FFFF'
         LR    15,5
         LTR   7,7
         L     14,=A(@@L1559)
         BER   14
@@L1560  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'120'
         BNE   @@L1576
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L1576
         MVC   88(4,13),4(5)
         L     2,4(5)
         SLR   6,6
         IC    6,2(2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     2,4(5)
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     2,0(2,3)
         SRL   2,1
         X     2,=F'-1'
         NR    2,15
         LTR   2,2
         BNE   @@L1576
         MVC   88(4,13),=F'121'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         MVC   96(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    5,15
         B     @@L1577
@@L1576  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'121'
         BE    @@L1593
@@L1578  EQU   *
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    3,0(2,3)
         N     3,=XL4'0000FFFF'
         LR    2,3
         AR    2,7
         CLR   2,8
         BNL   @@L1594
         LTR   9,9
         BE    @@L1587
         LA    2,31(0,0)
         CLR   7,2
         BNH   @@L1595
@@L1587  EQU   *
         LR    15,5
         B     @@L1559
@@L1595  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'90'
         SLR   2,2
         IC    2,2(5)
         ST    2,96(13)
         MVC   100(4,13),4(5)
         ST    8,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         MVC   88(4,13),=F'0'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         ST    15,96(13)
         LA    2,1(0,0)
         SLL   2,0(7)
         BCTR  2,0
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
@@L1590  EQU   *
         LR    3,15
         LH    2,0(15)
         LR    15,5
         CLM   2,3,=H'49'
         BE    @@L1559
         LR    15,3
         B     @@L1559
@@L1594  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'87'
         SLR   2,2
         IC    2,2(5)
         ST    2,96(13)
         MVC   100(4,13),4(5)
         LR    2,3
         SR    2,8
         SR    2,7
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         MVC   88(4,13),=F'0'
         X     9,=F'1'
         LA    2,90(0,0)
         SR    2,9
         ST    2,92(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,96(13)
         ST    15,100(13)
         SR    3,7
         ST    3,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         B     @@L1590
@@L1593  EQU   *
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'122'
         BE    @@L1596
@@L1579  EQU   *
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L1597
@@L1580  EQU   *
         L     6,4(5)
         LH    2,0(6)
         CLM   2,3,=H'122'
         BE    @@L1598
@@L1581  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'63'
         BNE   @@L1578
         L     2,4(6)
         CLC   2(1,2),2(5)
         BNE   @@L1578
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1578
         L     4,4(5)
         L     15,4(4)
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L1578
         SLR   6,6
         IC    6,2(4)
         LR    4,6
         LR    2,6
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L1578
         MH    4,=H'4'
         L     2,=V(MODE@MAS)
         L     2,0(4,2)
         X     2,=F'-1'
         N     2,=F'1'
         LTR   2,2
         BE    @@L1559
         B     @@L1578
@@L1598  EQU   *
         L     15,4(6)
         CLC   2(1,15),2(5)
         BNE   @@L1581
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L1581
         SLR   4,4
         IC    4,2(6)
         LR    2,4
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L1581
         MH    4,=H'4'
         L     2,=V(MODE@MAS)
         L     2,0(4,2)
         X     2,=F'-1'
         N     2,=F'1'
         LTR   2,2
         BE    @@L1559
         B     @@L1581
@@L1597  EQU   *
         L     2,4(3)
         CLC   2(1,2),2(5)
         BNE   @@L1580
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1580
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L1580
         L     2,4(5)
         MVC   88(4,13),4(2)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     4,4(5)
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     2,0(2,3)
         X     2,=F'-1'
         NR    2,15
         LTR   2,2
         BNE   @@L1580
@@L1591  EQU   *
         L     15,4(4)
         B     @@L1559
@@L1596  EQU   *
         L     4,4(3)
         CLC   2(1,4),2(5)
         BNE   @@L1579
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L1579
         ST    4,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     4,4(5)
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     2,0(2,3)
         X     2,=F'-1'
         NR    2,15
         LTR   2,2
         BE    @@L1591
         B     @@L1579
@@L1575  EQU   *
         LA    3,132(0,0)
         CLR   2,3
         BE    @@L1567
         LA    9,1(0,0)
         LA    6,133(0,0)
         CLR   2,6
         BNE   @@L1587
@@L1567  EQU   *
         L     3,4(5)
         LH    2,0(3)
         LR    15,3
         CLM   2,3,=H'49'
         BE    @@L1559
         L     6,8(5)
         LH    2,0(6)
         CLM   2,3,=H'54'
         BNE   @@L1587
         L     4,12(5)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BNE   @@L1587
         IC    2,2(3)
         CLM   2,1,=XL1'00'
         BE    @@L1587
         L     7,4(6)
         L     8,4(4)
         LR    2,7
         AR    2,8
         L     4,=V(MODE@BIT)
         SLR   6,6
         IC    6,2(3)
         LR    3,6
         MH    3,=H'2'
         LH    3,0(3,4)
         N     3,=XL4'0000FFFF'
         CLR   2,3
         BH    @@L1600
@@L1571  EQU   *
         L     2,4(5)
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         MH    2,=H'2'
         LH    2,0(2,4)
         N     2,=XL4'0000FFFF'
         SR    2,7
         SR    2,8
         LR    8,2
         B     @@L1560
@@L1600  EQU   *
         MVC   88(4,13),=F'48'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         MVC   96(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         A     5,=F'4'
         ST    5,88(13)
         A     5,=F'-4'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L1571
@@L1561  EQU   *
         LA    9,1(0,0)
         B     @@L1562
@@L1559  EQU   *
* Function expand_compound_operation epilogue
         PDPEPIL
* Function expand_compound_operation literal pool
         DS    0F
         LTORG
* Function expand_compound_operation page table
         DS    0F
@@PGT30  EQU   *
         DC    A(@@PG30)
         DS    0F
* S-func expand_field_assignment prologue
@@42     PDPPRLG CINDEX=31,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN31
         LTORG
@@FEN31  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG31   EQU   *
         LR    11,1
         L     10,=A(@@PGT31)
* Function expand_field_assignment code
         L     9,0(11)
@@L1629  EQU   *
         L     15,4(9)
         LH    2,0(15)
         CLM   2,3,=H'64'
         BE    @@L1633
@@L1605  EQU   *
         LH    2,0(15)
         CLM   2,3,=H'133'
         BNE   @@L1607
         L     3,8(15)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L1634
@@L1607  EQU   *
         LH    2,0(15)
         CLM   2,3,=H'63'
         BNE   @@L1603
         L     2,=A(@@23)
         L     2,0(2)
         LTR   2,2
         BE    @@L1603
         L     4,=V(MODE@SIZ)
         SLR   2,2
         IC    2,2(15)
         SLR   3,3
         IC    3,0(4,2)
         A     3,=F'3'
         SRA   3,2
         L     2,4(15)
         SLR   15,15
         IC    15,2(2)
         SLR   2,2
         IC    2,0(4,15)
         A     2,=F'3'
         SRA   2,2
         CLR   3,2
         BNE   @@L1603
         ST    15,88(13)
         MVC   92(4,13),8(9)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,4(9)
         MVC   96(4,13),4(2)
@@L1630  EQU   *
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    9,15
         B     @@L1629
@@L1634  EQU   *
         L     6,4(15)
         L     8,4(3)
         L     7,12(15)
         LH    2,0(7)
         CLM   2,3,=H'54'
         BE    @@L1635
@@L1608  EQU   *
         LH    2,0(7)
         CLM   2,3,=H'54'
         BE    @@L1636
         CLM   2,3,=H'76'
         BE    @@L1637
@@L1612  EQU   *
         MVC   88(4,13),=F'0'
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         SR    2,8
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'76'
         SLR   2,2
         IC    2,2(7)
         ST    2,92(13)
         ST    15,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
@@L1631  EQU   *
         LR    7,15
@@L1619  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'63'
         BNE   @@L1620
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1620
         L     6,4(6)
         B     @@L1619
@@L1620  EQU   *
         SLR   5,5
         IC    5,2(6)
         LR    3,5
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L1624
         LA    3,3(0,0)
         CLR   2,3
         BE    @@L1624
         LA    3,5(0,0)
         CLR   2,3
         BE    @@L1624
         LA    3,7(0,0)
         CLR   2,3
         BE    @@L1624
         LA    3,2(0,0)
         CLR   2,3
         BE    @@L1625
         LA    3,6(0,0)
         CLR   2,3
         BE    @@L1625
         LA    3,8(0,0)
         CLR   2,3
         BNE   @@L1603
@@L1625  EQU   *
         MH    5,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(5,2)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(MODFRSIZ)
         BALR  14,15
         LA    2,51(0,0)
         CLR   15,2
         BE    @@L1603
         LR    5,15
         ST    15,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    6,15
@@L1624  EQU   *
         LA    3,31(0,0)
         CR    8,3
         BH    @@L1603
         MVC   88(4,13),=F'0'
         LA    2,1(0,0)
         SLL   2,0(8)
         BCTR  2,0
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    3,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'87'
         ST    5,92(13)
         ST    3,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'86'
         ST    5,92(13)
         ST    15,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    5,92(13)
         ST    15,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         MVC   92(4,13),8(9)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    5,92(13)
         ST    15,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'87'
         ST    5,92(13)
         ST    15,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'84'
         ST    5,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         B     @@L1630
@@L1637  EQU   *
         L     4,8(7)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BNE   @@L1612
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         SR    2,8
         CL    2,4(4)
         BNE   @@L1612
         L     7,4(7)
         B     @@L1619
@@L1636  EQU   *
         MVC   88(4,13),=F'0'
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         SR    2,8
         S     2,4(7)
         ST    2,92(13)
@@L1632  EQU   *
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         B     @@L1631
@@L1635  EQU   *
         L     4,4(7)
         AR    4,8
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CR    4,2
         BNH   @@L1608
         MVC   88(4,13),=F'48'
         L     2,4(9)
         SLR   3,3
         IC    3,2(2)
         ST    3,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    6,15
         B     @@L1608
@@L1633  EQU   *
         L     4,4(15)
         LH    2,0(4)
         CLM   2,3,=H'63'
         BNE   @@L1605
         L     6,4(4)
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    8,0(2,3)
         N     8,=XL4'0000FFFF'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SUBREG@L)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         B     @@L1632
@@L1603  EQU   *
         LR    15,9
* Function expand_field_assignment epilogue
         PDPEPIL
* Function expand_field_assignment literal pool
         DS    0F
         LTORG
* Function expand_field_assignment page table
         DS    0F
@@PGT31  EQU   *
         DC    A(@@PG31)
         DS    0F
* S-func make_extraction prologue
@@67     PDPPRLG CINDEX=32,FRAME=152,BASER=12,ENTRY=NO
         B     @@FEN32
         LTORG
@@FEN32  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG32   EQU   *
         LR    11,1
         L     10,=A(@@PGT32)
* Function make_extraction code
         SLR   2,2
         SLR   3,3
         ST    2,144(13)
         ST    3,4+144(13)
         L     7,4(11)
         L     8,8(11)
         L     5,12(11)
         SLR   3,3
         IC    3,2(7)
         ST    3,112(13)
         L     2,=V(BYTE@MOD)
         L     9,0(2)
         L     2,=V(WORD@MOD)
         MVC   124(4,13),0(2)
         MVC   120(4,13),124(13)
         MVC   128(4,13),124(13)
         MVC   88(4,13),16(11)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(MODFRSIZ)
         BALR  14,15
         LR    6,15
         MVC   132(4,13),=F'0'
         ST    5,136(13)
         LH    2,0(7)
         CLM   2,3,=H'48'
         L     14,=A(@@L1725)
         BER   14
         CLM   2,3,=H'63'
         L     14,=A(@@L1726)
         BER   14
@@L1640  EQU   *
         L     12,0(,10)
         SLR   15,15
         IC    15,2(7)
         ST    15,116(13)
         LTR   5,5
         BE    @@L1643
         LH    2,0(5)
         CLM   2,3,=H'54'
         L     14,=A(@@L1727)
         BER   14
@@L1643  EQU   *
         L     12,0(,10)
         LA    2,51(0,0)
         CLR   6,2
         BE    @@L1644
         L     3,132(13)
         LTR   3,3
         L     14,=A(@@L1645)
         BER   14
         L     4,116(13)
         CLR   4,6
         L     14,=A(@@L1645)
         BER   14
@@L1644  EQU   *
         L     12,0(,10)
         LTR   5,5
         L     14,=A(@@L1728)
         BER   14
@@L1676  EQU   *
         L     12,0(,10)
         L     3,132(13)
         LTR   3,3
         BNE   @@L1677
         LH    2,0(7)
         CLM   2,3,=H'66'
         L     14,=A(@@L1729)
         BER   14
@@L1677  EQU   *
         L     12,0(,10)
         L     15,24(11)
         LTR   15,15
         L     14,=A(@@L1730)
         BNER  14
@@L1680  EQU   *
         L     12,0(,10)
         L     3,24(11)
         LTR   3,3
         BNE   @@L1681
         L     4,20(11)
         LTR   4,4
         L     14,=A(@@L1731)
         BNER  14
@@L1681  EQU   *
         L     12,0(,10)
         L     15,24(11)
         LTR   15,15
         BNE   @@L1682
         L     2,20(11)
         LTR   2,2
         L     14,=A(@@L1732)
         BER   14
@@L1682  EQU   *
         L     12,0(,10)
         L     4,0(11)
         LTR   4,4
         BE    @@L1683
         L     3,=V(MODE@SIZ)
         L     6,128(13)
         IC    2,0(3,6)
         IC    3,0(3,4)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BNL   @@L1683
         ST    4,128(13)
@@L1683  EQU   *
         LTR   5,5
         BE    @@L1684
         IC    2,2(5)
         CLM   2,1,=XL1'00'
         BE    @@L1684
         L     3,=V(MODE@SIZ)
         SLR   4,4
         IC    4,2(5)
         L     15,124(13)
         IC    2,0(3,15)
         IC    3,0(3,4)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BNL   @@L1684
         ST    4,124(13)
@@L1684  EQU   *
         LH    2,0(7)
         CLM   2,3,=H'66'
         L     14,=A(@@L1685)
         BER   14
         L     9,120(13)
@@L1686  EQU   *
         L     12,0(,10)
         LR    6,8
         LH    2,0(7)
         LR    3,9
         CLM   2,3,=H'66'
         L     14,=A(@@L1733)
         BER   14
@@L1720  EQU   *
         L     12,0(,10)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         LTR   5,5
         BE    @@L1734
         MVC   88(4,13),=F'0'
         S     2,16(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'76'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         ST    15,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    5,15
@@L1689  EQU   *
         LTR   9,9
         BE    @@L1694
         L     4,=V(MODE@SIZ)
         IC    2,0(4,9)
         L     15,112(13)
         IC    3,0(4,15)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BNL   @@L1694
         LH    2,0(7)
         CLM   2,3,=H'66'
         BE    @@L1735
@@L1694  EQU   *
         LH    2,0(7)
         CLM   2,3,=H'66'
         BE    @@L1702
         SLR   2,2
         IC    2,2(7)
         CLR   2,9
         BE    @@L1704
         LTR   5,5
         BE    @@L1736
@@L1705  EQU   *
         L     12,0(,10)
         SLR   3,3
         L     14,=A(@@L1638)
         BR    14
@@L1736  EQU   *
         L     4,16(11)
         AR    4,6
         LR    3,9
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         CLR   4,2
         BH    @@L1705
@@L1704  EQU   *
         ST    7,88(13)
         ST    9,92(13)
         LTR   5,5
         BE    @@L1737
@@L1706  EQU   *
         L     2,=F'-1'
@@L1707  EQU   *
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
@@L1721  EQU   *
         LR    7,15
@@L1702  EQU   *
         LTR   5,5
         BE    @@L1708
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,2(5)
         L     6,124(13)
         IC    3,0(2,6)
         IC    2,0(2,4)
         STC   2,80(,13)
         CLM   3,1,80(13)
         BH    @@L1738
@@L1708  EQU   *
         LTR   5,5
         BE    @@L1711
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,2(5)
         L     15,124(13)
         IC    3,0(2,15)
         IC    2,0(2,4)
         STC   2,80(,13)
         CLM   3,1,80(13)
         BL    @@L1739
@@L1711  EQU   *
         LTR   5,5
         BE    @@L1740
@@L1713  EQU   *
         LTR   5,5
         BE    @@L1741
@@L1714  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),16(11)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         L     4,20(11)
         LPR   3,4
         BCTR  3,0
         SRL   3,31
         LA    2,133(0,0)
         SR    2,3
         ST    2,88(13)
         MVC   92(4,13),128(13)
         ST    7,96(13)
         ST    15,100(13)
         ST    5,104(13)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         LR    4,15
         L     5,24(11)
         LTR   5,5
         BE    @@L1742
@@L1718  EQU   *
         L     12,0(,10)
         LR    3,4
         L     14,=A(@@L1638)
         BR    14
@@L1742  EQU   *
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    4,15
         B     @@L1718
@@L1741  EQU   *
         ST    5,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    5,15
         B     @@L1714
@@L1740  EQU   *
         L     2,136(13)
         LTR   2,2
         BE    @@L1713
         LR    3,2
         L     2,4(2)
         CLR   2,8
         BNE   @@L1713
         LR    5,3
         B     @@L1714
@@L1739  EQU   *
         ST    15,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    5,15
         B     @@L1711
@@L1738  EQU   *
         MVC   88(4,13),=F'121'
         ST    6,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    4,15
         L     2,=V(FLAG@EXP)
         L     2,0(2)
         LTR   2,2
         BE    @@L1709
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BNH   @@L1743
@@L1709  EQU   *
         LR    5,4
         B     @@L1711
@@L1743  EQU   *
         ST    5,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         SLR   3,3
         IC    3,2(5)
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     2,0(3,2)
         SRL   2,1
         X     2,=F'-1'
         NR    2,15
         LTR   2,2
         BNE   @@L1709
         MVC   88(4,13),=F'120'
         MVC   92(4,13),124(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         LR    2,15
         ST    4,88(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         CR    2,15
         BNL   @@L1709
         LR    4,3
         B     @@L1709
@@L1737  EQU   *
         L     2,16(11)
         AR    2,6
         LA    4,31(0,0)
         CLR   2,4
         BH    @@L1706
         LA    2,1(0,0)
         L     15,16(11)
         SLL   2,0(15)
         BCTR  2,0
         SLL   2,0(6)
         B     @@L1707
@@L1735  EQU   *
         L     2,116(13)
         CLR   2,9
         BE    @@L1695
         MVC   88(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(MODE@DEP)
         BALR  14,15
         LTR   15,15
         BNE   @@L1694
         L     2,0(7)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1694
@@L1695  EQU   *
         SLR   6,6
         L     15,132(13)
         LTR   15,15
         BNE   @@L1696
         L     2,116(13)
         IC    4,0(4,2)
         STC   3,80(,13)
         CLM   4,1,80(13)
         BNL   @@L1696
         LR    2,3
         N     2,=XL4'000000FF'
         LR    6,4
         N     6,=XL4'000000FF'
         SR    6,2
@@L1696  EQU   *
         LTR   5,5
         BE    @@L1744
@@L1699  EQU   *
         LTR   6,6
         BNE   @@L1701
         L     3,116(13)
         CLR   3,9
         BE    @@L1702
@@L1701  EQU   *
         ST    7,88(13)
         ST    9,92(13)
         ST    6,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ADJADD)
         BALR  14,15
         B     @@L1721
@@L1744  EQU   *
         LR    2,8
         LTR   8,8
         BL    @@L1745
@@L1698  EQU   *
         SRA   2,3
         AR    6,2
         LR    2,9
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    4,0(2,3)
         N     4,=XL4'0000FFFF'
         ST    8,144(13)
         L     2,144(13)
         L     3,4+144(13)
         SRDA  2,32
         DR    2,4
         LR    8,2
         B     @@L1699
@@L1745  EQU   *
         A     2,=F'7'
         B     @@L1698
@@L1734  EQU   *
         S     2,16(11)
         SR    2,8
         LR    8,2
         B     @@L1689
@@L1733  EQU   *
         L     3,112(13)
         B     @@L1720
@@L1685  EQU   *
         L     2,116(13)
         CLR   2,9
         BE    @@L1686
         MVC   88(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(MODE@DEP)
         BALR  14,15
         LTR   15,15
         BNE   @@L1688
         L     2,0(7)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BE    @@L1686
@@L1688  EQU   *
         L     9,128(13)
         B     @@L1686
@@L1732  EQU   *
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         LA    3,53(0,0)
         CLR   15,3
         BE    @@L1682
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         ST    15,120(13)
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         ST    15,124(13)
         MVC   88(4,13),=F'1'
         MVC   92(4,13),24(11)
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         ST    15,128(13)
         B     @@L1682
@@L1731  EQU   *
         MVC   88(4,13),=F'2'
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         LA    6,53(0,0)
         CLR   15,6
         BE    @@L1681
         MVC   88(4,13),=F'2'
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         ST    15,120(13)
         MVC   88(4,13),=F'2'
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         ST    15,124(13)
         MVC   88(4,13),=F'2'
         MVC   92(4,13),24(11)
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         ST    15,128(13)
         B     @@L1681
@@L1730  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         LA    2,53(0,0)
         CLR   15,2
         BE    @@L1680
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         ST    15,120(13)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         ST    15,124(13)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         ST    15,128(13)
         B     @@L1680
@@L1729  EQU   *
         LTR   5,5
         BE    @@L1746
@@L1679  EQU   *
         LTR   5,5
         BE    @@L1677
         L     4,16(11)
         LA    6,1(0,0)
         CLR   4,6
         BNE   @@L1705
         B     @@L1677
@@L1746  EQU   *
         L     4,16(11)
         AR    4,8
         L     3,112(13)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         CLR   4,2
         BH    @@L1705
         B     @@L1679
@@L1728  EQU   *
         LTR   8,8
         BNE   @@L1676
         L     6,24(11)
         LTR   6,6
         BNE   @@L1676
         L     2,28(11)
         LTR   2,2
         BNE   @@L1676
         L     15,132(13)
         LTR   15,15
         BNE   @@L1676
         LR    3,6
         L     2,20(11)
         LTR   2,2
         L     14,=A(@@L1638)
         BNER  14
         B     @@L1676
@@L1645  EQU   *
         LTR   5,5
         L     14,=A(@@L1747)
         BER   14
@@L1647  EQU   *
         L     12,0(,10)
         LH    2,0(7)
         CLM   2,3,=H'66'
         BNE   @@L1644
         LTR   5,5
         BNE   @@L1644
         LR    2,8
         N     2,=F'7'
         LTR   2,2
         BNE   @@L1644
         L     4,=V(MODE@BIT)
         L     2,116(13)
         MH    2,=H'2'
         LR    3,6
         MH    3,=H'2'
         LH    2,0(2,4)
         LH    3,0(3,4)
         STH   3,80(,13)
         CLM   2,3,80(13)
         BL    @@L1644
         L     2,116(13)
         CLR   2,6
         BE    @@L1646
         MVC   88(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(MODE@DEP)
         BALR  14,15
         LTR   15,15
         BNE   @@L1644
         L     2,0(7)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1644
@@L1646  EQU   *
         L     12,0(,10)
         LH    2,0(7)
         CLM   2,3,=H'66'
         L     14,=A(@@L1748)
         BER   14
         CLM   2,3,=H'61'
         L     14,=A(@@L1749)
         BER   14
         ST    7,88(13)
         ST    6,92(13)
         L     4,16(11)
         LA    5,31(0,0)
         CLR   4,5
         L     14,=A(@@L1663)
         BHR   14
         LA    2,1(0,0)
         SLL   2,0(4)
         BCTR  2,0
@@L1664  EQU   *
         L     12,0(,10)
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
@@L1719  EQU   *
         L     12,0(,10)
         LR    4,15
@@L1652  EQU   *
         L     12,0(,10)
         L     15,24(11)
         LTR   15,15
         BE    @@L1665
         LH    2,0(4)
         LR    3,4
         CLM   2,3,=H'66'
         L     14,=A(@@L1638)
         BER   14
         CLM   2,3,=H'63'
         BE    @@L1668
         MVC   88(4,13),=F'49'
         ST    6,92(13)
         L     2,=V(CIRTX)
         MVC   96(4,13),256(2)
@@L1722  EQU   *
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
@@L1723  EQU   *
         L     12,0(,10)
         LR    3,15
         L     14,=A(@@L1638)
         BR    14
@@L1668  EQU   *
         MVC   88(4,13),=F'64'
         MVC   92(4,13),=F'0'
@@L1724  EQU   *
         ST    4,96(13)
         B     @@L1722
@@L1665  EQU   *
         LR    3,4
         L     2,0(11)
         CLR   2,6
         L     14,=A(@@L1638)
         BER   14
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L1750
         L     2,=V(FLAG@EXP)
         L     2,0(2)
         LTR   2,2
         BE    @@L1672
         LR    2,6
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BNH   @@L1751
@@L1672  EQU   *
         L     5,20(11)
         LPR   3,5
         BCTR  3,0
         SRL   3,31
         LA    2,121(0,0)
         SR    2,3
         ST    2,88(13)
         MVC   92(4,13),0(11)
         B     @@L1724
@@L1751  EQU   *
         ST    4,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         MH    6,=H'4'
         L     2,=V(MODE@MAS)
         L     2,0(6,2)
         SRL   2,1
         X     2,=F'-1'
         NR    2,15
         LTR   2,2
         BNE   @@L1672
         MVC   88(4,13),=F'121'
         MVC   92(4,13),0(11)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'120'
         MVC   92(4,13),0(11)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    4,15
         ST    3,88(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         LR    2,15
         ST    4,88(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         CR    2,15
         L     14,=A(@@L1638)
         BNHR  14
         B     @@L1718
@@L1750  EQU   *
         MVC   88(4,13),4(4)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         MVC   88(4,13),24(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         B     @@L1723
@@L1663  EQU   *
         L     2,=F'-1'
         B     @@L1664
@@L1749  EQU   *
         C     6,116(13)
         L     14,=A(@@L1654)
         BER   14
         LR    2,8
         LTR   8,8
         L     14,=A(@@L1752)
         BLR   14
@@L1655  EQU   *
         L     12,0(,10)
         LR    4,2
         SRA   4,5
         L     5,=V(MODE@SIZ)
         L     15,116(13)
         IC    2,0(5,15)
         CLM   2,1,=XL1'04'
         BNH   @@L1656
         LR    3,2
         N     3,=XL4'000000FF'
         SLR   2,2
         IC    2,0(5,6)
         SR    3,2
         BL    @@L1753
@@L1657  EQU   *
         SRA   3,2
         SR    3,4
         LR    4,3
@@L1656  EQU   *
         MH    4,=H'4'
         L     2,=V(MODE@SIZ)
         L     5,116(13)
         IC    3,0(2,5)
         IC    2,0(2,6)
         STC   2,80(,13)
         CLM   3,1,80(13)
         BNH   @@L1658
         N     3,=XL4'000000FF'
         N     2,=XL4'000000FF'
         SR    3,2
         LR    2,3
         BL    @@L1754
@@L1659  EQU   *
         N     2,=F'-4'
         SR    3,2
         AR    4,3
@@L1658  EQU   *
         L     2,=V(MODE@SIZ)
         L     15,116(13)
         SLR   3,3
         IC    3,0(2,15)
         LR    2,3
         SLR   3,3
         CR    4,2
         L     14,=A(@@L1638)
         BNLR  14
         ST    6,88(13)
         ST    7,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         B     @@L1719
@@L1754  EQU   *
         A     2,=F'3'
         B     @@L1659
@@L1753  EQU   *
         A     3,=F'3'
         B     @@L1657
@@L1752  EQU   *
         A     2,=F'31'
         B     @@L1655
@@L1654  EQU   *
         LR    4,7
         B     @@L1652
@@L1748  EQU   *
         L     3,112(13)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         S     2,16(11)
         SR    2,8
         SRL   2,3
         ST    7,88(13)
         ST    6,92(13)
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ADJADD)
         BALR  14,15
         B     @@L1719
@@L1747  EQU   *
         LR    2,8
         N     2,=F'31'
         LTR   2,2
         BNE   @@L1647
         LH    2,0(7)
         CLM   2,3,=H'66'
         BE    @@L1647
         L     15,24(11)
         LTR   15,15
         BE    @@L1646
         CLM   2,3,=H'61'
         BNE   @@L1647
         MVC   88(4,13),=F'64'
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         BNE   @@L1646
         B     @@L1647
@@L1727  EQU   *
         L     8,4(5)
         SLR   5,5
         B     @@L1643
@@L1726  EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1640
         L     15,4(7)
         LH    2,0(15)
         CLM   2,3,=H'66'
         BE    @@L1755
@@L1642  EQU   *
         LR    7,15
         B     @@L1640
@@L1755  EQU   *
         SLR   4,4
         IC    4,2(15)
         ST    4,112(13)
         B     @@L1642
@@L1725  EQU   *
         MVC   132(4,13),=F'1'
         L     7,4(7)
         B     @@L1640
@@L1638  EQU   *
         LR    15,3
* Function make_extraction epilogue
         PDPEPIL
* Function make_extraction literal pool
         DS    0F
         LTORG
* Function make_extraction page table
         DS    0F
@@PGT32  EQU   *
         DC    A(@@PG32)
         DS    0F
* S-func extract_left_shift prologue
@@85     PDPPRLG CINDEX=33,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN33
         LTORG
@@FEN33  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG33   EQU   *
         LR    11,1
         L     10,=A(@@PGT33)
* Function extract_left_shift code
         L     4,0(11)
         L     7,4(11)
         L     2,0(4)
         LR    6,2
         SRL   6,16
         LR    5,2
         SRL   5,8
         N     5,=F'255'
         LR    3,6
         A     3,=F'-75'
         LA    2,12(0,0)
         CLR   3,2
         BH    @@L1757
         MH    3,=H'4'
         L     2,=A(@@L1770)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1770  EQU   *
         DC    A(@@L1767)
         DC    A(@@L1757)
         DC    A(@@L1761)
         DC    A(@@L1757)
         DC    A(@@L1757)
         DC    A(@@L1757)
         DC    A(@@L1757)
         DC    A(@@L1757)
         DC    A(@@L1767)
         DC    A(@@L1767)
         DC    A(@@L1767)
         DC    A(@@L1761)
         DC    A(@@L1758)
@@L1758  EQU   *
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L1771
@@L1757  EQU   *
         SLR   15,15
         B     @@L1756
@@L1771  EQU   *
         L     2,4(3)
         CR    2,7
         BL    @@L1757
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'87'
         ST    5,96(13)
         MVC   100(4,13),4(4)
         L     2,4(3)
         SR    2,7
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         B     @@L1756
@@L1767  EQU   *
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1757
         LA    2,1(0,0)
         SLL   2,0(7)
         BCTR  2,0
         N     2,4(3)
         LTR   2,2
         BNE   @@L1757
         MVC   88(4,13),4(4)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@85)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L1757
         ST    2,88(13)
         L     2,8(4)
         L     2,4(2)
         SRA   2,0(7)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    6,88(13)
         ST    5,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         B     @@L1756
@@L1761  EQU   *
         MVC   88(4,13),4(4)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@85)
         BALR  14,15
         LTR   15,15
         BE    @@L1757
         ST    6,88(13)
         ST    5,92(13)
         ST    15,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
@@L1756  EQU   *
* Function extract_left_shift epilogue
         PDPEPIL
* Function extract_left_shift literal pool
         DS    0F
         LTORG
* Function extract_left_shift page table
         DS    0F
@@PGT33  EQU   *
         DC    A(@@PG33)
         DS    0F
* S-func make_compound_operation prologue
@@73     PDPPRLG CINDEX=34,FRAME=136,BASER=12,ENTRY=NO
         B     @@FEN34
         LTORG
@@FEN34  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG34   EQU   *
         LR    11,1
         L     10,=A(@@PGT34)
* Function make_compound_operation code
         L     6,0(11)
         L     8,4(11)
         L     2,0(6)
         LR    3,2
         SRL   3,16
         ST    3,120(13)
         LR    7,2
         SRL   7,8
         N     7,=F'255'
         LR    5,7
         MH    5,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(5,2)
         N     2,=XL4'0000FFFF'
         ST    2,124(13)
         SLR   9,9
         LA    4,66(0,0)
         CLR   3,4
         L     14,=A(@@L1773)
         BER   14
         LA    2,75(0,0)
         CLR   3,2
         L     14,=A(@@L1773)
         BER   14
         LA    4,76(0,0)
         CLR   3,4
         L     14,=A(@@L1773)
         BER   14
         LA    2,74(0,0)
         CLR   3,2
         L     14,=A(@@L1778)
         BER   14
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'4C'
         L     14,=A(@@L1778)
         BER   14
@@L1777  EQU   *
         L     12,0(,10)
         ST    8,128(13)
         LA    3,74(0,0)
         CLR   8,3
         L     14,=A(@@L1843)
         BER   14
@@L1774  EQU   *
         L     12,0(,10)
         L     3,120(13)
         A     3,=F'-63'
         LA    4,27(0,0)
         CLR   3,4
         BH    @@L1781
         MH    3,=H'4'
         L     2,=A(@@L1823)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1823  EQU   *
         DC    A(@@L1815)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1785)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1781)
         DC    A(@@L1782)
         DC    A(@@L1781)
         DC    A(@@L1807)
         DC    A(@@L1805)
@@L1782  EQU   *
         LA    2,66(0,0)
         CLR   8,2
         BE    @@L1844
@@L1781  EQU   *
         L     12,0(,10)
         LTR   9,9
         BE    @@L1824
         ST    7,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    6,15
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         ST    2,120(13)
@@L1824  EQU   *
         L     3,120(13)
         MH    3,=H'4'
         L     2,=V(RTX@FORM)
         L     5,0(3,2)
         SLR   4,4
         L     2,=V(RTX@LENG)
         L     3,120(13)
         SLR   7,7
         IC    7,0(2,3)
         CR    4,7
         BNL   @@L1832
         LR    3,6
@@L1830  EQU   *
         IC    2,0(4,5)
         CLM   2,1,=XL1'85'
         BE    @@L1845
@@L1827  EQU   *
         A     3,=F'4'
         A     4,=F'1'
         L     2,=V(RTX@LENG)
         L     8,120(13)
         SLR   7,7
         IC    7,0(2,8)
         CR    4,7
         BL    @@L1830
@@L1832  EQU   *
         LR    15,6
         L     14,=A(@@L1772)
         BR    14
@@L1845  EQU   *
         MVC   88(4,13),4(3)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         A     3,=F'4'
         ST    3,88(13)
         A     3,=F'-4'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L1827
@@L1844  EQU   *
         L     3,8(6)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L1781
         L     2,4(3)
         LA    3,31(0,0)
         CR    2,3
         BH    @@L1781
         LTR   2,2
         BL    @@L1781
         MVC   88(4,13),4(6)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LR    9,15
         MVC   88(4,13),=F'0'
         L     2,8(6)
         LA    3,1(0,0)
         L     2,4(2)
         SLL   3,0(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         ST    9,96(13)
         ST    15,100(13)
@@L1836  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
@@L1835  EQU   *
         L     12,0(,10)
         LR    9,15
         B     @@L1781
@@L1815  EQU   *
         MVC   88(4,13),4(6)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LR    5,15
         L     3,4(6)
         LH    2,0(15)
         MVC   80(2,13),0(3)
         CLM   2,3,80(13)
         BE    @@L1816
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,2(15)
         IC    3,0(2,7)
         IC    2,0(2,4)
         STC   2,80(,13)
         CLM   3,1,80(13)
         BL    @@L1846
@@L1816  EQU   *
         LH    2,0(5)
         AH    2,=H'-120'
         CLM   2,3,=H'1'
         BH    @@L1781
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1781
         L     6,=V(MODE@SIZ)
         L     3,0(5)
         SLR   2,2
         IC    2,2(5)
         IC    4,0(6,7)
         IC    2,0(6,2)
         STC   2,80(,13)
         CLM   4,1,80(13)
         BH    @@L1820
         L     2,4(5)
         SLR   8,8
         IC    8,2(2)
         IC    6,0(6,8)
         STC   6,80(,13)
         CLM   4,1,80(13)
         BNH   @@L1819
@@L1820  EQU   *
         SRL   3,16
         ST    3,88(13)
         ST    7,92(13)
         MVC   96(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         L     14,=A(@@L1772)
         BR    14
@@L1819  EQU   *
         ST    7,88(13)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         L     14,=A(@@L1772)
         BR    14
@@L1846  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1816
         ST    5,88(13)
         ST    7,92(13)
         MVC   96(4,13),=F'-1'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'63'
         L     14,=A(@@L1772)
         BER   14
         ST    15,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         L     14,=A(@@L1772)
         BR    14
@@L1785  EQU   *
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1781
         L     2,4(6)
         LH    2,0(2)
         CLM   2,3,=H'90'
         L     14,=A(@@L1847)
         BER   14
@@L1787  EQU   *
         L     12,0(,10)
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'63'
         L     14,=A(@@L1848)
         BER   14
@@L1790  EQU   *
         L     12,0(,10)
         L     3,4(6)
         LH    2,0(3)
         AH    2,=H'-84'
         CLM   2,3,=H'1'
         BH    @@L1793
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'90'
         BE    @@L1849
@@L1793  EQU   *
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'88'
         BE    @@L1850
@@L1795  EQU   *
         L     2,4(6)
         LH    2,0(2)
         CLM   2,3,=H'90'
         BE    @@L1851
@@L1798  EQU   *
         L     2,8(6)
         L     2,4(2)
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BL    @@L1801
         MVC   88(4,13),4(6)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
@@L1842  EQU   *
         MVC   100(4,13),=F'0'
@@L1841  EQU   *
         L     12,0(,10)
         ST    4,104(13)
         MVC   108(4,13),=F'1'
@@L1838  EQU   *
         L     12,0(,10)
         MVC   112(4,13),=F'0'
         X     8,=F'74'
         LPR   2,8
         BCTR  2,0
         SRL   2,31
@@L1834  EQU   *
         L     12,0(,10)
         ST    2,116(13)
@@L1837  EQU   *
         LA    1,88(,13)
         L     15,=A(@@67)
         BALR  14,15
         B     @@L1835
@@L1801  EQU   *
         LA    3,74(0,0)
         CLR   8,3
         BNE   @@L1781
         L     2,8(6)
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BL    @@L1781
         MVC   88(4,13),4(6)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         ST    4,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'1'
         MVC   112(4,13),=F'0'
         MVC   116(4,13),=F'1'
         B     @@L1837
@@L1851  EQU   *
         MVC   88(4,13),=F'90'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         BNE   @@L1798
         MVC   88(4,13),=F'89'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         BE    @@L1798
         L     5,4(6)
         L     3,8(5)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L1798
         L     4,4(3)
         LTR   4,4
         BL    @@L1798
         LA    2,31(0,0)
         CR    4,2
         BH    @@L1798
         L     3,124(13)
         LA    2,32(0,0)
         CR    3,2
         BH    @@L1798
         LR    3,7
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     2,0(3,2)
         SRL   2,0(4)
         L     3,8(6)
         X     2,=F'-1'
         N     2,4(3)
         LTR   2,2
         BNE   @@L1781
         MVC   88(4,13),4(5)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         MVC   88(4,13),=F'89'
         ST    7,92(13)
         ST    15,96(13)
         L     2,4(6)
         MVC   100(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         A     6,=F'4'
         ST    6,88(13)
         A     6,=F'-4'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L1781
@@L1850  EQU   *
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L1795
         L     2,8(6)
         L     2,4(2)
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BL    @@L1795
         L     3,4(6)
         L     2,8(3)
         C     15,4(2)
         BH    @@L1795
         MVC   88(4,13),4(3)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         L     2,=V(MODE@BIT)
         LH    3,0(5,2)
         N     3,=XL4'0000FFFF'
         L     2,4(6)
         L     2,8(2)
         S     3,4(2)
         ST    3,96(13)
         B     @@L1842
@@L1849  EQU   *
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'90'
         BNE   @@L1793
         L     2,8(6)
         L     2,4(2)
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L1793
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         L     2,4(6)
         MVC   96(4,13),4(2)
         MVC   100(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         L     2,4(6)
         MVC   96(4,13),8(2)
         MVC   100(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     2,4(6)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         ST    7,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         B     @@L1835
@@L1848  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1790
         L     2,4(6)
         L     2,4(2)
         LH    2,0(2)
         CLM   2,3,=H'90'
         BNE   @@L1790
         L     2,8(6)
         L     2,4(2)
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BL    @@L1790
         L     2,4(6)
         L     2,4(2)
         MVC   88(4,13),4(2)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         L     2,4(6)
         L     2,4(2)
         SLR   3,3
         IC    3,2(2)
         ST    3,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         L     2,4(6)
         L     2,4(2)
@@L1839  EQU   *
         MVC   100(4,13),8(2)
         B     @@L1841
@@L1847  EQU   *
         L     2,4(3)
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BL    @@L1787
         L     2,4(6)
         MVC   88(4,13),4(2)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         L     2,4(6)
         B     @@L1839
@@L1807  EQU   *
         L     12,0(,10)
         L     3,4(6)
         L     5,8(6)
         LH    15,0(5)
         CLM   15,3,=H'54'
         BE    @@L1852
@@L1808  EQU   *
         L     4,=V(RTX@CLAS)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BE    @@L1781
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L1853
@@L1812  EQU   *
         CH    15,=H'54'
         BNE   @@L1781
         L     2,4(5)
         LA    4,31(0,0)
         CR    2,4
         BH    @@L1781
         ST    3,88(13)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=A(@@85)
         BALR  14,15
         LR    9,15
         LTR   15,15
         BE    @@L1781
         ST    15,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         L     2,124(13)
         S     2,4(5)
         ST    2,124(13)
         ST    2,104(13)
         L     2,120(13)
         X     2,=F'90'
         BCTR  2,0
         SRL   2,0(4)
         ST    2,108(13)
         MVC   112(4,13),=F'0'
         X     8,=F'74'
         LPR   2,8
         BCTR  2,0
         SRL   2,0(4)
         B     @@L1834
@@L1853  EQU   *
         L     2,4(3)
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         IC    2,0(4,2)
         CLM   2,1,=XL1'96'
         BNE   @@L1812
         B     @@L1781
@@L1852  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'87'
         BNE   @@L1808
         L     4,8(3)
         LH    2,0(4)
         CH    2,=H'54'
         BNE   @@L1808
         L     2,4(5)
         C     2,4(4)
         BL    @@L1808
         MVC   88(4,13),4(3)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         L     2,8(3)
         L     3,4(5)
         S     3,4(2)
         ST    3,96(13)
         MVC   100(4,13),=F'0'
         L     4,124(13)
         S     4,4(5)
         ST    4,124(13)
         ST    4,104(13)
         L     2,120(13)
         X     2,=F'90'
         BCTR  2,0
         SRL   2,31
         ST    2,108(13)
         B     @@L1838
@@L1805  EQU   *
         MVC   88(4,13),=F'89'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         BE    @@L1807
         MVC   88(4,13),=F'90'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         BNE   @@L1807
         L     4,124(13)
         LA    2,32(0,0)
         CR    4,2
         BH    @@L1807
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         BCTR  4,0
         LA    2,1(0,0)
         SLL   2,0(4)
         A     4,=F'1'
         ST    4,124(13)
         NR    2,15
         LTR   2,2
         BNE   @@L1807
         MVC   88(4,13),4(6)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         MVC   88(4,13),=F'89'
         ST    7,92(13)
         ST    15,96(13)
         MVC   100(4,13),8(6)
         B     @@L1836
@@L1843  EQU   *
         MVC   128(4,13),=F'47'
         B     @@L1774
@@L1778  EQU   *
         L     3,8(6)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L1777
         MVC   128(4,13),=F'74'
         B     @@L1774
@@L1773  EQU   *
         MVC   128(4,13),=F'66'
         B     @@L1774
@@L1772  EQU   *
* Function make_compound_operation epilogue
         PDPEPIL
* Function make_compound_operation literal pool
         DS    0F
         LTORG
* Function make_compound_operation page table
         DS    0F
@@PGT34  EQU   *
         DC    A(@@PG34)
         DS    0F
* S-func get_pos_from_mask prologue
@@86     PDPPRLG CINDEX=35,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN35
         LTORG
@@FEN35  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG35   EQU   *
         LR    11,1
         L     10,=A(@@PGT35)
* Function get_pos_from_mask code
         L     3,0(11)
         LCR   2,3
         NR    2,3
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    4,15
         L     2,=F'-1'
         LTR   15,15
         BL    @@L1854
         SRL   3,0(15)
         A     3,=F'1'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         L     2,=F'-1'
         LTR   15,15
         BNH   @@L1854
         L     2,4(11)
         ST    15,0(2)
         LR    2,4
@@L1854  EQU   *
         LR    15,2
* Function get_pos_from_mask epilogue
         PDPEPIL
* Function get_pos_from_mask literal pool
         DS    0F
         LTORG
* Function get_pos_from_mask page table
         DS    0F
@@PGT35  EQU   *
         DC    A(@@PG35)
         DS    0F
* S-func force_to_mode prologue
@@75     PDPPRLG CINDEX=36,FRAME=152,BASER=12,ENTRY=NO
         B     @@FEN36
         LTORG
@@FEN36  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG36   EQU   *
         LR    11,1
         L     10,=A(@@PGT36)
* Function force_to_mode code
         L     5,0(11)
         MVC   112(4,13),4(11)
         L     8,8(11)
         MVC   116(4,13),12(11)
         L     7,16(11)
@@L1879  EQU   *
         L     12,0(,10)
         L     4,0(5)
         LR    9,4
         SRL   9,16
         MVC   120(4,13),=F'0'
         LTR   7,7
         L     14,=A(@@L1859)
         BNER  14
         LA    2,85(0,0)
         CLR   9,2
         L     14,=A(@@L1859)
         BER   14
         LA    3,86(0,0)
         CLR   9,3
         L     14,=A(@@L1859)
         BER   14
         LA    6,77(0,0)
         CLR   9,6
         L     14,=A(@@L1859)
         BER   14
@@L1858  EQU   *
         L     12,0(,10)
         LA    2,50(0,0)
         CLR   9,2
         BE    @@L1876
         LA    3,41(0,0)
         CLR   9,3
         BE    @@L1876
         LA    6,49(0,0)
         CLR   9,6
         BE    @@L1876
         L     3,=V(MODE@CLA)
         L     2,112(13)
         MH    2,=H'4'
         SRL   4,6
         N     4,=F'1020'
         L     2,0(2,3)
         CL    2,0(4,3)
         L     14,=A(@@L1968)
         BER   14
@@L1864  EQU   *
         L     12,0(,10)
         SLR   6,6
         IC    6,2(5)
@@L1863  EQU   *
         L     12,0(,10)
         LR    2,9
         A     2,=F'-89'
         LA    3,1(0,0)
         CLR   2,3
         BH    @@L1865
         L     4,=V(MODE@BIT)
         L     2,112(13)
         MH    2,=H'2'
         SLR   15,15
         IC    15,2(5)
         LR    3,15
         MH    3,=H'2'
         LH    2,0(2,4)
         LH    3,0(3,4)
         STH   3,80(,13)
         CLM   2,3,80(13)
         BNL   @@L1865
         LR    6,15
@@L1865  EQU   *
         LTR   6,6
         BE    @@L1866
         LR    3,6
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         N     8,0(3,2)
@@L1866  EQU   *
         LTR   6,6
         L     14,=A(@@L1867)
         BER   14
         LR    2,6
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'31'
         L     14,=A(@@L1868)
         BNHR  14
         LR    3,6
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     2,0(3,2)
         ST    2,124(13)
@@L1870  EQU   *
         L     12,0(,10)
         ST    5,88(13)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LTR   7,7
         BNE   @@L1871
         LR    2,15
         NR    2,8
         LTR   2,2
         L     14,=A(@@L1969)
         BER   14
@@L1871  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'54'
         L     14,=A(@@L1970)
         BER   14
         MVC   128(4,13),0(5)
         SLR   2,2
         IC    2,2(5)
         ST    2,144(13)
         L     3,=V(MODE@SIZ)
         IC    3,0(3,2)
         L     4,112(13)
         L     2,=V(MODE@SIZ)
         IC    4,0(2,4)
         STC   4,80(,13)
         CLM   3,1,80(13)
         BNL   @@L1873
         L     2,144(13)
         MH    2,=H'4'
         ST    2,144(13)
         LR    2,8
         X     2,=F'-1'
         L     3,=V(MODE@MAS)
         L     4,144(13)
         N     2,0(4,3)
         LTR   2,2
         BE    @@L1875
@@L1873  EQU   *
         L     2,128(13)
         SRL   2,8
         N     2,=F'255'
         CL    2,112(13)
         L     14,=A(@@L1971)
         BER   14
@@L1874  EQU   *
         L     12,0(,10)
         LR    3,9
         A     3,=F'-48'
         LA    4,85(0,0)
         CLR   3,4
         BH    @@L1875
         MH    3,=H'4'
         L     2,=A(@@L1956)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1956  EQU   *
         DC    A(@@L1875)
         DC    A(@@L1876)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1885)
         DC    A(@@L1875)
         DC    A(@@L1888)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1954)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1898)
         DC    A(@@L1902)
         DC    A(@@L1945)
         DC    A(@@L1904)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1891)
         DC    A(@@L1906)
         DC    A(@@L1906)
         DC    A(@@L1948)
         DC    A(@@L1910)
         DC    A(@@L1940)
         DC    A(@@L1926)
         DC    A(@@L1918)
         DC    A(@@L1940)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1952)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1883)
         DC    A(@@L1883)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1875)
         DC    A(@@L1883)
         DC    A(@@L1883)
@@L1876  EQU   *
         LR    15,5
         L     14,=A(@@L1857)
         BR    14
@@L1885  EQU   *
         L     6,116(13)
         LTR   6,6
         BE    @@L1875
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         ST    15,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1972
@@L1887  EQU   *
         L     5,116(13)
@@L1875  EQU   *
         L     12,0(,10)
         MVC   88(4,13),112(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         L     14,=A(@@L1857)
         BR    14
@@L1972  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         MVC   88(4,13),116(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1875
         B     @@L1887
@@L1888  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L1875
         L     3,=V(MODE@SIZ)
         SLR   4,4
         IC    4,2(5)
         L     6,4(5)
         SLR   15,15
         IC    15,2(6)
         IC    2,0(3,4)
         IC    3,0(3,15)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BL    @@L1890
         L     2,=V(MODE@MAS)
         MH    4,=H'4'
         LR    3,8
         N     3,0(4,2)
         MH    15,=H'4'
         L     2,0(15,2)
         X     2,=F'-1'
         NR    3,2
         LTR   3,3
         BNE   @@L1875
@@L1890  EQU   *
         LR    5,6
@@L1957  EQU   *
         L     12,0(,10)
         L     7,120(13)
         B     @@L1879
@@L1954  EQU   *
         MVC   88(4,13),8(5)
         MVC   92(4,13),112(13)
         ST    8,96(13)
         MVC   100(4,13),116(13)
         MVC   104(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         SLR   2,2
         IC    2,2(5)
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         A     5,=F'8'
         ST    5,88(13)
         A     5,=F'-8'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         MVC   88(4,13),12(5)
         MVC   92(4,13),112(13)
         ST    8,96(13)
         MVC   100(4,13),116(13)
         MVC   104(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         SLR   2,2
         IC    2,2(5)
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         A     5,=F'12'
         ST    5,88(13)
         A     5,=F'-12'
@@L1964  EQU   *
         L     12,0(,10)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L1875
@@L1898  EQU   *
         L     3,112(13)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         N     3,=XL4'0000FFFF'
         LR    4,8
         LA    2,31(0,0)
         CLR   3,2
         BH    @@L1899
         BCTR  3,0
         LA    2,1(0,0)
         SLL   2,0(3)
         A     3,=F'1'
         NR    2,8
         LTR   2,2
         BE    @@L1899
         L     4,=F'-1'
         SLL   4,0(3)
         OR    4,8
@@L1899  EQU   *
         L     2,8(5)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L1904
         LCR   2,4
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L1904
         MVC   88(4,13),4(5)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    3,4
         X     3,=F'-1'
         NR    15,3
         LTR   15,15
         BNE   @@L1904
         L     2,8(5)
         N     3,4(2)
         LTR   3,3
         BE    @@L1904
         MVC   88(4,13),4(5)
         L     2,8(5)
         L     2,4(2)
         NR    2,4
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
         LR    5,15
         LR    8,4
         B     @@L1957
@@L1904  EQU   *
         L     8,124(13)
@@L1897  EQU   *
         L     12,0(,10)
         MVC   88(4,13),4(5)
         MVC   92(4,13),112(13)
         ST    8,96(13)
         MVC   100(4,13),116(13)
         MVC   104(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         ST    6,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),8(5)
         MVC   92(4,13),112(13)
         ST    8,96(13)
         MVC   100(4,13),116(13)
         MVC   104(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         ST    6,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         SLR   2,2
         IC    2,2(5)
         CLR   6,2
         BE    @@L1973
@@L1909  EQU   *
         ST    9,88(13)
         ST    6,92(13)
         ST    3,96(13)
         ST    15,100(13)
@@L1967  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
@@L1965  EQU   *
         LR    5,15
         B     @@L1875
@@L1973  EQU   *
         CL    3,4(5)
         BNE   @@L1909
         CL    15,8(5)
         BNE   @@L1909
         B     @@L1875
@@L1902  EQU   *
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1903
         L     4,4(3)
         LCR   2,4
         NR    2,4
         CLR   2,8
         BH    @@L1974
@@L1903  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1904
         L     2,124(13)
         O     2,4(3)
         CL    2,4(3)
         BNE   @@L1904
         MVC   88(4,13),=F'86'
@@L1960  EQU   *
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         MVC   96(4,13),8(5)
         SLR   2,2
         IC    2,2(5)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
@@L1962  EQU   *
         L     12,0(,10)
         LR    5,15
         B     @@L1957
@@L1974  EQU   *
         MVC   88(4,13),=F'77'
         B     @@L1960
@@L1945  EQU   *
         LA    4,1(0,0)
         CLR   8,4
         BNE   @@L1947
         L     5,4(5)
         B     @@L1879
@@L1947  EQU   *
         L     12,0(,10)
         MVC   88(4,13),4(5)
         MVC   92(4,13),112(13)
         MVC   96(4,13),124(13)
         MVC   100(4,13),116(13)
         MVC   104(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         ST    6,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    3,15
         SLR   2,2
         IC    2,2(5)
         CLR   6,2
         BE    @@L1975
@@L1951  EQU   *
         ST    9,88(13)
         ST    6,92(13)
         ST    3,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         B     @@L1965
@@L1975  EQU   *
         CL    15,4(5)
         BNE   @@L1951
         B     @@L1875
@@L1891  EQU   *
         L     2,8(5)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L1897
         ST    5,88(13)
         ST    6,92(13)
         MVC   96(4,13),4(5)
         L     2,8(5)
         LR    7,8
         N     7,4(2)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         LR    5,15
         LH    2,0(15)
         CLM   2,3,=H'83'
         BE    @@L1976
@@L1893  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'83'
         BNE   @@L1875
         L     7,8(5)
         LH    2,0(7)
         CLM   2,3,=H'54'
         BNE   @@L1875
         SLR   4,4
         IC    4,2(5)
         LR    3,4
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     6,0(3,2)
         CLR   6,8
         BE    @@L1875
         MH    4,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(4,2)
         CLM   2,3,=H'32'
         BH    @@L1875
         LR    3,8
         X     3,=F'-1'
         NR    3,6
         O     3,4(7)
         LR    4,2
         N     4,=XL4'0000FFFF'
         LR    2,4
         BCTR  2,0
         LA    6,30(0,0)
         CLR   2,6
         BH    @@L1895
         LR    7,3
         SRA   7,0(2)
         LR    2,7
         N     2,=F'1'
         LTR   2,2
         BE    @@L1895
         L     2,=F'-1'
         SLL   2,0(4)
         OR    3,2
@@L1895  EQU   *
         MVC   88(4,13),=F'0'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'83'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         MVC   96(4,13),4(5)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         CR    2,15
         BNL   @@L1875
         LR    5,3
         B     @@L1875
@@L1976  EQU   *
         L     4,8(15)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BNE   @@L1893
         SLR   2,2
         IC    2,2(15)
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     4,4(4)
         N     4,0(2,3)
         CLR   4,8
         BNE   @@L1893
         L     5,4(15)
         B     @@L1893
@@L1906  EQU   *
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'90'
         BNE   @@L1897
         L     4,8(3)
         LH    2,0(4)
         CH    2,=H'54'
         BNE   @@L1897
         L     2,4(4)
         LTR   2,2
         BL    @@L1897
         LA    7,31(0,0)
         CR    2,7
         BH    @@L1897
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1897
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         A     15,4(4)
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CR    15,2
         BNL   @@L1897
         L     3,8(5)
         MVC   88(4,13),4(5)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         X     15,=F'-1'
         N     15,4(3)
         LTR   15,15
         BNE   @@L1897
         ST    15,88(13)
         L     2,8(5)
         L     3,4(2)
         NR    3,8
         L     2,4(5)
         L     2,8(2)
         L     2,4(2)
         SLL   3,0(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
@@L1966  EQU   *
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         L     2,4(5)
         MVC   96(4,13),4(2)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),=F'90'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         ST    15,96(13)
         L     2,4(5)
         MVC   100(4,13),8(2)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         B     @@L1962
@@L1948  EQU   *
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'90'
         BNE   @@L1947
         L     3,8(3)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L1947
         L     2,4(3)
         LTR   2,2
         BL    @@L1947
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         A     15,4(3)
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CR    15,2
         BNL   @@L1947
         L     2,4(5)
         L     2,8(2)
         L     2,4(2)
         LA    7,31(0,0)
         CR    2,7
         BH    @@L1947
         LR    3,8
         SLL   3,0(2)
         ST    3,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@INT@)
         BALR  14,15
         MVC   88(4,13),=F'85'
         B     @@L1966
@@L1910  EQU   *
         L     4,8(5)
         LH    2,0(4)
         CLM   2,3,=H'54'
         L     14,=A(@@L1977)
         BER   14
@@L1912  EQU   *
         L     12,0(,10)
         IC    2,2(4)
         CLM   2,1,=XL1'00'
         BE    @@L1875
         ST    4,88(13)
         L     2,8(5)
         SLR   3,3
         IC    3,2(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     3,112(13)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         BNL   @@L1875
@@L1911  EQU   *
         L     12,0(,10)
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L1978
@@L1914  EQU   *
         L     12,0(,10)
         L     8,124(13)
@@L1915  EQU   *
         MVC   88(4,13),4(5)
         ST    6,92(13)
         ST    8,96(13)
         MVC   100(4,13),116(13)
         MVC   104(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         ST    6,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    3,15
         SLR   2,2
         IC    2,2(5)
         CLR   6,2
         BE    @@L1979
@@L1917  EQU   *
         ST    9,88(13)
         ST    6,92(13)
         ST    3,96(13)
         MVC   100(4,13),8(5)
         B     @@L1967
@@L1979  EQU   *
         CL    15,4(5)
         BNE   @@L1917
         B     @@L1875
@@L1978  EQU   *
         L     4,4(3)
         LTR   4,4
         BL    @@L1914
         LR    2,6
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    3,0(2,3)
         LR    2,3
         N     2,=XL4'0000FFFF'
         CR    4,2
         BNL   @@L1914
         SRL   8,0(4)
         CLM   3,3,=H'32'
         BNH   @@L1915
         B     @@L1914
@@L1977  EQU   *
         L     15,4(4)
         LTR   15,15
         BL    @@L1912
         L     2,112(13)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CR    15,2
         BL    @@L1911
         B     @@L1912
@@L1926  EQU   *
         L     2,128(13)
         SRL   2,7
         N     2,=F'510'
         L     3,=V(MODE@BIT)
         LH    3,0(2,3)
         CLM   3,3,=H'32'
         BH    @@L1927
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LA    2,1(0,0)
         SLL   2,0(3)
         CLR   8,2
         L     14,=A(@@L1963)
         BER   14
@@L1927  EQU   *
         L     3,8(5)
         LH    2,0(3)
         CH    2,=H'54'
         L     14,=A(@@L1928)
         BNER  14
         L     4,4(3)
         LTR   4,4
         L     14,=A(@@L1928)
         BLR   14
         LA    7,31(0,0)
         CR    4,7
         L     14,=A(@@L1928)
         BHR   14
         L     6,=F'-1'
         L     15,128(13)
         SRL   15,8
         N     15,=F'255'
         LR    3,15
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         CLM   2,3,=H'32'
         L     14,=A(@@L1929)
         BNHR  14
         LR    15,6
         LR    3,2
         N     3,=XL4'0000FFFF'
         LR    2,3
         SR    2,4
         CR    2,7
         BH    @@L1931
         SR    4,3
         A     4,=F'32'
@@L1958  EQU   *
         L     12,0(,10)
         SRL   15,0(4)
@@L1931  EQU   *
         X     15,=F'-1'
         NR    15,8
         LTR   15,15
         L     14,=A(@@L1980)
         BNER  14
@@L1933  EQU   *
         L     12,0(,10)
         ST    5,88(13)
         MVC   92(4,13),=F'90'
         SLR   2,2
         IC    2,2(5)
         ST    2,96(13)
         B     @@PGE36
         DS    0F
         LTORG
         DS    0F
@@PGE36  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG37   EQU   *
         MVC   100(4,13),4(5)
         LTR   6,6
         BL    @@L1981
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         SR    2,6
         BCTR  2,0
@@L1935  EQU   *
         L     12,4(,10)
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         LR    5,15
         LH    2,0(15)
         L     7,120(13)
         CLM   2,3,=H'89'
         L     14,=A(@@L1879)
         BNER  14
@@L1928  EQU   *
         L     12,4(,10)
         LA    2,1(0,0)
         CLR   8,2
         BE    @@L1982
@@L1925  EQU   *
         L     12,4(,10)
         LH    2,0(5)
         AH    2,=H'-89'
         CLM   2,3,=H'1'
         L     14,=A(@@L1875)
         BHR   14
         L     4,8(5)
         LH    2,0(4)
         CH    2,=H'54'
         L     14,=A(@@L1875)
         BNER  14
         L     2,4(4)
         LTR   2,2
         L     14,=A(@@L1875)
         BLR   14
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         SR    2,15
         BCTR  2,0
         C     2,4(4)
         L     14,=A(@@L1875)
         BLR   14
         L     4,4(5)
         LH    2,0(4)
         CLM   2,3,=H'87'
         L     14,=A(@@L1875)
         BNER  14
         L     15,8(4)
         LH    2,0(15)
         CLM   2,3,=H'54'
         L     14,=A(@@L1875)
         BNER  14
         L     3,8(5)
         L     2,4(15)
         CL    2,4(3)
         L     14,=A(@@L1875)
         BNER  14
         L     5,4(4)
         L     14,=A(@@L1957)
         BR    14
@@L1982  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'90'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         MVC   96(4,13),4(5)
         MVC   100(4,13),8(5)
@@L1959  EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    5,15
         B     @@L1925
@@L1981  EQU   *
         L     12,4(,10)
         L     2,8(5)
         L     2,4(2)
         B     @@L1935
@@L1980  EQU   *
         L     12,4(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    6,15
         LTR   15,15
         L     14,=A(@@L1933)
         BNLR  14
         B     @@L1928
@@L1929  EQU   *
         L     12,4(,10)
         MH    15,=H'4'
         L     2,=V(MODE@MAS)
         L     15,0(15,2)
         L     14,=A(@@L1958)
         BR    14
@@L1963  EQU   *
         L     12,4(,10)
         L     5,4(5)
         L     14,=A(@@L1957)
         BR    14
@@L1918  EQU   *
         L     12,4(,10)
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L1983
@@L1919  EQU   *
         L     12,4(,10)
         LH    2,0(5)
         CLM   2,3,=H'90'
         BNE   @@L1925
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1925
         MVC   88(4,13),4(5)
         L     2,4(5)
         SLR   4,4
         IC    4,2(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         A     15,4(3)
         L     4,=V(MODE@BIT)
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         LH    2,0(2,4)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         BL    @@L1925
         LR    3,8
         A     3,=F'1'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L1925
         L     2,8(5)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         A     15,4(2)
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         LH    2,0(2,4)
         N     2,=XL4'0000FFFF'
         CR    15,2
         BH    @@L1925
         MVC   88(4,13),4(5)
         L     2,4(5)
         SLR   6,6
         IC    6,2(2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    2,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         CR    2,15
         BL    @@L1925
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         LH    2,0(2,4)
         N     2,=XL4'0000FFFF'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         SR    2,15
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'90'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         MVC   96(4,13),4(5)
         ST    15,100(13)
         B     @@L1959
@@L1983  EQU   *
         L     12,4(,10)
         L     4,4(3)
         LA    7,31(0,0)
         CR    4,7
         BH    @@L1919
         LR    2,6
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L1919
         L     15,4(5)
         LR    2,8
         SLL   2,0(4)
         LR    4,2
         LR    3,6
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     2,0(3,2)
         X     2,=F'-1'
         NR    2,4
         LTR   2,2
         BE    @@L1920
         L     6,128(13)
         SRL   6,8
         N     6,=F'255'
@@L1920  EQU   *
         L     12,4(,10)
         ST    15,88(13)
         ST    6,92(13)
         ST    4,96(13)
         MVC   100(4,13),116(13)
         MVC   104(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         SLR   2,2
         IC    2,2(5)
         CLR   2,6
         BE    @@L1984
@@L1923  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'90'
         ST    6,92(13)
         ST    15,96(13)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    5,15
         B     @@L1919
@@L1984  EQU   *
         L     12,4(,10)
         CL    15,4(5)
         BNE   @@L1923
         B     @@L1919
@@L1940  EQU   *
         L     12,4(,10)
         L     3,8(5)
         LH    2,0(3)
         CH    2,=H'54'
         L     14,=A(@@L1875)
         BNER  14
         L     2,4(3)
         LTR   2,2
         L     14,=A(@@L1875)
         BLR   14
         MVC   88(4,13),=F'0'
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LA    2,91(0,0)
         LA    3,88(0,0)
         CLR   9,3
         BE    @@L1943
         LA    2,88(0,0)
@@L1943  EQU   *
         L     12,4(,10)
         ST    2,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         ST    15,96(13)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1875)
         BER   14
         LH    2,0(15)
         CLM   2,3,=H'54'
         L     14,=A(@@L1875)
         BNER  14
         MVC   88(4,13),4(5)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         MVC   96(4,13),4(15)
         MVC   100(4,13),116(13)
         MVC   104(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         A     5,=F'4'
         ST    5,88(13)
         A     5,=F'-4'
         L     14,=A(@@L1964)
         BR    14
@@L1952  EQU   *
         L     12,4(,10)
         LR    2,8
         N     2,=F'-2'
         LTR   2,2
         L     14,=A(@@L1875)
         BNER  14
         L     3,8(5)
         L     2,=V(CIRTX)
         CL    3,256(2)
         L     14,=A(@@L1875)
         BNER  14
         MVC   88(4,13),4(5)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1875)
         BLR   14
         MVC   88(4,13),4(5)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LA    4,1(0,0)
         CLR   15,4
         BE    @@L1963
         L     14,=A(@@L1875)
         BR    14
@@L1883  EQU   *
         L     12,4(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         LR    5,15
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         L     7,120(13)
         CLR   2,9
         L     14,=A(@@L1879)
         BNER  14
         L     14,=A(@@L1875)
         BR    14
@@L1971  EQU   *
         L     12,4(,10)
         LA    2,63(0,0)
         CLR   9,2
         L     14,=A(@@L1874)
         BER   14
         LR    2,8
         X     2,=F'-1'
         NR    2,15
         LR    15,5
         LTR   2,2
         L     14,=A(@@L1874)
         BNER  14
         B     @@L1857
@@L1970  EQU   *
         L     12,4(,10)
         N     8,4(5)
         ST    8,88(13)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GEN@INT@)
         BALR  14,15
         B     @@L1857
@@L1969  EQU   *
         L     12,4(,10)
         L     2,=V(CIRTX)
         L     15,256(2)
         B     @@L1857
@@L1868  EQU   *
         L     12,4(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         A     15,=F'1'
         LA    4,1(0,0)
         SLL   4,0(15)
         BCTR  4,0
         ST    4,124(13)
         L     14,=A(@@L1870)
         BR    14
@@L1867  EQU   *
         L     12,4(,10)
         MVC   124(4,13),=F'-1'
         L     14,=A(@@L1870)
         BR    14
@@L1968  EQU   *
         L     12,4(,10)
         ST    9,88(13)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         L     6,112(13)
         LTR   15,15
         L     14,=A(@@L1863)
         BNER  14
         L     14,=A(@@L1864)
         BR    14
@@L1859  EQU   *
         L     12,4(,10)
         MVC   120(4,13),=F'1'
         L     14,=A(@@L1858)
         BR    14
@@L1857  EQU   *
         L     12,4(,10)
* Function force_to_mode epilogue
         PDPEPIL
* Function force_to_mode literal pool
         DS    0F
         LTORG
* Function force_to_mode page table
         DS    0F
@@PGT36  EQU   *
         DC    A(@@PG36)
         DC    A(@@PG37)
         DS    0F
* S-func if_then_else_cond prologue
@@70     PDPPRLG CINDEX=38,FRAME=128,BASER=12,ENTRY=NO
         B     @@FEN38
         LTORG
@@FEN38  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG38   EQU   *
         LR    11,1
         L     10,=A(@@PGT38)
* Function if_then_else_cond code
         L     8,0(11)
         L     9,4(11)
         SLR   6,6
         IC    6,2(8)
         LH    5,0(8)
         N     5,=XL4'0000FFFF'
         LR    2,5
         A     2,=F'-102'
         LA    3,1(0,0)
         CLR   2,3
         BH    @@L1986
         L     3,8(8)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L2041)
         BER   14
@@L1986  EQU   *
         L     12,0(,10)
         L     2,=V(RTX@CLAS)
         IC    2,0(2,5)
         CLM   2,1,=XL1'F1'
         L     14,=A(@@L2042)
         BER   14
@@L1992  EQU   *
         L     12,0(,10)
         LA    3,74(0,0)
         CLR   5,3
         BE    @@L1991
         L     2,=V(RTX@CLAS)
         IC    2,0(2,5)
         CLM   2,1,=XL1'83'
         BE    @@L1998
         CLM   2,1,=XL1'F2'
         BE    @@L1998
         CLM   2,1,=XL1'4C'
         BE    @@L1998
         LA    2,72(0,0)
         CLR   5,2
         BE    @@L2043
         LA    3,63(0,0)
         CLR   5,3
         BE    @@L2044
@@L2025  EQU   *
         LH    3,0(8)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1991
         CLM   3,3,=H'54'
         BE    @@L1991
         CLM   3,3,=H'55'
         BE    @@L1991
         CLM   3,3,=H'58'
         BE    @@L1991
         CLM   3,3,=H'134'
         BE    @@L1991
         CLM   3,3,=H'56'
         BE    @@L1991
         CLM   3,3,=H'140'
         BE    @@L1991
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         LTR   15,15
         BE    @@L2027
         LH    15,0(15)
         LR    2,15
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1991
         CLM   15,3,=H'54'
         BE    @@L1991
         CLM   15,3,=H'55'
         BE    @@L1991
         CLM   15,3,=H'58'
         BE    @@L1991
         CLM   15,3,=H'134'
         BE    @@L1991
         CLM   15,3,=H'56'
         BE    @@L1991
         CLM   15,3,=H'140'
         BE    @@L1991
@@L2027  EQU   *
         LA    3,1(0,0)
         CLR   6,3
         BE    @@L2045
         L     2,=V(CIRTX)
         CL    8,252(2)
         BE    @@L2033
         CL    8,256(2)
         BE    @@L2033
         LTR   6,6
         BNE   @@L2046
@@L2032  EQU   *
         LTR   6,6
         BE    @@L1991
         LR    2,6
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BNH   @@L2047
@@L1991  EQU   *
         L     2,8(11)
         ST    8,0(2)
         ST    8,0(9)
         SLR   15,15
         L     14,=A(@@L1985)
         BR    14
@@L2047  EQU   *
         ST    8,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L1991
         ST    2,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    15,92(13)
@@L2039  EQU   *
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,0(9)
         L     2,=V(CIRTX)
@@L2036  EQU   *
         L     3,8(11)
         MVC   0(4,3),256(2)
         LR    15,8
         L     14,=A(@@L1985)
         BR    14
@@L2046  EQU   *
         ST    8,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    3,6
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         BNE   @@L2032
@@L2033  EQU   *
         L     2,=V(CIRTX)
         MVC   0(4,9),252(2)
         B     @@L2036
@@L2045  EQU   *
         MVC   88(4,13),=F'0'
         ST    6,92(13)
         B     @@L2039
@@L2044  EQU   *
         MVC   88(4,13),4(8)
         LA    2,104(,13)
         ST    2,92(13)
         LA    2,108(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@70)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L2025
         ST    6,88(13)
         MVC   92(4,13),104(13)
         L     2,4(8)
         SLR   3,3
         IC    3,2(2)
         ST    3,96(13)
         MVC   100(4,13),8(8)
         LA    1,88(,13)
         L     15,=V(SGENSUB)
         BALR  14,15
         ST    15,0(9)
         ST    6,88(13)
         MVC   92(4,13),108(13)
         L     2,4(8)
         SLR   3,3
         IC    3,2(2)
         ST    3,96(13)
         MVC   100(4,13),8(8)
         LA    1,88(,13)
         L     15,=V(SGENSUB)
         BALR  14,15
@@L2040  EQU   *
         L     12,0(,10)
         L     2,8(11)
         ST    15,0(2)
@@L2037  EQU   *
         L     12,0(,10)
         LR    15,4
         L     14,=A(@@L1985)
         BR    14
@@L2043  EQU   *
         L     4,4(8)
         MVC   0(4,9),8(8)
         L     3,8(11)
         MVC   0(4,3),12(8)
         LH    5,0(4)
         CLM   5,3,=H'102'
         BE    @@L2048
@@L2020  EQU   *
         CLM   5,3,=H'103'
         BNE   @@L2037
         L     3,8(4)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L2037
         MVC   0(4,9),12(8)
         L     2,8(11)
         MVC   0(4,2),8(8)
@@L2038  EQU   *
         L     15,4(4)
         L     14,=A(@@L1985)
         BR    14
@@L2048  EQU   *
         L     3,8(4)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L2020
         B     @@L2038
@@L1998  EQU   *
         MVC   88(4,13),4(8)
         LA    2,104(,13)
         ST    2,92(13)
         LA    2,108(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@70)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),8(8)
         LA    2,112(,13)
         ST    2,92(13)
         LA    2,116(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@70)
         BALR  14,15
         LR    3,15
         LTR   4,4
         L     14,=A(@@L2049)
         BER   14
@@L2000  EQU   *
         L     12,0(,10)
         LTR   4,4
         BE    @@L2001
         LTR   3,3
         BE    @@L2001
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1999
@@L2001  EQU   *
         LTR   4,4
         BE    @@L2050
         LTR   3,3
         BE    @@L2051
@@L2003  EQU   *
         ST    5,88(13)
         ST    6,92(13)
         MVC   96(4,13),104(13)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,0(9)
         ST    5,88(13)
         ST    6,92(13)
         MVC   96(4,13),108(13)
         MVC   100(4,13),116(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         L     2,8(11)
         ST    15,0(2)
         LR    15,4
         LTR   4,4
         L     14,=A(@@L1985)
         BNER  14
         LR    15,3
         L     14,=A(@@L1985)
         BR    14
@@L2051  EQU   *
         MVC   88(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,112(13)
         B     @@L2003
@@L2050  EQU   *
         MVC   88(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,104(13)
         B     @@L2003
@@L1999  EQU   *
         L     12,0(,10)
         LA    3,75(0,0)
         CLR   5,3
         BE    @@L2007
         LA    2,84(0,0)
         CLR   5,2
         BE    @@L2007
         LA    3,85(0,0)
         CLR   5,3
         BE    @@L2007
         LA    2,76(0,0)
         CLR   5,2
         BE    @@L2007
         LA    3,95(0,0)
         CLR   5,3
         BE    @@L2007
@@L2006  EQU   *
         LA    2,78(0,0)
         CLR   5,2
         BE    @@L2014
         LA    3,83(0,0)
         CLR   5,3
         BE    @@L2014
         LA    2,94(0,0)
         CLR   5,2
         BNE   @@L1991
@@L2014  EQU   *
         L     3,4(8)
         LH    2,0(3)
         CLM   2,3,=H'78'
         BNE   @@L1991
         L     15,8(8)
         LH    2,0(15)
         CLM   2,3,=H'78'
         BNE   @@L1991
         L     4,4(3)
         L     3,4(15)
         L     6,=V(RTX@CLAS)
         LH    5,0(4)
         N     5,=XL4'0000FFFF'
         IC    2,0(6,5)
         CLM   2,1,=XL1'4C'
         BNE   @@L1991
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(6,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L1991
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         CLR   5,15
         BE    @@L2052
@@L2017  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         LR    2,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         CLR   2,15
         BNE   @@L1991
         MVC   88(4,13),4(4)
         MVC   92(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1991
         MVC   88(4,13),8(4)
         MVC   92(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1991
@@L2016  EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L1991
         L     2,=V(CIRTX)
         L     2,256(2)
         L     3,8(11)
         ST    2,0(3)
         ST    2,0(9)
         B     @@L2037
@@L2052  EQU   *
         MVC   88(4,13),4(4)
         MVC   92(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2017
         MVC   88(4,13),8(4)
         MVC   92(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L2016
         B     @@L2017
@@L2007  EQU   *
         L     3,4(8)
         LH    2,0(3)
         CLM   2,3,=H'78'
         BNE   @@L2006
         L     15,8(8)
         LH    2,0(15)
         CLM   2,3,=H'78'
         BNE   @@L2006
         MVC   120(4,13),8(3)
         MVC   124(4,13),8(15)
         L     4,4(3)
         L     3,4(15)
         L     15,=V(RTX@CLAS)
         LH    7,0(4)
         N     7,=XL4'0000FFFF'
         IC    2,0(15,7)
         CLM   2,1,=XL1'4C'
         BNE   @@L2006
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(15,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L2006
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         CLR   7,15
         BE    @@L2053
@@L2010  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         LR    2,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         CLR   2,15
         BNE   @@L2006
         MVC   88(4,13),4(4)
         MVC   92(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2006
         MVC   88(4,13),8(4)
         MVC   92(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2006
@@L2009  EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L2006
         MVC   88(4,13),=F'78'
         ST    6,92(13)
         MVC   96(4,13),120(13)
         L     2,=V(CONST@TR)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,0(9)
         LA    2,76(0,0)
         CLR   5,2
         BE    @@L2054
         L     15,124(13)
@@L2012  EQU   *
         MVC   88(4,13),=F'78'
         ST    6,92(13)
         ST    15,96(13)
         L     2,=V(CONST@TR)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         L     3,8(11)
         ST    15,0(3)
         B     @@L2037
@@L2054  EQU   *
         MVC   88(4,13),=F'77'
         ST    6,92(13)
         MVC   96(4,13),124(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         B     @@L2012
@@L2053  EQU   *
         MVC   88(4,13),4(4)
         MVC   92(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2010
         MVC   88(4,13),8(4)
         MVC   92(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L2009
         B     @@L2010
@@L2049  EQU   *
         LTR   15,15
         BNE   @@L2000
         B     @@L1999
@@L2042  EQU   *
         MVC   88(4,13),4(8)
         LA    2,104(,13)
         ST    2,92(13)
         LA    2,108(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@70)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L1992
         ST    5,88(13)
         ST    6,92(13)
         MVC   96(4,13),104(13)
         L     2,4(8)
         SLR   3,3
         IC    3,2(2)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         ST    15,0(9)
         ST    5,88(13)
         ST    6,92(13)
         MVC   96(4,13),108(13)
         L     2,4(8)
         SLR   3,3
         IC    3,2(2)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         B     @@L2040
@@L2041  EQU   *
         L     2,4(3)
         LTR   2,2
         BNE   @@L1986
         LA    2,102(0,0)
         CLR   5,2
         BE    @@L1987
         L     2,=V(CIRTX)
         L     2,256(2)
@@L1988  EQU   *
         ST    2,0(9)
         LA    3,102(0,0)
         CLR   5,3
         BE    @@L2055
         L     2,=V(CONST@TR)
         L     2,0(2)
@@L1990  EQU   *
         L     3,8(11)
         ST    2,0(3)
         L     15,4(8)
         B     @@L1985
@@L2055  EQU   *
         L     2,=V(CIRTX)
         L     2,256(2)
         B     @@L1990
@@L1987  EQU   *
         L     2,=V(CONST@TR)
         L     2,0(2)
         B     @@L1988
@@L1985  EQU   *
* Function if_then_else_cond epilogue
         PDPEPIL
* Function if_then_else_cond literal pool
         DS    0F
         LTORG
* Function if_then_else_cond page table
         DS    0F
@@PGT38  EQU   *
         DC    A(@@PG38)
         DS    0F
* S-func known_cond prologue
@@83     PDPPRLG CINDEX=39,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN39
         LTORG
@@FEN39  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG39   EQU   *
         LR    11,1
         L     10,=A(@@PGT39)
* Function known_cond code
         L     5,0(11)
         L     9,4(11)
         LH    4,0(5)
         N     4,=XL4'0000FFFF'
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LR    2,5
         LTR   15,15
         L     14,=A(@@L2056)
         BNER  14
         LA    2,103(0,0)
         CLR   9,2
         L     14,=A(@@L2133)
         BER   14
@@L2058  EQU   *
         L     12,0(,10)
         LA    2,114(0,0)
         CLR   9,2
         L     14,=A(@@L2134)
         BER   14
@@L2059  EQU   *
         L     12,0(,10)
         LA    3,129(0,0)
         CLR   4,3
         BE    @@L2135
@@L2060  EQU   *
         L     2,=V(RTX@CLAS)
         IC    3,0(2,4)
         CLM   3,1,=XL1'4C'
         BE    @@L2071
         CLM   3,1,=XL1'83'
         BE    @@L2071
         LA    3,63(0,0)
         CLR   4,3
         BE    @@L2136
         LA    6,121(0,0)
         CR    4,6
         BE    @@L2137
@@L2069  EQU   *
         LR    2,4
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         ST    3,104(13)
         L     2,=V(RTX@LENG)
         SLR   7,7
         IC    7,0(2,4)
         BCTR  7,0
         LTR   7,7
         BL    @@L2127
         LR    8,7
         MH    8,=H'4'
         AR    8,5
         LR    2,8
         A     2,=F'4'
         ST    2,112(13)
@@L2125  EQU   *
         L     3,104(13)
         IC    2,0(7,3)
         CLM   2,1,=XL1'85'
         BE    @@L2138
         SLL   2,24
         SRA   2,24
         C     2,=F'-59'
         BE    @@L2139
@@L2115  EQU   *
         L     6,112(13)
         A     6,=F'-4'
         ST    6,112(13)
         A     8,=F'-4'
         BCTR  7,0
         LTR   7,7
         BNL   @@L2125
@@L2127  EQU   *
         LR    2,5
         L     14,=A(@@L2056)
         BR    14
@@L2139  EQU   *
         LR    2,7
         MH    2,=H'4'
         ST    2,108(13)
         L     3,112(13)
         L     2,0(3)
         L     6,0(2)
         BCTR  6,0
         LTR   6,6
         BL    @@L2115
@@L2124  EQU   *
         L     4,108(13)
         AR    4,5
         A     4,=F'4'
         L     3,0(4)
         LR    2,6
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,88(13)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@83)
         BALR  14,15
         A     2,0(4)
         A     2,=F'4'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         BCTR  6,0
         LTR   6,6
         BNL   @@L2124
         B     @@L2115
@@L2138  EQU   *
         L     6,112(13)
         MVC   88(4,13),0(6)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@83)
         BALR  14,15
         A     8,=F'4'
         ST    8,88(13)
         A     8,=F'-4'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L2115
@@L2137  EQU   *
         L     2,4(5)
         SLR   6,6
         IC    6,2(2)
         ST    2,88(13)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@83)
         BALR  14,15
         LR    3,15
         L     2,4(5)
         CLR   2,15
         BE    @@L2127
         ST    4,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         ST    15,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(SUNARYOP)
         BALR  14,15
@@L2132  EQU   *
         LR    2,15
         LTR   15,15
         BNE   @@L2056
         A     5,=F'4'
         ST    5,88(13)
         A     5,=F'-4'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L2127
@@L2136  EQU   *
         L     2,4(5)
         SLR   4,4
         IC    4,2(2)
         ST    2,88(13)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@83)
         BALR  14,15
         LR    3,15
         L     2,4(5)
         CLR   2,15
         BE    @@L2127
         SLR   2,2
         IC    2,2(5)
         ST    2,88(13)
         ST    15,92(13)
         ST    4,96(13)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SSUBREG)
         BALR  14,15
         B     @@L2132
@@L2071  EQU   *
         MVC   88(4,13),4(5)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L2140
@@L2072  EQU   *
         MVC   88(4,13),4(5)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2069
         MVC   88(4,13),8(5)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2069
         CLM   3,1,=XL1'4C'
         BE    @@L2141
         LR    2,4
         A     2,=F'-92'
         LA    6,3(0,0)
         CLR   2,6
         BH    @@L2069
         SLR   6,6
         A     2,=F'-2'
         LA    3,1(0,0)
         CLR   2,3
         BH    @@L2080
         LR    6,3
@@L2080  EQU   *
         LA    2,93(0,0)
         CLR   4,2
         BE    @@L2082
         LA    3,95(0,0)
         CLR   4,3
         BE    @@L2082
@@L2081  EQU   *
         LR    3,9
         A     3,=F'-104'
         LA    2,7(0,0)
         CLR   3,2
         BH    @@L2069
         MH    3,=H'4'
         L     2,=A(@@L2101)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2101  EQU   *
         DC    A(@@L2085)
         DC    A(@@L2085)
         DC    A(@@L2089)
         DC    A(@@L2089)
         DC    A(@@L2093)
         DC    A(@@L2093)
         DC    A(@@L2097)
         DC    A(@@L2097)
@@L2085  EQU   *
         LR    15,5
         LTR   6,6
         BNE   @@L2099
@@L2129  EQU   *
         L     15,8(5)
@@L2099  EQU   *
         LR    2,15
         B     @@L2056
@@L2089  EQU   *
         LR    15,5
         LTR   6,6
         BNE   @@L2099
@@L2130  EQU   *
         L     15,4(5)
         B     @@L2099
@@L2093  EQU   *
         LR    15,5
         LTR   6,6
         BE    @@L2099
         B     @@L2129
@@L2097  EQU   *
         LR    15,5
         LTR   6,6
         BE    @@L2099
         B     @@L2130
@@L2082  EQU   *
         LR    2,9
         A     2,=F'-102'
         LA    3,1(0,0)
         CLR   2,3
         BNH   @@L2081
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(REVCOND)
         BALR  14,15
         LR    9,15
         B     @@L2081
@@L2141  EQU   *
         ST    9,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(CMDOMINS)
         BALR  14,15
         LTR   15,15
         BE    @@L2075
         L     2,=V(CONST@TR)
         L     2,0(2)
         B     @@L2056
@@L2075  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         LTR   15,15
         BE    @@L2127
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CMDOMINS)
         BALR  14,15
         LTR   15,15
         BE    @@L2127
         L     2,=V(CIRTX)
         L     2,256(2)
         B     @@L2056
@@L2140  EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         LR    9,15
         L     2,12(11)
         MVC   12(4,11),8(11)
         ST    2,8(11)
         B     @@L2072
@@L2135  EQU   *
         MVC   88(4,13),4(5)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2060
         L     2,=V(CIRTX)
         L     6,12(11)
         CL    6,256(2)
         BNE   @@L2060
         LA    2,103(0,0)
         CLR   9,2
         BL    @@L2069
         LA    3,105(0,0)
         CLR   9,3
         BNH   @@L2064
         LA    6,107(0,0)
         CLR   9,6
         BH    @@L2069
         MVC   88(4,13),=F'77'
         L     2,4(5)
         SLR   3,3
         IC    3,2(2)
         ST    3,92(13)
         ST    2,96(13)
         SLR   3,3
         IC    3,2(2)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         B     @@L2099
@@L2064  EQU   *
         L     2,4(5)
         B     @@L2056
@@L2134  EQU   *
         ST    5,88(13)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         L     2,12(11)
         LTR   15,15
         BNE   @@L2056
         B     @@L2059
@@L2133  EQU   *
         ST    5,88(13)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2058
         L     3,=V(MODE@CLA)
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'4'
         L     2,0(2,3)
         LA    6,2(0,0)
         CLR   2,6
         BE    @@L2058
         LA    6,6(0,0)
         CLR   2,6
         BE    @@L2058
         LA    6,8(0,0)
         CLR   2,6
         BE    @@L2058
         L     6,12(11)
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'4'
         L     3,0(2,3)
         LA    2,2(0,0)
         CLR   3,2
         BE    @@L2058
         LA    6,6(0,0)
         CLR   3,6
         BE    @@L2058
         L     2,12(11)
         LA    6,8(0,0)
         CLR   3,6
         BE    @@L2058
@@L2056  EQU   *
         LR    15,2
* Function known_cond epilogue
         PDPEPIL
* Function known_cond literal pool
         DS    0F
         LTORG
* Function known_cond page table
         DS    0F
@@PGT39  EQU   *
         DC    A(@@PG39)
         DS    0F
* S-func rtx_equal_for_field_assignment_p prologue
@@87     PDPPRLG CINDEX=40,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN40
         LTORG
@@FEN40  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG40   EQU   *
         LR    11,1
         L     10,=A(@@PGT40)
* Function rtx_equal_for_field_assignment_p code
         L     4,0(11)
         L     3,4(11)
         CLR   4,3
         BE    @@L2144
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2143
@@L2144  EQU   *
         LA    2,1(0,0)
         B     @@L2142
@@L2143  EQU   *
         LTR   4,4
         BE    @@L2148
         LTR   3,3
         BE    @@L2148
         CLC   2(1,4),2(3)
         BE    @@L2149
@@L2148  EQU   *
         SLR   2,2
         B     @@L2142
@@L2149  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'66'
         BE    @@L2150
@@L2147  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'66'
         BNE   @@L2148
         LH    2,0(4)
         CLM   2,3,=H'63'
         BNE   @@L2148
         L     15,4(4)
         LH    2,0(15)
         CLM   2,3,=H'66'
         BNE   @@L2148
         SLR   2,2
         IC    2,2(15)
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         MVC   88(4,13),4(4)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LA    2,1(0,0)
         LTR   15,15
         BNE   @@L2142
         B     @@L2148
@@L2150  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'63'
         BNE   @@L2147
         L     15,4(3)
         LH    2,0(15)
         CLM   2,3,=H'66'
         BNE   @@L2147
         SLR   2,2
         IC    2,2(15)
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         MVC   88(4,13),4(3)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LA    2,1(0,0)
         LTR   15,15
         BE    @@L2147
@@L2142  EQU   *
         LR    15,2
* Function rtx_equal_for_field_assignment_p epilogue
         PDPEPIL
* Function rtx_equal_for_field_assignment_p literal pool
         DS    0F
         LTORG
* Function rtx_equal_for_field_assignment_p page table
         DS    0F
@@PGT40  EQU   *
         DC    A(@@PG40)
         DS    0F
* S-func make_field_assignment prologue
@@84     PDPPRLG CINDEX=41,FRAME=128,BASER=12,ENTRY=NO
         B     @@FEN41
         LTORG
@@FEN41  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG41   EQU   *
         LR    11,1
         L     10,=A(@@PGT41)
* Function make_field_assignment code
         L     2,0(11)
         L     7,4(2)
         L     6,8(2)
         LH    2,0(6)
         CLM   2,3,=H'83'
         BE    @@L2175
@@L2152  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'83'
         BE    @@L2176
@@L2155  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'84'
         BE    @@L2177
@@L2154  EQU   *
         LH    2,0(6)
         AH    2,=H'-84'
         L     15,0(11)
         CLM   2,3,=H'1'
         BH    @@L2151
         MVC   88(4,13),4(6)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         LR    3,15
         LH    2,0(4)
         CLM   2,3,=H'83'
         BE    @@L2178
@@L2161  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'83'
         BE    @@L2179
@@L2166  EQU   *
         L     15,0(11)
         B     @@L2151
@@L2179  EQU   *
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L2166
         MVC   88(4,13),4(3)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@87)
         BALR  14,15
         LTR   15,15
         BE    @@L2166
         L     2,8(3)
         L     5,4(2)
         LR    9,4
@@L2162  EQU   *
         LR    4,5
         X     4,=F'-1'
         SLR   2,2
         IC    2,2(7)
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         N     4,0(2,3)
         ST    4,88(13)
         LA    2,120(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@86)
         BALR  14,15
         LR    8,15
         LTR   15,15
         BL    @@L2166
         LR    4,15
         A     4,120(13)
         SLR   2,2
         IC    2,2(7)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    3,0(2,3)
         LR    2,3
         N     2,=XL4'0000FFFF'
         CLR   4,2
         BH    @@L2166
         CLM   3,3,=H'32'
         BH    @@L2166
         ST    9,88(13)
         SLR   2,2
         IC    2,2(7)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    15,5
         LTR   15,15
         BNE   @@L2166
         ST    15,88(13)
         ST    7,92(13)
         ST    8,96(13)
         ST    15,100(13)
         MVC   104(4,13),120(13)
         MVC   108(4,13),=F'1'
         MVC   112(4,13),=F'1'
         ST    15,116(13)
         LA    1,88(,13)
         L     15,=A(@@67)
         BALR  14,15
         LR    4,15
         L     15,0(11)
         LTR   4,4
         BE    @@L2151
         LH    2,0(4)
         CLM   2,3,=H'64'
         BE    @@L2180
         SLR   3,3
         IC    3,2(4)
@@L2169  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'90'
         SLR   2,2
         IC    2,2(6)
         ST    2,96(13)
         ST    9,100(13)
         ST    8,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         ST    15,88(13)
         ST    3,92(13)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         CLM   2,3,=H'31'
         BH    @@L2170
         LA    2,1(0,0)
         L     3,120(13)
         SLL   2,0(3)
         BCTR  2,0
@@L2171  EQU   *
         ST    2,96(13)
         ST    7,100(13)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         ST    15,100(13)
@@L2172  EQU   *
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L2151
@@L2170  EQU   *
         L     2,=F'-1'
         B     @@L2171
@@L2180  EQU   *
         L     2,4(4)
         SLR   3,3
         IC    3,2(2)
         B     @@L2169
@@L2178  EQU   *
         L     2,8(4)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L2161
         MVC   88(4,13),4(4)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@87)
         BALR  14,15
         LTR   15,15
         BE    @@L2161
         L     2,8(4)
         L     5,4(2)
         LR    9,3
         B     @@L2162
@@L2177  EQU   *
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'87'
         BNE   @@L2154
         L     5,=V(CIRTX)
         L     2,4(3)
         CL    2,260(5)
         BNE   @@L2154
         ST    7,88(13)
         MVC   92(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(@@87)
         BALR  14,15
         LTR   15,15
         BE    @@L2154
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         MVC   96(4,13),=F'0'
         L     2,4(6)
         MVC   100(4,13),8(2)
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'1'
         MVC   112(4,13),=F'1'
         MVC   116(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@67)
         BALR  14,15
         LTR   15,15
         BE    @@L2166
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         MVC   100(4,13),260(5)
         B     @@L2172
@@L2176  EQU   *
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BNE   @@L2155
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L2155
         L     5,=V(MODE@SIZ)
         L     2,4(6)
         SLR   4,4
         IC    4,2(2)
         L     15,4(2)
         SLR   3,3
         IC    3,2(15)
         IC    2,0(5,4)
         IC    5,0(5,3)
         STC   5,80(,13)
         CLM   2,1,80(13)
         BNL   @@L2155
         LH    2,0(15)
         CLM   2,3,=H'88'
         BNE   @@L2155
         L     2,4(15)
         L     2,4(2)
         L     3,=F'-2'
         CLR   2,3
         BNE   @@L2155
         ST    7,88(13)
         MVC   92(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(@@87)
         BALR  14,15
         LTR   15,15
         BE    @@L2155
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         MVC   96(4,13),=F'0'
         L     2,4(6)
         L     2,4(2)
@@L2174  EQU   *
         MVC   100(4,13),8(2)
         MVC   104(4,13),=F'1'
         MVC   108(4,13),=F'1'
         MVC   112(4,13),=F'1'
         MVC   116(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@67)
         BALR  14,15
         LTR   15,15
         BE    @@L2166
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         B     @@L2172
@@L2175  EQU   *
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'88'
         BNE   @@L2152
         L     3,4(3)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L2152
         L     2,4(3)
         L     3,=F'-2'
         CLR   2,3
         BNE   @@L2152
         ST    7,88(13)
         MVC   92(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(@@87)
         BALR  14,15
         LTR   15,15
         BE    @@L2152
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         MVC   96(4,13),=F'0'
         L     2,4(6)
         B     @@L2174
@@L2151  EQU   *
* Function make_field_assignment epilogue
         PDPEPIL
* Function make_field_assignment literal pool
         DS    0F
         LTORG
* Function make_field_assignment page table
         DS    0F
@@PGT41  EQU   *
         DC    A(@@PG41)
         DS    0F
* S-func apply_distributive_law prologue
@@72     PDPPRLG CINDEX=42,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN42
         LTORG
@@FEN42  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG42   EQU   *
         LR    11,1
         L     10,=A(@@PGT42)
* Function apply_distributive_law code
         L     9,0(11)
         L     2,0(9)
         LR    3,2
         SRL   3,16
         ST    3,104(13)
         SRL   2,6
         N     2,=F'1020'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    6,2(0,0)
         CLR   2,6
         BE    @@L2208
         LA    3,6(0,0)
         CLR   2,3
         BE    @@L2208
         LA    6,8(0,0)
         CLR   2,6
         BE    @@L2208
         L     2,104(13)
         A     2,=F'-83'
         LA    3,2(0,0)
         CLR   2,3
         BNH   @@L2184
         L     2,104(13)
         LA    6,75(0,0)
         CLR   2,6
         BE    @@L2184
         LR    15,9
         LA    3,76(0,0)
         CLR   2,3
         BNE   @@L2181
@@L2184  EQU   *
         L     6,4(9)
         L     7,8(9)
         L     3,=V(RTX@CLAS)
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'96'
         BE    @@L2208
         LH    2,0(7)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'96'
         BE    @@L2208
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         LR    6,15
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         LR    7,15
         LH    5,0(6)
         N     5,=XL4'0000FFFF'
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         LR    15,9
         CLR   5,2
         BNE   @@L2181
         LR    3,5
         A     3,=F'-63'
         LA    2,27(0,0)
         CLR   3,2
         BH    @@L2208
         MH    3,=H'4'
         L     2,=A(@@L2201)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2201  EQU   *
         DC    A(@@L2197)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2194)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2192)
         DC    A(@@L2192)
         DC    A(@@L2208)
         DC    A(@@L2208)
         DC    A(@@L2188)
         DC    A(@@L2208)
         DC    A(@@L2192)
         DC    A(@@L2192)
@@L2192  EQU   *
         L     2,104(13)
         A     2,=F'-75'
         LR    15,9
         LA    3,1(0,0)
         CLR   2,3
         BNH   @@L2181
@@L2188  EQU   *
         L     2,=V(RTX@CLAS)
         IC    2,0(2,5)
         CLM   2,1,=XL1'83'
         BE    @@L2213
@@L2202  EQU   *
         L     2,=V(RTX@CLAS)
         IC    2,0(2,5)
         CLM   2,1,=XL1'83'
         BE    @@L2214
@@L2204  EQU   *
         L     2,=V(RTX@CLAS)
         IC    2,0(2,5)
         CLM   2,1,=XL1'83'
         BE    @@L2215
@@L2206  EQU   *
         MVC   88(4,13),8(6)
         MVC   92(4,13),8(7)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2208
         L     4,8(6)
         L     6,4(6)
@@L2211  EQU   *
         L     7,4(7)
@@L2203  EQU   *
         MVC   88(4,13),104(13)
         SLR   2,2
         IC    2,2(9)
         ST    2,92(13)
         ST    6,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    3,15
         L     2,104(13)
         LA    6,85(0,0)
         CLR   2,6
         BE    @@L2216
@@L2210  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@72)
         BALR  14,15
         ST    5,88(13)
         SLR   2,2
         IC    2,2(9)
         ST    2,92(13)
         ST    15,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         B     @@L2181
@@L2216  EQU   *
         LA    6,84(0,0)
         CLR   5,6
         BNE   @@L2210
         LA    5,83(0,0)
         MVC   88(4,13),=F'86'
         SLR   2,2
         IC    2,2(9)
         ST    2,92(13)
         ST    4,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         LR    4,15
         B     @@L2210
@@L2208  EQU   *
         LR    15,9
         B     @@L2181
@@L2215  EQU   *
         MVC   88(4,13),8(6)
         MVC   92(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2206
         L     4,8(6)
         L     6,4(6)
@@L2212  EQU   *
         L     7,8(7)
         B     @@L2203
@@L2214  EQU   *
         MVC   88(4,13),4(6)
         MVC   92(4,13),8(7)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2204
         L     4,4(6)
         L     6,8(6)
         B     @@L2211
@@L2213  EQU   *
         MVC   88(4,13),4(6)
         MVC   92(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2202
         L     4,4(6)
         L     6,8(6)
         B     @@L2212
@@L2197  EQU   *
         L     3,4(6)
         L     2,4(7)
         CLC   2(1,3),2(2)
         BNE   @@L2208
         L     2,8(6)
         CL    2,8(7)
         BNE   @@L2208
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L2208
         L     5,=V(MODE@CLA)
         SLR   8,8
         IC    8,2(6)
         LR    4,8
         MH    4,=H'4'
         L     2,4(6)
         SLR   15,15
         IC    15,2(2)
         LR    3,15
         MH    3,=H'4'
         L     2,0(4,5)
         CL    2,0(3,5)
         BNE   @@L2208
         L     2,=V(MODE@SIZ)
         IC    3,0(2,8)
         IC    2,0(2,15)
         STC   2,80(,13)
         CLM   3,1,80(13)
         BH    @@L2208
         CLM   2,1,=XL1'04'
         BH    @@L2208
         MVC   88(4,13),104(13)
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         ST    3,92(13)
         MVC   96(4,13),4(6)
         MVC   100(4,13),4(7)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         SLR   2,2
         IC    2,2(9)
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         B     @@L2181
@@L2194  EQU   *
         L     2,104(13)
         A     2,=F'-75'
         LR    15,9
         LA    3,1(0,0)
         CLR   2,3
         BNH   @@L2188
@@L2181  EQU   *
* Function apply_distributive_law epilogue
         PDPEPIL
* Function apply_distributive_law literal pool
         DS    0F
         LTORG
* Function apply_distributive_law page table
         DS    0F
@@PGT42  EQU   *
         DC    A(@@PG42)
         DS    0F
* S-func simplify_and_const_int prologue
@@78     PDPPRLG CINDEX=43,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN43
         LTORG
@@FEN43  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG43   EQU   *
         LR    11,1
         L     10,=A(@@PGT43)
* Function simplify_and_const_int code
         L     6,0(11)
         L     8,4(11)
         L     5,12(11)
         MVC   88(4,13),8(11)
         ST    8,92(13)
         ST    5,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         LR    4,15
         LH    2,0(15)
         CLM   2,3,=H'49'
         BE    @@L2217
         CLM   2,3,=H'54'
         BE    @@L2238
         ST    15,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    9,15
         LR    3,8
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         N     9,0(3,2)
         NR    5,9
         LTR   5,5
         BNE   @@L2220
         L     2,=V(CIRTX)
         L     15,256(2)
         B     @@L2217
@@L2220  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'77'
         BE    @@L2239
@@L2221  EQU   *
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-84'
         CLM   2,3,=H'1'
         BNH   @@L2240
         CLM   3,3,=H'75'
         BE    @@L2241
@@L2223  EQU   *
         LTR   6,6
         BE    @@L2227
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L2242
@@L2227  EQU   *
         ST    8,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    4,15
@@L2228  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'49'
         BE    @@L2243
         CLR   5,9
         BE    @@L2244
         ST    5,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         LR    5,15
         LTR   6,6
         BE    @@L2234
         LH    2,0(6)
         CLM   2,3,=H'83'
         BE    @@L2245
@@L2234  EQU   *
         MVC   88(4,13),=F'0'
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    8,92(13)
         ST    4,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    6,15
@@L2232  EQU   *
         LR    15,6
         B     @@L2217
@@L2245  EQU   *
         SLR   2,2
         IC    2,2(6)
         CLR   2,8
         BNE   @@L2234
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L2246
@@L2237  EQU   *
         MVC   88(4,13),=F'0'
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         A     6,=F'8'
         ST    6,88(13)
         A     6,=F'-8'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
@@L2236  EQU   *
         A     6,=F'4'
         ST    6,88(13)
         A     6,=F'-4'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L2232
@@L2246  EQU   *
         L     2,4(3)
         CLR   2,15
         BNE   @@L2237
         B     @@L2236
@@L2244  EQU   *
         LR    6,4
         B     @@L2232
@@L2243  EQU   *
         LR    15,6
         LTR   6,6
         BNE   @@L2217
         LR    15,4
         B     @@L2217
@@L2242  EQU   *
         SLR   2,2
         IC    2,2(3)
         CLR   2,8
         BNE   @@L2227
         L     2,4(3)
         CLR   2,4
         BNE   @@L2227
         LR    4,3
         B     @@L2228
@@L2241  EQU   *
         A     5,=F'1'
         ST    5,88(13)
         BCTR  5,0
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L2223
         MVC   88(4,13),=F'0'
         ST    8,92(13)
         MVC   96(4,13),4(4)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         LR    7,15
         MVC   88(4,13),=F'0'
         ST    8,92(13)
         MVC   96(4,13),8(4)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         LR    3,15
         L     2,=V(CIRTX)
         L     2,256(2)
         CLR   7,2
         BE    @@L2217
         LR    15,7
         CLR   3,2
         BNE   @@L2223
         B     @@L2217
@@L2240  EQU   *
         MVC   88(4,13),=F'0'
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         MVC   96(4,13),4(4)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'0'
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         MVC   96(4,13),8(4)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@72)
         BALR  14,15
         ST    8,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         B     @@L2217
@@L2239  EQU   *
         MVC   88(4,13),4(4)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BNE   @@L2221
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L2221
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'87'
         ST    8,96(13)
         MVC   100(4,13),4(4)
         ST    15,104(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         B     @@L2217
@@L2238  EQU   *
         N     5,4(15)
         ST    5,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
@@L2217  EQU   *
* Function simplify_and_const_int epilogue
         PDPEPIL
* Function simplify_and_const_int literal pool
         DS    0F
         LTORG
* Function simplify_and_const_int page table
         DS    0F
@@PGT43  EQU   *
         DC    A(@@PG43)
         DS    0F
* S-func nonzero_bits prologue
@@43     PDPPRLG CINDEX=44,FRAME=144,BASER=12,ENTRY=NO
         B     @@FEN44
         LTORG
@@FEN44  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG44   EQU   *
         LR    11,1
         L     10,=A(@@PGT44)
* Function nonzero_bits code
         SLR   2,2
         SLR   3,3
         ST    2,120(13)
         ST    3,4+120(13)
         ST    2,128(13)
         ST    3,4+128(13)
         L     8,0(11)
         L     7,4(11)
         LR    3,7
         MH    3,=H'4'
         ST    3,136(13)
         L     4,=V(MODE@MAS)
         L     9,0(3,4)
         LR    2,7
         MH    2,=H'2'
         L     6,=V(MODE@BIT)
         LH    2,0(2,6)
         N     2,=XL4'0000FFFF'
         ST    2,108(13)
         L     15,=V(MODE@CLA)
         L     5,0(8)
         SLR   4,4
         IC    4,2(8)
         LR    6,4
         MH    6,=H'4'
         L     2,0(6,15)
         LA    3,2(0,0)
         CLR   2,3
         BE    @@L2254
         LA    3,6(0,0)
         CLR   2,3
         BE    @@L2254
         LA    3,8(0,0)
         CLR   2,3
         BE    @@L2254
         L     3,136(13)
         L     2,0(3,15)
         LA    15,2(0,0)
         CLR   2,15
         BE    @@L2254
         LA    3,6(0,0)
         CLR   2,3
         BE    @@L2254
         LA    15,8(0,0)
         CLR   2,15
         BE    @@L2254
         LR    2,4
         MH    2,=H'2'
         L     15,=V(MODE@BIT)
         LH    3,0(2,15)
         LR    2,3
         N     2,=XL4'0000FFFF'
         CL    2,108(13)
         BNH   @@L2250
         LR    7,4
         L     15,=V(MODE@MAS)
         L     9,0(6,15)
         ST    2,108(13)
@@L2250  EQU   *
         LR    15,9
         L     2,108(13)
         LA    6,32(0,0)
         CLR   2,6
         L     14,=A(@@L2247)
         BHR   14
         IC    2,2(8)
         CLM   2,1,=XL1'00'
         BE    @@L2252
         CLR   4,7
         BE    @@L2252
         CLM   3,3,=H'32'
         BH    @@L2252
         LR    2,7
         MH    2,=H'2'
         L     15,=V(MODE@BIT)
         LH    2,0(2,15)
         STH   3,80(,13)
         CLM   2,3,80(13)
         L     14,=A(@@L2373)
         BHR   14
@@L2252  EQU   *
         LR    4,5
         SRL   4,16
         ST    4,104(13)
         LR    3,4
         A     3,=F'-54'
         LA    6,79(0,0)
         CLR   3,6
         BH    @@L2254
         MH    3,=H'4'
         L     2,=A(@@L2366)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2366  EQU   *
         DC    A(@@L2268)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2255)
         DC    A(@@L2254)
         DC    A(@@L2340)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2364)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2312)
         DC    A(@@L2312)
         DC    A(@@L2289)
         DC    A(@@L2312)
         DC    A(@@L2312)
         DC    A(@@L2312)
         DC    A(@@L2312)
         DC    A(@@L2312)
         DC    A(@@L2298)
         DC    A(@@L2304)
         DC    A(@@L2304)
         DC    A(@@L2254)
         DC    A(@@L2347)
         DC    A(@@L2347)
         DC    A(@@L2347)
         DC    A(@@L2347)
         DC    A(@@L2254)
         DC    A(@@L2304)
         DC    A(@@L2304)
         DC    A(@@L2304)
         DC    A(@@L2304)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2287)
         DC    A(@@L2295)
         DC    A(@@L2293)
         DC    A(@@L2292)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2254)
         DC    A(@@L2363)
         DC    A(@@L2254)
         DC    A(@@L2338)
@@L2255  EQU   *
         L     2,=V(GLBRTL)
         CL    8,8(2)
         BE    @@L2257
         CL    8,12(2)
         BE    @@L2257
         CL    8,16(2)
         BE    @@L2257
@@L2256  EQU   *
         L     5,4(8)
         L     2,=A(@@12)
         L     2,0(2)
         LR    4,5
         MH    4,=H'4'
         L     2,0(4,2)
         LTR   2,2
         BE    @@L2258
         L     2,=A(@@16)
         L     2,0(2)
         L     2,0(4,2)
         CLR   2,7
         BE    @@L2259
         L     3,=V(MODE@CLA)
         MH    2,=H'4'
         L     2,0(2,3)
         LA    15,1(0,0)
         CLR   2,15
         BE    @@L2374
@@L2258  EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         LTR   15,15
         BE    @@L2263
         ST    15,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
@@L2266  EQU   *
         NR    15,9
         L     14,=A(@@L2247)
         BR    14
@@L2263  EQU   *
         L     2,=A(@@23)
         L     2,0(2)
         LTR   2,2
         BE    @@L2254
         L     2,=A(@@8)
         L     3,0(2)
         L     2,4(8)
         SLL   2,2
         L     2,0(2,3)
         LTR   2,2
         BE    @@L2254
         LR    15,2
         SLR   4,4
         IC    4,2(8)
         LR    2,4
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CL    2,108(13)
         BNL   @@L2266
         L     2,=V(MODE@MAS)
         MH    7,=H'4'
         MH    4,=H'4'
         L     7,0(7,2)
         X     7,0(4,2)
         OR    15,7
         B     @@L2266
@@L2254  EQU   *
         L     12,0(,10)
         LR    15,9
         L     14,=A(@@L2247)
         BR    14
@@L2374  EQU   *
         LR    2,7
         MH    2,=H'4'
         L     2,0(2,3)
         CLR   2,15
         BNE   @@L2258
@@L2259  EQU   *
         L     2,=A(@@14)
         L     2,0(2)
         L     3,0(4,2)
         L     2,=A(@@24)
         CL    3,0(2)
         BE    @@L2260
         LA    2,19(0,0)
         CLR   5,2
         BNH   @@L2258
         L     2,=V(REG@N@IN)
         A     4,0(2)
         L     2,16(4)
         L     2,12(2)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L2258
         L     2,=V(BBINFO)
         L     2,0(2)
         L     2,16(2)
         MVC   88(4,13),32(2)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   @@L2258
@@L2260  EQU   *
         L     2,=A(@@11)
         L     3,0(2)
         L     2,4(8)
         SLL   2,2
         L     4,0(2,3)
         L     3,4(4)
         L     2,=A(@@21)
         C     3,0(2)
         BH    @@L2375
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         L     3,0(3,2)
         L     2,=A(@@29)
         C     3,0(2)
         BNL   @@L2258
@@L2262  EQU   *
         L     2,=A(@@17)
         L     3,0(2)
         L     2,4(8)
         SLL   2,2
         L     15,0(2,3)
         B     @@L2266
@@L2375  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         L     2,=A(@@29)
         C     15,0(2)
         BL    @@L2262
         B     @@L2258
@@L2257  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,40(2)
         L     2,4(8)
         IC    2,0(2,3)
         CLM   2,1,=XL1'00'
         BE    @@L2256
         N     2,=XL4'000000FF'
         SRL   2,3
         N     2,=XL4'000000FF'
         LCR   2,2
         NR    9,2
         B     @@L2256
@@L2268  EQU   *
         L     15,4(8)
         L     14,=A(@@L2247)
         BR    14
@@L2340  EQU   *
         L     3,0(8)
         LR    2,3
         N     2,=F'40'
         LA    15,40(0,0)
         CLR   2,15
         BE    @@L2376
@@L2341  EQU   *
         L     4,4(8)
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L2254
         ST    4,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    9,15
         L     3,=V(MODE@SIZ)
         SLR   5,5
         IC    5,2(8)
         L     2,4(8)
         SLR   4,4
         IC    4,2(2)
         IC    2,0(3,5)
         IC    3,0(3,4)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BNH   @@L2254
         L     3,=V(MODE@MAS)
         MH    5,=H'4'
         MH    4,=H'4'
         L     2,0(4,3)
         X     2,=F'-1'
         N     2,0(5,3)
@@L2370  EQU   *
         OR    9,2
         B     @@L2254
@@L2376  EQU   *
         LR    2,3
         SRL   2,8
         N     2,=F'255'
         LR    3,2
         MH    3,=H'4'
         MVC   88(4,13),4(8)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    9,15
         L     2,=V(MODE@MAS)
         N     9,0(3,2)
         B     @@L2341
@@L2364  EQU   *
         MVC   88(4,13),8(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),12(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         OR    2,15
@@L2369  EQU   *
         L     12,0(,10)
         NR    9,2
         B     @@L2254
@@L2289  EQU   *
         LR    4,5
         SRL   4,8
         N     4,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,4)
         CL    15,108(13)
         BNL   @@L2254
         L     3,=V(MODE@MAS)
         MH    7,=H'4'
         MH    4,=H'4'
         L     2,0(4,3)
         X     2,=F'-1'
         N     2,0(7,3)
         B     @@L2370
@@L2312  EQU   *
         MVC   88(4,13),4(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),8(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    3,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         LR    7,15
         A     7,=F'1'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         LR    5,15
         A     5,=F'1'
         LCR   2,4
         NR    2,4
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         LR    8,15
         LCR   2,3
         NR    2,3
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         ST    15,112(13)
         L     6,108(13)
         BCTR  6,0
         LA    2,1(0,0)
         SLL   2,0(6)
         A     6,=F'1'
         ST    6,108(13)
         LR    15,4
         NR    15,2
         NR    3,2
         ST    3,116(13)
         LR    4,6
         SLR   6,6
         L     3,104(13)
         A     3,=F'-75'
         LA    2,7(0,0)
         CLR   3,2
         BH    @@L2334
         MH    3,=H'4'
         L     2,=A(@@L2335)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2335  EQU   *
         DC    A(@@L2314)
         DC    A(@@L2332)
         DC    A(@@L2334)
         DC    A(@@L2319)
         DC    A(@@L2320)
         DC    A(@@L2325)
         DC    A(@@L2323)
         DC    A(@@L2330)
@@L2314  EQU   *
         LR    15,5
         CR    5,7
         BNL   @@L2315
         LR    15,7
@@L2315  EQU   *
         LR    4,15
         A     4,=F'1'
@@L2332  EQU   *
         L     6,112(13)
         CR    6,8
         BNH   @@L2313
         LR    6,8
@@L2313  EQU   *
         CL    4,108(13)
         BNL   @@L2336
         LA    2,1(0,0)
         SLL   2,0(4)
         BCTR  2,0
         NR    9,2
@@L2336  EQU   *
         LTR   6,6
         BNH   @@L2254
         L     2,=F'-1'
         SLL   2,0(6)
         B     @@L2369
@@L2334  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'8261'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L2313
@@L2319  EQU   *
         LR    4,7
         AR    4,5
         L     6,112(13)
         AR    6,8
         B     @@L2313
@@L2320  EQU   *
         LTR   5,5
         BE    @@L2313
         LTR   15,15
         BNE   @@L2313
         L     3,116(13)
         LTR   3,3
         BNE   @@L2313
@@L2368  EQU   *
         LR    4,7
         B     @@L2313
@@L2325  EQU   *
         LTR   5,5
         BE    @@L2313
         LTR   15,15
         BNE   @@L2332
         L     6,116(13)
         LTR   6,6
         BNE   @@L2332
@@L2372  EQU   *
         LR    4,5
         CR    5,7
         BNH   @@L2332
         LR    4,7
         B     @@L2332
@@L2323  EQU   *
         LTR   5,5
         BE    @@L2313
         B     @@L2368
@@L2330  EQU   *
         LTR   5,5
         BE    @@L2313
         B     @@L2372
@@L2298  EQU   *
         MVC   88(4,13),4(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),8(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    2,15
         B     @@L2369
@@L2347  EQU   *
         L     3,8(8)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L2254
         L     6,4(3)
         LTR   6,6
         BL    @@L2254
         LA    2,31(0,0)
         CR    6,2
         BH    @@L2254
         LR    3,5
         SRL   3,8
         N     3,=F'255'
         LR    4,3
         MH    4,=H'2'
         L     2,=V(MODE@BIT)
         LH    5,0(4,2)
         N     5,=XL4'0000FFFF'
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     3,0(3,2)
         ST    3,136(13)
         MVC   88(4,13),4(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    4,3
         NR    4,15
         SLR   7,7
         L     3,108(13)
         CLR   3,5
         BNH   @@L2349
         LR    7,15
         NR    7,9
         L     2,136(13)
         X     2,=F'-1'
         NR    7,2
@@L2349  EQU   *
         L     15,104(13)
         LA    8,90(0,0)
         CLR   15,8
         BE    @@L2377
         L     3,104(13)
         LA    2,89(0,0)
         CLR   3,2
         BE    @@L2378
         L     15,104(13)
         LA    8,87(0,0)
         CLR   15,8
         BE    @@L2379
         ST    6,120(13)
         CLR   5,6
         BH    @@L2359
         LA    2,1(0,0)
         CLR   5,2
         BE    @@L2357
         L     2,120(13)
         L     3,4+120(13)
         SRDL  2,32
         DR    2,5
         ST    2,120(13)
         ST    3,4+120(13)
@@L2359  EQU   *
         LR    8,4
         L     3,120(13)
         SLL   8,0(3)
         ST    6,128(13)
         CLR   5,6
         BH    @@L2362
         LA    6,1(0,0)
         CLR   5,6
         BE    @@L2360
         L     2,128(13)
         L     3,4+128(13)
         SRDL  2,32
         DR    2,5
         ST    2,128(13)
         ST    3,4+128(13)
@@L2362  EQU   *
         S     5,128(13)
         SRL   4,0(5)
         OR    4,8
         N     4,136(13)
@@L2351  EQU   *
         OR    7,4
         NR    9,7
         B     @@L2254
@@L2360  EQU   *
         MVC   128(4,13),=F'0'
         B     @@L2362
@@L2357  EQU   *
         MVC   120(4,13),=F'0'
         B     @@L2359
@@L2379  EQU   *
         SLL   4,0(6)
         B     @@L2351
@@L2378  EQU   *
         SRL   4,0(6)
         LR    3,5
         SR    3,6
         BCTR  3,0
         LA    2,1(0,0)
         SLL   2,0(3)
         A     3,=F'1'
         NR    2,4
         LTR   2,2
         BE    @@L2351
         LA    2,1(0,0)
         SLL   2,0(6)
         BCTR  2,0
         SLL   2,0(3)
         OR    4,2
         B     @@L2351
@@L2377  EQU   *
         SRL   4,0(6)
         B     @@L2351
@@L2304  EQU   *
         MVC   88(4,13),4(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    3,15
         LR    2,9
         NR    2,15
         CLR   2,9
         BE    @@L2254
         MVC   88(4,13),8(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         OR    3,15
         NR    9,3
         B     @@L2254
@@L2287  EQU   *
         MH    7,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(7,2)
         LA    4,1(0,0)
         CLR   2,4
         BNE   @@L2254
         L     6,108(13)
         LA    8,32(0,0)
         CLR   6,8
         BH    @@L2254
         LR    9,2
         B     @@L2254
@@L2295  EQU   *
         MVC   88(4,13),4(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     3,4(8)
         IC    2,2(3)
         CLM   2,1,=XL1'00'
         BE    @@L2296
         L     5,=V(MODE@MAS)
         SLR   4,4
         IC    4,2(3)
         LR    3,4
         LR    2,4
         MH    2,=H'4'
         L     4,0(2,5)
         NR    15,4
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LA    2,1(0,0)
         SLL   2,0(3)
         NR    2,15
         LTR   2,2
         BE    @@L2296
         MH    7,=H'4'
         X     4,=F'-1'
         N     4,0(7,5)
         OR    15,4
@@L2296  EQU   *
         NR    9,15
         B     @@L2254
@@L2293  EQU   *
         MVC   88(4,13),4(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    9,15
         L     3,4(8)
         IC    2,2(3)
         CLM   2,1,=XL1'00'
         BE    @@L2254
         SLR   2,2
         IC    2,2(3)
         LR    3,2
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         N     9,0(3,2)
         B     @@L2254
@@L2292  EQU   *
         MVC   88(4,13),4(8)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         MH    7,=H'4'
         L     2,=V(MODE@MAS)
         N     15,0(7,2)
         B     @@L2296
@@L2363  EQU   *
         MVC   88(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         A     15,=F'1'
         LA    9,1(0,0)
         SLL   9,0(15)
         BCTR  9,0
         B     @@L2254
@@L2338  EQU   *
         L     3,8(8)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L2254
         L     3,4(3)
         LA    8,31(0,0)
         CR    3,8
         BH    @@L2254
         LA    2,1(0,0)
         SLL   2,0(3)
         BCTR  2,0
         B     @@L2369
@@L2373  EQU   *
         ST    8,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    15,9
         MH    7,=H'4'
         SLR   2,2
         IC    2,2(8)
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     2,0(2,3)
         X     2,=F'-1'
         N     2,0(7,3)
         OR    15,2
@@L2247  EQU   *
* Function nonzero_bits epilogue
         PDPEPIL
* Function nonzero_bits literal pool
         DS    0F
         LTORG
* Function nonzero_bits page table
         DS    0F
@@PGT44  EQU   *
         DC    A(@@PG44)
         DS    0F
* S-func num_sign_bit_copies prologue
@@44     PDPPRLG CINDEX=45,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN45
         LTORG
@@FEN45  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG45   EQU   *
         LR    11,1
         L     10,=A(@@PGT45)
* Function num_sign_bit_copies code
         L     6,0(11)
         L     7,4(11)
@@L2385  EQU   *
         L     12,0(,10)
         L     2,0(6)
         LR    3,2
         SRL   3,16
         ST    3,96(13)
         LTR   7,7
         BNE   @@L2381
         LR    7,2
         SRL   7,8
         N     7,=F'255'
@@L2381  EQU   *
         LTR   7,7
         L     14,=A(@@L2465)
         BER   14
         L     4,=V(MODE@CLA)
         LR    9,7
         MH    9,=H'4'
         L     3,0(9,4)
         LA    5,2(0,0)
         CLR   3,5
         L     14,=A(@@L2465)
         BER   14
         LA    5,6(0,0)
         CLR   3,5
         L     14,=A(@@L2465)
         BER   14
         LA    5,8(0,0)
         CLR   3,5
         L     14,=A(@@L2465)
         BER   14
         LR    3,2
         SRL   3,0(5)
         N     3,=F'255'
         LR    2,3
         MH    2,=H'4'
         L     2,0(2,4)
         LA    4,2(0,0)
         CLR   2,4
         L     14,=A(@@L2465)
         BER   14
         LA    5,6(0,0)
         CLR   2,5
         L     14,=A(@@L2465)
         BER   14
         LA    4,8(0,0)
         CLR   2,4
         L     14,=A(@@L2465)
         BER   14
         L     8,=V(MODE@BIT)
         LR    2,7
         MH    2,=H'2'
         LH    5,0(2,8)
         N     5,=XL4'0000FFFF'
         MH    3,=H'2'
         LH    4,0(3,8)
         N     4,=XL4'0000FFFF'
         CLR   5,4
         L     14,=A(@@L2507)
         BLR   14
         IC    2,2(6)
         CLM   2,1,=XL1'00'
         BE    @@L2387
         LA    3,1(0,0)
         CLR   5,4
         L     14,=A(@@L2380)
         BHR   14
@@L2387  EQU   *
         L     3,96(13)
         A     3,=F'-54'
         LA    2,78(0,0)
         CLR   3,2
         BH    @@L2388
         MH    3,=H'4'
         L     2,=A(@@L2491)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2491  EQU   *
         DC    A(@@L2397)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2389)
         DC    A(@@L2388)
         DC    A(@@L2401)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2467)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2437)
         DC    A(@@L2437)
         DC    A(@@L2422)
         DC    A(@@L2444)
         DC    A(@@L2454)
         DC    A(@@L2457)
         DC    A(@@L2448)
         DC    A(@@L2453)
         DC    A(@@L2434)
         DC    A(@@L2434)
         DC    A(@@L2434)
         DC    A(@@L2495)
         DC    A(@@L2463)
         DC    A(@@L2414)
         DC    A(@@L2460)
         DC    A(@@L2388)
         DC    A(@@L2414)
         DC    A(@@L2434)
         DC    A(@@L2434)
         DC    A(@@L2434)
         DC    A(@@L2434)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2486)
         DC    A(@@L2409)
         DC    A(@@L2388)
         DC    A(@@L2410)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2388)
         DC    A(@@L2406)
@@L2389  EQU   *
         L     8,4(6)
         L     2,=A(@@12)
         L     2,0(2)
         LR    4,8
         MH    4,=H'4'
         L     2,0(4,2)
         LTR   2,2
         BE    @@L2390
         L     2,=A(@@16)
         L     2,0(2)
         L     2,0(4,2)
         CLR   2,7
         BE    @@L2508
@@L2390  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         LTR   15,15
         BE    @@L2394
         LR    6,15
         B     @@L2385
@@L2394  EQU   *
         L     2,=A(@@23)
         L     2,0(2)
         LTR   2,2
         BE    @@L2388
         L     2,=A(@@9)
         L     3,0(2)
         L     2,4(6)
         IC    15,0(2,3)
         CLM   15,1,=XL1'00'
         BE    @@L2388
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         LR    3,15
         N     3,=XL4'000000FF'
         CLR   2,5
         L     14,=A(@@L2380)
         BER   14
@@L2388  EQU   *
         L     12,0(,10)
         LA    3,1(0,0)
         LA    4,32(0,0)
         CLR   5,4
         L     14,=A(@@L2380)
         BHR   14
         ST    6,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         BCTR  5,0
         LA    2,1(0,0)
         SLL   2,0(5)
         A     5,=F'1'
         NR    2,15
         LTR   2,2
         BE    @@L2498
@@L2493  EQU   *
         L     12,0(,10)
         LA    15,1(0,0)
@@L2494  EQU   *
         L     12,0(,10)
         LR    3,15
         L     14,=A(@@L2380)
         BR    14
@@L2498  EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         SR    5,15
         LR    15,5
         BCTR  15,0
         B     @@L2494
@@L2508  EQU   *
         L     2,=A(@@14)
         L     2,0(2)
         L     3,0(4,2)
         L     2,=A(@@24)
         CL    3,0(2)
         BE    @@L2391
         LA    3,19(0,0)
         CLR   8,3
         BNH   @@L2390
         L     2,=V(REG@N@IN)
         A     4,0(2)
         L     2,16(4)
         L     2,12(2)
         LA    4,1(0,0)
         CLR   2,4
         BNE   @@L2390
         L     2,=V(BBINFO)
         L     2,0(2)
         L     2,16(2)
         MVC   88(4,13),32(2)
         MVC   92(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   @@L2390
@@L2391  EQU   *
         L     2,=A(@@11)
         L     3,0(2)
         L     2,4(6)
         SLL   2,2
         L     4,0(2,3)
         L     3,4(4)
         L     2,=A(@@21)
         C     3,0(2)
         BH    @@L2509
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         L     3,0(3,2)
         L     2,=A(@@29)
         C     3,0(2)
         BNL   @@L2390
@@L2393  EQU   *
         L     2,=A(@@18)
         L     3,0(2)
         L     2,4(6)
         SLR   5,5
         IC    5,0(2,3)
         LR    3,5
         L     14,=A(@@L2380)
         BR    14
@@L2509  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         L     2,=A(@@29)
         C     15,0(2)
         BL    @@L2393
         B     @@L2390
@@L2397  EQU   *
         L     2,=V(MODE@MAS)
         L     3,0(9,2)
         L     15,4(6)
         NR    15,3
         LA    2,32(0,0)
         CLR   5,2
         BH    @@L2487
         BCTR  5,0
         LA    2,1(0,0)
         SLL   2,0(5)
         A     5,=F'1'
         NR    2,15
         LTR   2,2
         BE    @@L2487
         X     15,=F'-1'
         NR    15,3
@@L2487  EQU   *
         L     12,0(,10)
         LTR   15,15
         BNE   @@L2498
@@L2488  EQU   *
         L     12,0(,10)
         LR    15,5
         B     @@L2494
@@L2401  EQU   *
         L     2,0(6)
         N     2,=F'40'
         LA    3,8(0,0)
         CLR   2,3
         BE    @@L2510
         L     4,=V(MODE@BIT)
         L     3,4(6)
         SLR   2,2
         IC    2,2(3)
         MH    2,=H'2'
         LH    2,0(2,4)
         N     2,=XL4'0000FFFF'
         CLR   5,2
         BH    @@L2388
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         MH    2,=H'2'
         LH    2,0(2,4)
@@L2505  EQU   *
         L     12,0(,10)
         N     2,=XL4'0000FFFF'
         SR    2,5
         SR    15,2
         LA    4,1(0,0)
         CR    15,4
         BNL   @@L2494
         B     @@L2493
@@L2510  EQU   *
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         SR    5,2
         LR    2,5
         A     2,=F'1'
         CR    15,2
         BNL   @@L2494
         LR    15,2
         B     @@L2494
@@L2467  EQU   *
         MVC   88(4,13),8(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),12(6)
@@L2503  EQU   *
         L     12,0(,10)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         CR    15,4
         BNH   @@L2494
         LR    15,4
         B     @@L2494
@@L2437  EQU   *
         L     2,96(13)
         LA    4,75(0,0)
         CLR   2,4
         BE    @@L2511
@@L2438  EQU   *
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),8(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         CR    15,4
         BNH   @@L2442
         LR    15,4
@@L2442  EQU   *
         LR    3,15
         BCTR  3,0
         LA    5,1(0,0)
         CR    3,5
         L     14,=A(@@L2380)
         BNLR  14
@@L2465  EQU   *
         LA    3,1(0,0)
         L     14,=A(@@L2380)
         BR    14
@@L2511  EQU   *
         L     3,8(6)
         L     2,=V(CIRTX)
         CL    3,252(2)
         BNE   @@L2438
         LA    3,32(0,0)
         CLR   5,3
         BH    @@L2438
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         BCTR  5,0
         LA    2,1(0,0)
         SLL   2,0(5)
         A     5,=F'1'
         NR    2,15
         LTR   2,2
         BNE   @@L2438
         LA    4,1(0,0)
         CLR   15,4
         BH    @@L2498
         B     @@L2488
@@L2422  EQU   *
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    4,15
         LA    2,32(0,0)
         CLR   5,2
         BNH   @@L2423
         BCTR  15,0
         LA    3,1(0,0)
         CR    4,3
         BH    @@L2494
         B     @@L2493
@@L2423  EQU   *
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    3,5
         LA    2,1(0,0)
         CR    15,2
         L     14,=A(@@L2380)
         BER   14
         LA    3,1(0,0)
         CR    4,3
         BNH   @@L2461
         BCTR  5,0
         LR    2,3
         SLL   2,0(5)
         NR    2,15
         LTR   2,2
         BE    @@L2461
         BCTR  4,0
@@L2461  EQU   *
         LR    3,4
         L     14,=A(@@L2380)
         BR    14
@@L2444  EQU   *
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),8(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    2,5
         SR    2,15
         SR    3,2
         BNH   @@L2445
         LA    2,32(0,0)
         CLR   5,2
         BNH   @@L2512
@@L2446  EQU   *
         BCTR  3,0
@@L2445  EQU   *
         LR    15,3
         LA    3,1(0,0)
         CR    15,3
         BNL   @@L2494
         B     @@L2493
@@L2512  EQU   *
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         BCTR  5,0
         LA    2,1(0,0)
         SLL   2,0(5)
         NR    15,2
         LTR   15,15
         BE    @@L2445
         MVC   88(4,13),8(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    2,15
         LTR   2,2
         BE    @@L2445
         B     @@L2446
@@L2454  EQU   *
         MVC   88(4,13),4(6)
@@L2506  EQU   *
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    3,15
         LA    2,1(0,0)
         CR    15,2
         L     14,=A(@@L2380)
         BNHR  14
         LA    4,32(0,0)
         CLR   5,4
         BNH   @@L2513
@@L2459  EQU   *
         BCTR  3,0
         L     14,=A(@@L2380)
         BR    14
@@L2513  EQU   *
         MVC   88(4,13),8(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         BCTR  5,0
         SLL   2,0(5)
         NR    2,15
         LTR   2,2
         L     14,=A(@@L2380)
         BER   14
         B     @@L2459
@@L2457  EQU   *
         MVC   88(4,13),8(6)
         B     @@L2506
@@L2448  EQU   *
         LA    3,1(0,0)
         LA    4,32(0,0)
         CLR   5,4
         L     14,=A(@@L2380)
         BHR   14
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         BCTR  5,0
         LA    2,1(0,0)
         SLL   2,0(5)
         NR    2,15
         LA    3,1(0,0)
         LTR   2,2
         L     14,=A(@@L2380)
         BNER  14
@@L2495  EQU   *
         L     6,4(6)
         B     @@L2385
@@L2453  EQU   *
         L     6,8(6)
         B     @@L2385
@@L2463  EQU   *
         L     3,8(6)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L2465
         L     2,4(3)
         LTR   2,2
         BL    @@L2465
         CR    2,5
         BNL   @@L2465
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         L     2,8(6)
         S     15,4(2)
@@L2504  EQU   *
         L     12,0(,10)
         LA    5,1(0,0)
         CR    15,5
         BNL   @@L2494
         B     @@L2488
@@L2460  EQU   *
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    4,15
         L     3,8(6)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L2461
         L     2,4(3)
         LTR   2,2
         BNH   @@L2461
         AR    4,2
         CR    4,5
         BNH   @@L2461
         LR    4,5
         B     @@L2461
@@L2414  EQU   *
         L     3,8(6)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L2388
         L     2,4(3)
         LTR   2,2
         BL    @@L2388
         CR    2,5
         BNL   @@L2388
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    4,15
         L     3,96(13)
         LA    2,88(0,0)
         CR    3,2
         BE    @@L2514
         L     2,8(6)
         LR    3,5
         S     3,4(2)
         LR    2,3
         LR    3,15
         SR    3,2
@@L2496  EQU   *
         LTR   3,3
         BNH   @@L2493
         L     3,96(13)
         LA    2,88(0,0)
         CLR   3,2
         BE    @@L2515
         L     2,8(6)
         S     5,4(2)
         LR    15,4
         SR    15,5
         B     @@L2494
@@L2515  EQU   *
         L     2,8(6)
         LR    15,4
         S     15,4(2)
         B     @@L2494
@@L2514  EQU   *
         L     2,8(6)
         LR    3,15
         S     3,4(2)
         B     @@L2496
@@L2434  EQU   *
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),8(6)
         B     @@L2503
@@L2486  EQU   *
         LA    15,1(0,0)
         LA    2,32(0,0)
         CLR   5,2
         BH    @@L2487
         BCTR  5,0
         L     2,=F'-2147483648'
         SLL   2,0(5)
         AR    5,15
         LTR   2,2
         BNL   @@L2487
         L     2,=V(MODE@MAS)
         L     15,0(9,2)
         N     15,=F'-2'
         B     @@L2487
@@L2409  EQU   *
         L     4,4(6)
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         SR    5,2
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    3,15
         AR    3,5
         B     @@L2380
@@L2410  EQU   *
         MVC   88(4,13),4(6)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         LR    2,3
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         B     @@L2505
@@L2406  EQU   *
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L2388
         LR    15,5
         S     15,4(3)
         B     @@L2504
@@L2507  EQU   *
         ST    6,88(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         LH    2,0(2,8)
         N     2,=XL4'0000FFFF'
         SR    2,5
         SR    15,2
         LA    5,1(0,0)
         CR    15,5
         BNL   @@L2494
         B     @@L2493
@@L2380  EQU   *
         LR    15,3
* Function num_sign_bit_copies epilogue
         PDPEPIL
* Function num_sign_bit_copies literal pool
         DS    0F
         LTORG
* Function num_sign_bit_copies page table
         DS    0F
@@PGT45  EQU   *
         DC    A(@@PG45)
         DS    0F
* X-func extended_count prologue
EXTENDED PDPPRLG CINDEX=46,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN46
         LTORG
@@FEN46  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG46   EQU   *
         LR    11,1
         L     10,=A(@@PGT46)
* Function extended_count code
         L     4,0(11)
         L     15,4(11)
         L     2,=A(@@23)
         L     2,0(2)
         LTR   2,2
         BE    @@L2516
         L     2,8(11)
         LTR   2,2
         BE    @@L2518
         LR    3,15
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         CLM   2,3,=H'32'
         BNH   @@L2523
         SLR   2,2
         B     @@L2516
@@L2523  EQU   *
         N     2,=XL4'0000FFFF'
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         SR    2,15
@@L2522  EQU   *
         BCTR  2,0
         B     @@L2516
@@L2518  EQU   *
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    2,15
         B     @@L2522
@@L2516  EQU   *
         LR    15,2
* Function extended_count epilogue
         PDPEPIL
* Function extended_count literal pool
         DS    0F
         LTORG
* Function extended_count page table
         DS    0F
@@PGT46  EQU   *
         DC    A(@@PG46)
         DS    0F
* S-func merge_outer_ops prologue
@@88     PDPPRLG CINDEX=47,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN47
         LTORG
@@FEN47  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG47   EQU   *
         LR    11,1
         L     10,=A(@@PGT47)
* Function merge_outer_ops code
         L     7,4(11)
         L     3,8(11)
         L     9,16(11)
         L     8,20(11)
         L     2,0(11)
         L     4,0(2)
         LR    6,9
         MH    6,=H'4'
         L     2,=V(MODE@MAS)
         L     2,0(6,2)
         L     15,0(7)
         NR    15,2
         L     5,12(11)
         NR    5,2
         LA    2,83(0,0)
         CLR   4,2
         BE    @@L2568
@@L2525  EQU   *
         LA    2,1(0,0)
         CLR   3,2
         BE    @@L2567
         LA    2,47(0,0)
         CLR   4,2
         BE    @@L2567
         LA    2,1(0,0)
         CLR   4,2
         BE    @@L2569
         CLR   4,3
         BE    @@L2570
         LA    2,75(0,0)
         CLR   4,2
         BE    @@L2542
         CLR   3,2
         BE    @@L2542
         LA    2,77(0,0)
         CLR   4,2
         BE    @@L2542
         CLR   3,2
         BE    @@L2542
         SLR   2,2
         CLR   15,5
         BNE   @@L2524
         LA    2,84(0,0)
         CLR   4,2
         BE    @@L2547
         BH    @@L2558
         LA    2,83(0,0)
         CLR   4,2
         BE    @@L2553
@@L2528  EQU   *
         L     2,=V(MODE@MAS)
         N     15,0(6,2)
         LTR   15,15
         BNE   @@L2559
         LR    2,4
         A     2,=F'-84'
         LA    3,1(0,0)
         CLR   2,3
         BNH   @@L2566
         LA    2,75(0,0)
         CLR   4,2
         BE    @@L2566
@@L2559  EQU   *
         LTR   15,15
         BNE   @@L2562
         LA    3,83(0,0)
         CLR   4,3
         BE    @@L2571
@@L2562  EQU   *
         L     2,=V(MODE@MAS)
         CL    15,0(6,2)
         BE    @@L2572
@@L2561  EQU   *
         ST    15,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         L     3,0(11)
         ST    4,0(3)
         ST    15,0(7)
@@L2567  EQU   *
         LA    2,1(0,0)
         B     @@L2524
@@L2572  EQU   *
         LA    2,83(0,0)
         CLR   4,2
         BNE   @@L2561
@@L2566  EQU   *
         LA    4,1(0,0)
         B     @@L2561
@@L2571  EQU   *
         LA    4,47(0,0)
         B     @@L2561
@@L2553  EQU   *
         LA    2,84(0,0)
         CLR   3,2
         BE    @@L2565
@@L2554  EQU   *
         MVC   0(4,8),=F'1'
         B     @@L2528
@@L2565  EQU   *
         LA    4,47(0,0)
         B     @@L2528
@@L2558  EQU   *
         LA    2,85(0,0)
         CLR   4,2
         BNE   @@L2528
         LA    2,83(0,0)
         LR    4,3
         CLR   3,2
         BE    @@L2554
         LA    4,83(0,0)
         LR    3,15
         X     3,=F'-1'
         ST    3,0(7)
         B     @@L2528
@@L2547  EQU   *
         LA    2,83(0,0)
         CLR   3,2
         BNE   @@L2528
         B     @@L2565
@@L2542  EQU   *
         SLR   2,2
         B     @@L2524
@@L2570  EQU   *
         LR    3,4
         A     3,=F'-75'
         LA    2,10(0,0)
         CLR   3,2
         BH    @@L2528
         MH    3,=H'4'
         L     2,=A(@@L2539)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2539  EQU   *
         DC    A(@@L2536)
         DC    A(@@L2528)
         DC    A(@@L2537)
         DC    A(@@L2528)
         DC    A(@@L2528)
         DC    A(@@L2528)
         DC    A(@@L2528)
         DC    A(@@L2528)
         DC    A(@@L2533)
         DC    A(@@L2534)
         DC    A(@@L2535)
@@L2533  EQU   *
         NR    15,5
         B     @@L2528
@@L2536  EQU   *
         AR    15,5
         B     @@L2528
@@L2537  EQU   *
         LA    4,1(0,0)
         B     @@L2528
@@L2534  EQU   *
         OR    15,5
         B     @@L2528
@@L2535  EQU   *
         XR    15,5
         B     @@L2528
@@L2569  EQU   *
         LR    4,3
         LR    15,5
         B     @@L2528
@@L2568  EQU   *
         NR    5,15
         B     @@L2525
@@L2524  EQU   *
         LR    15,2
* Function merge_outer_ops epilogue
         PDPEPIL
* Function merge_outer_ops literal pool
         DS    0F
         LTORG
* Function merge_outer_ops page table
         DS    0F
@@PGT47  EQU   *
         DC    A(@@PG47)
         DS    0F
* S-func simplify_shift_const prologue
@@69     PDPPRLG CINDEX=48,FRAME=160,BASER=12,ENTRY=NO
         B     @@FEN48
         LTORG
@@FEN48  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG48   EQU   *
         LR    11,1
         L     10,=A(@@PGT48)
* Function simplify_shift_const code
         SLR   2,2
         SLR   3,3
         ST    2,144(13)
         ST    3,4+144(13)
         L     7,4(11)
         L     5,12(11)
         ST    7,124(13)
         MVC   132(4,13),8(11)
         L     2,=V(MODE@SIZ)
         L     3,8(11)
         SLR   4,4
         IC    4,0(2,3)
         A     4,=F'3'
         SRA   4,2
         ST    4,136(13)
         MVC   112(4,13),=F'1'
         SLR   2,2
         ST    2,116(13)
         ST    2,120(13)
         L     6,16(11)
         LTR   6,6
         BL    @@L2576
         LR    2,3
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CR    6,2
         BL    @@L2575
@@L2576  EQU   *
         L     15,0(11)
         LTR   15,15
         L     14,=A(@@L2573)
         BNER  14
         MVC   88(4,13),0(11)
         MVC   92(4,13),16(11)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),124(13)
         MVC   92(4,13),8(11)
         ST    5,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     14,=A(@@L2573)
         BR    14
@@L2575  EQU   *
         MVC   128(4,13),16(11)
         L     8,16(11)
         LTR   8,8
         BE    @@L2579
@@L2677  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'49'
         L     14,=A(@@L2701)
         BER   14
         L     2,120(13)
         LTR   2,2
         BNE   @@L2579
         LA    9,91(0,0)
         CLR   7,9
         L     14,=A(@@L2716)
         BER   14
@@L2583  EQU   *
         L     12,0(,10)
         LR    2,7
         A     2,=F'-88'
         L     4,132(13)
         LA    3,2(0,0)
         CLR   2,3
         BH    @@L2585
         L     4,8(11)
@@L2585  EQU   *
         LR    6,4
         MH    6,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(6,2)
         N     2,=XL4'0000FFFF'
         LR    3,2
         BCTR  3,0
         L     8,128(13)
         CLR   8,3
         BNH   @@L2586
         LA    9,89(0,0)
         CLR   7,9
         L     14,=A(@@L2717)
         BER   14
         LA    3,88(0,0)
         CLR   7,3
         BE    @@L2590
         LA    8,91(0,0)
         CLR   7,8
         L     14,=A(@@L2589)
         BNER  14
@@L2590  EQU   *
         MVC   144(4,13),128(13)
         CL    2,144(13)
         BH    @@L2593
         LA    9,1(0,0)
         CLR   2,9
         L     14,=A(@@L2591)
         BER   14
         L     8,144(13)
         L     9,4+144(13)
         SRDL  8,32
         DR    8,2
         ST    8,144(13)
         ST    9,4+144(13)
@@L2593  EQU   *
         L     12,0(,10)
         MVC   128(4,13),144(13)
@@L2586  EQU   *
         L     12,0(,10)
         LA    9,89(0,0)
         CLR   7,9
         L     14,=A(@@L2718)
         BER   14
@@L2595  EQU   *
         L     12,0(,10)
         LA    2,89(0,0)
         CLR   7,2
         L     14,=A(@@L2719)
         BER   14
@@L2596  EQU   *
         L     12,0(,10)
         LR    3,4
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         CLM   3,3,=H'32'
         BH    @@L2597
         LA    6,89(0,0)
         CLR   7,6
         L     14,=A(@@L2720)
         BER   14
@@L2597  EQU   *
         L     12,0(,10)
         L     15,0(5)
         LR    3,15
         SRL   3,16
         A     3,=F'-48'
         LA    8,85(0,0)
         CLR   3,8
         BH    @@L2579
         MH    3,=H'4'
         L     2,=A(@@L2676)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2676  EQU   *
         DC    A(@@L2608)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2614)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2604)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2664)
         DC    A(@@L2670)
         DC    A(@@L2661)
         DC    A(@@L2618)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2620)
         DC    A(@@L2579)
         DC    A(@@L2655)
         DC    A(@@L2655)
         DC    A(@@L2655)
         DC    A(@@L2652)
         DC    A(@@L2626)
         DC    A(@@L2626)
         DC    A(@@L2622)
         DC    A(@@L2626)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2659)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2602)
         DC    A(@@L2602)
         DC    A(@@L2673)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2579)
         DC    A(@@L2602)
         DC    A(@@L2602)
@@L2602  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         CLR   15,5
         BE    @@L2579
@@L2706  EQU   *
         L     12,0(,10)
         LR    5,15
@@L2578  EQU   *
         L     12,0(,10)
         L     6,128(13)
         LTR   6,6
         BNE   @@L2677
@@L2579  EQU   *
         L     12,0(,10)
         LR    2,7
         A     2,=F'-88'
         L     4,132(13)
         LA    8,2(0,0)
         CLR   2,8
         BH    @@L2679
         L     4,8(11)
@@L2679  EQU   *
         L     9,0(11)
         LTR   9,9
         BE    @@L2680
         LH    2,0(9)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'F2'
         BE    @@L2721
@@L2680  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    6,15
@@L2681  EQU   *
         L     2,0(11)
         LTR   2,2
         BE    @@L2682
         L     3,4(2)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L2722
@@L2682  EQU   *
         SLR   2,2
         IC    2,2(5)
         CLR   2,4
         BE    @@L2683
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    5,15
@@L2683  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'49'
         BE    @@L2723
         ST    7,88(13)
         ST    4,92(13)
         ST    5,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         ST    15,0(11)
         LTR   15,15
         BE    @@L2724
@@L2688  EQU   *
         L     2,112(13)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L2689
         L     6,0(11)
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         CLR   2,7
         BE    @@L2725
@@L2689  EQU   *
         L     9,124(13)
         LA    8,90(0,0)
         CLR   9,8
         BE    @@L2726
@@L2690  EQU   *
         MVC   88(4,13),8(11)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         ST    15,0(11)
         L     2,120(13)
         LTR   2,2
         BNE   @@L2727
@@L2691  EQU   *
         L     2,112(13)
         LA    6,1(0,0)
         CLR   2,6
         BE    @@L2692
         L     2,8(11)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'31'
         BNH   @@L2728
@@L2693  EQU   *
         L     3,112(13)
         LA    8,83(0,0)
         CLR   3,8
         BE    @@L2729
         LA    9,47(0,0)
         CLR   3,9
         BE    @@L2730
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'F1'
         BE    @@L2731
         MVC   88(4,13),=F'0'
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),112(13)
         MVC   92(4,13),8(11)
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
@@L2713  EQU   *
         ST    15,0(11)
@@L2692  EQU   *
         L     15,0(11)
         L     14,=A(@@L2573)
         BR    14
@@L2731  EQU   *
         ST    3,88(13)
         MVC   92(4,13),8(11)
         MVC   96(4,13),0(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         B     @@L2713
@@L2730  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         B     @@L2713
@@L2729  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),8(11)
         MVC   96(4,13),0(11)
         MVC   100(4,13),116(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         B     @@L2713
@@L2728  EQU   *
         MVC   88(4,13),116(13)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         ST    15,116(13)
         B     @@L2693
@@L2727  EQU   *
         MVC   88(4,13),=F'86'
         MVC   92(4,13),8(11)
         ST    15,96(13)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(SGENUNRY)
         BALR  14,15
         ST    15,0(11)
         B     @@L2691
@@L2726  EQU   *
         L     2,8(11)
         CLR   2,4
         BE    @@L2690
         MVC   88(4,13),=F'0'
         ST    4,92(13)
         MVC   96(4,13),0(11)
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     2,0(2,3)
         L     4,16(11)
         SRL   2,0(4)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         ST    15,0(11)
         B     @@L2690
@@L2725  EQU   *
         L     2,8(6)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L2689
         ST    6,88(13)
         ST    7,92(13)
         ST    4,96(13)
         MVC   100(4,13),4(6)
         L     2,8(6)
         MVC   104(4,13),4(2)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         ST    15,0(11)
         B     @@L2689
@@L2724  EQU   *
         ST    7,88(13)
         ST    4,92(13)
         ST    5,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,0(11)
         B     @@L2688
@@L2723  EQU   *
         L     15,0(11)
         LTR   15,15
         L     14,=A(@@L2573)
         BNER  14
@@L2701  EQU   *
         LR    15,5
         L     14,=A(@@L2573)
         BR    14
@@L2722  EQU   *
         SLR   2,2
         IC    2,2(3)
         CLR   2,4
         BNE   @@L2682
         L     2,4(3)
         CLR   2,5
         BNE   @@L2682
         LR    5,3
         B     @@L2683
@@L2721  EQU   *
         L     15,8(9)
         LH    2,0(15)
         CLM   2,3,=H'54'
         BNE   @@L2680
         L     2,4(15)
         LR    6,15
         CL    2,128(13)
         BNE   @@L2680
         B     @@L2681
@@L2608  EQU   *
         LR    2,7
         A     2,=F'-89'
         LA    3,1(0,0)
         CLR   2,3
         BH    @@L2579
         L     3,132(13)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         S     2,128(13)
         ST    2,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(MODFRSIZ)
         BALR  14,15
         LA    4,51(0,0)
         CLR   15,4
         BE    @@L2579
         L     3,4(5)
         SLR   2,2
         IC    2,2(3)
         CLR   15,2
         BNE   @@L2579
         LR    2,7
         X     2,=F'89'
         LPR   2,2
         LCR   2,2
         SRL   2,31
         A     2,=F'120'
         ST    2,88(13)
         MVC   92(4,13),132(13)
         ST    3,96(13)
@@L2709  EQU   *
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
@@L2710  EQU   *
         L     12,0(,10)
         LR    5,15
@@L2704  EQU   *
         L     12,0(,10)
         MVC   128(4,13),=F'0'
         B     @@L2578
@@L2614  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L2579
         L     4,=V(MODE@SIZ)
         L     6,4(5)
         SLR   8,8
         IC    8,2(6)
         SLR   2,2
         IC    2,2(5)
         IC    3,0(4,8)
         IC    2,0(4,2)
         STC   2,80(,13)
         CLM   3,1,80(13)
         BNH   @@L2579
         LR    2,3
         N     2,=XL4'000000FF'
         A     2,=F'3'
         SRA   2,2
         CL    2,136(13)
         BNE   @@L2579
         LR    5,6
         L     6,132(13)
         IC    4,0(4,6)
         STC   4,80(,13)
         CLM   3,1,80(13)
         BNH   @@L2578
         ST    8,132(13)
         B     @@L2578
@@L2604  EQU   *
         LR    2,7
         A     2,=F'-89'
         LA    9,1(0,0)
         CLR   2,9
         BH    @@L2579
         MVC   88(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(MODE@DEP)
         BALR  14,15
         LTR   15,15
         BNE   @@L2579
         L     4,0(5)
         SRL   4,4
         NR    4,9
         LTR   4,4
         BNE   @@L2579
         L     3,132(13)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         S     2,128(13)
         ST    2,88(13)
         ST    9,92(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=V(MODFRSIZ)
         BALR  14,15
         LA    2,51(0,0)
         CLR   15,2
         BE    @@L2579
         ST    5,88(13)
         ST    15,92(13)
         ST    4,96(13)
         ST    4,100(13)
         ST    9,104(13)
         LA    1,88(,13)
         L     15,=V(ADJADD)
         BALR  14,15
         LR    2,7
         X     2,=F'89'
         LPR   2,2
         LCR   2,2
         SRL   2,31
         A     2,=F'120'
         ST    2,88(13)
         MVC   92(4,13),132(13)
@@L2708  EQU   *
         L     12,0(,10)
         ST    15,96(13)
         B     @@L2709
@@L2664  EQU   *
         LA    8,90(0,0)
         CLR   7,8
         L     14,=A(@@L2732)
         BER   14
@@L2665  EQU   *
         L     12,0(,10)
         LR    3,7
         A     3,=F'-89'
         LA    4,1(0,0)
         CLR   3,4
         BH    @@L2666
         L     6,128(13)
         LA    8,31(0,0)
         CLR   6,8
         BNH   @@L2733
@@L2666  EQU   *
         LA    9,1(0,0)
         CLR   3,9
         BH    @@L2667
         L     2,128(13)
         LA    3,31(0,0)
         CLR   2,3
         BH    @@L2667
         L     2,8(11)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BNH   @@L2734
@@L2667  EQU   *
         LA    6,87(0,0)
         CLR   7,6
         BNE   @@L2579
         L     2,8(5)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L2579
         MVC   88(4,13),=F'0'
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),8(11)
         MVC   96(4,13),8(5)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LTR   15,15
         BE    @@L2579
         LH    2,0(15)
         CLM   2,3,=H'54'
         BNE   @@L2579
         LA    2,112(,13)
         ST    2,88(13)
         LA    2,116(,13)
         ST    2,92(13)
         MVC   96(4,13),=F'75'
         MVC   100(4,13),4(15)
@@L2714  EQU   *
         L     12,0(,10)
         MVC   104(4,13),8(11)
         LA    2,120(,13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@88)
         BALR  14,15
         LTR   15,15
         BE    @@L2579
@@L2703  EQU   *
         L     12,0(,10)
         L     5,4(5)
         B     @@L2578
@@L2734  EQU   *
         MVC   88(4,13),4(5)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     4,128(13)
         SRL   15,0(4)
         LTR   15,15
         BNE   @@L2667
         MVC   88(4,13),4(5)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),8(5)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    2,15
         LTR   2,2
         BNE   @@L2667
         L     5,8(5)
         B     @@L2578
@@L2733  EQU   *
         MVC   88(4,13),8(5)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         SRL   15,0(6)
         LTR   15,15
         BNE   @@L2666
         MVC   88(4,13),8(5)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(5)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    2,15
         LTR   2,2
         BE    @@L2703
         B     @@L2666
@@L2732  EQU   *
         L     3,8(11)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         BCTR  2,0
         L     9,128(13)
         CLR   9,2
         BNE   @@L2665
         L     3,8(5)
         L     2,=V(CIRTX)
         CL    3,252(2)
         BNE   @@L2665
         MVC   88(4,13),4(5)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BNE   @@L2665
         LA    2,112(,13)
         ST    2,88(13)
         LA    2,116(,13)
         ST    2,92(13)
         MVC   96(4,13),=F'85'
         ST    15,100(13)
         MVC   104(4,13),8(11)
         LA    2,120(,13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@88)
         BALR  14,15
         LTR   15,15
         BE    @@L2665
         MVC   128(4,13),=F'0'
         B     @@L2703
@@L2670  EQU   *
         L     4,4(5)
         LH    2,0(4)
         CLM   2,3,=H'89'
         BNE   @@L2579
         SRL   15,7
         N     15,=F'510'
         L     2,=V(MODE@BIT)
         LH    2,0(15,2)
         N     2,=XL4'0000FFFF'
         BCTR  2,0
         L     8,128(13)
         CLR   8,2
         BNE   @@L2579
         LR    2,7
         A     2,=F'-89'
         LA    9,1(0,0)
         CLR   2,9
         BH    @@L2579
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L2579
         L     2,4(3)
         CLR   2,8
         BNE   @@L2579
         MVC   88(4,13),4(4)
         MVC   92(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2579
         MVC   128(4,13),=F'0'
         MVC   88(4,13),=F'105'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         MVC   96(4,13),8(5)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    5,15
         LA    2,89(0,0)
         CLR   7,2
         BNE   @@L2578
@@L2705  EQU   *
         L     12,0(,10)
         MVC   88(4,13),=F'77'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         B     @@L2706
@@L2661  EQU   *
         LA    9,90(0,0)
         CLR   7,9
         BE    @@L2735
@@L2662  EQU   *
         LA    6,87(0,0)
         CLR   7,6
         BNE   @@L2579
         LA    2,112(,13)
         ST    2,88(13)
         LA    2,116(,13)
         ST    2,92(13)
         MVC   96(4,13),=F'77'
         MVC   100(4,13),=F'0'
         B     @@L2714
@@L2735  EQU   *
         L     3,8(11)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         BCTR  2,0
         L     3,128(13)
         CLR   3,2
         BNE   @@L2662
         MVC   88(4,13),4(5)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LA    4,1(0,0)
         CLR   15,4
         BNE   @@L2662
@@L2711  EQU   *
         L     12,0(,10)
         L     5,4(5)
         B     @@L2704
@@L2618  EQU   *
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L2579
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L2579
         L     2,8(5)
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'87'
@@L2715  EQU   *
         L     12,0(,10)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         MVC   96(4,13),4(5)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         B     @@L2706
@@L2620  EQU   *
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L2579
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L2579
         L     2,8(5)
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         B     @@PGE48
         DS    0F
         LTORG
         DS    0F
@@PGE48  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG49   EQU   *
         MVC   88(4,13),=F'90'
         L     14,=A(@@L2715)
         BR    14
@@L2655  EQU   *
         L     12,4(,10)
         LH    2,0(5)
         CLM   2,3,=H'84'
         BE    @@L2736
@@L2656  EQU   *
         L     12,4(,10)
         L     2,8(5)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L2658
         MVC   88(4,13),=F'0'
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),8(11)
         MVC   96(4,13),8(5)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LTR   15,15
         BE    @@L2658
         LH    2,0(15)
         CLM   2,3,=H'54'
         BNE   @@L2658
         LA    2,112(,13)
         ST    2,88(13)
         LA    2,116(,13)
         ST    2,92(13)
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         ST    2,96(13)
         MVC   100(4,13),4(15)
         MVC   104(4,13),8(11)
         LA    2,120(,13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@88)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2703)
         BNER  14
@@L2658  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         ST    4,96(13)
         MVC   100(4,13),4(5)
         MVC   104(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         ST    4,96(13)
         MVC   100(4,13),8(5)
         MVC   104(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         ST    4,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@72)
         BALR  14,15
         LR    5,15
@@L2712  EQU   *
         L     12,4(,10)
         MVC   128(4,13),=F'0'
         L     14,=A(@@L2579)
         BR    14
@@L2736  EQU   *
         L     12,4(,10)
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'75'
         BNE   @@L2656
         L     6,=V(CIRTX)
         L     2,8(3)
         CL    2,252(6)
         BNE   @@L2656
         LR    2,7
         A     2,=F'-89'
         LA    9,1(0,0)
         CLR   2,9
         BH    @@L2656
         SRL   15,7
         N     15,=F'510'
         L     2,=V(MODE@BIT)
         LH    2,0(15,2)
         N     2,=XL4'0000FFFF'
         BCTR  2,0
         L     8,128(13)
         CLR   8,2
         BNE   @@L2656
         MVC   88(4,13),4(3)
         MVC   92(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2656
         MVC   128(4,13),=F'0'
         MVC   88(4,13),=F'106'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         MVC   96(4,13),8(5)
         MVC   100(4,13),256(6)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    5,15
         LA    9,89(0,0)
         CLR   7,9
         L     14,=A(@@L2578)
         BNER  14
         L     14,=A(@@L2705)
         BR    14
@@L2652  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'0'
         L     2,132(13)
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     3,0(2,3)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'85'
         MVC   92(4,13),132(13)
         MVC   96(4,13),4(5)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     14,=A(@@L2706)
         BR    14
@@L2622  EQU   *
         L     12,4(,10)
         LA    8,90(0,0)
         CLR   7,8
         BE    @@L2737
@@L2626  EQU   *
         L     12,4(,10)
         L     6,8(5)
         LH    2,0(6)
         CLM   2,3,=H'54'
         BE    @@L2738
@@L2627  EQU   *
         L     12,4(,10)
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         CLR   2,7
         L     14,=A(@@L2579)
         BNER  14
         LH    2,0(6)
         CLM   2,3,=H'54'
         L     14,=A(@@L2579)
         BER   14
         MVC   88(4,13),=F'0'
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),132(13)
         MVC   96(4,13),4(5)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2579)
         BER   14
         ST    7,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     14,=A(@@L2710)
         BR    14
@@L2738  EQU   *
         L     12,4(,10)
         L     9,4(6)
         LTR   9,9
         BL    @@L2627
         L     15,=V(MODE@BIT)
         L     3,0(5)
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'2'
         LH    2,0(2,15)
         N     2,=XL4'0000FFFF'
         ST    2,152(13)
         CR    9,2
         BNL   @@L2627
         L     2,8(11)
         MH    2,=H'2'
         LH    8,0(2,15)
         CLM   8,3,=H'32'
         BH    @@L2627
         L     2,132(13)
         MH    2,=H'2'
         ST    2,156(13)
         LH    15,0(2,15)
         CLM   15,3,=H'32'
         BH    @@L2627
         LR    6,3
         SRL   6,16
         LA    2,87(0,0)
         CLR   7,2
         BE    @@L2739
@@L2628  EQU   *
         L     12,4(,10)
         LA    8,89(0,0)
         CLR   7,8
         BE    @@L2740
@@L2630  EQU   *
         L     12,4(,10)
         CLR   7,6
         BE    @@L2741
         LA    4,89(0,0)
         CLR   7,4
         L     14,=A(@@L2579)
         BER   14
         LA    8,88(0,0)
         CLR   7,8
         BE    @@L2742
@@L2637  EQU   *
         L     12,4(,10)
         L     2,=V(MODE@BIT)
         L     3,156(13)
         LH    2,0(3,2)
         CLM   2,3,=H'32'
         L     14,=A(@@L2579)
         BHR   14
         SLR   2,2
         IC    2,2(5)
         CL    2,8(11)
         BE    @@L2635
         LR    2,6
         A     2,=F'-88'
         LA    4,2(0,0)
         CLR   2,4
         L     14,=A(@@L2579)
         BNHR  14
         LA    8,88(0,0)
         CLR   7,8
         L     14,=A(@@L2579)
         BER   14
@@L2635  EQU   *
         L     12,4(,10)
         ST    5,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),8(11)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2579)
         BER   14
         LH    2,0(15)
         CLM   2,3,=H'54'
         L     14,=A(@@L2579)
         BNER  14
         LA    2,112(,13)
         ST    2,88(13)
         LA    2,116(,13)
         ST    2,92(13)
         MVC   96(4,13),=F'83'
         MVC   100(4,13),4(15)
         MVC   104(4,13),8(11)
         LA    2,120(,13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@88)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2579)
         BER   14
         SLR   4,4
         LR    2,7
         A     2,=F'-89'
         LA    3,1(0,0)
         CLR   2,3
         BNH   @@L2641
         LR    4,3
@@L2641  EQU   *
         L     12,4(,10)
         SLR   3,3
         LR    2,6
         A     2,=F'-89'
         LA    8,1(0,0)
         CLR   2,8
         BH    @@L2642
         LR    3,8
@@L2642  EQU   *
         L     12,4(,10)
         L     2,128(13)
         AR    2,9
         CR    4,3
         BNE   @@L2643
         L     2,128(13)
         SR    2,9
@@L2643  EQU   *
         L     12,4(,10)
         LTR   2,2
         BNH   @@L2644
         LA    9,88(0,0)
         CLR   6,9
         BE    @@L2743
@@L2646  EQU   *
         L     12,4(,10)
         LA    4,89(0,0)
         CR    6,4
         BE    @@L2744
@@L2644  EQU   *
         L     12,4(,10)
         LTR   2,2
         BL    @@L2745
@@L2648  EQU   *
         L     12,4(,10)
         ST    2,128(13)
         L     14,=A(@@L2703)
         BR    14
@@L2745  EQU   *
         L     12,4(,10)
         LR    7,6
         LCR   2,2
         B     @@L2648
@@L2744  EQU   *
         L     12,4(,10)
         LA    8,90(0,0)
         CLR   7,8
         BNE   @@L2644
@@L2645  EQU   *
         L     12,4(,10)
         LR    7,6
         B     @@L2648
@@L2743  EQU   *
         L     12,4(,10)
         LA    3,87(0,0)
         CLR   7,3
         BNE   @@L2646
         B     @@L2645
@@L2742  EQU   *
         L     12,4(,10)
         CLR   6,4
         BNE   @@L2637
         L     14,=A(@@L2579)
         BR    14
@@L2741  EQU   *
         L     12,4(,10)
         SLR   2,2
         IC    2,2(5)
         CL    2,8(11)
         BE    @@L2634
         LR    2,7
         A     2,=F'-88'
         LA    3,2(0,0)
         CLR   2,3
         L     14,=A(@@L2579)
         BNHR  14
@@L2634  EQU   *
         L     12,4(,10)
         A     9,128(13)
         ST    9,128(13)
         L     14,=A(@@L2703)
         BR    14
@@L2740  EQU   *
         L     12,4(,10)
         LA    2,87(0,0)
         CLR   6,2
         BNE   @@L2630
         SRL   3,8
         N     3,=F'255'
         CLR   3,4
         BNE   @@L2630
         MVC   88(4,13),4(5)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         CLR   15,9
         BNH   @@L2630
         L     5,4(5)
         L     2,128(13)
         SR    2,9
         BL    @@L2746
         ST    2,128(13)
         L     14,=A(@@L2578)
         BR    14
@@L2746  EQU   *
         L     12,4(,10)
         LCR   2,2
         ST    2,128(13)
@@L2707  EQU   *
         L     12,4(,10)
         LR    7,6
         L     14,=A(@@L2578)
         BR    14
@@L2739  EQU   *
         L     12,4(,10)
         LA    2,89(0,0)
         CLR   6,2
         BNE   @@L2628
         LR    2,8
         N     2,=XL4'0000FFFF'
         S     2,152(13)
         CL    2,128(13)
         BNE   @@L2628
         L     4,132(13)
         MH    4,=H'4'
         L     3,=F'-1'
         SLL   3,0(9)
         L     2,=V(MODE@MAS)
         N     3,0(4,2)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),8(11)
         MVC   96(4,13),4(5)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         MVC   96(4,13),8(11)
         ST    15,100(13)
         MVC   104(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         LR    5,15
         ST    9,128(13)
         B     @@L2707
@@L2737  EQU   *
         L     12,4(,10)
         L     6,=V(MODE@BIT)
         L     2,8(11)
         MH    2,=H'2'
         LH    3,0(2,6)
         LR    2,3
         N     2,=XL4'0000FFFF'
         BCTR  2,0
         L     9,128(13)
         CLR   9,2
         BNE   @@L2626
         SRL   15,7
         N     15,=F'510'
         LH    15,0(15,6)
         STH   15,80(,13)
         CLM   3,3,80(13)
         L     14,=A(@@L2703)
         BNLR  14
         B     @@L2626
@@L2659  EQU   *
         L     12,4(,10)
         LA    2,90(0,0)
         CLR   7,2
         L     14,=A(@@L2579)
         BNER  14
         L     3,8(5)
         L     2,=V(CIRTX)
         CL    3,256(2)
         L     14,=A(@@L2579)
         BNER  14
         L     4,4(5)
         SLR   2,2
         IC    2,2(4)
         CL    2,8(11)
         L     14,=A(@@L2579)
         BNER  14
         L     3,8(11)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         LR    2,3
         N     2,=XL4'0000FFFF'
         BCTR  2,0
         L     6,128(13)
         CLR   6,2
         L     14,=A(@@L2579)
         BNER  14
         CLM   3,3,=H'32'
         L     14,=A(@@L2579)
         BHR   14
         LA    8,1(0,0)
         CR    6,8
         L     14,=A(@@L2579)
         BNHR  14
         ST    4,88(13)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         CLR   15,8
         L     14,=A(@@L2579)
         BNER  14
         LA    2,112(,13)
         ST    2,88(13)
         LA    2,116(,13)
         ST    2,92(13)
         MVC   96(4,13),=F'85'
         ST    15,100(13)
         MVC   104(4,13),8(11)
         LA    2,120(,13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@88)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2579)
         BER   14
         L     14,=A(@@L2711)
         BR    14
@@L2673  EQU   *
         L     12,4(,10)
         LA    3,90(0,0)
         CLR   7,3
         L     14,=A(@@L2579)
         BNER  14
         L     6,4(5)
         LH    2,0(6)
         CLM   2,3,=H'90'
         L     14,=A(@@L2579)
         BNER  14
         L     8,8(6)
         LH    2,0(8)
         CH    2,=H'54'
         L     14,=A(@@L2579)
         BNER  14
         L     4,=V(MODE@BIT)
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         LH    3,0(2,4)
         N     3,=XL4'0000FFFF'
         SRL   15,7
         N     15,=F'510'
         LH    2,0(15,4)
         N     2,=XL4'0000FFFF'
         SR    3,2
         C     3,4(8)
         L     14,=A(@@L2579)
         BHR   14
         MVC   88(4,13),=F'0'
         L     2,8(6)
         L     4,128(13)
         A     4,4(2)
         ST    4,128(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    7,88(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         MVC   96(4,13),4(6)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'122'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         L     14,=A(@@L2708)
         BR    14
@@L2720  EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LA    2,1(0,0)
         SLL   2,0(3)
         NR    2,15
         LTR   2,2
         L     14,=A(@@L2597)
         BNER  14
         LA    7,90(0,0)
         L     14,=A(@@L2597)
         BR    14
@@L2719  EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         A     15,128(13)
         LR    3,4
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         L     14,=A(@@L2596)
         BLR   14
         BCTR  2,0
         ST    2,128(13)
         L     14,=A(@@L2596)
         BR    14
@@L2718  EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         L     2,=V(MODE@BIT)
         LH    2,0(6,2)
         N     2,=XL4'0000FFFF'
         CLR   15,2
         L     14,=A(@@L2595)
         BNER  14
         B     @@L2712
@@L2591  EQU   *
         L     12,4(,10)
         MVC   144(4,13),=F'0'
         L     14,=A(@@L2593)
         BR    14
@@L2589  EQU   *
         L     12,4(,10)
         L     2,=V(CIRTX)
         L     5,256(2)
         B     @@L2712
@@L2717  EQU   *
         L     12,4(,10)
         ST    3,128(13)
         L     14,=A(@@L2586)
         BR    14
@@L2716  EQU   *
         L     12,4(,10)
         LA    7,88(0,0)
         L     2,8(11)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         S     2,128(13)
         ST    2,128(13)
         L     14,=A(@@L2583)
         BR    14
@@L2573  EQU   *
         L     12,4(,10)
* Function simplify_shift_const epilogue
         PDPEPIL
* Function simplify_shift_const literal pool
         DS    0F
         LTORG
* Function simplify_shift_const page table
         DS    0F
@@PGT48  EQU   *
         DC    A(@@PG48)
         DC    A(@@PG49)
         DS    0F
* S-func recog_for_combine prologue
@@58     PDPPRLG CINDEX=50,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN50
         LTORG
@@FEN50  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG50   EQU   *
         LR    11,1
         L     10,=A(@@PGT50)
* Function recog_for_combine code
         L     2,0(11)
         L     6,0(2)
         SLR   2,2
         ST    2,104(13)
         ST    2,108(13)
         LH    2,0(6)
         CLM   2,3,=H'39'
         BE    @@L2789
@@L2748  EQU   *
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(SHALLOW@)
         BALR  14,15
         LR    8,15
         ST    6,16(15)
         MVC   28(4,15),=F'0'
         ST    6,88(13)
         ST    15,92(13)
         LA    2,104(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(RECOG)
         BALR  14,15
         LR    9,15
         LTR   15,15
         BL    @@L2790
@@L2755  EQU   *
         LTR   9,9
         BL    @@L2791
@@L2764  EQU   *
         L     3,104(13)
         LTR   3,3
         BE    @@L2765
         LH    2,0(6)
         CLM   2,3,=H'39'
         BE    @@L2792
         LR    2,3
         A     2,=F'1'
@@L2767  EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(RTVEC@AL)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
         LR    7,15
         LH    2,0(6)
         CLM   2,3,=H'39'
         BE    @@L2793
         L     2,4(15)
         ST    6,4(2)
@@L2774  EQU   *
         ST    7,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(ADD@CLOB)
         BALR  14,15
         L     3,4(7)
         L     2,0(3)
         LR    5,2
         S     5,104(13)
         CR    5,2
         BNL   @@L2786
@@L2780  EQU   *
         LR    4,5
         MH    4,=H'4'
         L     2,4(4,3)
         L     3,4(2)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L2794
@@L2779  EQU   *
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'10'
         L     2,4(7)
         L     2,4(4,2)
         MVC   96(4,13),4(2)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,108(13)
         A     5,=F'1'
         L     3,4(7)
         C     5,0(3)
         BL    @@L2780
@@L2786  EQU   *
         LR    6,7
@@L2765  EQU   *
         L     2,0(11)
         ST    6,0(2)
         L     2,8(11)
         MVC   0(4,2),108(13)
         LR    15,9
         B     @@L2747
@@L2794  EQU   *
         ST    3,88(13)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@89)
         BALR  14,15
         LTR   15,15
         BNE   @@L2779
@@L2788  EQU   *
         L     15,=F'-1'
         B     @@L2747
@@L2793  EQU   *
         SLR   5,5
         L     2,4(6)
         C     5,0(2)
         BNL   @@L2774
@@L2773  EQU   *
         L     4,4(7)
         LR    3,5
         MH    3,=H'4'
         L     2,4(6)
         L     2,4(3,2)
         ST    2,4(3,4)
         A     5,=F'1'
         L     2,4(6)
         C     5,0(2)
         BL    @@L2773
         B     @@L2774
@@L2792  EQU   *
         L     2,4(6)
         L     2,0(2)
         AR    2,3
         B     @@L2767
@@L2791  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'47'
         BNE   @@L2764
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SET@NOOP)
         BALR  14,15
         LTR   15,15
         BE    @@L2764
         L     9,=F'2147483647'
         MVC   104(4,13),=F'0'
         B     @@L2764
@@L2790  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(CHECK@AS)
         BALR  14,15
         LTR   15,15
         BNE   @@L2755
         LH    2,0(6)
         CH    2,=H'39'
         BNE   @@L2755
         LR    5,15
         LR    4,15
         L     3,4(6)
         C     15,0(3)
         BNL   @@L2783
@@L2762  EQU   *
         LR    7,5
         MH    7,=H'4'
         L     2,4(7,3)
         LH    2,0(2)
         CLM   2,3,=H'49'
         BE    @@L2758
         CLR   5,4
         BE    @@L2761
         LR    2,4
         MH    2,=H'4'
         AR    3,2
         A     3,=F'4'
         ST    3,88(13)
         L     2,4(6)
         L     2,4(7,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
@@L2761  EQU   *
         A     4,=F'1'
@@L2758  EQU   *
         A     5,=F'1'
         L     3,4(6)
         C     5,0(3)
         BL    @@L2762
@@L2783  EQU   *
         MVC   88(4,13),4(6)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@2)
         BALR  14,15
         LA    2,1(0,0)
         CLR   4,2
         BE    @@L2795
@@L2763  EQU   *
         ST    6,16(8)
         ST    6,88(13)
         ST    8,92(13)
         LA    2,104(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(RECOG)
         BALR  14,15
         LR    9,15
         B     @@L2755
@@L2795  EQU   *
         L     2,4(6)
         L     6,4(2)
         B     @@L2763
@@L2789  EQU   *
         L     2,4(6)
         L     5,0(2)
         BCTR  5,0
         LTR   5,5
         BL    @@L2748
         LR    4,5
         MH    4,=H'4'
         AR    4,2
         A     4,=F'4'
@@L2754  EQU   *
         L     3,0(4)
         LH    2,0(3)
         CH    2,=H'49'
         BE    @@L2796
@@L2751  EQU   *
         A     4,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L2754
         B     @@L2748
@@L2796  EQU   *
         L     3,4(3)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L2751
         B     @@L2788
@@L2747  EQU   *
* Function recog_for_combine epilogue
         PDPEPIL
* Function recog_for_combine literal pool
         DS    0F
         LTORG
* Function recog_for_combine page table
         DS    0F
@@PGT50  EQU   *
         DC    A(@@PG50)
         DS    0F
* S-func gen_lowpart_for_combine prologue
@@60     PDPPRLG CINDEX=51,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN51
         LTORG
@@FEN51  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG51   EQU   *
         LR    11,1
         L     10,=A(@@PGT51)
* Function gen_lowpart_for_combine code
         L     7,0(11)
         L     4,4(11)
         SLR   5,5
         IC    5,2(4)
         LR    15,4
         CLR   5,7
         BE    @@L2797
         L     6,=V(MODE@SIZ)
         IC    3,0(6,7)
         CLM   3,1,=XL1'04'
         BNH   @@L2799
         IC    2,2(4)
         CLM   2,1,=XL1'00'
         BNE   @@L2800
         LH    2,0(4)
         AH    2,=H'-54'
         CLM   2,3,=H'1'
         BNH   @@L2799
@@L2800  EQU   *
         IC    2,0(6,5)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BE    @@L2799
@@L2823  EQU   *
         MVC   88(4,13),=F'49'
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         L     2,=V(CIRTX)
         MVC   96(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         B     @@L2797
@@L2799  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'63'
         BE    @@L2824
@@L2801  EQU   *
         ST    7,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GENLPC)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BNE   @@L2797
         LH    2,0(4)
         CLM   2,3,=H'66'
         BE    @@L2825
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'4C'
         BE    @@L2826
         IC    2,2(4)
         CLM   2,1,=XL1'00'
         BE    @@L2823
         ST    7,88(13)
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(SLOPOFF)
         BALR  14,15
         ST    7,88(13)
         ST    4,92(13)
         SLR   2,2
         IC    2,2(4)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(SGENSUB)
         BALR  14,15
         LTR   15,15
         BNE   @@L2797
         B     @@L2823
@@L2826  EQU   *
         ST    3,88(13)
         ST    7,92(13)
         MVC   96(4,13),4(4)
         MVC   100(4,13),8(4)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L2797
@@L2825  EQU   *
         L     2,0(4)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   @@L2823
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(MODE@DEP)
         BALR  14,15
         LTR   15,15
         BNE   @@L2823
         L     3,=V(MODE@SIZ)
         L     6,0(4)
         SLR   2,2
         IC    2,2(4)
         IC    2,0(3,2)
         IC    3,0(3,7)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BL    @@L2827
         LR    3,2
         N     3,=XL4'000000FF'
         CLM   2,1,=XL1'04'
         BH    @@L2810
         LA    3,4(0,0)
@@L2810  EQU   *
         L     2,=V(MODE@SIZ)
         IC    2,0(2,7)
         CLM   2,1,=XL1'04'
         BNH   @@L2811
         N     2,=XL4'000000FF'
         SR    3,2
@@L2808  EQU   *
         L     2,=V(MODE@SIZ)
         IC    2,0(2,7)
         LR    15,2
         N     15,=XL4'000000FF'
         CLM   2,1,=XL1'04'
         BNH   @@L2815
         LA    15,4(0,0)
@@L2815  EQU   *
         SRL   6,8
         N     6,=F'255'
         L     2,=V(MODE@SIZ)
         IC    2,0(2,6)
         CLM   2,1,=XL1'04'
         BH    @@L2816
         N     2,=XL4'000000FF'
         SR    15,2
         SR    3,15
@@L2813  EQU   *
         ST    4,88(13)
         ST    7,92(13)
         ST    3,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ADJADD)
         BALR  14,15
         B     @@L2797
@@L2816  EQU   *
         SR    3,15
         A     3,=F'4'
         B     @@L2813
@@L2811  EQU   *
         A     3,=F'-4'
         B     @@L2808
@@L2827  EQU   *
         ST    7,88(13)
         ST    4,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         B     @@L2797
@@L2824  EQU   *
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'66'
         BNE   @@L2801
         LR    4,3
         SLR   2,2
         IC    2,2(3)
         LR    15,3
         CLR   2,7
         BNE   @@L2801
@@L2797  EQU   *
* Function gen_lowpart_for_combine epilogue
         PDPEPIL
* Function gen_lowpart_for_combine literal pool
         DS    0F
         LTORG
* Function gen_lowpart_for_combine page table
         DS    0F
@@PGT51  EQU   *
         DC    A(@@PG51)
         DS    0F
* S-func gen_binary prologue
@@66     PDPPRLG CINDEX=52,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN52
         LTORG
@@FEN52  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG52   EQU   *
         LR    11,1
         L     10,=A(@@PGT52)
* Function gen_binary code
         L     6,0(11)
         L     7,4(11)
         L     4,8(11)
         L     5,12(11)
         L     2,=V(RTX@CLAS)
         IC    2,0(2,6)
         CLM   2,1,=XL1'83'
         BE    @@L2839
@@L2829  EQU   *
         L     2,=V(RTX@CLAS)
         IC    2,0(2,6)
         CLM   2,1,=XL1'4C'
         BE    @@L2840
         ST    6,88(13)
         ST    7,92(13)
         ST    4,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
@@L2833  EQU   *
         LTR   15,15
         BNE   @@L2828
         L     2,=V(RTX@CLAS)
         IC    2,0(2,6)
         CLM   2,1,=XL1'83'
         BE    @@L2841
@@L2835  EQU   *
         LA    2,83(0,0)
         CLR   6,2
         BE    @@L2842
@@L2836  EQU   *
         ST    6,88(13)
         ST    7,92(13)
         ST    4,96(13)
         ST    5,100(13)
@@L2838  EQU   *
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L2828
@@L2842  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'54'
         BNE   @@L2836
         LR    2,7
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L2836
         ST    4,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     2,4(5)
         X     2,=F'-1'
         NR    2,15
         LR    15,4
         LTR   2,2
         BE    @@L2828
         B     @@L2836
@@L2841  EQU   *
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(SWAP@COM)
         BALR  14,15
         LTR   15,15
         BE    @@L2835
         ST    6,88(13)
         ST    7,92(13)
         ST    5,96(13)
         ST    4,100(13)
         B     @@L2838
@@L2840  EQU   *
         SLR   3,3
         IC    3,2(4)
         LH    2,0(4)
         CLM   2,3,=H'74'
         BE    @@L2843
@@L2831  EQU   *
         LTR   3,3
         BNE   @@L2832
         SLR   3,3
         IC    3,2(5)
@@L2832  EQU   *
         ST    6,88(13)
         ST    3,92(13)
         ST    4,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(SRELOPER)
         BALR  14,15
         B     @@L2833
@@L2843  EQU   *
         L     2,=V(CIRTX)
         CL    5,256(2)
         BNE   @@L2831
         L     5,8(4)
         L     4,4(4)
         SLR   3,3
         IC    3,2(4)
         B     @@L2831
@@L2839  EQU   *
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(SWAP@COM)
         BALR  14,15
         LTR   15,15
         BE    @@L2829
         LR    2,4
         LR    4,5
         LR    5,2
         B     @@L2829
@@L2828  EQU   *
* Function gen_binary epilogue
         PDPEPIL
* Function gen_binary literal pool
         DS    0F
         LTORG
* Function gen_binary page table
         DS    0F
@@PGT52  EQU   *
         DC    A(@@PG52)
         DS    0F
* S-func simplify_comparison prologue
@@71     PDPPRLG CINDEX=53,FRAME=176,BASER=12,ENTRY=NO
         B     @@FEN53
         LTORG
@@FEN53  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG53   EQU   *
         LR    11,1
         L     10,=A(@@PGT53)
* Function simplify_comparison code
         L     8,0(11)
         L     2,4(11)
         L     6,0(2)
         L     3,8(11)
         MVC   112(4,13),0(3)
@@L2876  EQU   *
         L     12,0(,10)
         LR    2,8
         A     2,=F'-108'
         LA    4,1(0,0)
         CLR   2,4
         BNH   @@L2848
         LA    5,111(0,0)
         CLR   8,5
         BE    @@L2848
         LA    15,110(0,0)
         CLR   8,15
         BE    @@L2848
         LH    2,0(6)
         CLM   2,3,=H'89'
         L     14,=A(@@L3112)
         BER   14
@@L2848  EQU   *
         L     12,0(,10)
         LH    4,0(6)
         L     3,112(13)
         LH    5,0(3)
         STH   5,80(,13)
         CLM   4,3,80(13)
         BNE   @@L2849
         L     7,0(6)
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L2849
         CLM   5,3,=H'88'
         L     14,=A(@@L3113)
         BER   14
@@L2851  EQU   *
         L     12,0(,10)
         CLM   5,3,=H'90'
         L     14,=A(@@L2853)
         BER   14
         CLM   5,3,=H'87'
         L     14,=A(@@L2853)
         BER   14
@@L2852  EQU   *
         L     12,0(,10)
         CLM   4,3,=H'89'
         BNE   @@L2849
         LA    3,109(0,0)
         CLR   8,3
         BE    @@L2849
         LA    4,111(0,0)
         CLR   8,4
         BE    @@L2849
         LA    15,108(0,0)
         CLR   8,15
         BE    @@L2849
         LA    2,110(0,0)
         CLR   8,2
         BE    @@L2849
@@L2850  EQU   *
         L     12,0(,10)
         L     3,8(6)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L2849
         L     4,4(3)
         LTR   4,4
         BL    @@L2849
         LA    15,31(0,0)
         CR    4,15
         BH    @@L2849
         L     2,112(13)
         CL    3,8(2)
         L     14,=A(@@L3114)
         BER   14
@@L2849  EQU   *
         LH    4,0(6)
         CLM   4,3,=H'83'
         BNE   @@L2860
         CLM   5,3,=H'83'
         BNE   @@L2860
         L     5,8(6)
         LH    2,0(5)
         CLM   2,3,=H'54'
         BNE   @@L2860
         L     15,112(13)
         L     3,8(15)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L3115)
         BER   14
@@L2860  EQU   *
         CLM   4,3,=H'86'
         L     14,=A(@@L3116)
         BER   14
@@L2874  EQU   *
         L     12,0(,10)
         CLM   4,3,=H'77'
         BNE   @@L2846
         L     15,112(13)
         LH    2,0(15)
         CLM   2,3,=H'77'
         BNE   @@L2846
         LR    2,8
         A     2,=F'-102'
         LA    3,1(0,0)
         CLR   2,3
         BH    @@L2846
@@L2873  EQU   *
         L     12,0(,10)
         L     6,4(6)
         L     4,112(13)
         MVC   112(4,13),4(4)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         LR    8,15
         B     @@L2876
@@L2846  EQU   *
         L     12,0(,10)
         ST    6,88(13)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(SWAP@COM)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3117)
         BNER  14
@@L2877  EQU   *
         L     12,0(,10)
         L     5,112(13)
         LH    2,0(5)
         CLM   2,3,=H'54'
         L     14,=A(@@L3056)
         BER   14
@@L2879  EQU   *
         L     12,0(,10)
         ST    6,88(13)
         L     2,=V(CIRTX)
         L     15,112(13)
         CL    15,256(2)
         L     14,=A(@@L3118)
         BER   14
         LA    2,47(0,0)
@@L3058  EQU   *
         L     12,0(,10)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LR    6,15
         MVC   88(4,13),112(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         ST    15,112(13)
         LH    2,0(6)
         CLM   2,3,=H'63'
         BE    @@L3119
@@L3059  EQU   *
         L     12,0(,10)
         SLR   7,7
         IC    7,2(6)
         LTR   7,7
         L     14,=A(@@L3064)
         BER   14
         LR    15,7
         MH    15,=H'4'
         ST    15,164(13)
         L     2,=V(MODE@CLA)
         L     2,0(15,2)
         LA    3,1(0,0)
         CLR   2,3
         L     14,=A(@@L3064)
         BNER  14
         L     2,=V(MODE@SIZ)
         IC    2,0(2,7)
         CLM   2,1,=XL1'03'
         L     14,=A(@@L3064)
         BHR   14
         MVC   88(4,13),=F'74'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3064)
         BNER  14
         L     2,=V(MODE@WID)
         SLR   5,5
         IC    5,0(2,7)
         LTR   5,5
         L     14,=A(@@L3064)
         BER   14
         LR    2,5
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         L     14,=A(@@L3064)
         BHR   14
@@L3082  EQU   *
         MVC   88(4,13),=F'74'
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         BE    @@L3067
         MVC   168(4,13),=F'0'
         LR    2,8
         A     2,=F'-102'
         LA    4,1(0,0)
         CLR   2,4
         BNH   @@L3072
         LA    15,108(0,0)
         CLR   8,15
         BE    @@L3072
         LA    2,109(0,0)
         CLR   8,2
         BE    @@L3072
         LA    3,110(0,0)
         CLR   8,3
         BE    @@L3072
         LA    4,111(0,0)
         CLR   8,4
         BE    @@L3072
@@L3071  EQU   *
         L     2,168(13)
         LTR   2,2
         BNE   @@L3075
         ST    6,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         L     3,=V(MODE@BIT)
         LR    2,5
         MH    2,=H'2'
         LH    4,0(2,3)
         N     4,=XL4'0000FFFF'
         LR    9,7
         MH    9,=H'2'
         LH    2,0(9,3)
         N     2,=XL4'0000FFFF'
         SR    4,2
         CLR   15,4
         BH    @@L3120
@@L3074  EQU   *
         L     2,=V(CIRTX)
         L     3,112(13)
         CL    3,256(2)
         BE    @@L3121
@@L3067  EQU   *
         L     2,=V(MODE@WID)
         SLR   3,3
         IC    3,0(2,5)
         LR    5,3
         LTR   3,3
         L     14,=A(@@L3064)
         BER   14
         LR    2,3
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BNH   @@L3082
         L     14,=A(@@L3064)
         BR    14
@@L3121  EQU   *
         LA    4,107(0,0)
         CLR   8,4
         BE    @@L3079
         LA    15,104(0,0)
         CLR   8,15
         BNE   @@L3067
@@L3079  EQU   *
         L     2,=V(MODE@BIT)
         LH    3,0(9,2)
         CLM   3,3,=H'32'
         BH    @@L3067
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'0'
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LA    2,1(0,0)
         SLL   2,0(3)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    5,92(13)
         ST    4,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    6,15
         X     8,=F'107'
         LPR   2,8
         LCR   8,2
         SRL   8,31
         A     8,=F'102'
         L     14,=A(@@L3064)
         BR    14
@@L3120  EQU   *
         MVC   88(4,13),112(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         CLR   15,4
         BNH   @@L3074
@@L3075  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'83'
         BE    @@L3122
@@L3076  EQU   *
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    6,15
         L     3,168(13)
         LTR   3,3
         BE    @@L3077
         L     4,112(13)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L3123
@@L3077  EQU   *
         ST    5,88(13)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         ST    15,112(13)
         L     14,=A(@@L3064)
         BR    14
@@L3123  EQU   *
         MVC   88(4,13),=F'0'
         MH    7,=H'4'
         L     2,=V(MODE@MAS)
         L     15,4(4)
         N     15,0(7,2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,112(13)
         B     @@L3077
@@L3122  EQU   *
         MVC   88(4,13),=F'83'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         BNE   @@L3076
         ST    5,88(13)
         MVC   92(4,13),4(6)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         MVC   92(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         MVC   88(4,13),=F'83'
         ST    5,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    6,15
         B     @@L3076
@@L3072  EQU   *
         ST    6,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     2,=V(MODE@MAS)
         L     4,164(13)
         L     3,0(4,2)
         X     3,=F'-1'
         NR    15,3
         LTR   15,15
         BNE   @@L3071
         L     15,112(13)
         LH    2,0(15)
         CLM   2,3,=H'54'
         BE    @@L3073
         ST    15,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    3,15
         LTR   3,3
         BNE   @@L3071
@@L3073  EQU   *
         MVC   168(4,13),=F'1'
         B     @@L3071
@@L3119  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L3059
         L     5,4(6)
         LH    2,0(5)
         CLM   2,3,=H'61'
         BNE   @@L3059
         L     3,=V(MODE@CLA)
         SLR   7,7
         IC    7,2(6)
         LR    2,7
         MH    2,=H'4'
         L     2,0(2,3)
         LA    4,1(0,0)
         CLR   2,4
         BNE   @@L3059
         SLR   4,4
         IC    4,2(5)
         LR    2,4
         MH    2,=H'4'
         L     2,0(2,3)
         LA    15,1(0,0)
         CLR   2,15
         BNE   @@L3059
         LR    2,8
         A     2,=F'-102'
         CLR   2,15
         BH    @@L3059
         L     3,=V(MODE@SIZ)
         IC    2,0(3,7)
         IC    3,0(3,4)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BH    @@L3124
         MH    4,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(4,2)
         CLM   2,3,=H'32'
         BH    @@L3059
         ST    5,88(13)
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     3,=V(MODE@MAS)
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'4'
         L     2,0(2,3)
         X     2,=F'-1'
         NR    2,15
         LTR   2,2
         BNE   @@L3059
         L     2,4(6)
         SLR   4,4
         IC    4,2(2)
         ST    4,88(13)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    4,15
         ST    15,88(13)
         L     2,4(6)
         SLR   5,5
         IC    5,2(2)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'4'
         L     2,0(2,3)
         X     2,=F'-1'
         NR    2,15
         LTR   2,2
         BNE   @@L3059
         L     6,4(6)
         ST    4,112(13)
         B     @@L3059
@@L3124  EQU   *
         LR    6,5
         ST    4,88(13)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         ST    15,112(13)
         B     @@L3059
@@L3118  EQU   *
         LA    2,74(0,0)
         B     @@L3058
@@L3056  EQU   *
         L     12,0(,10)
         L     3,0(6)
         SLR   15,15
         IC    15,2(6)
         ST    15,136(13)
         LR    4,15
         MH    4,=H'2'
         L     2,=V(MODE@BIT)
         LH    9,0(4,2)
         N     9,=XL4'0000FFFF'
         MH    15,=H'4'
         ST    15,144(13)
         L     2,=V(MODE@MAS)
         L     2,0(15,2)
         ST    2,140(13)
         L     2,=V(MODE@CLA)
         L     2,0(15,2)
         LA    5,1(0,0)
         CLR   2,5
         BE    @@L2881
         L     15,136(13)
         LTR   15,15
         BNE   @@L2879
         LH    2,0(6)
         CLM   2,3,=H'74'
         BE    @@L2881
         SRL   3,16
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'4C'
         BNE   @@L2879
@@L2881  EQU   *
         L     2,112(13)
         MVC   88(4,13),4(2)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         LR    7,15
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,112(13)
         LTR   7,7
         BE    @@L2883
         LR    2,8
         A     2,=F'-102'
         LA    3,2(0,0)
         CLR   2,3
         L     14,=A(@@L2884)
         BNHR  14
         LA    5,108(0,0)
         CLR   8,5
         L     14,=A(@@L2884)
         BER   14
         LA    15,107(0,0)
         CLR   8,15
         L     14,=A(@@L2884)
         BER   14
         LA    2,111(0,0)
         CLR   8,2
         L     14,=A(@@L2884)
         BER   14
@@L2883  EQU   *
         L     12,0(,10)
         L     2,=F'-1'
         CLR   7,2
         L     14,=A(@@L3125)
         BER   14
@@L2888  EQU   *
         L     12,0(,10)
         LR    3,8
         A     3,=F'-104'
         LA    5,7(0,0)
         CLR   3,5
         BH    @@L2893
         MH    3,=H'4'
         L     2,=A(@@L2927)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2927  EQU   *
         DC    A(@@L2901)
         DC    A(@@L2904)
         DC    A(@@L2897)
         DC    A(@@L2894)
         DC    A(@@L2917)
         DC    A(@@L2922)
         DC    A(@@L2913)
         DC    A(@@L2908)
@@L2894  EQU   *
         LTR   7,7
         BNH   @@L2893
         BCTR  7,0
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,112(13)
         LA    8,106(0,0)
@@L2897  EQU   *
         LTR   7,7
         L     14,=A(@@L3126)
         BLR   14
         BNE   @@L2893
         LA    15,32(0,0)
         CLR   9,15
         L     14,=A(@@L3127)
         BNHR  14
@@L2893  EQU   *
         L     12,0(,10)
         MVC   148(4,13),=F'0'
         LR    5,8
         A     5,=F'-102'
         ST    5,160(13)
         LA    15,1(0,0)
         CLR   5,15
         BH    @@L2928
         ST    15,148(13)
@@L2928  EQU   *
         MVC   152(4,13),=F'0'
         LA    2,107(0,0)
         CLR   8,2
         L     14,=A(@@L2930)
         BER   14
         LA    3,104(0,0)
         CLR   8,3
         L     14,=A(@@L2930)
         BER   14
@@L2929  EQU   *
         L     12,0(,10)
         MVC   156(4,13),=F'0'
         LR    2,8
         A     2,=F'-108'
         LA    5,3(0,0)
         CLR   2,5
         BH    @@L2931
         MVC   156(4,13),=F'1'
@@L2931  EQU   *
         L     15,152(13)
         LTR   15,15
         BE    @@L2932
         L     2,=V(MODE@BIT)
         LH    3,0(4,2)
         CLM   3,3,=H'32'
         L     14,=A(@@L3128)
         BNHR  14
@@L2932  EQU   *
         L     12,0(,10)
         L     15,0(6)
         LR    3,15
         SRL   3,16
         A     3,=F'-63'
         LA    2,70(0,0)
         CLR   3,2
         BH    @@L2879
         MH    3,=H'4'
         L     2,=A(@@L3055)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L3055  EQU   *
         DC    A(@@L2963)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2971)
         DC    A(@@L2976)
         DC    A(@@L2946)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L3016)
         DC    A(@@L3012)
         DC    A(@@L2982)
         DC    A(@@L2941)
         DC    A(@@L3030)
         DC    A(@@L2954)
         DC    A(@@L3040)
         DC    A(@@L3044)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L3001)
         DC    A(@@L2961)
         DC    A(@@L2968)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2959)
         DC    A(@@L2879)
         DC    A(@@L2879)
         DC    A(@@L2939)
         DC    A(@@L2934)
@@L2934  EQU   *
         L     4,4(6)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L3129
@@L2939  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         LR    4,15
         CLR   15,6
         BE    @@L2879
@@L3104  EQU   *
         L     12,0(,10)
         LR    6,4
@@L2878  EQU   *
         L     12,0(,10)
         L     5,112(13)
         LH    2,0(5)
         CLM   2,3,=H'54'
         BE    @@L3056
         B     @@L2879
@@L3129  EQU   *
         L     3,8(6)
         L     2,=V(CIRTX)
         CL    3,260(2)
         BNE   @@L2939
         L     3,148(13)
         LTR   3,3
         BE    @@L2939
         LTR   7,7
         BNE   @@L2939
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BL    @@L2939
         MVC   88(4,13),=F'2'
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(MODE@FOR)
         BALR  14,15
         LA    4,53(0,0)
         CLR   15,4
         BE    @@L3130
         SLL   15,1
         L     2,=V(MODE@BIT)
         LH    2,0(15,2)
         N     2,=XL4'0000FFFF'
         SR    2,3
         LR    3,2
         BCTR  3,0
@@L2936  EQU   *
         L     6,12(6)
         MVC   88(4,13),=F'0'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,112(13)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(REVCOND)
         BALR  14,15
@@L3105  EQU   *
         L     12,0(,10)
         LR    8,15
         B     @@L2878
@@L3130  EQU   *
         LA    5,31(0,0)
         SR    5,3
         LR    3,5
         B     @@L2936
@@L2963  EQU   *
         LA    3,32(0,0)
         CLR   9,3
         BH    @@L2964
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L2964
         L     5,4(6)
         LH    2,0(5)
         CLM   2,3,=H'75'
         L     14,=A(@@L3131)
         BER   14
@@L2964  EQU   *
         L     12,0(,10)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L2879
         L     2,4(6)
         SLR   15,15
         IC    15,2(2)
         LR    2,15
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         CLR   2,9
         BNL   @@L2879
@@L2968  EQU   *
         L     2,156(13)
         LTR   2,2
         BNE   @@L2970
         L     3,148(13)
         LTR   3,3
         BE    @@L2879
@@L2970  EQU   *
         L     5,4(6)
         SLR   4,4
         IC    4,2(5)
         LR    2,4
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L2879
         MH    4,=H'4'
         L     2,=V(MODE@MAS)
         CL    7,0(4,2)
         BNL   @@L2879
         LR    6,5
         B     @@L2878
@@L3131  EQU   *
         L     3,8(5)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L2964
         L     2,4(3)
         LTR   2,2
         BNL   @@L2964
         LCR   3,2
         L     2,=V(MODE@MAS)
         L     15,144(13)
         L     4,0(15,2)
         LR    2,4
         SRL   2,1
         CR    3,2
         BNL   @@L2964
         CLR   7,2
         BNL   @@L2964
         MVC   88(4,13),4(5)
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         X     4,=F'-1'
         NR    4,15
         LTR   4,4
         BNE   @@L3132
@@L3101  EQU   *
         L     12,0(,10)
         L     6,4(6)
         B     @@L2878
@@L3132  EQU   *
         L     2,4(6)
         MVC   88(4,13),4(2)
         L     2,4(6)
         SLR   4,4
         IC    4,2(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         B     @@PGE53
         DS    0F
         LTORG
         DS    0F
@@PGE53  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG54   EQU   *
         L     4,=V(MODE@BIT)
         L     2,4(6)
         SLR   5,5
         IC    5,2(2)
         LR    2,5
         MH    2,=H'2'
         LH    3,0(2,4)
         N     3,=XL4'0000FFFF'
         L     2,136(13)
         MH    2,=H'2'
         LH    2,0(2,4)
         N     2,=XL4'0000FFFF'
         SR    3,2
         CLR   15,3
         L     14,=A(@@L3101)
         BHR   14
         L     14,=A(@@L2964)
         BR    14
@@L2971  EQU   *
         L     12,4(,10)
         L     4,148(13)
         LTR   4,4
         BNE   @@L3133
@@L2972  EQU   *
         L     12,4(,10)
         LTR   7,7
         L     14,=A(@@L2879)
         BNER  14
         L     3,8(6)
         L     2,=V(CIRTX)
         CL    3,252(2)
         L     14,=A(@@L2879)
         BNER  14
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'129'
         L     14,=A(@@L2879)
         BNER  14
         L     5,152(13)
         LTR   5,5
         L     14,=A(@@L2879)
         BER   14
         L     6,4(3)
         X     8,=F'107'
@@L3108  EQU   *
         L     12,4(,10)
         LPR   2,8
         LCR   2,2
         SRL   2,31
         LA    8,103(0,0)
@@L3099  EQU   *
         L     12,4(,10)
         SR    8,2
         L     14,=A(@@L2878)
         BR    14
@@L3133  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'76'
         MVC   92(4,13),136(13)
         MVC   96(4,13),112(13)
         MVC   100(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L2972
@@L3107  EQU   *
         L     12,4(,10)
         L     6,4(6)
@@L3100  EQU   *
         L     12,4(,10)
         ST    4,112(13)
         L     14,=A(@@L2878)
         BR    14
@@L2976  EQU   *
         L     12,4(,10)
         L     15,148(13)
         LTR   15,15
         BNE   @@L3134
@@L2977  EQU   *
         L     12,4(,10)
         L     2,148(13)
         LTR   2,2
         BNE   @@L3135
@@L2978  EQU   *
         L     12,4(,10)
         L     3,152(13)
         LTR   3,3
         L     14,=A(@@L2879)
         BER   14
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'89'
         L     14,=A(@@L2879)
         BNER  14
         L     4,8(3)
         LH    2,0(4)
         CLM   2,3,=H'54'
         L     14,=A(@@L2879)
         BNER  14
         BCTR  9,0
         CL    9,4(4)
         L     14,=A(@@L2879)
         BNER  14
         MVC   88(4,13),4(3)
         MVC   92(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2879)
         BER   14
         L     6,8(6)
         X     8,=F'104'
         LPR   2,8
         LCR   2,2
         SRL   2,31
         LA    8,106(0,0)
         B     @@L3099
@@L3135  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'76'
         MVC   92(4,13),136(13)
         MVC   96(4,13),4(6)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L2978
         L     6,8(6)
         B     @@L3100
@@L3134  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'75'
         MVC   92(4,13),136(13)
         MVC   96(4,13),8(6)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L3107
         B     @@L2977
@@L2946  EQU   *
         L     12,4(,10)
         L     4,148(13)
         LTR   4,4
         BNE   @@L3136
@@L2947  EQU   *
         L     12,4(,10)
         LTR   7,7
         L     14,=A(@@L2879)
         BNER  14
         L     5,152(13)
         LTR   5,5
         BE    @@L2949
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'129'
         BE    @@L2950
         LA    15,32(0,0)
         CLR   9,15
         BNH   @@L3137
@@L2949  EQU   *
         L     12,4(,10)
         ST    6,88(13)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         L     14,=A(@@L2879)
         BNHR  14
         L     6,4(6)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         L     14,=A(@@L3105)
         BR    14
@@L3137  EQU   *
         L     12,4(,10)
         ST    3,88(13)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         BCTR  9,0
         LA    2,1(0,0)
         SLL   2,0(9)
         NR    2,15
         LTR   2,2
         BNE   @@L2949
@@L2950  EQU   *
         L     12,4(,10)
         L     6,4(6)
@@L3103  EQU   *
         L     12,4(,10)
         X     8,=F'107'
         LPR   2,8
         LCR   8,2
         SRL   8,31
         A     8,=F'102'
         L     14,=A(@@L2878)
         BR    14
@@L3136  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'77'
         MVC   92(4,13),136(13)
         MVC   96(4,13),112(13)
         MVC   100(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(SUNARYOP)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L3107
         B     @@L2947
@@L3016  EQU   *
         L     12,4(,10)
         LTR   7,7
         BNE   @@L3017
         L     2,148(13)
         LTR   2,2
         BE    @@L3017
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'87'
         L     14,=A(@@L3138)
         BER   14
@@L3017  EQU   *
         L     12,4(,10)
         LTR   7,7
         BNE   @@L3018
         L     3,148(13)
         LTR   3,3
         BE    @@L3018
         LA    4,32(0,0)
         CLR   9,4
         BH    @@L3018
         L     5,8(6)
         LH    2,0(5)
         CLM   2,3,=H'54'
         BE    @@L3139
@@L3018  EQU   *
         L     12,4(,10)
         L     2,148(13)
         LTR   2,2
         BE    @@L3021
         LTR   7,7
         BNE   @@L3021
         L     4,8(6)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L3140
@@L3021  EQU   *
         L     12,4(,10)
         L     5,148(13)
         LTR   5,5
         BNE   @@L3025
         L     15,156(13)
         LTR   15,15
         BE    @@L3024
@@L3025  EQU   *
         L     12,4(,10)
         L     4,8(6)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L3141
@@L3024  EQU   *
         L     12,4(,10)
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L3142
@@L3026  EQU   *
         L     12,4(,10)
         LTR   7,7
         L     14,=A(@@L2879)
         BNER  14
         L     15,148(13)
         LTR   15,15
         L     14,=A(@@L2879)
         BER   14
         L     3,8(6)
         L     2,=V(CIRTX)
         CL    3,260(2)
         L     14,=A(@@L2879)
         BNER  14
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'90'
         L     14,=A(@@L2879)
         BNER  14
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'86'
         L     14,=A(@@L2879)
         BNER  14
         MVC   88(4,13),=F'90'
         MVC   92(4,13),136(13)
         L     2,4(6)
         L     2,4(2)
         MVC   96(4,13),4(2)
         L     2,4(6)
         MVC   100(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),136(13)
         ST    15,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         LR    6,15
         X     8,=F'102'
         B     @@L3108
@@L3142  EQU   *
         L     12,4(,10)
         L     2,4(3)
         SLR   4,4
         IC    4,2(2)
         LR    2,4
         MH    2,=H'2'
         L     5,=V(MODE@BIT)
         LH    2,0(2,5)
         N     2,=XL4'0000FFFF'
         CLR   9,2
         BH    @@L3026
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L3026
         L     4,=V(MODE@SIZ)
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         L     2,4(2)
         SLR   5,5
         IC    5,2(2)
         IC    2,0(4,3)
         IC    4,0(4,5)
         STC   4,80(,13)
         CLM   2,1,80(13)
         BH    @@L3026
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L3026
         LA    15,32(0,0)
         CLR   9,15
         BH    @@L3026
         LR    2,5
         MH    2,=H'2'
         L     4,=V(MODE@BIT)
         LH    2,0(2,4)
         CLM   2,3,=H'32'
         BH    @@L3026
         L     2,140(13)
         X     2,=F'-1'
         L     3,4(3)
         NR    2,3
         LTR   2,2
         BNE   @@L3026
         MH    5,=H'4'
         L     2,=V(MODE@MAS)
         L     4,0(5,2)
         LR    2,4
         X     2,=F'-1'
         NR    2,3
         LTR   2,2
         BNE   @@L3026
         CL    3,140(13)
         BE    @@L3026
         CLR   3,4
         BE    @@L3026
         MVC   88(4,13),=F'83'
         L     2,4(6)
         L     2,4(2)
         SLR   5,5
         IC    5,2(2)
         ST    5,92(13)
         L     2,4(6)
         MVC   96(4,13),4(2)
         MVC   100(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         MVC   88(4,13),136(13)
         ST    15,92(13)
@@L3111  EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
@@L3097  EQU   *
         L     12,4(,10)
         LR    6,15
         L     14,=A(@@L2878)
         BR    14
@@L3141  EQU   *
         L     12,4(,10)
         L     3,136(13)
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     4,4(4)
         N     4,0(3,2)
         LR    2,4
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L3024
         LR    2,7
         SRA   2,0(15)
         BNE   @@L3024
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(MODFRSIZ)
         BALR  14,15
         LA    2,51(0,0)
         CLR   15,2
         BE    @@L3024
         ST    15,88(13)
         MVC   92(4,13),4(6)
         B     @@L3111
@@L3140  EQU   *
         L     12,4(,10)
         LA    3,32(0,0)
         CLR   9,3
         BH    @@L3021
         L     3,136(13)
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     4,4(4)
         N     4,0(3,2)
         BCTR  9,0
         LA    2,1(0,0)
         SLL   2,0(9)
         A     9,=F'1'
         CLR   4,2
         BNE   @@L3021
         L     6,4(6)
         LA    2,104(0,0)
         LA    4,103(0,0)
         CLR   8,4
         BE    @@L3052
@@L3053  EQU   *
         L     12,4(,10)
         LA    2,107(0,0)
@@L3052  EQU   *
         L     12,4(,10)
         LR    8,2
         L     14,=A(@@L2878)
         BR    14
@@L3139  EQU   *
         L     12,4(,10)
         L     4,4(6)
         LH    2,0(4)
         CLM   2,3,=H'90'
         BNE   @@L3018
         L     3,8(4)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L3018
         L     3,4(3)
         LTR   3,3
         BL    @@L3018
         LA    15,31(0,0)
         CR    3,15
         BH    @@L3018
         L     2,=V(MODE@MAS)
         L     5,4(5)
         L     15,144(13)
         N     5,0(15,2)
         SLL   5,0(3)
         ST    5,140(13)
         LR    2,5
         N     2,=F'-2'
         LTR   2,2
         BNE   @@L3018
         L     5,=V(RTX@CLAS)
         L     3,4(4)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(5,2)
         CLM   2,1,=XL1'4C'
         BE    @@L3020
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         LTR   15,15
         BE    @@L3018
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         IC    2,0(5,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L3018
@@L3020  EQU   *
         L     12,4(,10)
         L     2,4(6)
         L     6,4(2)
         L     14,=A(@@L2878)
         BR    14
@@L3138  EQU   *
         L     12,4(,10)
         L     3,4(3)
         L     2,=V(CIRTX)
         CL    3,260(2)
         BNE   @@L3017
         MVC   88(4,13),=F'90'
         MVC   92(4,13),136(13)
         MVC   96(4,13),8(6)
         L     2,4(6)
         MVC   100(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),136(13)
         ST    15,96(13)
@@L3109  EQU   *
         L     12,4(,10)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         B     @@L3097
@@L3012  EQU   *
         L     12,4(,10)
         L     15,152(13)
         LTR   15,15
         L     14,=A(@@L2879)
         BER   14
         L     4,4(6)
         LH    2,0(4)
         CLM   2,3,=H'75'
         L     14,=A(@@L2879)
         BNER  14
         L     3,8(4)
         L     2,=V(CIRTX)
         CL    3,252(2)
         L     14,=A(@@L2879)
         BNER  14
         MVC   88(4,13),4(4)
         MVC   92(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2879)
         BER   14
         L     6,8(6)
         X     8,=F'104'
         LPR   2,8
         LCR   8,2
         SRL   8,31
         A     8,=F'105'
         L     14,=A(@@L2878)
         BR    14
@@L2982  EQU   *
         L     12,4(,10)
         L     4,148(13)
         LTR   4,4
         L     14,=A(@@L2879)
         BER   14
         MVC   88(4,13),=F'85'
         MVC   92(4,13),136(13)
         MVC   96(4,13),8(6)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L3107
         L     14,=A(@@L2879)
         BR    14
@@L2941  EQU   *
         L     12,4(,10)
         L     15,148(13)
         LTR   15,15
         BNE   @@L3143
@@L2942  EQU   *
         L     12,4(,10)
         L     2,152(13)
         LTR   2,2
         L     14,=A(@@L2879)
         BER   14
         L     6,4(6)
         LA    2,107(0,0)
         LA    3,104(0,0)
         CLR   8,3
         BE    @@L3052
         LA    2,104(0,0)
         B     @@L3052
@@L3143  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'86'
         MVC   92(4,13),136(13)
         MVC   96(4,13),112(13)
         MVC   100(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(SUNARYOP)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L3107
         B     @@L2942
@@L3030  EQU   *
         L     12,4(,10)
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L3144
@@L3031  EQU   *
         L     12,4(,10)
         L     4,152(13)
         LTR   4,4
         BE    @@L3036
         L     2,8(6)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BE    @@L3145
@@L3036  EQU   *
         L     12,4(,10)
         LTR   7,7
         L     14,=A(@@L2879)
         BNER  14
         L     15,148(13)
         LTR   15,15
         L     14,=A(@@L2879)
         BER   14
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L2879)
         BNER  14
         BCTR  9,0
         CL    9,4(3)
         L     14,=A(@@L2879)
         BNER  14
         ST    7,88(13)
         MVC   92(4,13),136(13)
         MVC   96(4,13),4(6)
         B     @@L3109
@@L3145  EQU   *
         L     12,4(,10)
         LA    5,32(0,0)
         CLR   9,5
         BH    @@L3036
         MVC   88(4,13),=F'0'
@@L3102  EQU   *
         L     12,4(,10)
         MVC   92(4,13),136(13)
         MVC   96(4,13),4(6)
         L     2,8(6)
         S     9,4(2)
         BCTR  9,0
         LA    2,1(0,0)
         SLL   2,0(9)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         LR    6,15
         B     @@L3103
@@L3144  EQU   *
         L     12,4(,10)
         L     2,4(3)
         LTR   2,2
         BL    @@L3031
         L     4,148(13)
         LTR   4,4
         BNE   @@L3032
         A     2,=F'1'
         LA    5,31(0,0)
         CR    2,5
         BH    @@L3031
@@L3033  EQU   *
         L     12,4(,10)
         L     3,4(3)
         LA    2,1(0,0)
         SLL   2,0(3)
         BCTR  2,0
         NR    2,7
         LTR   2,2
         BNE   @@L3031
         LA    2,32(0,0)
         CLR   9,2
         BH    @@L3031
         MVC   88(4,13),4(6)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     4,148(13)
         LTR   4,4
         BNE   @@L3034
         A     3,=F'1'
         L     5,140(13)
         SRL   5,0(3)
         X     5,=F'-1'
         NR    15,5
@@L3096  EQU   *
         L     12,4(,10)
         LTR   15,15
         BNE   @@L3031
         L     2,=V(MODE@MAS)
         L     3,144(13)
         N     7,0(3,2)
         LR    2,7
         L     3,8(6)
         L     3,4(3)
         SRL   2,0(3)
         ST    2,88(13)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         MVC   88(4,13),=F'0'
         ST    15,92(13)
@@L3098  EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,112(13)
         L     14,=A(@@L3101)
         BR    14
@@L3034  EQU   *
         L     12,4(,10)
         L     2,140(13)
         SRL   2,0(3)
         X     2,=F'-1'
         NR    15,2
         B     @@L3096
@@L3032  EQU   *
         L     12,4(,10)
         LA    15,31(0,0)
         CR    2,15
         BH    @@L3031
         B     @@L3033
@@L2954  EQU   *
         L     12,4(,10)
         L     3,148(13)
         LTR   3,3
         BE    @@L2955
         L     2,8(6)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BE    @@L3146
@@L2955  EQU   *
         L     12,4(,10)
         LTR   7,7
         BNE   @@L2959
         L     4,152(13)
         LTR   4,4
         BE    @@L2959
         L     2,8(6)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BE    @@L3147
@@L2959  EQU   *
         L     12,4(,10)
         LTR   7,7
         L     14,=A(@@L2879)
         BNER  14
         L     15,148(13)
         LTR   15,15
         L     14,=A(@@L2879)
         BER   14
         L     14,=A(@@L3101)
         BR    14
@@L3147  EQU   *
         L     12,4(,10)
         LA    5,32(0,0)
         CLR   9,5
         BH    @@L2959
         ST    7,88(13)
         B     @@L3102
@@L3146  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'91'
         MVC   92(4,13),136(13)
         MVC   96(4,13),112(13)
         MVC   100(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L3107
         B     @@L2955
@@L3040  EQU   *
         L     12,4(,10)
         L     2,148(13)
         LTR   2,2
         BE    @@L3041
         LTR   7,7
         BNE   @@L3041
         L     2,8(6)
         LH    2,0(2)
         CLM   2,3,=H'54'
         L     14,=A(@@L3148)
         BER   14
@@L3041  EQU   *
         L     12,4(,10)
         L     3,156(13)
         LTR   3,3
         BNE   @@L3042
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L3149)
         BER   14
@@L3042  EQU   *
         L     12,4(,10)
         L     5,156(13)
         LTR   5,5
         BNE   @@L3044
         L     4,8(6)
         LH    2,0(4)
         CLM   2,3,=H'54'
         L     14,=A(@@L3150)
         BER   14
@@L3044  EQU   *
         L     12,4(,10)
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L3151
@@L3045  EQU   *
         L     12,4(,10)
         LTR   7,7
         L     14,=A(@@L2879)
         BNER  14
         L     15,148(13)
         LTR   15,15
         BNE   @@L3050
         L     2,152(13)
         LTR   2,2
         L     14,=A(@@L2879)
         BER   14
@@L3050  EQU   *
         L     12,4(,10)
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L2879)
         BNER  14
         BCTR  9,0
         CL    9,4(3)
         L     14,=A(@@L2879)
         BNER  14
         L     6,4(6)
         LA    3,102(0,0)
         CLR   8,3
         BE    @@L3053
         LA    2,104(0,0)
         LA    4,105(0,0)
         CLR   8,4
         BNE   @@L3052
         B     @@L3053
@@L3151  EQU   *
         L     12,4(,10)
         L     2,4(3)
         LTR   2,2
         BL    @@L3045
         LA    3,31(0,0)
         CR    2,3
         BH    @@L3045
         LA    4,32(0,0)
         CLR   9,4
         BH    @@L3045
         MVC   88(4,13),4(6)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     2,8(6)
         L     3,4(2)
         LA    2,1(0,0)
         SLL   2,0(3)
         BCTR  2,0
         NR    2,15
         LTR   2,2
         BNE   @@L3045
         L     2,=V(MODE@MAS)
         L     5,144(13)
         L     15,0(5,2)
         SRL   15,0(3)
         LH    3,0(6)
         CLM   3,3,=H'90'
         L     14,=A(@@L3046)
         BER   14
         LR    2,15
         SRL   2,1
         AR    2,7
         A     2,=F'1'
         CLR   2,15
         BH    @@L3045
@@L3047  EQU   *
         L     12,4(,10)
         CLM   3,3,=H'90'
         BE    @@L3152
@@L3048  EQU   *
         L     12,4(,10)
         L     2,8(6)
         L     2,4(2)
         SLL   7,0(2)
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         B     @@L3098
@@L3152  EQU   *
         L     12,4(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(UNSCOND)
         BALR  14,15
         LR    8,15
         B     @@L3048
@@L3046  EQU   *
         L     12,4(,10)
         CLR   7,15
         BH    @@L3045
         B     @@L3047
@@L3150  EQU   *
         L     12,4(,10)
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'75'
         BNE   @@L3044
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L3044
         L     3,4(3)
         LH    2,0(3)
         CLM   2,3,=H'87'
         BNE   @@L3044
         CL    4,8(3)
         BNE   @@L3044
         LR    2,9
         S     2,4(4)
         ST    2,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         B     @@PGE54
         DS    0F
         LTORG
         DS    0F
@@PGE54  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG55   EQU   *
         LA    1,88(,13)
         L     15,=V(MODFRSIZ)
         BALR  14,15
         LR    5,15
         LA    15,51(0,0)
         CLR   5,15
         L     14,=A(@@L3044)
         BER   14
         LR    3,5
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     3,0(3,2)
         LR    2,3
         SRL   2,1
         AR    2,7
         A     2,=F'1'
         CLR   2,3
         L     14,=A(@@L3044)
         BHR   14
         L     3,4(6)
         L     2,4(3)
         L     4,4(2)
         L     3,8(3)
         MVC   88(4,13),=F'89'
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         ST    3,96(13)
         MVC   100(4,13),8(6)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         MVC   88(4,13),=F'75'
         ST    5,92(13)
         ST    15,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         L     14,=A(@@L3097)
         BR    14
@@L3149  EQU   *
         L     12,8(,10)
         L     4,4(6)
         LH    2,0(4)
         CLM   2,3,=H'87'
         L     14,=A(@@L3042)
         BNER  14
         CL    3,8(4)
         L     14,=A(@@L3042)
         BNER  14
         LR    2,9
         S     2,4(3)
         ST    2,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(MODFRSIZ)
         BALR  14,15
         LA    4,51(0,0)
         CLR   15,4
         L     14,=A(@@L3042)
         BER   14
         LR    3,15
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     3,0(3,2)
         LR    2,3
         SRL   2,1
         AR    2,7
         A     2,=F'1'
         CLR   2,3
         L     14,=A(@@L3042)
         BHR   14
         ST    15,88(13)
         L     2,4(6)
         MVC   92(4,13),4(2)
         L     14,=A(@@L3111)
         BR    14
@@L3148  EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=F'90'
         MVC   96(4,13),136(13)
         MVC   100(4,13),4(6)
         L     2,8(6)
         MVC   104(4,13),4(2)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         L     14,=A(@@L3097)
         BR    14
@@L3001  EQU   *
         L     12,8(,10)
         LTR   7,7
         L     14,=A(@@L2879)
         BNER  14
         L     5,4(6)
         L     2,=V(GLBRTL)
         CL    5,4(2)
         L     14,=A(@@L2879)
         BER   14
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,4(0,0)
         CLR   2,3
         L     14,=A(@@L2879)
         BER   14
         LH    2,0(5)
         CLM   2,3,=H'74'
         BE    @@L3153
         LR    4,5
         L     7,8(6)
@@L3005  EQU   *
         L     12,8(,10)
         L     2,160(13)
         LA    5,1(0,0)
         CLR   2,5
         BNH   @@L3007
         LR    5,15
         SRL   5,8
         N     5,=F'255'
         LR    3,5
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         CLM   3,3,=H'32'
         L     14,=A(@@L2879)
         BHR   14
         MH    5,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(5,2)
         LA    5,1(0,0)
         CLR   2,5
         L     14,=A(@@L2879)
         BNER  14
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LR    2,5
         SRA   2,0(3)
         NR    2,5
         LTR   2,2
         L     14,=A(@@L2879)
         BER   14
         LA    15,107(0,0)
         CLR   8,15
         BE    @@L3007
         LA    2,104(0,0)
         CLR   8,2
         L     14,=A(@@L2879)
         BNER  14
@@L3007  EQU   *
         L     12,8(,10)
         LA    3,107(0,0)
         CLR   8,3
         BE    @@L3009
         LA    5,102(0,0)
         CLR   8,5
         BE    @@L3009
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
@@L3010  EQU   *
         L     12,8(,10)
         LTR   15,15
         L     14,=A(@@L2879)
         BER   14
         LR    8,15
         LR    6,4
         ST    7,112(13)
         L     14,=A(@@L2878)
         BR    14
@@L3009  EQU   *
         L     12,8(,10)
         LH    15,0(6)
         N     15,=XL4'0000FFFF'
         B     @@L3010
@@L3153  EQU   *
         L     12,8(,10)
         L     4,4(5)
         L     7,8(5)
         B     @@L3005
@@L2961  EQU   *
         L     12,8(,10)
         L     2,156(13)
         LTR   2,2
         L     14,=A(@@L2879)
         BNER  14
         L     4,4(6)
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         L     14,=A(@@L2879)
         BHR   14
         N     2,=XL4'0000FFFF'
         BCTR  2,0
         SRL   7,0(2)
         LTR   7,7
         L     14,=A(@@L3104)
         BER   14
         L     14,=A(@@L2879)
         BR    14
@@L3128  EQU   *
         L     12,8(,10)
         ST    6,88(13)
         MVC   92(4,13),136(13)
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LA    2,1(0,0)
         SLL   2,0(3)
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         LR    6,15
         L     14,=A(@@L2932)
         BR    14
@@L2930  EQU   *
         L     12,8(,10)
         LTR   7,7
         L     14,=A(@@L2929)
         BNER  14
         MVC   152(4,13),=F'1'
         L     14,=A(@@L2929)
         BR    14
@@L3127  EQU   *
         L     12,8(,10)
         ST    6,88(13)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         BCTR  9,0
         LA    2,1(0,0)
         SLL   2,0(9)
         A     9,=F'1'
         NR    2,15
         LTR   2,2
         L     14,=A(@@L2893)
         BNER  14
@@L3093  EQU   *
         L     12,8(,10)
         LA    8,103(0,0)
         L     14,=A(@@L2893)
         BR    14
@@L3126  EQU   *
         L     12,8(,10)
         A     7,=F'1'
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,112(13)
@@L3094  EQU   *
         L     12,8(,10)
         LA    8,107(0,0)
         L     14,=A(@@L2893)
         BR    14
@@L2901  EQU   *
         L     12,8(,10)
         LTR   7,7
         L     14,=A(@@L2893)
         BNHR  14
         BCTR  7,0
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,112(13)
         LA    8,105(0,0)
@@L2904  EQU   *
         L     12,8(,10)
         LTR   7,7
         BL    @@L3154
         L     14,=A(@@L2893)
         BNER  14
         LA    2,32(0,0)
         CLR   9,2
         L     14,=A(@@L2893)
         BHR   14
         ST    6,88(13)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         BCTR  9,0
         LA    2,1(0,0)
         SLL   2,0(9)
         A     9,=F'1'
         NR    2,15
         LTR   2,2
         L     14,=A(@@L2893)
         BNER  14
@@L3091  EQU   *
         L     12,8(,10)
         LA    8,102(0,0)
         L     14,=A(@@L2893)
         BR    14
@@L3154  EQU   *
         L     12,8(,10)
         A     7,=F'1'
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,112(13)
@@L3092  EQU   *
         L     12,8(,10)
         LA    8,104(0,0)
         L     14,=A(@@L2893)
         BR    14
@@L2917  EQU   *
         L     12,8(,10)
         LA    15,1(0,0)
         CR    7,15
         BH    @@L3155
         LA    2,32(0,0)
         CLR   9,2
         L     14,=A(@@L2893)
         BHR   14
         BCTR  9,0
         LA    2,1(0,0)
         SLL   2,0(9)
         A     9,=F'1'
@@L3095  EQU   *
         L     12,8(,10)
         CLR   7,2
         L     14,=A(@@L2893)
         BNER  14
         SLR   7,7
         L     2,=V(CIRTX)
         MVC   112(4,13),256(2)
         B     @@L3094
@@L3155  EQU   *
         L     12,8(,10)
         BCTR  7,0
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,112(13)
         LA    8,109(0,0)
@@L2922  EQU   *
         L     12,8(,10)
         LTR   7,7
         BE    @@L3091
         LA    3,32(0,0)
         CLR   9,3
         L     14,=A(@@L2893)
         BHR   14
         BCTR  9,0
         LA    2,1(0,0)
         SLL   2,0(9)
         A     9,=F'1'
         BCTR  2,0
         B     @@L3095
@@L2913  EQU   *
         L     12,8(,10)
         LTR   7,7
         BE    @@L3093
         LA    5,32(0,0)
         CLR   9,5
         L     14,=A(@@L2893)
         BHR   14
         BCTR  9,0
         LA    2,1(0,0)
         SLL   2,0(9)
         A     9,=F'1'
         BCTR  2,0
@@L3106  EQU   *
         L     12,8(,10)
         CLR   7,2
         L     14,=A(@@L2893)
         BNER  14
         SLR   7,7
         L     2,=V(CIRTX)
         MVC   112(4,13),256(2)
         B     @@L3092
@@L2908  EQU   *
         L     12,8(,10)
         LTR   7,7
         BNH   @@L2909
         BCTR  7,0
         MVC   88(4,13),=F'0'
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,112(13)
         LA    8,110(0,0)
         B     @@L2913
@@L2909  EQU   *
         L     12,8(,10)
         LA    3,32(0,0)
         CLR   9,3
         L     14,=A(@@L2893)
         BHR   14
         BCTR  9,0
         LA    2,1(0,0)
         SLL   2,0(9)
         A     9,=F'1'
         B     @@L3106
@@L3125  EQU   *
         L     12,8(,10)
         LR    2,8
         A     2,=F'-102'
         LA    3,1(0,0)
         CLR   2,3
         BNH   @@L2889
         LA    5,105(0,0)
         CLR   8,5
         BE    @@L2889
         LA    15,106(0,0)
         CLR   8,15
         BE    @@L2889
         LA    2,108(0,0)
         CLR   8,2
         BE    @@L2889
         LA    3,111(0,0)
         CLR   8,3
         L     14,=A(@@L2888)
         BNER  14
@@L2889  EQU   *
         L     12,8(,10)
         ST    6,88(13)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         CLR   15,9
         L     14,=A(@@L2888)
         BNER  14
         LA    5,103(0,0)
         CLR   8,5
         BE    @@L2892
         LA    15,106(0,0)
         CLR   8,15
         BE    @@L2892
         LR    2,5
         LA    3,108(0,0)
         CLR   8,3
         BE    @@L2892
@@L2891  EQU   *
         L     12,8(,10)
         LR    8,2
         L     2,=V(CIRTX)
         MVC   112(4,13),256(2)
         SLR   7,7
         L     14,=A(@@L2888)
         BR    14
@@L2892  EQU   *
         L     12,8(,10)
         LA    2,102(0,0)
         B     @@L2891
@@L2884  EQU   *
         L     12,8(,10)
         LA    3,32(0,0)
         CLR   9,3
         L     14,=A(@@L2883)
         BHR   14
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2883)
         BLR   14
         ST    6,88(13)
         MVC   92(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         CLR   15,7
         L     14,=A(@@L2883)
         BNER  14
         LR    2,8
         A     2,=F'-103'
         LA    5,1(0,0)
         CLR   2,5
         BNH   @@L2887
         LA    2,103(0,0)
         LA    15,108(0,0)
         CLR   8,15
         BE    @@L2887
@@L2886  EQU   *
         L     12,8(,10)
         LR    8,2
         L     2,=V(CIRTX)
         MVC   112(4,13),256(2)
         SLR   7,7
         L     14,=A(@@L2883)
         BR    14
@@L2887  EQU   *
         L     12,8(,10)
         LA    2,102(0,0)
         B     @@L2886
@@L3117  EQU   *
         L     12,8(,10)
         LR    4,6
         L     6,112(13)
         ST    4,112(13)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         LR    8,15
         L     14,=A(@@L2877)
         BR    14
@@L3116  EQU   *
         L     12,8(,10)
         L     5,112(13)
         LH    2,0(5)
         CLM   2,3,=H'86'
         L     14,=A(@@L2874)
         BNER  14
         L     14,=A(@@L2873)
         BR    14
@@L3115  EQU   *
         L     12,8(,10)
         L     7,4(6)
         L     9,4(15)
         MVC   124(4,13),4(5)
         MVC   128(4,13),4(3)
         MVC   132(4,13),=F'0'
         LH    2,0(7)
         CLM   2,3,=H'63'
         BE    @@L3156
@@L2861  EQU   *
         L     12,8(,10)
         L     15,124(13)
         CL    15,128(13)
         BE    @@L3157
@@L2862  EQU   *
         L     12,8(,10)
         L     4,132(13)
         LTR   4,4
         L     14,=A(@@L2876)
         BNER  14
         L     14,=A(@@L2846)
         BR    14
@@L3157  EQU   *
         L     12,8(,10)
         L     15,0(6)
         SLR   4,4
         IC    4,2(6)
         LR    3,4
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     3,0(3,2)
         SLL   3,2
         L     2,=V(CLASS@NA)
         L     5,0(3,2)
         CLR   5,4
         BE    @@L2862
@@L2869  EQU   *
         L     12,8(,10)
         LR    3,5
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     4,124(13)
         CL    4,0(3,2)
         BE    @@L3086
         L     2,=V(MODE@WID)
         SLR   3,3
         IC    3,0(2,5)
         LR    5,3
         LR    2,15
         SRL   2,8
         N     2,=F'255'
         CLR   3,2
         BNE   @@L2869
         B     @@L2862
@@L3086  EQU   *
         L     12,8(,10)
         ST    5,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         LR    6,15
         ST    5,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         ST    15,112(13)
@@L3088  EQU   *
         L     12,8(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(UNSCOND)
         BALR  14,15
         LR    8,15
         MVC   132(4,13),=F'1'
         B     @@L2862
@@L3156  EQU   *
         L     12,8(,10)
         LH    2,0(9)
         CLM   2,3,=H'63'
         BNE   @@L2861
         L     3,=V(MODE@SIZ)
         SLR   2,2
         IC    2,2(7)
         L     5,4(7)
         SLR   4,4
         IC    4,2(5)
         IC    2,0(3,2)
         IC    3,0(3,4)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BNH   @@L2861
         L     2,4(9)
         CLC   2(1,5),2(2)
         BNE   @@L2861
         MH    4,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(4,2)
         CLM   2,3,=H'32'
         BH    @@L2861
         L     3,124(13)
         X     3,=F'-1'
         ST    5,88(13)
         L     2,4(7)
         SLR   4,4
         IC    4,2(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    3,15
         LTR   3,3
         BNE   @@L2861
         L     3,128(13)
         X     3,=F'-1'
         MVC   88(4,13),4(9)
         L     2,4(9)
         SLR   5,5
         IC    5,2(2)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    3,15
         LTR   3,3
         BNE   @@L2861
         L     6,4(7)
         MVC   112(4,13),4(9)
         B     @@L3088
@@L3114  EQU   *
         L     12,8(,10)
         SRL   7,8
         N     7,=F'255'
         LR    2,7
         MH    2,=H'4'
         L     3,=V(MODE@MAS)
         L     3,0(2,3)
         LH    5,0(6)
         LR    2,5
         AH    2,=H'-89'
         CLM   2,3,=H'1'
         BH    @@L2854
         LR    2,3
         SRL   2,0(4)
         SLL   2,0(4)
         NR    3,2
@@L2855  EQU   *
         L     12,8(,10)
         MVC   88(4,13),4(6)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    2,3
         X     2,=F'-1'
         NR    15,2
         LTR   15,15
         L     14,=A(@@L2846)
         BNER  14
         L     3,112(13)
         MVC   88(4,13),4(3)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         NR    2,15
         LTR   2,2
         L     14,=A(@@L2846)
         BNER  14
         L     6,4(6)
         MVC   112(4,13),4(3)
         L     14,=A(@@L2876)
         BR    14
@@L2854  EQU   *
         L     12,8(,10)
         CLM   5,3,=H'87'
         BNE   @@L2855
         LR    2,3
         SLL   2,0(4)
         NR    3,2
         SRL   3,0(4)
         B     @@L2855
@@L2853  EQU   *
         L     12,8(,10)
         LA    2,105(0,0)
         CLR   8,2
         L     14,=A(@@L2852)
         BER   14
         LA    3,107(0,0)
         CLR   8,3
         L     14,=A(@@L2852)
         BER   14
         LA    15,104(0,0)
         CLR   8,15
         L     14,=A(@@L2852)
         BER   14
         LA    2,106(0,0)
         CLR   8,2
         L     14,=A(@@L2850)
         BNER  14
         L     14,=A(@@L2852)
         BR    14
@@L3113  EQU   *
         L     12,8(,10)
         LR    2,8
         A     2,=F'-102'
         LA    15,1(0,0)
         CLR   2,15
         L     14,=A(@@L2850)
         BNHR  14
         L     14,=A(@@L2851)
         BR    14
@@L3112  EQU   *
         L     12,8(,10)
         L     3,112(13)
         LH    2,0(3)
         CLM   2,3,=H'89'
         L     14,=A(@@L2848)
         BNER  14
         L     5,4(6)
         LH    2,0(5)
         CLM   2,3,=H'87'
         L     14,=A(@@L2848)
         BNER  14
         L     7,4(3)
         LH    2,0(7)
         CLM   2,3,=H'87'
         L     14,=A(@@L2848)
         BNER  14
         L     4,4(5)
         LH    2,0(4)
         CLM   2,3,=H'63'
         L     14,=A(@@L2848)
         BNER  14
         L     3,4(7)
         LH    2,0(3)
         CLM   2,3,=H'63'
         L     14,=A(@@L2848)
         BNER  14
         L     15,4(4)
         MVC   116(4,13),4(3)
         L     4,116(13)
         CLC   2(1,15),2(4)
         L     14,=A(@@L2848)
         BNER  14
         MVC   120(4,13),8(6)
         L     3,120(13)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L2848)
         BNER  14
         L     4,112(13)
         L     9,8(4)
         LH    2,0(9)
         CLM   2,3,=H'54'
         L     14,=A(@@L2848)
         BNER  14
         L     4,8(5)
         LH    2,0(4)
         CLM   2,3,=H'54'
         L     14,=A(@@L2848)
         BNER  14
         L     3,8(7)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L2848)
         BNER  14
         L     2,120(13)
         L     5,4(2)
         CL    5,4(9)
         L     14,=A(@@L2848)
         BNER  14
         CL    5,4(4)
         L     14,=A(@@L2848)
         BNER  14
         CL    5,4(3)
         L     14,=A(@@L2848)
         BNER  14
         L     4,=V(MODE@BIT)
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'2'
         LH    3,0(2,4)
         N     3,=XL4'0000FFFF'
         SLR   2,2
         IC    2,2(15)
         MH    2,=H'2'
         LH    2,0(2,4)
         N     2,=XL4'0000FFFF'
         SR    3,2
         CLR   5,3
         L     14,=A(@@L2848)
         BNER  14
         LR    6,15
         MVC   112(4,13),116(13)
         L     14,=A(@@L2848)
         BR    14
@@L3064  EQU   *
         L     12,8(,10)
         L     4,4(11)
         ST    6,0(4)
         L     5,8(11)
         MVC   0(4,5),112(13)
         LR    15,8
* Function simplify_comparison epilogue
         PDPEPIL
* Function simplify_comparison literal pool
         DS    0F
         LTORG
* Function simplify_comparison page table
         DS    0F
@@PGT53  EQU   *
         DC    A(@@PG53)
         DC    A(@@PG54)
         DC    A(@@PG55)
         DS    0F
* S-func combine_reversed_comparison_code prologue
@@82     PDPPRLG CINDEX=56,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN56
         LTORG
@@FEN56  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG56   EQU   *
         LR    11,1
         L     10,=A(@@PGT56)
* Function combine_reversed_comparison_code code
         L     5,0(11)
         ST    5,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L3162
         L     15,4(5)
         SLR   2,2
         IC    2,2(15)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,4(0,0)
         CLR   2,3
         BE    @@L3163
@@L3162  EQU   *
         LR    15,4
         B     @@L3158
@@L3163  EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         LTR   15,15
         BE    @@L3162
         LH    2,0(15)
         CLM   2,3,=H'74'
         BNE   @@L3162
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         MVC   92(4,13),4(15)
         MVC   96(4,13),8(15)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(REVCCPAR)
         BALR  14,15
@@L3158  EQU   *
* Function combine_reversed_comparison_code epilogue
         PDPEPIL
* Function combine_reversed_comparison_code literal pool
         DS    0F
         LTORG
* Function combine_reversed_comparison_code page table
         DS    0F
@@PGT56  EQU   *
         DC    A(@@PG56)
         DS    0F
* S-func reversed_comparison prologue
@@77     PDPPRLG CINDEX=57,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN57
         LTORG
@@FEN57  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG57   EQU   *
         LR    11,1
         L     10,=A(@@PGT57)
* Function reversed_comparison code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L3164
         ST    15,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@66)
         BALR  14,15
         LR    2,15
@@L3164  EQU   *
         LR    15,2
* Function reversed_comparison epilogue
         PDPEPIL
* Function reversed_comparison literal pool
         DS    0F
         LTORG
* Function reversed_comparison page table
         DS    0F
@@PGT57  EQU   *
         DC    A(@@PG57)
         DS    0F
* S-func update_table_tick prologue
@@90     PDPPRLG CINDEX=58,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN58
         LTORG
@@FEN58  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG58   EQU   *
         LR    11,1
         L     10,=A(@@PGT58)
* Function update_table_tick code
         L     15,0(11)
         L     5,0(15)
         LR    4,5
         SRL   4,16
         LR    3,4
         MH    3,=H'4'
         L     2,=V(RTX@FORM)
         L     6,0(3,2)
         LA    2,61(0,0)
         CR    4,2
         BE    @@L3190
         L     2,=V(RTX@LENG)
         SLR   3,3
         IC    3,0(2,4)
         BCTR  3,0
         LTR   3,3
         BL    @@L3167
         LR    4,3
         MH    4,=H'4'
         AR    4,15
         A     4,=F'4'
@@L3186  EQU   *
         IC    2,0(3,6)
         CLM   2,1,=XL1'85'
         BE    @@L3191
@@L3182  EQU   *
         A     4,=F'-4'
         BCTR  3,0
         LTR   3,3
         BNL   @@L3186
         B     @@L3167
@@L3191  EQU   *
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=A(@@90)
         BALR  14,15
         B     @@L3182
@@L3190  EQU   *
         L     3,4(15)
         LR    15,3
         A     15,=F'1'
         LA    2,19(0,0)
         CLR   3,2
         BH    @@L3170
         LA    2,15(0,0)
         CLR   3,2
         BNH   @@L3171
         SRL   5,8
         N     5,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,5)
         A     15,=F'7'
         SRA   15,3
@@L3189  EQU   *
         AR    15,3
@@L3170  EQU   *
         LR    5,3
         CLR   3,15
         BNL   @@L3167
@@L3179  EQU   *
         L     2,=A(@@13)
         L     4,0(2)
         LR    3,5
         MH    3,=H'4'
         L     2,=A(@@24)
         L     2,0(2)
         ST    2,0(3,4)
         A     5,=F'1'
         CLR   5,15
         BL    @@L3179
         B     @@L3167
@@L3171  EQU   *
         SRL   5,8
         N     5,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,5)
         A     15,=F'3'
         SRA   15,2
         B     @@L3189
@@L3167  EQU   *
* Function update_table_tick epilogue
         PDPEPIL
* Function update_table_tick literal pool
         DS    0F
         LTORG
* Function update_table_tick page table
         DS    0F
@@PGT58  EQU   *
         DC    A(@@PG58)
         DS    0F
* S-func record_value_for_reg prologue
@@64     PDPPRLG CINDEX=59,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN59
         LTORG
@@FEN59  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG59   EQU   *
         LR    11,1
         L     10,=A(@@PGT59)
* Function record_value_for_reg code
         L     8,0(11)
         L     7,4(11)
         L     6,4(8)
         LR    5,6
         A     5,=F'1'
         LA    2,19(0,0)
         CLR   6,2
         BH    @@L3194
         LA    3,15(0,0)
         CLR   6,3
         BNH   @@L3195
         SLR   3,3
         IC    3,2(8)
         L     2,=V(MODE@SIZ)
         SLR   5,5
         IC    5,0(2,3)
         A     5,=F'7'
         SRA   5,3
@@L3229  EQU   *
         AR    5,6
@@L3194  EQU   *
         L     2,8(11)
         LTR   2,2
         BE    @@L3199
         LTR   7,7
         BE    @@L3199
         ST    8,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         BE    @@L3199
         L     15,4(7)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L3230
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L3201  EQU   *
         L     2,=A(@@29)
         ST    15,0(2)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L3199
         LH    3,0(15)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'F2'
         BE    @@L3204
         CLM   2,1,=XL1'83'
         BE    @@L3204
@@L3203  EQU   *
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,88(13)
         ST    8,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(RPLRTX)
         BALR  14,15
         ST    15,8(11)
@@L3199  EQU   *
         LR    15,6
         CLR   6,5
         BNL   @@L3226
         LR    3,6
         MH    3,=H'4'
@@L3210  EQU   *
         LTR   7,7
         BE    @@L3209
         L     2,=A(@@11)
         L     2,0(2)
         ST    7,0(3,2)
@@L3209  EQU   *
         L     2,=A(@@12)
         L     2,0(2)
         SLR   4,4
         ST    4,0(3,2)
         L     2,=A(@@16)
         L     2,0(2)
         ST    4,0(3,2)
         L     2,=A(@@17)
         L     2,0(2)
         ST    4,0(3,2)
         L     2,=A(@@18)
         L     2,0(2)
         SLR   9,9
         STC   9,0(15,2)
         L     2,=A(@@10)
         L     2,0(2)
         ST    4,0(3,2)
         A     3,=F'4'
         A     15,=F'1'
         CLR   15,5
         BL    @@L3210
@@L3226  EQU   *
         L     2,8(11)
         LTR   2,2
         BNE   @@L3231
@@L3211  EQU   *
         LR    15,6
         CLR   6,5
         BNL   @@L3228
@@L3218  EQU   *
         L     2,=A(@@14)
         L     2,0(2)
         LR    3,15
         MH    3,=H'4'
         L     4,=A(@@24)
         L     9,0(4)
         ST    9,0(3,2)
         L     2,8(11)
         LTR   2,2
         BE    @@L3216
         L     2,=A(@@13)
         L     2,0(2)
         L     2,0(3,2)
         CL    2,0(4)
         BE    @@L3232
@@L3216  EQU   *
         L     2,=A(@@15)
         L     2,0(2)
         SLR   4,4
         STC   4,0(15,2)
@@L3214  EQU   *
         A     15,=F'1'
         CLR   15,5
         BL    @@L3218
@@L3228  EQU   *
         L     2,8(11)
         LTR   2,2
         BNE   @@L3233
@@L3219  EQU   *
         L     2,=A(@@12)
         L     2,0(2)
         LR    5,6
         MH    5,=H'4'
         L     9,8(11)
         ST    9,0(5,2)
         L     2,8(11)
         LTR   2,2
         BE    @@L3192
         SLR   4,4
         IC    4,2(8)
         L     15,4(7)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L3234
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L3223  EQU   *
         L     2,=A(@@29)
         ST    15,0(2)
         L     2,=A(@@16)
         L     2,0(2)
         ST    4,0(5,2)
         LR    3,4
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L3235
@@L3224  EQU   *
         MVC   88(4,13),8(11)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         L     2,=A(@@17)
         L     2,0(2)
         ST    15,0(5,2)
         L     2,=A(@@18)
         L     3,0(2)
         MVC   88(4,13),8(11)
         SLR   2,2
         IC    2,2(8)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         STC   15,0(6,3)
         B     @@L3192
@@L3235  EQU   *
         LR    2,4
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L3224
         L     2,=A(@@22)
         L     4,0(2)
         B     @@L3224
@@L3234  EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L3223
@@L3233  EQU   *
         LA    5,8(,11)
         ST    5,88(13)
         ST    7,92(13)
         L     4,=A(@@14)
         L     2,0(4)
         LR    3,6
         MH    3,=H'4'
         L     2,0(3,2)
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@91)
         BALR  14,15
         LTR   15,15
         BNE   @@L3219
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,8(11)
         ST    5,88(13)
         ST    7,92(13)
         L     2,0(4)
         L     2,0(3,2)
         ST    2,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@91)
         BALR  14,15
         LTR   15,15
         BNE   @@L3219
         ST    15,8(11)
         B     @@L3219
@@L3232  EQU   *
         L     2,=A(@@15)
         L     2,0(2)
         LA    3,1(0,0)
         STC   3,0(15,2)
         B     @@L3214
@@L3231  EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@90)
         BALR  14,15
         B     @@L3211
@@L3204  EQU   *
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'49'
         BNE   @@L3203
         L     2,8(4)
         LH    2,0(2)
         CLM   2,3,=H'49'
         BNE   @@L3203
         LR    4,3
         B     @@L3203
@@L3230  EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L3201
@@L3195  EQU   *
         SLR   3,3
         IC    3,2(8)
         L     2,=V(MODE@SIZ)
         SLR   5,5
         IC    5,0(2,3)
         A     5,=F'3'
         SRA   5,2
         B     @@L3229
@@L3192  EQU   *
* Function record_value_for_reg epilogue
         PDPEPIL
* Function record_value_for_reg literal pool
         DS    0F
         LTORG
* Function record_value_for_reg page table
         DS    0F
@@PGT59  EQU   *
         DC    A(@@PG59)
         DS    0F
* S-func record_dead_and_set_regs_1 prologue
@@92     PDPPRLG CINDEX=60,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN60
         LTORG
@@FEN60  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG60   EQU   *
         LR    11,1
         L     10,=A(@@PGT60)
* Function record_dead_and_set_regs_1 code
         L     4,0(11)
         L     5,4(11)
         L     6,8(11)
         LH    2,0(4)
         CLM   2,3,=H'63'
         BE    @@L3248
@@L3237  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'61'
         BE    @@L3249
         CLM   2,3,=H'66'
         BNE   @@L3236
         ST    4,88(13)
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(PUSH@OPE)
         BALR  14,15
         LTR   15,15
         BNE   @@L3236
         L     15,4(6)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L3250
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L3246  EQU   *
         L     2,=A(@@35)
         ST    15,0(2)
         B     @@L3236
@@L3250  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L3246
@@L3249  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'47'
         BE    @@L3251
@@L3239  EQU   *
         CLM   2,3,=H'47'
         BE    @@L3252
@@L3241  EQU   *
         ST    4,88(13)
         ST    6,92(13)
         MVC   96(4,13),=F'0'
@@L3247  EQU   *
         LA    1,88(,13)
         L     15,=A(@@64)
         BALR  14,15
         B     @@L3236
@@L3252  EQU   *
         L     15,4(5)
         LH    2,0(15)
         CLM   2,3,=H'63'
         BNE   @@L3241
         L     2,4(15)
         CLR   2,4
         BNE   @@L3241
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L3241
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L3241
         SLR   2,2
         IC    2,2(4)
         ST    2,88(13)
         MVC   92(4,13),8(5)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         ST    4,88(13)
         ST    6,92(13)
         ST    15,96(13)
         B     @@L3247
@@L3251  EQU   *
         CL    4,4(5)
         BNE   @@L3239
         ST    4,88(13)
         ST    6,92(13)
         MVC   96(4,13),8(5)
         B     @@L3247
@@L3248  EQU   *
         L     4,4(4)
         B     @@L3237
@@L3236  EQU   *
* Function record_dead_and_set_regs_1 epilogue
         PDPEPIL
* Function record_dead_and_set_regs_1 literal pool
         DS    0F
         LTORG
* Function record_dead_and_set_regs_1 page table
         DS    0F
@@PGT60  EQU   *
         DC    A(@@PG60)
         DS    0F
* S-func record_dead_and_set_regs prologue
@@32     PDPPRLG CINDEX=61,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN61
         LTORG
@@FEN61  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG61   EQU   *
         LR    11,1
         L     10,=A(@@PGT61)
* Function record_dead_and_set_regs code
         L     6,0(11)
         L     5,28(6)
         LTR   5,5
         BE    @@L3283
@@L3272  EQU   *
         IC    4,2(5)
         CLM   4,1,=XL1'01'
         BE    @@L3288
@@L3258  EQU   *
         CLM   4,1,=XL1'02'
         BE    @@L3289
@@L3256  EQU   *
         L     5,8(5)
         LTR   5,5
         BNE   @@L3272
@@L3283  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'34'
         BE    @@L3290
         MVC   88(4,13),16(6)
         MVC   92(4,13),=A(@@92)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(NOTE@STO)
         BALR  14,15
         B     @@L3253
@@L3290  EQU   *
         SLR   4,4
@@L3279  EQU   *
         LA    2,1(0,0)
         SLL   2,0(4)
         L     3,=V(REGS@INV)
         N     2,0(3)
         LTR   2,2
         BE    @@L3276
         L     2,=A(@@12)
         L     2,0(2)
         LR    3,4
         MH    3,=H'4'
         SLR   5,5
         ST    5,0(3,2)
         L     2,=A(@@16)
         L     2,0(2)
         ST    5,0(3,2)
         L     2,=A(@@17)
         L     2,0(2)
         ST    5,0(3,2)
         L     2,=A(@@18)
         L     2,0(2)
         STC   5,0(4,2)
         L     2,=A(@@10)
         L     2,0(2)
         SLR   5,5
         ST    5,0(3,2)
@@L3276  EQU   *
         A     4,=F'1'
         LA    2,19(0,0)
         CLR   4,2
         BNH   @@L3279
         L     15,4(6)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L3291
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L3281  EQU   *
         L     2,=A(@@35)
         ST    15,0(2)
         L     2,=A(@@34)
         ST    15,0(2)
         B     @@L3253
@@L3291  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         B     @@L3281
@@L3289  EQU   *
         MVC   88(4,13),4(5)
         ST    6,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@64)
         BALR  14,15
         B     @@L3256
@@L3288  EQU   *
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L3258
         L     4,4(3)
         LR    15,4
         A     15,=F'1'
         LA    2,19(0,0)
         CLR   4,2
         BH    @@L3260
         LA    2,15(0,0)
         CLR   4,2
         BNH   @@L3261
         SLR   2,2
         IC    2,2(3)
         LR    3,2
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,3)
         A     15,=F'7'
         SRA   15,3
@@L3287  EQU   *
         AR    15,4
@@L3260  EQU   *
         CLR   4,15
         BNL   @@L3256
@@L3269  EQU   *
         L     2,=A(@@10)
         L     3,0(2)
         LR    2,4
         MH    2,=H'4'
         ST    6,0(2,3)
         A     4,=F'1'
         CLR   4,15
         BL    @@L3269
         B     @@L3256
@@L3261  EQU   *
         SLR   2,2
         IC    2,2(3)
         LR    3,2
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,3)
         A     15,=F'3'
         SRA   15,2
         B     @@L3287
@@L3253  EQU   *
* Function record_dead_and_set_regs epilogue
         PDPEPIL
* Function record_dead_and_set_regs literal pool
         DS    0F
         LTORG
* Function record_dead_and_set_regs page table
         DS    0F
@@PGT61  EQU   *
         DC    A(@@PG61)
         DS    0F
* S-func record_promoted_value prologue
@@93     PDPPRLG CINDEX=62,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN62
         LTORG
@@FEN62  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG62   EQU   *
         LR    11,1
         L     10,=A(@@PGT62)
* Function record_promoted_value code
         L     6,0(11)
         L     7,4(11)
         L     2,4(7)
         L     5,4(2)
         SLR   8,8
         IC    8,2(7)
         LR    3,8
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         CLM   2,3,=H'32'
         BH    @@L3292
         L     4,24(6)
         LTR   4,4
         BE    @@L3292
@@L3308  EQU   *
         L     6,4(4)
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3310
         SLR   15,15
@@L3299  EQU   *
         LTR   15,15
         BE    @@L3303
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L3311
@@L3303  EQU   *
         L     4,8(4)
@@L3294  EQU   *
         LTR   4,4
         BNE   @@L3308
         B     @@L3292
@@L3311  EQU   *
         L     2,4(3)
         CLR   2,5
         BNE   @@L3303
         L     2,4(7)
         CLC   2(1,3),2(2)
         BNE   @@L3303
         L     2,=A(@@11)
         L     2,0(2)
         MH    5,=H'4'
         L     2,0(5,2)
         CLR   2,6
         BE    @@L3312
@@L3304  EQU   *
         L     15,8(15)
         LH    2,0(15)
         CLM   2,3,=H'61'
         BNE   @@L3292
         L     5,4(15)
         L     4,24(6)
         B     @@L3294
@@L3312  EQU   *
         L     2,0(7)
         SRL   2,5
         N     2,=F'1'
         LTR   2,2
         BE    @@L3304
         L     2,=A(@@17)
         L     4,0(2)
         LR    3,8
         MH    3,=H'4'
         L     2,=V(MODE@MAS)
         L     9,0(5,4)
         N     9,0(3,2)
         ST    9,0(5,4)
         B     @@L3304
@@L3310  EQU   *
         L     2,16(6)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'47'
         BE    @@L3299
         ST    6,88(13)
         MVC   92(4,13),16(6)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         B     @@L3299
@@L3292  EQU   *
* Function record_promoted_value epilogue
         PDPEPIL
* Function record_promoted_value literal pool
         DS    0F
         LTORG
* Function record_promoted_value page table
         DS    0F
@@PGT62  EQU   *
         DC    A(@@PG62)
         DS    0F
* S-func check_promoted_subreg prologue
@@36     PDPPRLG CINDEX=63,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN63
         LTORG
@@FEN63  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG63   EQU   *
         LR    11,1
         L     10,=A(@@PGT63)
* Function check_promoted_subreg code
         L     6,4(11)
         L     2,0(6)
         N     2,=F'-65528'
         L     3,=F'4128776'
         CR    2,3
         BE    @@L3337
@@L3314  EQU   *
         LH    4,0(6)
         N     4,=XL4'0000FFFF'
         LR    3,4
         MH    3,=H'4'
         L     2,=V(RTX@FORM)
         L     2,0(3,2)
         ST    2,96(13)
         SLR   9,9
         L     2,=V(RTX@LENG)
         SLR   3,3
         IC    3,0(2,4)
         CR    9,3
         BNL   @@L3313
         LR    7,6
         A     7,=F'4'
@@L3334  EQU   *
         L     4,96(13)
         SLR   2,2
         IC    2,0(9,4)
         LA    3,197(0,0)
         CR    2,3
         BE    @@L3324
         BH    @@L3333
         LA    4,133(0,0)
         CR    2,4
         BE    @@L3321
@@L3318  EQU   *
         A     7,=F'4'
         A     9,=F'1'
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@LENG)
         SLR   4,4
         IC    4,0(3,2)
         CR    9,4
         BL    @@L3334
         B     @@L3313
@@L3321  EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(7)
         LA    1,88(,13)
         L     15,=A(@@36)
         BALR  14,15
         B     @@L3318
@@L3333  EQU   *
         LA    3,229(0,0)
         CLR   2,3
         BNE   @@L3318
@@L3324  EQU   *
         LR    8,9
         MH    8,=H'4'
         L     2,4(6,8)
         LTR   2,2
         BE    @@L3318
         SLR   5,5
         C     5,0(2)
         BNL   @@L3318
@@L3330  EQU   *
         MVC   88(4,13),0(11)
         LR    3,8
         AR    3,6
         A     3,=F'4'
         L     4,0(3)
         LR    2,5
         MH    2,=H'4'
         L     4,4(2,4)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@36)
         BALR  14,15
         A     5,=F'1'
         L     2,0(3)
         C     5,0(2)
         BL    @@L3330
         B     @@L3318
@@L3337  EQU   *
         L     2,4(6)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L3314
         MVC   88(4,13),0(11)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@93)
         BALR  14,15
@@L3313  EQU   *
* Function check_promoted_subreg epilogue
         PDPEPIL
* Function check_promoted_subreg literal pool
         DS    0F
         LTORG
* Function check_promoted_subreg page table
         DS    0F
@@PGT63  EQU   *
         DC    A(@@PG63)
         DS    0F
* S-func get_last_value_validate prologue
@@91     PDPPRLG CINDEX=64,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN64
         LTORG
@@FEN64  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG64   EQU   *
         LR    11,1
         L     10,=A(@@PGT64)
* Function get_last_value_validate code
         L     5,4(11)
         L     9,12(11)
         L     2,0(11)
         L     7,0(2)
         L     15,0(7)
         LR    4,15
         SRL   4,16
         LR    3,4
         MH    3,=H'4'
         L     2,=V(RTX@FORM)
         L     6,0(3,2)
         L     2,=V(RTX@LENG)
         SLR   8,8
         IC    8,0(2,4)
         LH    2,0(7)
         CLM   2,3,=H'61'
         BE    @@L3375
         N     15,=F'-65504'
         L     3,=F'4325376'
         CR    15,3
         BE    @@L3376
@@L3355  EQU   *
         SLR   4,4
         CR    4,8
         BNL   @@L3372
         LR    3,6
         LR    2,7
         A     2,=F'4'
@@L3368  EQU   *
         CLI   0(3),133
         BE    @@L3377
@@L3366  EQU   *
         CLI   0(3),197
         BE    @@L3365
         A     3,=F'1'
         A     2,=F'4'
         A     4,=F'1'
         CR    4,8
         BL    @@L3368
@@L3372  EQU   *
         LA    15,1(0,0)
         B     @@L3338
@@L3365  EQU   *
         SLR   15,15
         B     @@L3338
@@L3377  EQU   *
         ST    2,88(13)
         ST    5,92(13)
         MVC   96(4,13),8(11)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=A(@@91)
         BALR  14,15
         LTR   15,15
         BNE   @@L3366
         B     @@L3365
@@L3376  EQU   *
         L     3,4(5)
         L     2,=A(@@21)
         C     3,0(2)
         BH    @@L3378
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         L     3,0(3,2)
         L     2,=A(@@35)
         C     3,0(2)
         BH    @@L3355
@@L3358  EQU   *
         LTR   9,9
         BNE   @@L3379
@@L3359  EQU   *
         LR    15,9
         B     @@L3338
@@L3379  EQU   *
         MVC   88(4,13),=F'49'
         SLR   2,2
         IC    2,2(7)
         ST    2,92(13)
         L     2,=V(CIRTX)
         MVC   96(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         L     2,0(11)
         ST    15,0(2)
         B     @@L3359
@@L3378  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         L     2,=A(@@35)
         C     15,0(2)
         BNH   @@L3358
         B     @@L3355
@@L3375  EQU   *
         L     5,4(7)
         LR    4,5
         A     4,=F'1'
         LA    3,19(0,0)
         CLR   5,3
         BH    @@L3341
         LA    2,15(0,0)
         CLR   5,2
         BNH   @@L3342
         SRL   15,8
         N     15,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,15)
         A     4,=F'7'
         SRA   4,3
@@L3373  EQU   *
         AR    4,5
@@L3341  EQU   *
         LR    6,5
         CLR   5,4
         BNL   @@L3372
@@L3354  EQU   *
         L     2,=A(@@15)
         L     2,0(2)
         IC    2,0(6,2)
         CLM   2,1,=XL1'00'
         BNE   @@L3358
         LA    3,19(0,0)
         CLR   5,3
         BNH   @@L3352
         LR    2,5
         MH    2,=H'4'
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     2,16(2)
         L     2,12(2)
         LA    3,1(0,0)
         CR    2,3
         BE    @@L3380
@@L3352  EQU   *
         L     2,=A(@@14)
         L     3,0(2)
         LR    2,6
         MH    2,=H'4'
         L     2,0(2,3)
         C     2,8(11)
         BH    @@L3358
@@L3348  EQU   *
         A     6,=F'1'
         CLR   6,4
         BL    @@L3354
         B     @@L3372
@@L3380  EQU   *
         L     2,=V(BBINFO)
         L     2,0(2)
         L     2,16(2)
         MVC   88(4,13),32(2)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BE    @@L3348
         B     @@L3352
@@L3342  EQU   *
         SRL   15,8
         N     15,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,15)
         A     4,=F'3'
         SRA   4,2
         B     @@L3373
@@L3338  EQU   *
* Function get_last_value_validate epilogue
         PDPEPIL
* Function get_last_value_validate literal pool
         DS    0F
         LTORG
* Function get_last_value_validate page table
         DS    0F
@@PGT64  EQU   *
         DC    A(@@PG64)
         DS    0F
* S-func get_last_value prologue
@@76     PDPPRLG CINDEX=65,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN65
         LTORG
@@FEN65  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG65   EQU   *
         LR    11,1
         L     10,=A(@@PGT65)
* Function get_last_value code
         L     5,0(11)
         LH    2,0(5)
         CLM   2,3,=H'63'
         BE    @@L3393
@@L3382  EQU   *
         LH    2,0(5)
         SLR   15,15
         CLM   2,3,=H'61'
         BNE   @@L3381
         L     4,4(5)
         L     2,=A(@@12)
         L     2,0(2)
         LR    5,4
         MH    5,=H'4'
         L     2,0(5,2)
         ST    2,104(13)
         LTR   2,2
         BE    @@L3389
         L     2,=A(@@14)
         L     2,0(2)
         L     3,0(5,2)
         L     2,=A(@@24)
         CL    3,0(2)
         BE    @@L3385
         LA    2,19(0,0)
         CLR   4,2
         BNH   @@L3389
         L     2,=V(REG@N@IN)
         LR    3,5
         A     3,0(2)
         L     2,16(3)
         L     2,12(2)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L3394
@@L3389  EQU   *
         SLR   15,15
         B     @@L3381
@@L3394  EQU   *
         L     2,=V(BBINFO)
         L     2,0(2)
         L     2,16(2)
         MVC   88(4,13),32(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   @@L3389
@@L3385  EQU   *
         L     2,=A(@@11)
         L     2,0(2)
         L     4,0(5,2)
         L     3,4(4)
         L     2,=A(@@21)
         C     3,0(2)
         BH    @@L3395
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         L     3,0(3,2)
         L     2,=A(@@29)
         C     3,0(2)
         BNL   @@L3389
@@L3387  EQU   *
         LA    6,104(,13)
         ST    6,88(13)
         L     4,=A(@@11)
         L     2,0(4)
         L     2,0(5,2)
         ST    2,92(13)
         L     3,=A(@@14)
         L     2,0(3)
         L     2,0(5,2)
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@91)
         BALR  14,15
         LTR   15,15
         BE    @@L3396
@@L3392  EQU   *
         L     15,104(13)
         B     @@L3381
@@L3396  EQU   *
         MVC   88(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,104(13)
         ST    6,88(13)
         L     2,0(4)
         L     2,0(5,2)
         ST    2,92(13)
         L     2,0(3)
         L     2,0(5,2)
         ST    2,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@91)
         BALR  14,15
         LTR   15,15
         BE    @@L3381
         B     @@L3392
@@L3395  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         L     2,=A(@@29)
         C     15,0(2)
         BNL   @@L3389
         B     @@L3387
@@L3393  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(SLOPP)
         BALR  14,15
         LTR   15,15
         BE    @@L3382
         L     4,=V(MODE@SIZ)
         SLR   2,2
         IC    2,2(5)
         L     15,4(5)
         SLR   3,3
         IC    3,2(15)
         IC    2,0(4,2)
         IC    4,0(4,3)
         STC   4,80(,13)
         CLM   2,1,80(13)
         BH    @@L3382
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         ST    15,104(13)
         LTR   15,15
         BE    @@L3382
         SLR   2,2
         IC    2,2(5)
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
@@L3381  EQU   *
* Function get_last_value epilogue
         PDPEPIL
* Function get_last_value literal pool
         DS    0F
         LTORG
* Function get_last_value page table
         DS    0F
@@PGT65  EQU   *
         DC    A(@@PG65)
         DS    0F
* S-func use_crosses_set_p prologue
@@47     PDPPRLG CINDEX=66,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN66
         LTORG
@@FEN66  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG66   EQU   *
         LR    11,1
         L     10,=A(@@PGT66)
* Function use_crosses_set_p code
         L     9,0(11)
         L     3,0(9)
         LR    4,3
         SRL   4,16
         LA    2,61(0,0)
         CLR   4,2
         BE    @@L3437
         LA    3,66(0,0)
         CR    4,3
         BE    @@L3438
@@L3413  EQU   *
         LR    2,4
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         ST    3,96(13)
         L     2,=V(RTX@LENG)
         SLR   5,5
         IC    5,0(2,4)
         BCTR  5,0
         LTR   5,5
         BL    @@L3432
         LR    7,5
         MH    7,=H'4'
         LR    6,7
         AR    6,9
         A     6,=F'4'
@@L3428  EQU   *
         L     3,96(13)
         IC    2,0(5,3)
         CLM   2,1,=XL1'C5'
         BE    @@L3439
         CLM   2,1,=XL1'85'
         BE    @@L3440
@@L3416  EQU   *
         A     6,=F'-4'
         A     7,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L3428
@@L3432  EQU   *
         SLR   15,15
         B     @@L3397
@@L3440  EQU   *
         MVC   88(4,13),0(6)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@47)
         BALR  14,15
         LTR   15,15
         BE    @@L3416
@@L3435  EQU   *
         LA    15,1(0,0)
         B     @@L3397
@@L3439  EQU   *
         LR    8,7
         L     2,0(6)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    @@L3416
@@L3425  EQU   *
         L     2,4(9,8)
         LR    3,4
         MH    3,=H'4'
         L     2,4(3,2)
         ST    2,88(13)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@47)
         BALR  14,15
         LTR   15,15
         BNE   @@L3435
         BCTR  4,0
         LTR   4,4
         BNL   @@L3425
         B     @@L3416
@@L3438  EQU   *
         L     2,=A(@@35)
         L     2,0(2)
         LA    15,1(0,0)
         C     2,4(11)
         BH    @@L3397
         B     @@L3413
@@L3437  EQU   *
         L     5,4(9)
         LR    4,5
         A     4,=F'1'
         LA    2,19(0,0)
         CLR   5,2
         BH    @@L3400
         LA    2,15(0,0)
         CLR   5,2
         BNH   @@L3401
         SRL   3,8
         N     3,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         A     4,=F'7'
         SRA   4,3
@@L3436  EQU   *
         AR    4,5
@@L3400  EQU   *
         CLR   5,4
         BNL   @@L3432
@@L3412  EQU   *
         L     2,=A(@@11)
         L     3,0(2)
         LR    2,5
         MH    2,=H'4'
         L     3,0(2,3)
         LTR   3,3
         BE    @@L3407
         L     15,4(3)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L3441
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     2,0(15,2)
         C     2,4(11)
         BH    @@L3435
@@L3407  EQU   *
         A     5,=F'1'
         CLR   5,4
         BL    @@L3412
         B     @@L3432
@@L3441  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         C     15,4(11)
         BH    @@L3435
         B     @@L3407
@@L3401  EQU   *
         SRL   3,8
         N     3,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         A     4,=F'3'
         SRA   4,2
         B     @@L3436
@@L3397  EQU   *
* Function use_crosses_set_p epilogue
         PDPEPIL
* Function use_crosses_set_p literal pool
         DS    0F
         LTORG
* Function use_crosses_set_p page table
         DS    0F
@@PGT66  EQU   *
         DC    A(@@PG66)
         DS    0F
* S-func reg_dead_at_p_1 prologue
@@94     PDPPRLG CINDEX=67,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN67
         LTORG
@@FEN67  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG67   EQU   *
         LR    11,1
         L     10,=A(@@PGT67)
* Function reg_dead_at_p_1 code
         L     4,0(11)
         LH    2,0(4)
         CLM   2,3,=H'61'
         BNE   @@L3442
         L     15,4(4)
         LR    3,15
         A     3,=F'1'
         LA    2,19(0,0)
         CLR   15,2
         BH    @@L3445
         LA    2,15(0,0)
         CLR   15,2
         BNH   @@L3446
         SLR   3,3
         IC    3,2(4)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         LR    3,4
         A     3,=F'7'
         SRA   3,3
@@L3453  EQU   *
         AR    3,15
@@L3445  EQU   *
         L     2,=A(@@95)
         L     2,0(2)
         CLR   2,15
         BNH   @@L3442
         L     2,=A(@@96)
         L     2,0(2)
         CLR   2,3
         BNL   @@L3442
         L     2,4(11)
         LH    2,0(2)
         LA    3,1(0,0)
         CLM   2,3,=H'49'
         BE    @@L3452
         L     3,=F'-1'
@@L3452  EQU   *
         L     2,=A(@@97)
         ST    3,0(2)
         B     @@L3442
@@L3446  EQU   *
         SLR   3,3
         IC    3,2(4)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         LR    3,4
         A     3,=F'3'
         SRA   3,2
         B     @@L3453
@@L3442  EQU   *
* Function reg_dead_at_p_1 epilogue
         PDPEPIL
* Function reg_dead_at_p_1 literal pool
         DS    0F
         LTORG
* Function reg_dead_at_p_1 page table
         DS    0F
@@PGT67  EQU   *
         DC    A(@@PG67)
         DS    0F
* S-func reg_dead_at_p prologue
@@89     PDPPRLG CINDEX=68,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN68
         LTORG
@@FEN68  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG68   EQU   *
         LR    11,1
         L     10,=A(@@PGT68)
* Function reg_dead_at_p code
         L     15,0(11)
         L     5,4(11)
         L     2,=A(@@96)
         MVC   0(4,2),4(15)
         L     4,0(2)
         LR    3,4
         A     3,=F'1'
         LA    2,19(0,0)
         CLR   4,2
         BH    @@L3456
         LA    3,15(0,0)
         CLR   4,3
         BNH   @@L3457
         SLR   3,3
         IC    3,2(15)
         L     2,=V(MODE@SIZ)
         SLR   6,6
         IC    6,0(2,3)
         LR    3,6
         A     3,=F'7'
         SRA   3,3
@@L3500  EQU   *
         AR    3,4
@@L3456  EQU   *
         L     2,=A(@@95)
         ST    3,0(2)
         L     2,=A(@@97)
         MVC   0(4,2),=F'0'
         L     2,=A(@@96)
         L     2,0(2)
         LA    3,19(0,0)
         CLR   2,3
         BH    @@L3461
         LR    4,2
         L     2,=A(@@95)
         CL    4,0(2)
         BNL   @@L3461
@@L3467  EQU   *
         LA    2,1(0,0)
         SLL   2,0(4)
         L     3,=A(@@52)
         N     2,0(3)
         LTR   2,2
         BNE   @@L3499
         A     4,=F'1'
         L     2,=A(@@95)
         CL    4,0(2)
         BL    @@L3467
@@L3461  EQU   *
         LTR   5,5
         BE    @@L3469
         LH    2,0(5)
         CLM   2,3,=H'36'
         BE    @@L3469
         CLM   2,3,=H'35'
         BE    @@L3469
@@L3476  EQU   *
         MVC   88(4,13),16(5)
         MVC   92(4,13),=A(@@94)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(NOTE@STO)
         BALR  14,15
         L     2,=A(@@97)
         L     2,0(2)
         LTR   2,2
         BNE   @@L3501
         ST    5,88(13)
         MVC   92(4,13),=F'1'
         L     2,=A(@@96)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREGNONO)
         BALR  14,15
         LTR   15,15
         BNE   @@L3496
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L3469
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L3469
         CLM   2,3,=H'35'
         BNE   @@L3476
@@L3469  EQU   *
         LR    6,5
         LTR   5,5
         BE    @@L3478
         SLR   6,6
         L     2,=V(N@BASIC@)
         L     4,0(2)
         CR    6,4
         BNL   @@L3480
@@L3484  EQU   *
         LR    2,6
         MH    2,=H'4'
         L     3,=V(BBINFO)
         A     2,0(3)
         L     2,16(2)
         C     5,0(2)
         BE    @@L3480
         A     6,=F'1'
         CR    6,4
         BL    @@L3484
@@L3480  EQU   *
         L     2,=V(N@BASIC@)
         CL    6,0(2)
         BE    @@L3499
@@L3478  EQU   *
         L     2,=A(@@96)
         L     4,0(2)
         L     2,=A(@@95)
         CL    4,0(2)
         BL    @@L3491
@@L3496  EQU   *
         LA    15,1(0,0)
         B     @@L3454
@@L3491  EQU   *
         LR    2,6
         MH    2,=H'4'
         L     3,=V(BBINFO)
         A     2,0(3)
         L     2,16(2)
         MVC   88(4,13),32(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BNE   @@L3499
         A     4,=F'1'
         L     2,=A(@@95)
         CL    4,0(2)
         BL    @@L3491
         B     @@L3496
@@L3499  EQU   *
         SLR   15,15
         B     @@L3454
@@L3501  EQU   *
         SLR   15,15
         LA    6,1(0,0)
         CLR   2,6
         BNE   @@L3454
         B     @@L3496
@@L3457  EQU   *
         SLR   3,3
         IC    3,2(15)
         L     2,=V(MODE@SIZ)
         SLR   6,6
         IC    6,0(2,3)
         LR    3,6
         A     3,=F'3'
         SRA   3,2
         B     @@L3500
@@L3454  EQU   *
* Function reg_dead_at_p epilogue
         PDPEPIL
* Function reg_dead_at_p literal pool
         DS    0F
         LTORG
* Function reg_dead_at_p page table
         DS    0F
@@PGT68  EQU   *
         DC    A(@@PG68)
         DS    0F
* S-func mark_used_regs_combine prologue
@@57     PDPPRLG CINDEX=69,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN69
         LTORG
@@FEN69  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG69   EQU   *
         LR    11,1
         L     10,=A(@@PGT69)
* Function mark_used_regs_combine code
         L     7,0(11)
@@L3517  EQU   *
         L     4,0(7)
         LR    5,4
         SRL   5,16
         LR    3,5
         A     3,=F'-40'
         LA    2,29(0,0)
         CLR   3,2
         BH    @@L3503
         MH    3,=H'4'
         L     2,=A(@@L3539)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L3539  EQU   *
         DC    A(@@L3502)
         DC    A(@@L3503)
         DC    A(@@L3503)
         DC    A(@@L3503)
         DC    A(@@L3502)
         DC    A(@@L3502)
         DC    A(@@L3503)
         DC    A(@@L3532)
         DC    A(@@L3503)
         DC    A(@@L3515)
         DC    A(@@L3503)
         DC    A(@@L3503)
         DC    A(@@L3503)
         DC    A(@@L3503)
         DC    A(@@L3502)
         DC    A(@@L3502)
         DC    A(@@L3502)
         DC    A(@@L3503)
         DC    A(@@L3502)
         DC    A(@@L3502)
         DC    A(@@L3503)
         DC    A(@@L3518)
         DC    A(@@L3503)
         DC    A(@@L3503)
         DC    A(@@L3503)
         DC    A(@@L3503)
         DC    A(@@L3503)
         DC    A(@@L3502)
         DC    A(@@L3502)
         DC    A(@@L3502)
@@L3515  EQU   *
         L     3,4(7)
         LH    2,0(3)
         CLM   2,3,=H'66'
         BNE   @@L3502
         L     7,4(3)
         B     @@L3517
@@L3532  EQU   *
         L     3,4(7)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L3536
         CLM   2,3,=H'133'
         BE    @@L3536
         CLM   2,3,=H'132'
         BE    @@L3536
         CLM   2,3,=H'64'
         BE    @@L3536
@@L3555  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'66'
         BE    @@L3559
@@L3537  EQU   *
         L     7,8(7)
         B     @@L3517
@@L3559  EQU   *
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=A(@@57)
         BALR  14,15
         B     @@L3537
@@L3536  EQU   *
         L     3,4(3)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L3536
         CLM   2,3,=H'133'
         BE    @@L3536
         CLM   2,3,=H'132'
         BE    @@L3536
         CLM   2,3,=H'64'
         BE    @@L3536
         B     @@L3555
@@L3518  EQU   *
         L     3,4(7)
         LA    5,19(0,0)
         CLR   3,5
         BH    @@L3502
         LA    2,13(0,0)
         CLR   3,2
         BE    @@L3502
         LA    5,11(0,0)
         CLR   3,5
         BE    @@L3560
@@L3522  EQU   *
         LA    2,15(0,0)
         CLR   3,2
         BNH   @@L3523
         SRL   4,8
         N     4,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   5,5
         IC    5,0(2,4)
         LR    4,5
         A     4,=F'7'
         SRA   4,3
@@L3558  EQU   *
         AR    4,3
         LR    15,3
         CLR   3,4
         BNL   @@L3502
@@L3531  EQU   *
         L     3,=A(@@52)
         LA    2,1(0,0)
         SLL   2,0(15)
         O     2,0(3)
         ST    2,0(3)
         A     15,=F'1'
         CLR   15,4
         BL    @@L3531
         B     @@L3502
@@L3523  EQU   *
         SRL   4,8
         N     4,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   5,5
         IC    5,0(2,4)
         LR    4,5
         A     4,=F'3'
         SRA   4,2
         B     @@L3558
@@L3560  EQU   *
         L     2,=V(FREGS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'00'
         BE    @@L3522
         B     @@L3502
@@L3503  EQU   *
         LR    2,5
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         ST    3,96(13)
         L     2,=V(RTX@LENG)
         SLR   3,3
         IC    3,0(2,5)
         LR    5,3
         BCTR  5,0
         LTR   5,5
         BL    @@L3502
         LR    6,5
         MH    6,=H'4'
         AR    6,7
         A     6,=F'4'
@@L3552  EQU   *
         L     3,96(13)
         IC    2,0(5,3)
         CLM   2,1,=XL1'85'
         BE    @@L3561
         SLL   2,24
         SRA   2,24
         C     2,=F'-59'
         BE    @@L3562
@@L3542  EQU   *
         A     6,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L3552
         B     @@L3502
@@L3562  EQU   *
         SLR   8,8
         LR    9,5
         MH    9,=H'4'
         L     2,4(7,9)
         C     8,0(2)
         BNL   @@L3542
@@L3551  EQU   *
         LR    3,9
         AR    3,7
         A     3,=F'4'
         L     4,0(3)
         LR    2,8
         MH    2,=H'4'
         L     4,4(2,4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@57)
         BALR  14,15
         A     8,=F'1'
         L     2,0(3)
         C     8,0(2)
         BL    @@L3551
         B     @@L3542
@@L3561  EQU   *
         MVC   88(4,13),0(6)
         LA    1,88(,13)
         L     15,=A(@@57)
         BALR  14,15
         B     @@L3542
@@L3502  EQU   *
* Function mark_used_regs_combine epilogue
         PDPEPIL
* Function mark_used_regs_combine literal pool
         DS    0F
         LTORG
* Function mark_used_regs_combine page table
         DS    0F
@@PGT69  EQU   *
         DC    A(@@PG69)
         DS    0F
* X-func remove_death prologue
REMOVE@D PDPPRLG CINDEX=70,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN70
         LTORG
@@FEN70  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG70   EQU   *
         LR    11,1
         L     10,=A(@@PGT70)
* Function remove_death code
         L     3,0(11)
         L     5,4(11)
         ST    5,88(13)
         MVC   92(4,13),=F'1'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNONO)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L3564
         MH    3,=H'4'
         L     2,=V(REG@N@IN)
         A     3,0(2)
         L     3,16(3)
         L     2,24(3)
         BCTR  2,0
         ST    2,24(3)
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(REMNOTE)
         BALR  14,15
@@L3564  EQU   *
         LR    15,4
* Function remove_death epilogue
         PDPEPIL
* Function remove_death literal pool
         DS    0F
         LTORG
* Function remove_death page table
         DS    0F
@@PGT70  EQU   *
         DC    A(@@PG70)
         DS    0F
* S-func move_deaths prologue
@@63     PDPPRLG CINDEX=71,FRAME=128,BASER=12,ENTRY=NO
         B     @@FEN71
         LTORG
@@FEN71  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG71   EQU   *
         LR    11,1
         L     10,=A(@@PGT71)
* Function move_deaths code
         L     2,0(11)
         LH    3,0(2)
         N     3,=XL4'0000FFFF'
         LA    4,61(0,0)
         CLR   3,4
         BE    @@L3664
         L     5,0(11)
         LH    2,0(5)
         CLM   2,3,=H'47'
         BE    @@L3665
         CH    2,=H'49'
         L     14,=A(@@L3565)
         BER   14
         L     2,=V(RTX@LENG)
         SLR   9,9
         IC    9,0(2,3)
         MH    3,=H'4'
         L     2,=V(RTX@FORM)
         L     3,0(3,2)
         ST    3,116(13)
         SLR   6,6
         CR    6,9
         L     14,=A(@@L3565)
         BNLR  14
         LR    8,6
         L     5,0(11)
         A     5,=F'4'
@@L3653  EQU   *
         L     15,116(13)
         IC    2,0(6,15)
         CLM   2,1,=XL1'C5'
         BE    @@L3666
         CLM   2,1,=XL1'85'
         BE    @@L3667
@@L3643  EQU   *
         A     5,=F'4'
         A     8,=F'4'
         A     6,=F'1'
         CR    6,9
         BL    @@L3653
         L     14,=A(@@L3565)
         BR    14
@@L3667  EQU   *
         MVC   88(4,13),0(5)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@63)
         BALR  14,15
         B     @@L3643
@@L3666  EQU   *
         LR    7,8
         L     2,0(5)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    @@L3643
@@L3650  EQU   *
         L     2,0(11)
         L     3,4(2,7)
         LR    2,4
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@63)
         BALR  14,15
         BCTR  4,0
         LTR   4,4
         BNL   @@L3650
         B     @@L3643
@@L3665  EQU   *
         LR    7,5
         L     5,4(5)
         MVC   88(4,13),8(7)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@63)
         BALR  14,15
         LH    6,0(5)
         CLM   6,3,=H'133'
         BE    @@L3634
         CLM   6,3,=H'64'
         BE    @@L3634
         CLM   6,3,=H'63'
         BE    @@L3668
@@L3633  EQU   *
         CLM   6,3,=H'63'
         BE    @@L3669
@@L3637  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'66'
         L     14,=A(@@L3565)
         BNER  14
         MVC   88(4,13),4(5)
@@L3663  EQU   *
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@63)
         BALR  14,15
         L     14,=A(@@L3565)
         BR    14
@@L3669  EQU   *
         L     5,4(5)
         B     @@L3637
@@L3668  EQU   *
         L     4,=V(MODE@SIZ)
         SLR   2,2
         IC    2,2(5)
         SLR   3,3
         IC    3,0(4,2)
         A     3,=F'3'
         SRA   3,2
         L     2,4(5)
         SLR   15,15
         IC    15,2(2)
         SLR   7,7
         IC    7,0(4,15)
         LR    2,7
         A     2,=F'3'
         SRA   2,2
         CLR   3,2
         BNE   @@L3633
@@L3634  EQU   *
         ST    5,88(13)
         B     @@L3663
@@L3664  EQU   *
         L     8,4(2)
         L     2,=A(@@10)
         L     2,0(2)
         LR    5,8
         MH    5,=H'4'
         ST    5,120(13)
         L     9,0(5,2)
         L     7,4(11)
         LTR   7,7
         BE    @@L3567
         MVC   88(4,13),0(11)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3670)
         BNER  14
@@L3567  EQU   *
         L     12,0(,10)
         LR    4,9
         LTR   9,9
         BE    @@L3569
         L     3,4(9)
         L     2,=A(@@21)
         L     5,0(2)
         CR    3,5
         BNH   @@L3569
@@L3572  EQU   *
         L     4,8(4)
         LTR   4,4
         BE    @@L3569
         L     2,4(4)
         CR    2,5
         BH    @@L3572
@@L3569  EQU   *
         LR    5,9
         LTR   9,9
         BE    @@L3574
         L     3,4(9)
         L     2,=A(@@21)
         L     6,0(2)
         CR    3,6
         BNH   @@L3574
@@L3577  EQU   *
         L     5,12(5)
         LTR   5,5
         BE    @@L3574
         L     2,4(5)
         CR    2,6
         BH    @@L3577
@@L3574  EQU   *
         LTR   4,4
         L     14,=A(@@L3565)
         BER   14
         LTR   5,5
         L     14,=A(@@L3565)
         BER   14
         L     3,4(4)
         L     2,=A(@@21)
         C     3,0(2)
         L     14,=A(@@L3671)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         L     2,0(3,2)
         C     2,8(11)
         L     14,=A(@@L3565)
         BLR   14
@@L3580  EQU   *
         L     12,0(,10)
         L     15,4(5)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L3672)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     4,0(15,2)
@@L3583  EQU   *
         L     12,0(,10)
         L     15,12(11)
         L     3,4(15)
         L     2,=A(@@21)
         C     3,0(2)
         L     14,=A(@@L3673)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         C     4,0(3,2)
         BL    @@L3581
@@L3585  EQU   *
         L     12,0(,10)
         CR    9,5
         L     14,=A(@@L3565)
         BER   14
         L     15,4(5)
         L     2,=A(@@21)
         C     15,0(2)
         L     14,=A(@@L3674)
         BHR   14
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     4,0(15,2)
@@L3587  EQU   *
         L     12,0(,10)
         L     2,12(11)
         L     3,4(2)
         L     2,=A(@@21)
         C     3,0(2)
         BH    @@L3675
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         CL    4,0(3,2)
         L     14,=A(@@L3565)
         BNER  14
@@L3581  EQU   *
         L     12,0(,10)
         ST    8,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(REMOVE@D)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BE    @@L3590
         LA    3,19(0,0)
         CLR   8,3
         BH    @@L3590
         L     4,=V(MODE@SIZ)
         L     5,4(15)
         SLR   3,3
         IC    3,2(5)
         L     15,0(11)
         L     6,0(15)
         SLR   2,2
         IC    2,2(15)
         IC    15,0(4,3)
         IC    4,0(4,2)
         STC   4,80(,13)
         CLM   15,1,80(13)
         BNH   @@L3590
         L     3,4(5)
         LA    2,15(0,0)
         CLR   3,2
         BNH   @@L3591
         LR    5,15
         N     5,=XL4'000000FF'
         A     5,=F'7'
         SRA   5,3
@@L3660  EQU   *
         AR    5,3
         LA    4,15(0,0)
         CLR   8,4
         BNH   @@L3595
         SRL   6,8
         N     6,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,6)
         LR    6,15
         A     6,=F'7'
         SRA   6,3
@@L3661  EQU   *
         AR    6,8
         LR    4,3
         CLR   3,5
         BNL   @@L3606
@@L3605  EQU   *
         CLR   4,8
         BL    @@L3604
         CLR   4,6
         BL    @@L3601
@@L3604  EQU   *
         LR    3,4
         MH    3,=H'4'
         L     2,=V(REG@RAW@)
         L     2,0(3,2)
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'1'
         ST    15,96(13)
         MVC   100(4,13),28(9)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,28(9)
@@L3601  EQU   *
         A     4,=F'1'
         CLR   4,5
         BL    @@L3605
@@L3606  EQU   *
         LTR   7,7
         BE    @@L3629
         L     2,4(7)
         L     15,0(11)
         CLC   2(1,2),2(15)
         BE    @@L3676
@@L3629  EQU   *
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'1'
         MVC   96(4,13),0(11)
         L     3,16(11)
         MVC   100(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,0(3)
@@L3630  EQU   *
         L     2,=V(REG@N@IN)
         L     4,120(13)
         A     4,0(2)
         L     3,16(4)
         L     2,24(3)
         A     2,=F'1'
         ST    2,24(3)
         B     @@L3565
@@L3676  EQU   *
         L     2,16(11)
         MVC   8(4,7),0(2)
         ST    7,0(2)
         B     @@L3630
@@L3595  EQU   *
         SRL   6,8
         N     6,=F'255'
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,6)
         LR    6,4
         A     6,=F'3'
         SRA   6,2
         B     @@L3661
@@L3591  EQU   *
         LR    5,15
         N     5,=XL4'000000FF'
         A     5,=F'3'
         SRA   5,2
         B     @@L3660
@@L3590  EQU   *
         LTR   7,7
         BE    @@L3608
         L     4,=V(MODE@SIZ)
         L     2,4(7)
         SLR   5,5
         IC    5,2(2)
         L     15,0(11)
         SLR   3,3
         IC    3,2(15)
         IC    2,0(4,5)
         IC    4,0(4,3)
         STC   4,80(,13)
         CLM   2,1,80(13)
         BNL   @@L3606
@@L3608  EQU   *
         LA    2,19(0,0)
         CLR   8,2
         BH    @@L3606
         LA    3,15(0,0)
         CLR   8,3
         BNH   @@L3609
         L     4,0(11)
         SLR   3,3
         IC    3,2(4)
         L     2,=V(MODE@SIZ)
         SLR   5,5
         IC    5,0(2,3)
         LR    2,5
         A     2,=F'7'
         SRA   2,3
         LA    15,1(0,0)
         CR    2,15
         BNH   @@L3606
@@L3610  EQU   *
         LA    15,15(0,0)
         CLR   8,15
         BNH   @@L3613
         L     2,0(11)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         A     4,=F'7'
         SRA   4,3
@@L3662  EQU   *
         AR    4,8
         MVC   112(4,13),=F'0'
         LA    3,1(0,0)
         LTR   7,7
         BE    @@L3622
         LA    5,15(0,0)
         CLR   8,5
         BNH   @@L3618
         L     2,4(7)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,3)
         LR    3,15
         A     3,=F'7'
         SRA   3,3
@@L3622  EQU   *
         LR    5,8
         AR    5,3
         CLR   5,4
         BNL   @@L3606
@@L3628  EQU   *
         LR    3,5
         MH    3,=H'4'
         L     2,=V(REG@RAW@)
         L     2,0(3,2)
         ST    2,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    2,112(,13)
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=A(@@63)
         BALR  14,15
         A     5,=F'1'
         CLR   5,4
         BL    @@L3628
         B     @@L3606
@@L3618  EQU   *
         L     2,4(7)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   5,5
         IC    5,0(2,3)
         LR    3,5
         A     3,=F'3'
         SRA   3,2
         B     @@L3622
@@L3613  EQU   *
         L     4,0(11)
         SLR   3,3
         IC    3,2(4)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         A     4,=F'3'
         SRA   4,2
         B     @@L3662
@@L3609  EQU   *
         L     2,0(11)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         LR    2,4
         A     2,=F'3'
         SRA   2,2
         LA    5,1(0,0)
         CR    2,5
         BNH   @@L3606
         B     @@L3610
@@L3675  EQU   *
         MVC   88(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         CLR   4,15
         BE    @@L3581
         B     @@L3565
@@L3674  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         LR    4,15
         B     @@L3587
@@L3673  EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         CR    4,15
         BL    @@L3581
         B     @@L3585
@@L3672  EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         LR    4,15
         B     @@L3583
@@L3671  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         C     15,8(11)
         BNL   @@L3580
         B     @@L3565
@@L3670  EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         BNE   @@L3567
@@L3565  EQU   *
* Function move_deaths epilogue
         PDPEPIL
* Function move_deaths literal pool
         DS    0F
         LTORG
* Function move_deaths page table
         DS    0F
@@PGT71  EQU   *
         DC    A(@@PG71)
         DS    0F
* S-func reg_bitfield_target_p prologue
@@98     PDPPRLG CINDEX=72,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN72
         LTORG
@@FEN72  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG72   EQU   *
         LR    11,1
         L     10,=A(@@PGT72)
* Function reg_bitfield_target_p code
         L     7,0(11)
         L     5,4(11)
         LH    2,0(5)
         CLM   2,3,=H'47'
         BE    @@L3712
         CLM   2,3,=H'39'
         BE    @@L3713
@@L3698  EQU   *
         SLR   15,15
         B     @@L3678
@@L3713  EQU   *
         L     2,4(5)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    @@L3698
@@L3706  EQU   *
         ST    7,88(13)
         L     2,4(5)
         LR    3,4
         MH    3,=H'4'
         L     2,4(3,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@98)
         BALR  14,15
         LTR   15,15
         BNE   @@L3708
         BCTR  4,0
         LTR   4,4
         BNL   @@L3706
         B     @@L3698
@@L3708  EQU   *
         LA    15,1(0,0)
         B     @@L3678
@@L3712  EQU   *
         L     2,4(5)
         LH    3,0(2)
         CLM   3,3,=H'133'
         BE    @@L3709
         CLM   3,3,=H'64'
         BNE   @@L3698
         L     2,4(2)
@@L3709  EQU   *
         L     3,4(2)
         LH    2,0(3)
         CLM   2,3,=H'63'
         BE    @@L3714
@@L3684  EQU   *
         LH    2,0(3)
         SLR   15,15
         CLM   2,3,=H'61'
         BNE   @@L3678
         L     5,4(3)
         L     6,4(7)
         LA    2,19(0,0)
         CLR   5,2
         BH    @@L3687
         CLR   6,2
         BNH   @@L3686
@@L3687  EQU   *
         XR    3,7
         LPR   15,3
         BCTR  15,0
         SRL   15,31
         B     @@L3678
@@L3686  EQU   *
         LA    2,15(0,0)
         CLR   5,2
         BNH   @@L3689
         SLR   2,2
         IC    2,2(3)
         LR    3,2
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         A     4,=F'7'
         SRA   4,3
@@L3710  EQU   *
         AR    4,5
         LA    2,15(0,0)
         CLR   6,2
         BNH   @@L3693
         SLR   3,3
         IC    3,2(7)
         L     2,=V(MODE@SIZ)
         SLR   7,7
         IC    7,0(2,3)
         LR    2,7
         A     2,=F'7'
         SRA   2,3
@@L3711  EQU   *
         AR    2,6
         SLR   15,15
         CLR   2,5
         BNH   @@L3678
         CLR   6,4
         BNL   @@L3678
         B     @@L3708
@@L3693  EQU   *
         SLR   3,3
         IC    3,2(7)
         L     2,=V(MODE@SIZ)
         SLR   7,7
         IC    7,0(2,3)
         LR    2,7
         A     2,=F'3'
         SRA   2,2
         B     @@L3711
@@L3689  EQU   *
         SLR   2,2
         IC    2,2(3)
         LR    3,2
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         A     4,=F'3'
         SRA   4,2
         B     @@L3710
@@L3714  EQU   *
         L     3,4(3)
         B     @@L3684
@@L3678  EQU   *
* Function reg_bitfield_target_p epilogue
         PDPEPIL
* Function reg_bitfield_target_p literal pool
         DS    0F
         LTORG
* Function reg_bitfield_target_p page table
         DS    0F
@@PGT72  EQU   *
         DC    A(@@PG72)
         DS    0F
* S-func distribute_notes prologue
@@62     PDPPRLG CINDEX=73,FRAME=136,BASER=12,ENTRY=NO
         B     @@FEN73
         LTORG
@@FEN73  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG73   EQU   *
         LR    11,1
         L     10,=A(@@PGT73)
* Function distribute_notes code
         L     6,0(11)
         LTR   6,6
         L     14,=A(@@L3899)
         BER   14
@@L3897  EQU   *
         MVC   116(4,13),=F'0'
         SLR   9,9
         L     3,4(6)
         LTR   3,3
         BE    @@L3720
         LH    2,0(3)
         CLM   2,3,=H'61'
         L     14,=A(@@L3918)
         BER   14
@@L3720  EQU   *
         L     12,0(,10)
         MVC   112(4,13),8(6)
         SLR   3,3
         IC    3,2(6)
         BCTR  3,0
         LA    4,29(0,0)
         CLR   3,4
         L     14,=A(@@L3888)
         BHR   14
         MH    3,=H'4'
         L     2,=A(@@L3889)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L3889  EQU   *
         DC    A(@@L3795)
         DC    A(@@L3763)
         DC    A(@@L3759)
         DC    A(@@L3759)
         DC    A(@@L3721)
         DC    A(@@L3783)
         DC    A(@@L3789)
         DC    A(@@L3721)
         DC    A(@@L3763)
         DC    A(@@L3747)
         DC    A(@@L3888)
         DC    A(@@L3888)
         DC    A(@@L3768)
         DC    A(@@L3888)
         DC    A(@@L3888)
         DC    A(@@L3761)
         DC    A(@@L3761)
         DC    A(@@L3759)
         DC    A(@@L3888)
         DC    A(@@L3761)
         DC    A(@@L3888)
         DC    A(@@L3888)
         DC    A(@@L3731)
         DC    A(@@L3888)
         DC    A(@@L3888)
         DC    A(@@L3742)
         DC    A(@@L3726)
         DC    A(@@L3742)
         DC    A(@@L3888)
         DC    A(@@L3761)
@@L3726  EQU   *
         L     8,8(11)
         LH    2,0(8)
         CLM   2,3,=H'33'
         BE    @@L3915
         L     2,12(11)
         LTR   2,2
         BE    @@L3729
         LH    2,0(2)
         CLM   2,3,=H'33'
         BE    @@L3766
@@L3729  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'12130'
@@L3912  EQU   *
         L     12,0(,10)
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L3721  EQU   *
         L     12,0(,10)
         LTR   9,9
         BE    @@L3890
         MVC   8(4,6),28(9)
         ST    6,28(9)
@@L3891  EQU   *
         L     2,116(13)
         LTR   2,2
         BE    @@L3718
         IC    2,2(6)
         CLM   2,1,=XL1'01'
         BE    @@L3896
         CLM   2,1,=XL1'0A'
         BE    @@L3896
@@L3895  EQU   *
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         MVC   96(4,13),4(6)
         L     3,116(13)
         MVC   100(4,13),28(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,28(3)
@@L3718  EQU   *
         L     6,112(13)
         LTR   6,6
         BNE   @@L3897
         L     14,=A(@@L3899)
         BR    14
@@L3896  EQU   *
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L3895
         L     2,4(3)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,24(3)
         A     2,=F'1'
         ST    2,24(3)
         B     @@L3895
@@L3890  EQU   *
         IC    2,2(6)
         CLM   2,1,=XL1'01'
         BE    @@L3893
         CLM   2,1,=XL1'0A'
         BNE   @@L3891
@@L3893  EQU   *
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L3891
         L     2,4(3)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,24(3)
         BCTR  2,0
         ST    2,24(3)
         B     @@L3891
@@L3766  EQU   *
         L     12,0(,10)
         L     9,12(11)
         B     @@L3721
@@L3915  EQU   *
         L     12,0(,10)
         LR    9,8
         B     @@L3721
@@L3795  EQU   *
         L     8,4(11)
         LTR   8,8
         BE    @@L3796
         LH    2,0(8)
         CLM   2,3,=H'34'
         L     14,=A(@@L3919)
         BER   14
@@L3796  EQU   *
         L     12,0(,10)
         MVC   88(4,13),4(6)
         L     2,8(11)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3798)
         BER   14
         LR    9,2
@@L3797  EQU   *
         L     12,0(,10)
         MVC   88(4,13),4(6)
         MVC   92(4,13),16(11)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L3721
         MVC   88(4,13),4(6)
         MVC   92(4,13),20(11)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L3721
         LTR   9,9
         L     14,=A(@@L3920)
         BER   14
@@L3803  EQU   *
         L     12,0(,10)
         LTR   9,9
         BE    @@L3721
         CLI   2(6),1
         BNE   @@L3721
         L     2,4(6)
         L     8,4(2)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(NOOP@MOV)
         BALR  14,15
         LTR   15,15
         BE    @@L3846
         L     2,=A(@@33)
         L     4,0(2)
         LR    3,4
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@27)
         A     3,0(2)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
         L     2,=A(@@28)
         MVC   0(4,2),=F'1'
@@L3846  EQU   *
         ST    9,88(13)
         MVC   92(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(DEDSET)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3921)
         BER   14
@@L3848  EQU   *
         L     12,0(,10)
         L     2,=A(@@10)
         L     4,0(2)
         LR    3,8
         MH    3,=H'4'
         L     2,0(3,4)
         CLR   2,9
         BE    @@L3849
         SLR   2,2
         ST    2,0(3,4)
@@L3849  EQU   *
         SLR   9,9
@@L3850  EQU   *
         L     12,0(,10)
         LTR   9,9
         BE    @@L3721
         LA    3,19(0,0)
         CLR   8,3
         BH    @@L3721
         LA    4,15(0,0)
         CLR   8,4
         BNH   @@L3852
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         LR    2,4
         A     2,=F'7'
         SRA   2,3
@@L3908  EQU   *
         LA    3,1(0,0)
         CR    2,3
         BNH   @@L3721
         LA    4,15(0,0)
         CLR   8,4
         BNH   @@L3856
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   7,7
         IC    7,0(2,3)
         A     7,=F'7'
         SRA   7,3
@@L3909  EQU   *
         AR    7,8
         LA    3,1(0,0)
         LR    5,8
         CLR   8,7
         BL    @@L3867
@@L3903  EQU   *
         LTR   3,3
         BNE   @@L3721
         LR    5,8
         CLR   8,7
         BL    @@L3887
@@L3905  EQU   *
         L     12,0(,10)
         SLR   9,9
         B     @@L3721
@@L3887  EQU   *
         LR    8,5
         MH    8,=H'4'
         ST    8,124(13)
         L     2,=V(REG@RAW@)
         L     2,0(8,2)
         ST    2,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
         LR    8,15
         L     2,=A(@@33)
         L     2,0(2)
         SLL   2,2
         L     3,=V(BBINFO)
         A     2,0(3)
         MVC   128(4,13),16(2)
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(DEDSET)
         BALR  14,15
         LTR   15,15
         BNE   @@L3873
         ST    8,88(13)
         MVC   92(4,13),16(9)
         LA    1,88(,13)
         L     15,=A(@@98)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L3922
@@L3873  EQU   *
         ST    5,88(13)
         A     5,=F'1'
         ST    5,92(13)
         BCTR  5,0
         MVC   96(4,13),16(9)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(REFERS@T)
         BALR  14,15
         LTR   15,15
         BE    @@L3923
@@L3871  EQU   *
         LA    3,15(0,0)
         CLR   5,3
         BNH   @@L3883
         L     2,=V(REG@RAW@)
         L     4,124(13)
         L     3,0(4,2)
         L     2,=V(MODE@SIZ)
         SLR   8,8
         IC    8,0(2,3)
         LR    2,8
         A     2,=F'7'
         SRA   2,3
@@L3910  EQU   *
         AR    2,5
         LR    5,2
         CLR   2,7
         BL    @@L3887
         B     @@L3905
@@L3883  EQU   *
         L     2,=V(REG@RAW@)
         L     4,124(13)
         L     3,0(4,2)
         L     2,=V(MODE@SIZ)
         SLR   8,8
         IC    8,0(2,3)
         LR    2,8
         A     2,=F'3'
         SRA   2,2
         B     @@L3910
@@L3923  EQU   *
         ST    9,88(13)
         MVC   92(4,13),=F'48'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNFUS)
         BALR  14,15
         LTR   15,15
         BNE   @@L3871
         L     4,8(9)
@@L3876  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3879
         L     2,128(13)
         CL    4,0(2)
         BE    @@L3924
@@L3878  EQU   *
         L     4,8(4)
         B     @@L3876
@@L3924  EQU   *
         L     2,=A(@@33)
         L     4,0(2)
         LR    3,4
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@27)
         A     3,0(2)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
         L     2,=A(@@28)
         MVC   0(4,2),=F'1'
         B     @@L3871
@@L3879  EQU   *
         ST    4,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(DEDSET)
         BALR  14,15
         LTR   15,15
         BNE   @@L3882
         ST    8,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=A(@@98)
         BALR  14,15
         LTR   15,15
         BE    @@L3878
@@L3882  EQU   *
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'10'
         ST    8,96(13)
         MVC   100(4,13),28(4)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,28(4)
         B     @@L3871
@@L3922  EQU   *
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'1'
         ST    8,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         ST    9,92(13)
         ST    9,96(13)
         ST    2,100(13)
         ST    2,104(13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
         B     @@L3871
@@L3867  EQU   *
         ST    5,88(13)
         LR    2,5
         A     2,=F'1'
         ST    2,92(13)
         MVC   96(4,13),16(9)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(REFERS@T)
         BALR  14,15
         LTR   15,15
         BNE   @@L3866
         ST    9,88(13)
         MVC   92(4,13),=F'48'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNFUS)
         BALR  14,15
         LTR   15,15
         BE    @@L3865
@@L3866  EQU   *
         ST    9,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(DETSREG)
         BALR  14,15
         LTR   15,15
         BE    @@L3862
@@L3865  EQU   *
         SLR   3,3
@@L3862  EQU   *
         LR    5,2
         CLR   2,7
         BL    @@L3867
         B     @@L3903
@@L3856  EQU   *
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   7,7
         IC    7,0(2,3)
         A     7,=F'3'
         SRA   7,2
         B     @@L3909
@@L3852  EQU   *
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         LR    2,4
         A     2,=F'3'
         SRA   2,2
         B     @@L3908
@@L3921  EQU   *
         MVC   88(4,13),4(6)
         MVC   92(4,13),16(9)
         LA    1,88(,13)
         L     15,=A(@@98)
         BALR  14,15
         LTR   15,15
         BNE   @@L3848
         L     2,=A(@@10)
         L     3,0(2)
         LR    2,8
         MH    2,=H'4'
         ST    9,0(2,3)
         B     @@L3850
@@L3920  EQU   *
         L     2,=A(@@33)
         L     2,0(2)
         SLL   2,2
         L     3,=V(BBINFO)
         A     2,0(3)
         MVC   120(4,13),16(2)
         L     8,8(11)
         L     4,8(8)
@@L3843  EQU   *
         L     3,=V(RTX@CLAS)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3808
         L     2,120(13)
         CL    4,0(2)
         BE    @@L3805
@@L3806  EQU   *
         L     4,8(4)
         LTR   9,9
         BE    @@L3843
@@L3805  EQU   *
         L     12,0(,10)
         CLI   2(6),1
         BNE   @@L3803
         LTR   9,9
         BNE   @@L3803
         L     4,120(13)
         MVC   88(4,13),32(4)
         L     2,4(6)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@B)
         BALR  14,15
         LTR   15,15
         BE    @@L3803
         L     2,=A(@@33)
         L     4,0(2)
         LR    3,4
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@27)
         A     3,0(2)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
         L     2,=A(@@28)
         MVC   0(4,2),=F'1'
         B     @@L3803
@@L3808  EQU   *
         MVC   88(4,13),4(6)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3810)
         BER   14
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L3926)
         BER   14
         SLR   5,5
@@L3812  EQU   *
         L     12,0(,10)
         SLR   7,7
         LR    8,7
         LTR   5,5
         BE    @@L3815
         L     8,4(5)
         LH    3,0(8)
         LR    2,3
         AH    2,=H'-63'
         CLM   2,3,=H'1'
         L     14,=A(@@L3927)
         BHR   14
@@L3820  EQU   *
         L     12,0(,10)
         L     8,4(8)
         LH    3,0(8)
         LR    2,3
         AH    2,=H'-63'
         CLM   2,3,=H'1'
         BNH   @@L3820
         CLM   3,3,=H'133'
         BE    @@L3820
@@L3815  EQU   *
         L     12,0(,10)
         LTR   5,5
         BE    @@L3821
         MVC   88(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L3928
@@L3821  EQU   *
         MVC   88(4,13),4(6)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         BE    @@L3826
         LR    9,4
         ST    4,88(13)
         MVC   92(4,13),=F'10'
         L     2,4(6)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(FREGNONO)
         BALR  14,15
         LTR   15,15
         BE    @@L3929
@@L3830  EQU   *
         L     12,0(,10)
         L     3,120(13)
         CL    4,0(3)
         BNE   @@L3806
         B     @@L3805
@@L3929  EQU   *
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'10'
         MVC   96(4,13),4(6)
         MVC   100(4,13),28(4)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,28(4)
         B     @@L3830
@@L3826  EQU   *
         MVI   2(6),10
         ST    4,88(13)
         MVC   92(4,13),=F'10'
         L     2,4(6)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(FREGNONO)
         BALR  14,15
         LTR   15,15
         BNE   @@L3805
         LR    9,4
         B     @@L3805
@@L3928  EQU   *
         MVC   88(4,13),4(6)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L3821
         L     3,=V(GLBRTL)
         MVC   88(4,13),4(3)
         MVC   92(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L3822
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@CC0)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BE    @@L3821
         MVC   88(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(SETS@CC0)
         BALR  14,15
         LTR   15,15
         BNH   @@L3821
@@L3822  EQU   *
         MVC   16(4,4),0(3)
         MVC   88(4,13),28(4)
         ST    4,92(13)
         ST    4,96(13)
         ST    2,100(13)
         ST    2,104(13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
         MVC   88(4,13),24(4)
         LA    1,88(,13)
         L     15,=A(@@61)
         BALR  14,15
         MVC   0(2,4),=H'37'
         MVC   20(4,4),=F'-99'
         ST    2,16(4)
         LTR   7,7
         BE    @@L3830
         MVC   16(4,7),0(3)
         MVC   88(4,13),28(7)
         ST    7,92(13)
         ST    7,96(13)
         ST    2,100(13)
         ST    2,104(13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
         MVC   88(4,13),24(7)
         LA    1,88(,13)
         L     15,=A(@@61)
         BALR  14,15
         MVC   0(2,7),=H'37'
         MVC   20(4,7),=F'-99'
         ST    2,16(7)
         B     @@L3830
@@L3927  EQU   *
         CLM   3,3,=H'133'
         BNE   @@L3815
         B     @@L3820
@@L3926  EQU   *
         L     2,16(4)
         LH    3,0(2)
         LR    5,2
         CLM   3,3,=H'47'
         BE    @@L3812
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    5,15
         B     @@L3812
@@L3810  EQU   *
         MVC   88(4,13),4(6)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         BNE   @@L3832
         LH    2,0(4)
         CLM   2,3,=H'34'
         BNE   @@L3830
         ST    4,88(13)
         MVC   92(4,13),=F'48'
         MVC   96(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(FREGFUS)
         BALR  14,15
         LTR   15,15
         BE    @@L3830
@@L3832  EQU   *
         LR    9,4
         L     3,12(11)
         LTR   3,3
         BE    @@L3805
         L     3,4(4)
         L     2,=A(@@21)
         L     5,0(2)
         CR    3,5
         BH    @@L3805
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         L     7,0(3,2)
         L     8,12(11)
         L     3,4(8)
         CR    3,5
         L     14,=A(@@L3930)
         BHR   14
         MH    3,=H'4'
         C     7,0(3,2)
         BNH   @@L3805
@@L3837  EQU   *
         L     12,0(,10)
         L     2,4(11)
         LTR   2,2
         BE    @@L3805
         L     15,4(2)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L3931
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     5,0(15,2)
@@L3839  EQU   *
         L     12,0(,10)
         L     8,12(11)
         L     3,4(8)
         L     2,=A(@@21)
         C     3,0(2)
         BH    @@L3932
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         C     5,0(3,2)
         BNH   @@L3805
@@L3841  EQU   *
         MVC   88(4,13),4(6)
         L     2,12(11)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         BE    @@L3805
         L     2,24(4)
         MVC   24(4,4),=F'0'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@61)
         BALR  14,15
         B     @@L3805
@@L3932  EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         CR    5,15
         BH    @@L3841
         B     @@L3805
@@L3931  EQU   *
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         LR    5,15
         B     @@L3839
@@L3930  EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         CR    7,15
         BH    @@L3837
         B     @@L3805
@@L3798  EQU   *
         L     3,12(11)
         LTR   3,3
         BE    @@L3797
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         CL    15,8(11)
         BNE   @@L3797
         MVC   88(4,13),4(6)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         BE    @@L3797
         LR    9,3
         B     @@L3797
@@L3919  EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'48'
         MVC   96(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(FREGFUS)
         BALR  14,15
         LTR   15,15
         BE    @@L3796
         LR    9,8
         B     @@L3797
@@L3783  EQU   *
         L     3,4(11)
         LH    2,0(3)
         LR    9,3
         CLM   2,3,=H'37'
         BNE   @@L3721
         MVC   88(4,13),4(6)
         MVC   92(4,13),=F'7'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(PREV@REA)
         BALR  14,15
@@L3917  EQU   *
         L     12,0(,10)
         LR    9,15
         LTR   4,4
         L     14,=A(@@L3792)
         BER   14
         LTR   15,15
         L     14,=A(@@L3792)
         BER   14
         ST    15,4(4)
         B     @@L3721
@@L3792  EQU   *
         L     2,4(6)
         CL    2,4(11)
         B     @@PGE73
         DS    0F
         LTORG
         DS    0F
@@PGE73  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG74   EQU   *
         L     14,=A(@@L3721)
         BNER  14
         L     14,=A(@@L3905)
         BR    14
@@L3789  EQU   *
         L     12,4(,10)
         L     4,4(11)
         LH    2,0(4)
         LR    9,4
         CLM   2,3,=H'37'
         L     14,=A(@@L3721)
         BNER  14
         MVC   88(4,13),4(6)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         L     14,=A(@@L3917)
         BR    14
@@L3763  EQU   *
         L     12,4(,10)
         MVC   88(4,13),4(6)
         L     8,8(11)
         MVC   92(4,13),16(8)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L3764
         LR    9,8
@@L3764  EQU   *
         L     12,4(,10)
         L     2,12(11)
         LTR   2,2
         L     14,=A(@@L3721)
         BER   14
         MVC   88(4,13),4(6)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3721)
         BER   14
         LTR   9,9
         L     14,=A(@@L3766)
         BER   14
         MVC   116(4,13),12(11)
         L     14,=A(@@L3721)
         BR    14
@@L3747  EQU   *
         L     12,4(,10)
         MVC   88(4,13),4(6)
         L     8,8(11)
         MVC   92(4,13),16(8)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         BE    @@L3748
         L     2,4(11)
         CLR   2,8
         L     14,=A(@@L3721)
         BNER  14
         L     2,4(6)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BE    @@L3933
         MVC   88(4,13),4(11)
         MVC   92(4,13),=F'10'
         MVC   96(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
@@L3906  EQU   *
         L     12,4(,10)
         LTR   15,15
         L     14,=A(@@L3721)
         BNER  14
@@L3761  EQU   *
         L     12,4(,10)
         L     9,8(11)
         L     14,=A(@@L3721)
         BR    14
@@L3933  EQU   *
         L     12,4(,10)
         MVC   88(4,13),4(11)
         MVC   92(4,13),=F'10'
         L     2,4(6)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(FREGNONO)
         BALR  14,15
         B     @@L3906
@@L3748  EQU   *
         L     12,4(,10)
         MVC   88(4,13),4(6)
         L     3,8(11)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3721)
         BER   14
         L     2,4(6)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BE    @@L3934
         MVC   88(4,13),8(11)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
@@L3907  EQU   *
         L     12,4(,10)
         LTR   15,15
         L     14,=A(@@L3721)
         BNER  14
         MVI   2(6),1
         B     @@L3761
@@L3934  EQU   *
         L     12,4(,10)
         MVC   88(4,13),8(11)
         MVC   92(4,13),=F'1'
         L     2,4(6)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(FREGNONO)
         BALR  14,15
         B     @@L3907
@@L3768  EQU   *
         L     12,4(,10)
         MVC   88(4,13),4(6)
         L     3,8(11)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L3935
@@L3770  EQU   *
         L     12,4(,10)
         L     9,8(11)
@@L3769  EQU   *
         L     12,4(,10)
         L     4,12(11)
         LTR   4,4
         BE    @@L3771
         MVC   88(4,13),4(6)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L3936
@@L3772  EQU   *
         L     12,4(,10)
         LTR   9,9
         BE    @@L3773
         MVC   116(4,13),12(11)
@@L3771  EQU   *
         L     12,4(,10)
         LTR   9,9
         BE    @@L3775
         LH    2,0(9)
         CLM   2,3,=H'33'
         BE    @@L3937
@@L3775  EQU   *
         L     12,4(,10)
         L     8,116(13)
         LTR   8,8
         L     14,=A(@@L3721)
         BER   14
         LH    2,0(8)
         CLM   2,3,=H'33'
         L     14,=A(@@L3721)
         BNER  14
         L     2,32(8)
         LTR   2,2
         L     14,=A(@@L3721)
         BER   14
         CL    2,4(6)
         BE    @@L3779
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'12278'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L3779  EQU   *
         L     12,4(,10)
         L     2,116(13)
         L     3,32(2)
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L3938
@@L3780  EQU   *
         L     12,4(,10)
         MVC   116(4,13),=F'0'
         L     14,=A(@@L3721)
         BR    14
@@L3938  EQU   *
         L     12,4(,10)
         L     2,16(3)
         BCTR  2,0
         ST    2,16(3)
         B     @@L3780
@@L3937  EQU   *
         L     12,4(,10)
         L     2,32(9)
         LTR   2,2
         BE    @@L3775
         CL    2,4(6)
         BE    @@L3776
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'12270'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L3776  EQU   *
         L     12,4(,10)
         L     15,32(9)
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L3939
@@L3777  EQU   *
         L     12,4(,10)
         SLR   9,9
         B     @@L3775
@@L3939  EQU   *
         L     12,4(,10)
         L     2,16(15)
         BCTR  2,0
         ST    2,16(15)
         B     @@L3777
@@L3773  EQU   *
         L     12,4(,10)
         L     9,12(11)
         B     @@L3771
@@L3936  EQU   *
         L     12,4(,10)
         MVC   88(4,13),12(11)
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L3771
         L     15,4(15)
         LH    2,0(15)
         CLM   2,3,=H'67'
         BNE   @@L3771
         L     2,4(15)
         CL    2,4(6)
         BNE   @@L3771
         B     @@L3772
@@L3935  EQU   *
         L     12,4(,10)
         MVC   88(4,13),8(11)
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L3769
         L     15,4(15)
         LH    2,0(15)
         CLM   2,3,=H'67'
         BNE   @@L3769
         L     2,4(15)
         CL    2,4(6)
         BNE   @@L3769
         B     @@L3770
@@L3759  EQU   *
         L     12,4(,10)
         L     4,4(11)
         CL    4,8(11)
         L     14,=A(@@L3721)
         BNER  14
         L     2,4(6)
         LTR   2,2
         BE    @@L3761
         LH    3,0(2)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L3761
         CLM   3,3,=H'54'
         BE    @@L3761
         CLM   3,3,=H'55'
         BE    @@L3761
         CLM   3,3,=H'58'
         BE    @@L3761
         CLM   3,3,=H'134'
         BE    @@L3761
         CLM   3,3,=H'56'
         BE    @@L3761
         CLM   3,3,=H'140'
         L     14,=A(@@L3721)
         BNER  14
         B     @@L3761
@@L3731  EQU   *
         L     12,4(,10)
         L     3,8(11)
         LH    2,0(3)
         CLM   2,3,=H'34'
         BE    @@L3914
         L     4,12(11)
         LTR   4,4
         BE    @@L3734
         LH    2,0(4)
         CLM   2,3,=H'34'
         BE    @@L3913
@@L3734  EQU   *
         L     12,4(,10)
         L     2,=V(FLNCALXC)
         L     2,0(2)
         LTR   2,2
         BE    @@L3736
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(MAY@TRAP)
         BALR  14,15
         LTR   15,15
         BNE   @@L3761
         L     8,12(11)
         LTR   8,8
         L     14,=A(@@L3721)
         BER   14
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(MAY@TRAP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3721)
         BER   14
         L     14,=A(@@L3915)
         BR    14
@@L3736  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'12150'
         L     14,=A(@@L3912)
         BR    14
@@L3913  EQU   *
         L     12,4(,10)
         LR    9,4
         L     14,=A(@@L3721)
         BR    14
@@L3914  EQU   *
         L     12,4(,10)
         LR    9,3
         L     14,=A(@@L3721)
         BR    14
@@L3742  EQU   *
         L     12,4(,10)
         L     3,8(11)
         LH    2,0(3)
         CLM   2,3,=H'34'
         BE    @@L3914
         L     4,12(11)
         LTR   4,4
         BE    @@L3745
         LH    2,0(4)
         CLM   2,3,=H'34'
         BE    @@L3913
@@L3745  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'12162'
         L     14,=A(@@L3912)
         BR    14
@@L3888  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'12625'
         L     14,=A(@@L3912)
         BR    14
@@L3918  EQU   *
         L     12,4(,10)
         L     3,4(3)
         LA    2,19(0,0)
         CLR   3,2
         L     14,=A(@@L3720)
         BNHR  14
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     2,48(2)
         MH    3,=H'4'
         L     3,0(3,2)
         ST    3,4(6)
         L     14,=A(@@L3720)
         BR    14
@@L3899  EQU   *
         L     12,4(,10)
* Function distribute_notes epilogue
         PDPEPIL
* Function distribute_notes literal pool
         DS    0F
         LTORG
* Function distribute_notes page table
         DS    0F
@@PGT73  EQU   *
         DC    A(@@PG73)
         DC    A(@@PG74)
         DS    0F
* S-func distribute_links prologue
@@61     PDPPRLG CINDEX=75,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN75
         LTORG
@@FEN75  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG75   EQU   *
         LR    11,1
         L     10,=A(@@PGT75)
* Function distribute_links code
         L     6,0(11)
         LTR   6,6
         BE    @@L3981
@@L3979  EQU   *
         SLR   7,7
         L     8,8(6)
         L     4,4(6)
         LH    2,0(4)
         CLM   2,3,=H'37'
         BE    @@L3943
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3987
         LR    2,7
@@L3948  EQU   *
         LTR   2,2
         BE    @@L3943
         L     5,4(2)
         LH    2,0(5)
         CLM   2,3,=H'63'
         BE    @@L3954
         CLM   2,3,=H'133'
         BE    @@L3954
         CLM   2,3,=H'132'
         BE    @@L3954
         CLM   2,3,=H'64'
         BE    @@L3954
@@L3983  EQU   *
         L     2,4(6)
         L     4,12(2)
@@L3955  EQU   *
         LTR   4,4
         BE    @@L3956
         L     2,=V(N@BASIC@)
         L     3,0(2)
         BCTR  3,0
         L     2,=A(@@33)
         L     15,0(2)
         CLR   15,3
         BE    @@L3964
         MH    15,=H'4'
         L     2,=V(BBINFO)
         A     15,0(2)
         L     2,20(15)
         L     2,0(2)
         CLR   2,4
         BE    @@L3956
@@L3964  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3988
@@L3960  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'34'
         BE    @@L3989
@@L3957  EQU   *
         L     4,12(4)
         B     @@L3955
@@L3989  EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'48'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(FREGFUS)
         BALR  14,15
         LTR   15,15
         BE    @@L3957
@@L3986  EQU   *
         LR    7,4
@@L3956  EQU   *
         LTR   7,7
         BE    @@L3943
         L     3,24(7)
         LTR   3,3
         BE    @@L3967
@@L3971  EQU   *
         L     2,4(3)
         CL    2,4(6)
         BE    @@L3967
         L     3,8(3)
         LTR   3,3
         BNE   @@L3971
@@L3967  EQU   *
         LTR   3,3
         BE    @@L3990
@@L3943  EQU   *
         LR    6,8
         LTR   8,8
         BNE   @@L3979
         B     @@L3981
@@L3990  EQU   *
         MVC   8(4,6),24(7)
         ST    6,24(7)
         L     2,=A(@@53)
         L     3,0(2)
         LTR   3,3
         BE    @@L3974
         L     15,4(3)
         L     2,=A(@@21)
         C     15,0(2)
         BH    @@L3991
         L     2,=A(@@20)
         L     2,0(2)
         MH    15,=H'4'
         L     4,0(15,2)
@@L3976  EQU   *
         L     3,4(7)
         L     2,=A(@@21)
         C     3,0(2)
         BH    @@L3992
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         C     4,0(3,2)
         BNH   @@L3943
@@L3974  EQU   *
         L     2,=A(@@53)
         ST    7,0(2)
         B     @@L3943
@@L3992  EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         CR    4,15
         BH    @@L3974
         B     @@L3943
@@L3991  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@46)
         BALR  14,15
         LR    4,15
         B     @@L3976
@@L3988  EQU   *
         ST    5,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LTR   15,15
         BE    @@L3960
         ST    5,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         BE    @@L3956
         B     @@L3986
@@L3954  EQU   *
         L     5,4(5)
         LH    2,0(5)
         CLM   2,3,=H'63'
         BE    @@L3954
         CLM   2,3,=H'133'
         BE    @@L3954
         CLM   2,3,=H'132'
         BE    @@L3954
         CLM   2,3,=H'64'
         BE    @@L3954
         B     @@L3983
@@L3987  EQU   *
         L     2,16(4)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L3948
         ST    4,88(13)
         L     2,4(6)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
         B     @@L3948
@@L3981  EQU   *
* Function distribute_links epilogue
         PDPEPIL
* Function distribute_links literal pool
         DS    0F
         LTORG
* Function distribute_links page table
         DS    0F
@@PGT75  EQU   *
         DC    A(@@PG75)
         DS    0F
* S-func insn_cuid prologue
@@46     PDPPRLG CINDEX=76,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN76
         LTORG
@@FEN76  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG76   EQU   *
         LR    11,1
         L     10,=A(@@PGT76)
* Function insn_cuid code
         L     4,0(11)
@@L4001  EQU   *
         LTR   4,4
         BE    @@L3995
         L     3,4(4)
         L     2,=A(@@21)
         L     5,0(2)
         CR    3,5
         BNH   @@L3995
         LH    2,0(4)
         CH    2,=H'32'
         BE    @@L4003
@@L3995  EQU   *
         L     5,=A(@@21)
         L     2,4(4)
         C     2,0(5)
         BH    @@L4004
@@L3999  EQU   *
         L     3,4(4)
         C     3,0(5)
         BH    @@L4001
         B     @@L4005
@@L4004  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'12755'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L3999
@@L4003  EQU   *
         L     2,16(4)
         LH    2,0(2)
         CLM   2,3,=H'48'
         BNE   @@L3995
@@L3998  EQU   *
         L     4,12(4)
         LTR   4,4
         BE    @@L3995
         L     2,4(4)
         CR    2,5
         BNH   @@L3995
         LH    2,0(4)
         CLM   2,3,=H'32'
         BNE   @@L3995
         L     2,16(4)
         LH    2,0(2)
         CLM   2,3,=H'48'
         BE    @@L3998
         B     @@L3995
@@L4005  EQU   *
         L     2,=A(@@20)
         L     2,0(2)
         MH    3,=H'4'
         L     15,0(3,2)
* Function insn_cuid epilogue
         PDPEPIL
* Function insn_cuid literal pool
         DS    0F
         LTORG
* Function insn_cuid page table
         DS    0F
@@PGT76  EQU   *
         DC    A(@@PG76)
@@LC3    EQU   *
         DC    C';; Combiner statistics: %d attempts, %d substitu'
         DC    C'tions (%d requiring new space),'
         DC    X'15'
         DC    C';; %d successes.'
         DC    X'15'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func dmpcstat prologue
DMPCSTAT PDPPRLG CINDEX=77,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN77
         LTORG
@@FEN77  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG77   EQU   *
         LR    11,1
         L     10,=A(@@PGT77)
* Function dmpcstat code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=A(@@LC3)
         L     2,=A(@@3)
         MVC   96(4,13),0(2)
         L     2,=A(@@4)
         MVC   100(4,13),0(2)
         L     2,=A(@@5)
         MVC   104(4,13),0(2)
         L     2,=A(@@6)
         MVC   108(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FNOTICE)
         BALR  14,15
* Function dmpcstat epilogue
         PDPEPIL
* Function dmpcstat literal pool
         DS    0F
         LTORG
* Function dmpcstat page table
         DS    0F
@@PGT77  EQU   *
         DC    A(@@PG77)
@@LC4    EQU   *
         DC    X'15'
         DC    C';; Combiner totals: %d attempts, %d substitution'
         DC    C's (%d requiring new space),'
         DC    X'15'
         DC    C';; %d successes.'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func dmpctotstats prologue
DMPCTOTS PDPPRLG CINDEX=78,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN78
         LTORG
@@FEN78  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG78   EQU   *
         LR    11,1
         L     10,=A(@@PGT78)
* Function dmpctotstats code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=A(@@LC4)
         L     2,=A(@@38)
         MVC   96(4,13),0(2)
         L     2,=A(@@39)
         MVC   100(4,13),0(2)
         L     2,=A(@@40)
         MVC   104(4,13),0(2)
         L     2,=A(@@41)
         MVC   108(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FNOTICE)
         BALR  14,15
* Function dmpctotstats epilogue
         PDPEPIL
* Function dmpctotstats literal pool
         DS    0F
         LTORG
* Function dmpctotstats page table
         DS    0F
@@PGT78  EQU   *
         DC    A(@@PG78)
         DS    0F
@@3      EQU   *
         DC    4X'00'
         DS    0F
@@4      EQU   *
         DC    4X'00'
         DS    0F
@@5      EQU   *
         DC    4X'00'
         DS    0F
@@6      EQU   *
         DC    4X'00'
         DS    0F
@@38     EQU   *
         DC    4X'00'
         DS    0F
@@39     EQU   *
         DC    4X'00'
         DS    0F
@@40     EQU   *
         DC    4X'00'
         DS    0F
@@41     EQU   *
         DC    4X'00'
         DS    0F
@@20     EQU   *
         DC    4X'00'
         DS    0F
@@21     EQU   *
         DC    4X'00'
         DS    0F
@@7      EQU   *
         DC    4X'00'
         DS    0F
@@10     EQU   *
         DC    4X'00'
         DS    0F
@@11     EQU   *
         DC    4X'00'
         DS    0F
@@35     EQU   *
         DC    4X'00'
         DS    0F
@@34     EQU   *
         DC    4X'00'
         DS    0F
@@30     EQU   *
         DC    4X'00'
         DS    0F
@@25     EQU   *
         DC    4X'00'
         DS    0F
@@29     EQU   *
         DC    4X'00'
         DS    0F
@@52     EQU   *
         DC    4X'00'
         DS    0F
@@53     EQU   *
         DC    4X'00'
         DS    0F
@@33     EQU   *
         DC    4X'00'
         DS    0F
@@27     EQU   *
         DC    4X'00'
         DS    0F
@@28     EQU   *
         DC    4X'00'
         DS    0F
@@12     EQU   *
         DC    4X'00'
         DS    0F
@@14     EQU   *
         DC    4X'00'
         DS    0F
@@13     EQU   *
         DC    4X'00'
         DS    0F
@@15     EQU   *
         DC    4X'00'
         DS    0F
@@24     EQU   *
         DC    4X'00'
         DS    0F
@@8      EQU   *
         DC    4X'00'
         DS    0F
@@22     EQU   *
         DC    4X'00'
         DS    0F
@@9      EQU   *
         DC    4X'00'
         DS    0F
@@23     EQU   *
         DC    4X'00'
         DS    0F
@@16     EQU   *
         DC    4X'00'
         DS    0F
@@17     EQU   *
         DC    4X'00'
         DS    0F
@@18     EQU   *
         DC    4X'00'
         DS    0F
@@1      EQU   *
         DC    12X'00'
         DS    0F
@@56     EQU   *
         DC    4X'00'
         DS    0F
@@96     EQU   *
         DC    4X'00'
         DS    0F
@@95     EQU   *
         DC    4X'00'
         DS    0F
@@97     EQU   *
         DC    4X'00'
         END
