         COPY  PDPTOP
         CSECT
* Program text area
         DS    0F
* S-func ustrcmp prologue
@@0      PDPPRLG CINDEX=0,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function ustrcmp code
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
* Function ustrcmp epilogue
         PDPEPIL
* Function ustrcmp literal pool
         DS    0F
         LTORG
* Function ustrcmp page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
         DS    0F
* S-func ustrncmp prologue
@@1      PDPPRLG CINDEX=1,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function ustrncmp code
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
* Function ustrncmp epilogue
         PDPEPIL
* Function ustrncmp literal pool
         DS    0F
         LTORG
* Function ustrncmp page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
         DS    0F
* S-func ustrlen prologue
@@2      PDPPRLG CINDEX=2,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function ustrlen code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
* Function ustrlen epilogue
         PDPEPIL
* Function ustrlen literal pool
         DS    0F
         LTORG
* Function ustrlen page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
         DS    0F
* S-func uxstrdup prologue
@@3      PDPPRLG CINDEX=3,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function uxstrdup code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
* Function uxstrdup epilogue
         PDPEPIL
* Function uxstrdup literal pool
         DS    0F
         LTORG
* Function uxstrdup page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
         DS    0F
* S-func ustrchr prologue
@@4      PDPPRLG CINDEX=4,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN4
         LTORG
@@FEN4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         LR    11,1
         L     10,=A(@@PGT4)
* Function ustrchr code
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
* Function ustrchr epilogue
         PDPEPIL
* Function ustrchr literal pool
         DS    0F
         LTORG
* Function ustrchr page table
         DS    0F
@@PGT4   EQU   *
         DC    A(@@PG4)
         DS    0F
* S-func ufputs prologue
@@5      PDPPRLG CINDEX=5,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN5
         LTORG
@@FEN5   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         LR    11,1
         L     10,=A(@@PGT5)
* Function ufputs code
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
* Function ufputs epilogue
         PDPEPIL
* Function ufputs literal pool
         DS    0F
         LTORG
* Function ufputs page table
         DS    0F
@@PGT5   EQU   *
         DC    A(@@PG5)
* X-var _cpp_trigraph_map
         ENTRY @CPP@TRI
* Program data area
@CPP@TRI EQU   *
         DC    X'00'
         DC    255X'00'
* Program text area
         DS    0F
* S-func init_trigraph_map prologue
@@6      PDPPRLG CINDEX=6,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN6
         LTORG
@@FEN6   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG6    EQU   *
         LR    11,1
         L     10,=A(@@PGT6)
* Function init_trigraph_map code
         L     2,=A(@CPP@TRI)
         MVI   126(2),123
         MVI   93(2),189
         MVI   90(2),79
         MVI   77(2),173
         MVI   125(2),95
         MVI   110(2),208
         MVI   97(2),224
         MVI   76(2),192
         MVI   96(2),161
* Function init_trigraph_map epilogue
         PDPEPIL
* Function init_trigraph_map literal pool
         DS    0F
         LTORG
* Function init_trigraph_map page table
         DS    0F
@@PGT6   EQU   *
         DC    A(@@PG6)
@@LC0    EQU   *
         DC    C'$'
         DC    X'0'
@@LC1    EQU   *
         DC    C'+'
         DC    X'0'
@@LC2    EQU   *
         DC    C'-help'
         DC    X'0'
@@LC3    EQU   *
         DC    C'-target-help'
         DC    X'0'
@@LC4    EQU   *
         DC    C'-version'
         DC    X'0'
@@LC5    EQU   *
         DC    C'A'
         DC    X'0'
@@LC6    EQU   *
         DC    C'assertion missing after %s'
         DC    X'0'
@@LC7    EQU   *
         DC    C'C'
         DC    X'0'
@@LC8    EQU   *
         DC    C'D'
         DC    X'0'
@@LC9    EQU   *
         DC    C'macro name missing after %s'
         DC    X'0'
@@LC10   EQU   *
         DC    C'H'
         DC    X'0'
@@LC11   EQU   *
         DC    C'I'
         DC    X'0'
@@LC12   EQU   *
         DC    C'directory name missing after %s'
         DC    X'0'
@@LC13   EQU   *
         DC    C'M'
         DC    X'0'
@@LC14   EQU   *
         DC    C'MD'
         DC    X'0'
@@LC15   EQU   *
         DC    C'file name missing after %s'
         DC    X'0'
@@LC16   EQU   *
         DC    C'MF'
         DC    X'0'
@@LC17   EQU   *
         DC    C'MG'
         DC    X'0'
@@LC18   EQU   *
         DC    C'MM'
         DC    X'0'
@@LC19   EQU   *
         DC    C'MMD'
         DC    X'0'
@@LC20   EQU   *
         DC    C'MP'
         DC    X'0'
@@LC21   EQU   *
         DC    C'MQ'
         DC    X'0'
@@LC22   EQU   *
         DC    C'target missing after %s'
         DC    X'0'
@@LC23   EQU   *
         DC    C'MT'
         DC    X'0'
@@LC24   EQU   *
         DC    C'P'
         DC    X'0'
@@LC25   EQU   *
         DC    C'U'
         DC    X'0'
@@LC26   EQU   *
         DC    C'W'
         DC    X'0'
@@LC27   EQU   *
         DC    C'argument missing after %s'
         DC    X'0'
@@LC28   EQU   *
         DC    C'd'
         DC    X'0'
@@LC29   EQU   *
         DC    C'fleading-underscore'
         DC    X'0'
@@LC30   EQU   *
         DC    C'fno-leading-underscore'
         DC    X'0'
@@LC31   EQU   *
         DC    C'fno-operator-names'
         DC    X'0'
@@LC32   EQU   *
         DC    C'fno-preprocessed'
         DC    X'0'
@@LC33   EQU   *
         DC    C'fno-show-column'
         DC    X'0'
@@LC34   EQU   *
         DC    C'fpreprocessed'
         DC    X'0'
@@LC35   EQU   *
         DC    C'fshow-column'
         DC    X'0'
@@LC36   EQU   *
         DC    C'fsigned-char'
         DC    X'0'
@@LC37   EQU   *
         DC    C'ftabstop='
         DC    X'0'
@@LC38   EQU   *
         DC    C'number missing after %s'
         DC    X'0'
@@LC39   EQU   *
         DC    C'funsigned-char'
         DC    X'0'
@@LC40   EQU   *
         DC    C'h'
         DC    X'0'
@@LC41   EQU   *
         DC    C'idirafter'
         DC    X'0'
@@LC42   EQU   *
         DC    C'imacros'
         DC    X'0'
@@LC43   EQU   *
         DC    C'include'
         DC    X'0'
@@LC44   EQU   *
         DC    C'iprefix'
         DC    X'0'
@@LC45   EQU   *
         DC    C'path name missing after %s'
         DC    X'0'
@@LC46   EQU   *
         DC    C'isystem'
         DC    X'0'
@@LC47   EQU   *
         DC    C'iwithprefix'
         DC    X'0'
@@LC48   EQU   *
         DC    C'iwithprefixbefore'
         DC    X'0'
@@LC49   EQU   *
         DC    C'lang-asm'
         DC    X'0'
@@LC50   EQU   *
         DC    C'lang-c'
         DC    X'0'
@@LC51   EQU   *
         DC    C'lang-c++'
         DC    X'0'
@@LC52   EQU   *
         DC    C'lang-c89'
         DC    X'0'
@@LC53   EQU   *
         DC    C'lang-objc'
         DC    X'0'
@@LC54   EQU   *
         DC    C'lang-objc++'
         DC    X'0'
@@LC55   EQU   *
         DC    C'nostdinc'
         DC    X'0'
@@LC56   EQU   *
         DC    C'nostdinc++'
         DC    X'0'
@@LC57   EQU   *
         DC    C'o'
         DC    X'0'
@@LC58   EQU   *
         DC    C'pedantic'
         DC    X'0'
@@LC59   EQU   *
         DC    C'pedantic-errors'
         DC    X'0'
@@LC60   EQU   *
         DC    C'remap'
         DC    X'0'
@@LC61   EQU   *
         DC    C'std=c++98'
         DC    X'0'
@@LC62   EQU   *
         DC    C'std=c89'
         DC    X'0'
@@LC63   EQU   *
         DC    C'std=c99'
         DC    X'0'
@@LC64   EQU   *
         DC    C'std=c9x'
         DC    X'0'
@@LC65   EQU   *
         DC    C'std=gnu89'
         DC    X'0'
@@LC66   EQU   *
         DC    C'std=gnu99'
         DC    X'0'
@@LC67   EQU   *
         DC    C'std=gnu9x'
         DC    X'0'
@@LC68   EQU   *
         DC    C'std=iso9899:1990'
         DC    X'0'
@@LC69   EQU   *
         DC    C'std=iso9899:199409'
         DC    X'0'
@@LC70   EQU   *
         DC    C'std=iso9899:1999'
         DC    X'0'
@@LC71   EQU   *
         DC    C'std=iso9899:199x'
         DC    X'0'
@@LC72   EQU   *
         DC    C'trigraphs'
         DC    X'0'
@@LC73   EQU   *
         DC    C'v'
         DC    X'0'
@@LC74   EQU   *
         DC    C'version'
         DC    X'0'
@@LC75   EQU   *
         DC    C'w'
         DC    X'0'
* Program data area
         DS    0F
@@7      EQU   *
         DC    A(@@LC0)
         DC    F'0'
         DC    F'1'
         DC    F'0'
         DC    A(@@LC1)
         DC    F'0'
         DC    F'1'
         DC    F'1'
         DC    A(@@LC2)
         DC    F'0'
         DC    F'5'
         DC    F'2'
         DC    A(@@LC3)
         DC    F'0'
         DC    F'12'
         DC    F'3'
         DC    A(@@LC4)
         DC    F'0'
         DC    F'8'
         DC    F'4'
         DC    A(@@LC5)
         DC    A(@@LC6)
         DC    F'1'
         DC    F'5'
         DC    A(@@LC7)
         DC    F'0'
         DC    F'1'
         DC    F'6'
         DC    A(@@LC8)
         DC    A(@@LC9)
         DC    F'1'
         DC    F'7'
         DC    A(@@LC10)
         DC    F'0'
         DC    F'1'
         DC    F'8'
         DC    A(@@LC11)
         DC    A(@@LC12)
         DC    F'1'
         DC    F'9'
         DC    A(@@LC13)
         DC    F'0'
         DC    F'1'
         DC    F'10'
         DC    A(@@LC14)
         DC    A(@@LC15)
         DC    F'2'
         DC    F'11'
         DC    A(@@LC16)
         DC    A(@@LC15)
         DC    F'2'
         DC    F'12'
         DC    A(@@LC17)
         DC    F'0'
         DC    F'2'
         DC    F'13'
         DC    A(@@LC18)
         DC    F'0'
         DC    F'2'
         DC    F'14'
         DC    A(@@LC19)
         DC    A(@@LC15)
         DC    F'3'
         DC    F'15'
         DC    A(@@LC20)
         DC    F'0'
         DC    F'2'
         DC    F'16'
         DC    A(@@LC21)
         DC    A(@@LC22)
         DC    F'2'
         DC    F'17'
         DC    A(@@LC23)
         DC    A(@@LC22)
         DC    F'2'
         DC    F'18'
         DC    A(@@LC24)
         DC    F'0'
         DC    F'1'
         DC    F'19'
         DC    A(@@LC25)
         DC    A(@@LC9)
         DC    F'1'
         DC    F'20'
         DC    A(@@LC26)
         DC    A(@@LC27)
         DC    F'1'
         DC    F'21'
         DC    A(@@LC28)
         DC    A(@@LC27)
         DC    F'1'
         DC    F'22'
         DC    A(@@LC29)
         DC    F'0'
         DC    F'19'
         DC    F'23'
         DC    A(@@LC30)
         DC    F'0'
         DC    F'22'
         DC    F'24'
         DC    A(@@LC31)
         DC    F'0'
         DC    F'18'
         DC    F'25'
         DC    A(@@LC32)
         DC    F'0'
         DC    F'16'
         DC    F'26'
         DC    A(@@LC33)
         DC    F'0'
         DC    F'15'
         DC    F'27'
         DC    A(@@LC34)
         DC    F'0'
         DC    F'13'
         DC    F'28'
         DC    A(@@LC35)
         DC    F'0'
         DC    F'12'
         DC    F'29'
         DC    A(@@LC36)
         DC    F'0'
         DC    F'12'
         DC    F'30'
         DC    A(@@LC37)
         DC    A(@@LC38)
         DC    F'9'
         DC    F'31'
         DC    A(@@LC39)
         DC    F'0'
         DC    F'14'
         DC    F'32'
         DC    A(@@LC40)
         DC    F'0'
         DC    F'1'
         DC    F'33'
         DC    A(@@LC41)
         DC    A(@@LC12)
         DC    F'9'
         DC    F'34'
         DC    A(@@LC42)
         DC    A(@@LC15)
         DC    F'7'
         DC    F'35'
         DC    A(@@LC43)
         DC    A(@@LC15)
         DC    F'7'
         DC    F'36'
         DC    A(@@LC44)
         DC    A(@@LC45)
         DC    F'7'
         DC    F'37'
         DC    A(@@LC46)
         DC    A(@@LC12)
         DC    F'7'
         DC    F'38'
         DC    A(@@LC47)
         DC    A(@@LC12)
         DC    F'11'
         DC    F'39'
         DC    A(@@LC48)
         DC    A(@@LC12)
         DC    F'17'
         DC    F'40'
         DC    A(@@LC49)
         DC    F'0'
         DC    F'8'
         DC    F'41'
         DC    A(@@LC50)
         DC    F'0'
         DC    F'6'
         DC    F'42'
         DC    A(@@LC51)
         DC    F'0'
         DC    F'8'
         DC    F'43'
         DC    A(@@LC52)
         DC    F'0'
         DC    F'8'
         DC    F'44'
         DC    A(@@LC53)
         DC    F'0'
         DC    F'9'
         DC    F'45'
         DC    A(@@LC54)
         DC    F'0'
         DC    F'11'
         DC    F'46'
         DC    A(@@LC55)
         DC    F'0'
         DC    F'8'
         DC    F'47'
         DC    A(@@LC56)
         DC    F'0'
         DC    F'10'
         DC    F'48'
         DC    A(@@LC57)
         DC    A(@@LC15)
         DC    F'1'
         DC    F'49'
         DC    A(@@LC58)
         DC    F'0'
         DC    F'8'
         DC    F'50'
         DC    A(@@LC59)
         DC    F'0'
         DC    F'15'
         DC    F'51'
         DC    A(@@LC60)
         DC    F'0'
         DC    F'5'
         DC    F'52'
         DC    A(@@LC61)
         DC    F'0'
         DC    F'9'
         DC    F'53'
         DC    A(@@LC62)
         DC    F'0'
         DC    F'7'
         DC    F'54'
         DC    A(@@LC63)
         DC    F'0'
         DC    F'7'
         DC    F'55'
         DC    A(@@LC64)
         DC    F'0'
         DC    F'7'
         DC    F'56'
         DC    A(@@LC65)
         DC    F'0'
         DC    F'9'
         DC    F'57'
         DC    A(@@LC66)
         DC    F'0'
         DC    F'9'
         DC    F'58'
         DC    A(@@LC67)
         DC    F'0'
         DC    F'9'
         DC    F'59'
         DC    A(@@LC68)
         DC    F'0'
         DC    F'16'
         DC    F'60'
         DC    A(@@LC69)
         DC    F'0'
         DC    F'18'
         DC    F'61'
         DC    A(@@LC70)
         DC    F'0'
         DC    F'16'
         DC    F'62'
         DC    A(@@LC71)
         DC    F'0'
         DC    F'16'
         DC    F'63'
         DC    A(@@LC72)
         DC    F'0'
         DC    F'9'
         DC    F'64'
         DC    A(@@LC73)
         DC    F'0'
         DC    F'1'
         DC    F'65'
         DC    A(@@LC74)
         DC    F'0'
         DC    F'7'
         DC    F'66'
         DC    A(@@LC75)
         DC    F'0'
         DC    F'1'
         DC    F'67'
* Program text area
         DS    0F
* S-func path_include prologue
@@8      PDPPRLG CINDEX=7,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN7
         LTORG
@@FEN7   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG7    EQU   *
         LR    11,1
         L     10,=A(@@PGT7)
* Function path_include code
         L     9,8(11)
         L     8,4(11)
@@L9     EQU   *
         LR    3,8
         IC    2,0(8)
         CLM   2,1,=XL1'00'
         BE    @@L13
         CLM   2,1,=XL1'7A'
         BE    @@L13
@@L16    EQU   *
         A     3,=F'1'
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    @@L13
         CLM   2,1,=XL1'7A'
         BNE   @@L16
@@L13    EQU   *
         CLR   3,8
         BE    @@L23
         LR    2,3
         SR    2,8
         A     2,=F'1'
         ST    2,88(13)
         BCTR  2,0
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    6,15
         LR    7,2
         LR    4,8
         LR    5,2
         MVCL  6,4
         SLR   4,4
         STC   4,0(2,15)
         B     @@L18
@@L23    EQU   *
         MVC   88(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         MVI   0(15),75
         MVI   1(15),0
@@L18    EQU   *
         MVC   88(4,13),0(11)
         ST    15,92(13)
         ST    9,96(13)
         LR    2,9
         X     2,=F'1'
         LPR   2,2
         BCTR  2,0
         SRL   2,31
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
         IC    2,0(3)
         LR    8,3
         A     8,=F'1'
         CLM   2,1,=XL1'00'
         BNE   @@L9
* Function path_include epilogue
         PDPEPIL
* Function path_include literal pool
         DS    0F
         LTORG
* Function path_include page table
         DS    0F
@@PGT7   EQU   *
         DC    A(@@PG7)
@@LC77   EQU   *
         DC    C'ignoring nonexistent directory "%s"'
         DC    X'15'
         DC    X'0'
@@LC76   EQU   *
         DC    C'.'
         DC    X'0'
         DS    0F
* S-func append_include_chain prologue
@@9      PDPPRLG CINDEX=8,FRAME=144,BASER=12,ENTRY=NO
         B     @@FEN8
         LTORG
@@FEN8   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG8    EQU   *
         LR    11,1
         L     10,=A(@@PGT8)
* Function append_include_chain code
         L     5,0(11)
         L     3,4(11)
         L     7,8(11)
         L     4,376(5)
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    @@L52
@@L25    EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(@CPP@SIM)
         BALR  14,15
         ST    3,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(STAT)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BE    @@L30
         LA    1,88(,13)
         L     15,=V(@@GET@ER)
         BALR  14,15
         L     2,0(15)
         LA    4,2002(0,0)
         CLR   2,4
         BE    @@L27
         ST    5,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(CPNOT)
         BALR  14,15
@@L28    EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     @@L24
@@L27    EQU   *
         IC    2,412(5)
         CLM   2,1,=XL1'00'
         BE    @@L28
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(@@LC77)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L28
@@L30    EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         CL    15,168(5)
         BNH   @@L31
         ST    15,168(5)
@@L31    EQU   *
         MVC   88(4,13),=F'28'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    3,4(15)
         ST    2,8(15)
         MVC   12(4,15),112(13)
         MVC   16(4,15),116(13)
         LR    2,7
         BCTR  2,0
         LA    3,1(0,0)
         CLR   2,3
         BH    @@L32
         L     3,12(11)
         LPR   2,3
         BCTR  2,0
         SRL   2,31
         A     2,=F'1'
         ST    2,20(15)
@@L35    EQU   *
         MVC   24(4,15),=F'0'
         MVC   0(4,15),=F'0'
         LA    2,1(0,0)
         CR    7,2
         BE    @@L41
         BNH   @@L53
         LA    3,2(0,0)
         CLR   7,3
         BNE   @@L24
         L     2,32(4)
         LTR   2,2
         BNE   @@L47
         ST    15,32(4)
@@L48    EQU   *
         ST    15,36(4)
         B     @@L24
@@L47    EQU   *
         L     2,36(4)
         ST    15,0(2)
         B     @@L48
@@L53    EQU   *
         LTR   7,7
         BNE   @@L24
         L     2,16(4)
         LTR   2,2
         BNE   @@L39
         ST    15,16(4)
@@L40    EQU   *
         ST    15,20(4)
         B     @@L24
@@L39    EQU   *
         L     2,20(4)
         ST    15,0(2)
         B     @@L40
@@L41    EQU   *
         L     2,24(4)
         LTR   2,2
         BNE   @@L43
         ST    15,24(4)
@@L44    EQU   *
         ST    15,28(4)
         B     @@L24
@@L43    EQU   *
         L     2,28(4)
         ST    15,0(2)
         B     @@L44
@@L32    EQU   *
         ST    6,20(15)
         B     @@L35
@@L52    EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),=A(@@LC76)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         LR    3,15
         B     @@L25
@@L24    EQU   *
* Function append_include_chain epilogue
         PDPEPIL
* Function append_include_chain literal pool
         DS    0F
         LTORG
* Function append_include_chain page table
         DS    0F
@@PGT8   EQU   *
         DC    A(@@PG8)
@@LC79   EQU   *
         DC    C'ignoring duplicate directory "%s"'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func remove_dup_dir prologue
@@10     PDPPRLG CINDEX=9,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN9
         LTORG
@@FEN9   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG9    EQU   *
         LR    11,1
         L     10,=A(@@PGT9)
* Function remove_dup_dir code
         L     4,4(11)
         L     2,8(11)
         LTR   4,4
         BE    @@L55
         L     3,0(4)
         MVC   0(4,4),0(3)
@@L56    EQU   *
         L     2,0(11)
         IC    2,412(2)
         CLM   2,1,=XL1'00'
         BE    @@L57
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(@@LC79)
         MVC   96(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L57
@@L55    EQU   *
         L     3,0(2)
         MVC   0(4,2),0(3)
         B     @@L56
@@L57    EQU   *
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    15,4
* Function remove_dup_dir epilogue
         PDPEPIL
* Function remove_dup_dir literal pool
         DS    0F
         LTORG
* Function remove_dup_dir page table
         DS    0F
@@PGT9   EQU   *
         DC    A(@@PG9)
         DS    0F
* S-func remove_dup_nonsys_dirs prologue
@@11     PDPPRLG CINDEX=10,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN10
         LTORG
@@FEN10  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG10   EQU   *
         LR    11,1
         L     10,=A(@@PGT10)
* Function remove_dup_nonsys_dirs code
         L     6,4(11)
         L     5,8(11)
         SLR   15,15
         LR    7,15
         L     3,0(6)
         LTR   3,3
         BE    @@L81
@@L73    EQU   *
         L     2,20(3)
         LTR   2,2
         BE    @@L61
         LA    7,1(0,0)
         L     2,0(6)
         LR    4,2
         SLR   15,15
         CLR   2,5
         BE    @@L61
@@L72    EQU   *
         LR    15,2
         LR    2,4
         LTR   15,15
         BE    @@L71
         L     2,0(15)
@@L71    EQU   *
         CLR   2,5
         BNE   @@L72
@@L61    EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   @@L73
@@L81    EQU   *
         LTR   7,7
         BNE   @@L74
         L     3,0(6)
         CLR   3,5
         BE    @@L74
@@L79    EQU   *
         LR    15,3
         L     3,0(3)
         CLR   3,5
         BNE   @@L79
@@L74    EQU   *
* Function remove_dup_nonsys_dirs epilogue
         PDPEPIL
* Function remove_dup_nonsys_dirs literal pool
         DS    0F
         LTORG
* Function remove_dup_nonsys_dirs page table
         DS    0F
@@PGT10  EQU   *
         DC    A(@@PG10)
         DS    0F
* S-func remove_dup_dirs prologue
@@12     PDPPRLG CINDEX=11,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN11
         LTORG
@@FEN11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG11   EQU   *
         LR    11,1
         L     10,=A(@@PGT11)
* Function remove_dup_dirs code
         SLR   15,15
         L     2,4(11)
         L     2,0(2)
         LR    3,2
         LTR   2,2
         BE    @@L97
@@L95    EQU   *
         LR    15,3
         CLR   3,2
         BE    @@L99
@@L94    EQU   *
         L     15,0(15)
         CLR   15,2
         BNE   @@L94
@@L99    EQU   *
         LR    15,2
         L     2,0(2)
         LTR   2,2
         BNE   @@L95
@@L97    EQU   *
* Function remove_dup_dirs epilogue
         PDPEPIL
* Function remove_dup_dirs literal pool
         DS    0F
         LTORG
* Function remove_dup_dirs page table
         DS    0F
@@PGT11  EQU   *
         DC    A(@@PG11)
         DS    0F
* S-func merge_include_chains prologue
@@13     PDPPRLG CINDEX=12,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN12
         LTORG
@@FEN12  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG12   EQU   *
         LR    11,1
         L     10,=A(@@PGT12)
* Function merge_include_chains code
         L     4,0(11)
         L     15,376(4)
         MVC   108(4,13),8(15)
         MVC   104(4,13),16(15)
         L     3,24(15)
         LTR   3,3
         BE    @@L101
         L     2,28(15)
         MVC   0(4,2),32(15)
@@L102   EQU   *
         L     2,104(13)
         LTR   2,2
         BE    @@L103
         L     2,20(15)
         ST    3,0(2)
@@L104   EQU   *
         ST    4,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@11)
         BALR  14,15
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@12)
         BALR  14,15
         L     2,108(13)
         LTR   2,2
         BNE   @@L108
         MVC   108(4,13),104(13)
         B     @@L107
@@L108   EQU   *
         ST    4,88(13)
         LA    2,108(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@12)
         BALR  14,15
         MVC   0(4,15),104(13)
         ST    4,88(13)
         ST    2,92(13)
         MVC   96(4,13),104(13)
         LA    1,88(,13)
         L     15,=A(@@11)
         BALR  14,15
         B     @@L107
@@L103   EQU   *
         ST    3,104(13)
         B     @@L104
@@L101   EQU   *
         L     3,32(15)
         B     @@L102
@@L107   EQU   *
         MVC   384(4,4),108(13)
         MVC   388(4,4),104(13)
* Function merge_include_chains epilogue
         PDPEPIL
* Function merge_include_chains literal pool
         DS    0F
         LTORG
* Function merge_include_chains page table
         DS    0F
@@PGT12  EQU   *
         DC    A(@@PG12)
@@14     EQU   *
         DC    X'00'
         DC    X'00'
         DC    X'00'
         DC    X'01'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'00'
         DC    X'01'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'00'
         DC    X'00'
         DC    X'00'
         DC    X'01'
         DC    X'00'
         DC    X'00'
         DC    X'00'
         DC    X'00'
         DC    X'00'
         DC    X'00'
         DC    X'00'
         DC    X'01'
         DC    X'00'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'01'
         DC    X'00'
         DC    X'01'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'01'
         DC    X'01'
         DC    X'01'
         DC    X'00'
         DC    X'00'
         DC    X'00'
         DC    X'01'
         DC    X'00'
         DC    X'00'
         DC    X'01'
         DC    X'00'
         DS    0F
* S-func set_lang prologue
@@15     PDPPRLG CINDEX=13,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN13
         LTORG
@@FEN13  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG13   EQU   *
         LR    11,1
         L     10,=A(@@PGT13)
* Function set_lang code
         L     2,0(11)
         L     4,4(11)
         LR    3,4
         MH    3,=H'8'
         A     3,=A(@@14)
         ST    4,408(2)
         MVC   442(1,2),0(3)
         MVC   416(1,2),1(3)
         MVC   414(1,2),2(3)
         MVC   420(1,2),3(3)
         MVC   443(1,2),4(3)
         MVC   418(1,2),4(3)
         MVC   440(1,2),5(3)
         MVC   415(1,2),6(3)
         MVC   419(1,2),7(3)
* Function set_lang epilogue
         PDPEPIL
* Function set_lang literal pool
         DS    0F
         LTORG
* Function set_lang page table
         DS    0F
@@PGT13  EQU   *
         DC    A(@@PG13)
         DS    0F
* S-func opt_comp prologue
@@16     PDPPRLG CINDEX=14,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN14
         LTORG
@@FEN14  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG14   EQU   *
         LR    11,1
         L     10,=A(@@PGT14)
* Function opt_comp code
         L     2,0(11)
         MVC   88(4,13),0(2)
         L     2,4(11)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
* Function opt_comp epilogue
         PDPEPIL
* Function opt_comp literal pool
         DS    0F
         LTORG
* Function opt_comp page table
         DS    0F
@@PGT14  EQU   *
         DC    A(@@PG14)
* Program data area
         DS    0F
@@18     EQU   *
         DC    F'0'
* Program text area
         DS    0F
* S-func init_library prologue
@@17     PDPPRLG CINDEX=15,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN15
         LTORG
@@FEN15  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG15   EQU   *
         LR    11,1
         L     10,=A(@@PGT15)
* Function init_library code
         L     15,=A(@@18)
         L     2,0(15)
         LTR   2,2
         BNE   @@L111
         MVC   0(4,15),=F'1'
         MVC   88(4,13),=A(@@7)
         MVC   92(4,13),=F'68'
         MVC   96(4,13),=F'16'
         MVC   100(4,13),=A(@@16)
         LA    1,88(,13)
         L     15,=V(QSORT)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@6)
         BALR  14,15
@@L111   EQU   *
* Function init_library epilogue
         PDPEPIL
* Function init_library literal pool
         DS    0F
         LTORG
* Function init_library page table
         DS    0F
@@PGT15  EQU   *
         DC    A(@@PG15)
         DS    0F
* X-func cpp_create_reader prologue
CPP@CREA PDPPRLG CINDEX=16,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN16
         LTORG
@@FEN16  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG16   EQU   *
         LR    11,1
         L     10,=A(@@PGT16)
* Function cpp_create_reader code
         LA    1,88(,13)
         L     15,=A(@@17)
         BALR  14,15
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'480'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@15)
         BALR  14,15
         MVI   433(3),1
         MVI   417(3),1
         MVI   450(3),1
         MVC   372(4,3),=F'8'
         MVI   451(3),1
         MVI   413(3),0
         MVI   446(3),1
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'56'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,376(3)
         LA    1,88(,13)
         L     15,=V(DEPS@INI)
         BALR  14,15
         ST    15,236(3)
         A     3,=F'16'
         ST    3,88(13)
         A     3,=F'-16'
         LA    1,88(,13)
         L     15,=V(INIT@LIN)
         BALR  14,15
         MVC   44(4,3),=F'1'
         SLR   15,15
         IC    2,417(3)
         STC   15,80(,13)
         CLM   2,1,80(13)
         BNE   @@L114
         LA    15,1(0,0)
@@L114   EQU   *
         STC   15,7(3)
         MVI   178(3),67
         MVI   210(3),66
         MVC   212(4,3),=F'0'
         MVI   226(3),67
         MVI   227(3),0
         LR    2,3
         A     2,=F'116'
         ST    2,88(13)
         MVC   92(4,13),=F'250'
         LA    1,88(,13)
         L     15,=V(@CPITOKE)
         BALR  14,15
         ST    2,132(3)
         MVC   112(4,3),124(3)
         A     2,=F'-52'
         ST    2,92(3)
         MVC   84(4,3),=F'0'
         MVC   0(4,2),=F'0'
         MVC   68(4,3),=F'0'
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(@CPP@GET)
         BALR  14,15
         ST    15,52(3)
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(@CPP@GET)
         BALR  14,15
         ST    15,56(3)
         A     3,=F'284'
         ST    3,88(13)
         A     3,=F'-284'
         LA    1,88(,13)
         L     15,=V(GCC@OBST)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(@CPIINCL)
         BALR  14,15
         LR    15,3
* Function cpp_create_reader epilogue
         PDPEPIL
* Function cpp_create_reader literal pool
         DS    0F
         LTORG
* Function cpp_create_reader page table
         DS    0F
@@PGT16  EQU   *
         DC    A(@@PG16)
         DS    0F
* X-func cpp_destroy prologue
CPP@DEST PDPPRLG CINDEX=17,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN17
         LTORG
@@FEN17  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG17   EQU   *
         LR    11,1
         L     10,=A(@@PGT17)
* Function cpp_destroy code
         L     4,0(11)
         L     2,0(4)
         LTR   2,2
         BNE   @@L119
@@L140   EQU   *
         L     2,156(4)
         LTR   2,2
         BNE   @@L147
@@L120   EQU   *
         MVC   88(4,13),236(4)
         LA    1,88(,13)
         L     15,=V(DEPS@FRE)
         BALR  14,15
         A     4,=F'284'
         ST    4,88(13)
         A     4,=F'-284'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(OBSTACK@)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(@CPP@DES)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(@CPP@CLE)
         BALR  14,15
         MVC   88(4,13),52(4)
         LA    1,88(,13)
         L     15,=V(@CFBUFF)
         BALR  14,15
         MVC   88(4,13),56(4)
         LA    1,88(,13)
         L     15,=V(@CFBUFF)
         BALR  14,15
         MVC   88(4,13),60(4)
         LA    1,88(,13)
         L     15,=V(@CFBUFF)
         BALR  14,15
         LR    2,4
         A     2,=F'116'
         LR    5,2
         BE    @@L142
@@L128   EQU   *
         L     3,0(2)
         MVC   88(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         CLR   2,5
         BE    @@L125
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
@@L125   EQU   *
         LR    2,3
         LTR   3,3
         BNE   @@L128
@@L142   EQU   *
         L     3,384(4)
         LTR   3,3
         BE    @@L144
@@L133   EQU   *
         L     2,0(3)
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    3,2
         LTR   2,2
         BNE   @@L133
@@L144   EQU   *
         L     15,64(4)
         LTR   15,15
         BE    @@L146
@@L138   EQU   *
         L     2,0(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    15,2
         LTR   2,2
         BNE   @@L138
         B     @@L146
@@L147   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   156(4,4),=F'0'
         MVC   160(4,4),=F'0'
         B     @@L120
@@L119   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(@CPPBUFF)
         BALR  14,15
         L     2,0(4)
         LTR   2,2
         BNE   @@L119
         B     @@L140
@@L146   EQU   *
         A     4,=F'16'
         ST    4,88(13)
         A     4,=F'-16'
         LA    1,88(,13)
         L     15,=V(FREE@LIN)
         BALR  14,15
         L     2,144(4)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    15,2
* Function cpp_destroy epilogue
         PDPEPIL
* Function cpp_destroy literal pool
         DS    0F
         LTORG
* Function cpp_destroy page table
         DS    0F
@@PGT17  EQU   *
         DC    A(@@PG17)
@@LC81   EQU   *
         DC    C'__TIME__'
         DC    X'0'
@@LC82   EQU   *
         DC    C'__DATE__'
         DC    X'0'
@@LC83   EQU   *
         DC    C'__FILE__'
         DC    X'0'
@@LC84   EQU   *
         DC    C'__BASE_FILE__'
         DC    X'0'
@@LC85   EQU   *
         DC    C'__LINE__'
         DC    X'0'
@@LC86   EQU   *
         DC    C'__INCLUDE_LEVEL__'
         DC    X'0'
@@LC87   EQU   *
         DC    C'_Pragma'
         DC    X'0'
@@LC88   EQU   *
         DC    C'__VERSION__'
         DC    X'0'
@@LC89   EQU   *
         DC    C'__USER_LABEL_PREFIX__'
         DC    X'0'
@@LC90   EQU   *
         DC    C'__REGISTER_PREFIX__'
         DC    X'0'
@@LC91   EQU   *
         DC    X'0'
@@LC92   EQU   *
         DC    C'__HAVE_BUILTIN_SETJMP__'
         DC    X'0'
@@LC93   EQU   *
         DC    C'1'
         DC    X'0'
@@LC94   EQU   *
         DC    C'__USING_SJLJ_EXCEPTIONS__'
         DC    X'0'
@@LC95   EQU   *
         DC    C'__SIZE_TYPE__'
         DC    X'0'
@@LC96   EQU   *
         DC    C'long unsigned int'
         DC    X'0'
@@LC97   EQU   *
         DC    C'__PTRDIFF_TYPE__'
         DC    X'0'
@@LC98   EQU   *
         DC    C'long int'
         DC    X'0'
@@LC99   EQU   *
         DC    C'__WCHAR_TYPE__'
         DC    X'0'
@@LC100  EQU   *
         DC    C'int'
         DC    X'0'
@@LC101  EQU   *
         DC    C'__WINT_TYPE__'
         DC    X'0'
@@LC102  EQU   *
         DC    C'unsigned int'
         DC    X'0'
@@LC103  EQU   *
         DC    C'__STDC__'
         DC    X'0'
         DS    0F
@@19     EQU   *
         DC    A(@@LC81)
         DC    F'0'
         DC    X'05'
         DC    1X'00'
         DC    X'0008'
         DC    X'0008'
         DC    2X'00'
         DC    A(@@LC82)
         DC    F'0'
         DC    X'01'
         DC    1X'00'
         DC    X'0008'
         DC    X'0008'
         DC    2X'00'
         DC    A(@@LC83)
         DC    F'0'
         DC    X'02'
         DC    1X'00'
         DC    X'0008'
         DC    X'0008'
         DC    2X'00'
         DC    A(@@LC84)
         DC    F'0'
         DC    X'03'
         DC    1X'00'
         DC    X'0008'
         DC    X'000D'
         DC    2X'00'
         DC    A(@@LC85)
         DC    F'0'
         DC    X'00'
         DC    1X'00'
         DC    X'0008'
         DC    X'0008'
         DC    2X'00'
         DC    A(@@LC86)
         DC    F'0'
         DC    X'04'
         DC    1X'00'
         DC    X'0008'
         DC    X'0011'
         DC    2X'00'
         DC    A(@@LC87)
         DC    F'0'
         DC    X'07'
         DC    1X'00'
         DC    X'0008'
         DC    X'0007'
         DC    2X'00'
         DC    A(@@LC88)
         DC    F'0'
         DC    X'00'
         DC    1X'00'
         DC    X'0001'
         DC    X'000B'
         DC    2X'00'
         DC    A(@@LC89)
         DC    F'0'
         DC    X'00'
         DC    1X'00'
         DC    X'0002'
         DC    X'0015'
         DC    2X'00'
         DC    A(@@LC90)
         DC    A(@@LC91)
         DC    X'00'
         DC    1X'00'
         DC    X'0000'
         DC    X'0013'
         DC    2X'00'
         DC    A(@@LC92)
         DC    A(@@LC93)
         DC    X'00'
         DC    1X'00'
         DC    X'0000'
         DC    X'0017'
         DC    2X'00'
         DC    A(@@LC94)
         DC    A(@@LC93)
         DC    X'00'
         DC    1X'00'
         DC    X'0000'
         DC    X'0019'
         DC    2X'00'
         DC    A(@@LC95)
         DC    A(@@LC96)
         DC    X'00'
         DC    1X'00'
         DC    X'0000'
         DC    X'000D'
         DC    2X'00'
         DC    A(@@LC97)
         DC    A(@@LC98)
         DC    X'00'
         DC    1X'00'
         DC    X'0000'
         DC    X'0010'
         DC    2X'00'
         DC    A(@@LC99)
         DC    A(@@LC100)
         DC    X'00'
         DC    1X'00'
         DC    X'0000'
         DC    X'000E'
         DC    2X'00'
         DC    A(@@LC101)
         DC    A(@@LC102)
         DC    X'00'
         DC    1X'00'
         DC    X'0000'
         DC    X'000D'
         DC    2X'00'
         DC    A(@@LC103)
         DC    A(@@LC93)
         DC    X'00'
         DC    1X'00'
         DC    X'0000'
         DC    X'0008'
         DC    2X'00'
@@LC104  EQU   *
         DC    C'and'
         DC    X'0'
@@LC105  EQU   *
         DC    C'and_eq'
         DC    X'0'
@@LC106  EQU   *
         DC    C'bitand'
         DC    X'0'
@@LC107  EQU   *
         DC    C'bitor'
         DC    X'0'
@@LC108  EQU   *
         DC    C'compl'
         DC    X'0'
@@LC109  EQU   *
         DC    C'not'
         DC    X'0'
@@LC110  EQU   *
         DC    C'not_eq'
         DC    X'0'
@@LC111  EQU   *
         DC    C'or'
         DC    X'0'
@@LC112  EQU   *
         DC    C'or_eq'
         DC    X'0'
@@LC113  EQU   *
         DC    C'xor'
         DC    X'0'
@@LC114  EQU   *
         DC    C'xor_eq'
         DC    X'0'
         DS    0F
@@20     EQU   *
         DC    A(@@LC104)
         DC    F'3'
         DC    F'17'
         DC    A(@@LC105)
         DC    F'6'
         DC    F'33'
         DC    A(@@LC106)
         DC    F'6'
         DC    F'9'
         DC    A(@@LC107)
         DC    F'5'
         DC    F'10'
         DC    A(@@LC108)
         DC    F'5'
         DC    F'16'
         DC    A(@@LC109)
         DC    F'3'
         DC    F'1'
         DC    A(@@LC110)
         DC    F'6'
         DC    F'25'
         DC    A(@@LC111)
         DC    F'2'
         DC    F'18'
         DC    A(@@LC112)
         DC    F'5'
         DC    F'34'
         DC    A(@@LC113)
         DC    F'3'
         DC    F'11'
         DC    A(@@LC114)
         DC    F'6'
         DC    F'35'
         DS    0F
* S-func mark_named_operators prologue
@@21     PDPPRLG CINDEX=18,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN18
         LTORG
@@FEN18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG18   EQU   *
         LR    11,1
         L     10,=A(@@PGT18)
* Function mark_named_operators code
         L     3,0(11)
         L     2,=A(@@20)
         L     4,=A(@@20+132)
         CLR   2,4
         BNL   @@L155
@@L153   EQU   *
         ST    3,88(13)
         MVC   92(4,13),0(2)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(CPP@LOOK)
         BALR  14,15
         OI    13(15),1
         MVC   16(4,15),8(2)
         A     2,=F'12'
         L     4,=A(@@20+132)
         CLR   2,4
         BL    @@L153
@@L155   EQU   *
* Function mark_named_operators epilogue
         PDPEPIL
* Function mark_named_operators literal pool
         DS    0F
         LTORG
* Function mark_named_operators page table
         DS    0F
@@PGT18  EQU   *
         DC    A(@@PG18)
@@LC116  EQU   *
         DC    C'%s %s'
         DC    X'15'
         DC    X'0'
@@LC125  EQU   *
         DC    C'__ASSEMBLER__ 1'
         DC    X'0'
@@LC124  EQU   *
         DC    C'__STRICT_ANSI__ 1'
         DC    X'0'
@@LC123  EQU   *
         DC    C'__CHAR_UNSIGNED__ 1'
         DC    X'0'
@@LC122  EQU   *
         DC    C'__STDC_VERSION__ 199901L'
         DC    X'0'
@@LC121  EQU   *
         DC    C'__STDC_VERSION__ 199409L'
         DC    X'0'
@@LC120  EQU   *
         DC    C'__OBJC__ 1'
         DC    X'0'
@@LC117  EQU   *
         DC    C'__cplusplus 1'
         DC    X'0'
@@LC119  EQU   *
         DC    C'__GXX_WEAK__ 0'
         DC    X'0'
@@LC115  EQU   *
         DC    C'%s "%s"'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func init_builtins prologue
@@22     PDPPRLG CINDEX=19,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN19
         LTORG
@@FEN19  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG19   EQU   *
         LR    11,1
         L     10,=A(@@PGT19)
* Function init_builtins code
         L     4,0(11)
         L     5,=A(@@19)
         L     2,=A(@@19+272)
         CLR   5,2
         BNL   @@L180
@@L167   EQU   *
         LH    3,10(5)
         LR    2,3
         N     2,=F'8'
         CH    2,=H'0'
         BNE   @@L184
         LR    2,3
         N     2,=F'1'
         CH    2,=H'0'
         BNE   @@L185
         N     3,=F'2'
         CH    3,=H'0'
         BE    @@L165
         L     3,404(4)
@@L166   EQU   *
         LH    2,12(5)
         N     2,=XL4'0000FFFF'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         AR    2,15
         A     2,=F'3'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         MVC   92(4,13),=A(@@LC116)
         MVC   96(4,13),0(5)
         ST    3,100(13)
@@L181   EQU   *
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(@CPP@DEF)
         BALR  14,15
@@L159   EQU   *
         A     5,=F'16'
         L     3,=A(@@19+272)
         CLR   5,3
         BL    @@L167
@@L180   EQU   *
         IC    2,414(4)
         CLM   2,1,=XL1'00'
         BNE   @@L186
@@L168   EQU   *
         IC    2,416(4)
         CLM   2,1,=XL1'00'
         BNE   @@L187
@@L171   EQU   *
         L     2,408(4)
         LA    5,3(0,0)
         CLR   2,5
         BE    @@L188
         IC    2,442(4)
         CLM   2,1,=XL1'00'
         BNE   @@L189
@@L173   EQU   *
         IC    2,413(4)
         CLM   2,1,=XL1'00'
         BE    @@L190
@@L175   EQU   *
         L     3,408(4)
         LR    2,3
         A     2,=F'-2'
         LA    5,2(0,0)
         CLR   2,5
         BNH   @@L191
         LA    2,9(0,0)
         CLR   3,2
         BNE   @@L156
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC125)
@@L183   EQU   *
         LA    1,88(,13)
         L     15,=V(@CPP@DEF)
         BALR  14,15
         B     @@L156
@@L191   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC124)
         B     @@L183
@@L190   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC123)
         LA    1,88(,13)
         L     15,=V(@CPP@DEF)
         BALR  14,15
         B     @@L175
@@L189   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC122)
@@L182   EQU   *
         LA    1,88(,13)
         L     15,=V(@CPP@DEF)
         BALR  14,15
         B     @@L173
@@L188   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC121)
         B     @@L182
@@L187   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC120)
         LA    1,88(,13)
         L     15,=V(@CPP@DEF)
         BALR  14,15
         B     @@L171
@@L186   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC117)
         LA    1,88(,13)
         L     15,=V(@CPP@DEF)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC119)
         LA    1,88(,13)
         L     15,=V(@CPP@DEF)
         BALR  14,15
         B     @@L168
@@L165   EQU   *
         L     3,4(5)
         B     @@L166
@@L185   EQU   *
         LH    2,12(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(VERSION@)
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         AR    2,15
         A     2,=F'5'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         MVC   92(4,13),=A(@@LC115)
         MVC   96(4,13),0(5)
         MVC   100(4,13),0(3)
         B     @@L181
@@L184   EQU   *
         ST    4,88(13)
         MVC   92(4,13),0(5)
         LH    2,12(5)
         N     2,=XL4'0000FFFF'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(CPP@LOOK)
         BALR  14,15
         MVI   12(15),1
         OI    13(15),20
         SLR   2,2
         IC    2,8(5)
         ST    2,16(15)
         B     @@L159
@@L156   EQU   *
* Function init_builtins epilogue
         PDPEPIL
* Function init_builtins literal pool
         DS    0F
         LTORG
* Function init_builtins page table
         DS    0F
@@PGT19  EQU   *
         DC    A(@@PG19)
@@LC126  EQU   *
         DC    C'CPATH'
         DC    X'0'
@@LC130  EQU   *
         DC    C'OBJCPLUS_INCLUDE_PATH'
         DC    X'0'
@@LC129  EQU   *
         DC    C'OBJC_INCLUDE_PATH'
         DC    X'0'
@@LC127  EQU   *
         DC    C'C_INCLUDE_PATH'
         DC    X'0'
@@LC128  EQU   *
         DC    C'CPLUS_INCLUDE_PATH'
         DC    X'0'
         DS    0F
* S-func init_standard_includes prologue
@@23     PDPPRLG CINDEX=20,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN20
         LTORG
@@FEN20  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG20   EQU   *
         LR    11,1
         L     10,=A(@@PGT20)
* Function init_standard_includes code
         L     2,0(11)
         MVC   104(4,13),396(2)
         MVC   88(4,13),=A(@@LC126)
         LA    1,88(,13)
         L     15,=V(GETENV)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L194
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BNE   @@L228
@@L194   EQU   *
         L     5,0(11)
         SLR   3,3
         IC    3,416(5)
         SLL   3,1
         SLR   2,2
         IC    2,414(5)
         AR    3,2
         LA    2,1(0,0)
         CR    3,2
         BE    @@L198
         BNH   @@L229
         LA    5,2(0,0)
         CLR   3,5
         BE    @@L200
         LA    2,3(0,0)
         CLR   3,2
         BE    @@L202
@@L195   EQU   *
         LTR   4,4
         BE    @@L207
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BNE   @@L230
@@L207   EQU   *
         L     3,104(13)
         LTR   3,3
         BE    @@L208
         L     2,=V(CPPGDLEN)
         L     8,0(2)
         LTR   8,8
         BNE   @@L231
@@L208   EQU   *
         L     9,=V(CPIDEFLS)
         L     2,0(9)
         LTR   2,2
         BE    @@L226
@@L223   EQU   *
         L     2,8(9)
         LTR   2,2
         BE    @@L222
         L     5,0(11)
         IC    2,414(5)
         CLM   2,1,=XL1'00'
         BE    @@L219
         IC    2,447(5)
         CLM   2,1,=XL1'00'
         BNE   @@L219
@@L222   EQU   *
         MVC   88(4,13),0(9)
         MVC   92(4,13),4(9)
         LA    1,88(,13)
         L     15,=V(UPDATE@P)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),12(9)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
@@L219   EQU   *
         A     9,=F'16'
         L     2,0(9)
         LTR   2,2
         BNE   @@L223
         B     @@L226
@@L231   EQU   *
         A     8,=F'1'
         ST    8,88(13)
         BCTR  8,0
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,108(13)
         MVC   88(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    15,112(13)
         L     4,108(13)
         LR    5,8
         L     2,=V(CPPGDIR)
         LR    3,8
         MVCL  4,2
         SLR   2,2
         L     5,108(13)
         STC   2,0(8,5)
         L     9,=V(CPIDEFLS)
         L     2,0(9)
         LTR   2,2
         BE    @@L208
@@L216   EQU   *
         L     2,8(9)
         LTR   2,2
         BE    @@L214
         L     3,0(11)
         IC    2,414(3)
         CLM   2,1,=XL1'00'
         BE    @@L211
         IC    2,447(3)
         CLM   2,1,=XL1'00'
         BNE   @@L211
@@L214   EQU   *
         MVC   88(4,13),0(9)
         MVC   92(4,13),108(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L232
@@L211   EQU   *
         A     9,=F'16'
         L     2,0(9)
         LTR   2,2
         BNE   @@L216
         B     @@L208
@@L232   EQU   *
         MVC   88(4,13),0(9)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         L     3,112(13)
         AR    3,15
         SR    3,8
         A     3,=F'1'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    6,15
         L     7,112(13)
         L     4,104(13)
         LR    5,7
         MVCL  6,4
         SR    2,8
         A     2,=F'1'
         L     6,112(13)
         AR    6,15
         LR    7,2
         L     4,0(9)
         AR    4,8
         LR    5,2
         MVCL  6,4
         MVC   88(4,13),0(11)
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),12(9)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
         B     @@L211
@@L230   EQU   *
         MVC   88(4,13),0(11)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         B     @@L207
@@L202   EQU   *
         MVC   88(4,13),=A(@@LC130)
@@L227   EQU   *
         LA    1,88(,13)
         L     15,=V(GETENV)
         BALR  14,15
         LR    4,15
         B     @@L195
@@L200   EQU   *
         MVC   88(4,13),=A(@@LC129)
         B     @@L227
@@L229   EQU   *
         LTR   3,3
         BNE   @@L195
         MVC   88(4,13),=A(@@LC127)
         B     @@L227
@@L198   EQU   *
         MVC   88(4,13),=A(@@LC128)
         B     @@L227
@@L228   EQU   *
         MVC   88(4,13),0(11)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         B     @@L194
@@L226   EQU   *
* Function init_standard_includes epilogue
         PDPEPIL
* Function init_standard_includes literal pool
         DS    0F
         LTORG
* Function init_standard_includes page table
         DS    0F
@@PGT20  EQU   *
         DC    A(@@PG20)
         DS    0F
* S-func push_include prologue
@@24     PDPPRLG CINDEX=21,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN21
         LTORG
@@FEN21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG21   EQU   *
         LR    11,1
         L     10,=A(@@PGT21)
* Function push_include code
         L     3,0(11)
         MVI   110(13),61
         L     2,4(11)
         MVC   116(4,13),4(2)
         MVC   88(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    15,112(13)
         L     2,44(3)
         A     2,=F'1'
         ST    2,44(3)
         ST    3,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         MVC   96(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(@CPP@EXE)
         BALR  14,15
         N     15,=XL4'000000FF'
* Function push_include epilogue
         PDPEPIL
* Function push_include literal pool
         DS    0F
         LTORG
* Function push_include page table
         DS    0F
@@PGT21  EQU   *
         DC    A(@@PG21)
         DS    0F
* S-func free_chain prologue
@@25     PDPPRLG CINDEX=22,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN22
         LTORG
@@FEN22  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG22   EQU   *
         LR    11,1
         L     10,=A(@@PGT22)
* Function free_chain code
         L     15,0(11)
         LTR   15,15
         BE    @@L240
@@L238   EQU   *
         L     2,0(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    15,2
         LTR   2,2
         BNE   @@L238
@@L240   EQU   *
* Function free_chain epilogue
         PDPEPIL
* Function free_chain literal pool
         DS    0F
         LTORG
* Function free_chain page table
         DS    0F
@@PGT22  EQU   *
         DC    A(@@PG22)
@@LC131  EQU   *
         DC    C'#include "..." search starts here:'
         DC    X'15'
         DC    X'0'
@@LC133  EQU   *
         DC    C' %s'
         DC    X'15'
         DC    X'0'
@@LC134  EQU   *
         DC    C'End of search list.'
         DC    X'15'
         DC    X'0'
@@LC132  EQU   *
         DC    C'#include <...> search starts here:'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func cpp_read_main_file prologue
CPP@READ PDPPRLG CINDEX=23,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN23
         LTORG
@@FEN23  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG23   EQU   *
         LR    11,1
         L     10,=A(@@PGT23)
* Function cpp_read_main_file code
         L     3,0(11)
         L     4,4(11)
         ST    3,88(13)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(@CPIHTAB)
         BALR  14,15
         IC    2,446(3)
         CLM   2,1,=XL1'00'
         BE    @@L256
@@L242   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@13)
         BALR  14,15
         IC    2,412(3)
         CLM   2,1,=XL1'00'
         BNE   @@L257
@@L243   EQU   *
         IC    2,421(3)
         CLM   2,1,=XL1'00'
         BNE   @@L258
@@L250   EQU   *
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(@CPP@REA)
         BALR  14,15
         SLR   2,2
         CLM   15,1,=XL1'00'
         BE    @@L241
         SLR   15,15
         IC    2,426(3)
         STC   15,80(,13)
         CLM   2,1,80(13)
         BE    @@L252
         LA    15,1(0,0)
@@L252   EQU   *
         STC   15,36(3)
         IC    2,445(3)
         CLM   2,1,=XL1'00'
         BNE   @@L259
@@L253   EQU   *
         L     2,40(3)
         L     2,0(2)
         B     @@L241
@@L259   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@26)
         BALR  14,15
         B     @@L253
@@L258   EQU   *
         MVC   88(4,13),236(3)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(DA@DEFT)
         BALR  14,15
         B     @@L250
@@L257   EQU   *
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(@@LC131)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,384(3)
         LTR   2,2
         BE    @@L255
@@L249   EQU   *
         CL    2,388(3)
         BE    @@L260
@@L248   EQU   *
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(@@LC133)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,0(2)
         LTR   2,2
         BNE   @@L249
@@L255   EQU   *
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(@@LC134)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L243
@@L260   EQU   *
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(@@LC132)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L248
@@L256   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@23)
         BALR  14,15
         B     @@L242
@@L241   EQU   *
         LR    15,2
* Function cpp_read_main_file epilogue
         PDPEPIL
* Function cpp_read_main_file literal pool
         DS    0F
         LTORG
* Function cpp_read_main_file page table
         DS    0F
@@PGT23  EQU   *
         DC    A(@@PG23)
         DS    0F
* S-func read_original_filename prologue
@@26     PDPPRLG CINDEX=24,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN24
         LTORG
@@FEN24  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG24   EQU   *
         LR    11,1
         L     10,=A(@@PGT24)
* Function read_original_filename code
         L     3,0(11)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(@CPLEXD)
         BALR  14,15
         LR    4,15
         CLI   6(15),40
         BE    @@L264
@@L262   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(@CPP@BAC)
         BALR  14,15
         B     @@L261
@@L264   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(@CPLEXD)
         BALR  14,15
         LR    2,15
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(@CPP@BAC)
         BALR  14,15
         CLI   6(2),57
         BNE   @@L262
         ST    3,88(13)
         IC    2,7(4)
         N     2,=F'1'
         N     2,=XL4'000000FF'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(@CPP@HAN)
         BALR  14,15
@@L261   EQU   *
* Function read_original_filename epilogue
         PDPEPIL
* Function read_original_filename literal pool
         DS    0F
         LTORG
* Function read_original_filename page table
         DS    0F
@@PGT24  EQU   *
         DC    A(@@PG24)
@@LC135  EQU   *
         DC    C'<built-in>'
         DC    X'0'
@@LC136  EQU   *
         DC    C'<command line>'
         DC    X'0'
         DS    0F
* X-func cppfino prologue
CPPFINO  PDPPRLG CINDEX=25,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN25
         LTORG
@@FEN25  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG25   EQU   *
         LR    11,1
         L     10,=A(@@PGT25)
* Function cppfino code
         L     4,0(11)
         IC    2,414(4)
         CLM   2,1,=XL1'00'
         BE    @@L266
         IC    2,451(4)
         CLM   2,1,=XL1'00'
         BNE   @@L281
@@L266   EQU   *
         IC    2,445(4)
         CLM   2,1,=XL1'00'
         BNE   @@L267
         ST    4,88(13)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=A(@@LC135)
         MVC   100(4,13),=F'1'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(@CPDFCHA)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@22)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=F'2'
         MVC   96(4,13),=A(@@LC136)
         MVC   100(4,13),=F'1'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(@CPDFCHA)
         BALR  14,15
         L     2,376(4)
         L     3,0(2)
         LTR   3,3
         BE    @@L279
@@L272   EQU   *
         ST    4,88(13)
         MVC   92(4,13),4(3)
         L     2,8(3)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     3,0(3)
         LTR   3,3
         BNE   @@L272
@@L279   EQU   *
         L     2,376(4)
         L     3,40(2)
         LTR   3,3
         BE    @@L267
@@L277   EQU   *
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@24)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   @@L282
@@L276   EQU   *
         L     2,376(4)
         MVC   40(4,2),0(3)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,376(4)
         L     3,40(2)
         LTR   3,3
         BNE   @@L277
         B     @@L267
@@L282   EQU   *
         L     2,0(4)
         MVI   47(2),1
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(CPP@SCAN)
         BALR  14,15
         B     @@L276
@@L281   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@21)
         BALR  14,15
         B     @@L266
@@L267   EQU   *
         L     2,376(4)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=A(@@25)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(@CPP@PUS)
         BALR  14,15
* Function cppfino epilogue
         PDPEPIL
* Function cppfino literal pool
         DS    0F
         LTORG
* Function cppfino page table
         DS    0F
@@PGT25  EQU   *
         DC    A(@@PG25)
         DS    0F
* X-func _cpp_push_next_buffer prologue
@CPP@PUS PDPPRLG CINDEX=26,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN26
         LTORG
@@FEN26  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG26   EQU   *
         LR    11,1
         L     10,=A(@@PGT26)
* Function _cpp_push_next_buffer code
         L     4,0(11)
         SLR   5,5
         L     2,376(4)
         LTR   2,2
         BE    @@L284
         L     2,40(2)
         LTR   2,2
         BNE   @@L284
@@L290   EQU   *
         L     2,376(4)
         L     3,48(2)
         LTR   3,3
         BE    @@L286
         IC    2,445(4)
         CLM   2,1,=XL1'00'
         BE    @@L294
@@L289   EQU   *
         L     2,376(4)
         MVC   48(4,2),0(3)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         CLM   5,1,=XL1'00'
         BE    @@L290
@@L286   EQU   *
         CLM   5,1,=XL1'00'
         BNE   @@L284
         MVC   88(4,13),376(4)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   376(4,4),=F'0'
         IC    2,445(4)
         CLM   2,1,=XL1'00'
         BNE   @@L284
         ST    4,88(13)
         MVC   92(4,13),=F'2'
         L     2,16(4)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'1'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(@CPDFCHA)
         BALR  14,15
         B     @@L284
@@L294   EQU   *
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@24)
         BALR  14,15
         LR    5,15
         B     @@L289
@@L284   EQU   *
         LR    15,5
         N     15,=XL4'000000FF'
* Function _cpp_push_next_buffer epilogue
         PDPEPIL
* Function _cpp_push_next_buffer literal pool
         DS    0F
         LTORG
* Function _cpp_push_next_buffer page table
         DS    0F
@@PGT26  EQU   *
         DC    A(@@PG26)
@@LC137  EQU   *
         DC    C'a'
         DC    X'0'
@@LC138  EQU   *
         DC    C'I/O error on output'
         DC    X'0'
         DS    0F
* S-func output_deps prologue
@@27     PDPPRLG CINDEX=27,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN27
         LTORG
@@FEN27  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG27   EQU   *
         LR    11,1
         L     10,=A(@@PGT27)
* Function output_deps code
         L     4,0(11)
         IC    2,424(4)
         L     15,=A(@@LC137)
         CLM   2,1,=XL1'00'
         BNE   @@L297
         L     15,=A(@@LC75)
@@L297   EQU   *
         L     3,380(4)
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BNE   @@L298
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         L     3,0(15)
@@L299   EQU   *
         MVC   88(4,13),236(4)
         ST    3,92(13)
         MVC   96(4,13),=F'72'
         LA    1,88(,13)
         L     15,=V(DEPS@WRI)
         BALR  14,15
         IC    2,422(4)
         CLM   2,1,=XL1'00'
         BNE   @@L305
@@L301   EQU   *
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         CL    3,0(15)
         BE    @@L295
         L     2,104(3)
         LTR   2,2
         BNE   @@L304
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FCLOSE)
         BALR  14,15
         LTR   15,15
         BE    @@L295
@@L304   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC138)
         LA    1,88(,13)
         L     15,=V(CPP@FATA)
         BALR  14,15
         B     @@L295
@@L305   EQU   *
         MVC   88(4,13),236(4)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(DEPS@PHO)
         BALR  14,15
         B     @@L301
@@L298   EQU   *
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(FOPEN)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   @@L299
         ST    4,88(13)
         MVC   92(4,13),380(4)
         LA    1,88(,13)
         L     15,=V(CPNOT)
         BALR  14,15
@@L295   EQU   *
* Function output_deps epilogue
         PDPEPIL
* Function output_deps literal pool
         DS    0F
         LTORG
* Function output_deps page table
         DS    0F
@@PGT27  EQU   *
         DC    A(@@PG27)
         DS    0F
* X-func cppfin prologue
CPPFIN   PDPPRLG CINDEX=28,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN28
         LTORG
@@FEN28  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG28   EQU   *
         LR    11,1
         L     10,=A(@@PGT28)
* Function cppfin code
         L     3,0(11)
         L     2,0(3)
         LTR   2,2
         BNE   @@L310
@@L314   EQU   *
         IC    2,421(3)
         CLM   2,1,=XL1'00'
         BE    @@L311
         L     2,144(3)
         LTR   2,2
         BE    @@L315
@@L311   EQU   *
         IC    2,426(3)
         CLM   2,1,=XL1'00'
         BE    @@L306
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(@CPP@REP)
         BALR  14,15
         B     @@L306
@@L315   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@27)
         BALR  14,15
         B     @@L311
@@L310   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(@CPPBUFF)
         BALR  14,15
         L     2,0(3)
         LTR   2,2
         BNE   @@L310
         B     @@L314
@@L306   EQU   *
* Function cppfin epilogue
         PDPEPIL
* Function cppfin literal pool
         DS    0F
         LTORG
* Function cppfin page table
         DS    0F
@@PGT28  EQU   *
         DC    A(@@PG28)
         DS    0F
* S-func new_pending_directive prologue
@@28     PDPPRLG CINDEX=29,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN29
         LTORG
@@FEN29  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG29   EQU   *
         LR    11,1
         L     10,=A(@@PGT29)
* Function new_pending_directive code
         L     3,0(11)
         MVC   88(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         MVC   4(4,15),4(11)
         MVC   0(4,15),=F'0'
         MVC   8(4,15),8(11)
         L     2,0(3)
         LTR   2,2
         BNE   @@L318
         ST    15,0(3)
         B     @@L319
@@L318   EQU   *
         L     2,4(3)
         ST    15,0(2)
@@L319   EQU   *
         ST    15,4(3)
* Function new_pending_directive epilogue
         PDPEPIL
* Function new_pending_directive literal pool
         DS    0F
         LTORG
* Function new_pending_directive page table
         DS    0F
@@PGT29  EQU   *
         DC    A(@@PG29)
         DS    0F
* S-func parse_option prologue
@@29     PDPPRLG CINDEX=30,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN30
         LTORG
@@FEN30  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG30   EQU   *
         LR    11,1
         L     10,=A(@@PGT30)
* Function parse_option code
         L     7,0(11)
         SLR   5,5
         LA    6,68(0,0)
@@L338   EQU   *
         LR    3,5
         AR    3,6
         SRL   3,1
         LR    4,3
         MH    4,=H'16'
         A     4,=A(@@7)
         L     2,8(4)
         ST    7,88(13)
         MVC   92(4,13),0(4)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNH   @@L324
         LR    5,3
         A     5,=F'1'
@@L321   EQU   *
         CLR   6,5
         BH    @@L338
         L     15,=F'-1'
         B     @@L320
@@L324   EQU   *
         LTR   15,15
         BL    @@L342
         IC    2,0(2,7)
         LR    15,3
         CLM   2,1,=XL1'00'
         BE    @@L320
         LR    5,3
         A     5,=F'1'
         L     2,4(4)
         LTR   2,2
         BE    @@L321
         LR    6,3
         LA    2,67(0,0)
         CLR   5,2
         BH    @@L331
         LR    3,5
         MH    3,=H'16'
         A     3,=A(@@7)
@@L337   EQU   *
         L     2,8(3)
         ST    7,88(13)
         MVC   92(4,13),0(3)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L331
         IC    2,0(2,7)
         LR    15,5
         CLM   2,1,=XL1'00'
         BE    @@L320
         L     2,4(3)
         LTR   2,2
         BE    @@L332
         LR    6,5
@@L332   EQU   *
         A     3,=F'16'
         A     5,=F'1'
         LA    2,67(0,0)
         CLR   5,2
         BNH   @@L337
@@L331   EQU   *
         LR    15,6
         B     @@L320
@@L342   EQU   *
         LR    6,3
         B     @@L321
@@L320   EQU   *
* Function parse_option epilogue
         PDPEPIL
* Function parse_option literal pool
         DS    0F
         LTORG
* Function parse_option page table
         DS    0F
@@PGT30  EQU   *
         DC    A(@@PG30)
@@LC139  EQU   *
         DC    C'too many filenames. Type %s --help for usage inf'
         DC    C'o'
         DC    X'0'
@@LC140  EQU   *
         DC    C'_'
         DC    X'0'
@@LC142  EQU   *
         DC    C'-'
         DC    X'0'
@@LC143  EQU   *
         DC    C'-I- specified twice'
         DC    X'0'
@@LC144  EQU   *
         DC    C'-Wall'
         DC    X'0'
@@LC145  EQU   *
         DC    C'-Wtraditional'
         DC    X'0'
@@LC146  EQU   *
         DC    C'-Wtrigraphs'
         DC    X'0'
@@LC147  EQU   *
         DC    C'-Wcomment'
         DC    X'0'
@@LC148  EQU   *
         DC    C'-Wcomments'
         DC    X'0'
@@LC149  EQU   *
         DC    C'-Wundef'
         DC    X'0'
@@LC150  EQU   *
         DC    C'-Wimport'
         DC    X'0'
@@LC151  EQU   *
         DC    C'-Werror'
         DC    X'0'
@@LC152  EQU   *
         DC    C'-Wsystem-headers'
         DC    X'0'
@@LC153  EQU   *
         DC    C'-Wno-traditional'
         DC    X'0'
@@LC154  EQU   *
         DC    C'-Wno-trigraphs'
         DC    X'0'
@@LC155  EQU   *
         DC    C'-Wno-comment'
         DC    X'0'
@@LC156  EQU   *
         DC    C'-Wno-comments'
         DC    X'0'
@@LC157  EQU   *
         DC    C'-Wno-undef'
         DC    X'0'
@@LC158  EQU   *
         DC    C'-Wno-import'
         DC    X'0'
@@LC159  EQU   *
         DC    C'-Wno-error'
         DC    X'0'
@@LC160  EQU   *
         DC    C'-Wno-system-headers'
         DC    X'0'
@@LC141  EQU   *
         DC    C'output filename specified twice'
         DC    X'0'
         DS    0F
* X-func cpphopt prologue
CPPHOPT  PDPPRLG CINDEX=31,FRAME=128,BASER=12,ENTRY=YES
         B     @@FEN31
         LTORG
@@FEN31  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG31   EQU   *
         LR    11,1
         L     10,=A(@@PGT31)
* Function cpphopt code
         L     8,0(11)
         L     7,4(11)
         L     5,8(11)
         MVC   108(4,13),=F'0'
         L     4,376(8)
         L     3,0(5)
         CLI   0(3),96
         BE    @@L511
@@L345   EQU   *
         L     2,364(8)
         LTR   2,2
         BNE   @@L346
         ST    3,364(8)
@@L350   EQU   *
         L     12,0(,10)
         L     15,108(13)
         A     15,=F'1'
         L     14,=A(@@L343)
         BR    14
@@L346   EQU   *
         L     2,368(8)
         LTR   2,2
         BNE   @@L348
         ST    3,368(8)
         B     @@L350
@@L348   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC139)
         L     2,=V(PROGNAME)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(CPP@FATA)
         BALR  14,15
         B     @@L350
@@L511   EQU   *
         IC    2,1(3)
         CLM   2,1,=XL1'00'
         BE    @@L345
         MVC   116(4,13),108(13)
         A     3,=F'1'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@29)
         BALR  14,15
         LR    2,15
         L     15,108(13)
         LTR   2,2
         L     14,=A(@@L343)
         BLR   14
         LR    15,2
         MH    15,=H'16'
         A     15,=A(@@7)
         MVC   112(4,13),12(15)
         L     6,4(15)
         LTR   6,6
         BE    @@L352
         L     3,0(5)
         LR    2,3
         A     2,8(15)
         A     2,=F'1'
         ST    2,116(13)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   @@L352
         L     2,112(13)
         LA    9,21(0,0)
         CLR   2,9
         BE    @@L352
         MVC   108(4,13),=F'1'
         MVC   116(4,13),4(5)
         L     9,116(13)
         LTR   9,9
         L     14,=A(@@L512)
         BER   14
@@L352   EQU   *
         L     3,112(13)
         LA    2,68(0,0)
         CLR   3,2
         BH    @@L350
         MH    3,=H'4'
         L     2,=A(@@L498)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L498   EQU   *
         DC    A(@@L378)
         DC    A(@@L384)
         DC    A(@@L371)
         DC    A(@@L372)
         DC    A(@@L373)
         DC    A(@@L432)
         DC    A(@@L376)
         DC    A(@@L380)
         DC    A(@@L379)
         DC    A(@@L438)
         DC    A(@@L423)
         DC    A(@@L430)
         DC    A(@@L506)
         DC    A(@@L422)
         DC    A(@@L424)
         DC    A(@@L431)
         DC    A(@@L426)
         DC    A(@@L428)
         DC    A(@@L428)
         DC    A(@@L377)
         DC    A(@@L437)
         DC    A(@@L462)
         DC    A(@@L409)
         DC    A(@@L357)
         DC    A(@@L358)
         DC    A(@@L359)
         DC    A(@@L361)
         DC    A(@@L363)
         DC    A(@@L360)
         DC    A(@@L362)
         DC    A(@@L364)
         DC    A(@@L366)
         DC    A(@@L365)
         DC    A(@@L371)
         DC    A(@@L461)
         DC    A(@@L445)
         DC    A(@@L445)
         DC    A(@@L386)
         DC    A(@@L443)
         DC    A(@@L455)
         DC    A(@@L455)
         DC    A(@@L391)
         DC    A(@@L393)
         DC    A(@@L388)
         DC    A(@@L399)
         DC    A(@@L389)
         DC    A(@@L390)
         DC    A(@@L404)
         DC    A(@@L405)
         DC    A(@@L406)
         DC    A(@@L382)
         DC    A(@@L381)
         DC    A(@@L385)
         DC    A(@@L392)
         DC    A(@@L399)
         DC    A(@@L403)
         DC    A(@@L403)
         DC    A(@@L393)
         DC    A(@@L395)
         DC    A(@@L395)
         DC    A(@@L399)
         DC    A(@@L396)
         DC    A(@@L403)
         DC    A(@@L403)
         DC    A(@@L383)
         DC    A(@@L374)
         DC    A(@@L375)
         DC    A(@@L369)
         DC    A(@@L350)
@@L357   EQU   *
         MVC   404(4,8),=A(@@LC140)
         B     @@L350
@@L378   EQU   *
         MVI   440(8),0
         B     @@L350
@@L384   EQU   *
         MVI   414(8),1
         MVI   415(8),1
         B     @@L350
@@L372   EQU   *
         L     12,0(,10)
         MVI   452(8),1
         B     @@L350
@@L373   EQU   *
         MVI   452(8),1
@@L375   EQU   *
         L     12,0(,10)
         MVI   476(8),1
         B     @@L350
@@L432   EQU   *
         L     9,116(13)
         CLI   0(9),96
         BE    @@L513
         ST    4,88(13)
         MVC   92(4,13),116(13)
         MVC   96(4,13),=V(CPP@ASSE)
@@L505   EQU   *
         LA    1,88(,13)
         L     15,=A(@@28)
         BALR  14,15
         B     @@L350
@@L513   EQU   *
         IC    2,1(9)
         CLM   2,1,=XL1'00'
         BNE   @@L434
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=A(@@25)
         BALR  14,15
         MVC   0(4,4),=F'0'
         MVC   4(4,4),=F'0'
         B     @@L350
@@L434   EQU   *
         ST    4,88(13)
         L     2,116(13)
         A     2,=F'1'
         ST    2,116(13)
         ST    2,92(13)
         MVC   96(4,13),=V(CPP@UNAS)
         B     @@L505
@@L376   EQU   *
         MVI   417(8),0
         B     @@L350
@@L380   EQU   *
         ST    4,88(13)
         MVC   92(4,13),116(13)
         MVC   96(4,13),=V(CPPDEFIN)
         B     @@L505
@@L379   EQU   *
         MVI   426(8),1
         B     @@L350
@@L438   EQU   *
         MVC   88(4,13),116(13)
         MVC   92(4,13),=A(@@LC142)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L439
         IC    2,439(8)
         CLM   2,1,=XL1'00'
         BNE   @@L440
         MVC   8(4,4),16(4)
         MVC   12(4,4),20(4)
         ST    15,16(4)
         ST    15,20(4)
         MVI   439(8),1
         B     @@L350
@@L440   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC143)
@@L509   EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(CPP@FATA)
         BALR  14,15
@@L510   EQU   *
         L     12,0(,10)
         LR    15,7
         L     14,=A(@@L343)
         BR    14
@@L439   EQU   *
         MVC   88(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         ST    8,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
@@L504   EQU   *
         L     12,0(,10)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
         B     @@L350
@@L423   EQU   *
         MVI   421(8),2
@@L507   EQU   *
         MVI   436(8),1
         B     @@L350
@@L430   EQU   *
         MVI   421(8),2
@@L506   EQU   *
         MVC   380(4,8),116(13)
         B     @@L350
@@L422   EQU   *
         MVI   423(8),1
         B     @@L350
@@L424   EQU   *
         MVI   421(8),1
         B     @@L507
@@L431   EQU   *
         MVI   421(8),1
         B     @@L506
@@L426   EQU   *
         MVI   422(8),1
         B     @@L350
@@L428   EQU   *
         MVC   88(4,13),236(8)
         MVC   92(4,13),116(13)
         XC    112(4,13),=F'17'
         L     3,112(13)
         LPR   2,3
         BCTR  2,0
         SRL   2,31
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(DA@TARGE)
         BALR  14,15
         B     @@L350
@@L377   EQU   *
         MVI   438(8),1
         B     @@L350
@@L437   EQU   *
         ST    4,88(13)
         MVC   92(4,13),116(13)
         MVC   96(4,13),=V(CPP@UNDE)
         B     @@L505
@@L462   EQU   *
         L     2,108(13)
         MH    2,=H'4'
         L     9,0(2,5)
         ST    9,88(13)
         MVC   92(4,13),=A(@@LC144)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L463
         MVI   432(8),1
@@L503   EQU   *
         MVI   431(8),1
         B     @@L350
@@L463   EQU   *
         L     3,0(2,5)
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC145)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L465
         MVI   434(8),1
         B     @@L350
@@L465   EQU   *
         L     9,0(2,5)
         ST    9,88(13)
         MVC   92(4,13),=A(@@LC146)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L467
         MVI   432(8),1
         B     @@L350
@@L467   EQU   *
         L     3,0(2,5)
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC147)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L503
         L     9,0(2,5)
         ST    9,88(13)
         MVC   92(4,13),=A(@@LC148)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L503
         L     3,0(2,5)
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC149)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L473
         MVI   441(8),1
         B     @@L350
@@L473   EQU   *
         L     9,0(2,5)
         ST    9,88(13)
         MVC   92(4,13),=A(@@LC150)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L475
         MVI   433(8),1
         B     @@L350
@@L475   EQU   *
         L     3,0(2,5)
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC151)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L477
         MVI   435(8),1
         B     @@L350
@@L477   EQU   *
         L     9,0(2,5)
         ST    9,88(13)
         MVC   92(4,13),=A(@@LC152)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L479
         MVI   429(8),1
         B     @@L350
@@L479   EQU   *
         L     3,0(2,5)
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC153)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L481
         STC   15,434(8)
         B     @@L350
@@L481   EQU   *
         L     9,0(2,5)
         ST    9,88(13)
         MVC   92(4,13),=A(@@LC154)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L483
         STC   15,432(8)
         B     @@L350
@@L483   EQU   *
         L     3,0(2,5)
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC155)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L514
@@L502   EQU   *
         STC   15,431(8)
         B     @@L350
@@L514   EQU   *
         L     9,0(2,5)
         ST    9,88(13)
         MVC   92(4,13),=A(@@LC156)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L502
         L     3,0(2,5)
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC157)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L489
         STC   15,441(8)
         B     @@L350
@@L489   EQU   *
         L     9,0(2,5)
         ST    9,88(13)
         MVC   92(4,13),=A(@@LC158)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L491
         STC   15,433(8)
         B     @@L350
@@L491   EQU   *
         L     3,0(2,5)
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC159)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L493
         STC   15,435(8)
         B     @@L350
@@L493   EQU   *
         L     5,0(2,5)
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC160)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L495
         STC   15,429(8)
         B     @@L350
@@L495   EQU   *
         L     15,108(13)
         L     2,12(11)
         LTR   2,2
         L     14,=A(@@L343)
         BER   14
         B     @@L350
@@L409   EQU   *
         L     3,116(13)
         IC    2,0(3)
         A     3,=F'1'
         ST    3,116(13)
         CLM   2,1,=XL1'00'
         BE    @@L350
@@L421   EQU   *
         N     2,=XL4'000000FF'
         LA    9,201(0,0)
         CR    2,9
         BE    @@L417
         BH    @@L420
         LA    3,196(0,0)
         CLR   2,3
         BE    @@L416
@@L410   EQU   *
         L     9,116(13)
         IC    2,0(9)
         A     9,=F'1'
         ST    9,116(13)
         CLM   2,1,=XL1'00'
         BNE   @@L421
         B     @@L350
@@L416   EQU   *
         MVI   448(8),3
         B     @@L410
@@L420   EQU   *
         LA    9,212(0,0)
         CLR   2,9
         BE    @@L414
         LA    3,213(0,0)
         CLR   2,3
         BNE   @@L410
         MVI   448(8),2
         B     @@L410
@@L414   EQU   *
         MVI   448(8),1
         B     @@L410
@@L417   EQU   *
         MVI   449(8),1
         B     @@L410
@@L358   EQU   *
         MVC   404(4,8),=A(@@LC91)
         B     @@L350
@@L359   EQU   *
         MVI   451(8),0
         B     @@L350
@@L361   EQU   *
         MVI   445(8),0
         B     @@L350
@@L363   EQU   *
         MVI   450(8),0
         B     @@L350
@@L360   EQU   *
         MVI   445(8),1
         B     @@L350
@@L362   EQU   *
         MVI   450(8),1
         B     @@L350
@@L364   EQU   *
         MVI   413(8),1
         B     @@L350
@@L366   EQU   *
         L     9,116(13)
         IC    2,0(9)
         CLM   2,1,=XL1'00'
         BE    @@L350
         ST    9,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         MVC   96(4,13),=F'10'
         LA    1,88(,13)
         L     15,=V(STRTOL)
         BALR  14,15
         L     2,104(13)
         IC    2,0(2)
         SLL   2,24
         SRA   2,24
         C     2,=F'0'
         BNE   @@L350
         LTR   15,15
         BNH   @@L350
         LA    2,100(0,0)
         CR    15,2
         BH    @@L350
         ST    15,372(8)
         B     @@L350
@@L365   EQU   *
         MVI   413(8),0
         B     @@L350
@@L371   EQU   *
         LA    1,88(,13)
         L     15,=A(@@30)
         BALR  14,15
         B     @@L372
@@L461   EQU   *
         MVC   88(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         ST    8,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'2'
         B     @@L504
@@L445   EQU   *
         MVC   88(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         MVC   4(4,15),116(13)
         MVC   0(4,15),=F'0'
         L     9,112(13)
         LA    3,36(0,0)
         CLR   9,3
         BE    @@L515
         L     2,40(4)
         LTR   2,2
         BNE   @@L452
         ST    15,40(4)
@@L453   EQU   *
         ST    15,44(4)
         B     @@L350
@@L452   EQU   *
         L     2,44(4)
         ST    15,0(2)
         B     @@L453
@@L515   EQU   *
         L     2,48(4)
         LTR   2,2
         BNE   @@L448
         ST    15,48(4)
@@L449   EQU   *
         ST    15,52(4)
         B     @@L350
@@L448   EQU   *
         L     2,52(4)
         ST    15,0(2)
         B     @@L449
@@L386   EQU   *
         MVC   396(4,8),116(13)
         MVC   88(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    15,400(8)
         B     @@L350
@@L443   EQU   *
         MVC   88(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         ST    8,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         B     @@L504
@@L455   EQU   *
         MVC   88(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    15,120(13)
         L     2,396(8)
         LTR   2,2
         BNE   @@L516
         L     2,=V(CPPGDLEN)
         L     9,0(2)
         LTR   9,9
         BE    @@L458
         L     2,120(13)
         AR    2,9
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    4,15
         LR    5,9
         L     2,=V(CPPGDIR)
         LR    3,9
         MVCL  4,2
         L     2,120(13)
         A     2,=F'1'
         LR    6,15
         AR    6,9
         LR    7,2
         L     4,116(13)
         LR    5,2
@@L501   EQU   *
         MVCL  6,4
@@L457   EQU   *
         ST    8,88(13)
         ST    15,92(13)
         XC    112(4,13),=F'39'
         L     3,112(13)
         LPR   2,3
         BCTR  2,0
         SRL   2,31
         ST    2,96(13)
         B     @@L504
@@L458   EQU   *
         MVC   88(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         B     @@L457
@@L516   EQU   *
         L     2,400(8)
         LR    3,15
         AR    3,2
         A     3,=F'1'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    6,15
         LR    7,2
         L     4,396(8)
         LR    5,2
         MVCL  6,4
         L     3,120(13)
         A     3,=F'1'
         LR    6,15
         AR    6,2
         LR    7,3
         L     4,116(13)
         LR    5,3
         B     @@L501
@@L391   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'9'
@@L508   EQU   *
         LA    1,88(,13)
         L     15,=A(@@15)
         BALR  14,15
         B     @@L350
@@L388   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'5'
         B     @@L508
@@L389   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'7'
         B     @@L508
@@L390   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'8'
         B     @@L508
@@L404   EQU   *
         MVI   446(8),1
         B     @@L350
@@L405   EQU   *
         MVI   447(8),1
         B     @@L350
@@L406   EQU   *
         L     2,368(8)
         LTR   2,2
         BNE   @@L407
         MVC   368(4,8),116(13)
         B     @@L350
@@L407   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC141)
         B     @@L509
@@L382   EQU   *
         MVI   444(8),1
         B     @@L350
@@L381   EQU   *
         MVI   427(8),1
         B     @@L382
@@L385   EQU   *
         MVI   437(8),1
         B     @@L350
@@L392   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'6'
         B     @@L508
@@L393   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         B     @@L508
@@L395   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'1'
         B     @@L508
@@L399   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'2'
         B     @@L508
@@L396   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'3'
         B     @@L508
@@L403   EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'4'
         B     @@L508
@@L383   EQU   *
         MVI   418(8),1
         B     @@L350
@@L374   EQU   *
         MVI   412(8),1
         B     @@L375
@@L369   EQU   *
         MVI   428(8),1
         B     @@L350
@@L512   EQU   *
         ST    8,88(13)
         ST    6,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(CPP@FATA)
         BALR  14,15
         B     @@L510
@@L343   EQU   *
* Function cpphopt epilogue
         PDPEPIL
* Function cpphopt literal pool
         DS    0F
         LTORG
* Function cpphopt page table
         DS    0F
@@PGT31  EQU   *
         DC    A(@@PG31)
         DS    0F
* X-func cppopts prologue
CPPOPTS  PDPPRLG CINDEX=32,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN32
         LTORG
@@FEN32  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG32   EQU   *
         LR    11,1
         L     10,=A(@@PGT32)
* Function cppopts code
         L     6,0(11)
         L     4,4(11)
         L     5,8(11)
         SLR   3,3
         CR    3,4
         BNL   @@L519
@@L523   EQU   *
         ST    6,88(13)
         LR    2,4
         SR    2,3
         ST    2,92(13)
         LR    2,3
         MH    2,=H'4'
         AR    2,5
         ST    2,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(CPPHOPT)
         BALR  14,15
         LTR   15,15
         BE    @@L519
         AR    3,15
         CR    3,4
         BL    @@L523
@@L519   EQU   *
         LR    15,3
* Function cppopts epilogue
         PDPEPIL
* Function cppopts literal pool
         DS    0F
         LTORG
* Function cppopts page table
         DS    0F
@@PGT32  EQU   *
         DC    A(@@PG32)
@@LC163  EQU   *
         DC    C'you must additionally specify either -M or -MM'
         DC    X'0'
@@LC161  EQU   *
         DC    C'GNU CPP version %s (cpplib)'
         DC    X'0'
@@LC162  EQU   *
         DC    C' (370/MVS)'
         DC    X'0'
         DS    0F
* X-func cpp_post_options prologue
CPP@POST PDPPRLG CINDEX=33,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN33
         LTORG
@@FEN33  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG33   EQU   *
         LR    11,1
         L     10,=A(@@PGT33)
* Function cpp_post_options code
         L     3,0(11)
         IC    2,476(3)
         CLM   2,1,=XL1'00'
         BNE   @@L539
@@L526   EQU   *
         L     2,364(3)
         LTR   2,2
         BNE   @@L540
@@L528   EQU   *
         MVC   364(4,3),=A(@@LC91)
@@L527   EQU   *
         L     2,368(3)
         LTR   2,2
         BNE   @@L541
@@L530   EQU   *
         MVC   368(4,3),=A(@@LC91)
@@L529   EQU   *
         IC    2,414(3)
         CLM   2,1,=XL1'00'
         BE    @@L531
         MVI   434(3),0
@@L531   EQU   *
         L     2,404(3)
         LTR   2,2
         BNE   @@L532
         MVC   404(4,3),=A(@@LC91)
@@L532   EQU   *
         IC    2,445(3)
         CLM   2,1,=XL1'00'
         BE    @@L533
         MVI   11(3),1
@@L533   EQU   *
         IC    15,448(3)
         CLM   15,1,=XL1'01'
         BE    @@L542
@@L534   EQU   *
         IC    2,436(3)
         CLM   2,1,=XL1'00'
         BE    @@L535
         CLM   15,1,=XL1'01'
         BE    @@L536
         MVI   448(3),0
@@L536   EQU   *
         MVI   449(3),0
@@L535   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         IC    2,421(3)
         CLM   2,1,=XL1'00'
         BNE   @@L525
         IC    2,423(3)
         CLM   2,1,=XL1'00'
         BNE   @@L538
         L     2,380(3)
         LTR   2,2
         BNE   @@L538
         IC    2,422(3)
         CLM   2,1,=XL1'00'
         BE    @@L525
@@L538   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC163)
         LA    1,88(,13)
         L     15,=V(CPP@FATA)
         BALR  14,15
         B     @@L525
@@L542   EQU   *
         STC   15,436(3)
         B     @@L534
@@L541   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC142)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L529
         B     @@L530
@@L540   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC142)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L527
         B     @@L528
@@L539   EQU   *
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(@@LC161)
         L     2,=V(VERSION@)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(@@LC162)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),=F'21'
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L526
@@L525   EQU   *
* Function cpp_post_options epilogue
         PDPEPIL
* Function cpp_post_options literal pool
         DS    0F
         LTORG
* Function cpp_post_options page table
         DS    0F
@@PGT33  EQU   *
         DC    A(@@PG33)
@@LC164  EQU   *
         DC    C'DEPENDENCIES_OUTPUT'
         DC    X'0'
@@LC165  EQU   *
         DC    C'SUNPRO_DEPENDENCIES'
         DC    X'0'
         DS    0F
* S-func init_dependency_output prologue
@@31     PDPPRLG CINDEX=34,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN34
         LTORG
@@FEN34  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG34   EQU   *
         LR    11,1
         L     10,=A(@@PGT34)
* Function init_dependency_output code
         L     8,0(11)
         IC    2,421(8)
         CLM   2,1,=XL1'00'
         BE    @@L554
         L     2,380(8)
         LTR   2,2
         BNE   @@L543
         MVC   380(4,8),368(8)
         B     @@L543
@@L554   EQU   *
         MVC   88(4,13),=A(@@LC164)
         LA    1,88(,13)
         L     15,=V(GETENV)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L545
         MVI   421(8),1
@@L546   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'64'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    @@L549
         MVC   88(4,13),236(8)
         A     15,=F'1'
         ST    15,92(13)
         LR    2,15
         BCTR  2,0
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(DA@TARGE)
         BALR  14,15
         SR    2,3
         A     2,=F'1'
         ST    2,88(13)
         BCTR  2,0
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    6,15
         LR    7,2
         LR    4,3
         LR    5,2
         MVCL  6,4
         SLR   3,3
         STC   3,0(2,15)
@@L550   EQU   *
         L     2,380(8)
         LTR   2,2
         BNE   @@L551
         ST    15,380(8)
@@L551   EQU   *
         MVI   424(8),1
         B     @@L543
@@L549   EQU   *
         LR    15,3
         B     @@L550
@@L545   EQU   *
         MVC   88(4,13),=A(@@LC165)
         LA    1,88(,13)
         L     15,=V(GETENV)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L543
         MVI   421(8),2
         MVI   425(8),1
         B     @@L546
@@L543   EQU   *
* Function init_dependency_output epilogue
         PDPEPIL
* Function init_dependency_output literal pool
         DS    0F
         LTORG
* Function init_dependency_output page table
         DS    0F
@@PGT34  EQU   *
         DC    A(@@PG34)
@@LC166  EQU   *
         DC    C'Switches:'
         DC    X'15'
         DC    C'  -include <file>           Include the contents'
         DC    C' of <file> before other files'
         DC    X'15'
         DC    C'  -imacros <file>           Accept definition of'
         DC    C' macros in <file>'
         DC    X'15'
         DC    C'  -iprefix <path>           Specify <path> as a '
         DC    C'prefix for next two options'
         DC    X'15'
         DC    C'  -iwithprefix <dir>        Add <dir> to the end'
         DC    C' of the system include path'
         DC    X'15'
         DC    C'  -iwithprefixbefore <dir>  Add <dir> to the end'
         DC    C' of the main include path'
         DC    X'15'
         DC    C'  -isystem <dir>            Add <dir> to the sta'
         DC    C'rt of the system include path'
         DC    X'15'
         DC    X'0'
@@LC167  EQU   *
         DC    C'  -idirafter <dir>          Add <dir> to the end'
         DC    C' of the system include path'
         DC    X'15'
         DC    C'  -I <dir>                  Add <dir> to the end'
         DC    C' of the main include path'
         DC    X'15'
         DC    C'  -I-                       Fine-grained include'
         DC    C' path control; see info docs'
         DC    X'15'
         DC    C'  -nostdinc                 Do not search system'
         DC    C' include directories'
         DC    X'15'
         DC    C'                             (dirs specified wit'
         DC    C'h -isystem will still be used)'
         DC    X'15'
         DC    C'  -nostdinc++               Do not search system'
         DC    C' include directories for C++'
         DC    X'15'
         DC    C'  -o <file>                 Put output into <fil'
         DC    C'e>'
         DC    X'15'
         DC    X'0'
@@LC168  EQU   *
         DC    C'  -pedantic                 Issue all warnings d'
         DC    C'emanded by strict ISO C'
         DC    X'15'
         DC    C'  -pedantic-errors          Issue -pedantic warn'
         DC    C'ings as errors instead'
         DC    X'15'
         DC    C'  -trigraphs                Support ISO C trigra'
         DC    C'phs'
         DC    X'15'
         DC    C'  -lang-c                   Assume that the inpu'
         DC    C't sources are in C'
         DC    X'15'
         DC    C'  -lang-c89                 Assume that the inpu'
         DC    C't sources are in C89'
         DC    X'15'
         DC    X'0'
@@LC169  EQU   *
         DC    C'  -lang-c++                 Assume that the inpu'
         DC    C't sources are in C++'
         DC    X'15'
         DC    C'  -lang-objc                Assume that the inpu'
         DC    C't sources are in ObjectiveC'
         DC    X'15'
         DC    C'  -lang-objc++              Assume that the inpu'
         DC    C't sources are in ObjectiveC++'
         DC    X'15'
         DC    C'  -lang-asm                 Assume that the inpu'
         DC    C't sources are in assembler'
         DC    X'15'
         DC    X'0'
@@LC170  EQU   *
         DC    C'  -std=<std name>           Specify the conforma'
         DC    C'nce standard; one of:'
         DC    X'15'
         DC    C'                            gnu89, gnu99, c89, c'
         DC    C'99, iso9899:1990,'
         DC    X'15'
         DC    C'                            iso9899:199409, iso9'
         DC    C'899:1999'
         DC    X'15'
         DC    C'  -+                        Allow parsing of C++'
         DC    C' style features'
         DC    X'15'
         DC    C'  -w                        Inhibit warning mess'
         DC    C'ages'
         DC    X'15'
         DC    C'  -Wtrigraphs               Warn if trigraphs ar'
         DC    C'e encountered'
         DC    X'15'
         DC    C'  -Wno-trigraphs            Do not warn about tr'
         DC    C'igraphs'
         DC    X'15'
         DC    C'  -Wcomment{s}              Warn if one comment '
         DC    C'starts inside another'
         DC    X'15'
         DC    X'0'
@@LC171  EQU   *
         DC    C'  -Wno-comment{s}           Do not warn about co'
         DC    C'mments'
         DC    X'15'
         DC    C'  -Wtraditional             Warn about features '
         DC    C'not present in traditional C'
         DC    X'15'
         DC    C'  -Wno-traditional          Do not warn about tr'
         DC    C'aditional C'
         DC    X'15'
         DC    C'  -Wundef                   Warn if an undefined'
         DC    C' macro is used by #if'
         DC    X'15'
         DC    C'  -Wno-undef                Do not warn about te'
         DC    C'sting undefined macros'
         DC    X'15'
         DC    C'  -Wimport                  Warn about the use o'
         DC    C'f the #import directive'
         DC    X'15'
         DC    X'0'
@@LC172  EQU   *
         DC    C'  -Wno-import               Do not warn about th'
         DC    C'e use of #import'
         DC    X'15'
         DC    C'  -Werror                   Treat all warnings a'
         DC    C's errors'
         DC    X'15'
         DC    C'  -Wno-error                Do not treat warning'
         DC    C's as errors'
         DC    X'15'
         DC    C'  -Wsystem-headers          Do not suppress warn'
         DC    C'ings from system headers'
         DC    X'15'
         DC    C'  -Wno-system-headers       Suppress warnings fr'
         DC    C'om system headers'
         DC    X'15'
         DC    C'  -Wall                     Enable all preproces'
         DC    C'sor warnings'
         DC    X'15'
         DC    X'0'
@@LC173  EQU   *
         DC    C'  -M                        Generate make depend'
         DC    C'encies'
         DC    X'15'
         DC    C'  -MM                       As -M, but ignore sy'
         DC    C'stem header files'
         DC    X'15'
         DC    C'  -MD                       Generate make depend'
         DC    C'encies and compile'
         DC    X'15'
         DC    C'  -MMD                      As -MD, but ignore s'
         DC    C'ystem header files'
         DC    X'15'
         DC    C'  -MF <file>                Write dependency out'
         DC    C'put to the given file'
         DC    X'15'
         DC    C'  -MG                       Treat missing header'
         DC    C' file as generated files'
         DC    X'15'
         DC    X'0'
@@LC174  EQU   *
         DC    C'  -MP'
         DC    X'5'
         DC    X'5'
         DC    X'5'
         DC    C'    Generate phony targets for all headers'
         DC    X'15'
         DC    C'  -MQ <target>              Add a MAKE-quoted ta'
         DC    C'rget'
         DC    X'15'
         DC    C'  -MT <target>              Add an unquoted targ'
         DC    C'et'
         DC    X'15'
         DC    X'0'
@@LC175  EQU   *
         DC    C'  -D<macro>                 Define a <macro> wit'
         DC    C'h string ''1'' as its value'
         DC    X'15'
         DC    C'  -D<macro>=<val>           Define a <macro> wit'
         DC    C'h <val> as its value'
         DC    X'15'
         DC    C'  -A<question>=<answer>     Assert the <answer> '
         DC    C'to <question>'
         DC    X'15'
         DC    C'  -A-<question>=<answer>    Disable the <answer>'
         DC    C' to <question>'
         DC    X'15'
         DC    C'  -U<macro>                 Undefine <macro> '
         DC    X'15'
         DC    C'  -v                        Display the version '
         DC    C'number'
         DC    X'15'
         DC    X'0'
@@LC176  EQU   *
         DC    C'  -H                        Print the name of he'
         DC    C'ader files as they are used'
         DC    X'15'
         DC    C'  -C                        Do not discard comme'
         DC    C'nts'
         DC    X'15'
         DC    C'  -dM                       Display a list of ma'
         DC    C'cro definitions active at end'
         DC    X'15'
         DC    C'  -dD                       Preserve macro defin'
         DC    C'itions in output'
         DC    X'15'
         DC    C'  -dN                       As -dD except that o'
         DC    C'nly the names are preserved'
         DC    X'15'
         DC    C'  -dI                       Include #include dir'
         DC    C'ectives in the output'
         DC    X'15'
         DC    X'0'
@@LC177  EQU   *
         DC    C'  -fpreprocessed            Treat the input file'
         DC    C' as already preprocessed'
         DC    X'15'
         DC    C'  -ftabstop=<number>        Distance between tab'
         DC    C' stops for column reporting'
         DC    X'15'
         DC    C'  -P                        Do not generate #lin'
         DC    C'e directives'
         DC    X'15'
         DC    C'  -$                        Do not allow ''$'' i'
         DC    C'n identifiers'
         DC    X'15'
         DC    C'  -remap                    Remap file names whe'
         DC    C'n including files'
         DC    X'15'
         DC    C'  --version                 Display version info'
         DC    C'rmation'
         DC    X'15'
         DC    C'  -h or --help              Display this informa'
         DC    C'tion'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func print_help prologue
@@30     PDPPRLG CINDEX=35,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN35
         LTORG
@@FEN35  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG35   EQU   *
         LR    11,1
         L     10,=A(@@PGT35)
* Function print_help code
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC166)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC167)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC168)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC169)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC170)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC171)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC172)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC173)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC174)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC175)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC176)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTOUT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC177)
         MVC   92(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
* Function print_help epilogue
         PDPEPIL
* Function print_help literal pool
         DS    0F
         LTORG
* Function print_help page table
         DS    0F
@@PGT35  EQU   *
         DC    A(@@PG35)
         END
