         COPY  PDPTOP
         CSECT
* Program text area
@@LC0    EQU   *
         DC    C'0x%x'
         DC    X'0'
         DS    0F
* X-func dw2_assemble_integer prologue
DW2@ASSE PDPPRLG CINDEX=0,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function dw2_assemble_integer code
         L     2,0(11)
         L     4,4(11)
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(INTEGER@)
         BALR  14,15
         LTR   15,15
         BE    @@L2
         ST    15,88(13)
         L     3,=V(ASM@OUT@)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L6
         MVC   88(4,13),0(3)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         B     @@L1
@@L6     EQU   *
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC0)
         MVC   96(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1
@@L2     EQU   *
         ST    4,88(13)
         ST    2,92(13)
         MVC   96(4,13),=F'8'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
@@L1     EQU   *
* Function dw2_assemble_integer epilogue
         PDPEPIL
* Function dw2_assemble_integer literal pool
         DS    0F
         LTORG
* Function dw2_assemble_integer page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
@@LC1    EQU   *
         DC    X'5'
         DC    C'%s '
         DC    X'0'
@@LC2    EQU   *
         DC    C'*'
         DC    X'0'
         DS    0F
* X-func daod prologue
DAOD     PDPPRLG CINDEX=1,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function daod code
         L     4,0(11)
         L     3,4(11)
         LR    15,4
         MH    15,=H'8'
         LA    2,31(0,0)
         CR    15,2
         BH    @@L8
         L     2,=F'-1'
         SLL   2,0(15)
         X     2,=F'-1'
         NR    3,2
@@L8     EQU   *
         MVC   88(4,13),=F'0'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(DW2@ASSE)
         BALR  14,15
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L9
         L     2,8(11)
         LTR   2,2
         BE    @@L9
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC1)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(11)
         LA    2,12(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
@@L9     EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function daod epilogue
         PDPEPIL
* Function daod literal pool
         DS    0F
         LTORG
* Function daod page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
         DS    0F
* X-func daodel prologue
DAODEL   PDPPRLG CINDEX=2,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function daodel code
         MVC   88(4,13),=F'68'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'68'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         MVC   88(4,13),=F'76'
         MVC   92(4,13),=F'4'
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(DW2@ASSE)
         BALR  14,15
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L11
         L     2,12(11)
         LTR   2,2
         BE    @@L11
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC1)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),12(11)
         LA    2,16(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
@@L11    EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function daodel epilogue
         PDPEPIL
* Function daodel literal pool
         DS    0F
         LTORG
* Function daodel page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
         DS    0F
* X-func daooff prologue
DAOOFF   PDPPRLG CINDEX=3,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function daooff code
         MVC   88(4,13),=F'68'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(DW2@ASSE)
         BALR  14,15
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L13
         L     2,8(11)
         LTR   2,2
         BE    @@L13
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC1)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(11)
         LA    2,12(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
@@L13    EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function daooff epilogue
         PDPEPIL
* Function daooff literal pool
         DS    0F
         LTORG
* Function daooff page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
         DS    0F
* X-func daopcr prologue
DAOPCR   PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN4
         LTORG
@@FEN4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         LR    11,1
         L     10,=A(@@PGT4)
* Function daopcr code
         MVC   88(4,13),=F'68'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         MVC   88(4,13),=F'76'
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         L     2,=V(GLBRTL)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(DW2@ASSE)
         BALR  14,15
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L15
         L     2,8(11)
         LTR   2,2
         BE    @@L15
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC1)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(11)
         LA    2,12(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
@@L15    EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function daopcr epilogue
         PDPEPIL
* Function daopcr literal pool
         DS    0F
         LTORG
* Function daopcr page table
         DS    0F
@@PGT4   EQU   *
         DC    A(@@PG4)
         DS    0F
* X-func daoaddr prologue
DAOADDR  PDPPRLG CINDEX=5,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN5
         LTORG
@@FEN5   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         LR    11,1
         L     10,=A(@@PGT5)
* Function daoaddr code
         MVC   88(4,13),=F'68'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(DW2@ASSE)
         BALR  14,15
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L17
         L     2,8(11)
         LTR   2,2
         BE    @@L17
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC1)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(11)
         LA    2,12(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
@@L17    EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function daoaddr epilogue
         PDPEPIL
* Function daoaddr literal pool
         DS    0F
         LTORG
* Function daoaddr page table
         DS    0F
@@PGT5   EQU   *
         DC    A(@@PG5)
         DS    0F
* X-func daoadr prologue
DAOADR   PDPPRLG CINDEX=6,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN6
         LTORG
@@FEN6   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG6    EQU   *
         LR    11,1
         L     10,=A(@@PGT6)
* Function daoadr code
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(DW2@ASSE)
         BALR  14,15
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L19
         L     2,8(11)
         LTR   2,2
         BE    @@L19
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC1)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(11)
         LA    2,12(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
@@L19    EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function daoadr epilogue
         PDPEPIL
* Function daoadr literal pool
         DS    0F
         LTORG
* Function daoadr page table
         DS    0F
@@PGT6   EQU   *
         DC    A(@@PG6)
@@LC10   EQU   *
         DC    C'%c'
         DC    X'0'
@@LC6    EQU   *
         DC    C''''
         DC    X'15'
         DC    X'0'
@@LC9    EQU   *
         DC    C'%c%c'
         DC    X'0'
@@LC8    EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'C'''
         DC    X'0'
@@LC7    EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'X''%X'''
         DC    X'15'
         DC    X'0'
@@LC3    EQU   *
         DC    X'5'
         DC    C'.ascii "'
         DC    X'0'
@@LC5    EQU   *
         DC    C'\0"'
         DC    X'5'
         DC    C'%s '
         DC    X'0'
@@LC4    EQU   *
         DC    C'\%o'
         DC    X'0'
         DS    0F
* X-func daonstr prologue
DAONSTR  PDPPRLG CINDEX=7,FRAME=128,BASER=12,ENTRY=YES
         B     @@FEN7
         LTORG
@@FEN7   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG7    EQU   *
         LR    11,1
         L     10,=A(@@PGT7)
* Function daonstr code
         SLR   2,2
         SLR   3,3
         ST    2,112(13)
         ST    3,4+112(13)
         LR    8,2
         LR    9,3
         LR    6,2
         LR    7,3
         ST    2,120(13)
         ST    3,4+120(13)
         MVC   104(4,13),4(11)
         L     4,4(11)
         L     3,=F'-1'
         CLR   4,3
         BE    @@L54
@@L21    EQU   *
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L22
         L     2,8(11)
         LTR   2,2
         BNE   @@L55
@@L22    EQU   *
         L     4,4(11)
         L     3,=F'-1'
         CLR   4,3
         BE    @@L56
@@L33    EQU   *
         SLR   5,5
         ST    5,108(13)
         CL    5,104(13)
         BNL   @@L53
@@L47    EQU   *
         L     2,0(11)
         L     3,108(13)
         SLR   4,4
         IC    4,0(3,2)
         LR    2,4
         SLL   2,1
         L     3,=V(@SCH@IST)
         LH    3,0(2,3)
         LR    2,3
         N     2,=F'3088'
         CH    2,=H'0'
         BE    @@L39
         N     3,=F'2'
         CH    3,=H'0'
         BNE   @@L39
         LA    2,80(0,0)
         CLR   4,2
         BE    @@L39
         LR    8,5
         SRDA  8,32
         LA    2,48(0,0)
         DR    8,2
         LR    3,8
         LTR   8,8
         BE    @@L57
@@L42    EQU   *
         LA    2,125(0,0)
         CLR   4,2
         BE    @@L58
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC10)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L45    EQU   *
         LR    6,5
         SRDA  6,32
         LA    3,48(0,0)
         DR    6,3
         LA    4,47(0,0)
         CLR   6,4
         BE    @@L59
@@L36    EQU   *
         A     5,=F'1'
         L     2,108(13)
         A     2,=F'1'
         ST    2,108(13)
         CL    2,104(13)
         BL    @@L47
@@L53    EQU   *
         ST    5,120(13)
         L     4,120(13)
         L     5,4+120(13)
         SRDA  4,32
         LA    2,48(0,0)
         DR    4,2
         LTR   4,4
         BNE   @@L60
@@L48    EQU   *
         L     4,4(11)
         L     3,=F'-1'
         CLR   4,3
         BE    @@L32
         L     2,=V(CIRTX)
         MVC   88(4,13),256(2)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'8'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         B     @@L32
@@L60    EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L48
@@L59    EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L36
@@L58    EQU   *
         LA    2,47(0,0)
         CLR   3,2
         BE    @@L61
@@L44    EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC9)
         ST    4,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         A     5,=F'1'
         B     @@L45
@@L61    EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC8)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         A     5,=F'1'
         B     @@L44
@@L57    EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC8)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L42
@@L39    EQU   *
         ST    5,112(13)
         L     2,112(13)
         L     3,4+112(13)
         SRDA  2,32
         LA    5,48(0,0)
         DR    2,5
         ST    2,112(13)
         ST    3,4+112(13)
         LTR   2,2
         BNE   @@L62
@@L40    EQU   *
         L     5,=F'-1'
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC7)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L36
@@L62    EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L40
@@L56    EQU   *
         L     5,104(13)
         A     5,=F'1'
         ST    5,104(13)
         B     @@L33
@@L55    EQU   *
         MVC   88(4,13),=A(@@LC3)
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         SLR   5,5
         CL    5,104(13)
         BNL   @@L51
@@L31    EQU   *
         L     2,0(11)
         SLR   4,4
         IC    4,0(5,2)
         LA    3,127(0,0)
         CLR   4,3
         BE    @@L28
         LA    2,224(0,0)
         CLR   4,2
         BE    @@L28
@@L27    EQU   *
         LR    3,4
         SLL   3,1
         L     2,=V(@SCH@IST)
         LH    2,0(3,2)
         N     2,=F'16'
         CH    2,=H'0'
         BE    @@L29
         ST    4,88(13)
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
@@L25    EQU   *
         A     5,=F'1'
         CL    5,104(13)
         BL    @@L31
@@L51    EQU   *
         L     3,=V(ASM@OUT@)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC5)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),8(11)
         LA    2,12(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
         MVC   88(4,13),=F'21'
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L32
@@L29    EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC4)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L25
@@L28    EQU   *
         MVC   88(4,13),=F'224'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L27
@@L54    EQU   *
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    15,104(13)
         B     @@L21
@@L32    EQU   *
* Function daonstr epilogue
         PDPEPIL
* Function daonstr literal pool
         DS    0F
         LTORG
* Function daonstr page table
         DS    0F
@@PGT7   EQU   *
         DC    A(@@PG7)
         DS    0F
* X-func sofuleb prologue
SOFULEB  PDPPRLG CINDEX=8,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN8
         LTORG
@@FEN8   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG8    EQU   *
         LR    11,1
         L     10,=A(@@PGT8)
* Function sofuleb code
         L     2,0(11)
         SLR   15,15
@@L64    EQU   *
         SRL   2,7
         A     15,=F'1'
         LTR   2,2
         BNE   @@L64
* Function sofuleb epilogue
         PDPEPIL
* Function sofuleb literal pool
         DS    0F
         LTORG
* Function sofuleb page table
         DS    0F
@@PGT8   EQU   *
         DC    A(@@PG8)
         DS    0F
* X-func sofsleb prologue
SOFSLEB  PDPPRLG CINDEX=9,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN9
         LTORG
@@FEN9   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG9    EQU   *
         LR    11,1
         L     10,=A(@@PGT9)
* Function sofsleb code
         L     3,0(11)
         SLR   15,15
@@L69    EQU   *
         LR    4,3
         N     4,=F'127'
         SRA   3,7
         A     15,=F'1'
         LTR   3,3
         BNE   @@L74
         LR    2,4
         N     2,=F'64'
         LTR   2,2
         BE    @@L70
@@L74    EQU   *
         L     2,=F'-1'
         CLR   3,2
         BNE   @@L69
         N     4,=F'64'
         LTR   4,4
         BE    @@L69
@@L70    EQU   *
* Function sofsleb epilogue
         PDPEPIL
* Function sofsleb literal pool
         DS    0F
         LTORG
* Function sofsleb page table
         DS    0F
@@PGT9   EQU   *
         DC    A(@@PG9)
@@LC11   EQU   *
         DC    C'<stdin>'
         DC    X'0'
@@LC12   EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* X-func sofencv prologue
SOFENCV  PDPPRLG CINDEX=10,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN10
         LTORG
@@FEN10  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG10   EQU   *
         LR    11,1
         L     10,=A(@@PGT10)
* Function sofencv code
         L     2,0(11)
         SLR   15,15
         LA    3,255(0,0)
         CLR   2,3
         BE    @@L75
         N     2,=F'7'
         LR    15,2
         LA    3,2(0,0)
         CR    2,3
         BE    @@L75
         BH    @@L84
         LA    15,4(0,0)
         LTR   2,2
         BE    @@L75
@@L77    EQU   *
         MVC   88(4,13),=A(@@LC11)
         MVC   92(4,13),=F'340'
         MVC   96(4,13),=A(@@LC12)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L75
@@L84    EQU   *
         LA    15,4(0,0)
         LA    3,3(0,0)
         CLR   2,3
         BE    @@L75
         LA    15,8(0,0)
         LA    3,4(0,0)
         CLR   2,3
         BNE   @@L77
@@L75    EQU   *
* Function sofencv epilogue
         PDPEPIL
* Function sofencv literal pool
         DS    0F
         LTORG
* Function sofencv page table
         DS    0F
@@PGT10  EQU   *
         DC    A(@@PG10)
@@LC13   EQU   *
         DC    C'absolute'
         DC    X'0'
@@LC16   EQU   *
         DC    C'uleb128'
         DC    X'0'
@@LC17   EQU   *
         DC    C'udata2'
         DC    X'0'
@@LC18   EQU   *
         DC    C'udata4'
         DC    X'0'
@@LC19   EQU   *
         DC    C'udata8'
         DC    X'0'
@@LC20   EQU   *
         DC    C'sleb128'
         DC    X'0'
@@LC21   EQU   *
         DC    C'sdata2'
         DC    X'0'
@@LC22   EQU   *
         DC    C'sdata4'
         DC    X'0'
@@LC23   EQU   *
         DC    C'sdata8'
         DC    X'0'
@@LC24   EQU   *
         DC    C'pcrel'
         DC    X'0'
@@LC25   EQU   *
         DC    C'pcrel uleb128'
         DC    X'0'
@@LC26   EQU   *
         DC    C'pcrel udata2'
         DC    X'0'
@@LC27   EQU   *
         DC    C'pcrel udata4'
         DC    X'0'
@@LC28   EQU   *
         DC    C'pcrel udata8'
         DC    X'0'
@@LC29   EQU   *
         DC    C'pcrel sleb128'
         DC    X'0'
@@LC30   EQU   *
         DC    C'pcrel sdata2'
         DC    X'0'
@@LC31   EQU   *
         DC    C'pcrel sdata4'
         DC    X'0'
@@LC32   EQU   *
         DC    C'pcrel sdata8'
         DC    X'0'
@@LC33   EQU   *
         DC    C'textrel'
         DC    X'0'
@@LC34   EQU   *
         DC    C'textrel uleb128'
         DC    X'0'
@@LC35   EQU   *
         DC    C'textrel udata2'
         DC    X'0'
@@LC36   EQU   *
         DC    C'textrel udata4'
         DC    X'0'
@@LC37   EQU   *
         DC    C'textrel udata8'
         DC    X'0'
@@LC38   EQU   *
         DC    C'textrel sleb128'
         DC    X'0'
@@LC39   EQU   *
         DC    C'textrel sdata2'
         DC    X'0'
@@LC40   EQU   *
         DC    C'textrel sdata4'
         DC    X'0'
@@LC41   EQU   *
         DC    C'textrel sdata8'
         DC    X'0'
@@LC42   EQU   *
         DC    C'datarel'
         DC    X'0'
@@LC43   EQU   *
         DC    C'datarel uleb128'
         DC    X'0'
@@LC44   EQU   *
         DC    C'datarel udata2'
         DC    X'0'
@@LC45   EQU   *
         DC    C'datarel udata4'
         DC    X'0'
@@LC46   EQU   *
         DC    C'datarel udata8'
         DC    X'0'
@@LC47   EQU   *
         DC    C'datarel sleb128'
         DC    X'0'
@@LC48   EQU   *
         DC    C'datarel sdata2'
         DC    X'0'
@@LC49   EQU   *
         DC    C'datarel sdata4'
         DC    X'0'
@@LC50   EQU   *
         DC    C'datarel sdata8'
         DC    X'0'
@@LC51   EQU   *
         DC    C'funcrel'
         DC    X'0'
@@LC52   EQU   *
         DC    C'funcrel uleb128'
         DC    X'0'
@@LC53   EQU   *
         DC    C'funcrel udata2'
         DC    X'0'
@@LC54   EQU   *
         DC    C'funcrel udata4'
         DC    X'0'
@@LC55   EQU   *
         DC    C'funcrel udata8'
         DC    X'0'
@@LC56   EQU   *
         DC    C'funcrel sleb128'
         DC    X'0'
@@LC57   EQU   *
         DC    C'funcrel sdata2'
         DC    X'0'
@@LC58   EQU   *
         DC    C'funcrel sdata4'
         DC    X'0'
@@LC59   EQU   *
         DC    C'funcrel sdata8'
         DC    X'0'
@@LC15   EQU   *
         DC    C'aligned absolute'
         DC    X'0'
@@LC60   EQU   *
         DC    C'indirect pcrel'
         DC    X'0'
@@LC61   EQU   *
         DC    C'indirect pcrel uleb128'
         DC    X'0'
@@LC62   EQU   *
         DC    C'indirect pcrel udata2'
         DC    X'0'
@@LC63   EQU   *
         DC    C'indirect pcrel udata4'
         DC    X'0'
@@LC64   EQU   *
         DC    C'indirect pcrel udata8'
         DC    X'0'
@@LC65   EQU   *
         DC    C'indirect pcrel sleb128'
         DC    X'0'
@@LC66   EQU   *
         DC    C'indirect pcrel sdata2'
         DC    X'0'
@@LC67   EQU   *
         DC    C'indirect pcrel sdata4'
         DC    X'0'
@@LC68   EQU   *
         DC    C'indirect pcrel sdata8'
         DC    X'0'
@@LC69   EQU   *
         DC    C'indirect textrel'
         DC    X'0'
@@LC70   EQU   *
         DC    C'indirect textrel uleb128'
         DC    X'0'
@@LC71   EQU   *
         DC    C'indirect textrel udata2'
         DC    X'0'
@@LC72   EQU   *
         DC    C'indirect textrel udata4'
         DC    X'0'
@@LC73   EQU   *
         DC    C'indirect textrel udata8'
         DC    X'0'
@@LC74   EQU   *
         DC    C'indirect textrel sleb128'
         DC    X'0'
@@LC75   EQU   *
         DC    C'indirect textrel sdata2'
         DC    X'0'
@@LC76   EQU   *
         DC    C'indirect textrel sdata4'
         DC    X'0'
@@LC77   EQU   *
         DC    C'indirect textrel sdata8'
         DC    X'0'
@@LC78   EQU   *
         DC    C'indirect datarel'
         DC    X'0'
@@LC79   EQU   *
         DC    C'indirect datarel uleb128'
         DC    X'0'
@@LC80   EQU   *
         DC    C'indirect datarel udata2'
         DC    X'0'
@@LC81   EQU   *
         DC    C'indirect datarel udata4'
         DC    X'0'
@@LC82   EQU   *
         DC    C'indirect datarel udata8'
         DC    X'0'
@@LC83   EQU   *
         DC    C'indirect datarel sleb128'
         DC    X'0'
@@LC84   EQU   *
         DC    C'indirect datarel sdata2'
         DC    X'0'
@@LC85   EQU   *
         DC    C'indirect datarel sdata4'
         DC    X'0'
@@LC86   EQU   *
         DC    C'indirect datarel sdata8'
         DC    X'0'
@@LC87   EQU   *
         DC    C'indirect funcrel'
         DC    X'0'
@@LC88   EQU   *
         DC    C'indirect funcrel uleb128'
         DC    X'0'
@@LC89   EQU   *
         DC    C'indirect funcrel udata2'
         DC    X'0'
@@LC90   EQU   *
         DC    C'indirect funcrel udata4'
         DC    X'0'
@@LC91   EQU   *
         DC    C'indirect funcrel udata8'
         DC    X'0'
@@LC92   EQU   *
         DC    C'indirect funcrel sleb128'
         DC    X'0'
@@LC93   EQU   *
         DC    C'indirect funcrel sdata2'
         DC    X'0'
@@LC94   EQU   *
         DC    C'indirect funcrel sdata4'
         DC    X'0'
@@LC95   EQU   *
         DC    C'indirect funcrel sdata8'
         DC    X'0'
@@LC14   EQU   *
         DC    C'omit'
         DC    X'0'
         DS    0F
* X-func eh_data_format_name prologue
EH@DATA@ PDPPRLG CINDEX=11,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN11
         LTORG
@@FEN11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG11   EQU   *
         LR    11,1
         L     10,=A(@@PGT11)
* Function eh_data_format_name code
         L     3,0(11)
         LA    2,255(0,0)
         CLR   3,2
         L     14,=A(@@L86)
         BHR   14
         MH    3,=H'4'
         L     2,=A(@@L170)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L170   EQU   *
         DC    A(@@L87)
         DC    A(@@L90)
         DC    A(@@L91)
         DC    A(@@L92)
         DC    A(@@L93)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L94)
         DC    A(@@L95)
         DC    A(@@L96)
         DC    A(@@L97)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L98)
         DC    A(@@L99)
         DC    A(@@L100)
         DC    A(@@L101)
         DC    A(@@L102)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L103)
         DC    A(@@L104)
         DC    A(@@L105)
         DC    A(@@L106)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L107)
         DC    A(@@L108)
         DC    A(@@L109)
         DC    A(@@L110)
         DC    A(@@L111)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L112)
         DC    A(@@L113)
         DC    A(@@L114)
         DC    A(@@L115)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L116)
         DC    A(@@L117)
         DC    A(@@L118)
         DC    A(@@L119)
         DC    A(@@L120)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L121)
         DC    A(@@L122)
         DC    A(@@L123)
         DC    A(@@L124)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L125)
         DC    A(@@L126)
         DC    A(@@L127)
         DC    A(@@L128)
         DC    A(@@L129)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L130)
         DC    A(@@L131)
         DC    A(@@L132)
         DC    A(@@L133)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L89)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L134)
         DC    A(@@L135)
         DC    A(@@L136)
         DC    A(@@L137)
         DC    A(@@L138)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L139)
         DC    A(@@L140)
         DC    A(@@L141)
         DC    A(@@L142)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L143)
         DC    A(@@L144)
         DC    A(@@L145)
         DC    A(@@L146)
         DC    A(@@L147)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L148)
         DC    A(@@L149)
         DC    A(@@L150)
         DC    A(@@L151)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L152)
         DC    A(@@L153)
         DC    A(@@L154)
         DC    A(@@L155)
         DC    A(@@L156)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L157)
         DC    A(@@L158)
         DC    A(@@L159)
         DC    A(@@L160)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L161)
         DC    A(@@L162)
         DC    A(@@L163)
         DC    A(@@L164)
         DC    A(@@L165)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L166)
         DC    A(@@L167)
         DC    A(@@L168)
         DC    A(@@L169)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L86)
         DC    A(@@L88)
@@L87    EQU   *
         L     15,=A(@@LC13)
         B     @@L85
@@L90    EQU   *
         L     15,=A(@@LC16)
         B     @@L85
@@L91    EQU   *
         L     15,=A(@@LC17)
         B     @@L85
@@L92    EQU   *
         L     15,=A(@@LC18)
         B     @@L85
@@L93    EQU   *
         L     15,=A(@@LC19)
         B     @@L85
@@L94    EQU   *
         L     15,=A(@@LC20)
         B     @@L85
@@L95    EQU   *
         L     15,=A(@@LC21)
         B     @@L85
@@L96    EQU   *
         L     15,=A(@@LC22)
         B     @@L85
@@L97    EQU   *
         L     15,=A(@@LC23)
         B     @@L85
@@L98    EQU   *
         L     15,=A(@@LC24)
         B     @@L85
@@L99    EQU   *
         L     15,=A(@@LC25)
         B     @@L85
@@L100   EQU   *
         L     15,=A(@@LC26)
         B     @@L85
@@L101   EQU   *
         L     15,=A(@@LC27)
         B     @@L85
@@L102   EQU   *
         L     15,=A(@@LC28)
         B     @@L85
@@L103   EQU   *
         L     15,=A(@@LC29)
         B     @@L85
@@L104   EQU   *
         L     15,=A(@@LC30)
         B     @@L85
@@L105   EQU   *
         L     15,=A(@@LC31)
         B     @@L85
@@L106   EQU   *
         L     15,=A(@@LC32)
         B     @@L85
@@L107   EQU   *
         L     15,=A(@@LC33)
         B     @@L85
@@L108   EQU   *
         L     15,=A(@@LC34)
         B     @@L85
@@L109   EQU   *
         L     15,=A(@@LC35)
         B     @@L85
@@L110   EQU   *
         L     15,=A(@@LC36)
         B     @@L85
@@L111   EQU   *
         L     15,=A(@@LC37)
         B     @@L85
@@L112   EQU   *
         L     15,=A(@@LC38)
         B     @@L85
@@L113   EQU   *
         L     15,=A(@@LC39)
         B     @@L85
@@L114   EQU   *
         L     15,=A(@@LC40)
         B     @@L85
@@L115   EQU   *
         L     15,=A(@@LC41)
         B     @@L85
@@L116   EQU   *
         L     15,=A(@@LC42)
         B     @@L85
@@L117   EQU   *
         L     15,=A(@@LC43)
         B     @@L85
@@L118   EQU   *
         L     15,=A(@@LC44)
         B     @@L85
@@L119   EQU   *
         L     15,=A(@@LC45)
         B     @@L85
@@L120   EQU   *
         L     15,=A(@@LC46)
         B     @@L85
@@L121   EQU   *
         L     15,=A(@@LC47)
         B     @@L85
@@L122   EQU   *
         L     15,=A(@@LC48)
         B     @@L85
@@L123   EQU   *
         L     15,=A(@@LC49)
         B     @@L85
@@L124   EQU   *
         L     15,=A(@@LC50)
         B     @@L85
@@L125   EQU   *
         L     15,=A(@@LC51)
         B     @@L85
@@L126   EQU   *
         L     15,=A(@@LC52)
         B     @@L85
@@L127   EQU   *
         L     15,=A(@@LC53)
         B     @@L85
@@L128   EQU   *
         L     15,=A(@@LC54)
         B     @@L85
@@L129   EQU   *
         L     15,=A(@@LC55)
         B     @@L85
@@L130   EQU   *
         L     15,=A(@@LC56)
         B     @@L85
@@L131   EQU   *
         L     15,=A(@@LC57)
         B     @@L85
@@L132   EQU   *
         L     15,=A(@@LC58)
         B     @@L85
@@L133   EQU   *
         L     15,=A(@@LC59)
         B     @@L85
@@L89    EQU   *
         L     15,=A(@@LC15)
         B     @@L85
@@L134   EQU   *
         L     15,=A(@@LC60)
         B     @@L85
@@L135   EQU   *
         L     15,=A(@@LC61)
         B     @@L85
@@L136   EQU   *
         L     15,=A(@@LC62)
         B     @@L85
@@L137   EQU   *
         L     15,=A(@@LC63)
         B     @@L85
@@L138   EQU   *
         L     15,=A(@@LC64)
         B     @@L85
@@L139   EQU   *
         L     15,=A(@@LC65)
         B     @@L85
@@L140   EQU   *
         L     15,=A(@@LC66)
         B     @@L85
@@L141   EQU   *
         L     15,=A(@@LC67)
         B     @@L85
@@L142   EQU   *
         L     15,=A(@@LC68)
         B     @@L85
@@L143   EQU   *
         L     15,=A(@@LC69)
         B     @@L85
@@L144   EQU   *
         L     15,=A(@@LC70)
         B     @@L85
@@L145   EQU   *
         L     15,=A(@@LC71)
         B     @@L85
@@L146   EQU   *
         L     15,=A(@@LC72)
         B     @@L85
@@L147   EQU   *
         L     15,=A(@@LC73)
         B     @@L85
@@L148   EQU   *
         L     15,=A(@@LC74)
         B     @@L85
@@L149   EQU   *
         L     15,=A(@@LC75)
         B     @@L85
@@L150   EQU   *
         L     15,=A(@@LC76)
         B     @@L85
@@L151   EQU   *
         L     15,=A(@@LC77)
         B     @@L85
@@L152   EQU   *
         L     15,=A(@@LC78)
         B     @@L85
@@L153   EQU   *
         L     15,=A(@@LC79)
         B     @@L85
@@L154   EQU   *
         L     15,=A(@@LC80)
         B     @@L85
@@L155   EQU   *
         L     15,=A(@@LC81)
         B     @@L85
@@L156   EQU   *
         L     15,=A(@@LC82)
         B     @@L85
@@L157   EQU   *
         L     15,=A(@@LC83)
         B     @@L85
@@L158   EQU   *
         L     15,=A(@@LC84)
         B     @@L85
@@L159   EQU   *
         L     15,=A(@@LC85)
         B     @@L85
@@L160   EQU   *
         L     15,=A(@@LC86)
         B     @@L85
@@L161   EQU   *
         L     15,=A(@@LC87)
         B     @@L85
@@L162   EQU   *
         L     15,=A(@@LC88)
         B     @@L85
@@L163   EQU   *
         L     15,=A(@@LC89)
         B     @@L85
@@L164   EQU   *
         L     15,=A(@@LC90)
         B     @@L85
@@L165   EQU   *
         L     15,=A(@@LC91)
         B     @@L85
@@L166   EQU   *
         L     15,=A(@@LC92)
         B     @@L85
@@L167   EQU   *
         L     15,=A(@@LC93)
         B     @@L85
@@L168   EQU   *
         L     15,=A(@@LC94)
         B     @@L85
@@L169   EQU   *
         L     15,=A(@@LC95)
         B     @@L85
@@L86    EQU   *
         MVC   88(4,13),=A(@@LC11)
         MVC   92(4,13),=F'498'
         MVC   96(4,13),=A(@@LC12)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L85
@@L88    EQU   *
         L     15,=A(@@LC14)
@@L85    EQU   *
* Function eh_data_format_name epilogue
         PDPEPIL
* Function eh_data_format_name literal pool
         DS    0F
         LTORG
* Function eh_data_format_name page table
         DS    0F
@@PGT11  EQU   *
         DC    A(@@PG11)
@@LC96   EQU   *
         DC    X'5'
         DC    C'%s uleb128 '
         DC    X'0'
@@LC97   EQU   *
         DC    C'; '
         DC    X'0'
         DS    0F
* X-func daodul prologue
DAODUL   PDPPRLG CINDEX=12,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN12
         LTORG
@@FEN12  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG12   EQU   *
         LR    11,1
         L     10,=A(@@PGT12)
* Function daodul code
         L     6,0(11)
         LR    3,6
         L     2,=V(TARGETM)
         L     4,8(2)
         LTR   4,4
         BE    @@L174
         ST    4,88(13)
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
@@L174   EQU   *
         LR    2,3
         N     2,=F'127'
         SRL   3,7
         LTR   3,3
         BE    @@L177
         O     2,=F'128'
@@L177   EQU   *
         LTR   4,4
         BE    @@L178
         L     5,=V(ASM@OUT@)
         MVC   88(4,13),0(5)
         MVC   92(4,13),=A(@@LC0)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         LTR   3,3
         BNE   @@L184
@@L176   EQU   *
         LTR   3,3
         BNE   @@L174
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L182
         L     3,=V(ASM@OUT@)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC96)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC0)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,4(11)
         LTR   2,2
         BE    @@L182
         MVC   88(4,13),=A(@@LC97)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),4(11)
         LA    2,8(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
         B     @@L182
@@L184   EQU   *
         MVC   88(4,13),=F'107'
         MVC   92(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L176
@@L178   EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'8'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         B     @@L176
@@L182   EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function daodul epilogue
         PDPEPIL
* Function daodul literal pool
         DS    0F
         LTORG
* Function daodul page table
         DS    0F
@@PGT12  EQU   *
         DC    A(@@PG12)
@@LC98   EQU   *
         DC    X'5'
         DC    C'%s sleb128 '
         DC    X'0'
@@LC99   EQU   *
         DC    C'%d'
         DC    X'0'
         DS    0F
* X-func daodsl prologue
DAODSL   PDPPRLG CINDEX=13,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN13
         LTORG
@@FEN13  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG13   EQU   *
         LR    11,1
         L     10,=A(@@PGT13)
* Function daodsl code
         L     6,0(11)
         LR    3,6
         L     2,=V(TARGETM)
         L     4,8(2)
         LTR   4,4
         BE    @@L187
         ST    4,88(13)
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
@@L187   EQU   *
         LR    15,3
         N     15,=F'127'
         SRA   3,7
         SLR   5,5
         LTR   3,3
         BNE   @@L191
         LR    2,15
         N     2,=F'64'
         LTR   2,2
         BE    @@L190
@@L191   EQU   *
         L     2,=F'-1'
         CLR   3,2
         BE    @@L200
@@L192   EQU   *
         LA    5,1(0,0)
@@L190   EQU   *
         LTR   5,5
         BE    @@L193
         O     15,=F'128'
@@L193   EQU   *
         LTR   4,4
         BE    @@L194
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC0)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         LTR   5,5
         BNE   @@L201
@@L189   EQU   *
         LTR   5,5
         BNE   @@L187
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L198
         L     3,=V(ASM@OUT@)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC98)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC99)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,4(11)
         LTR   2,2
         BE    @@L198
         MVC   88(4,13),=A(@@LC97)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),4(11)
         LA    2,8(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
         B     @@L198
@@L201   EQU   *
         MVC   88(4,13),=F'107'
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L189
@@L194   EQU   *
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'8'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         B     @@L189
@@L200   EQU   *
         LR    2,15
         N     2,=F'64'
         LTR   2,2
         BNE   @@L190
         B     @@L192
@@L198   EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function daodsl epilogue
         PDPEPIL
* Function daodsl literal pool
         DS    0F
         LTORG
* Function daodsl page table
         DS    0F
@@PGT13  EQU   *
         DC    A(@@PG13)
         DS    0F
* X-func daodeu prologue
DAODEU   PDPPRLG CINDEX=14,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN14
         LTORG
@@FEN14  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG14   EQU   *
         LR    11,1
         L     10,=A(@@PGT14)
* Function daodeu code
         MVC   88(4,13),=A(@@LC11)
         MVC   92(4,13),=F'645'
         MVC   96(4,13),=A(@@LC12)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L203
         L     2,8(11)
         LTR   2,2
         BE    @@L203
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC1)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(11)
         LA    2,12(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
@@L203   EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function daodeu epilogue
         PDPEPIL
* Function daodeu literal pool
         DS    0F
         LTORG
* Function daodeu page table
         DS    0F
@@PGT14  EQU   *
         DC    A(@@PG14)
         DS    0F
* X-func daodes prologue
DAODES   PDPPRLG CINDEX=15,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN15
         LTORG
@@FEN15  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG15   EQU   *
         LR    11,1
         L     10,=A(@@PGT15)
* Function daodes code
         MVC   88(4,13),=A(@@LC11)
         MVC   92(4,13),=F'674'
         MVC   96(4,13),=A(@@LC12)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L205
         L     2,8(11)
         LTR   2,2
         BE    @@L205
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC1)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(11)
         LA    2,12(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
@@L205   EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
* Function daodes epilogue
         PDPEPIL
* Function daodes literal pool
         DS    0F
         LTORG
* Function daodes page table
         DS    0F
@@PGT15  EQU   *
         DC    A(@@PG15)
         DS    0F
* S-func mark_indirect_pool_entry prologue
@@0      PDPPRLG CINDEX=16,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN16
         LTORG
@@FEN16  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG16   EQU   *
         LR    11,1
         L     10,=A(@@PGT16)
* Function mark_indirect_pool_entry code
         L     2,0(11)
         L     6,4(2)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L207
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L211
@@L210   EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
         B     @@L207
@@L211   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L210
@@L207   EQU   *
         SLR   15,15
* Function mark_indirect_pool_entry epilogue
         PDPEPIL
* Function mark_indirect_pool_entry literal pool
         DS    0F
         LTORG
* Function mark_indirect_pool_entry page table
         DS    0F
@@PGT16  EQU   *
         DC    A(@@PG16)
         DS    0F
* S-func mark_indirect_pool prologue
@@1      PDPPRLG CINDEX=17,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN17
         LTORG
@@FEN17  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG17   EQU   *
         LR    11,1
         L     10,=A(@@PGT17)
* Function mark_indirect_pool code
         L     2,=A(@@2)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@0)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(STFEACH)
         BALR  14,15
* Function mark_indirect_pool epilogue
         PDPEPIL
* Function mark_indirect_pool literal pool
         DS    0F
         LTORG
* Function mark_indirect_pool page table
         DS    0F
@@PGT17  EQU   *
         DC    A(@@PG17)
@@LC101  EQU   *
         DC    C'*@@%s%d'
         DC    X'0'
@@LC102  EQU   *
         DC    C'LC'
         DC    X'0'
         DS    0F
* S-func dw2_force_const_mem prologue
@@3      PDPPRLG CINDEX=18,FRAME=136,BASER=12,ENTRY=NO
         B     @@FEN18
         LTORG
@@FEN18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG18   EQU   *
         LR    11,1
         L     10,=A(@@PGT18)
* Function dw2_force_const_mem code
         L     3,0(11)
         L     6,=A(@@2)
         L     2,0(6)
         LTR   2,2
         BE    @@L223
@@L214   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'68'
         BE    @@L215
         MVC   88(4,13),=A(@@LC11)
         MVC   92(4,13),=F'740'
         MVC   96(4,13),=A(@@LC12)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L215   EQU   *
         L     5,4(3)
         CLI   0(5),92
         BE    @@L224
@@L216   EQU   *
         MVC   88(4,13),0(6)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(STLOOK)
         BALR  14,15
         LTR   15,15
         BE    @@L219
         L     2,4(15)
@@L218   EQU   *
         L     3,80(2)
         LTR   3,3
         BNE   @@L222
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     3,80(2)
         B     @@L222
@@L219   EQU   *
         LA    4,104(,13)
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC101)
         MVC   96(4,13),=A(@@LC102)
         L     2,=V(CONST@LA)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(GETIDENT)
         BALR  14,15
         MVC   88(4,13),=F'34'
         ST    15,92(13)
         L     2,=V(GLOBAL@T)
         MVC   96(4,13),112(2)
         LA    1,88(,13)
         L     15,=V(BDECL)
         BALR  14,15
         LR    2,15
         OC    28(4,15),=F'512'
         OC    8(4,15),=F'8192'
         ST    15,60(2)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(MAYBE@GE)
         BALR  14,15
         LTR   15,15
         BE    @@L221
         OC    8(4,15),=F'8192'
@@L221   EQU   *
         MVC   88(4,13),0(6)
         ST    5,92(13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(STINS)
         BALR  14,15
         B     @@L218
@@L224   EQU   *
         A     5,=F'1'
         B     @@L216
@@L223   EQU   *
         MVC   88(4,13),=V(STCMPTRS)
         ST    2,92(13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(STNEW)
         BALR  14,15
         ST    15,0(6)
         ST    6,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'4'
         MVC   100(4,13),=A(@@1)
         LA    1,88(,13)
         L     15,=V(GAROOT)
         BALR  14,15
         B     @@L214
@@L222   EQU   *
         L     15,4(3)
* Function dw2_force_const_mem epilogue
         PDPEPIL
* Function dw2_force_const_mem literal pool
         DS    0F
         LTORG
* Function dw2_force_const_mem page table
         DS    0F
@@PGT18  EQU   *
         DC    A(@@PG18)
         DS    0F
* S-func dw2_output_indirect_constant_1 prologue
@@4      PDPPRLG CINDEX=19,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN19
         LTORG
@@FEN19  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG19   EQU   *
         LR    11,1
         L     10,=A(@@PGT19)
* Function dw2_output_indirect_constant_1 code
         L     2,0(11)
         L     3,0(2)
         MVC   88(4,13),=F'68'
         MVC   92(4,13),=F'4'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),4(2)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSVAR)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         SLR   15,15
* Function dw2_output_indirect_constant_1 epilogue
         PDPEPIL
* Function dw2_output_indirect_constant_1 literal pool
         DS    0F
         LTORG
* Function dw2_output_indirect_constant_1 page table
         DS    0F
@@PGT19  EQU   *
         DC    A(@@PG19)
         DS    0F
* X-func dw2_output_indirect_constants prologue
DW2@OUTP PDPPRLG CINDEX=20,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN20
         LTORG
@@FEN20  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG20   EQU   *
         LR    11,1
         L     10,=A(@@PGT20)
* Function dw2_output_indirect_constants code
         L     2,=A(@@2)
         L     2,0(2)
         LTR   2,2
         BE    @@L227
         ST    2,88(13)
         MVC   92(4,13),=A(@@4)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(STFEACH)
         BALR  14,15
@@L227   EQU   *
* Function dw2_output_indirect_constants epilogue
         PDPEPIL
* Function dw2_output_indirect_constants literal pool
         DS    0F
         LTORG
* Function dw2_output_indirect_constants page table
         DS    0F
@@PGT20  EQU   *
         DC    A(@@PG20)
         DS    0F
* X-func daoear prologue
DAOEAR   PDPPRLG CINDEX=21,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN21
         LTORG
@@FEN21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG21   EQU   *
         LR    11,1
         L     10,=A(@@PGT21)
* Function daoear code
         L     4,0(11)
         L     3,4(11)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(SOFENCV)
         BALR  14,15
         LR    5,15
         LA    2,80(0,0)
         CLR   4,2
         BE    @@L244
         L     2,=V(CIRTX)
         CL    3,256(2)
         BE    @@L232
         CL    3,260(2)
         BE    @@L232
@@L234   EQU   *
         LR    2,4
         N     2,=F'128'
         LTR   2,2
         BE    @@L235
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@3)
         BALR  14,15
         LR    3,15
         N     4,=F'-129'
         B     @@L234
@@L235   EQU   *
         LR    2,4
         N     2,=F'240'
         LTR   2,2
         BE    @@L237
         LA    4,16(0,0)
         CLR   2,4
         BE    @@L238
         MVC   88(4,13),=A(@@LC11)
         MVC   92(4,13),=F'888'
         MVC   96(4,13),=A(@@LC12)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L233   EQU   *
         L     2,=V(FLAG@DEB)
         L     2,0(2)
         LTR   2,2
         BE    @@L242
         L     2,8(11)
         LTR   2,2
         BNE   @@L245
@@L242   EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L229
@@L245   EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC1)
         MVC   96(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(11)
         LA    2,12(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
         B     @@L242
@@L238   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'68'
         BE    @@L239
         MVC   88(4,13),=A(@@LC11)
         MVC   92(4,13),=F'877'
         MVC   96(4,13),=A(@@LC12)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L239   EQU   *
         MVC   88(4,13),=F'76'
         MVC   92(4,13),=F'4'
         ST    3,96(13)
         L     2,=V(GLBRTL)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    5,88(13)
         ST    15,92(13)
@@L243   EQU   *
         LA    1,88(,13)
         L     15,=A(DW2@ASSE)
         BALR  14,15
         B     @@L233
@@L237   EQU   *
         ST    5,88(13)
         ST    3,92(13)
         B     @@L243
@@L232   EQU   *
         ST    3,88(13)
         ST    5,92(13)
         MVC   96(4,13),=F'8'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         B     @@L233
@@L244   EQU   *
         MVC   88(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(ASSAL)
         BALR  14,15
         ST    3,88(13)
         ST    5,92(13)
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
@@L229   EQU   *
* Function daoear epilogue
         PDPEPIL
* Function daoear literal pool
         DS    0F
         LTORG
* Function daoear page table
         DS    0F
@@PGT21  EQU   *
         DC    A(@@PG21)
         DS    0F
@@2      EQU   *
         DC    4X'00'
         END
