         COPY  PDPTOP
         CSECT
* Program data area
         DS    0F
@@0      EQU   *
         DC    F'0'
         DS    0F
@@1      EQU   *
         DC    F'1'
         DS    0F
@@2      EQU   *
         DC    F'0'
* Program text area
         DS    0F
* X-func init_final prologue
INIT@FIN PDPPRLG CINDEX=0,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function init_final code
         L     2,=A(@@3)
         MVC   0(4,2),=F'0'
         L     2,=A(FINAL@SE)
         MVC   0(4,2),=F'0'
* Function init_final epilogue
         PDPEPIL
* Function init_final literal pool
         DS    0F
         LTORG
* Function init_final page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
@@LC3    EQU   *
         DC    X'5'
         DC    C'DS'
         DC    X'5'
         DC    C'0F'
         DC    X'15'
         DC    X'0'
@@LC4    EQU   *
         DC    C'LPBX'
         DC    X'0'
@@LC5    EQU   *
         DC    C'L'
         DC    X'0'
@@LC6    EQU   *
         DC    C'@@%s%d'
         DC    X'5'
         DC    C'EQU'
         DC    X'5'
         DC    C'*'
         DC    X'15'
         DC    X'0'
@@LC7    EQU   *
         DC    C'*@@%s%d'
         DC    X'0'
@@LC8    EQU   *
         DC    X'0'
@@LC9    EQU   *
         DC    C'/'
         DC    X'0'
@@LC10   EQU   *
         DC    C'.da'
         DC    X'0'
@@LC2    EQU   *
         DC    X'5'
         DC    C'DS'
         DC    X'5'
         DC    C'0H'
         DC    X'15'
         DC    X'0'
@@LC11   EQU   *
         DC    X'5'
         DC    C'EQU'
         DC    X'5'
         DC    C'*'
         DC    X'15'
         DC    X'0'
@@LC12   EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'%dX''00'''
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func end_final prologue
END@FINA PDPPRLG CINDEX=1,FRAME=128,BASER=12,ENTRY=YES
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function end_final code
         L     9,0(11)
         L     2,=V(PROFAFLA)
         L     2,0(2)
         LTR   2,2
         L     14,=A(@@L2)
         BER   14
         MVC   88(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LR    6,15
         L     2,=V(COUNT@IN)
         L     5,0(2)
         LR    8,5
         SLL   8,3
         LA    1,88(,13)
         L     15,=V(DATA@SEC)
         BALR  14,15
         LTR   6,6
         BE    @@L6
         LA    2,1(0,0)
         CLR   6,2
         L     14,=A(@@L28)
         BER   14
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC3)
@@L26    EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L6     EQU   *
         MVC   88(4,13),=A(@@LC4)
         MVC   92(4,13),=A(@@LC5)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L29)
         BER   14
@@L9     EQU   *
         L     12,0(,10)
         L     5,=V(ASM@OUT@)
         MVC   88(4,13),0(5)
         MVC   92(4,13),=A(@@LC6)
         MVC   96(4,13),=A(@@LC4)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     3,=V(CIRTX)
         MVC   88(4,13),256(3)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         LA    7,104(,13)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC7)
         MVC   96(4,13),=A(@@LC4)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         MVC   88(4,13),=F'68'
         MVC   92(4,13),=F'4'
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC7)
         MVC   96(4,13),=A(@@LC4)
         MVC   100(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         MVC   88(4,13),=F'68'
         MVC   92(4,13),=F'4'
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         MVC   88(4,13),=F'0'
         L     2,=V(COUNT@IN)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         MVC   88(4,13),256(3)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         MVC   88(4,13),256(3)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'44'
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         MVC   88(4,13),256(3)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         MVC   88(4,13),256(3)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         MVC   88(4,13),256(3)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         MVC   88(4,13),256(3)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         MVC   88(4,13),=A(@@LC4)
         MVC   92(4,13),=A(@@LC5)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L30
@@L10    EQU   *
         MVC   88(4,13),0(5)
         MVC   92(4,13),=A(@@LC6)
         MVC   96(4,13),=A(@@LC4)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     3,=A(@@LC8)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    2,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         AR    15,2
         LR    4,15
         A     4,=F'1'
         A     15,=F'5'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC9)
         LA    1,88(,13)
         L     15,=V(STRCAT)
         BALR  14,15
         ST    2,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(STRCAT)
         BALR  14,15
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(STRIP@OF)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC10)
         LA    1,88(,13)
         L     15,=V(STRCAT)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         A     15,=F'1'
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(ASSSTR)
         BALR  14,15
         LTR   8,8
         BNE   @@L11
         LTR   6,6
         BE    @@L12
         LA    2,1(0,0)
         CLR   6,2
         BE    @@L31
         MVC   88(4,13),0(5)
         MVC   92(4,13),=A(@@LC3)
@@L27    EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L12    EQU   *
         MVC   88(4,13),=A(@@LC4)
         MVC   92(4,13),=A(@@LC5)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L32
@@L15    EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC6)
         MVC   96(4,13),=A(@@LC4)
         MVC   100(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         LTR   8,8
         BE    @@L2
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(ASSZERO)
         BALR  14,15
         B     @@L2
@@L32    EQU   *
         MVC   88(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(MVS@ALAB)
         BALR  14,15
         B     @@L15
@@L31    EQU   *
         MVC   88(4,13),0(5)
         MVC   92(4,13),=A(@@LC2)
         B     @@L27
@@L11    EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC7)
         MVC   96(4,13),=A(@@LC4)
         MVC   100(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         MVC   88(4,13),0(5)
         MVC   92(4,13),=A(@@LC3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(5)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ASSNAME)
         BALR  14,15
         MVC   88(4,13),=A(@@LC11)
         MVC   92(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         LR    3,8
         LTR   8,8
         BNH   @@L2
@@L24    EQU   *
         L     4,=F'32767'
         CR    3,4
         BH    @@L23
         LR    4,3
@@L23    EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC12)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         A     3,=F'-32767'
         BH    @@L24
         B     @@L2
@@L30    EQU   *
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(MVS@ALAB)
         BALR  14,15
         B     @@L10
@@L29    EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(MVS@ALAB)
         BALR  14,15
         B     @@L9
@@L28    EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC2)
         B     @@L26
@@L2     EQU   *
* Function end_final epilogue
         PDPEPIL
* Function end_final literal pool
         DS    0F
         LTORG
* Function end_final page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
         DS    0F
* X-func dfprepil prologue
DFPREPIL PDPPRLG CINDEX=2,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function dfprepil code
* Function dfprepil epilogue
         PDPEPIL
* Function dfprepil literal pool
         DS    0F
         LTORG
* Function dfprepil page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
         DS    0F
* X-func no_asm_to_stream prologue
NO@ASM@T PDPPRLG CINDEX=3,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function no_asm_to_stream code
* Function no_asm_to_stream epilogue
         PDPEPIL
* Function no_asm_to_stream literal pool
         DS    0F
         LTORG
* Function no_asm_to_stream page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
         DS    0F
* X-func app_enable prologue
APP@ENAB PDPPRLG CINDEX=4,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN4
         LTORG
@@FEN4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         LR    11,1
         L     10,=A(@@PGT4)
* Function app_enable code
         L     3,=A(@@3)
         L     2,0(3)
         LTR   2,2
         BNE   @@L35
         MVC   88(4,13),=A(@@LC8)
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   0(4,3),=F'1'
@@L35    EQU   *
* Function app_enable epilogue
         PDPEPIL
* Function app_enable literal pool
         DS    0F
         LTORG
* Function app_enable page table
         DS    0F
@@PGT4   EQU   *
         DC    A(@@PG4)
         DS    0F
* X-func app_disable prologue
APP@DISA PDPPRLG CINDEX=5,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN5
         LTORG
@@FEN5   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         LR    11,1
         L     10,=A(@@PGT5)
* Function app_disable code
         L     3,=A(@@3)
         L     2,0(3)
         LTR   2,2
         BE    @@L37
         MVC   88(4,13),=A(@@LC8)
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   0(4,3),=F'0'
@@L37    EQU   *
* Function app_disable epilogue
         PDPEPIL
* Function app_disable literal pool
         DS    0F
         LTORG
* Function app_disable page table
         DS    0F
@@PGT5   EQU   *
         DC    A(@@PG5)
         DS    0F
* X-func init_insn_lengths prologue
INIT@INS PDPPRLG CINDEX=6,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN6
         LTORG
@@FEN6   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG6    EQU   *
         LR    11,1
         L     10,=A(@@PGT6)
* Function init_insn_lengths code
         L     3,=A(@@4)
         L     2,0(3)
         LTR   2,2
         BNE   @@L45
@@L40    EQU   *
         L     3,=A(@@5)
         L     2,0(3)
         LTR   2,2
         BNE   @@L46
@@L41    EQU   *
         L     3,=A(INSN@ADD)
         L     2,0(3)
         LTR   2,2
         BNE   @@L47
@@L42    EQU   *
         L     3,=A(@@7)
         L     2,0(3)
         LTR   2,2
         BE    @@L39
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   0(4,3),=F'0'
         B     @@L39
@@L47    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   0(4,3),=F'0'
         B     @@L42
@@L46    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   0(4,3),=F'0'
         L     2,=A(@@6)
         MVC   0(4,2),=F'0'
         B     @@L41
@@L45    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   0(4,3),=F'0'
         B     @@L40
@@L39    EQU   *
* Function init_insn_lengths epilogue
         PDPEPIL
* Function init_insn_lengths literal pool
         DS    0F
         LTORG
* Function init_insn_lengths page table
         DS    0F
@@PGT6   EQU   *
         DC    A(@@PG6)
         DS    0F
* X-func get_attr_length prologue
GET@ATTR PDPPRLG CINDEX=7,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN7
         LTORG
@@FEN7   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG7    EQU   *
         LR    11,1
         L     10,=A(@@PGT7)
* Function get_attr_length code
         SLR   6,6
         SLR   7,7
         L     5,0(11)
         SLR   8,8
         L     2,=A(@@6)
         L     2,0(2)
         L     15,4(5)
         CR    2,15
         BNH   @@L49
         L     2,=A(@@5)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
         B     @@L48
@@L49    EQU   *
         LH    3,0(5)
         N     3,=XL4'0000FFFF'
         A     3,=F'-32'
         LA    2,5(0,0)
         CLR   3,2
         BH    @@L50
         MH    3,=H'4'
         L     2,=A(@@L74)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L74    EQU   *
         DC    A(@@L59)
         DC    A(@@L56)
         DC    A(@@L65)
         DC    A(@@L54)
         DC    A(@@L54)
         DC    A(@@L54)
@@L54    EQU   *
         SLR   15,15
         B     @@L48
@@L59    EQU   *
         L     4,16(5)
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-48'
         SLR   15,15
         CLM   2,3,=H'1'
         BNH   @@L48
         CLM   3,3,=H'40'
         BE    @@L63
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ASM@NOPE)
         BALR  14,15
         LTR   15,15
         BL    @@L62
@@L63    EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(INSN@DEF)
         BALR  14,15
         LR    7,15
         MR    6,2
         LR    8,7
@@L50    EQU   *
         LR    15,8
         B     @@L48
@@L62    EQU   *
         LH    2,0(4)
         CLM   2,3,=H'24'
         BE    @@L76
@@L65    EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(INSN@DEF)
         BALR  14,15
         LR    8,15
         B     @@L50
@@L76    EQU   *
         SLR   5,5
         L     2,4(4)
         C     5,0(2)
         BNL   @@L50
@@L71    EQU   *
         L     3,4(4)
         LR    2,5
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(GET@ATTR)
         BALR  14,15
         AR    8,15
         A     5,=F'1'
         L     2,4(4)
         C     5,0(2)
         BL    @@L71
         B     @@L50
@@L56    EQU   *
         L     4,16(5)
         LH    2,0(4)
         AH    2,=H'-44'
         CLM   2,3,=H'1'
         BNH   @@L50
         B     @@L65
@@L48    EQU   *
* Function get_attr_length epilogue
         PDPEPIL
* Function get_attr_length literal pool
         DS    0F
         LTORG
* Function get_attr_length page table
         DS    0F
@@PGT7   EQU   *
         DC    A(@@PG7)
         DS    0F
* S-func final_addr_vec_align prologue
@@9      PDPPRLG CINDEX=8,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN8
         LTORG
@@FEN8   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG8    EQU   *
         LR    11,1
         L     10,=A(@@PGT8)
* Function final_addr_vec_align code
         L     2,0(11)
         L     2,16(2)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,0(2,3)
         LR    2,4
         LA    3,8(0,0)
         CR    4,3
         BNH   @@L78
         LR    2,3
@@L78    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
* Function final_addr_vec_align epilogue
         PDPEPIL
* Function final_addr_vec_align literal pool
         DS    0F
         LTORG
* Function final_addr_vec_align page table
         DS    0F
@@PGT8   EQU   *
         DC    A(@@PG8)
         DS    0F
* X-func label_to_alignment prologue
LABEL@TO PDPPRLG CINDEX=9,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN9
         LTORG
@@FEN9   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG9    EQU   *
         LR    11,1
         L     10,=A(@@PGT9)
* Function label_to_alignment code
         L     3,=A(@@11)
         L     2,0(11)
         L     2,24(2)
         S     2,0(3)
         LR    3,2
         L     2,=A(@@10)
         L     2,0(2)
         MH    3,=H'4'
         LH    15,0(3,2)
* Function label_to_alignment epilogue
         PDPEPIL
* Function label_to_alignment literal pool
         DS    0F
         LTORG
* Function label_to_alignment page table
         DS    0F
@@PGT9   EQU   *
         DC    A(@@PG9)
         DS    0F
* S-func align_fuzz prologue
@@12     PDPPRLG CINDEX=10,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN10
         LTORG
@@FEN10  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG10   EQU   *
         LR    11,1
         L     10,=A(@@PGT10)
* Function align_fuzz code
         L     9,12(11)
         LA    7,1(0,0)
         L     2,8(11)
         SLL   7,0(2)
         L     2,=A(@@4)
         L     3,0(2)
         L     2,4(11)
         L     2,4(2)
         SLL   2,2
         L     8,0(2,3)
         SLR   15,15
         L     2,=A(@@7)
         L     3,0(2)
         L     2,0(11)
         L     2,4(2)
         SLL   2,2
         L     4,0(2,3)
         LTR   4,4
         BE    @@L82
@@L87    EQU   *
         L     5,4(4)
         SLL   5,2
         L     2,=A(INSN@ADD)
         LR    3,5
         A     3,0(2)
         L     2,=A(@@5)
         L     2,0(2)
         L     6,16(3)
         S     6,0(5,2)
         L     2,=A(@@4)
         L     2,0(2)
         L     2,0(5,2)
         CR    2,8
         BH    @@L82
         L     2,=A(@@11)
         L     3,24(4)
         S     3,0(2)
         L     2,=A(@@10)
         L     2,0(2)
         MH    3,=H'4'
         LH    2,0(3,2)
         LA    4,1(0,0)
         SLL   4,0(2)
         CR    4,7
         BL    @@L83
         LCR   2,6
         XR    2,9
         LR    3,4
         SR    3,7
         NR    2,3
         AR    15,2
         LR    7,4
@@L83    EQU   *
         L     2,=A(@@7)
         L     2,0(2)
         L     4,0(5,2)
         LTR   4,4
         BNE   @@L87
@@L82    EQU   *
* Function align_fuzz epilogue
         PDPEPIL
* Function align_fuzz literal pool
         DS    0F
         LTORG
* Function align_fuzz page table
         DS    0F
@@PGT10  EQU   *
         DC    A(@@PG10)
         DS    0F
* X-func incrra prologue
INCRRA   PDPPRLG CINDEX=11,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN11
         LTORG
@@FEN11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG11   EQU   *
         LR    11,1
         L     10,=A(@@PGT11)
* Function incrra code
         L     3,0(11)
         L     2,=A(INSN@ADD)
         L     2,0(2)
         LR    15,2
         LTR   2,2
         BE    @@L89
         L     2,8(3)
         L     5,12(2)
         L     6,4(5)
         LH    2,0(3)
         CLM   2,3,=H'33'
         BE    @@L91
         L     2,=A(INCRADD)
         L     15,0(2)
         B     @@L89
@@L91    EQU   *
         L     15,32(3)
         L     2,=A(@@4)
         L     4,0(2)
         MH    6,=H'4'
         L     3,4(15)
         SLL   3,2
         L     2,0(6,4)
         C     2,0(3,4)
         BNL   @@L92
         L     2,=A(@@5)
         L     3,0(2)
         L     2,=A(INSN@LAS)
         L     2,0(2)
         A     2,0(6,3)
         LR    3,2
         ST    5,88(13)
         ST    15,92(13)
         L     2,=V(LENGTH@U)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=A(@@12)
         BALR  14,15
         SR    3,15
         LR    15,3
         B     @@L89
@@L92    EQU   *
         ST    15,88(13)
         ST    5,92(13)
         L     2,=V(LENGTH@U)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=A(@@12)
         BALR  14,15
         L     2,=A(INCRADD)
         A     15,0(2)
@@L89    EQU   *
* Function incrra epilogue
         PDPEPIL
* Function incrra literal pool
         DS    0F
         LTORG
* Function incrra page table
         DS    0F
@@PGT11  EQU   *
         DC    A(@@PG11)
         DS    0F
* X-func cmpalgn prologue
CMPALGN  PDPPRLG CINDEX=12,FRAME=144,BASER=12,ENTRY=YES
         B     @@FEN12
         LTORG
@@FEN12  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG12   EQU   *
         LR    11,1
         L     10,=A(@@PGT12)
* Function cmpalgn code
         SLR   2,2
         SLR   3,3
         ST    2,120(13)
         ST    3,4+120(13)
         LR    8,2
         LR    9,3
         ST    2,128(13)
         ST    3,4+128(13)
         ST    2,136(13)
         ST    3,4+136(13)
         L     4,=A(@@10)
         L     2,0(4)
         LTR   2,2
         BNE   @@L119
@@L95    EQU   *
         LA    1,88(,13)
         L     15,=V(MAX@LABE)
         BALR  14,15
         L     3,=A(@@13)
         ST    15,0(3)
         LA    1,88(,13)
         L     15,=V(GET@FIRS)
         BALR  14,15
         L     2,=A(@@11)
         ST    15,0(2)
         L     2,0(3)
         SR    2,15
         A     2,=F'1'
         ST    2,88(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,0(4)
         L     2,=V(OPTZE)
         L     2,0(2)
         LTR   2,2
         BE    @@L94
         L     2,=V(OPTZSZ)
         L     2,0(2)
         LTR   2,2
         BNE   @@L94
         ST    2,96(13)
         L     2,=V(N@BASIC@)
         L     3,96(13)
         C     3,0(2)
         BNL   @@L94
@@L115   EQU   *
         L     4,96(13)
         MH    4,=H'4'
         L     2,=V(BBINFO)
         LR    6,4
         A     6,0(2)
         L     15,16(6)
         MVC   108(4,13),0(15)
         SLR   5,5
         ST    5,112(13)
         ST    5,116(13)
         L     7,108(13)
         LH    2,0(7)
         CH    2,=H'36'
         BE    @@L120
@@L100   EQU   *
         L     6,96(13)
         A     6,=F'1'
         ST    6,96(13)
         L     2,=V(N@BASIC@)
         C     6,0(2)
         BL    @@L115
         B     @@L94
@@L120   EQU   *
         L     2,=V(ALLABL)
         MVC   104(4,13),0(2)
         L     2,=V(ALLABMS)
         MVC   100(4,13),0(2)
         L     3,16(15)
         LTR   3,3
         BE    @@L118
@@L109   EQU   *
         L     2,24(3)
         N     2,=F'1'
         LTR   2,2
         BE    @@L107
         MVC   116(4,13),=F'1'
         L     2,8(3)
         MVC   124(4,13),28(3)
         L     6,120(13)
         L     7,4+120(13)
         M     6,56(2)
         ST    6,120(13)
         ST    7,4+120(13)
         L     8,124(13)
         A     8,=F'5000'
         SRDA  8,32
         L     7,=F'10000'
         DR    8,7
         L     2,112(13)
         AR    2,9
         ST    2,112(13)
@@L105   EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   @@L109
@@L118   EQU   *
         L     3,116(13)
         LTR   3,3
         BNE   @@L110
         LA    6,1000(0,0)
         CR    5,6
         BH    @@L111
         L     2,=V(BBINFO)
         A     4,0(2)
         L     2,12(4)
         L     4,56(2)
         LR    2,4
         SLL   2,3
         AR    2,4
         AR    2,4
         C     2,56(15)
         BNL   @@L110
         L     3,=V(ENTRY@EX)
         L     2,56(3)
         SRL   2,31
         A     2,56(3)
         SRA   2,1
         CR    4,2
         BH    @@L110
@@L111   EQU   *
         L     2,=V(ALJMPL)
         L     2,0(2)
         L     7,104(13)
         CR    7,2
         BNL   @@L110
         ST    2,104(13)
         L     2,=V(ALJMPMS)
         MVC   100(4,13),0(2)
@@L110   EQU   *
         L     2,116(13)
         LTR   2,2
         BE    @@L113
         L     2,112(13)
         AR    2,5
         LA    3,1000(0,0)
         CR    2,3
         BNH   @@L113
         L     2,112(13)
         SLL   2,2
         A     2,112(13)
         CR    5,2
         BNH   @@L113
         L     2,=V(ALLOPL)
         L     2,0(2)
         L     6,104(13)
         CR    6,2
         BNL   @@L113
         ST    2,104(13)
         L     2,=V(ALLOPMS)
         MVC   100(4,13),0(2)
@@L113   EQU   *
         L     2,=A(@@11)
         L     5,0(2)
         L     7,108(13)
         L     3,24(7)
         SR    3,5
         L     2,=A(@@10)
         L     4,0(2)
         MH    3,=H'4'
         L     2,104(13)
         STH   2,0(3,4)
         L     2,24(7)
         SR    2,5
         MH    2,=H'4'
         L     3,100(13)
         STH   3,2(2,4)
         B     @@L100
@@L107   EQU   *
         L     2,8(3)
         MVC   132(4,13),28(3)
         L     6,128(13)
         L     7,4+128(13)
         M     6,56(2)
         ST    6,128(13)
         ST    7,4+128(13)
         A     7,=F'5000'
         ST    7,136(13)
         L     6,136(13)
         L     7,4+136(13)
         SRDA  6,32
         L     2,=F'10000'
         DR    6,2
         ST    6,136(13)
         ST    7,4+136(13)
         AR    5,7
         B     @@L105
@@L119   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   0(4,4),=F'0'
         B     @@L95
@@L94    EQU   *
* Function cmpalgn epilogue
         PDPEPIL
* Function cmpalgn literal pool
         DS    0F
         LTORG
* Function cmpalgn page table
         DS    0F
@@PGT12  EQU   *
         DC    A(@@PG12)
@@LC13   EQU   *
         DC    C'insn_addresses'
         DC    X'0'
@@LC0    EQU   *
         DC    C'<stdin>'
         DC    X'0'
@@LC1    EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* X-func shrtbranch prologue
SHRTBRAN PDPPRLG CINDEX=13,FRAME=216,BASER=12,ENTRY=YES
         B     @@FEN13
         LTORG
@@FEN13  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG13   EQU   *
         LR    11,1
         L     10,=A(@@PGT13)
* Function shrtbranch code
         SLR   2,2
         SLR   3,3
         ST    2,184(13)
         ST    3,4+184(13)
         ST    2,192(13)
         ST    3,4+192(13)
         ST    2,200(13)
         ST    3,4+200(13)
         LA    1,88(,13)
         L     15,=V(GET@MAX@)
         BALR  14,15
         ST    15,168(13)
         LR    3,15
         MH    3,=H'4'
         ST    3,180(13)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@4)
         ST    15,0(2)
         L     2,=A(@@13)
         LA    1,88(,13)
         L     15,=V(MAX@LABE)
         BALR  14,15
         L     4,0(2)
         CLR   4,15
         BE    @@L122
         LA    1,88(,13)
         L     15,=V(MAX@LABE)
         BALR  14,15
         ST    15,0(2)
         L     2,=A(@@11)
         L     2,0(2)
         LR    3,15
         SR    3,2
         A     3,=F'1'
         SR    4,2
         A     4,=F'1'
         L     5,=A(@@10)
         MVC   88(4,13),0(5)
         LR    2,3
         MH    2,=H'4'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
         ST    15,0(5)
         CR    4,3
         L     14,=A(@@L248)
         BHR   14
@@L123   EQU   *
         L     12,0(,10)
         LR    2,4
         MH    2,=H'4'
         A     2,0(5)
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         SR    3,4
         MH    3,=H'4'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
@@L122   EQU   *
         SLR   9,9
         LR    7,9
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    8,15
         LA    6,1(0,0)
         LTR   15,15
         BE    @@L232
@@L147   EQU   *
         L     2,=A(@@4)
         L     3,0(2)
         L     2,4(8)
         SLL   2,2
         ST    6,0(2,3)
         A     6,=F'1'
         LH    3,0(8)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'89'
         BE    @@L126
         LH    2,0(8)
         CLM   2,3,=H'36'
         L     14,=A(@@L249)
         BER   14
         CLM   2,3,=H'35'
         L     14,=A(@@L250)
         BER   14
@@L126   EQU   *
         L     12,0(,10)
         L     8,12(8)
         LTR   8,8
         BNE   @@L147
@@L232   EQU   *
         MVC   88(4,13),180(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@5)
         ST    15,0(2)
         L     2,=A(@@6)
         MVC   0(4,2),168(13)
         MVC   88(4,13),168(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=A(@@LC13)
         LA    1,88(,13)
         L     15,=V(VARRAY@I)
         BALR  14,15
         L     2,=A(INSN@ADD)
         ST    15,0(2)
         MVC   88(4,13),168(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,176(13)
         MVC   88(4,13),168(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     2,=A(@@7)
         ST    15,0(2)
         LA    6,15(0,0)
         LA    2,164(,13)
@@L152   EQU   *
         MVC   0(4,2),=F'0'
         A     2,=F'-4'
         BCTR  6,0
         LTR   6,6
         BNL   @@L152
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LTR   15,15
         BE    @@L237
@@L165   EQU   *
         L     4,4(15)
         LH    2,0(15)
         CLM   2,3,=H'36'
         L     14,=A(@@L251)
         BER   14
         SLR   3,3
@@L158   EQU   *
         L     12,0(,10)
         L     2,=A(@@7)
         L     5,0(2)
         MH    4,=H'4'
         L     6,104(13)
         ST    6,0(4,5)
         LTR   3,3
         BE    @@L155
         LR    2,3
         MH    2,=H'4'
         L     2,104(13,2)
         ST    2,0(4,5)
         LR    6,3
         BCTR  6,0
         LTR   6,6
         BL    @@L155
         LR    2,6
         MH    2,=H'4'
         AR    2,13
         A     2,=F'104'
@@L164   EQU   *
         ST    15,0(2)
         A     2,=F'-4'
         BCTR  6,0
         LTR   6,6
         BNL   @@L164
@@L155   EQU   *
         L     15,8(15)
         LTR   15,15
         BNE   @@L165
@@L237   EQU   *
         L     2,=A(INCRADD)
         MVC   0(4,2),=F'0'
         L     8,0(11)
         LTR   8,8
         BE    @@L230
@@L197   EQU   *
         L     9,4(8)
         L     2,=A(@@5)
         L     5,0(2)
         LR    7,9
         MH    7,=H'4'
         SLR   2,2
         ST    2,0(7,5)
         LH    2,0(8)
         CLM   2,3,=H'36'
         L     14,=A(@@L252)
         BER   14
@@L170   EQU   *
         L     12,0(,10)
         L     2,=A(INSN@ADD)
         LR    3,7
         A     3,0(2)
         L     2,=A(INCRADD)
         MVC   16(4,3),0(2)
         LH    2,0(8)
         CLM   2,3,=H'37'
         BE    @@L168
         CLM   2,3,=H'35'
         BE    @@L168
         CLM   2,3,=H'36'
         BE    @@L168
         L     3,0(8)
         SRL   3,4
         N     3,=F'1'
         LTR   3,3
         BNE   @@L168
         L     6,16(8)
         LH    4,0(6)
         LR    2,4
         AH    2,=H'-44'
         CLM   2,3,=H'1'
         L     14,=A(@@L175)
         BHR   14
         L     2,=A(@@5)
         L     5,0(2)
         X     4,=F'45'
         SLL   4,16
         SRA   4,16
         LPR   2,4
         BCTR  2,0
         N     2,=XL4'0000FFFF'
         SRL   2,15
         SLL   2,2
         L     4,4(6,2)
         SLR   3,3
         IC    3,2(6)
         L     2,=V(MODE@SIZ)
         SLR   6,6
         IC    6,0(2,3)
         ST    6,188(13)
         L     2,184(13)
         L     3,4+184(13)
         M     2,0(4)
         ST    2,184(13)
         ST    3,4+184(13)
         ST    3,0(7,5)
@@L168   EQU   *
         L     12,0(,10)
         L     3,=A(INCRADD)
         L     2,=A(@@5)
         L     2,0(2)
         MH    9,=H'4'
         L     4,0(3)
         A     4,0(9,2)
         ST    4,0(3)
         L     8,12(8)
         LTR   8,8
         BNE   @@L197
@@L230   EQU   *
         MVC   172(4,13),=F'0'
         L     2,=A(INCRAL)
         MVC   0(4,2),=F'15'
         L     2,=A(INCRADD)
         MVC   0(4,2),172(13)
         L     8,0(11)
         LTR   8,8
         BE    @@L244
@@L228   EQU   *
         L     9,4(8)
         LH    2,0(8)
         CH    2,=H'36'
         BE    @@L253
         L     2,=V(LENGTH@U)
         L     2,0(2)
         L     3,=A(INCRAL)
         C     2,0(3)
         BNL   @@L208
         ST    2,0(3)
@@L208   EQU   *
         LR    2,9
         MH    2,=H'4'
         ST    2,208(13)
         L     2,=A(INSN@ADD)
         L     3,208(13)
         A     3,0(2)
         A     3,=F'16'
         L     2,=A(INSN@LAS)
         MVC   0(4,2),0(3)
         L     2,=A(INCRADD)
         MVC   0(4,3),0(2)
         L     3,176(13)
         IC    2,0(9,3)
         CLM   2,1,=XL1'00'
         BNE   @@L209
         LH    2,0(8)
         CLM   2,3,=H'32'
         BE    @@L254
@@L210   EQU   *
         L     3,=A(INCRADD)
         L     2,=A(@@5)
         L     2,0(2)
         L     5,0(3)
         L     4,208(13)
         A     5,0(4,2)
         ST    5,0(3)
@@L203   EQU   *
         L     8,12(8)
         LTR   8,8
         BNE   @@L228
@@L244   EQU   *
         L     2,=V(OPTZE)
         L     2,0(2)
         LTR   2,2
         L     14,=A(@@L199)
         BER   14
         L     2,172(13)
         LTR   2,2
         BNE   @@L230
         L     14,=A(@@L199)
         BR    14
@@L254   EQU   *
         L     5,16(8)
         LH    2,0(5)
         CH    2,=H'24'
         BNE   @@L210
         SLR   6,6
         L     2,4(5)
         C     6,0(2)
         BNL   @@L203
@@L215   EQU   *
         L     3,4(5)
         LR    2,6
         MH    2,=H'4'
         L     2,4(2,3)
         L     4,4(2)
         SLL   4,2
         L     2,=A(INSN@ADD)
         LR    7,4
         A     7,0(2)
         L     3,=A(INCRADD)
         MVC   16(4,7),0(3)
         L     2,=A(@@5)
         L     2,0(2)
         L     7,0(3)
         A     7,0(4,2)
         ST    7,0(3)
         A     6,=F'1'
         L     2,4(5)
         C     6,0(2)
         BL    @@L215
         B     @@L203
@@L209   EQU   *
         LH    2,0(8)
         CLM   2,3,=H'32'
         BE    @@L255
@@L217   EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(INCRLEN)
         BALR  14,15
         LR    6,15
         L     3,=A(INCRADD)
         L     2,0(3)
         AR    2,15
         ST    2,0(3)
@@L226   EQU   *
         L     2,=A(@@5)
         L     2,0(2)
         L     7,208(13)
         CL    6,0(7,2)
         BE    @@L203
         ST    6,0(7,2)
         MVC   172(4,13),=F'1'
         B     @@L203
@@L255   EQU   *
         L     9,16(8)
         LH    2,0(9)
         CH    2,=H'24'
         BNE   @@L217
         SLR   6,6
         ST    6,212(13)
         L     2,4(9)
         C     6,0(2)
         BNL   @@L226
@@L225   EQU   *
         L     3,4(9)
         L     2,212(13)
         MH    2,=H'4'
         L     7,4(2,3)
         L     4,4(7)
         LR    5,4
         MH    5,=H'4'
         L     2,=A(INSN@ADD)
         LR    3,5
         A     3,0(2)
         L     2,=A(INCRADD)
         MVC   16(4,3),0(2)
         L     3,176(13)
         IC    2,0(4,3)
         CLM   2,1,=XL1'00'
         BNE   @@L222
         L     2,=A(@@5)
         L     2,0(2)
         L     15,0(5,2)
@@L223   EQU   *
         L     2,=A(@@5)
         L     3,0(2)
         C     15,0(5,3)
         BE    @@L224
         ST    15,0(5,3)
         MVC   172(4,13),=F'1'
@@L224   EQU   *
         L     2,=A(INCRADD)
         L     4,0(2)
         A     4,0(5,3)
         ST    4,0(2)
         AR    6,15
         L     5,212(13)
         A     5,=F'1'
         ST    5,212(13)
         L     2,4(9)
         C     5,0(2)
         BL    @@L225
         B     @@L226
@@L222   EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(INCRLEN)
         BALR  14,15
         B     @@L223
@@L253   EQU   *
         L     2,=A(@@11)
         L     3,24(8)
         S     3,0(2)
         L     2,=A(@@10)
         L     2,0(2)
         MH    3,=H'4'
         LH    15,0(3,2)
         L     5,=A(INCRAL)
         C     15,0(5)
         BNH   @@L206
         LA    2,1(0,0)
         SLL   2,0(15)
         L     7,=A(INCRADD)
         L     6,0(7)
         LR    4,6
         AR    4,2
         BCTR  4,0
         LCR   2,2
         NR    4,2
         L     2,=A(@@5)
         L     5,0(2)
         LR    3,9
         MH    3,=H'4'
         LR    2,4
         SR    2,6
         ST    2,0(3,5)
         L     6,=A(INCRAL)
         ST    15,0(6)
         ST    4,0(7)
@@L207   EQU   *
         MH    9,=H'4'
         L     2,=A(INSN@ADD)
         A     9,0(2)
         L     2,=A(INCRADD)
         MVC   16(4,9),0(2)
         B     @@L203
@@L206   EQU   *
         L     2,=A(@@5)
         L     3,0(2)
         LR    2,9
         MH    2,=H'4'
         SLR   7,7
         ST    7,0(2,3)
         B     @@L207
@@L175   EQU   *
         CLM   4,3,=H'40'
         BE    @@L181
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ASM@NOPE)
         BALR  14,15
         LTR   15,15
         BL    @@L180
@@L181   EQU   *
         L     2,=A(@@5)
         L     3,0(2)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         LR    2,15
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(INSN@DEF)
         BALR  14,15
         ST    15,196(13)
         L     4,192(13)
         L     5,4+192(13)
         MR    4,2
         ST    4,192(13)
         ST    5,4+192(13)
         ST    5,0(7,3)
         B     @@L168
@@L180   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'24'
         BE    @@L256
         AH    2,=H'-48'
         CLM   2,3,=H'1'
         BNH   @@L168
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(INSN@DEF)
         BALR  14,15
         L     2,=A(@@5)
         L     2,0(2)
         ST    15,0(7,2)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(INSN@VAR)
         BALR  14,15
         L     3,176(13)
         STC   15,0(9,3)
         B     @@L168
@@L256   EQU   *
         LR    5,3
         L     2,4(6)
         C     3,0(2)
         BNL   @@L168
@@L194   EQU   *
         L     2,4(6)
         LR    3,5
         MH    3,=H'4'
         L     3,4(3,2)
         L     7,4(3)
         LH    2,0(6)
         CLM   2,3,=H'40'
         BE    @@L189
         MVC   88(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(ASM@NOPE)
         BALR  14,15
         LTR   15,15
         BL    @@L188
@@L189   EQU   *
         MVC   88(4,13),16(3)
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         LR    4,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(INSN@DEF)
         BALR  14,15
         ST    15,204(13)
         L     2,200(13)
         L     3,4+200(13)
         MR    2,4
         ST    2,200(13)
         ST    3,4+200(13)
         LR    15,3
@@L190   EQU   *
         L     4,=A(@@5)
         L     3,0(4)
         LR    2,7
         MH    2,=H'4'
         ST    15,0(2,3)
         SLR   2,2
         L     3,176(13)
         STC   2,0(7,3)
         L     3,0(4)
         LR    2,9
         MH    2,=H'4'
         A     15,0(2,3)
         ST    15,0(2,3)
         A     5,=F'1'
         L     2,4(6)
         C     5,0(2)
         BL    @@L194
         B     @@L168
@@L188   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(INSN@DEF)
         BALR  14,15
         B     @@L190
@@L252   EQU   *
         L     2,=A(@@11)
         L     3,24(8)
         S     3,0(2)
         L     2,=A(@@10)
         L     2,0(2)
         MH    3,=H'4'
         LH    2,0(3,2)
         LTR   2,2
         BE    @@L170
         LA    3,1(0,0)
         SLL   3,0(2)
         L     2,=A(INCRADD)
         L     4,0(2)
         LR    2,4
         AR    2,3
         BCTR  2,0
         LCR   3,3
         NR    2,3
         SR    2,4
         ST    2,0(7,5)
         B     @@L170
@@L251   EQU   *
         L     2,=A(@@11)
         L     3,24(15)
         S     3,0(2)
         L     2,=A(@@10)
         L     2,0(2)
         MH    3,=H'4'
         LH    3,0(3,2)
         B     @@L158
@@L250   EQU   *
         LR    4,8
@@L146   EQU   *
         LH    2,0(4)
         CLM   2,3,=H'36'
         BE    @@L126
         L     4,12(4)
         LTR   4,4
         BE    @@L126
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   @@L146
         B     @@L126
@@L249   EQU   *
         L     2,=A(@@11)
         L     3,24(8)
         S     3,0(2)
         L     2,=A(@@10)
         L     2,0(2)
         MH    3,=H'4'
         LH    15,0(3,2)
         CR    7,15
         BNL   @@L131
         LR    7,15
         LH    9,2(3,2)
@@L131   EQU   *
         L     2,=V(ALLABL)
         L     15,0(2)
         CR    7,15
         BNL   @@L132
         LR    7,15
         L     2,=V(ALLABMS)
         L     9,0(2)
@@L132   EQU   *
         L     3,12(8)
         LTR   3,3
         BE    @@L133
         LH    2,0(3)
         CLM   2,3,=H'33'
         BE    @@L257
@@L133   EQU   *
         L     2,=A(@@11)
         L     5,0(2)
         L     3,24(8)
         SR    3,5
         L     2,=A(@@10)
         L     4,0(2)
         MH    3,=H'4'
         STH   7,0(3,4)
         L     2,24(8)
         SR    2,5
         MH    2,=H'4'
         STH   9,2(2,4)
         SLR   9,9
         LR    7,9
         B     @@L126
@@L257   EQU   *
         L     2,16(3)
         LH    2,0(2)
         AH    2,=H'-44'
         CLM   2,3,=H'1'
         BH    @@L133
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
         CR    7,15
         BNL   @@L133
         LR    7,15
         L     2,=V(ALLABMS)
         L     9,0(2)
         B     @@L133
@@L248   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'928'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L123
@@L199   EQU   *
         MVC   88(4,13),176(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function shrtbranch epilogue
         PDPEPIL
* Function shrtbranch literal pool
         DS    0F
         LTORG
* Function shrtbranch page table
         DS    0F
@@PGT13  EQU   *
         DC    A(@@PG13)
         DS    0F
* S-func asm_insn_count prologue
@@8      PDPPRLG CINDEX=14,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN14
         LTORG
@@FEN14  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG14   EQU   *
         LR    11,1
         L     10,=A(@@PGT14)
* Function asm_insn_count code
         L     15,0(11)
         LA    3,1(0,0)
         LH    2,0(15)
         CLM   2,3,=H'40'
         BE    @@L270
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(DECODE@A)
         BALR  14,15
@@L260   EQU   *
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BE    @@L269
@@L267   EQU   *
         IC    2,0(15)
         CLM   2,1,=XL1'5E'
         BE    @@L266
         CLM   2,1,=XL1'15'
         BE    @@L266
@@L263   EQU   *
         A     15,=F'1'
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BNE   @@L267
         B     @@L269
@@L266   EQU   *
         A     3,=F'1'
         B     @@L263
@@L270   EQU   *
         L     15,4(15)
         B     @@L260
@@L269   EQU   *
         LR    15,3
* Function asm_insn_count epilogue
         PDPEPIL
* Function asm_insn_count literal pool
         DS    0F
         LTORG
* Function asm_insn_count page table
         DS    0F
@@PGT14  EQU   *
         DC    A(@@PG14)
         DS    0F
* X-func final_start_function prologue
FINAL@ST PDPPRLG CINDEX=15,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN15
         LTORG
@@FEN15  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG15   EQU   *
         LR    11,1
         L     10,=A(@@PGT15)
* Function final_start_function code
         L     3,0(11)
         L     5,4(11)
         L     2,=A(@@14)
         MVC   0(4,2),=F'0'
         L     2,=A(@@15)
         MVC   0(4,2),=F'0'
         L     2,20(3)
         L     4,=F'-99'
         CLR   2,4
         BE    @@L272
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@16)
         BALR  14,15
@@L272   EQU   *
         L     2,=A(@@19)
         L     3,0(2)
         L     2,=A(@@18)
         ST    3,0(2)
         L     2,=A(@@17)
         ST    3,0(2)
         L     2,=V(DEBUG@HO)
         L     4,0(2)
         ST    3,88(13)
         L     2,=A(@@20)
         MVC   92(4,13),0(2)
         L     2,40(4)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     2,=V(WRITE@SY)
         L     2,0(2)
         LTR   2,2
         BE    @@L273
         LA    1,88(,13)
         L     15,=V(REMOVE@U)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(REORB)
         BALR  14,15
         L     2,=V(CF@DECL)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(NUMBER@B)
         BALR  14,15
         L     2,0(2)
         L     2,60(2)
         OC    8(4,2),=F'131072'
@@L273   EQU   *
         LA    1,88(,13)
         L     15,=V(G@F@SIZE)
         BALR  14,15
         ST    5,88(13)
         ST    15,92(13)
         L     2,=V(TARGETM)
         L     2,48(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(@@21)
         BALR  14,15
* Function final_start_function epilogue
         PDPEPIL
* Function final_start_function literal pool
         DS    0F
         LTORG
* Function final_start_function page table
         DS    0F
@@PGT15  EQU   *
         DC    A(@@PG15)
         DS    0F
* S-func profile_after_prologue prologue
@@21     PDPPRLG CINDEX=16,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN16
         LTORG
@@FEN16  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG16   EQU   *
         LR    11,1
         L     10,=A(@@PGT16)
* Function profile_after_prologue code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,224(2)
         SRL   2,17
         N     2,=F'1'
         LTR   2,2
         BE    @@L274
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@22)
         BALR  14,15
@@L274   EQU   *
* Function profile_after_prologue epilogue
         PDPEPIL
* Function profile_after_prologue literal pool
         DS    0F
         LTORG
* Function profile_after_prologue page table
         DS    0F
@@PGT16  EQU   *
         DC    A(@@PG16)
@@LC14   EQU   *
         DC    C'LP'
         DC    X'0'
@@LC16   EQU   *
         DC    C'Error: No profiling available.'
         DC    X'15'
         DC    X'0'
@@LC17   EQU   *
         DC    X'5'
         DC    C'L'
         DC    X'5'
         DC    C'%s,%d(13)'
         DC    X'15'
         DC    X'5'
         DC    C'LA'
         DC    X'5'
         DC    C'13,4(13)'
         DC    X'15'
         DC    X'0'
@@LC15   EQU   *
         DC    X'5'
         DC    C'S'
         DC    X'5'
         DC    C'13,=F''4'''
         DC    X'15'
         DC    X'5'
         DC    C'ST'
         DC    X'5'
         DC    C'%s,%d(13)'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func profile_function prologue
@@22     PDPPRLG CINDEX=17,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN17
         LTORG
@@FEN17  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG17   EQU   *
         LR    11,1
         L     10,=A(@@PGT17)
* Function profile_function code
         L     3,0(11)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,224(2)
         LR    5,2
         SRL   5,31
         LR    4,2
         SRL   4,28
         N     4,=F'1'
         LA    1,88(,13)
         L     15,=V(DATA@SEC)
         BALR  14,15
         LA    2,4(0,0)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         LTR   15,15
         BNE   @@L288
@@L277   EQU   *
         MVC   88(4,13),=A(@@LC14)
         MVC   92(4,13),=A(@@LC5)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L289
@@L282   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC6)
         MVC   96(4,13),=A(@@LC14)
         L     2,=V(CFUN)
         L     2,0(2)
         MVC   100(4,13),200(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,=V(CIRTX)
         MVC   88(4,13),256(2)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'32'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSINT)
         BALR  14,15
         L     2,=V(CF@DECL)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FSECTN)
         BALR  14,15
         LTR   5,5
         BNE   @@L290
@@L283   EQU   *
         LTR   4,4
         BNE   @@L291
@@L284   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC16)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         LTR   4,4
         BNE   @@L292
@@L285   EQU   *
         LTR   5,5
         BE    @@L276
         ST    3,88(13)
         MVC   92(4,13),=F'8'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(MVS@CPAG)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC17)
         L     2,=V(REG@NAME)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'88'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L276
@@L292   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'8'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(MVS@CPAG)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC17)
         L     2,=V(REG@NAME)
         MVC   96(4,13),40(2)
         MVC   100(4,13),=F'88'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L285
@@L291   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'8'
         MVC   96(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(MVS@CPAG)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC15)
         L     2,=V(REG@NAME)
         MVC   96(4,13),40(2)
         MVC   100(4,13),=F'88'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L284
@@L290   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'8'
         MVC   96(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(MVS@CPAG)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC15)
         L     2,=V(REG@NAME)
         MVC   96(4,13),0(2)
         MVC   100(4,13),=F'88'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L283
@@L289   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         MVC   88(4,13),200(2)
         LA    1,88(,13)
         L     15,=V(MVS@ALAB)
         BALR  14,15
         B     @@L282
@@L288   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FLOOR@LO)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BE    @@L293
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC3)
@@L287   EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L277
@@L293   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC2)
         B     @@L287
@@L276   EQU   *
* Function profile_function epilogue
         PDPEPIL
* Function profile_function literal pool
         DS    0F
         LTORG
* Function profile_function page table
         DS    0F
@@PGT17  EQU   *
         DC    A(@@PG17)
         DS    0F
* X-func final_end_function prologue
FINAL@EN PDPPRLG CINDEX=18,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN18
         LTORG
@@FEN18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG18   EQU   *
         LR    11,1
         L     10,=A(@@PGT18)
* Function final_end_function code
         LA    1,88(,13)
         L     15,=A(APP@DISA)
         BALR  14,15
         L     4,=V(DEBUG@HO)
         L     3,0(4)
         L     2,=A(@@18)
         MVC   88(4,13),0(2)
         L     2,56(3)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(G@F@SIZE)
         BALR  14,15
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         ST    15,92(13)
         L     2,=V(TARGETM)
         L     2,60(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     2,0(4)
         L     2,48(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
* Function final_end_function epilogue
         PDPEPIL
* Function final_end_function literal pool
         DS    0F
         LTORG
* Function final_end_function page table
         DS    0F
@@PGT18  EQU   *
         DC    A(@@PG18)
         DS    0F
* X-func final prologue
FINAL    PDPPRLG CINDEX=19,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN19
         LTORG
@@FEN19  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG19   EQU   *
         LR    11,1
         L     10,=A(@@PGT19)
* Function final code
         L     6,0(11)
         L     9,4(11)
         L     7,8(11)
         L     8,12(11)
         SLR   5,5
         LR    4,5
         L     2,=A(@@0)
         ST    5,0(2)
         L     2,=A(@@1)
         MVC   0(4,2),=F'1'
         LR    3,6
         LTR   6,6
         BE    @@L319
@@L301   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L324
@@L298   EQU   *
         L     3,12(3)
         LTR   3,3
         BNE   @@L301
@@L319   EQU   *
         A     4,=F'1'
         ST    4,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     2,=A(@@23)
         ST    15,0(2)
         LR    3,6
         LTR   6,6
         BE    @@L321
@@L310   EQU   *
         L     2,4(3)
         CR    2,5
         BNH   @@L306
         LR    5,2
@@L306   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L325
@@L307   EQU   *
         LTR   7,7
         BE    @@L304
         LH    2,0(3)
         CLM   2,3,=H'33'
         BE    @@L326
@@L304   EQU   *
         L     3,12(3)
         LTR   3,3
         BNE   @@L310
@@L321   EQU   *
         LA    1,88(,13)
         L     15,=V(IRECOG)
         BALR  14,15
         L     2,=A(CC@STATU)
         MVC   0(4,2),=F'0'
         MVC   4(4,2),=F'0'
         MVC   8(4,2),=F'0'
         L     3,12(6)
         LTR   3,3
         BE    @@L323
@@L317   EQU   *
         L     2,=A(INSN@ADD)
         L     4,0(2)
         L     15,4(3)
         CL    15,0(4)
         BNL   @@L327
         MH    15,=H'4'
         L     2,=A(INCRADD)
         L     15,16(4,15)
         ST    15,0(2)
@@L316   EQU   *
         ST    3,88(13)
         ST    9,92(13)
         ST    7,96(13)
         ST    8,100(13)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FINAL@SC)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   @@L317
         B     @@L323
@@L327   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1774'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L316
@@L326   EQU   *
         L     15,32(3)
         LTR   15,15
         BE    @@L304
         L     2,16(15)
         LA    4,1(0,0)
         CLR   2,4
         BNE   @@L304
         ST    3,20(15)
         B     @@L304
@@L325   EQU   *
         L     15,20(3)
         LTR   15,15
         BNH   @@L307
         L     2,=A(@@23)
         L     2,0(2)
         LA    4,1(0,0)
         STC   4,0(15,2)
         B     @@L307
@@L324   EQU   *
         L     2,20(3)
         CR    2,4
         BNH   @@L298
         LR    4,2
         B     @@L298
@@L323   EQU   *
         L     2,=A(@@23)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   0(4,2),=F'0'
* Function final epilogue
         PDPEPIL
* Function final literal pool
         DS    0F
         LTORG
* Function final page table
         DS    0F
@@PGT19  EQU   *
         DC    A(@@PG19)
         DS    0F
* X-func g_ins_t prologue
G@INS@T  PDPPRLG CINDEX=20,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN20
         LTORG
@@FEN20  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG20   EQU   *
         LR    11,1
         L     10,=A(@@PGT20)
* Function g_ins_t code
         L     4,4(11)
         L     2,0(11)
         SLL   2,2
         A     2,0(11)
         SLL   2,2
         A     2,=V(INSN@DAT)
         L     3,4(2)
         SLR   5,5
         IC    5,19(2)
         LR    2,5
         LA    5,2(0,0)
         CR    2,5
         BE    @@L331
         BH    @@L336
         LR    15,3
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L328
@@L334   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1806'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L328
@@L336   EQU   *
         LA    5,3(0,0)
         CLR   2,5
         BNE   @@L334
         LTR   4,4
         BE    @@L337
@@L333   EQU   *
         MVC   88(4,13),=V(RECOG@DA)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(3)
         BALR  14,15
         B     @@L328
@@L337   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1802'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L333
@@L331   EQU   *
         L     2,=V(WHICH@AL)
         L     2,0(2)
         SLL   2,2
         L     15,0(2,3)
@@L328   EQU   *
* Function g_ins_t epilogue
         PDPEPIL
* Function g_ins_t literal pool
         DS    0F
         LTORG
* Function g_ins_t page table
         DS    0F
@@PGT20  EQU   *
         DC    A(@@PG20)
@@LC24   EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'A(@@L%d-@@L%d)'
         DC    X'15'
         DC    X'0'
@@LC23   EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'A(@@L%d)'
         DC    X'15'
         DC    X'0'
@@LC26   EQU   *
         DC    C'could not split insn'
         DC    X'0'
@@LC19   EQU   *
         DC    C'*'
         DC    X'0'
@@LC25   EQU   *
         DC    X'5'
         DC    C'%s'
         DC    X'15'
         DC    X'0'
@@LC20   EQU   *
         DC    C'LEHB'
         DC    X'0'
@@LC21   EQU   *
         DC    C'LEHE'
         DC    X'0'
@@LC22   EQU   *
         DC    X'5'
         DC    C'LTORG'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func final_scan_insn prologue
FINAL@SC PDPPRLG CINDEX=21,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN21
         LTORG
@@FEN21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG21   EQU   *
         LR    11,1
         L     10,=A(@@PGT21)
* Function final_scan_insn code
         L     7,0(11)
         L     8,4(11)
         L     3,=A(@@2)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         L     3,0(7)
         LR    2,3
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   @@L340
         LR    2,3
         SRL   2,16
         LA    3,36(0,0)
         CLR   2,3
         L     14,=A(@@L398)
         BER   14
         L     14,=A(@@L620)
         BHR   14
         LA    6,35(0,0)
         CLR   2,6
         BE    @@L340
@@L470   EQU   *
         L     12,0(,10)
         L     6,16(7)
         LH    2,0(6)
         AH    2,=H'-48'
         CLM   2,3,=H'1'
         BH    @@L641
@@L340   EQU   *
         L     12,0(,10)
         L     15,12(7)
         L     14,=A(@@L338)
         BR    14
@@L641   EQU   *
         ST    7,88(13)
         MVC   92(4,13),=F'11'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L472
         L     2,4(15)
         L     4,16(2)
         LH    2,0(4)
         CLM   2,3,=H'39'
         L     14,=A(@@L642)
         BER   14
@@L473   EQU   *
         L     12,0(,10)
         LH    2,0(4)
         CLM   2,3,=H'47'
         L     14,=A(@@L474)
         BER   14
         L     2,=A(CC@STATU)
         MVC   0(4,2),=F'0'
         MVC   4(4,2),=F'0'
         MVC   8(4,2),=F'0'
@@L475   EQU   *
         L     12,0(,10)
         L     3,=A(CC@STATU)
         L     2,=A(CC@PREV@)
         MVC   0(16,2),0(3)
@@L472   EQU   *
         LH    3,0(6)
         LR    2,3
         AH    2,=H'-44'
         CLM   2,3,=H'1'
         BH    @@L498
         L     3,12(11)
         LTR   3,3
         BH    @@L340
         L     3,=A(@@3)
         L     2,0(3)
         LTR   2,2
         BNE   @@L643
@@L500   EQU   *
         LH    2,0(6)
         X     2,=F'45'
         SLL   2,16
         SRA   2,16
         LPR   2,2
         BCTR  2,0
         N     2,=XL4'0000FFFF'
         SRL   2,15
         SLL   2,2
         L     2,4(6,2)
         L     5,0(2)
         SLR   4,4
         CR    4,5
         BNL   @@L624
@@L509   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'44'
         BE    @@L644
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC24)
         L     3,8(6)
         LR    2,4
         MH    2,=H'4'
         L     2,4(2,3)
         L     2,4(2)
         MVC   96(4,13),24(2)
         L     2,4(6)
         L     2,4(2)
         MVC   100(4,13),24(2)
@@L631   EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         A     4,=F'1'
         CR    4,5
         BL    @@L509
@@L624   EQU   *
         L     3,=V(MP@CODE)
         L     4,=V(MVS@CASE)
         L     2,0(3)
         A     2,0(4)
         ST    2,0(3)
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(MVS@CPAG)
         BALR  14,15
         MVC   0(4,4),=F'0'
         L     2,=V(CF@DECL)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FSECTN)
         BALR  14,15
         B     @@L340
@@L644   EQU   *
         L     3,=V(MVS@CASE)
         L     2,0(3)
         A     2,=F'4'
         ST    2,0(3)
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC23)
         L     3,4(6)
         LR    2,4
         MH    2,=H'4'
         L     2,4(2,3)
         L     2,4(2)
         MVC   96(4,13),24(2)
         B     @@L631
@@L643   EQU   *
         MVC   88(4,13),=A(@@LC8)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   0(4,3),=F'0'
         B     @@L500
@@L498   EQU   *
         CLM   3,3,=H'40'
         L     14,=A(@@L645)
         BER   14
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ASM@NOPE)
         BALR  14,15
         LTR   15,15
         BL    @@L514
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(ASM@NOPE)
         BALR  14,15
         LR    3,15
         LR    2,15
         MH    2,=H'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    5,15
         L     2,=A(CC@STATU)
         MVC   0(4,2),=F'0'
         MVC   4(4,2),=F'0'
         MVC   8(4,2),=F'0'
         L     2,12(11)
         LTR   2,2
         BH    @@L340
         ST    6,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(DECODE@A)
         BALR  14,15
         LR    4,15
         L     2,=A(@@24)
         ST    3,0(2)
         L     2,=A(@@15)
         ST    7,0(2)
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BE    @@L516
         L     3,=A(@@3)
         L     2,0(3)
         LTR   2,2
         BE    @@L646
@@L517   EQU   *
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(OASMINSN)
         BALR  14,15
@@L516   EQU   *
         L     2,=A(@@15)
@@L634   EQU   *
         MVC   0(4,2),=F'0'
         B     @@L340
@@L646   EQU   *
         MVC   88(4,13),=A(@@LC8)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   0(4,3),=F'1'
         B     @@L517
@@L514   EQU   *
         L     3,12(11)
         LTR   3,3
         L     14,=A(@@L647)
         BNHR  14
@@L518   EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'24'
         L     14,=A(@@L648)
         BER   14
         L     6,16(7)
         LH    2,0(7)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L649)
         BER   14
         SLR   5,5
@@L534   EQU   *
         L     12,0(,10)
         L     2,8(11)
         LTR   2,2
         BE    @@L537
         LTR   5,5
         BE    @@L537
         L     2,4(5)
         LH    2,0(2)
         CLM   2,3,=H'69'
         L     14,=A(@@L650)
         BER   14
@@L537   EQU   *
         L     12,0(,10)
         L     2,=A(FINAL@SE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L548
         L     3,12(11)
         LTR   3,3
         BL    @@L548
         LH    2,0(7)
         CLM   2,3,=H'32'
         L     14,=A(@@L651)
         BER   14
@@L548   EQU   *
         L     12,0(,10)
         L     2,=A(CC@STATU)
         L     2,0(2)
         LTR   2,2
         BE    @@L549
         LH    2,0(7)
         CLM   2,3,=H'33'
         L     14,=A(@@L652)
         BER   14
@@L549   EQU   *
         L     12,0(,10)
         L     2,=A(CC@STATU)
         L     2,0(2)
         LTR   2,2
         BE    @@L556
         LTR   5,5
         BE    @@L556
         LH    2,0(7)
         CLM   2,3,=H'33'
         BE    @@L557
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'72'
         L     14,=A(@@L653)
         BER   14
@@L557   EQU   *
         L     4,8(5)
         L     2,=V(CONST@TR)
         L     9,0(2)
         L     2,=V(CIRTX)
         L     8,256(2)
@@L558   EQU   *
         L     12,0(,10)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         A     2,=F'-102'
         LA    3,9(0,0)
         CLR   2,3
         BH    @@L556
         L     3,4(4)
         L     2,=V(GLBRTL)
         C     3,4(2)
         L     14,=A(@@L654)
         BER   14
@@L556   EQU   *
         L     12,0(,10)
         L     8,20(7)
         LTR   8,8
         L     14,=A(@@L655)
         BLR   14
@@L579   EQU   *
         L     12,0(,10)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(CLNPSOPE)
         BALR  14,15
         L     2,=V(FLGDRTL)
         L     2,0(2)
         LTR   2,2
         L     14,=A(@@L656)
         BNER  14
@@L580   EQU   *
         L     12,0(,10)
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(CSTOCACH)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L657)
         BER   14
@@L581   EQU   *
         L     12,0(,10)
         L     5,=A(CC@STATU)
         L     2,=A(CC@PREV@)
         MVC   0(16,2),0(5)
         LR    4,6
         LH    2,0(6)
         CLM   2,3,=H'39'
         L     14,=A(@@L658)
         BER   14
@@L582   EQU   *
         L     12,0(,10)
         LH    2,0(4)
         CLM   2,3,=H'47'
         BE    @@L583
         MVC   0(4,5),=F'0'
         MVC   4(4,5),=F'0'
         MVC   8(4,5),=F'0'
@@L584   EQU   *
         L     12,0(,10)
         L     2,=A(@@26)
         ST    7,0(2)
         L     2,=A(COUTINSN)
         ST    7,0(2)
         ST    8,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(G@INS@T)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L659
         CLI   0(15),123
         BE    @@L660
@@L615   EQU   *
         L     6,12(11)
         LTR   6,6
         BH    @@L340
         ST    3,88(13)
         MVC   92(4,13),=V(RECOG@DA)
         LA    1,88(,13)
         L     15,=V(OASMINSN)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=F'30'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L618
         L     2,4(15)
         MVC   88(4,13),4(2)
         L     2,4(15)
         L     2,8(2)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(ASSVTENT)
         BALR  14,15
@@L618   EQU   *
         L     2,=A(@@26)
         MVC   0(4,2),=F'0'
         L     2,=A(COUTINSN)
         B     @@L634
@@L660   EQU   *
         IC    2,1(15)
         CLM   2,1,=XL1'00'
         BNE   @@L615
         ST    6,88(13)
         ST    7,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TRY@SPLI)
         BALR  14,15
         LR    3,15
         CLR   15,7
         BE    @@L661
@@L616   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2632'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=A(@@1)
         MVC   0(4,2),=F'0'
@@L637   EQU   *
         LR    15,3
         L     14,=A(@@L338)
         BR    14
@@L661   EQU   *
         L     2,16(7)
         CLR   2,6
         BNE   @@L616
         MVC   88(4,13),=A(@@LC26)
         ST    7,92(13)
         MVC   96(4,13),=A(@@LC0)
         MVC   100(4,13),=F'2626'
         MVC   104(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(@FATINS)
         BALR  14,15
         B     @@L616
@@L659   EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         L     4,=A(@@0)
         CL    15,0(4)
         BE    @@L608
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2600'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L608   EQU   *
         L     2,=A(@@1)
         ST    3,0(2)
         LR    3,7
         CL    7,0(4)
         BE    @@L637
@@L614   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L662
@@L611   EQU   *
         L     3,8(3)
         L     2,=A(@@0)
         CL    3,0(2)
         BNE   @@L614
         B     @@L637
@@L662   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         B     @@L611
@@L583   EQU   *
         L     3,4(4)
         L     2,=V(GLBRTL)
         CL    3,4(2)
         BE    @@L663
         L     2,4(5)
         LTR   2,2
         BNE   @@L664
@@L587   EQU   *
         L     3,=A(CC@STATU)
         L     2,8(3)
         LTR   2,2
         BNE   @@L665
@@L588   EQU   *
         L     2,8(4)
         LH    3,0(2)
         N     3,=XL4'0000FFFF'
         A     3,=F'-75'
         LA    2,54(0,0)
         CLR   3,2
         BH    @@L584
         MH    3,=H'4'
         L     2,=A(@@L606)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L606   EQU   *
         DC    A(@@L594)
         DC    A(@@L594)
         DC    A(@@L594)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L594)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L584)
         DC    A(@@L594)
@@L594   EQU   *
         L     3,=A(CC@STATU)
         MVC   0(4,3),=F'0'
         MVC   4(4,3),4(4)
         MVC   8(4,3),8(4)
         L     2,4(3)
         LTR   2,2
         BE    @@L584
         ST    2,88(13)
         MVC   92(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L584
         MVC   8(4,3),=F'0'
         B     @@L584
@@L665   EQU   *
         MVC   88(4,13),4(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L588
         MVC   8(4,3),=F'0'
         B     @@L588
@@L664   EQU   *
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L587
         MVC   4(4,5),=F'0'
         B     @@L587
@@L663   EQU   *
         ST    3,4(5)
         MVC   8(4,5),8(4)
         MVC   0(4,5),=F'0'
         B     @@L584
@@L658   EQU   *
         L     2,4(6)
         L     4,4(2)
         B     @@L582
@@L657   EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC0)
         MVC   96(4,13),=F'2555'
         MVC   100(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(@FATNOTF)
         BALR  14,15
         B     @@L581
@@L656   EQU   *
         L     3,=V(PRINT@RT)
         MVC   0(4,3),=A(@@LC19)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(PRSING)
         BALR  14,15
         MVC   0(4,3),=A(@@LC8)
         B     @@L580
@@L655   EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(RECOG@ME)
         BALR  14,15
         LR    8,15
         B     @@L579
@@L654   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@25)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BE    @@L666
         L     3,=F'-1'
         CLR   15,3
         BE    @@L667
         LA    2,2(0,0)
         CLR   15,2
         BE    @@L668
@@L572   EQU   *
         L     2,4(5)
         CL    2,8(5)
         BNE   @@L556
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         B     @@L556
@@L668   EQU   *
         MVC   20(4,7),=F'-1'
         B     @@L572
@@L667   EQU   *
         ST    7,88(13)
         A     5,=F'8'
         ST    5,92(13)
         A     5,=F'-8'
         ST    8,96(13)
@@L633   EQU   *
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         B     @@L572
@@L666   EQU   *
         ST    7,88(13)
         A     5,=F'8'
         ST    5,92(13)
         A     5,=F'-8'
         ST    9,96(13)
         B     @@L633
@@L653   EQU   *
         L     4,4(3)
         L     9,8(3)
         L     8,12(3)
         B     @@L558
@@L652   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'47'
         BNE   @@L549
         L     8,=V(GLBRTL)
         L     2,4(6)
         CL    2,0(8)
         BNE   @@L549
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'72'
         BNE   @@L549
         L     4,4(3)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L549
         L     2,4(4)
         C     2,4(8)
         BNE   @@L549
         L     2,12(11)
         LTR   2,2
         BL    @@L549
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@25)
         BALR  14,15
         LA    3,1(0,0)
         CLR   15,3
         BE    @@L669
@@L550   EQU   *
         L     2,=F'-1'
         CLR   15,2
         BE    @@L670
@@L551   EQU   *
         L     3,8(6)
         CL    3,0(8)
         BE    @@L671
         LH    2,0(3)
         CLM   2,3,=H'51'
         BE    @@L672
@@L553   EQU   *
         LTR   15,15
         BE    @@L549
         MVC   20(4,7),=F'-1'
         B     @@L549
@@L672   EQU   *
         LR    6,3
         ST    3,16(7)
         B     @@L553
@@L671   EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         B     @@L340
@@L670   EQU   *
         L     2,8(6)
         MVC   8(4,6),12(2)
         B     @@L551
@@L669   EQU   *
         L     2,8(6)
         MVC   8(4,6),8(2)
         B     @@L550
@@L651   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'47'
         BNE   @@L548
         L     4,8(6)
         LH    2,0(4)
         CLM   2,3,=H'61'
         BNE   @@L548
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L548
         L     2,4(4)
         CL    2,4(3)
         BNE   @@L548
         B     @@L340
@@L650   EQU   *
         L     2,=A(@@0)
         CL    7,0(2)
         BE    @@L537
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'63'
         L     14,=A(@@L673)
         BER   14
         CLM   2,3,=H'74'
         L     14,=A(@@L674)
         BER   14
@@L540   EQU   *
         L     12,0(,10)
         L     3,=A(CC@STATU)
         L     2,4(3)
         LTR   2,2
         BNE   @@L675
@@L546   EQU   *
         L     2,8(3)
         LTR   2,2
         BE    @@L537
         MVC   88(4,13),8(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L537
@@L545   EQU   *
         MVC   88(4,13),16(7)
         LA    1,88(,13)
         L     15,=V(VOLREFP)
         BALR  14,15
         LTR   15,15
         BNE   @@L537
         L     2,=A(@@0)
         ST    7,0(2)
         B     @@L340
@@L675   EQU   *
         MVC   88(4,13),8(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L545
         B     @@L546
@@L674   EQU   *
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'63'
         BE    @@L676
@@L542   EQU   *
         L     12,0(,10)
         L     3,8(5)
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'63'
         BNE   @@L540
         LR    2,3
@@L632   EQU   *
         L     12,0(,10)
         A     2,=F'8'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ALTER@SU)
         BALR  14,15
         ST    15,0(2)
         B     @@L540
@@L676   EQU   *
         LR    2,3
         A     2,=F'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(ALTER@SU)
         BALR  14,15
         ST    15,0(2)
         B     @@L542
@@L673   EQU   *
         LR    2,5
         B     @@L632
@@L649   EQU   *
         LH    2,0(6)
         LR    5,6
         CLM   2,3,=H'47'
         BE    @@L534
         ST    7,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    5,15
         B     @@L534
@@L648   EQU   *
         L     2,12(11)
         LTR   2,2
         BH    @@L340
         L     4,=A(FINAL@SE)
         ST    6,0(4)
         L     2,4(6)
         MVC   88(4,13),4(2)
         ST    8,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),12(11)
         MVC   104(4,13),=F'1'
         B     @@PGE21
         DS    0F
         LTORG
         DS    0F
@@PGE21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG22   EQU   *
         LA    1,88(,13)
         L     15,=V(FINAL@SC)
         BALR  14,15
         L     3,4(6)
         CL    15,8(3)
         BE    @@L522
         MVC   0(4,4),=F'0'
         L     14,=A(@@L338)
         BR    14
@@L522   EQU   *
         L     12,4(,10)
         LA    4,1(0,0)
         C     4,0(3)
         BNL   @@L626
@@L531   EQU   *
         L     12,4(,10)
         L     3,4(6)
         LR    2,4
         MH    2,=H'4'
         L     15,4(2,3)
         L     2,12(15)
@@L527   EQU   *
         L     12,4(,10)
         ST    15,88(13)
         ST    8,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),12(11)
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(FINAL@SC)
         BALR  14,15
         CR    15,2
         BNE   @@L527
         A     4,=F'1'
         L     2,4(6)
         C     4,0(2)
         BL    @@L531
@@L626   EQU   *
         L     12,4(,10)
         L     2,=A(FINAL@SE)
         MVC   0(4,2),=F'0'
         L     2,4(6)
         L     2,4(2)
         LH    2,0(2)
         CLM   2,3,=H'34'
         L     14,=A(@@L340)
         BNER  14
         L     2,=A(CC@STATU)
         MVC   0(4,2),=F'0'
         MVC   4(4,2),=F'0'
         MVC   8(4,2),=F'0'
         L     14,=A(@@L340)
         BR    14
@@L647   EQU   *
         L     12,4(,10)
         L     3,=A(@@3)
         L     2,0(3)
         LTR   2,2
         L     14,=A(@@L518)
         BER   14
         MVC   88(4,13),=A(@@LC8)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   0(4,3),=F'0'
         L     14,=A(@@L518)
         BR    14
@@L645   EQU   *
         L     12,4(,10)
         L     4,4(6)
         L     2,=A(CC@STATU)
         MVC   0(4,2),=F'0'
         MVC   4(4,2),=F'0'
         MVC   8(4,2),=F'0'
         L     6,12(11)
         LTR   6,6
         L     14,=A(@@L340)
         BHR   14
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         L     14,=A(@@L340)
         BER   14
         L     3,=A(@@3)
         L     2,0(3)
         LTR   2,2
         BE    @@L677
@@L513   EQU   *
         L     12,4(,10)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC25)
         ST    4,96(13)
@@L635   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L340)
         BR    14
@@L677   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC8)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   0(4,3),=F'1'
         B     @@L513
@@L474   EQU   *
         L     12,4(,10)
         L     3,4(4)
         L     2,=V(GLBRTL)
         CL    3,4(2)
         BE    @@L678
         L     5,=A(CC@STATU)
         L     2,4(5)
         LTR   2,2
         BNE   @@L679
@@L478   EQU   *
         L     12,4(,10)
         L     3,=A(CC@STATU)
         L     2,8(3)
         LTR   2,2
         BNE   @@L680
@@L479   EQU   *
         L     12,4(,10)
         L     2,8(4)
         LH    3,0(2)
         N     3,=XL4'0000FFFF'
         A     3,=F'-75'
         LA    2,54(0,0)
         CLR   3,2
         L     14,=A(@@L475)
         BHR   14
         MH    3,=H'4'
         L     2,=A(@@L497)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L497   EQU   *
         DC    A(@@L485)
         DC    A(@@L485)
         DC    A(@@L485)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L485)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L475)
         DC    A(@@L485)
@@L485   EQU   *
         L     12,4(,10)
         L     3,=A(CC@STATU)
         MVC   0(4,3),=F'0'
         MVC   4(4,3),4(4)
         MVC   8(4,3),8(4)
         L     2,4(3)
         LTR   2,2
         L     14,=A(@@L475)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L475)
         BER   14
         MVC   8(4,3),=F'0'
         L     14,=A(@@L475)
         BR    14
@@L680   EQU   *
         L     12,4(,10)
         MVC   88(4,13),4(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L479
         MVC   8(4,3),=F'0'
         B     @@L479
@@L679   EQU   *
         L     12,4(,10)
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L478
         MVC   4(4,5),=F'0'
         B     @@L478
@@L678   EQU   *
         L     12,4(,10)
         L     2,=A(CC@STATU)
         ST    3,4(2)
         MVC   8(4,2),8(4)
         MVC   0(4,2),=F'0'
         L     14,=A(@@L475)
         BR    14
@@L642   EQU   *
         L     12,4(,10)
         L     2,4(4)
         L     4,4(2)
         L     14,=A(@@L473)
         BR    14
@@L620   EQU   *
         L     12,4(,10)
         LA    3,37(0,0)
         CR    2,3
         L     14,=A(@@L470)
         BNER  14
         L     6,12(11)
         LTR   6,6
         L     14,=A(@@L340)
         BHR   14
         L     4,20(7)
         LR    3,4
         A     3,=F'99'
         LA    2,99(0,0)
         CLR   3,2
         L     14,=A(@@L375)
         BHR   14
         MH    3,=H'4'
         L     2,=A(@@L396)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L396   EQU   *
         DC    A(@@L340)
         DC    A(@@L365)
         DC    A(@@L368)
         DC    A(@@L340)
         DC    A(@@L340)
         DC    A(@@L340)
         DC    A(@@L340)
         DC    A(@@L340)
         DC    A(@@L340)
         DC    A(@@L362)
         DC    A(@@L363)
         DC    A(@@L466)
         DC    A(@@L364)
         DC    A(@@L358)
         DC    A(@@L360)
         DC    A(@@L340)
         DC    A(@@L340)
         DC    A(@@L340)
         DC    A(@@L340)
         DC    A(@@L340)
         DC    A(@@L340)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L375)
         DC    A(@@L340)
@@L358   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC20)
         MVC   92(4,13),=A(@@LC5)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L681
@@L359   EQU   *
         L     12,4(,10)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC6)
         MVC   96(4,13),=A(@@LC20)
@@L638   EQU   *
         L     12,4(,10)
         MVC   100(4,13),16(7)
         B     @@L635
@@L681   EQU   *
         L     12,4(,10)
         MVC   88(4,13),16(7)
         LA    1,88(,13)
         L     15,=V(MVS@ALAB)
         BALR  14,15
         B     @@L359
@@L365   EQU   *
         L     12,4(,10)
         L     2,=V(DEBUG@IN)
         L     2,0(2)
         A     2,=F'-2'
         LA    3,1(0,0)
         CLR   2,3
         BNH   @@L367
         L     2,=V(WRITE@SY)
         L     2,0(2)
         LA    6,3(0,0)
         CLR   2,6
         BE    @@L367
         LA    3,4(0,0)
         CLR   2,3
         BE    @@L367
         LA    6,7(0,0)
         CLR   2,6
         BE    @@L367
         LA    3,6(0,0)
         CLR   2,3
         L     14,=A(@@L340)
         BNER  14
@@L367   EQU   *
         L     12,4(,10)
         L     2,16(7)
         L     4,12(2)
         N     4,=F'1073741823'
         LA    1,88(,13)
         L     15,=A(APP@DISA)
         BALR  14,15
         L     3,=A(@@14)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         L     3,=A(@@19)
         L     2,=A(@@17)
         MVC   0(4,2),0(3)
         L     2,=V(DEBUG@HO)
         L     2,0(2)
         MVC   88(4,13),0(3)
         ST    4,92(13)
         L     2,24(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     2,16(7)
         OC    8(4,2),=F'131072'
         L     14,=A(@@L340)
         BR    14
@@L368   EQU   *
         L     12,4(,10)
         L     2,=V(DEBUG@IN)
         L     2,0(2)
         A     2,=F'-2'
         LA    6,1(0,0)
         CLR   2,6
         BNH   @@L370
         L     2,=V(WRITE@SY)
         L     2,0(2)
         LA    3,3(0,0)
         CLR   2,3
         BE    @@L370
         LA    6,4(0,0)
         CLR   2,6
         BE    @@L370
         LA    3,7(0,0)
         CLR   2,3
         BE    @@L370
         LA    6,6(0,0)
         CLR   2,6
         L     14,=A(@@L340)
         BNER  14
@@L370   EQU   *
         L     12,4(,10)
         L     2,16(7)
         L     4,12(2)
         N     4,=F'1073741823'
         LA    1,88(,13)
         L     15,=A(APP@DISA)
         BALR  14,15
         L     2,=A(@@14)
         L     3,0(2)
         BCTR  3,0
         ST    3,0(2)
         LTR   3,3
         BL    @@L682
@@L371   EQU   *
         L     12,4(,10)
         L     2,=V(DEBUG@HO)
         L     3,0(2)
         L     2,=A(@@17)
         MVC   88(4,13),0(2)
         ST    4,92(13)
         L     2,28(3)
@@L636   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     14,=A(@@L340)
         BR    14
@@L682   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1933'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L371
@@L362   EQU   *
         L     12,4(,10)
         ST    8,88(13)
         L     2,=V(TARGETM)
         L     2,52(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@21)
         BALR  14,15
         L     14,=A(@@L340)
         BR    14
@@L363   EQU   *
         L     12,4(,10)
         ST    8,88(13)
         L     2,=V(TARGETM)
         L     2,56(2)
         B     @@L636
@@L466   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC5)
         MVC   92(4,13),=A(@@LC5)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L683
@@L469   EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC6)
         MVC   96(4,13),=A(@@LC5)
         MVC   100(4,13),24(7)
         B     @@L635
@@L683   EQU   *
         L     12,4(,10)
         MVC   88(4,13),24(7)
         LA    1,88(,13)
         L     15,=V(MVS@ALAB)
         BALR  14,15
         B     @@L469
@@L364   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=A(APP@DISA)
         BALR  14,15
         L     2,=V(DEBUG@HO)
         L     3,0(2)
         L     2,=A(@@19)
         MVC   88(4,13),0(2)
         L     2,44(3)
         B     @@L636
@@L360   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC21)
         MVC   92(4,13),=A(@@LC5)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L684
@@L361   EQU   *
         L     12,4(,10)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC6)
         MVC   96(4,13),=A(@@LC21)
         B     @@L638
@@L684   EQU   *
         L     12,4(,10)
         MVC   88(4,13),16(7)
         LA    1,88(,13)
         L     15,=V(MVS@ALAB)
         BALR  14,15
         B     @@L361
@@L375   EQU   *
         L     12,4(,10)
         LTR   4,4
         BNH   @@L685
@@L376   EQU   *
         L     12,4(,10)
         SLR   5,5
         L     3,12(7)
         LTR   3,3
         BE    @@L378
@@L394   EQU   *
         L     12,4(,10)
         LH    4,0(3)
         LR    2,4
         AH    2,=H'-36'
         CLM   2,3,=H'1'
         BH    @@L378
         CLM   4,3,=H'37'
         BE    @@L686
@@L383   EQU   *
         L     12,4(,10)
         CLM   4,3,=H'37'
         BE    @@L687
@@L379   EQU   *
         L     12,4(,10)
         L     3,12(3)
         LTR   3,3
         BNE   @@L394
@@L378   EQU   *
         L     12,4(,10)
         LTR   5,5
         L     14,=A(@@L340)
         BNER  14
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@16)
         BALR  14,15
         L     2,=V(DEBUG@HO)
         L     3,0(2)
         L     2,=A(@@19)
         MVC   88(4,13),0(2)
         L     2,=A(@@20)
         MVC   92(4,13),0(2)
         L     2,36(3)
         B     @@L636
@@L687   EQU   *
         L     12,4(,10)
         L     4,20(3)
         LTR   4,4
         BNH   @@L379
         L     3,20(7)
         A     3,=F'1'
         CR    3,4
         BNL   @@L388
@@L392   EQU   *
         L     12,4(,10)
         L     2,=A(@@23)
         L     2,0(2)
         IC    2,0(3,2)
         SLL   2,24
         SRA   2,24
         C     2,=F'0'
         BNE   @@L388
         A     3,=F'1'
         CR    3,4
         BL    @@L392
@@L388   EQU   *
         L     12,4(,10)
         CR    3,4
         BL    @@L378
         LA    5,1(0,0)
         B     @@L378
@@L686   EQU   *
         L     12,4(,10)
         L     15,20(3)
         LR    2,15
         A     2,=F'98'
         LA    6,1(0,0)
         CLR   2,6
         BNH   @@L378
         L     2,=F'-87'
         CLR   15,2
         BNE   @@L383
         B     @@L378
@@L685   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1951'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L376
@@L398   EQU   *
         L     12,4(,10)
         L     3,24(7)
         L     2,=A(@@13)
         C     3,0(2)
         BH    @@L399
         L     2,=A(@@11)
         S     3,0(2)
         L     2,=A(@@10)
         L     2,0(2)
         MH    3,=H'4'
         LH    3,0(3,2)
         LTR   3,3
         BE    @@L399
         L     2,12(7)
         LTR   2,2
         BE    @@L399
         LA    6,1(0,0)
         CLR   3,6
         L     14,=A(@@L688)
         BER   14
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC3)
@@L629   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L399   EQU   *
         L     12,4(,10)
         L     2,=A(CC@STATU)
         MVC   0(4,2),=F'0'
         MVC   4(4,2),=F'0'
         MVC   8(4,2),=F'0'
         L     2,12(11)
         LTR   2,2
         L     14,=A(@@L340)
         BHR   14
         L     2,=A(@@1)
         MVC   0(4,2),=F'1'
         L     2,28(7)
         LTR   2,2
         L     14,=A(@@L689)
         BNER  14
@@L457   EQU   *
         L     12,4(,10)
         L     3,=A(@@3)
         L     2,0(3)
         LTR   2,2
         L     14,=A(@@L690)
         BNER  14
@@L458   EQU   *
         L     12,4(,10)
         L     3,12(7)
         LTR   3,3
         BE    @@L459
         LH    2,0(3)
         CLM   2,3,=H'33'
         BE    @@L691
@@L459   EQU   *
         L     12,4(,10)
         L     2,32(7)
         LTR   2,2
         BE    @@L466
         ST    8,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ASSNAME)
         BALR  14,15
         MVC   88(4,13),=A(@@LC11)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L340)
         BR    14
@@L691   EQU   *
         L     12,4(,10)
         L     2,16(3)
         LH    2,0(2)
         AH    2,=H'-44'
         CLM   2,3,=H'1'
         BH    @@L459
         LA    1,88(,13)
         L     15,=V(RDODSEC)
         BALR  14,15
         MVC   88(4,13),12(7)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
         LTR   15,15
         BE    @@L465
         LA    3,1(0,0)
         CLR   15,3
         BE    @@L692
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC3)
@@L630   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L465   EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC22)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,=V(MVS@CASE)
         MVC   0(4,2),=F'0'
         B     @@L469
@@L692   EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC2)
         B     @@L630
@@L690   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC8)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   0(4,3),=F'0'
         B     @@L458
@@L689   EQU   *
         L     12,4(,10)
         L     2,=V(DEBUG@HO)
         L     2,0(2)
         ST    7,88(13)
         L     2,76(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         B     @@L457
@@L688   EQU   *
         L     12,4(,10)
         ST    8,88(13)
         MVC   92(4,13),=A(@@LC2)
         B     @@L629
@@L338   EQU   *
         L     12,4(,10)
* Function final_scan_insn epilogue
         PDPEPIL
* Function final_scan_insn literal pool
         DS    0F
         LTORG
* Function final_scan_insn page table
         DS    0F
@@PGT21  EQU   *
         DC    A(@@PG21)
         DC    A(@@PG22)
         DS    0F
* S-func notice_source_line prologue
@@16     PDPPRLG CINDEX=23,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN23
         LTORG
@@FEN23  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG23   EQU   *
         LR    11,1
         L     10,=A(@@PGT23)
* Function notice_source_line code
         L     2,0(11)
         L     3,=A(@@20)
         MVC   0(4,3),16(2)
         L     3,=A(@@19)
         MVC   0(4,3),20(2)
         L     15,=A(@@17)
         L     2,0(15)
         L     3,0(3)
         CR    2,3
         BNL   @@L694
         LR    2,3
@@L694   EQU   *
         ST    2,0(15)
         L     15,=A(@@18)
         L     2,0(15)
         CR    2,3
         BNL   @@L695
         LR    2,3
@@L695   EQU   *
         ST    2,0(15)
* Function notice_source_line epilogue
         PDPEPIL
* Function notice_source_line literal pool
         DS    0F
         LTORG
* Function notice_source_line page table
         DS    0F
@@PGT23  EQU   *
         DC    A(@@PG23)
         DS    0F
* X-func clnpsoper prologue
CLNPSOPE PDPPRLG CINDEX=24,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN24
         LTORG
@@FEN24  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG24   EQU   *
         LR    11,1
         L     10,=A(@@PGT24)
* Function clnpsoper code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(EINSNC)
         BALR  14,15
         SLR   4,4
         L     15,=V(RECOG@DA)
         SLR   2,2
         IC    2,620(15)
         CR    4,2
         BNL   @@L716
         LR    5,15
@@L705   EQU   *
         LR    3,4
         MH    3,=H'4'
         AR    3,15
         L     15,120(3)
         L     2,0(15)
         LH    2,0(2)
         CLM   2,3,=H'63'
         BE    @@L720
         L     2,0(3)
         LH    2,0(2)
         CLM   2,3,=H'75'
         BE    @@L704
         CLM   2,3,=H'78'
         BE    @@L704
         CH    2,=H'66'
         BE    @@L704
@@L699   EQU   *
         A     5,=F'4'
         A     4,=F'1'
         L     15,=V(RECOG@DA)
         SLR   2,2
         IC    2,620(15)
         CR    4,2
         BL    @@L705
@@L716   EQU   *
         SLR   4,4
         L     15,=V(RECOG@DA)
         SLR   2,2
         IC    2,621(15)
         CR    4,2
         BNL   @@L718
         L     5,=V(RECOG@DA)
         LA    5,600(0,5)
@@L714   EQU   *
         LR    3,4
         MH    3,=H'4'
         AR    3,15
         A     3,=F'600'
         L     15,0(3)
         L     2,0(15)
         LH    2,0(2)
         CLM   2,3,=H'63'
         BE    @@L721
         CLM   2,3,=H'75'
         BE    @@L713
         CLM   2,3,=H'78'
         BE    @@L713
         CH    2,=H'66'
         BE    @@L713
@@L708   EQU   *
         A     5,=F'4'
         A     4,=F'1'
         L     15,=V(RECOG@DA)
         SLR   2,2
         IC    2,621(15)
         CR    4,2
         BL    @@L714
         B     @@L718
@@L713   EQU   *
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=A(@@27)
         BALR  14,15
         L     2,0(5)
@@L719   EQU   *
         ST    15,0(2)
         B     @@L708
@@L721   EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ALTER@SU)
         BALR  14,15
         L     2,0(3)
         B     @@L719
@@L704   EQU   *
         MVC   88(4,13),120(5)
         LA    1,88(,13)
         L     15,=A(@@27)
         BALR  14,15
         ST    15,0(5)
         B     @@L699
@@L720   EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ALTER@SU)
         BALR  14,15
         ST    15,0(3)
         B     @@L699
@@L718   EQU   *
* Function clnpsoper epilogue
         PDPEPIL
* Function clnpsoper literal pool
         DS    0F
         LTORG
* Function clnpsoper page table
         DS    0F
@@PGT24  EQU   *
         DC    A(@@PG24)
         DS    0F
* X-func alter_subreg prologue
ALTER@SU PDPPRLG CINDEX=25,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN25
         LTORG
@@FEN25  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG25   EQU   *
         LR    11,1
         L     10,=A(@@PGT25)
* Function alter_subreg code
         L     5,0(11)
         L     3,0(5)
         L     4,4(3)
         LH    2,0(4)
         CLM   2,3,=H'66'
         BE    @@L730
         SLR   2,2
         IC    2,2(3)
         ST    2,88(13)
         ST    4,92(13)
         SLR   2,2
         IC    2,2(4)
         ST    2,96(13)
         MVC   100(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(SSUBREG)
         BALR  14,15
         LTR   15,15
         BE    @@L725
@@L729   EQU   *
         ST    15,0(5)
         B     @@L724
@@L725   EQU   *
         LH    2,0(4)
         CLM   2,3,=H'61'
         BE    @@L731
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2765'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L724
@@L731   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(SUBHRN)
         BALR  14,15
         STH   2,0(3)
         ST    15,4(3)
         MVC   8(4,3),8(4)
         NC    0(4,3),=F'-5'
         B     @@L724
@@L730   EQU   *
         ST    4,88(13)
         SLR   2,2
         IC    2,2(3)
         ST    2,92(13)
         MVC   96(4,13),8(3)
         MVC   100(4,13),=F'1'
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ADJADD)
         BALR  14,15
         B     @@L729
@@L724   EQU   *
         L     15,0(5)
* Function alter_subreg epilogue
         PDPEPIL
* Function alter_subreg literal pool
         DS    0F
         LTORG
* Function alter_subreg page table
         DS    0F
@@PGT25  EQU   *
         DC    A(@@PG25)
         DS    0F
* S-func walk_alter_subreg prologue
@@27     PDPPRLG CINDEX=26,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN26
         LTORG
@@FEN26  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG26   EQU   *
         LR    11,1
         L     10,=A(@@PGT26)
* Function walk_alter_subreg code
         L     4,0(11)
         L     3,0(4)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         LA    5,66(0,0)
         CLR   2,5
         BE    @@L737
         BH    @@L741
         LA    3,63(0,0)
         CLR   2,3
         BE    @@L738
@@L733   EQU   *
         L     15,0(4)
         B     @@L732
@@L738   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ALTER@SU)
         BALR  14,15
         B     @@L732
@@L741   EQU   *
         LA    5,75(0,0)
         CLR   2,5
         BE    @@L735
         LA    5,78(0,0)
         CLR   2,5
         BNE   @@L733
@@L735   EQU   *
         LR    2,3
         A     2,=F'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@27)
         BALR  14,15
         ST    15,0(2)
@@L742   EQU   *
         A     2,=F'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@27)
         BALR  14,15
         ST    15,0(2)
         B     @@L733
@@L737   EQU   *
         LR    2,3
         B     @@L742
@@L732   EQU   *
* Function walk_alter_subreg epilogue
         PDPEPIL
* Function walk_alter_subreg literal pool
         DS    0F
         LTORG
* Function walk_alter_subreg page table
         DS    0F
@@PGT26  EQU   *
         DC    A(@@PG26)
         DS    0F
* S-func alter_cond prologue
@@25     PDPPRLG CINDEX=27,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN27
         LTORG
@@FEN27  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG27   EQU   *
         LR    11,1
         L     10,=A(@@PGT27)
* Function alter_cond code
         L     4,0(11)
         SLR   5,5
         L     3,=A(CC@STATU)
         L     2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L803
@@L744   EQU   *
         L     2,0(3)
         N     2,=F'64'
         LTR   2,2
         BNE   @@L804
@@L745   EQU   *
         L     2,0(3)
         N     2,=F'2'
         LTR   2,2
         BE    @@L746
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         A     3,=F'-104'
         LA    2,7(0,0)
         CLR   3,2
         BH    @@L746
         MH    3,=H'4'
         L     2,=A(@@L757)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L757   EQU   *
         DC    A(@@L754)
         DC    A(@@L763)
         DC    A(@@L761)
         DC    A(@@L755)
         DC    A(@@L761)
         DC    A(@@L763)
         DC    A(@@L761)
         DC    A(@@L763)
@@L754   EQU   *
         MVC   0(2,4),=H'103'
@@L798   EQU   *
         LA    5,2(0,0)
@@L746   EQU   *
         L     2,=A(CC@STATU)
         L     2,0(2)
         N     2,=F'4'
         LTR   2,2
         BE    @@L758
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         A     3,=F'-104'
         LA    2,7(0,0)
         CLR   3,2
         BH    @@L758
         MH    3,=H'4'
         L     2,=A(@@L769)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L769   EQU   *
         DC    A(@@L761)
         DC    A(@@L767)
         DC    A(@@L765)
         DC    A(@@L763)
         DC    A(@@L761)
         DC    A(@@L767)
         DC    A(@@L765)
         DC    A(@@L763)
@@L761   EQU   *
         LA    15,1(0,0)
         B     @@L743
@@L767   EQU   *
         MVC   0(2,4),=H'102'
@@L799   EQU   *
         LA    5,2(0,0)
@@L758   EQU   *
         L     2,=A(CC@STATU)
         L     2,0(2)
         N     2,=F'8'
         LTR   2,2
         BE    @@L770
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         LA    3,109(0,0)
         CLR   2,3
         BE    @@L774
         BH    @@L778
         LA    15,1(0,0)
         LA    3,108(0,0)
         CLR   2,3
         BE    @@L743
@@L770   EQU   *
         L     6,=A(CC@STATU)
         L     3,0(6)
         LR    2,3
         N     2,=F'48'
         LTR   2,2
         BE    @@L779
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         LA    5,102(0,0)
         CLR   2,5
         BE    @@L782
         LA    5,103(0,0)
         CLR   2,5
         BE    @@L785
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2916'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L782   EQU   *
         L     2,0(6)
         N     2,=F'32'
         LA    3,104(0,0)
         LTR   2,2
         BNE   @@L784
         LA    3,107(0,0)
@@L784   EQU   *
         STH   3,0(4)
@@L801   EQU   *
         LA    5,2(0,0)
@@L779   EQU   *
         L     2,=A(CC@STATU)
         L     2,0(2)
         N     2,=F'128'
         LTR   2,2
         BE    @@L789
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         LA    3,105(0,0)
         CLR   2,3
         BE    @@L793
         BH    @@L797
         LA    3,104(0,0)
         CLR   2,3
         BE    @@L794
@@L789   EQU   *
         LR    15,5
         B     @@L743
@@L794   EQU   *
         MVC   0(2,4),=H'108'
@@L802   EQU   *
         LA    5,2(0,0)
         B     @@L789
@@L797   EQU   *
         LA    3,106(0,0)
         CLR   2,3
         BE    @@L791
         LA    3,107(0,0)
         CLR   2,3
         BNE   @@L789
         MVC   0(2,4),=H'111'
         B     @@L802
@@L791   EQU   *
         MVC   0(2,4),=H'110'
         B     @@L802
@@L793   EQU   *
         MVC   0(2,4),=H'109'
         B     @@L802
@@L785   EQU   *
         N     3,=F'32'
         LA    2,107(0,0)
         LTR   3,3
         BNE   @@L787
         LA    2,104(0,0)
@@L787   EQU   *
         STH   2,0(4)
         B     @@L801
@@L778   EQU   *
         LA    3,110(0,0)
         CLR   2,3
         BE    @@L773
         L     15,=F'-1'
         LA    3,111(0,0)
         CLR   2,3
         BE    @@L743
         B     @@L770
@@L773   EQU   *
         MVC   0(2,4),=H'103'
@@L800   EQU   *
         LA    5,2(0,0)
         B     @@L770
@@L774   EQU   *
         MVC   0(2,4),=H'102'
         B     @@L800
@@L765   EQU   *
         MVC   0(2,4),=H'103'
         B     @@L799
@@L763   EQU   *
         L     15,=F'-1'
         B     @@L743
@@L755   EQU   *
         MVC   0(2,4),=H'102'
         B     @@L798
@@L804   EQU   *
         LA    5,2(0,0)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(REVCOND)
         BALR  14,15
         STH   15,0(4)
         B     @@L745
@@L803   EQU   *
         LA    5,2(0,0)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         STH   15,0(4)
         B     @@L744
@@L743   EQU   *
* Function alter_cond epilogue
         PDPEPIL
* Function alter_cond literal pool
         DS    0F
         LTORG
* Function alter_cond page table
         DS    0F
@@PGT27  EQU   *
         DC    A(@@PG27)
@@LC27   EQU   *
         DC    C'invalid `asm'': '
         DC    X'0'
@@LC28   EQU   *
         DC    C'output_operand: '
         DC    X'0'
@@LC29   EQU   *
         DC    C'%s%s'
         DC    X'0'
@@LC30   EQU   *
         DC    C'%s'
         DC    X'0'
         DS    0F
* X-func output_operand_lossage prologue
OUTPUT@O PDPPRLG CINDEX=28,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN28
         LTORG
@@FEN28  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG28   EQU   *
         LR    11,1
         L     10,=A(@@PGT28)
* Function output_operand_lossage code
         L     2,=A(@@15)
         L     2,0(2)
         L     15,=A(@@LC27)
         LTR   2,2
         BNE   @@L807
         L     15,=A(@@LC28)
@@L807   EQU   *
         LA    2,104(,13)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC29)
         ST    15,96(13)
         MVC   100(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(ASPRINTF)
         BALR  14,15
         LA    2,108(,13)
         ST    2,88(13)
         MVC   92(4,13),104(13)
         LA    2,4(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(VASPRINT)
         BALR  14,15
         L     2,=A(@@15)
         L     2,0(2)
         LTR   2,2
         BE    @@L808
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC30)
         MVC   96(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(ERROR@FO)
         BALR  14,15
         B     @@L809
@@L808   EQU   *
         MVC   88(4,13),=A(@@LC30)
         MVC   92(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(INTERROR)
         BALR  14,15
@@L809   EQU   *
         MVC   88(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function output_operand_lossage epilogue
         PDPEPIL
* Function output_operand_lossage literal pool
         DS    0F
         LTORG
* Function output_operand_lossage page table
         DS    0F
@@PGT28  EQU   *
         DC    A(@@PG28)
@@LC31   EQU   *
         DC    X'5'
         DC    C'%s %d'
         DC    X'5'
         DC    C'%s'
         DC    X'0'
@@LC33   EQU   *
         DC    X'5'
         DC    C'Ýlength = %d¨'
         DC    X'0'
@@LC32   EQU   *
         DC    C'/%d'
         DC    X'0'
         DS    0F
* S-func output_asm_name prologue
@@28     PDPPRLG CINDEX=29,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN29
         LTORG
@@FEN29  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG29   EQU   *
         LR    11,1
         L     10,=A(@@PGT29)
* Function output_asm_name code
         L     6,=A(@@26)
         L     2,0(6)
         LTR   2,2
         BE    @@L810
         L     4,20(2)
         L     5,=V(ASM@OUT@)
         MVC   88(4,13),0(5)
         MVC   92(4,13),=A(@@LC31)
         MVC   96(4,13),=A(@@LC19)
         MVC   100(4,13),4(2)
         L     3,=V(INSN@DAT)
         LR    2,4
         SLL   2,2
         AR    2,4
         SLL   2,2
         L     4,0(2,3)
         ST    4,104(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         IC    2,18(3,2)
         CLM   2,1,=XL1'01'
         BH    @@L813
@@L812   EQU   *
         MVC   88(4,13),0(6)
         LA    1,88(,13)
         L     15,=A(GET@ATTR)
         BALR  14,15
         MVC   88(4,13),0(5)
         MVC   92(4,13),=A(@@LC33)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   0(4,6),=F'0'
         B     @@L810
@@L813   EQU   *
         MVC   88(4,13),0(5)
         MVC   92(4,13),=A(@@LC32)
         L     2,=V(WHICH@AL)
         L     2,0(2)
         A     2,=F'1'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L812
@@L810   EQU   *
* Function output_asm_name epilogue
         PDPEPIL
* Function output_asm_name literal pool
         DS    0F
         LTORG
* Function output_asm_name page table
         DS    0F
@@PGT29  EQU   *
         DC    A(@@PG29)
         DS    0F
* S-func get_mem_expr_from_op prologue
@@29     PDPPRLG CINDEX=30,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN30
         LTORG
@@FEN30  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG30   EQU   *
         LR    11,1
         L     10,=A(@@PGT30)
* Function get_mem_expr_from_op code
         L     3,0(11)
         L     4,4(11)
         MVC   0(4,4),=F'0'
         LR    15,3
         LTR   3,3
         BE    @@L814
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L836
@@L816   EQU   *
         SLR   15,15
         CLM   2,3,=H'66'
         BNE   @@L814
         L     2,8(3)
         LTR   2,2
         BE    @@L819
         L     2,4(2)
         LR    15,2
         LTR   2,2
         BNE   @@L814
@@L819   EQU   *
         MVC   0(4,4),=F'1'
         L     3,4(3)
         ST    3,88(13)
         LA    4,96(,13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@29)
         BALR  14,15
         LTR   15,15
         BE    @@L824
         L     2,96(13)
         LTR   2,2
         BE    @@L814
@@L824   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'75'
         BE    @@L837
@@L826   EQU   *
         L     15,=V(RTX@CLAS)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(15,2)
         LA    2,15(,2)
         CLM   2,1,=XL1'01'
         BH    @@L835
@@L831   EQU   *
         L     3,4(3)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         IC    2,0(15,2)
         LA    2,15(,2)
         CLM   2,1,=XL1'01'
         BNH   @@L831
@@L835   EQU   *
         ST    3,88(13)
         LA    2,96(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@29)
         BALR  14,15
         L     2,96(13)
         LTR   2,2
         BE    @@L814
         SLR   15,15
         B     @@L814
@@L837   EQU   *
         MVC   88(4,13),8(3)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@29)
         BALR  14,15
         LTR   15,15
         BNE   @@L814
         B     @@L826
@@L836   EQU   *
         L     15,8(3)
         LA    5,19(0,0)
         CLR   15,5
         BNH   @@L816
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     2,44(2)
         MH    15,=H'4'
         L     15,0(15,2)
@@L814   EQU   *
* Function get_mem_expr_from_op epilogue
         PDPEPIL
* Function get_mem_expr_from_op literal pool
         DS    0F
         LTORG
* Function get_mem_expr_from_op page table
         DS    0F
@@PGT30  EQU   *
         DC    A(@@PG30)
@@LC34   EQU   *
         DC    C'%c%s %s'
         DC    X'0'
         DS    0F
* S-func output_asm_operand_names prologue
@@30     PDPPRLG CINDEX=31,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN31
         LTORG
@@FEN31  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG31   EQU   *
         LR    11,1
         L     10,=A(@@PGT31)
* Function output_asm_operand_names code
         L     8,0(11)
         L     7,4(11)
         L     6,8(11)
         SLR   3,3
         LR    4,3
         CR    3,6
         BNL   @@L852
@@L850   EQU   *
         LR    2,3
         MH    2,=H'4'
         L     2,0(2,7)
         SLL   2,2
         L     2,0(2,8)
         ST    2,88(13)
         LA    2,112(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@29)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L841
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC34)
         LA    2,107(0,0)
         LTR   4,4
         BNE   @@L845
         LA    2,5(0,0)
@@L845   EQU   *
         ST    2,96(13)
         L     2,=A(@@LC8)
         LTR   4,4
         BNE   @@L847
         L     2,=A(@@LC19)
@@L847   EQU   *
         ST    2,100(13)
         L     15,=A(@@LC19)
         L     2,112(13)
         LTR   2,2
         BNE   @@L849
         L     15,=A(@@LC8)
@@L849   EQU   *
         ST    15,104(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(PRINT@ME)
         BALR  14,15
         LA    4,1(0,0)
@@L841   EQU   *
         A     3,=F'1'
         CR    3,6
         BL    @@L850
@@L852   EQU   *
* Function output_asm_operand_names epilogue
         PDPEPIL
* Function output_asm_operand_names literal pool
         DS    0F
         LTORG
* Function output_asm_operand_names page table
         DS    0F
@@PGT31  EQU   *
         DC    A(@@PG31)
@@LC37   EQU   *
         DC    C'operand number out of range'
         DC    X'0'
@@LC38   EQU   *
         DC    C'invalid %%-code'
         DC    X'0'
@@LC35   EQU   *
         DC    C'%d'
         DC    X'0'
@@LC36   EQU   *
         DC    C'operand number missing after %%-letter'
         DC    X'0'
         DS    0F
* X-func oasminsn prologue
OASMINSN PDPPRLG CINDEX=32,FRAME=256,BASER=12,ENTRY=YES
         B     @@FEN32
         LTORG
@@FEN32  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG32   EQU   *
         LR    11,1
         L     10,=A(@@PGT32)
* Function oasminsn code
         L     3,0(11)
         L     8,4(11)
         SLR   9,9
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         L     14,=A(@@L853)
         BER   14
         LA    2,224(,13)
         ST    2,88(13)
         ST    9,92(13)
         MVC   96(4,13),=F'30'
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         LR    5,3
         MVC   88(4,13),=F'5'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         SLR   4,4
         IC    4,0(3)
         A     5,=F'1'
         LTR   4,4
         BE    @@L909
@@L905   EQU   *
         LA    3,21(0,0)
         CLR   4,3
         BE    @@L859
         LA    2,108(0,0)
         CLR   4,2
         BE    @@L862
@@L903   EQU   *
         L     12,0(,10)
         ST    4,88(13)
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
@@L855   EQU   *
         SLR   4,4
         IC    4,0(5)
         A     5,=F'1'
         LTR   4,4
         BNE   @@L905
@@L909   EQU   *
         L     2,=V(FLAG@VER)
         L     2,0(2)
         LTR   2,2
         BNE   @@L915
@@L906   EQU   *
         L     2,=V(FLAG@PRI)
         L     2,0(2)
         LTR   2,2
         BNE   @@L916
@@L907   EQU   *
         MVC   88(4,13),=F'21'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         L     14,=A(@@L853)
         BR    14
@@L916   EQU   *
         LA    1,88(,13)
         L     15,=A(@@28)
         BALR  14,15
         B     @@L907
@@L915   EQU   *
         ST    8,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(@@30)
         BALR  14,15
         B     @@L906
@@L862   EQU   *
         IC    3,0(5)
         CLM   3,1,=XL1'6C'
         BE    @@L917
         CLM   3,1,=XL1'7E'
         BE    @@L918
         L     7,=V(@SCH@IST)
         LR    6,3
         N     6,=XL4'000000FF'
         LR    2,6
         MH    2,=H'2'
         LH    2,0(2,7)
         N     2,=F'136'
         CH    2,=H'0'
         BNE   @@L919
         LR    2,3
         N     2,=XL4'000000FF'
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    2,0(2,3)
         N     2,=F'4'
         CH    2,=H'0'
         BE    @@L893
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ATOI)
         BALR  14,15
         LR    4,15
         L     2,=A(@@15)
         L     2,0(2)
         LTR   2,2
         BE    @@L894
         LTR   15,15
         BL    @@L895
         L     2,=A(@@24)
         CL    15,0(2)
         BL    @@L894
@@L895   EQU   *
         MVC   88(4,13),=A(@@LC37)
         LA    1,88(,13)
         L     15,=A(OUTPUT@O)
         BALR  14,15
@@L896   EQU   *
         LA    3,104(,13)
         IC    2,120(3,4)
         CLM   2,1,=XL1'00'
         BNE   @@L897
         LR    2,9
         MH    2,=H'4'
         ST    4,104(13,2)
         A     9,=F'1'
@@L897   EQU   *
         LA    2,1(0,0)
         STC   2,120(3,4)
         SLR   2,2
         IC    2,0(5)
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    2,0(2,3)
         N     2,=F'4'
         CH    2,=H'0'
         BE    @@L855
@@L901   EQU   *
         A     5,=F'1'
         SLR   2,2
         IC    2,0(5)
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    2,0(2,3)
         N     2,=F'4'
         CH    2,=H'0'
         BNE   @@L901
         B     @@L855
@@L894   EQU   *
         LR    2,4
         MH    2,=H'4'
         L     2,0(2,8)
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         B     @@L896
@@L893   EQU   *
         MVC   88(4,13),=A(@@LC38)
         LA    1,88(,13)
         L     15,=A(OUTPUT@O)
         BALR  14,15
         B     @@L855
@@L919   EQU   *
         A     5,=F'1'
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ATOI)
         BALR  14,15
         LR    4,15
         SLR   2,2
         IC    2,0(5)
         MH    2,=H'2'
         LH    2,0(2,7)
         N     2,=F'4'
         CH    2,=H'0'
         BE    @@L920
         L     2,=A(@@15)
         L     2,0(2)
         LTR   2,2
         BE    @@L870
         LTR   15,15
         BL    @@L871
         L     2,=A(@@24)
         CL    15,0(2)
         BL    @@L870
@@L871   EQU   *
         MVC   88(4,13),=A(@@LC37)
@@L914   EQU   *
         LA    1,88(,13)
         L     15,=A(OUTPUT@O)
         BALR  14,15
@@L869   EQU   *
         LA    3,104(,13)
         IC    2,120(3,4)
         CLM   2,1,=XL1'00'
         BNE   @@L887
         LR    2,9
         MH    2,=H'4'
         ST    4,104(13,2)
         A     9,=F'1'
@@L887   EQU   *
         LA    2,1(0,0)
         STC   2,120(3,4)
         SLR   2,2
         IC    2,0(5)
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    2,0(2,3)
         N     2,=F'4'
         CH    2,=H'0'
         BE    @@L855
@@L891   EQU   *
         A     5,=F'1'
         SLR   2,2
         IC    2,0(5)
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    2,0(2,3)
         N     2,=F'4'
         CH    2,=H'0'
         BNE   @@L891
         B     @@L855
@@L870   EQU   *
         LA    2,147(0,0)
         CLR   6,2
         BE    @@L921
         LA    3,129(0,0)
         CLR   6,3
         BE    @@L922
         LA    2,131(0,0)
         CLR   6,2
         BE    @@L923
         LA    2,149(0,0)
         CLR   6,2
         BE    @@L924
         LR    2,4
         MH    2,=H'4'
         L     2,0(2,8)
         ST    2,88(13)
         ST    6,92(13)
@@L912   EQU   *
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         B     @@L869
@@L924   EQU   *
         LR    6,4
         MH    6,=H'4'
         L     3,0(6,8)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L925
         MVC   88(4,13),=F'96'
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
@@L913   EQU   *
         MVC   88(4,13),0(2)
         L     6,0(6,8)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         B     @@L869
@@L925   EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC35)
         L     3,4(3)
         LCR   2,3
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L869
@@L923   EQU   *
         LR    6,4
         MH    6,=H'4'
         L     15,0(6,8)
         LH    3,0(15)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L879
         CLM   3,3,=H'54'
         BE    @@L879
         CLM   3,3,=H'55'
         BE    @@L879
         CLM   3,3,=H'58'
         BE    @@L926
@@L880   EQU   *
         CLM   3,3,=H'58'
         BE    @@L927
@@L878   EQU   *
         L     6,0(6,8)
         ST    6,88(13)
         MVC   92(4,13),=F'131'
         B     @@L912
@@L927   EQU   *
         L     2,4(15)
         L     2,4(2)
         L     2,0(2)
         N     2,=F'-65520'
         L     3,=F'4456448'
         CLR   2,3
         BNE   @@L878
@@L879   EQU   *
         L     2,=V(ASM@OUT@)
         B     @@L913
@@L926   EQU   *
         L     2,4(15)
         L     2,4(2)
         LH    2,0(2)
         CLM   2,3,=H'67'
         BNE   @@L880
         B     @@L879
@@L922   EQU   *
         LR    2,4
         MH    2,=H'4'
         L     2,0(2,8)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(OADDRESS)
         BALR  14,15
         B     @@L869
@@L921   EQU   *
         LR    2,4
         MH    2,=H'4'
         L     2,0(2,8)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(OASMLAB)
         BALR  14,15
         B     @@L869
@@L920   EQU   *
         MVC   88(4,13),=A(@@LC36)
         B     @@L914
@@L918   EQU   *
         A     5,=F'1'
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC35)
         L     2,=A(@@2)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L855
@@L917   EQU   *
         A     5,=F'1'
         B     @@L903
@@L859   EQU   *
         L     2,=V(FLAG@VER)
         L     2,0(2)
         LTR   2,2
         BNE   @@L928
@@L860   EQU   *
         L     2,=V(FLAG@PRI)
         L     2,0(2)
         LTR   2,2
         BNE   @@L929
@@L861   EQU   *
         SLR   9,9
         LA    3,224(,13)
         ST    3,88(13)
         ST    9,92(13)
         MVC   96(4,13),=F'30'
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         B     @@L903
@@L929   EQU   *
         LA    1,88(,13)
         L     15,=A(@@28)
         BALR  14,15
         B     @@L861
@@L928   EQU   *
         ST    8,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(@@30)
         BALR  14,15
         B     @@L860
@@L853   EQU   *
* Function oasminsn epilogue
         PDPEPIL
* Function oasminsn literal pool
         DS    0F
         LTORG
* Function oasminsn page table
         DS    0F
@@PGT32  EQU   *
         DC    A(@@PG32)
@@LC39   EQU   *
         DC    C'`%%l'' operand isn''t a label'
         DC    X'0'
         DS    0F
* X-func oasmlab prologue
OASMLAB  PDPPRLG CINDEX=33,FRAME=360,BASER=12,ENTRY=YES
         B     @@FEN33
         LTORG
@@FEN33  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG33   EQU   *
         LR    11,1
         L     10,=A(@@PGT33)
* Function oasmlab code
         L     15,0(11)
         LH    2,0(15)
         CLM   2,3,=H'67'
         BE    @@L935
@@L931   EQU   *
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L933
         CLM   2,3,=H'37'
         BE    @@L936
@@L932   EQU   *
         MVC   88(4,13),=A(@@LC39)
         LA    1,88(,13)
         L     15,=A(OUTPUT@O)
         BALR  14,15
         B     @@L934
@@L936   EQU   *
         L     2,20(15)
         L     3,=F'-88'
         CLR   2,3
         BNE   @@L932
@@L933   EQU   *
         LA    2,104(,13)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC7)
         MVC   96(4,13),=A(@@LC5)
         MVC   100(4,13),24(15)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         B     @@L934
@@L935   EQU   *
         L     15,4(15)
         B     @@L931
@@L934   EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         LA    2,104(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ASSNAME)
         BALR  14,15
* Function oasmlab epilogue
         PDPEPIL
* Function oasmlab literal pool
         DS    0F
         LTORG
* Function oasmlab page table
         DS    0F
@@PGT33  EQU   *
         DC    A(@@PG33)
         DS    0F
@@32     EQU   *
         DC    4X'00'
@@LC46   EQU   *
         DC    C'=F''%d'''
         DC    X'0'
@@LC47   EQU   *
         DC    C'=XL8''00000000'
         DC    X'0'
@@LC49   EQU   *
         DC    C'%08X'''
         DC    X'0'
@@LC48   EQU   *
         DC    C'=XL8''FFFFFFFF'
         DC    X'0'
@@LC45   EQU   *
         DC    C'=H''%d'''
         DC    X'0'
@@LC44   EQU   *
         DC    C'%02X'
         DC    X'0'
@@LC51   EQU   *
         DC    C'=XL8''%08X%08X'''
         DC    X'0'
@@LC53   EQU   *
         DC    C'=D''%s'''
         DC    X'0'
@@LC52   EQU   *
         DC    C'=E''%s'''
         DC    X'0'
@@LC50   EQU   *
         DC    C'=XL4''%08X'''
         DC    X'0'
@@LC56   EQU   *
         DC    C'=F'''
         DC    X'0'
@@LC57   EQU   *
         DC    C''''
         DC    X'0'
@@LC41   EQU   *
         DC    C'=V('
         DC    X'0'
@@LC54   EQU   *
         DC    C')'
         DC    X'15'
         DC    X'5'
         DC    C'LA'
         DC    X'5'
         DC    C'%s,%d(0,%s)'
         DC    X'0'
@@LC55   EQU   *
         DC    C')'
         DC    X'15'
         DC    X'5'
         DC    C'A'
         DC    X'5'
         DC    C'%s,=F''%d'''
         DC    X'0'
@@LC43   EQU   *
         DC    C'=A('
         DC    X'0'
@@LC42   EQU   *
         DC    C')'
         DC    X'0'
@@LC40   EQU   *
         DC    C'0'
         DC    X'0'
         DS    0F
* S-func output_operand prologue
@@31     PDPPRLG CINDEX=34,FRAME=128,BASER=12,ENTRY=NO
         B     @@FEN34
         LTORG
@@FEN34  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG34   EQU   *
         LR    11,1
         L     10,=A(@@PGT34)
* Function output_operand code
         L     4,4(11)
         L     2,0(11)
         LTR   2,2
         BE    @@L938
         LH    2,0(2)
         CLM   2,3,=H'63'
         L     14,=A(@@L1017)
         BER   14
@@L938   EQU   *
         L     12,0(,10)
         L     3,0(11)
         LTR   3,3
         BE    @@L939
         LH    2,0(3)
         CLM   2,3,=H'61'
         L     14,=A(@@L1018)
         BER   14
@@L939   EQU   *
         L     12,0(,10)
         L     15,0(11)
         LH    3,0(15)
         N     3,=XL4'0000FFFF'
         A     3,=F'-54'
         LA    2,14(0,0)
         CLR   3,2
         L     14,=A(@@L1000)
         BHR   14
         MH    3,=H'4'
         L     2,=A(@@L1001)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1001  EQU   *
         DC    A(@@L957)
         DC    A(@@L972)
         DC    A(@@L1000)
         DC    A(@@L1000)
         DC    A(@@L985)
         DC    A(@@L1000)
         DC    A(@@L1000)
         DC    A(@@L941)
         DC    A(@@L1000)
         DC    A(@@L1000)
         DC    A(@@L1000)
         DC    A(@@L1000)
         DC    A(@@L944)
         DC    A(@@L954)
         DC    A(@@L954)
@@L941   EQU   *
         LA    3,213(0,0)
         CLR   4,3
         BE    @@L1019
         MVC   88(4,13),=A(@@32)
         L     3,4(15)
         SLL   3,2
         L     2,=V(REG@NAME)
         L     2,0(3,2)
         ST    2,92(13)
@@L1004  EQU   *
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC30)
         MVC   96(4,13),=A(@@32)
@@L1007  EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L937)
         BR    14
@@L1019  EQU   *
         MVC   88(4,13),=A(@@32)
         L     2,4(15)
         SLL   2,2
         A     2,=V(REG@NAME)
         LA    2,4(0,2)
         MVC   92(4,13),0(2)
         B     @@L1004
@@L957   EQU   *
         LA    3,194(0,0)
         CLR   4,3
         BE    @@L1020
         LA    2,231(0,0)
         CLR   4,2
         BE    @@L1021
         LA    3,136(0,0)
         CLR   4,3
         BE    @@L1022
         LA    2,200(0,0)
         CLR   4,2
         BE    @@L1023
         LA    3,210(0,0)
         CLR   4,3
         BE    @@L1024
         LA    2,230(0,0)
         CLR   4,2
         BE    @@L1025
         L     2,=V(MP@LIT)
         L     3,0(2)
         A     3,=F'4'
         ST    3,0(2)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC46)
         MVC   96(4,13),4(15)
         B     @@L1007
@@L1025  EQU   *
         L     2,=V(MP@LIT)
         L     3,0(2)
         A     3,=F'8'
         ST    3,0(2)
         L     2,4(15)
         LTR   2,2
         BL    @@L969
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC47)
@@L1005  EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC49)
         L     2,0(11)
@@L1009  EQU   *
         L     12,0(,10)
         MVC   96(4,13),4(2)
         B     @@L1007
@@L969   EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC48)
         B     @@L1005
@@L1024  EQU   *
         L     2,=V(MP@LIT)
         L     3,0(2)
         A     3,=F'4'
         ST    3,0(2)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC46)
@@L1014  EQU   *
         LH    15,6(15)
         SLL   15,16
         SRA   15,16
         ST    15,96(13)
         B     @@L1007
@@L1023  EQU   *
         L     2,=V(MP@LIT)
         L     3,0(2)
         A     3,=F'2'
         ST    3,0(2)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC45)
         B     @@L1014
@@L1022  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC35)
         B     @@L1014
@@L1021  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC44)
@@L1016  EQU   *
         SLR   2,2
         IC    2,7(15)
@@L1012  EQU   *
         L     12,0(,10)
         ST    2,96(13)
         B     @@L1007
@@L1020  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC35)
         B     @@L1016
@@L972   EQU   *
         IC    2,2(15)
         CLM   2,1,=XL1'05'
         BE    @@L1026
         CLM   2,1,=XL1'0F'
         BE    @@L1027
         CLM   2,1,=XL1'10'
         BE    @@L1028
         L     2,=V(MP@LIT)
         L     3,0(2)
         A     3,=F'8'
         ST    3,0(2)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC51)
         MVC   96(4,13),12(15)
         MVC   100(4,13),8(15)
         B     @@L1007
@@L1028  EQU   *
         LD    0,8(15)
         L     3,=V(MP@LIT)
         L     2,0(3)
         A     2,=F'8'
         ST    2,0(3)
         STD   0,88(13)
         LA    1,88(,13)
         L     15,=V(MVS@MAKE)
         BALR  14,15
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC53)
@@L1015  EQU   *
         ST    15,96(13)
         B     @@L1007
@@L1027  EQU   *
         LD    0,8(15)
         L     3,=V(MP@LIT)
         L     2,0(3)
         A     2,=F'4'
         ST    2,0(3)
         STD   0,88(13)
         LA    1,88(,13)
         L     15,=V(MVS@MAKE)
         BALR  14,15
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC52)
         B     @@L1015
@@L1026  EQU   *
         LA    3,212(0,0)
         CLR   4,3
         BE    @@L1029
         LA    2,211(0,0)
         CLR   4,2
         BE    @@L1030
         L     2,=V(MP@LIT)
         L     3,0(2)
         A     3,=F'8'
         ST    3,0(2)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC51)
         MVC   96(4,13),8(15)
         MVC   100(4,13),12(15)
         B     @@L1007
@@L1030  EQU   *
         L     2,=V(MP@LIT)
         L     3,0(2)
         A     3,=F'4'
         ST    3,0(2)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC50)
         MVC   96(4,13),12(15)
         B     @@L1007
@@L1029  EQU   *
         L     2,=V(MP@LIT)
         L     3,0(2)
         A     3,=F'4'
         ST    3,0(2)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC50)
         MVC   96(4,13),8(15)
         B     @@L1007
@@L985   EQU   *
         L     15,4(15)
         LH    2,0(15)
         CLM   2,3,=H'75'
         BE    @@L1031
@@L986   EQU   *
         L     2,=V(MP@LIT)
         L     3,0(2)
         A     3,=F'4'
         ST    3,0(2)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC56)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC57)
@@L1006  EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L937)
         BR    14
@@L1031  EQU   *
         L     4,4(15)
         LH    2,0(4)
         CLM   2,3,=H'68'
         BNE   @@L986
         L     3,=V(MP@LIT)
         L     2,0(3)
         A     2,=F'4'
         ST    2,0(3)
         L     2,0(4)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BE    @@L987
         L     2,8(15)
         L     6,4(2)
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC41)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,0(11)
         L     2,4(2)
         L     2,4(2)
         MVC   88(4,13),4(2)
         LA    5,112(,13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(MVS@GET@)
         BALR  14,15
         LTR   15,15
         BE    @@L1032
@@L988   EQU   *
         LR    4,5
         IC    2,0(5)
         CLM   2,1,=XL1'00'
         BE    @@L1003
@@L995   EQU   *
         IC    3,0(4)
         CLM   3,1,=XL1'6D'
         BE    @@L993
         N     3,=XL4'000000FF'
         L     2,=V(@SCH@TOU)
         IC    3,0(2,3)
@@L994   EQU   *
         STC   3,0(4)
         A     4,=F'1'
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BNE   @@L995
@@L1003  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC30)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         LA    3,4095(0,0)
         CLR   6,3
         BH    @@L996
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC54)
         MVC   96(4,13),=A(@@32)
         ST    6,100(13)
         MVC   104(4,13),=A(@@32)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L997   EQU   *
         L     2,0(11)
         L     2,4(2)
         L     2,4(2)
@@L1008  EQU   *
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(MVS@MARK)
         BALR  14,15
         B     @@L937
@@L996   EQU   *
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC55)
         MVC   96(4,13),=A(@@32)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L997
@@L993   EQU   *
         LA    3,124(0,0)
         B     @@L994
@@L1032  EQU   *
         ST    5,88(13)
         L     2,0(11)
         L     2,4(2)
         L     2,4(2)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         B     @@L988
@@L987   EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC43)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC42)
         B     @@L1006
@@L1000  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3355'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L937
@@L944   EQU   *
         L     3,4(15)
         LA    2,214(0,0)
         CLR   4,2
         BE    @@L1033
         LA    2,217(0,0)
         CLR   4,2
         BE    @@L1034
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(OADDRESS)
         BALR  14,15
         B     @@L937
@@L1034  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'75'
         BE    @@L1035
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC30)
         L     3,4(3)
@@L1010  EQU   *
         SLL   3,2
         L     2,=V(REG@NAME)
         L     2,0(3,2)
         B     @@L1012
@@L1035  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC30)
         L     2,4(3)
         L     3,4(2)
         B     @@L1010
@@L1033  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'75'
         BE    @@L1036
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC40)
         B     @@L1006
@@L1036  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC35)
         L     2,8(3)
         B     @@L1009
@@L954   EQU   *
         L     3,=V(MP@LIT)
         L     2,0(3)
         A     2,=F'4'
         ST    2,0(3)
         L     2,0(15)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BE    @@L987
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC41)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC42)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,0(11)
         B     @@L1008
@@L1018  EQU   *
         L     2,4(3)
         LA    3,19(0,0)
         CLR   2,3
         BNH   @@L939
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3353'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L939
@@L1017  EQU   *
         ST    11,88(13)
         LA    1,88(,13)
         L     15,=V(ALTER@SU)
         BALR  14,15
         ST    15,0(11)
         B     @@L938
@@L937   EQU   *
* Function output_operand epilogue
         PDPEPIL
* Function output_operand literal pool
         DS    0F
         LTORG
* Function output_operand page table
         DS    0F
@@PGT34  EQU   *
         DC    A(@@PG34)
@@LC60   EQU   *
         DC    C'(%s,%s)'
         DC    X'0'
@@LC61   EQU   *
         DC    C'(%s)'
         DC    X'0'
@@LC59   EQU   *
         DC    C'@@L%d'
         DC    X'0'
@@LC58   EQU   *
         DC    C'0(%s)'
         DC    X'0'
         DS    0F
* X-func oaddress prologue
OADDRESS PDPPRLG CINDEX=35,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN35
         LTORG
@@FEN35  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG35   EQU   *
         LR    11,1
         L     10,=A(@@PGT35)
* Function oaddress code
         ST    11,88(13)
         LA    1,88(,13)
         L     15,=A(@@27)
         BALR  14,15
         L     15,0(11)
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         LA    3,61(0,0)
         CLR   2,3
         BE    @@L1039
         LA    3,75(0,0)
         CLR   2,3
         BE    @@L1040
         L     3,=V(MP@LIT)
         L     2,0(3)
         A     2,=F'4'
         ST    2,0(3)
         L     2,0(15)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BE    @@L1068
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC41)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC42)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,0(11)
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(MVS@MARK)
         BALR  14,15
         B     @@L1037
@@L1068  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC43)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC42)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1037
@@L1040  EQU   *
         SLR   5,5
         LR    6,5
         LR    4,5
         L     2,4(15)
         LH    3,0(2)
         CLM   3,3,=H'75'
         BE    @@L1073
         CLM   3,3,=H'61'
         BE    @@L1074
         LR    4,2
@@L1046  EQU   *
         L     15,8(15)
@@L1044  EQU   *
         LH    2,0(15)
         CLM   2,3,=H'75'
         BE    @@L1075
         CLM   2,3,=H'61'
         BE    @@L1076
         LR    4,15
@@L1056  EQU   *
         LTR   4,4
         BE    @@L1061
         LH    2,0(4)
         CLM   2,3,=H'67'
         BE    @@L1077
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
@@L1064  EQU   *
         LTR   6,6
         BE    @@L1065
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC60)
         L     3,=V(REG@NAME)
         L     2,4(6)
         SLL   2,2
         L     2,0(2,3)
         ST    2,96(13)
         L     2,4(5)
         SLL   2,2
         L     3,0(2,3)
         ST    3,100(13)
@@L1071  EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1037
@@L1065  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC61)
         L     3,4(5)
@@L1072  EQU   *
         SLL   3,2
         L     2,=V(REG@NAME)
         L     2,0(3,2)
         ST    2,96(13)
         B     @@L1071
@@L1077  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC59)
         L     2,4(4)
         MVC   96(4,13),24(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1064
@@L1061  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC40)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1064
@@L1076  EQU   *
         LTR   5,5
         BE    @@L1058
         LR    6,15
         B     @@L1056
@@L1058  EQU   *
         LR    5,15
         B     @@L1056
@@L1075  EQU   *
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L1078
         LR    4,3
@@L1051  EQU   *
         L     3,8(15)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L1079
         LR    4,3
         B     @@L1056
@@L1079  EQU   *
         LTR   5,5
         BE    @@L1053
         LR    6,3
         B     @@L1056
@@L1053  EQU   *
         LR    5,3
         B     @@L1056
@@L1078  EQU   *
         LTR   5,5
         BE    @@L1049
         LR    6,3
         B     @@L1051
@@L1049  EQU   *
         LR    5,3
         B     @@L1051
@@L1074  EQU   *
         LR    5,2
         B     @@L1046
@@L1073  EQU   *
         L     3,8(15)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L1080
         LR    4,3
@@L1043  EQU   *
         L     15,4(15)
         B     @@L1044
@@L1080  EQU   *
         LR    5,3
         B     @@L1043
@@L1039  EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC58)
         L     3,4(15)
         B     @@L1072
@@L1037  EQU   *
* Function oaddress epilogue
         PDPEPIL
* Function oaddress literal pool
         DS    0F
         LTORG
* Function oaddress page table
         DS    0F
@@PGT35  EQU   *
         DC    A(@@PG35)
@@LC63   EQU   *
         DC    C'0x%x'
         DC    X'0'
@@LC62   EQU   *
         DC    C'0x%x%08x'
         DC    X'0'
@@LC64   EQU   *
         DC    C'floating constant misused'
         DC    X'0'
@@LC65   EQU   *
         DC    C'+'
         DC    X'0'
@@LC66   EQU   *
         DC    C'-'
         DC    X'0'
@@LC67   EQU   *
         DC    C'invalid expression as operand'
         DC    X'0'
         DS    0F
* X-func oaddrc prologue
OADDRC   PDPPRLG CINDEX=36,FRAME=360,BASER=12,ENTRY=YES
         B     @@FEN36
         LTORG
@@FEN36  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG36   EQU   *
         LR    11,1
         L     10,=A(@@PGT36)
* Function oaddrc code
         L     5,0(11)
         L     4,4(11)
@@L1082  EQU   *
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         A     3,=F'-36'
         LA    2,85(0,0)
         CLR   3,2
         BH    @@L1113
         MH    3,=H'4'
         L     2,=A(@@L1114)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1114  EQU   *
         DC    A(@@L1087)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1088)
         DC    A(@@L1091)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1112)
         DC    A(@@L1084)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1112)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1086)
         DC    A(@@L1085)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1098)
         DC    A(@@L1104)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1113)
         DC    A(@@L1112)
         DC    A(@@L1112)
@@L1084  EQU   *
         MVC   88(4,13),=F'75'
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L1081
@@L1087  EQU   *
         LA    2,104(,13)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC7)
         MVC   96(4,13),=A(@@LC5)
         MVC   100(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    5,88(13)
         ST    2,92(13)
@@L1119  EQU   *
         LA    1,88(,13)
         L     15,=V(ASSNAME)
         BALR  14,15
         B     @@L1081
@@L1088  EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC35)
         MVC   96(4,13),4(4)
@@L1118  EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1081
@@L1091  EQU   *
         IC    2,2(4)
         CLM   2,1,=XL1'00'
         BNE   @@L1092
         L     2,12(4)
         LTR   2,2
         BNE   @@L1120
         L     2,8(4)
         LTR   2,2
         BL    @@L1121
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC35)
@@L1117  EQU   *
         MVC   96(4,13),8(4)
         B     @@L1118
@@L1121  EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC63)
         B     @@L1117
@@L1120  EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC62)
         MVC   96(4,13),12(4)
         MVC   100(4,13),8(4)
         B     @@L1118
@@L1092  EQU   *
         MVC   88(4,13),=A(@@LC64)
@@L1116  EQU   *
         LA    1,88(,13)
         L     15,=A(OUTPUT@O)
         BALR  14,15
         B     @@L1081
@@L1086  EQU   *
         L     4,4(4)
         B     @@L1087
@@L1085  EQU   *
         ST    5,88(13)
         MVC   92(4,13),4(4)
         B     @@L1119
@@L1098  EQU   *
         L     2,4(4)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BE    @@L1122
         ST    5,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L1123
@@L1103  EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC65)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L1107  EQU   *
         ST    5,88(13)
         MVC   92(4,13),8(4)
@@L1115  EQU   *
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         B     @@L1081
@@L1123  EQU   *
         L     2,4(3)
         LTR   2,2
         BNL   @@L1103
         B     @@L1107
@@L1122  EQU   *
         ST    5,88(13)
         MVC   92(4,13),8(4)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         L     2,4(4)
         L     2,4(2)
         LTR   2,2
         BL    @@L1112
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC65)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L1112  EQU   *
         ST    5,88(13)
         MVC   92(4,13),4(4)
         B     @@L1115
@@L1104  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SFYSUBTR)
         BALR  14,15
         LR    4,15
         LH    2,0(15)
         CLM   2,3,=H'76'
         BNE   @@L1082
         ST    5,88(13)
         MVC   92(4,13),4(15)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC66)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,8(4)
         LH    3,0(2)
         CLM   3,3,=H'54'
         BE    @@L1124
@@L1108  EQU   *
         CLM   3,3,=H'59'
         BE    @@L1107
         CLM   3,3,=H'68'
         BE    @@L1107
         L     2,=V(TARGETM)
         MVC   88(4,13),0(2)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),8(4)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         MVC   88(4,13),4(2)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L1081
@@L1124  EQU   *
         L     2,4(2)
         LTR   2,2
         BNL   @@L1107
         B     @@L1108
@@L1113  EQU   *
         MVC   88(4,13),=A(@@LC67)
         B     @@L1116
@@L1081  EQU   *
* Function oaddrc epilogue
         PDPEPIL
* Function oaddrc literal pool
         DS    0F
         LTORG
* Function oaddrc page table
         DS    0F
@@PGT36  EQU   *
         DC    A(@@PG36)
@@LC68   EQU   *
         DC    C'%%'
         DC    X'0'
         DS    0F
* X-func asm_fprintf prologue
ASM@FPRI PDPPRLG CINDEX=37,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN37
         LTORG
@@FEN37  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG37   EQU   *
         LR    11,1
         L     10,=A(@@PGT37)
* Function asm_fprintf code
         L     6,0(11)
         LA    5,8(,11)
         MVI   104(13),108
         LA    3,4(,11)
         L     2,0(3)
         IC    15,0(2)
         A     2,=F'1'
         ST    2,0(3)
         CLM   15,1,=XL1'00'
         BE    @@L1161
@@L1159  EQU   *
         LR    2,15
         N     2,=XL4'000000FF'
         LA    4,108(0,0)
         CLR   2,4
         BE    @@L1167
         ST    2,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
@@L1126  EQU   *
         LA    3,4(,11)
         L     2,0(3)
         IC    15,0(2)
         A     2,=F'1'
         ST    2,0(3)
         CLM   15,1,=XL1'00'
         BNE   @@L1159
         B     @@L1161
@@L1167  EQU   *
         L     2,0(3)
         IC    15,0(2)
         A     2,=F'1'
         ST    2,0(3)
         LA    4,105(,13)
         LR    2,15
         N     2,=XL4'000000FF'
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    2,0(2,3)
         N     2,=F'4'
         CH    2,=H'0'
         BE    @@L1168
@@L1134  EQU   *
         STC   15,0(4)
         A     4,=F'1'
         LA    3,4(,11)
         L     2,0(3)
         IC    15,0(2)
         A     2,=F'1'
         ST    2,0(3)
         LR    2,15
         N     2,=XL4'000000FF'
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    2,0(2,3)
         N     2,=F'4'
         CH    2,=H'0'
         BNE   @@L1134
         CLM   15,1,=XL1'4B'
         BE    @@L1134
@@L1163  EQU   *
         LR    3,15
         N     3,=XL4'000000FF'
         A     3,=F'-108'
         LA    2,123(0,0)
         CLR   3,2
         BH    @@L1155
         MH    3,=H'4'
         L     2,=A(@@L1156)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1156  EQU   *
         DC    A(@@L1136)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1149)
         DC    A(@@L1148)
         DC    A(@@L1148)
         DC    A(@@L1148)
         DC    A(@@L1155)
         DC    A(@@L1149)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1145)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1149)
         DC    A(@@L1149)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1149)
         DC    A(@@L1155)
         DC    A(@@L1149)
         DC    A(@@L1155)
         DC    A(@@L1166)
         DC    A(@@L1149)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1126)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1126)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1126)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1126)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1154)
         DC    A(@@L1155)
         DC    A(@@L1155)
         DC    A(@@L1149)
@@L1136  EQU   *
         ST    6,88(13)
         MVC   92(4,13),=A(@@LC68)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1126
@@L1148  EQU   *
         STC   15,0(4)
         MVI   1(4),0
         ST    6,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         A     5,=F'8'
         A     5,=F'-8'
         MVC   96(8,13),0(5)
         A     5,=F'8'
@@L1164  EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1126
@@L1145  EQU   *
         STC   15,0(4)
         A     4,=F'1'
@@L1166  EQU   *
         LA    2,4(,11)
         L     3,0(2)
         MVC   0(1,4),0(3)
         A     3,=F'1'
         ST    3,0(2)
@@L1165  EQU   *
         MVI   1(4),0
         ST    6,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         A     5,=F'4'
         A     5,=F'-4'
         MVC   96(4,13),0(5)
         A     5,=F'4'
         B     @@L1164
@@L1149  EQU   *
         STC   15,0(4)
         B     @@L1165
@@L1154  EQU   *
         L     2,=V(USER@LAB)
         MVC   88(4,13),0(2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L1126
@@L1155  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3652'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L1126
@@L1168  EQU   *
         CLM   15,1,=XL1'4B'
         BNE   @@L1163
         B     @@L1134
@@L1161  EQU   *
* Function asm_fprintf epilogue
         PDPEPIL
* Function asm_fprintf literal pool
         DS    0F
         LTORG
* Function asm_fprintf page table
         DS    0F
@@PGT37  EQU   *
         DC    A(@@PG37)
         DS    0F
* X-func split_double prologue
SPLIT@DO PDPPRLG CINDEX=38,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN38
         LTORG
@@FEN38  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG38   EQU   *
         LR    11,1
         L     10,=A(@@PGT38)
* Function split_double code
         L     4,0(11)
         L     5,4(11)
         L     6,8(11)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L1194
         CLM   2,3,=H'55'
         BE    @@L1182
         L     2,=V(CIRTX)
         MVC   0(4,5),256(2)
@@L1193  EQU   *
         ST    4,0(6)
         B     @@L1169
@@L1182  EQU   *
         IC    2,2(4)
         CLM   2,1,=XL1'00'
         BE    @@L1187
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L1187
         MVC   88(8,13),8(4)
         LA    2,104(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ETARDOUB)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,0(5)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),4(2)
@@L1192  EQU   *
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,0(6)
         B     @@L1169
@@L1187  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,0(5)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),8(4)
         B     @@L1192
@@L1194  EQU   *
         L     2,4(4)
         LTR   2,2
         BL    @@L1195
         L     2,=V(CIRTX)
         L     2,256(2)
@@L1178  EQU   *
         ST    2,0(5)
         B     @@L1193
@@L1195  EQU   *
         L     2,=V(CIRTX)
         L     2,252(2)
         B     @@L1178
@@L1169  EQU   *
* Function split_double epilogue
         PDPEPIL
* Function split_double literal pool
         DS    0F
         LTORG
* Function split_double page table
         DS    0F
@@PGT38  EQU   *
         DC    A(@@PG38)
         DS    0F
* X-func leaf_function_p prologue
LEAF@FUN PDPPRLG CINDEX=39,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN39
         LTORG
@@FEN39  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG39   EQU   *
         LR    11,1
         L     10,=A(@@PGT39)
* Function leaf_function_p code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,224(2)
         SRL   2,17
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1220
         L     2,=V(PROFAFLA)
         L     2,0(2)
         LTR   2,2
         BE    @@L1197
@@L1220  EQU   *
         SLR   15,15
         B     @@L1196
@@L1197  EQU   *
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LTR   15,15
         BE    @@L1214
@@L1205  EQU   *
         L     2,0(15)
         N     2,=F'-65408'
         L     3,=F'2228224'
         CLR   2,3
         BE    @@L1220
         LH    2,0(15)
         CLM   2,3,=H'32'
         BE    @@L1221
@@L1201  EQU   *
         L     15,12(15)
         LTR   15,15
         BNE   @@L1205
@@L1214  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     3,220(2)
         LTR   3,3
         BE    @@L1216
@@L1212  EQU   *
         L     15,4(3)
         L     2,0(15)
         N     2,=F'-65408'
         L     4,=F'2228224'
         CLR   2,4
         BE    @@L1220
         LH    2,0(15)
         CLM   2,3,=H'32'
         BE    @@L1222
@@L1208  EQU   *
         L     3,8(3)
         LTR   3,3
         BNE   @@L1212
@@L1216  EQU   *
         LA    15,1(0,0)
         B     @@L1196
@@L1222  EQU   *
         L     15,16(15)
         LH    2,0(15)
         CLM   2,3,=H'24'
         BNE   @@L1208
         L     2,4(15)
         L     2,4(2)
         L     2,0(2)
         N     2,=F'-65408'
         CLR   2,4
         BNE   @@L1208
         B     @@L1220
@@L1221  EQU   *
         L     3,16(15)
         LH    2,0(3)
         CLM   2,3,=H'24'
         BNE   @@L1201
         L     2,4(3)
         L     2,4(2)
         L     2,0(2)
         N     2,=F'-65408'
         L     4,=F'2228224'
         CLR   2,4
         BNE   @@L1201
         B     @@L1220
@@L1196  EQU   *
* Function leaf_function_p epilogue
         PDPEPIL
* Function leaf_function_p literal pool
         DS    0F
         LTORG
* Function leaf_function_p page table
         DS    0F
@@PGT39  EQU   *
         DC    A(@@PG39)
         DS    0F
* X-func final_forward_branch_p prologue
FINAL@FO PDPPRLG CINDEX=40,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN40
         LTORG
@@FEN40  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG40   EQU   *
         LR    11,1
         L     10,=A(@@PGT40)
* Function final_forward_branch_p code
         L     5,0(11)
         L     3,=A(@@4)
         L     2,0(3)
         LTR   2,2
         BE    @@L1228
@@L1224  EQU   *
         L     3,0(3)
         L     2,4(5)
         SLL   2,2
         L     4,0(2,3)
         L     2,32(5)
         L     2,4(2)
         SLL   2,2
         L     2,0(2,3)
         LTR   4,4
         BE    @@L1226
         LTR   2,2
         BNE   @@L1225
@@L1226  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3887'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L1225  EQU   *
         SLR   15,15
         CR    4,2
         BNL   @@L1227
         LA    15,1(0,0)
         B     @@L1227
@@L1228  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3882'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L1224
@@L1227  EQU   *
* Function final_forward_branch_p epilogue
         PDPEPIL
* Function final_forward_branch_p literal pool
         DS    0F
         LTORG
* Function final_forward_branch_p page table
         DS    0F
@@PGT40  EQU   *
         DC    A(@@PG40)
* X-var regs_ever_live
         ENTRY REGS@EVE
         DS    0F
REGS@EVE EQU   *
         DC    20X'00'
* X-var insn_addresses_
         ENTRY INSN@ADD
         DS    0F
INSN@ADD EQU   *
         DC    4X'00'
* X-var incradd
         ENTRY INCRADD
         DS    0F
INCRADD  EQU   *
         DC    4X'00'
* X-var cc_prev_status
         ENTRY CC@PREV@
         DS    0F
CC@PREV@ EQU   *
         DC    16X'00'
* X-var cc_status
         ENTRY CC@STATU
         DS    0F
CC@STATU EQU   *
         DC    16X'00'
* X-var frame_pointer_needed
         ENTRY FRAME@PO
         DS    0F
FRAME@PO EQU   *
         DC    4X'00'
* X-var final_sequence
         ENTRY FINAL@SE
         DS    0F
FINAL@SE EQU   *
         DC    4X'00'
* X-var coutinsn
         ENTRY COUTINSN
         DS    0F
COUTINSN EQU   *
         DC    4X'00'
         DS    0F
@@26     EQU   *
         DC    4X'00'
         DS    0F
@@19     EQU   *
         DC    4X'00'
         DS    0F
@@17     EQU   *
         DC    4X'00'
         DS    0F
@@18     EQU   *
         DC    4X'00'
         DS    0F
@@20     EQU   *
         DC    4X'00'
         DS    0F
@@15     EQU   *
         DC    4X'00'
         DS    0F
@@24     EQU   *
         DC    4X'00'
         DS    0F
@@14     EQU   *
         DC    4X'00'
         DS    0F
@@3      EQU   *
         DC    4X'00'
         DS    0F
@@23     EQU   *
         DC    4X'00'
         DS    0F
@@5      EQU   *
         DC    4X'00'
         DS    0F
@@6      EQU   *
         DC    4X'00'
* X-var insn_last_address
         ENTRY INSN@LAS
         DS    0F
INSN@LAS EQU   *
         DC    4X'00'
* X-var incral
         ENTRY INCRAL
         DS    0F
INCRAL   EQU   *
         DC    4X'00'
         DS    0F
@@7      EQU   *
         DC    4X'00'
         DS    0F
@@4      EQU   *
         DC    4X'00'
         DS    0F
@@10     EQU   *
         DC    4X'00'
         DS    0F
@@11     EQU   *
         DC    4X'00'
         DS    0F
@@13     EQU   *
         DC    4X'00'
         END
