         COPY  PDPTOP
         CSECT
* Program data area
         DS    0F
@@0      EQU   *
         DC    F'-1'
* X-var mn_base
         ENTRY MN@BASE
         DS    0F
MN@BASE  EQU   *
         DC    F'0'
* X-var mn_entry
         ENTRY MN@ENTRY
         DS    0F
MN@ENTRY EQU   *
         DC    F'0'
* X-var mvs_gotmain
         ENTRY MVS@GOTM
         DS    0F
MVS@GOTM EQU   *
         DC    F'0'
* X-var mn_toglob
         ENTRY MN@TOGLO
         DS    0F
MN@TOGLO EQU   *
         DC    F'1'
* X-var mvs_case_code
         ENTRY MVS@CASE
         DS    0F
MVS@CASE EQU   *
         DC    F'0'
* X-var mvs_csect_name
         ENTRY MVS@CSEC
         DS    0F
MVS@CSEC EQU   *
         DC    F'0'
* X-var mf_name
         ENTRY MF@NAME
         DS    0F
MF@NAME  EQU   *
         DC    F'0'
* X-var mvs_module
         ENTRY MVS@MODU
         DS    0F
MVS@MODU EQU   *
         DC    F'0'
* X-var mf_nlen
         ENTRY MF@NLEN
         DS    0F
MF@NLEN  EQU   *
         DC    F'0'
* X-var mp_num
         ENTRY MP@NUM
         DS    0F
MP@NUM   EQU   *
         DC    F'0'
         DS    0F
@@1      EQU   *
         DC    F'1'
         DS    0F
@@2      EQU   *
         DC    F'0'
         DS    0F
@@3      EQU   *
         DC    F'0'
         DS    0F
@@4      EQU   *
         DC    F'0'
* X-var i370_enable_pic
         ENTRY I370@ENA
         DS    0F
I370@ENA EQU   *
         DC    F'1'
         DS    0F
@@5      EQU   *
         DC    F'0'
* X-var targetm
         ENTRY TARGETM
* Program text area
@@LC0    EQU   *
         DC    C'('
         DC    X'0'
@@LC1    EQU   *
         DC    C')'
         DC    X'0'
* Program data area
         DS    0F
TARGETM  EQU   *
         DC    A(@@LC0)
         DC    A(@@LC1)
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    A(@@6)
         DC    A(@@7)
         DC    V(NO@ASM@T)
         DC    V(NO@ASM@T)
         DC    A(@@8)
         DC    V(DEFNONSE)
         DC    V(DEFESEC)
         DC    V(DFEHSECT)
         DC    V(DEFSAOCN)
         DC    V(DSTBAOD)
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         DC    V(MERGE@DE)
         DC    V(MERGE@TY)
         DC    V(DEFAULT@)
         DC    V(DEFCTA)
         DC    V(DEFSDTA)
         DC    V(DEFIATT)
         DC    V(DEFATIP)
         DC    V(DEFMSL)
         DC    V(DEFINITB)
         DC    V(DEFEXP)
         DC    V(DEFSECTY)
         DC    X'00'
         DC    X'01'
         DC    2X'00'
         DC    V(HVBOOLF)
         DS    0F
@@9      EQU   *
         DC    9X'00'
* Program text area
         DS    0F
* X-func i370_override_options prologue
I370@OVE PDPPRLG CINDEX=0,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function i370_override_options code
         L     2,=V(FLAG@PIC)
         L     3,=A(I370@ENA)
         MVC   0(4,3),0(2)
         L     2,=A(MVS@CSEC)
         L     2,0(2)
         LTR   2,2
         BE    @@L1
         MVC   88(4,13),=A(@@9)
         ST    2,92(13)
         MVC   96(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(STRNCPY)
         BALR  14,15
         L     3,=A(@@9)
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BNE   @@L6
@@L8     EQU   *
         L     2,=A(MVS@CSEC)
         MVC   0(4,2),=A(@@9)
         B     @@L1
@@L6     EQU   *
         SLR   2,2
         IC    2,0(3)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(TOUPPER)
         BALR  14,15
         STC   15,0(3)
         A     3,=F'1'
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BNE   @@L6
         B     @@L8
@@L1     EQU   *
* Function i370_override_options epilogue
         PDPEPIL
* Function i370_override_options literal pool
         DS    0F
         LTORG
* Function i370_override_options page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
@@LC2    EQU   *
         DC    C'<stdin>'
         DC    X'0'
@@LC3    EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* X-func ip_bdest prologue
IP@BDEST PDPPRLG CINDEX=1,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function ip_bdest code
         L     15,0(11)
         L     2,16(15)
         L     3,8(2)
         LH    2,0(3)
         CLM   2,3,=H'72'
         BE    @@L14
@@L10    EQU   *
         L     3,4(3)
         L     2,4(3)
         SLL   2,2
         L     3,=V(INSN@ADD)
         A     2,0(3)
         L     4,16(2)
         L     2,32(15)
         L     3,24(2)
         LTR   2,2
         BE    @@L12
         LH    2,0(2)
         CLM   2,3,=H'36'
         BE    @@L11
@@L12    EQU   *
         MVC   88(4,13),=A(@@LC2)
         MVC   92(4,13),=F'299'
         MVC   96(4,13),=A(@@LC3)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L11    EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         L     2,12(15)
         L     3,=F'-1'
         CLR   2,3
         BNE   @@L13
         L     2,=A(MP@NUM)
         MVC   12(4,15),0(2)
         B     @@L13
@@L14    EQU   *
         L     3,8(3)
         B     @@L10
@@L13    EQU   *
         L     2,=A(@@0)
         MVC   0(4,2),8(15)
         LR    15,4
* Function ip_bdest epilogue
         PDPEPIL
* Function ip_bdest literal pool
         DS    0F
         LTORG
* Function ip_bdest page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
         DS    0F
* X-func ip_blen prologue
IP@BLEN  PDPPRLG CINDEX=2,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function ip_blen code
         L     4,0(11)
         L     2,4(4)
         SLL   2,2
         L     3,=V(INSN@ADD)
         A     2,0(3)
         L     2,16(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(IP@BDEST)
         BALR  14,15
         SR    15,2
* Function ip_blen epilogue
         PDPEPIL
* Function ip_blen literal pool
         DS    0F
         LTORG
* Function ip_blen page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
         DS    0F
* X-func i370_short_branch prologue
I370@SHO PDPPRLG CINDEX=3,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function i370_short_branch code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(IP@BLEN)
         BALR  14,15
         L     2,=A(@@0)
         L     3,0(2)
         L     2,=A(MP@NUM)
         CL    3,0(2)
         BE    @@L17
         SLR   2,2
         L     4,=F'-1'
         CR    3,4
         BNE   @@L16
@@L17    EQU   *
         LTR   15,15
         BL    @@L21
         MH    15,=H'2'
         L     2,=A(MP@LIT)
         L     3,=A(MP@CODE)
         L     3,0(3)
         A     3,0(2)
         AR    15,3
@@L19    EQU   *
         BCTR  15,0
         LA    2,1(0,0)
         LA    3,4058(0,0)
         CLR   15,3
         BNH   @@L16
         SLR   2,2
         B     @@L16
@@L21    EQU   *
         L     2,=A(MP@CODE)
         A     15,0(2)
         B     @@L19
@@L16    EQU   *
         LR    15,2
* Function i370_short_branch epilogue
         PDPEPIL
* Function i370_short_branch literal pool
         DS    0F
         LTORG
* Function i370_short_branch page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
         DS    0F
* S-func i370_label_scan prologue
@@11     PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN4
         LTORG
@@FEN4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         LR    11,1
         L     10,=A(@@PGT4)
* Function i370_label_scan code
         SLR   8,8
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BE    @@L68
@@L66    EQU   *
         L     3,4(6)
         SLL   3,2
         L     2,=V(INSN@ADD)
         A     3,0(2)
         A     3,=F'16'
         LH    15,0(6)
         N     15,=XL4'0000FFFF'
         L     4,0(3)
         AR    4,8
         ST    4,0(3)
         LA    2,36(0,0)
         CLR   15,2
         BE    @@L72
         LA    2,33(0,0)
         CLR   15,2
         BE    @@L73
         LA    2,32(0,0)
         CLR   15,2
         BE    @@L74
@@L25    EQU   *
         L     6,12(6)
         LTR   6,6
         BNE   @@L66
         B     @@L68
@@L74    EQU   *
         L     2,=V(RTX@CLAS)
         IC    2,0(2,15)
         CLM   2,1,=XL1'89'
         BNE   @@L25
         L     5,28(6)
         LTR   5,5
         BE    @@L25
@@L65    EQU   *
         CLI   2(5),13
         BE    @@L75
@@L58    EQU   *
         L     5,8(5)
         LTR   5,5
         BNE   @@L65
         B     @@L25
@@L75    EQU   *
         L     3,4(5)
         LTR   3,3
         BE    @@L62
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L61
@@L62    EQU   *
         MVC   88(4,13),=A(@@LC2)
         MVC   92(4,13),=F'504'
         MVC   96(4,13),=A(@@LC3)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L61    EQU   *
         MVC   88(4,13),24(3)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         C     4,20(15)
         BNL   @@L63
         ST    4,20(15)
@@L63    EQU   *
         C     4,24(15)
         BNH   @@L58
         ST    4,24(15)
         B     @@L58
@@L73    EQU   *
         L     3,32(6)
         LTR   3,3
         BE    @@L76
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L50
         MVC   88(4,13),=A(@@LC2)
         MVC   92(4,13),=F'486'
         MVC   96(4,13),=A(@@LC3)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L50    EQU   *
         MVC   88(4,13),24(3)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         C     4,20(15)
         BNL   @@L51
         ST    4,20(15)
@@L51    EQU   *
         C     4,24(15)
         BNH   @@L25
         ST    4,24(15)
         B     @@L25
@@L76    EQU   *
         L     7,16(6)
         LH    2,0(7)
         CLM   2,3,=H'44'
         BE    @@L77
         CLM   2,3,=H'45'
         BNE   @@L25
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(DRTX)
         BALR  14,15
         SLR   5,5
         L     2,4(7)
         C     5,0(2)
         BNL   @@L25
@@L47    EQU   *
         A     5,=F'1'
         C     5,0(2)
         BL    @@L47
         B     @@L25
@@L77    EQU   *
         LR    5,3
         L     2,4(7)
         C     3,0(2)
         BNL   @@L25
@@L40    EQU   *
         L     2,4(7)
         LR    3,5
         MH    3,=H'4'
         L     3,4(3,2)
         LH    2,0(3)
         CLM   2,3,=H'67'
         BE    @@L36
         MVC   88(4,13),=A(@@LC2)
         MVC   92(4,13),=F'427'
         MVC   96(4,13),=A(@@LC3)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L36    EQU   *
         L     3,4(3)
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L37
         MVC   88(4,13),=A(@@LC2)
         MVC   92(4,13),=F'429'
         MVC   96(4,13),=A(@@LC3)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L37    EQU   *
         A     8,=F'4'
         A     4,=F'4'
         MVC   88(4,13),24(3)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         C     4,20(15)
         BNL   @@L38
         ST    4,20(15)
@@L38    EQU   *
         C     4,24(15)
         BNH   @@L34
         ST    4,24(15)
@@L34    EQU   *
         A     5,=F'1'
         L     2,4(7)
         C     5,0(2)
         BL    @@L40
         B     @@L25
@@L72    EQU   *
         MVC   88(4,13),24(6)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         ST    4,16(15)
         B     @@L25
@@L68    EQU   *
* Function i370_label_scan epilogue
         PDPEPIL
* Function i370_label_scan literal pool
         DS    0F
         LTORG
* Function i370_label_scan page table
         DS    0F
@@PGT4   EQU   *
         DC    A(@@PG4)
@@LC4    EQU   *
         DC    X'5'
         DC    C'L'
         DC    X'5'
         DC    C'%d,%d(,%d)'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func check_label_emit prologue
CHECK@LA PDPPRLG CINDEX=5,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN5
         LTORG
@@FEN5   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         LR    11,1
         L     10,=A(@@PGT5)
* Function check_label_emit code
         L     3,=A(MN@BASE)
         L     2,0(3)
         LTR   2,2
         BE    @@L78
         MVC   0(4,3),=F'0'
         L     3,=A(MP@CODE)
         L     2,0(3)
         A     2,=F'4'
         ST    2,0(3)
         L     2,=A(@@4)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC4)
         MVC   96(4,13),=F'12'
         L     3,=A(FUNCTION)
         L     2,=A(MP@NUM)
         L     2,0(2)
         S     2,0(3)
         MH    2,=H'4'
         ST    2,100(13)
         MVC   104(4,13),=F'10'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L78    EQU   *
* Function check_label_emit epilogue
         PDPEPIL
* Function check_label_emit literal pool
         DS    0F
         LTORG
* Function check_label_emit page table
         DS    0F
@@PGT5   EQU   *
         DC    A(@@PG5)
         DS    0F
* S-func mvs_get_label prologue
@@10     PDPPRLG CINDEX=6,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN6
         LTORG
@@FEN6   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG6    EQU   *
         LR    11,1
         L     10,=A(@@PGT6)
* Function mvs_get_label code
         L     3,0(11)
         L     2,=A(@@2)
         L     15,0(2)
         LTR   15,15
         BE    @@L90
@@L86    EQU   *
         L     2,4(15)
         CLR   2,3
         BE    @@L80
         L     15,0(15)
         LTR   15,15
         BNE   @@L86
@@L90    EQU   *
         L     2,=A(@@3)
         L     15,0(2)
         LTR   15,15
         BE    @@L87
         MVC   0(4,2),0(15)
@@L88    EQU   *
         ST    3,4(15)
         MVC   8(4,15),=F'-1'
         L     2,=A(@@2)
         MVC   0(4,15),0(2)
         MVC   20(4,15),=F'2000123123'
         MVC   24(4,15),=F'-1'
         MVC   16(4,15),=F'-1'
         MVC   12(4,15),=F'-1'
         ST    15,0(2)
         B     @@L80
@@L87    EQU   *
         MVC   88(4,13),=F'28'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         B     @@L88
@@L80    EQU   *
* Function mvs_get_label epilogue
         PDPEPIL
* Function mvs_get_label literal pool
         DS    0F
         LTORG
* Function mvs_get_label page table
         DS    0F
@@PGT6   EQU   *
         DC    A(@@PG6)
         DS    0F
* X-func mvs_alabel prologue
MVS@ALAB PDPPRLG CINDEX=7,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN7
         LTORG
@@FEN7   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG7    EQU   *
         LR    11,1
         L     10,=A(@@PGT7)
* Function mvs_alabel code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         L     2,=A(MP@NUM)
         MVC   8(4,15),0(2)
         L     3,0(2)
         L     2,=A(FUNCTION)
         CL    3,0(2)
         BE    @@L98
@@L97    EQU   *
         L     3,=A(MN@BASE)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         B     @@L92
@@L98    EQU   *
         L     2,12(15)
         L     4,=F'-1'
         CLR   2,4
         BE    @@L94
         CR    2,3
         BNE   @@L97
@@L94    EQU   *
         L     3,24(15)
         L     15,16(15)
         CR    3,15
         BL    @@L92
         SR    3,15
         MH    3,=H'2'
         L     2,=A(MP@CODE)
         A     3,0(2)
         L     2,=A(MP@LIT)
         A     3,0(2)
         LA    2,4059(0,0)
         CR    3,2
         BH    @@L97
@@L92    EQU   *
* Function mvs_alabel epilogue
         PDPEPIL
* Function mvs_alabel literal pool
         DS    0F
         LTORG
* Function mvs_alabel page table
         DS    0F
@@PGT7   EQU   *
         DC    A(@@PG7)
         DS    0F
* X-func mvs_clabel prologue
MVS@CLAB PDPPRLG CINDEX=8,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN8
         LTORG
@@FEN8   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG8    EQU   *
         LR    11,1
         L     10,=A(@@PGT8)
* Function mvs_clabel code
         L     3,0(11)
         L     2,=A(@@2)
         L     15,0(2)
         LTR   15,15
         BE    @@L109
@@L107   EQU   *
         L     2,4(15)
         CLR   2,3
         BE    @@L110
         L     15,0(15)
         LTR   15,15
         BNE   @@L107
@@L109   EQU   *
         SLR   15,15
         B     @@L99
@@L110   EQU   *
         L     2,=A(MP@NUM)
         L     15,8(15)
         X     15,0(2)
         LPR   15,15
         BCTR  15,0
         SRL   15,31
@@L99    EQU   *
* Function mvs_clabel epilogue
         PDPEPIL
* Function mvs_clabel literal pool
         DS    0F
         LTORG
* Function mvs_clabel page table
         DS    0F
@@PGT8   EQU   *
         DC    A(@@PG8)
         DS    0F
* X-func mvs_free_label_list prologue
MVS@FREE PDPPRLG CINDEX=9,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN9
         LTORG
@@FEN9   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG9    EQU   *
         LR    11,1
         L     10,=A(@@PGT9)
* Function mvs_free_label_list code
         L     2,=A(@@2)
         L     2,0(2)
         LTR   2,2
         BE    @@L112
         LR    15,2
         L     2,0(2)
         LTR   2,2
         BE    @@L118
@@L116   EQU   *
         L     15,0(15)
         L     2,0(15)
         LTR   2,2
         BNE   @@L116
@@L118   EQU   *
         L     3,=A(@@3)
         MVC   0(4,15),0(3)
         L     2,=A(@@2)
         MVC   0(4,3),0(2)
@@L112   EQU   *
         L     2,=A(@@2)
         MVC   0(4,2),=F'0'
* Function mvs_free_label_list epilogue
         PDPEPIL
* Function mvs_free_label_list literal pool
         DS    0F
         LTORG
* Function mvs_free_label_list page table
         DS    0F
@@PGT9   EQU   *
         DC    A(@@PG9)
         DS    0F
@@12     EQU   *
         DC    50X'00'
         DS    0F
* X-func mvs_make_float prologue
MVS@MAKE PDPPRLG CINDEX=10,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN10
         LTORG
@@FEN10  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG10   EQU   *
         LR    11,1
         L     10,=A(@@PGT10)
* Function mvs_make_float code
         MVC   88(8,13),0(11)
         MVC   96(4,13),=A(@@12)
         LA    1,88(,13)
         L     15,=V(ERTODEC)
         BALR  14,15
         L     5,=A(@@12)
         LR    15,5
         IC    2,0(5)
         CLM   2,1,=XL1'00'
         BE    @@L134
@@L125   EQU   *
         SLR   4,4
         IC    4,0(15)
         LR    3,4
         MH    3,=H'2'
         L     2,=V(@SCH@IST)
         LH    2,0(3,2)
         N     2,=F'8'
         CH    2,=H'0'
         BE    @@L122
         L     2,=V(@SCH@TOU)
         IC    4,0(2,4)
         STC   4,0(15)
@@L122   EQU   *
         A     15,=F'1'
         IC    2,0(15)
         CLM   2,1,=XL1'00'
         BNE   @@L125
@@L134   EQU   *
         MVC   88(4,13),=A(@@12)
         MVC   92(4,13),=F'197'
         LA    1,88(,13)
         L     15,=V(STRRCHR)
         BALR  14,15
         LTR   15,15
         BE    @@L126
         LR    2,15
         BCTR  15,0
         CLI   0(15),240
         BE    @@L131
@@L136   EQU   *
         CLI   0(15),75
         BE    @@L137
@@L132   EQU   *
         A     15,=F'1'
         ST    15,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         B     @@L126
@@L137   EQU   *
         A     15,=F'1'
         B     @@L132
@@L131   EQU   *
         BCTR  15,0
         CLI   0(15),240
         BE    @@L131
         B     @@L136
@@L126   EQU   *
         LR    15,5
* Function mvs_make_float epilogue
         PDPEPIL
* Function mvs_make_float literal pool
         DS    0F
         LTORG
* Function mvs_make_float page table
         DS    0F
@@PGT10  EQU   *
         DC    A(@@PG10)
@@LC6    EQU   *
         DC    X'5'
         DC    C'DS'
         DC    X'5'
         DC    C'0F'
         DC    X'15'
         DC    X'0'
@@LC8    EQU   *
         DC    C'@@PGE%d'
         DC    X'5'
         DC    C'EQU'
         DC    X'5'
         DC    C'*'
         DC    X'15'
         DC    X'0'
@@LC9    EQU   *
         DC    X'5'
         DC    C'DROP'
         DC    X'5'
         DC    C'%d'
         DC    X'15'
         DC    X'0'
@@LC10   EQU   *
         DC    X'5'
         DC    C'BALR'
         DC    X'5'
         DC    C'%d,0'
         DC    X'15'
         DC    X'0'
@@LC11   EQU   *
         DC    X'5'
         DC    C'USING'
         DC    X'5'
         DC    C'*,%d'
         DC    X'15'
         DC    X'0'
@@LC12   EQU   *
         DC    C'@@PG%d'
         DC    X'5'
         DC    C'EQU'
         DC    X'5'
         DC    C'*'
         DC    X'15'
         DC    X'0'
@@LC5    EQU   *
         DC    X'5'
         DC    C'B'
         DC    X'5'
         DC    C'@@PGE%d'
         DC    X'15'
         DC    X'0'
@@LC7    EQU   *
         DC    X'5'
         DC    C'LTORG'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func mvs_cpage prologue
MVS@CPAG PDPPRLG CINDEX=11,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN11
         LTORG
@@FEN11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG11   EQU   *
         LR    11,1
         L     10,=A(@@PGT11)
* Function mvs_cpage code
         L     3,0(11)
         L     8,4(11)
         L     7,8(11)
         LTR   3,3
         BE    @@L139
         L     2,=A(@@4)
         ST    3,0(2)
@@L139   EQU   *
         L     5,=A(MP@CODE)
         L     4,0(5)
         AR    4,8
         L     6,=A(MP@LIT)
         L     3,0(6)
         LR    2,4
         AR    2,3
         AR    2,7
         LA    9,4068(0,0)
         CR    2,9
         BNH   @@L140
         L     2,=A(MVS@CASE)
         L     2,0(2)
         LTR   2,2
         BE    @@L142
@@L141   EQU   *
         L     2,=A(@@4)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC8)
         L     4,=A(MP@NUM)
         MVC   96(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC9)
         MVC   96(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     3,0(4)
         A     3,=F'1'
         ST    3,0(4)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC10)
         MVC   96(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC11)
         MVC   96(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC12)
         MVC   96(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    8,0(5)
         ST    7,0(6)
         LA    15,1(0,0)
         B     @@L138
@@L142   EQU   *
         L     3,=A(@@4)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC5)
         L     2,=A(MP@NUM)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC7)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L141
@@L140   EQU   *
         ST    4,0(5)
         AR    3,7
         ST    3,0(6)
         SLR   15,15
@@L138   EQU   *
* Function mvs_cpage epilogue
         PDPEPIL
* Function mvs_cpage literal pool
         DS    0F
         LTORG
* Function mvs_cpage page table
         DS    0F
@@PGT11  EQU   *
         DC    A(@@PG11)
         DS    0F
* X-func mvs_function_check prologue
MVS@FUNC PDPPRLG CINDEX=12,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN12
         LTORG
@@FEN12  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG12   EQU   *
         LR    11,1
         L     10,=A(@@PGT12)
* Function mvs_function_check code
         SLR   15,15
* Function mvs_function_check epilogue
         PDPEPIL
* Function mvs_function_check literal pool
         DS    0F
         LTORG
* Function mvs_function_check page table
         DS    0F
@@PGT12  EQU   *
         DC    A(@@PG12)
@@LC13   EQU   *
         DC    C'real name is too long - alias ignored'
         DC    X'0'
@@LC14   EQU   *
         DC    C'alias name is too long - alias ignored'
         DC    X'0'
         DS    0F
* X-func mvs_aalias prologue
MVS@AALI PDPPRLG CINDEX=13,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN13
         LTORG
@@FEN13  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG13   EQU   *
         LR    11,1
         L     10,=A(@@PGT13)
* Function mvs_aalias code
         L     2,0(11)
         L     4,4(11)
         MVC   88(4,13),=F'280'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    3,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    5,255(0,0)
         CLR   15,5
         BNH   @@L145
         MVC   88(4,13),=A(@@LC13)
@@L147   EQU   *
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     @@L144
@@L145   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    5,8(0,0)
         CLR   15,5
         BNH   @@L146
         MVC   88(4,13),=A(@@LC14)
         B     @@L147
@@L146   EQU   *
         A     3,=F'21'
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         A     3,=F'-9'
         ST    3,88(13)
         A     3,=F'-12'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         MVC   4(4,3),8(11)
         MVC   8(4,3),=F'0'
         L     2,=A(@@5)
         MVC   0(4,3),0(2)
         ST    3,0(2)
@@L144   EQU   *
* Function mvs_aalias epilogue
         PDPEPIL
* Function mvs_aalias literal pool
         DS    0F
         LTORG
* Function mvs_aalias page table
         DS    0F
@@PGT13  EQU   *
         DC    A(@@PG13)
         DS    0F
* X-func mvs_need_alias prologue
MVS@NEED PDPPRLG CINDEX=14,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN14
         LTORG
@@FEN14  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG14   EQU   *
         LR    11,1
         L     10,=A(@@PGT14)
* Function mvs_need_alias code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    15,1(0,0)
* Function mvs_need_alias epilogue
         PDPEPIL
* Function mvs_need_alias literal pool
         DS    0F
         LTORG
* Function mvs_need_alias page table
         DS    0F
@@PGT14  EQU   *
         DC    A(@@PG14)
         DS    0F
* X-func mvs_mark_alias prologue
MVS@MARK PDPPRLG CINDEX=15,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN15
         LTORG
@@FEN15  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG15   EQU   *
         LR    11,1
         L     10,=A(@@PGT15)
* Function mvs_mark_alias code
         L     3,0(11)
         L     2,=A(@@5)
         L     2,0(2)
         LTR   2,2
         BE    @@L157
@@L155   EQU   *
         A     2,=F'21'
         ST    2,88(13)
         A     2,=F'-21'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L158
         L     2,0(2)
         LTR   2,2
         BNE   @@L155
@@L157   EQU   *
         LA    15,1(0,0)
         B     @@L149
@@L158   EQU   *
         MVC   8(4,2),=F'1'
@@L149   EQU   *
* Function mvs_mark_alias epilogue
         PDPEPIL
* Function mvs_mark_alias literal pool
         DS    0F
         LTORG
* Function mvs_mark_alias page table
         DS    0F
@@PGT15  EQU   *
         DC    A(@@PG15)
@@LC15   EQU   *
         DC    C'%s'
         DC    X'5'
         DC    C'ALIAS'
         DC    X'5'
         DC    C'C''%s'''
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func mvs_dump_alias prologue
MVS@DUMP PDPPRLG CINDEX=16,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN16
         LTORG
@@FEN16  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG16   EQU   *
         LR    11,1
         L     10,=A(@@PGT16)
* Function mvs_dump_alias code
         L     4,0(11)
         L     2,=A(@@5)
         L     3,0(2)
         LTR   3,3
         BE    @@L167
@@L165   EQU   *
         L     2,8(3)
         LTR   2,2
         BE    @@L162
         L     2,4(3)
         LTR   2,2
         BE    @@L168
@@L162   EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   @@L165
         B     @@L167
@@L168   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC15)
         A     3,=F'12'
         ST    3,96(13)
         A     3,=F'9'
         ST    3,100(13)
         A     3,=F'-21'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L162
@@L167   EQU   *
         SLR   15,15
* Function mvs_dump_alias epilogue
         PDPEPIL
* Function mvs_dump_alias literal pool
         DS    0F
         LTORG
* Function mvs_dump_alias page table
         DS    0F
@@PGT16  EQU   *
         DC    A(@@PG16)
         DS    0F
* X-func mvs_get_alias prologue
MVS@GET@ PDPPRLG CINDEX=17,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN17
         LTORG
@@FEN17  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG17   EQU   *
         LR    11,1
         L     10,=A(@@PGT17)
* Function mvs_get_alias code
         L     2,0(11)
         L     3,4(11)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    4,8(0,0)
         CLR   15,4
         BH    @@L171
         SLR   15,15
         B     @@L169
@@L171   EQU   *
         ST    3,88(13)
         ST    2,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCPY)
         BALR  14,15
         MVI   8(3),0
         LA    15,1(0,0)
@@L169   EQU   *
* Function mvs_get_alias epilogue
         PDPEPIL
* Function mvs_get_alias literal pool
         DS    0F
         LTORG
* Function mvs_get_alias page table
         DS    0F
@@PGT17  EQU   *
         DC    A(@@PG17)
         DS    0F
* X-func mvs_calias prologue
MVS@CALI PDPPRLG CINDEX=18,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN18
         LTORG
@@FEN18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG18   EQU   *
         LR    11,1
         L     10,=A(@@PGT18)
* Function mvs_calias code
         L     2,0(11)
         L     3,4(11)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LA    4,8(0,0)
         CLR   15,4
         BH    @@L174
         SLR   15,15
         B     @@L172
@@L174   EQU   *
         ST    3,88(13)
         ST    2,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCPY)
         BALR  14,15
         MVI   8(3),0
         LA    15,1(0,0)
@@L172   EQU   *
* Function mvs_calias epilogue
         PDPEPIL
* Function mvs_calias literal pool
         DS    0F
         LTORG
* Function mvs_calias page table
         DS    0F
@@PGT18  EQU   *
         DC    A(@@PG18)
         DS    0F
* X-func s_operand prologue
S@OPERAN PDPPRLG CINDEX=19,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN19
         LTORG
@@FEN19  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG19   EQU   *
         LR    11,1
         L     10,=A(@@PGT19)
* Function s_operand code
         L     4,0(11)
         L     6,4(11)
         L     3,0(4)
         LR    5,3
         SRL   5,16
         LH    15,0(4)
         LR    2,15
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L184
         CLM   15,3,=H'54'
         BE    @@L184
         CLM   15,3,=H'55'
         BE    @@L184
         CLM   15,3,=H'58'
         BE    @@L187
@@L178   EQU   *
         CLM   15,3,=H'58'
         BE    @@L188
@@L176   EQU   *
         LTR   6,6
         BE    @@L181
         LR    2,3
         SRL   2,8
         N     2,=F'255'
         CLR   2,6
         BE    @@L189
@@L181   EQU   *
         SLR   15,15
         B     @@L175
@@L189   EQU   *
         LA    2,66(0,0)
         CLR   5,2
         BNE   @@L181
         L     4,4(4)
         L     2,=V(VOLATILE)
         L     15,0(2)
         LTR   15,15
         BNE   @@L182
         SRL   3,4
         N     3,=F'1'
         LTR   3,3
         BNE   @@L175
@@L182   EQU   *
         LH    3,0(4)
         CLM   3,3,=H'61'
         BE    @@L190
@@L183   EQU   *
         CLM   3,3,=H'75'
         BNE   @@L181
         L     15,4(4)
         LH    2,0(15)
         CLM   2,3,=H'61'
         BNE   @@L181
         L     15,4(15)
         LR    2,15
         BCTR  2,0
         LA    3,14(0,0)
         CLR   2,3
         BNH   @@L186
         LA    5,19(0,0)
         CLR   15,5
         BNH   @@L181
@@L186   EQU   *
         L     15,8(4)
         LH    2,0(15)
         CLM   2,3,=H'54'
         BNE   @@L181
         L     2,4(15)
         LA    15,1(0,0)
         LA    7,4095(0,0)
         CLR   2,7
         BNH   @@L175
         B     @@L181
@@L190   EQU   *
         L     15,4(4)
         LR    2,15
         BCTR  2,0
         LA    5,14(0,0)
         CLR   2,5
         BNH   @@L184
         LA    7,19(0,0)
         CLR   15,7
         BNH   @@L183
@@L184   EQU   *
         LA    15,1(0,0)
         B     @@L175
@@L188   EQU   *
         L     2,4(4)
         L     2,4(2)
         L     2,0(2)
         N     2,=F'-65520'
         L     7,=F'4456448'
         CLR   2,7
         BNE   @@L176
         B     @@L184
@@L187   EQU   *
         L     2,4(4)
         L     2,4(2)
         LH    2,0(2)
         CLM   2,3,=H'67'
         BNE   @@L178
         B     @@L184
@@L175   EQU   *
* Function s_operand epilogue
         PDPEPIL
* Function s_operand literal pool
         DS    0F
         LTORG
* Function s_operand page table
         DS    0F
@@PGT19  EQU   *
         DC    A(@@PG19)
         DS    0F
* X-func r_or_s_operand prologue
R@OR@S@O PDPPRLG CINDEX=20,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN20
         LTORG
@@FEN20  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG20   EQU   *
         LR    11,1
         L     10,=A(@@PGT20)
* Function r_or_s_operand code
         L     4,0(11)
         L     6,4(11)
         L     3,0(4)
         LR    5,3
         SRL   5,16
         LH    15,0(4)
         LR    2,15
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L202
         CLM   15,3,=H'54'
         BE    @@L202
         CLM   15,3,=H'55'
         BE    @@L202
         CLM   15,3,=H'58'
         BE    @@L205
@@L194   EQU   *
         CLM   15,3,=H'58'
         BE    @@L206
@@L192   EQU   *
         LTR   6,6
         BE    @@L198
         LR    2,3
         SRL   2,8
         N     2,=F'255'
         CLR   2,6
         BE    @@L207
@@L198   EQU   *
         SLR   15,15
         B     @@L191
@@L207   EQU   *
         LA    15,1(0,0)
         LA    2,61(0,0)
         CLR   5,2
         BE    @@L191
         LA    7,66(0,0)
         CLR   5,7
         BNE   @@L198
         L     4,4(4)
         L     2,=V(VOLATILE)
         L     15,0(2)
         LTR   15,15
         BNE   @@L200
         SRL   3,4
         N     3,=F'1'
         LTR   3,3
         BNE   @@L191
@@L200   EQU   *
         LH    3,0(4)
         CLM   3,3,=H'61'
         BE    @@L208
@@L201   EQU   *
         CLM   3,3,=H'75'
         BNE   @@L198
         L     15,4(4)
         LH    2,0(15)
         CLM   2,3,=H'61'
         BNE   @@L198
         L     15,4(15)
         LR    2,15
         BCTR  2,0
         LA    3,14(0,0)
         CLR   2,3
         BNH   @@L204
         LA    5,19(0,0)
         CLR   15,5
         BNH   @@L198
@@L204   EQU   *
         L     15,8(4)
         LH    2,0(15)
         CLM   2,3,=H'54'
         BNE   @@L198
         L     2,4(15)
         LA    15,1(0,0)
         LA    7,4095(0,0)
         CLR   2,7
         BNH   @@L191
         B     @@L198
@@L208   EQU   *
         L     15,4(4)
         LR    2,15
         BCTR  2,0
         LA    5,14(0,0)
         CLR   2,5
         BNH   @@L202
         LA    7,19(0,0)
         CLR   15,7
         BNH   @@L201
@@L202   EQU   *
         LA    15,1(0,0)
         B     @@L191
@@L206   EQU   *
         L     2,4(4)
         L     2,4(2)
         L     2,0(2)
         N     2,=F'-65520'
         L     7,=F'4456448'
         CLR   2,7
         BNE   @@L192
         B     @@L202
@@L205   EQU   *
         L     2,4(4)
         L     2,4(2)
         LH    2,0(2)
         CLM   2,3,=H'67'
         BNE   @@L194
         B     @@L202
@@L191   EQU   *
* Function r_or_s_operand epilogue
         PDPEPIL
* Function r_or_s_operand literal pool
         DS    0F
         LTORG
* Function r_or_s_operand page table
         DS    0F
@@PGT20  EQU   *
         DC    A(@@PG20)
         DS    0F
* X-func unsigned_jump_follows_p prologue
UNSIGNED PDPPRLG CINDEX=21,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN21
         LTORG
@@FEN21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG21   EQU   *
         LR    11,1
         L     10,=A(@@PGT21)
* Function unsigned_jump_follows_p code
         L     4,0(11)
@@L233   EQU   *
         L     4,12(4)
         LA    15,1(0,0)
         LTR   4,4
         BE    @@L209
         LH    2,0(4)
         CLM   2,3,=H'33'
         BNE   @@L233
         L     3,16(4)
         LTR   3,3
         BE    @@L233
         LH    2,0(3)
         CLM   2,3,=H'47'
         BNE   @@L233
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'59'
         BNE   @@L233
         L     3,8(3)
         LH    2,0(3)
         CLM   2,3,=H'72'
         BNE   @@L233
         L     3,4(3)
         LH    3,0(3)
         N     3,=XL4'0000FFFF'
         LR    2,3
         A     2,=F'-102'
         LA    5,1(0,0)
         CLR   2,5
         BH    @@L219
         L     4,12(4)
         LR    15,5
         LTR   4,4
         BE    @@L209
         LH    2,0(4)
         CLM   2,3,=H'33'
         BE    @@L221
@@L227   EQU   *
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-36'
         CLM   2,3,=H'1'
         BNH   @@L225
         CLM   3,3,=H'32'
         BE    @@L225
         LA    15,1(0,0)
         CLM   3,3,=H'33'
         BNE   @@L209
@@L225   EQU   *
         L     4,12(4)
         LA    15,1(0,0)
         LTR   4,4
         BE    @@L209
         LH    2,0(4)
         CLM   2,3,=H'33'
         BNE   @@L227
@@L221   EQU   *
         L     3,16(4)
         LTR   3,3
         BE    @@L233
         LH    2,0(3)
         LA    15,1(0,0)
         CLM   2,3,=H'47'
         BNE   @@L209
         L     2,4(3)
         LH    2,0(2)
         LA    15,1(0,0)
         CLM   2,3,=H'59'
         BNE   @@L209
         L     3,8(3)
         LH    2,0(3)
         LA    15,1(0,0)
         CLM   2,3,=H'72'
         BNE   @@L209
         L     3,4(3)
         LH    3,0(3)
         N     3,=XL4'0000FFFF'
@@L219   EQU   *
         SLR   15,15
         A     3,=F'-104'
         LA    2,3(0,0)
         CLR   3,2
         BNH   @@L209
         LA    15,1(0,0)
@@L209   EQU   *
* Function unsigned_jump_follows_p epilogue
         PDPEPIL
* Function unsigned_jump_follows_p literal pool
         DS    0F
         LTORG
* Function unsigned_jump_follows_p page table
         DS    0F
@@PGT21  EQU   *
         DC    A(@@PG21)
* Program data area
         DS    0F
@@13     EQU   *
         DC    F'0'
* Program text area
@@LC16   EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'X''%02X'''
         DC    X'15'
         DC    X'0'
@@LC22   EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'V('
         DC    X'0'
@@LC24   EQU   *
         DC    C')'
         DC    X'15'
         DC    X'0'
@@LC23   EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'A('
         DC    X'0'
@@LC20   EQU   *
         DC    X'5'
         DC    C'EXTRN'
         DC    X'5'
         DC    X'0'
@@LC21   EQU   *
         DC    X'15'
         DC    X'0'
@@LC18   EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'F'''
         DC    X'0'
@@LC19   EQU   *
         DC    C''''
         DC    X'15'
         DC    X'0'
@@LC17   EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'X''%04X'''
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func i370_hlasm_assemble_integer prologue
@@6      PDPPRLG CINDEX=22,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN22
         LTORG
@@FEN22  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG22   EQU   *
         LR    11,1
         L     10,=A(@@PGT22)
* Function i370_hlasm_assemble_integer code
         L     6,0(11)
         L     3,4(11)
         L     5,8(11)
         SLR   4,4
         LTR   5,5
         BE    @@L236
         LA    2,2(0,0)
         CLR   3,2
         BE    @@L239
         BH    @@L254
         LA    2,1(0,0)
         CLR   3,2
         BE    @@L238
@@L236   EQU   *
         LTR   4,4
         BE    @@L255
         LH    2,0(6)
         CLM   2,3,=H'54'
         BE    @@L260
@@L255   EQU   *
         ST    6,88(13)
         ST    3,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(DEFAI)
         BALR  14,15
         N     15,=XL4'000000FF'
         B     @@L235
@@L260   EQU   *
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         ST    4,92(13)
         N     15,4(6)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L259   EQU   *
         LA    15,1(0,0)
         B     @@L235
@@L238   EQU   *
         L     4,=A(@@LC16)
         LA    15,255(0,0)
         B     @@L236
@@L254   EQU   *
         LA    2,4(0,0)
         CLR   3,2
         BNE   @@L236
         LH    2,0(6)
         CLM   2,3,=H'54'
         BE    @@L261
         CLM   2,3,=H'58'
         BE    @@L262
@@L243   EQU   *
         L     2,0(6)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BE    @@L250
         MVC   88(4,13),=A(@@LC22)
@@L257   EQU   *
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     2,=V(ASM@OUT@)
         MVC   88(4,13),0(2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         MVC   88(4,13),=A(@@LC24)
@@L258   EQU   *
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L259
@@L250   EQU   *
         MVC   88(4,13),=A(@@LC23)
         B     @@L257
@@L262   EQU   *
         L     2,4(6)
         L     3,4(2)
         L     2,0(3)
         N     2,=F'-65520'
         L     4,=F'4456464'
         CLR   2,4
         BNE   @@L243
         L     4,4(3)
         L     3,=A(@@13)
         L     2,0(3)
         LTR   2,2
         BNE   @@L248
@@L245   EQU   *
         L     5,0(3)
         LTR   5,5
         BNE   @@L243
         MVC   88(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    2,15
         ST    15,0(3)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         A     15,=F'1'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,0(2)
         L     2,0(3)
         MVC   88(4,13),0(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         L     2,0(3)
         ST    5,4(2)
         MVC   88(4,13),=A(@@LC20)
         L     3,=V(ASM@OUT@)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   88(4,13),0(3)
         L     2,4(6)
         L     2,4(2)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(ASSNAME)
         BALR  14,15
         MVC   88(4,13),=A(@@LC21)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L243
@@L248   EQU   *
         L     2,0(3)
         MVC   88(4,13),0(2)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         LTR   15,15
         BE    @@L245
         L     3,0(3)
         A     3,=F'4'
         L     2,0(3)
         LTR   2,2
         BNE   @@L248
         B     @@L245
@@L261   EQU   *
         MVC   88(4,13),=A(@@LC18)
         L     2,=V(ASM@OUT@)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         MVC   88(4,13),0(2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(OADDRC)
         BALR  14,15
         MVC   88(4,13),=A(@@LC19)
         B     @@L258
@@L239   EQU   *
         L     4,=A(@@LC17)
         L     15,=F'65535'
         B     @@L236
@@L235   EQU   *
* Function i370_hlasm_assemble_integer epilogue
         PDPEPIL
* Function i370_hlasm_assemble_integer literal pool
         DS    0F
         LTORG
* Function i370_hlasm_assemble_integer page table
         DS    0F
@@PGT22  EQU   *
         DC    A(@@PG22)
@@LC25   EQU   *
         DC    C'* %c-func %s prologue'
         DC    X'15'
         DC    X'0'
@@LC26   EQU   *
         DC    X'5'
         DC    C'PDPPRLG CINDEX=%d,FRAME=%d,BASER=%d,ENTRY=%s'
         DC    X'15'
         DC    X'0'
@@LC27   EQU   *
         DC    C'YES'
         DC    X'0'
@@LC28   EQU   *
         DC    C'NO'
         DC    X'0'
@@LC29   EQU   *
         DC    X'5'
         DC    C'B'
         DC    X'5'
         DC    C'@@FEN%d'
         DC    X'15'
         DC    X'0'
@@LC30   EQU   *
         DC    C'@@FEN%d'
         DC    X'5'
         DC    C'EQU'
         DC    X'5'
         DC    C'*'
         DC    X'15'
         DC    X'0'
@@LC31   EQU   *
         DC    X'5'
         DC    C'LR'
         DC    X'5'
         DC    C'11,1'
         DC    X'15'
         DC    X'0'
@@LC32   EQU   *
         DC    X'5'
         DC    C'L'
         DC    X'5'
         DC    C'%d,=A(@@PGT%d)'
         DC    X'15'
         DC    X'0'
@@LC33   EQU   *
         DC    C'* Function %s code'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func i370_output_function_prologue prologue
@@7      PDPPRLG CINDEX=23,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN23
         LTORG
@@FEN23  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG23   EQU   *
         LR    11,1
         L     10,=A(@@PGT23)
* Function i370_output_function_prologue code
         L     4,0(11)
         L     5,4(11)
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC25)
         L     2,=A(MN@ENTRY)
         L     2,0(2)
         LA    3,231(0,0)
         LTR   2,2
         BNE   @@L265
         LA    3,226(0,0)
@@L265   EQU   *
         ST    3,96(13)
         L     2,=V(CF@DECL)
         L     2,0(2)
         L     2,44(2)
         MVC   100(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     3,=A(@@1)
         L     2,0(3)
         LTR   2,2
         BE    @@L266
         MVC   0(4,3),=F'0'
@@L266   EQU   *
         ST    4,88(13)
         L     2,=A(MF@NAME)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(ASSNAME)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC26)
         L     2,=A(MP@NUM)
         MVC   96(4,13),0(2)
         L     2,=V(CFUN)
         L     2,0(2)
         A     5,44(2)
         A     5,=F'88'
         ST    5,100(13)
         MVC   104(4,13),=F'12'
         L     2,=A(MN@ENTRY)
         L     2,0(2)
         L     3,=A(@@LC27)
         LTR   2,2
         BNE   @@L268
         L     3,=A(@@LC28)
@@L268   EQU   *
         ST    3,108(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC29)
         L     3,=A(MP@NUM)
         MVC   96(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC7)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC30)
         MVC   96(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC9)
         MVC   96(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC10)
         MVC   96(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC11)
         MVC   96(4,13),=F'12'
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC12)
         MVC   96(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC31)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC32)
         MVC   96(4,13),=F'10'
         MVC   100(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC33)
         L     2,=V(CF@DECL)
         L     2,0(2)
         L     2,44(2)
         MVC   96(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(MVS@FREE)
         BALR  14,15
         L     2,=A(MP@CODE)
         MVC   0(4,2),=F'6'
         L     2,=A(MP@LIT)
         MVC   0(4,2),=F'4'
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(MVS@CPAG)
         BALR  14,15
         L     2,=A(FUNCTION)
         MVC   0(4,2),0(3)
         LA    1,88(,13)
         L     15,=A(@@11)
         BALR  14,15
* Function i370_output_function_prologue epilogue
         PDPEPIL
* Function i370_output_function_prologue literal pool
         DS    0F
         LTORG
* Function i370_output_function_prologue page table
         DS    0F
@@PGT23  EQU   *
         DC    A(@@PG23)
@@LC34   EQU   *
         DC    C'* Function %s epilogue'
         DC    X'15'
         DC    X'0'
@@LC35   EQU   *
         DC    X'5'
         DC    C'PDPEPIL'
         DC    X'15'
         DC    X'0'
@@LC36   EQU   *
         DC    C'* Function %s literal pool'
         DC    X'15'
         DC    X'0'
@@LC37   EQU   *
         DC    C'* Function %s page table'
         DC    X'15'
         DC    X'0'
@@LC38   EQU   *
         DC    C'@@PGT%d'
         DC    X'5'
         DC    C'EQU'
         DC    X'5'
         DC    C'*'
         DC    X'15'
         DC    X'0'
@@LC39   EQU   *
         DC    X'5'
         DC    C'DC'
         DC    X'5'
         DC    C'A(@@PG%d)'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func i370_output_function_epilogue prologue
@@8      PDPPRLG CINDEX=24,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN24
         LTORG
@@FEN24  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG24   EQU   *
         LR    11,1
         L     10,=A(@@PGT24)
* Function i370_output_function_epilogue code
         L     5,0(11)
         LA    1,88(,13)
         L     15,=A(CHECK@LA)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=F'14'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(MVS@CPAG)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC34)
         L     3,=V(CF@DECL)
         L     2,0(3)
         L     2,44(2)
         MVC   96(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     4,=A(MP@NUM)
         L     2,0(4)
         A     2,=F'1'
         ST    2,0(4)
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC35)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC36)
         L     2,0(3)
         L     2,44(2)
         MVC   96(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC7)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC37)
         L     2,0(3)
         L     2,44(2)
         MVC   96(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC38)
         L     2,=A(FUNCTION)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(MVS@FREE)
         BALR  14,15
         L     3,0(2)
         C     3,0(4)
         BNL   @@L276
@@L274   EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC39)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         A     3,=F'1'
         L     2,=A(MP@NUM)
         C     3,0(2)
         BL    @@L274
@@L276   EQU   *
         L     2,=A(MN@ENTRY)
         MVC   0(4,2),=F'0'
* Function i370_output_function_epilogue epilogue
         PDPEPIL
* Function i370_output_function_epilogue literal pool
         DS    0F
         LTORG
* Function i370_output_function_epilogue page table
         DS    0F
@@PGT24  EQU   *
         DC    A(@@PG24)
@@LC40   EQU   *
         DC    C'%s'
         DC    X'0'
         DS    0F
* X-func t_fputs prologue
T@FPUTS  PDPPRLG CINDEX=25,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN25
         LTORG
@@FEN25  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG25   EQU   *
         LR    11,1
         L     10,=A(@@PGT25)
* Function t_fputs code
         L     2,4(11)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC40)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,104(2)
         LPR   15,2
         BCTR  15,0
         SRL   15,31
         BCTR  15,0
* Function t_fputs epilogue
         PDPEPIL
* Function t_fputs literal pool
         DS    0F
         LTORG
* Function t_fputs page table
         DS    0F
@@PGT25  EQU   *
         DC    A(@@PG25)
@@LC41   EQU   *
         DC    C'%.*s'
         DC    X'0'
         DS    0F
* X-func t_fwrite prologue
T@FWRITE PDPPRLG CINDEX=26,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN26
         LTORG
@@FEN26  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG26   EQU   *
         LR    11,1
         L     10,=A(@@PGT26)
* Function t_fwrite code
         SLR   2,2
         SLR   3,3
         L     4,8(11)
         LR    3,4
         M     2,4(11)
         MVC   88(4,13),12(11)
         MVC   92(4,13),=A(@@LC41)
         ST    3,96(13)
         MVC   100(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         LR    15,4
* Function t_fwrite epilogue
         PDPEPIL
* Function t_fwrite literal pool
         DS    0F
         LTORG
* Function t_fwrite page table
         DS    0F
@@PGT26  EQU   *
         DC    A(@@PG26)
         DS    0F
* X-func t_fprintf prologue
T@FPRINT PDPPRLG CINDEX=27,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN27
         LTORG
@@FEN27  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG27   EQU   *
         LR    11,1
         L     10,=A(@@PGT27)
* Function t_fprintf code
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         LA    2,8(,11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@VFPRIN)
         BALR  14,15
* Function t_fprintf epilogue
         PDPEPIL
* Function t_fprintf literal pool
         DS    0F
         LTORG
* Function t_fprintf page table
         DS    0F
@@PGT27  EQU   *
         DC    A(@@PG27)
* Program data area
         DS    0F
@@14     EQU   *
         DC    F'0'
* Program text area
@@LC42   EQU   *
         DC    C'%c'
         DC    X'0'
         DS    0F
* X-func t_fputc prologue
T@FPUTC  PDPPRLG CINDEX=28,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN28
         LTORG
@@FEN28  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG28   EQU   *
         LR    11,1
         L     10,=A(@@PGT28)
* Function t_fputc code
         L     5,0(11)
         LA    2,5(0,0)
         CLR   5,2
         BE    @@L304
         LA    2,21(0,0)
         CLR   5,2
         BE    @@L305
         L     2,=A(@@14)
         L     3,0(2)
         L     4,=A(@@15)
         STC   5,0(4,3)
@@L303   EQU   *
         A     3,=F'1'
         ST    3,0(2)
         B     @@L298
@@L305   EQU   *
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(@@LC42)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L298
@@L304   EQU   *
         L     2,=A(@@14)
         L     2,0(2)
         LA    3,8(0,0)
         CR    2,3
         BH    @@L284
@@L289   EQU   *
         L     2,=A(@@14)
         L     3,0(2)
         L     4,=A(@@15)
         LA    6,64(0,0)
         STC   6,0(4,3)
         A     3,=F'1'
         ST    3,0(2)
         LA    2,8(0,0)
         CR    3,2
         BNH   @@L289
         B     @@L298
@@L284   EQU   *
         L     2,=A(@@14)
         L     2,0(2)
         LA    3,14(0,0)
         CR    2,3
         BH    @@L291
@@L296   EQU   *
         L     2,=A(@@14)
         L     3,0(2)
         L     4,=A(@@15)
         LA    6,64(0,0)
         STC   6,0(4,3)
         A     3,=F'1'
         ST    3,0(2)
         LA    2,14(0,0)
         CR    3,2
         BNH   @@L296
         B     @@L298
@@L291   EQU   *
         L     2,=A(@@14)
         L     3,0(2)
         L     4,=A(@@15)
         LA    6,64(0,0)
         STC   6,0(4,3)
         B     @@L303
@@L298   EQU   *
         LR    15,5
* Function t_fputc epilogue
         PDPEPIL
* Function t_fputc literal pool
         DS    0F
         LTORG
* Function t_fputc page table
         DS    0F
@@PGT28  EQU   *
         DC    A(@@PG28)
         DS    0F
* X-func t_vfprintf prologue
T@VFPRIN PDPPRLG CINDEX=29,FRAME=2104,BASER=12,ENTRY=YES
         B     @@FEN29
         LTORG
@@FEN29  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG29   EQU   *
         LR    11,1
         L     10,=A(@@PGT29)
* Function t_vfprintf code
         L     7,0(11)
         LA    3,104(,13)
         ST    3,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(VSPRINTF)
         BALR  14,15
         SLR   6,6
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    @@L329
         LR    5,3
@@L327   EQU   *
         IC    3,0(5)
         CLM   3,1,=XL1'05'
         BE    @@L332
         L     15,=A(@@15)
         L     4,=A(@@14)
         L     2,0(4)
         STC   3,0(15,2)
         A     2,=F'1'
         ST    2,0(4)
         CLM   3,1,=XL1'15'
         BE    @@L333
@@L325   EQU   *
         A     5,=F'1'
         A     6,=F'1'
         IC    2,0(5)
         CLM   2,1,=XL1'00'
         BNE   @@L327
         B     @@L329
@@L333   EQU   *
         ST    15,88(13)
         ST    2,92(13)
         MVC   96(4,13),=F'1'
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(FWRITE)
         BALR  14,15
         MVC   0(4,4),=F'0'
         B     @@L325
@@L332   EQU   *
         L     2,=A(@@14)
         L     2,0(2)
         LA    3,8(0,0)
         CR    2,3
         BH    @@L311
@@L316   EQU   *
         L     2,=A(@@14)
         L     3,0(2)
         L     4,=A(@@15)
         LA    8,64(0,0)
         STC   8,0(4,3)
         A     3,=F'1'
         ST    3,0(2)
         LA    2,8(0,0)
         CR    3,2
         BNH   @@L316
         B     @@L325
@@L311   EQU   *
         L     2,=A(@@14)
         L     2,0(2)
         LA    3,14(0,0)
         CR    2,3
         BH    @@L318
@@L323   EQU   *
         L     2,=A(@@14)
         L     3,0(2)
         L     4,=A(@@15)
         LA    8,64(0,0)
         STC   8,0(4,3)
         A     3,=F'1'
         ST    3,0(2)
         LA    2,14(0,0)
         CR    3,2
         BNH   @@L323
         B     @@L325
@@L318   EQU   *
         L     2,=A(@@14)
         L     3,0(2)
         L     4,=A(@@15)
         LA    8,64(0,0)
         STC   8,0(4,3)
         A     3,=F'1'
         ST    3,0(2)
         B     @@L325
@@L329   EQU   *
         LR    15,6
* Function t_vfprintf epilogue
         PDPEPIL
* Function t_vfprintf literal pool
         DS    0F
         LTORG
* Function t_vfprintf page table
         DS    0F
@@PGT29  EQU   *
         DC    A(@@PG29)
* X-var mp_code
         ENTRY MP@CODE
         DS    0F
MP@CODE  EQU   *
         DC    4X'00'
* X-var mp_lit
         ENTRY MP@LIT
         DS    0F
MP@LIT   EQU   *
         DC    4X'00'
* X-var function_base_page
         ENTRY FUNCTION
         DS    0F
FUNCTION EQU   *
         DC    4X'00'
         DS    0F
@@15     EQU   *
         DC    2000X'00'
         END
