         COPY  PDPTOP
         CSECT
* Program text area
         DS    0F
* S-func count_bb_insns prologue
@@0      PDPPRLG CINDEX=0,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function count_bb_insns code
         L     4,0(11)
         SLR   15,15
         L     2,0(4)
@@L8     EQU   *
         LH    3,0(2)
         CLM   3,3,=H'34'
         BE    @@L6
         CLM   3,3,=H'32'
         BE    @@L6
@@L5     EQU   *
         CL    2,4(4)
         BE    @@L3
         L     2,12(2)
         B     @@L8
@@L6     EQU   *
         A     15,=F'1'
         B     @@L5
@@L3     EQU   *
* Function count_bb_insns epilogue
         PDPEPIL
* Function count_bb_insns literal pool
         DS    0F
         LTORG
* Function count_bb_insns page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
         DS    0F
* S-func first_active_insn prologue
@@1      PDPPRLG CINDEX=1,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function first_active_insn code
         L     15,0(11)
         L     3,0(15)
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L21
@@L10    EQU   *
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L16
@@L19    EQU   *
         LH    2,0(3)
         SLR   15,15
         CLM   2,3,=H'33'
         BE    @@L9
         LR    15,3
         B     @@L9
@@L16    EQU   *
         CL    3,4(15)
         BE    @@L20
         L     3,12(3)
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L16
         B     @@L19
@@L20    EQU   *
         SLR   15,15
         B     @@L9
@@L21    EQU   *
         CL    3,4(15)
         BE    @@L20
         L     3,12(3)
         B     @@L10
@@L9     EQU   *
* Function first_active_insn epilogue
         PDPEPIL
* Function first_active_insn literal pool
         DS    0F
         LTORG
* Function first_active_insn page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
         DS    0F
* S-func last_active_insn_p prologue
@@2      PDPPRLG CINDEX=2,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function last_active_insn_p code
         L     3,0(11)
         L     15,4(11)
@@L23    EQU   *
         CL    15,4(3)
         BE    @@L29
         L     15,12(15)
         LH    2,0(15)
         CLM   2,3,=H'37'
         BE    @@L23
         X     2,=F'33'
         SLL   2,16
         SRA   2,16
         LPR   2,2
         BCTR  2,0
         N     2,=XL4'0000FFFF'
         SRL   2,15
         LR    15,2
         SLL   15,16
         SRA   15,16
         B     @@L22
@@L29    EQU   *
         LA    15,1(0,0)
@@L22    EQU   *
* Function last_active_insn_p epilogue
         PDPEPIL
* Function last_active_insn_p literal pool
         DS    0F
         LTORG
* Function last_active_insn_p page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
         DS    0F
* S-func seq_contains_jump prologue
@@3      PDPPRLG CINDEX=3,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function seq_contains_jump code
         L     3,0(11)
         LTR   3,3
         BE    @@L37
@@L35    EQU   *
         LH    2,0(3)
         LA    15,1(0,0)
         CLM   2,3,=H'33'
         BE    @@L30
         L     3,12(3)
         LTR   3,3
         BNE   @@L35
@@L37    EQU   *
         SLR   15,15
@@L30    EQU   *
* Function seq_contains_jump epilogue
         PDPEPIL
* Function seq_contains_jump literal pool
         DS    0F
         LTORG
* Function seq_contains_jump page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
@@LC0    EQU   *
         DC    C'<stdin>'
         DC    X'0'
@@LC1    EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* S-func cond_exec_process_insns prologue
@@4      PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN4
         LTORG
@@FEN4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         LR    11,1
         L     10,=A(@@PGT4)
* Function cond_exec_process_insns code
         L     8,4(11)
         L     6,8(11)
         L     5,12(11)
         L     7,16(11)
         SLR   4,4
         L     3,0(11)
@@L39    EQU   *
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L43
         CLM   2,3,=H'32'
         BE    @@L44
         CLM   2,3,=H'34'
         BE    @@L44
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'232'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L44    EQU   *
         L     2,=V(RL@COMP)
         L     2,0(2)
         LTR   2,2
         BE    @@L45
         L     2,16(3)
         LH    2,0(2)
         CLM   2,3,=H'48'
         BE    @@L51
@@L45    EQU   *
         SLR   15,15
         LTR   4,4
         BNE   @@L38
         ST    6,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(MODINP)
         BALR  14,15
         LTR   15,15
         BE    @@L47
         LR    15,4
         LTR   7,7
         BE    @@L38
         LA    4,1(0,0)
@@L47    EQU   *
         L     2,16(3)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         MVC   88(4,13),=F'38'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    3,88(13)
         A     3,=F'16'
         ST    3,92(13)
         A     3,=F'-16'
         ST    15,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         LH    2,0(3)
         CLM   2,3,=H'34'
         BE    @@L52
@@L43    EQU   *
         LA    15,1(0,0)
         CLR   3,8
         BE    @@L38
         L     3,12(3)
         B     @@L39
@@L52    EQU   *
         LTR   5,5
         BE    @@L43
         MVC   88(4,13),=F'16'
         ST    5,92(13)
         MVC   96(4,13),28(3)
         LA    1,88(,13)
         L     15,=V(ALLOC@EX)
         BALR  14,15
         ST    3,88(13)
         A     3,=F'28'
         ST    3,92(13)
         A     3,=F'-28'
         ST    15,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         B     @@L43
@@L51    EQU   *
         MVC   0(2,3),=H'37'
         MVC   20(4,3),=F'-99'
         MVC   16(4,3),=F'0'
         B     @@L43
@@L38    EQU   *
* Function cond_exec_process_insns epilogue
         PDPEPIL
* Function cond_exec_process_insns literal pool
         DS    0F
         LTORG
* Function cond_exec_process_insns page table
         DS    0F
@@PGT4   EQU   *
         DC    A(@@PG4)
         DS    0F
* S-func cond_exec_get_condition prologue
@@5      PDPPRLG CINDEX=5,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN5
         LTORG
@@FEN5   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         LR    11,1
         L     10,=A(@@PGT5)
* Function cond_exec_get_condition code
         L     4,0(11)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L53
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(PC@SET)
         BALR  14,15
         L     2,8(15)
         L     3,4(2)
         L     15,12(2)
         LH    2,0(15)
         CLM   2,3,=H'67'
         BE    @@L59
@@L56    EQU   *
         LR    2,3
         B     @@L53
@@L59    EQU   *
         L     2,4(15)
         CL    2,32(4)
         BNE   @@L56
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L53
         ST    15,88(13)
         SLR   2,2
         IC    2,2(3)
         ST    2,92(13)
         MVC   96(4,13),4(3)
         MVC   100(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    3,15
         B     @@L56
@@L53    EQU   *
         LR    15,2
* Function cond_exec_get_condition epilogue
         PDPEPIL
* Function cond_exec_get_condition literal pool
         DS    0F
         LTORG
* Function cond_exec_get_condition page table
         DS    0F
@@PGT5   EQU   *
         DC    A(@@PG5)
@@LC2    EQU   *
         DC    C'%d insn%s converted to conditional execution.'
         DC    X'15'
         DC    X'0'
@@LC3    EQU   *
         DC    C' was'
         DC    X'0'
@@LC4    EQU   *
         DC    C's were'
         DC    X'0'
         DS    0F
* S-func cond_exec_process_if_block prologue
@@6      PDPPRLG CINDEX=6,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN6
         LTORG
@@FEN6   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG6    EQU   *
         LR    11,1
         L     10,=A(@@PGT6)
* Function cond_exec_process_if_block code
         L     9,8(11)
         SLR   7,7
         ST    7,112(13)
         L     2,0(11)
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=A(@@5)
         BALR  14,15
         LR    6,15
         LR    3,15
         LTR   15,15
         BE    @@L60
         L     3,0(11)
         MVC   88(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(ONLYJUMP)
         BALR  14,15
         LR    3,7
         LTR   15,15
         BE    @@L60
         L     4,4(11)
         L     8,0(4)
         L     5,4(4)
         LH    2,0(8)
         CLM   2,3,=H'36'
         BE    @@L89
@@L63    EQU   *
         LH    3,0(5)
         CLM   3,3,=H'32'
         BE    @@L90
@@L64    EQU   *
         CLM   3,3,=H'33'
         BE    @@L87
@@L65    EQU   *
         LTR   9,9
         BE    @@L67
         L     2,0(9)
         MVC   112(4,13),12(2)
         L     7,4(9)
         LH    3,0(7)
         CLM   3,3,=H'32'
         BE    @@L91
@@L68    EQU   *
         CLM   3,3,=H'33'
         BE    @@L88
@@L67    EQU   *
         MVC   116(4,13),=F'0'
         LTR   9,9
         BE    @@L71
         LA    2,4(0,0)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         ST    15,116(13)
@@L72    EQU   *
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         A     15,116(13)
         ST    15,116(13)
         SLR   3,3
         CR    15,2
         BH    @@L60
         ST    6,88(13)
         L     2,0(11)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         LTR   15,15
         BNE   @@L92
@@L74    EQU   *
         LR    4,15
         L     3,0(11)
         MVC   88(4,13),4(3)
         MVC   92(4,13),=F'16'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L76
         L     3,4(15)
         MVC   88(4,13),=F'0'
         L     2,=F'10000'
         S     2,4(3)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
@@L77    EQU   *
         LPR   2,9
         BCTR  2,0
         SRL   2,31
         LTR   5,5
         BE    @@L79
         LTR   4,4
         BE    @@L81
         ST    8,88(13)
         ST    5,92(13)
         ST    4,96(13)
         ST    15,100(13)
         ST    2,104(13)
         LA    1,88(,13)
         L     15,=A(@@4)
         BALR  14,15
         LTR   15,15
         BE    @@L81
@@L79    EQU   *
         LTR   9,9
         BE    @@L82
         MVC   88(4,13),112(13)
         ST    7,92(13)
         ST    6,96(13)
         ST    3,100(13)
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@4)
         BALR  14,15
         LTR   15,15
         BE    @@L81
@@L82    EQU   *
         LA    1,88(,13)
         L     15,=V(APPLY@CH)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L60
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BE    @@L84
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC2)
         MVC   96(4,13),116(13)
         L     2,=A(@@LC3)
         L     3,116(13)
         LA    4,1(0,0)
         CLR   3,4
         BE    @@L86
         L     2,=A(@@LC4)
@@L86    EQU   *
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L84    EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         ST    9,96(13)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
         LA    3,1(0,0)
         B     @@L60
@@L81    EQU   *
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(CANCEL@C)
         BALR  14,15
         SLR   3,3
         B     @@L60
@@L76    EQU   *
         B     @@L77
@@L92    EQU   *
         ST    15,88(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         MVC   96(4,13),4(6)
         MVC   100(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L74
@@L71    EQU   *
         LA    2,2(0,0)
         B     @@L72
@@L88    EQU   *
         L     7,8(7)
         B     @@L67
@@L91    EQU   *
         L     15,16(7)
         LH    2,0(15)
         CLM   2,3,=H'48'
         BNE   @@L68
         L     2,4(15)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L68
         B     @@L88
@@L87    EQU   *
         L     5,8(5)
         B     @@L65
@@L90    EQU   *
         L     15,16(5)
         LH    2,0(15)
         CLM   2,3,=H'48'
         BNE   @@L64
         L     2,4(15)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L64
         B     @@L87
@@L89    EQU   *
         L     8,12(8)
         B     @@L63
@@L60    EQU   *
         LR    15,3
* Function cond_exec_process_if_block epilogue
         PDPEPIL
* Function cond_exec_process_if_block literal pool
         DS    0F
         LTORG
* Function cond_exec_process_if_block page table
         DS    0F
@@PGT6   EQU   *
         DC    A(@@PG6)
         DS    0F
* S-func noce_emit_store_flag prologue
@@8      PDPPRLG CINDEX=7,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN7
         LTORG
@@FEN7   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG7    EQU   *
         LR    11,1
         L     10,=A(@@PGT7)
* Function noce_emit_store_flag code
         L     7,0(11)
         L     8,4(11)
         L     9,12(11)
         L     4,28(7)
         SLR   6,6
         MVC   88(4,13),4(4)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(GENERAL@)
         BALR  14,15
         LTR   15,15
         BNE   @@L107
@@L95    EQU   *
         LA    6,1(0,0)
@@L94    EQU   *
         LTR   6,6
         BNE   @@L108
@@L96    EQU   *
         L     2,8(11)
         LTR   2,2
         BNE   @@L109
         LH    5,0(4)
         N     5,=XL4'0000FFFF'
@@L98    EQU   *
         L     2,32(7)
         CL    2,24(7)
         BE    @@L100
         LTR   6,6
         BE    @@L99
@@L100   EQU   *
         LA    2,1(0,0)
         CLR   9,2
         BNH   @@L110
@@L99    EQU   *
         SLR   15,15
         LTR   6,6
         BNE   @@L93
         ST    8,88(13)
         ST    5,92(13)
         MVC   96(4,13),4(4)
         MVC   100(4,13),8(4)
         ST    6,104(13)
         LR    3,6
         LR    2,5
         A     2,=F'-110'
         LA    4,1(0,0)
         CLR   2,4
         BNH   @@L106
         LA    2,108(0,0)
         CLR   5,2
         BE    @@L106
         LA    4,109(0,0)
         CLR   5,4
         BE    @@L106
@@L105   EQU   *
         ST    3,108(13)
         ST    9,112(13)
         LA    1,88(,13)
         L     15,=V(EMSFLAG)
         BALR  14,15
         B     @@L93
@@L106   EQU   *
         LA    3,1(0,0)
         B     @@L105
@@L110   EQU   *
         ST    5,88(13)
         SLR   2,2
         IC    2,2(8)
         ST    2,92(13)
         MVC   96(4,13),4(4)
         MVC   100(4,13),8(4)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    8,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         L     2,20(15)
         LTR   2,2
         BL    @@L111
@@L103   EQU   *
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(EMISN)
         BALR  14,15
         MVC   32(4,7),24(7)
         LR    15,8
         B     @@L93
@@L111   EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(RECOG@ME)
         BALR  14,15
         LTR   15,15
         BNL   @@L103
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         B     @@L99
@@L109   EQU   *
         ST    4,88(13)
         MVC   92(4,13),24(7)
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         LR    5,15
         B     @@L98
@@L108   EQU   *
         MVC   88(4,13),24(7)
         LA    1,88(,13)
         L     15,=V(PC@SET)
         BALR  14,15
         L     2,8(15)
         L     4,4(2)
         B     @@L96
@@L107   EQU   *
         MVC   88(4,13),8(4)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(GENERAL@)
         BALR  14,15
         LTR   15,15
         BNE   @@L94
         B     @@L95
@@L93    EQU   *
* Function noce_emit_store_flag epilogue
         PDPEPIL
* Function noce_emit_store_flag literal pool
         DS    0F
         LTORG
* Function noce_emit_store_flag page table
         DS    0F
@@PGT7   EQU   *
         DC    A(@@PG7)
         DS    0F
* S-func noce_emit_move_insn prologue
@@9      PDPPRLG CINDEX=8,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN8
         LTORG
@@FEN8   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG8    EQU   *
         LR    11,1
         L     10,=A(@@PGT8)
* Function noce_emit_move_insn code
         L     3,0(11)
         L     15,4(11)
         LH    2,0(3)
         CLM   2,3,=H'64'
         BE    @@L113
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         B     @@L112
@@L113   EQU   *
         L     2,4(3)
         L     3,4(2)
         SLR   5,5
         IC    5,2(2)
         SLR   4,4
         IC    4,2(3)
         L     6,8(2)
         SLL   6,3
         ST    3,88(13)
         L     3,=V(MODE@BIT)
         LR    2,5
         MH    2,=H'2'
         LH    2,0(2,3)
         N     2,=XL4'0000FFFF'
         ST    2,92(13)
         ST    6,96(13)
         ST    5,100(13)
         ST    15,104(13)
         MH    4,=H'2'
         LH    2,0(4,3)
         N     2,=XL4'0000FFFF'
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=V(STORE@BI)
         BALR  14,15
@@L112   EQU   *
* Function noce_emit_move_insn epilogue
         PDPEPIL
* Function noce_emit_move_insn literal pool
         DS    0F
         LTORG
* Function noce_emit_move_insn page table
         DS    0F
@@PGT8   EQU   *
         DC    A(@@PG8)
         DS    0F
* S-func noce_try_store_flag prologue
@@10     PDPPRLG CINDEX=9,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN9
         LTORG
@@FEN9   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG9    EQU   *
         LR    11,1
         L     10,=A(@@PGT9)
* Function noce_try_store_flag code
         L     4,0(11)
         L     15,20(4)
         LH    2,0(15)
         CLM   2,3,=H'54'
         BE    @@L122
@@L115   EQU   *
         L     2,=V(CIRTX)
         CL    15,256(2)
         BE    @@L123
@@L117   EQU   *
         SLR   15,15
         B     @@L114
@@L123   EQU   *
         L     3,16(4)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L117
         L     2,4(3)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L117
         MVC   88(4,13),28(4)
         MVC   92(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         LTR   15,15
         BE    @@L117
@@L116   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),12(4)
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L119
         L     3,12(4)
         CLR   15,3
         BE    @@L120
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
@@L120   EQU   *
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(EMISBF)
         BALR  14,15
         LA    15,1(0,0)
         B     @@L114
@@L119   EQU   *
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,2
         B     @@L114
@@L122   EQU   *
         L     2,4(15)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L115
         L     3,16(4)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L115
         SLR   2,2
         B     @@L116
@@L114   EQU   *
* Function noce_try_store_flag epilogue
         PDPEPIL
* Function noce_try_store_flag literal pool
         DS    0F
         LTORG
* Function noce_try_store_flag page table
         DS    0F
@@PGT9   EQU   *
         DC    A(@@PG9)
         DS    0F
* S-func noce_try_store_flag_constants prologue
@@11     PDPPRLG CINDEX=10,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN10
         LTORG
@@FEN10  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG10   EQU   *
         LR    11,1
         L     10,=A(@@PGT10)
* Function noce_try_store_flag_constants code
         L     9,0(11)
         L     2,=V(NO@NEW@P)
         L     6,0(2)
         LTR   6,6
         BNE   @@L125
         L     4,16(9)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L167
@@L125   EQU   *
         SLR   3,3
         B     @@L124
@@L167   EQU   *
         L     3,20(9)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L125
         L     2,12(9)
         SLR   7,7
         IC    7,2(2)
         L     4,4(4)
         L     5,4(3)
         LR    2,6
         LR    6,5
         SR    6,4
         BNH   @@L127
         LA    2,1(0,0)
@@L127   EQU   *
         LR    3,4
         SRL   3,31
         LR    15,5
         SRL   15,31
         XR    15,3
         LTR   15,15
         BNE   @@L133
         LR    3,15
         CR    4,5
         BNL   @@L133
         LA    3,1(0,0)
@@L133   EQU   *
         CLR   2,3
         BNE   @@L125
         ST    6,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),28(9)
         MVC   92(4,13),24(9)
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L134
         LA    3,1(0,0)
@@L134   EQU   *
         SLR   8,8
         LA    6,1(0,0)
         CLR   2,6
         BE    @@L136
         L     6,=F'-1'
         CLR   2,6
         BE    @@L136
         LTR   4,4
         BE    @@L168
@@L138   EQU   *
         LTR   5,5
         BNE   @@L125
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L125
         LTR   3,3
         BE    @@L125
         LA    6,1(0,0)
         LR    8,6
@@L137   EQU   *
         LTR   8,8
         BNE   @@L169
@@L148   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),12(9)
         ST    8,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L166
         LA    6,1(0,0)
         CLR   2,6
         BE    @@L151
         L     6,=F'-1'
         CLR   2,6
         BE    @@L151
         LTR   4,4
         BE    @@L170
@@L155   EQU   *
         L     6,=F'-1'
         CLR   5,6
         BE    @@L171
         MVC   88(4,13),=F'0'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=F'83'
         ST    3,96(13)
         ST    15,100(13)
         MVC   104(4,13),12(9)
         MVC   108(4,13),=F'0'
         MVC   112(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(EXPSBIN)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L154
         MVC   88(4,13),=F'0'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=F'75'
@@L163   EQU   *
         ST    3,96(13)
         ST    15,100(13)
@@L165   EQU   *
         MVC   104(4,13),12(9)
         MVC   108(4,13),=F'0'
@@L164   EQU   *
         MVC   112(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(EXPSBIN)
         BALR  14,15
         LR    3,15
@@L154   EQU   *
         LTR   3,3
         BE    @@L166
         L     2,12(9)
         CLR   3,2
         BE    @@L161
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
@@L161   EQU   *
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@3)
         BALR  14,15
         SLR   3,3
         LTR   15,15
         BNE   @@L124
         ST    2,88(13)
         MVC   92(4,13),24(9)
         LA    1,88(,13)
         L     15,=V(EMISBF)
         BALR  14,15
         LA    3,1(0,0)
         B     @@L124
@@L166   EQU   *
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         B     @@L124
@@L171   EQU   *
         MVC   88(4,13),=F'0'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=F'84'
         B     @@L163
@@L170   EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LTR   15,15
         BL    @@L155
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=F'87'
         ST    3,96(13)
         ST    15,100(13)
         MVC   104(4,13),12(9)
         ST    4,108(13)
         B     @@L164
@@L151   EQU   *
         MVC   88(4,13),=F'0'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    7,88(13)
         X     2,=F'1'
         LPR   2,2
         LCR   2,2
         SRL   2,31
         A     2,=F'75'
         ST    2,92(13)
         ST    15,96(13)
         ST    3,100(13)
         B     @@L165
@@L169   EQU   *
         LR    15,5
         LR    5,4
         LR    4,15
         LCR   2,2
         ST    2,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(TRUNC@IN)
         BALR  14,15
         LR    2,15
         B     @@L148
@@L168   EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(EXACT@LO)
         BALR  14,15
         LA    6,1(0,0)
         LTR   15,15
         BNL   @@L137
         B     @@L138
@@L136   EQU   *
         LR    6,8
         B     @@L137
@@L124   EQU   *
         LR    15,3
* Function noce_try_store_flag_constants epilogue
         PDPEPIL
* Function noce_try_store_flag_constants literal pool
         DS    0F
         LTORG
* Function noce_try_store_flag_constants page table
         DS    0F
@@PGT10  EQU   *
         DC    A(@@PG10)
         DS    0F
* S-func noce_try_store_flag_inc prologue
@@12     PDPPRLG CINDEX=11,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN11
         LTORG
@@FEN11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG11   EQU   *
         LR    11,1
         L     10,=A(@@PGT11)
* Function noce_try_store_flag_inc code
         SLR   15,15
* Function noce_try_store_flag_inc epilogue
         PDPEPIL
* Function noce_try_store_flag_inc literal pool
         DS    0F
         LTORG
* Function noce_try_store_flag_inc page table
         DS    0F
@@PGT11  EQU   *
         DC    A(@@PG11)
         DS    0F
* S-func noce_try_store_flag_mask prologue
@@13     PDPPRLG CINDEX=12,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN12
         LTORG
@@FEN12  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG12   EQU   *
         LR    11,1
         L     10,=A(@@PGT12)
* Function noce_try_store_flag_mask code
         SLR   15,15
* Function noce_try_store_flag_mask epilogue
         PDPEPIL
* Function noce_try_store_flag_mask literal pool
         DS    0F
         LTORG
* Function noce_try_store_flag_mask page table
         DS    0F
@@PGT12  EQU   *
         DC    A(@@PG12)
         DS    0F
* S-func noce_emit_cmove prologue
@@14     PDPPRLG CINDEX=13,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN13
         LTORG
@@FEN13  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG13   EQU   *
         LR    11,1
         L     10,=A(@@PGT13)
* Function noce_emit_cmove code
         L     3,0(11)
         L     5,4(11)
         L     4,12(11)
         L     6,16(11)
         L     2,32(3)
         CL    2,24(3)
         BE    @@L197
@@L191   EQU   *
         ST    4,88(13)
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GENERAL@)
         BALR  14,15
         LTR   15,15
         BNE   @@L198
@@L196   EQU   *
         SLR   2,2
         B     @@L190
@@L198   EQU   *
         ST    6,88(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GENERAL@)
         BALR  14,15
         SLR   2,2
         LTR   15,15
         BNE   @@L190
         B     @@L196
@@L197   EQU   *
         MVC   88(4,13),8(11)
         L     2,28(3)
         SLR   3,3
         IC    3,2(2)
         ST    3,92(13)
         ST    4,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'72'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         ST    15,96(13)
         MVC   100(4,13),24(11)
         MVC   104(4,13),20(11)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    5,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         L     2,20(15)
         LTR   2,2
         BL    @@L199
@@L194   EQU   *
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(EMISN)
         BALR  14,15
         LR    2,5
         B     @@L190
@@L199   EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(RECOG@ME)
         BALR  14,15
         LTR   15,15
         BNL   @@L194
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         B     @@L191
@@L190   EQU   *
         LR    15,2
* Function noce_emit_cmove epilogue
         PDPEPIL
* Function noce_emit_cmove literal pool
         DS    0F
         LTORG
* Function noce_emit_cmove page table
         DS    0F
@@PGT13  EQU   *
         DC    A(@@PG13)
         DS    0F
* S-func noce_try_cmove prologue
@@15     PDPPRLG CINDEX=14,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN14
         LTORG
@@FEN14  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG14   EQU   *
         LR    11,1
         L     10,=A(@@PGT14)
* Function noce_try_cmove code
         L     4,0(11)
         L     15,16(4)
         LH    3,0(15)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L202
         CLM   3,3,=H'54'
         BE    @@L202
         CLM   3,3,=H'55'
         BE    @@L202
         CLM   3,3,=H'58'
         BE    @@L202
         CLM   3,3,=H'134'
         BE    @@L202
         CLM   3,3,=H'56'
         BE    @@L202
         CLM   3,3,=H'140'
         BE    @@L202
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(REGISTER)
         BALR  14,15
         LTR   15,15
         BE    @@L201
@@L202   EQU   *
         L     15,20(4)
         LH    3,0(15)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L203
         CLM   3,3,=H'54'
         BE    @@L203
         CLM   3,3,=H'55'
         BE    @@L203
         CLM   3,3,=H'58'
         BE    @@L203
         CLM   3,3,=H'134'
         BE    @@L203
         CLM   3,3,=H'56'
         BE    @@L203
         CLM   3,3,=H'140'
         BE    @@L203
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(REGISTER)
         BALR  14,15
         LTR   15,15
         BE    @@L201
@@L203   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         L     2,28(4)
         LH    3,0(2)
         N     3,=XL4'0000FFFF'
         ST    4,88(13)
         MVC   92(4,13),12(4)
         ST    3,96(13)
         MVC   100(4,13),4(2)
         MVC   104(4,13),8(2)
         MVC   108(4,13),16(4)
         MVC   112(4,13),20(4)
         LA    1,88(,13)
         L     15,=A(@@14)
         BALR  14,15
         LTR   15,15
         BE    @@L204
         L     3,12(4)
         CLR   15,3
         BE    @@L205
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
@@L205   EQU   *
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(EMISBF)
         BALR  14,15
         LA    15,1(0,0)
         B     @@L200
@@L204   EQU   *
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
@@L201   EQU   *
         SLR   15,15
@@L200   EQU   *
* Function noce_try_cmove epilogue
         PDPEPIL
* Function noce_try_cmove literal pool
         DS    0F
         LTORG
* Function noce_try_cmove page table
         DS    0F
@@PGT14  EQU   *
         DC    A(@@PG14)
         DS    0F
* S-func noce_try_cmove_arith prologue
@@16     PDPPRLG CINDEX=15,FRAME=136,BASER=12,ENTRY=NO
         B     @@FEN15
         LTORG
@@FEN15  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG15   EQU   *
         LR    11,1
         L     10,=A(@@PGT15)
* Function noce_try_cmove_arith code
         L     9,0(11)
         L     6,16(9)
         L     5,20(9)
         MVC   120(4,13),12(9)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(MAY@TRAP)
         BALR  14,15
         LTR   15,15
         BE    @@L271
@@L270   EQU   *
         SLR   15,15
         B     @@L207
@@L271   EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(MAY@TRAP)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   @@L270
         L     2,28(9)
         LH    4,0(2)
         N     4,=XL4'0000FFFF'
         ST    4,128(13)
         L     7,4(9)
         MVC   124(4,13),8(9)
         ST    2,88(13)
         MVC   92(4,13),24(9)
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         LTR   15,15
         BNE   @@L272
@@L212   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    6,88(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GENERAL@)
         BALR  14,15
         LTR   15,15
         BNE   @@L217
         L     2,=V(NO@NEW@P)
         L     8,0(2)
         LTR   8,8
         BNE   @@L219
         LTR   7,7
         BE    @@L219
         SLR   2,2
         IC    2,2(6)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    6,15
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         LR    4,15
         LH    3,0(15)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'89'
         BE    @@L273
         LR    2,8
@@L225   EQU   *
         ST    6,4(2)
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         L     2,20(15)
         LTR   2,2
         BL    @@L274
@@L217   EQU   *
         ST    5,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GENERAL@)
         BALR  14,15
         LTR   15,15
         BNE   @@L231
         L     2,=V(NO@NEW@P)
         L     7,0(2)
         LTR   7,7
         BNE   @@L219
         L     2,124(13)
         LTR   2,2
         BE    @@L219
         SLR   2,2
         IC    2,2(5)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         LR    4,15
         LH    3,0(15)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'89'
         BE    @@L275
         LR    2,7
@@L238   EQU   *
         ST    5,4(2)
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         L     2,20(15)
         LTR   2,2
         BL    @@L276
@@L231   EQU   *
         ST    9,88(13)
         MVC   92(4,13),120(13)
         MVC   96(4,13),128(13)
         L     2,28(9)
         MVC   100(4,13),4(2)
         MVC   104(4,13),8(2)
         ST    6,108(13)
         ST    5,112(13)
         LA    1,88(,13)
         L     15,=A(@@14)
         BALR  14,15
         LTR   15,15
         BE    @@L219
         CL    15,120(13)
         BE    @@L267
         MVC   88(4,13),120(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
@@L267   EQU   *
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    4,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),24(9)
         LA    1,88(,13)
         L     15,=V(EMISBF)
         BALR  14,15
         LA    15,1(0,0)
         B     @@L207
@@L219   EQU   *
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         B     @@L270
@@L276   EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(RECOG@ME)
         BALR  14,15
         LTR   15,15
         BNL   @@L231
         B     @@L219
@@L275   EQU   *
         L     2,16(15)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L238
         ST    15,88(13)
         MVC   92(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
         B     @@L238
@@L274   EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(RECOG@ME)
         BALR  14,15
         LTR   15,15
         BNL   @@L217
         B     @@L219
@@L273   EQU   *
         L     2,16(15)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L225
         ST    15,88(13)
         MVC   92(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
         B     @@L225
@@L272   EQU   *
         ST    5,88(13)
         MVC   92(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L277
@@L269   EQU   *
         LA    3,1(0,0)
@@L214   EQU   *
         LTR   3,3
         BE    @@L212
         MVC   88(4,13),28(9)
         MVC   92(4,13),24(9)
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         ST    15,128(13)
         LR    4,6
         LR    6,5
         LR    5,4
         LR    4,7
         L     7,124(13)
         ST    4,124(13)
         B     @@L212
@@L277   EQU   *
         ST    5,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GENERAL@)
         BALR  14,15
         LTR   15,15
         BE    @@L214
         B     @@L269
@@L207   EQU   *
* Function noce_try_cmove_arith epilogue
         PDPEPIL
* Function noce_try_cmove_arith literal pool
         DS    0F
         LTORG
* Function noce_try_cmove_arith page table
         DS    0F
@@PGT15  EQU   *
         DC    A(@@PG15)
         DS    0F
* S-func noce_get_alt_condition prologue
@@17     PDPPRLG CINDEX=16,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN16
         LTORG
@@FEN16  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG16   EQU   *
         LR    11,1
         L     10,=A(@@PGT16)
* Function noce_get_alt_condition code
         L     8,0(11)
         MVC   88(4,13),4(11)
         MVC   92(4,13),28(8)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L279
         L     2,8(11)
         MVC   0(4,2),32(8)
         L     15,28(8)
         B     @@L278
@@L279   EQU   *
         MVC   88(4,13),24(8)
         LA    1,88(,13)
         L     15,=V(PC@SET)
         BALR  14,15
         L     2,8(15)
         L     9,4(2)
         ST    3,112(13)
         L     4,12(2)
         LH    2,0(4)
         CLM   2,3,=H'67'
         BE    @@L325
@@L280   EQU   *
         L     3,4(11)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L326
@@L281   EQU   *
         MVC   88(4,13),24(8)
         ST    9,92(13)
         MVC   96(4,13),112(13)
         MVC   100(4,13),8(11)
         MVC   104(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(CANONICA)
         BALR  14,15
         LR    9,15
         LTR   15,15
         BE    @@L317
         MVC   88(4,13),4(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L317
         L     4,24(8)
         L     2,8(11)
         CL    4,0(2)
         BE    @@L320
@@L311   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L327
@@L308   EQU   *
         L     4,8(4)
         L     3,8(11)
         CL    4,0(3)
         BNE   @@L311
@@L320   EQU   *
         L     2,8(11)
         L     4,0(2)
         CL    4,24(8)
         BE    @@L322
@@L318   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L328
@@L314   EQU   *
         L     4,12(4)
         CL    4,24(8)
         BNE   @@L318
@@L322   EQU   *
         LR    15,9
         B     @@L278
@@L328   EQU   *
         MVC   88(4,13),16(8)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(MODINP)
         BALR  14,15
         LTR   15,15
         BNE   @@L317
         MVC   88(4,13),20(8)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(MODINP)
         BALR  14,15
         LTR   15,15
         BE    @@L314
@@L317   EQU   *
         SLR   15,15
         B     @@L278
@@L327   EQU   *
         MVC   88(4,13),12(8)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L308
         B     @@L317
@@L326   EQU   *
         L     2,28(8)
         LH    6,0(2)
         N     6,=XL4'0000FFFF'
         L     7,4(2)
         L     5,8(2)
         L     2,32(8)
         L     4,8(2)
         LTR   4,4
         BE    @@L282
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L329
@@L282   EQU   *
         LH    2,0(5)
         CLM   2,3,=H'54'
         BE    @@L330
@@L289   EQU   *
         L     3,28(8)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         CLR   6,2
         BE    @@L331
@@L303   EQU   *
         ST    6,88(13)
         SLR   2,2
         IC    2,2(9)
         ST    2,92(13)
         ST    7,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     3,8(11)
         MVC   0(4,3),32(8)
         B     @@L278
@@L331   EQU   *
         CL    7,4(3)
         BNE   @@L303
         CL    5,8(3)
         BNE   @@L303
         B     @@L281
@@L330   EQU   *
         L     2,4(11)
         L     3,4(2)
         L     4,4(5)
         LA    2,105(0,0)
         CLR   6,2
         BE    @@L295
         BH    @@L301
         LA    2,104(0,0)
         CLR   6,2
         BNE   @@L289
         LR    2,3
         A     2,=F'1'
         CLR   4,2
         BNE   @@L289
         LA    6,105(0,0)
@@L324   EQU   *
         MVC   88(4,13),=F'0'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    5,15
         B     @@L289
@@L301   EQU   *
         LA    2,106(0,0)
         CLR   6,2
         BE    @@L293
         LA    2,107(0,0)
         CLR   6,2
         BNE   @@L289
         LR    2,3
         A     2,=F'1'
         CLR   4,2
         BNE   @@L289
         LA    6,106(0,0)
         B     @@L324
@@L293   EQU   *
         LR    2,3
         BCTR  2,0
         CLR   4,2
         BNE   @@L289
         LA    6,107(0,0)
         B     @@L324
@@L295   EQU   *
         LR    2,3
         BCTR  2,0
         CLR   4,2
         BNE   @@L289
         LA    6,104(0,0)
         B     @@L324
@@L329   EQU   *
         L     2,16(4)
         LH    2,0(2)
         CLM   2,3,=H'47'
         BNE   @@L282
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FREGEEN)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L332
@@L283   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L282
         ST    7,88(13)
         L     2,16(4)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L285
         LR    7,3
@@L286   EQU   *
         LH    2,0(7)
         CLM   2,3,=H'54'
         BNE   @@L282
         LR    2,7
         LR    7,5
         LR    5,2
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         LR    6,15
         B     @@L282
@@L285   EQU   *
         ST    5,88(13)
         L     2,16(4)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L286
         LR    5,3
         B     @@L286
@@L332   EQU   *
         L     2,16(4)
         L     3,8(2)
         B     @@L283
@@L325   EQU   *
         L     3,24(8)
         L     2,4(4)
         CL    2,32(3)
         BNE   @@L280
         MVC   112(4,13),=F'1'
         B     @@L280
@@L278   EQU   *
* Function noce_get_alt_condition epilogue
         PDPEPIL
* Function noce_get_alt_condition literal pool
         DS    0F
         LTORG
* Function noce_get_alt_condition page table
         DS    0F
@@PGT16  EQU   *
         DC    A(@@PG16)
         DS    0F
* S-func noce_try_minmax prologue
@@18     PDPPRLG CINDEX=17,FRAME=128,BASER=12,ENTRY=NO
         B     @@FEN17
         LTORG
@@FEN17  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG17   EQU   *
         LR    11,1
         L     10,=A(@@PGT17)
* Function noce_try_minmax code
         L     6,0(11)
         L     2,=V(NO@NEW@P)
         L     2,0(2)
         SLR   5,5
         LTR   2,2
         BNE   @@L333
         ST    6,88(13)
         MVC   92(4,13),16(6)
         LA    2,120(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@17)
         BALR  14,15
         LR    4,15
         LR    5,15
         LTR   15,15
         BE    @@L333
         LH    3,0(15)
         N     3,=XL4'0000FFFF'
         MVC   88(4,13),4(15)
         MVC   92(4,13),16(6)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L337
         MVC   88(4,13),8(4)
         MVC   92(4,13),20(6)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L333
@@L339   EQU   *
         A     3,=F'-104'
         LA    2,14(0,0)
         CLR   3,2
         BH    @@L356
         MH    3,=H'4'
         L     2,=A(@@L357)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L357   EQU   *
         DC    A(@@L351)
         DC    A(@@L351)
         DC    A(@@L347)
         DC    A(@@L347)
         DC    A(@@L355)
         DC    A(@@L355)
         DC    A(@@L353)
         DC    A(@@L353)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L351)
         DC    A(@@L351)
         DC    A(@@L347)
         DC    A(@@L347)
@@L347   EQU   *
         LA    5,93(0,0)
@@L362   EQU   *
         SLR   7,7
@@L343   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         L     3,12(6)
         SLR   2,2
         IC    2,2(3)
         ST    2,88(13)
         ST    5,92(13)
         MVC   96(4,13),16(6)
         MVC   100(4,13),20(6)
         ST    3,104(13)
         ST    7,108(13)
         MVC   112(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(EXPSBIN)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L363
         L     3,12(6)
         CLR   15,3
         BE    @@L359
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
@@L359   EQU   *
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@3)
         BALR  14,15
         SLR   5,5
         LTR   15,15
         BNE   @@L333
         ST    2,88(13)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(EMISBF)
         BALR  14,15
         ST    4,28(6)
         MVC   32(4,6),120(13)
         LA    5,1(0,0)
         B     @@L333
@@L363   EQU   *
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    5,2
         B     @@L333
@@L355   EQU   *
         LA    5,94(0,0)
@@L361   EQU   *
         LA    7,1(0,0)
         B     @@L343
@@L353   EQU   *
         LA    5,95(0,0)
         B     @@L361
@@L356   EQU   *
         SLR   5,5
         B     @@L333
@@L351   EQU   *
         LA    5,92(0,0)
         B     @@L362
@@L337   EQU   *
         MVC   88(4,13),8(4)
         MVC   92(4,13),16(6)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L364
         LR    5,15
         B     @@L333
@@L364   EQU   *
         MVC   88(4,13),4(4)
         MVC   92(4,13),20(6)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L333
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         LR    3,15
         B     @@L339
@@L333   EQU   *
         LR    15,5
* Function noce_try_minmax epilogue
         PDPEPIL
* Function noce_try_minmax literal pool
         DS    0F
         LTORG
* Function noce_try_minmax page table
         DS    0F
@@PGT17  EQU   *
         DC    A(@@PG17)
         DS    0F
* S-func noce_try_abs prologue
@@19     PDPPRLG CINDEX=18,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN18
         LTORG
@@FEN18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG18   EQU   *
         LR    11,1
         L     10,=A(@@PGT18)
* Function noce_try_abs code
         L     8,0(11)
         L     2,=V(NO@NEW@P)
         L     4,0(2)
         SLR   3,3
         LTR   4,4
         BNE   @@L365
         L     3,16(8)
         L     6,20(8)
         LH    2,0(3)
         CLM   2,3,=H'77'
         BE    @@L408
@@L367   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'77'
         BE    @@L409
@@L401   EQU   *
         SLR   3,3
         B     @@L365
@@L409   EQU   *
         MVC   88(4,13),4(6)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L401
         LR    6,3
         LA    9,1(0,0)
@@L368   EQU   *
         ST    8,88(13)
         ST    6,92(13)
         LA    2,112(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@17)
         BALR  14,15
         LR    7,15
         LR    3,15
         LTR   15,15
         BE    @@L365
         MVC   88(4,13),4(15)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L372
         L     5,8(7)
@@L373   EQU   *
         LH    2,0(5)
         CLM   2,3,=H'61'
         BE    @@L410
@@L376   EQU   *
         LH    2,0(5)
         CLM   2,3,=H'66'
         BE    @@L411
@@L385   EQU   *
         L     3,=V(CIRTX)
         CL    5,252(3)
         BE    @@L412
@@L386   EQU   *
         CL    5,260(3)
         BE    @@L413
@@L388   EQU   *
         SLR   2,2
         IC    2,2(6)
         MH    2,=H'4'
         L     3,=V(CONST@TI)
         CL    5,0(2,3)
         BNE   @@L401
@@L387   EQU   *
         LH    3,0(7)
         N     3,=XL4'0000FFFF'
         A     3,=F'-104'
         LA    2,14(0,0)
         CLR   3,2
         BH    @@L401
         MH    3,=H'4'
         L     2,=A(@@L402)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L402   EQU   *
         DC    A(@@L391)
         DC    A(@@L391)
         DC    A(@@L395)
         DC    A(@@L395)
         DC    A(@@L401)
         DC    A(@@L401)
         DC    A(@@L401)
         DC    A(@@L401)
         DC    A(@@L401)
         DC    A(@@L401)
         DC    A(@@L401)
         DC    A(@@L391)
         DC    A(@@L391)
         DC    A(@@L395)
         DC    A(@@L395)
@@L395   EQU   *
         LPR   9,9
         BCTR  9,0
         SRL   9,31
@@L391   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         L     3,12(8)
         SLR   2,2
         IC    2,2(3)
         ST    2,88(13)
         MVC   92(4,13),=F'129'
         ST    6,96(13)
         ST    3,100(13)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPSUNOP)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L403
         LTR   9,9
         BNE   @@L414
@@L403   EQU   *
         LTR   3,3
         BE    @@L415
         L     2,12(8)
         CLR   3,2
         BE    @@L405
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
@@L405   EQU   *
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@3)
         BALR  14,15
         SLR   3,3
         LTR   15,15
         BNE   @@L365
         ST    2,88(13)
         MVC   92(4,13),24(8)
         LA    1,88(,13)
         L     15,=V(EMISBF)
         BALR  14,15
         ST    7,28(8)
         MVC   32(4,8),112(13)
         LA    3,1(0,0)
         B     @@L365
@@L415   EQU   *
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         B     @@L365
@@L414   EQU   *
         SLR   2,2
         IC    2,2(15)
         ST    2,88(13)
         MVC   92(4,13),=F'77'
         ST    15,96(13)
         MVC   100(4,13),12(8)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPSUNOP)
         BALR  14,15
         LR    3,15
         B     @@L403
@@L413   EQU   *
         LH    2,0(7)
         CLM   2,3,=H'107'
         BNE   @@L388
         B     @@L387
@@L412   EQU   *
         LH    2,0(7)
         CLM   2,3,=H'105'
         BNE   @@L386
         B     @@L387
@@L411   EQU   *
         L     3,4(5)
         L     2,0(3)
         N     2,=F'-65504'
         L     4,=F'4456480'
         CLR   2,4
         BNE   @@L385
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(GPCONST)
         BALR  14,15
         LR    5,15
         B     @@L385
@@L410   EQU   *
         SLR   15,15
         L     4,112(13)
         L     2,0(8)
         CL    4,0(2)
         BE    @@L378
@@L383   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L416
@@L379   EQU   *
         L     4,8(4)
         L     2,0(8)
         CL    4,0(2)
         BNE   @@L383
@@L378   EQU   *
         LR    3,15
         LTR   15,15
         BE    @@L365
         L     5,4(15)
         B     @@L376
@@L416   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'4'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L378
         ST    4,88(13)
         MVC   92(4,13),=F'3'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L379
         B     @@L378
@@L372   EQU   *
         MVC   88(4,13),8(7)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L365
         L     5,4(7)
         B     @@L373
@@L408   EQU   *
         MVC   88(4,13),4(3)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LR    9,4
         LTR   15,15
         BNE   @@L368
         B     @@L367
@@L365   EQU   *
         LR    15,3
* Function noce_try_abs epilogue
         PDPEPIL
* Function noce_try_abs literal pool
         DS    0F
         LTORG
* Function noce_try_abs page table
         DS    0F
@@PGT18  EQU   *
         DC    A(@@PG18)
         DS    0F
* S-func noce_get_condition prologue
@@20     PDPPRLG CINDEX=19,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN19
         LTORG
@@FEN19  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG19   EQU   *
         LR    11,1
         L     10,=A(@@PGT19)
* Function noce_get_condition code
         L     7,0(11)
         L     8,4(11)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LTR   15,15
         BE    @@L417
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(PC@SET)
         BALR  14,15
         SLR   4,4
         L     15,8(15)
         L     3,12(15)
         LH    2,0(3)
         CLM   2,3,=H'67'
         BE    @@L443
@@L419   EQU   *
         L     6,4(15)
         L     5,4(6)
         LH    2,0(5)
         CLM   2,3,=H'61'
         BE    @@L444
@@L420   EQU   *
         ST    7,88(13)
         ST    6,92(13)
         LR    9,4
         N     9,=XL4'000000FF'
         ST    9,96(13)
         ST    8,100(13)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(CANONICA)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L417
         L     4,0(8)
         CLR   4,7
         BE    @@L424
@@L428   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L445
@@L425   EQU   *
         L     4,12(4)
         CLR   4,7
         BNE   @@L428
@@L424   EQU   *
         LR    15,5
         CLR   4,7
         BE    @@L417
         L     5,4(5)
         LH    2,0(5)
         CLM   2,3,=H'61'
         BE    @@L446
@@L442   EQU   *
         SLR   15,15
         B     @@L417
@@L446   EQU   *
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L442
         ST    7,88(13)
         ST    6,92(13)
         ST    9,96(13)
         ST    8,100(13)
         ST    5,104(13)
         LA    1,88(,13)
         L     15,=V(CANONICA)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L417
         L     4,0(8)
         CLR   4,7
         BE    @@L441
@@L438   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L447
@@L435   EQU   *
         L     4,12(4)
         CLR   4,7
         BNE   @@L438
@@L441   EQU   *
         LR    15,5
         B     @@L417
@@L447   EQU   *
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(MODINP)
         BALR  14,15
         LTR   15,15
         BE    @@L435
         B     @@L442
@@L445   EQU   *
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(MODINP)
         BALR  14,15
         LTR   15,15
         BE    @@L425
         B     @@L424
@@L444   EQU   *
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L420
         ST    7,0(8)
         CLM   4,1,=XL1'00'
         BNE   @@L448
@@L421   EQU   *
         LR    15,6
         B     @@L417
@@L448   EQU   *
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(REVCOND)
         BALR  14,15
         ST    15,88(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         ST    5,96(13)
         MVC   100(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    6,15
         B     @@L421
@@L443   EQU   *
         L     2,4(3)
         CL    2,32(7)
         BNE   @@L419
         LA    4,1(0,0)
         B     @@L419
@@L417   EQU   *
* Function noce_get_condition epilogue
         PDPEPIL
* Function noce_get_condition literal pool
         DS    0F
         LTORG
* Function noce_get_condition page table
         DS    0F
@@PGT19  EQU   *
         DC    A(@@PG19)
         DS    0F
* S-func noce_operand_ok prologue
@@21     PDPPRLG CINDEX=20,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN20
         LTORG
@@FEN20  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG20   EQU   *
         LR    11,1
         L     10,=A(@@PGT20)
* Function noce_operand_ok code
         L     4,0(11)
         LH    2,0(4)
         CLM   2,3,=H'66'
         BE    @@L477
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         SLR   2,2
         LTR   15,15
         BNE   @@L449
         L     2,=V(FTRAPMAT)
         L     2,0(2)
         LTR   2,2
         BNE   @@L453
         L     15,0(4)
         SLR   2,2
         IC    2,2(4)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,2(0,0)
         CLR   2,3
         BE    @@L454
         LA    5,6(0,0)
         CLR   2,5
         BE    @@L454
         LA    3,8(0,0)
         CLR   2,3
         BE    @@L454
@@L453   EQU   *
         SLR   2,2
         ST    4,88(13)
@@L476   EQU   *
         LA    1,88(,13)
         L     15,=V(MAY@TRAP)
         BALR  14,15
@@L475   EQU   *
         LTR   15,15
         BNE   @@L449
         LA    2,1(0,0)
         B     @@L449
@@L454   EQU   *
         LR    3,15
         SRL   3,16
         LR    2,3
         A     2,=F'-79'
         LA    5,3(0,0)
         CLR   2,5
         BH    @@L462
         SLR   6,6
         L     5,8(4)
         LH    3,0(5)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L461
         CLM   3,3,=H'54'
         BE    @@L461
         CLM   3,3,=H'55'
         BE    @@L461
         CLM   3,3,=H'58'
         BE    @@L461
         CLM   3,3,=H'134'
         BE    @@L461
         CLM   3,3,=H'56'
         BE    @@L461
         CLM   3,3,=H'140'
         BE    @@L461
@@L460   EQU   *
         LR    2,6
         B     @@L449
@@L461   EQU   *
         SRL   15,6
         N     15,=F'1020'
         L     2,=V(CONST@TI)
         CL    5,0(15,2)
         BE    @@L460
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(MAY@TRAP)
         BALR  14,15
         LTR   15,15
         BNE   @@L460
         LA    6,1(0,0)
         B     @@L460
@@L462   EQU   *
         L     2,=V(RTX@CLAS)
         SLR   5,5
         IC    5,0(2,3)
         LR    2,5
         LA    3,241(0,0)
         CR    5,3
         BE    @@L464
         BH    @@L471
         LA    5,131(0,0)
         CLR   2,5
         BNE   @@L453
@@L467   EQU   *
         SLR   2,2
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(MAY@TRAP)
         BALR  14,15
         LTR   15,15
         BNE   @@L449
         MVC   88(4,13),8(4)
         B     @@L476
@@L471   EQU   *
         LA    3,242(0,0)
         CLR   5,3
         BE    @@L467
         B     @@L453
@@L464   EQU   *
         SLR   2,2
         MVC   88(4,13),4(4)
         B     @@L476
@@L477   EQU   *
         SLR   2,2
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         B     @@L475
@@L449   EQU   *
         LR    15,2
* Function noce_operand_ok epilogue
         PDPEPIL
* Function noce_operand_ok literal pool
         DS    0F
         LTORG
* Function noce_operand_ok page table
         DS    0F
@@PGT20  EQU   *
         DC    A(@@PG20)
         DS    0F
* S-func noce_process_if_block prologue
@@22     PDPPRLG CINDEX=21,FRAME=160,BASER=12,ENTRY=NO
         B     @@FEN21
         LTORG
@@FEN21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG21   EQU   *
         LR    11,1
         L     10,=A(@@PGT21)
* Function noce_process_if_block code
         L     2,0(11)
         L     9,4(2)
         ST    9,88(13)
         LA    2,136(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@20)
         BALR  14,15
         ST    15,152(13)
         ST    15,144(13)
         LTR   15,15
         L     14,=A(@@L478)
         BER   14
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(ONLYJUMP)
         BALR  14,15
         ST    15,144(13)
         LTR   15,15
         L     14,=A(@@L478)
         BER   14
         L     3,152(13)
         L     2,4(3)
         CLI   2(2),51
         BE    @@L545
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@1)
         BALR  14,15
         LR    8,15
         LTR   15,15
         BE    @@L545
         MVC   88(4,13),4(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@2)
         BALR  14,15
         LTR   15,15
         BE    @@L545
         LH    2,0(8)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L546)
         BER   14
         SLR   2,2
@@L485   EQU   *
         L     12,0(,10)
         LTR   2,2
         BE    @@L545
         L     6,4(2)
         MVC   148(4,13),8(2)
         SLR   4,4
         L     2,8(11)
         LTR   2,2
         BE    @@L488
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@1)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L545
         MVC   88(4,13),8(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@2)
         BALR  14,15
         LTR   15,15
         BE    @@L545
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L547
@@L492   EQU   *
         LTR   4,4
         BE    @@L545
         ST    6,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L495
@@L545   EQU   *
         MVC   144(4,13),=F'0'
         L     14,=A(@@L478)
         BR    14
@@L495   EQU   *
         L     12,0(,10)
         LR    7,6
         LTR   4,4
         BE    @@L503
         L     7,8(4)
@@L503   EQU   *
         LR    4,9
         CL    9,136(13)
         BE    @@L542
@@L509   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L548
@@L506   EQU   *
         L     4,8(4)
         CL    4,136(13)
         BNE   @@L509
@@L542   EQU   *
         L     4,136(13)
         CLR   4,9
         BE    @@L544
@@L516   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L549
@@L512   EQU   *
         L     4,12(4)
         CLR   4,9
         BNE   @@L516
@@L544   EQU   *
         LR    4,6
         LH    3,0(6)
         CLM   3,3,=H'61'
         BE    @@L517
         L     2,=V(NO@NEW@P)
         L     2,0(2)
         MVC   144(4,13),=F'0'
         LTR   2,2
         L     14,=A(@@L478)
         BNER  14
         LR    2,6
         CLM   3,3,=H'64'
         BE    @@L550
@@L520   EQU   *
         SLR   3,3
         IC    3,2(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    6,15
@@L517   EQU   *
         MVC   88(4,13),148(13)
         LA    1,88(,13)
         L     15,=A(@@21)
         BALR  14,15
         LTR   15,15
         BE    @@L545
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@21)
         BALR  14,15
         LTR   15,15
         BE    @@L545
         MVC   104(4,13),0(11)
         MVC   132(4,13),152(13)
         ST    9,128(13)
         ST    8,108(13)
         ST    5,112(13)
         ST    6,116(13)
         MVC   120(4,13),148(13)
         ST    7,124(13)
         MVC   88(4,13),148(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L523
         LTR   5,5
         BE    @@L524
         L     2,8(11)
         LTR   2,2
         BE    @@L524
         CL    5,4(2)
         BE    @@L551
@@L525   EQU   *
         ST    5,88(13)
         ST    5,92(13)
         L     2,136(13)
         MVC   96(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(REOINSNS)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L526
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(REMNOTE)
         BALR  14,15
@@L526   EQU   *
         SLR   5,5
@@L527   EQU   *
         LR    6,4
@@L529   EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         LTR   5,5
         BE    @@L539
         L     3,8(11)
         LTR   3,3
         BE    @@L539
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
@@L539   EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         CLR   4,6
         BE    @@L540
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    5,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    5,88(13)
         L     2,0(11)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(EMIAFT)
         BALR  14,15
@@L540   EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
         MVC   144(4,13),=F'1'
         B     @@L478
@@L551   EQU   *
         MVC   4(4,2),8(5)
         B     @@L525
@@L524   EQU   *
         LTR   5,5
         BE    @@L527
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         MVC   144(4,13),=F'0'
         LTR   15,15
         BNE   @@L478
         B     @@L527
@@L523   EQU   *
         LA    2,104(,13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         LTR   15,15
         BNE   @@L529
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@18)
         BALR  14,15
         LTR   15,15
         BNE   @@L529
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@19)
         BALR  14,15
         LTR   15,15
         BNE   @@L529
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@11)
         BALR  14,15
         LTR   15,15
         BNE   @@L529
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@12)
         BALR  14,15
         LTR   15,15
         BNE   @@L529
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@13)
         BALR  14,15
         ST    15,144(13)
         LTR   15,15
         BE    @@L478
         B     @@L529
@@L550   EQU   *
         L     2,4(6)
         B     @@L520
@@L549   EQU   *
         MVC   88(4,13),148(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(MODINP)
         BALR  14,15
         LTR   15,15
         BNE   @@L545
         ST    7,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(MODINP)
         BALR  14,15
         LTR   15,15
         BE    @@L512
         B     @@L545
@@L548   EQU   *
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L506
         B     @@L545
@@L547   EQU   *
         L     2,16(5)
         LH    3,0(2)
         LR    4,2
         CLM   3,3,=H'47'
         BE    @@L492
         ST    5,88(13)
         MVC   92(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    4,15
         B     @@L492
@@L488   EQU   *
         MVC   88(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L497
         LH    2,0(15)
         CLM   2,3,=H'32'
         BE    @@L552
@@L497   EQU   *
         SLR   5,5
         LR    4,5
         B     @@L495
@@L552   EQU   *
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L553
         L     4,8(11)
@@L499   EQU   *
         LTR   4,4
         BE    @@L497
         ST    6,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L497
         ST    6,88(13)
         MVC   92(4,13),152(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BNE   @@L497
         ST    6,88(13)
         MVC   92(4,13),148(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BNE   @@L497
         ST    6,88(13)
         MVC   92(4,13),8(4)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L495
         B     @@L497
@@L553   EQU   *
         L     2,16(15)
         LH    3,0(2)
         LR    4,2
         CLM   3,3,=H'47'
         BE    @@L499
         ST    15,88(13)
         MVC   92(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    4,15
         B     @@L499
@@L546   EQU   *
         L     2,16(8)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L485
         ST    8,88(13)
         MVC   92(4,13),16(8)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
         B     @@L485
@@L478   EQU   *
         L     15,144(13)
* Function noce_process_if_block epilogue
         PDPEPIL
* Function noce_process_if_block literal pool
         DS    0F
         LTORG
* Function noce_process_if_block page table
         DS    0F
@@PGT21  EQU   *
         DC    A(@@PG21)
         DS    0F
* S-func process_if_block prologue
@@23     PDPPRLG CINDEX=22,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN22
         LTORG
@@FEN22  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG22   EQU   *
         LR    11,1
         L     10,=A(@@PGT22)
* Function process_if_block code
         L     2,=V(RL@COMP)
         L     2,0(2)
         LTR   2,2
         BE    @@L557
@@L556   EQU   *
         SLR   2,2
         B     @@L554
@@L557   EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@22)
         BALR  14,15
         LA    2,1(0,0)
         LTR   15,15
         BE    @@L556
@@L554   EQU   *
         LR    15,2
* Function process_if_block epilogue
         PDPEPIL
* Function process_if_block literal pool
         DS    0F
         LTORG
* Function process_if_block page table
         DS    0F
@@PGT22  EQU   *
         DC    A(@@PG22)
         DS    0F
* S-func merge_if_block prologue
@@7      PDPPRLG CINDEX=23,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN23
         LTORG
@@FEN23  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG23   EQU   *
         LR    11,1
         L     10,=A(@@PGT23)
* Function merge_if_block code
         L     6,0(11)
         L     3,4(11)
         L     4,8(11)
         L     5,12(11)
         LTR   3,3
         BE    @@L559
         L     2,=A(@@24)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   @@L584
@@L560   EQU   *
         ST    6,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(MERGE@BL)
         BALR  14,15
         L     3,=A(@@25)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
@@L559   EQU   *
         LTR   4,4
         BE    @@L561
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(MERGE@BL)
         BALR  14,15
         L     3,=A(@@25)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
@@L561   EQU   *
         LTR   5,5
         BE    @@L585
         L     2,16(5)
         LTR   2,2
         BE    @@L577
         L     2,0(2)
         LTR   2,2
         BNE   @@L576
@@L577   EQU   *
         L     2,=V(ENTRY@EX)
         LA    2,64(0,2)
         CLR   5,2
         BE    @@L576
         L     2,=A(@@24)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   @@L586
@@L578   EQU   *
         ST    6,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(MERGE@BL)
         BALR  14,15
         L     3,=A(@@25)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         B     @@L575
@@L586   EQU   *
         MVC   88(4,13),36(6)
         MVC   92(4,13),36(5)
         LA    1,88(,13)
         L     15,=V(BM@COPY)
         BALR  14,15
         B     @@L578
@@L576   EQU   *
         L     3,20(6)
         L     2,4(3)
         LTR   2,2
         BNE   @@L581
         L     2,12(3)
         CLR   2,5
         BE    @@L580
@@L581   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1956'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L580   EQU   *
         L     2,=V(ENTRY@EX)
         LA    2,64(0,2)
         CLR   5,2
         BE    @@L575
         MVC   88(4,13),20(6)
         ST    6,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(TIDYFE)
         BALR  14,15
         B     @@L575
@@L585   EQU   *
         L     4,4(6)
         L     3,20(6)
         LTR   3,3
         BE    @@L587
         LH    2,0(4)
         CLM   2,3,=H'33'
         BE    @@L575
         L     2,12(3)
         L     5,=V(ENTRY@EX)
         LA    5,64(0,5)
         CLR   2,5
         BE    @@L588
@@L571   EQU   *
         L     2,24(3)
         N     2,=F'8'
         LTR   2,2
         BE    @@L573
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(CANTINT)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   @@L575
@@L573   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1928'
@@L583   EQU   *
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L575
@@L588   EQU   *
         L     2,0(4)
         N     2,=F'-65408'
         L     5,=F'2228352'
         CLR   2,5
         BNE   @@L571
         B     @@L575
@@L587   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'26'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L575
         LH    2,0(4)
         CLM   2,3,=H'32'
         BE    @@L589
@@L566   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1913'
         B     @@L583
@@L589   EQU   *
         L     3,16(4)
         LH    2,0(3)
         CLM   2,3,=H'52'
         BNE   @@L566
         L     3,4(3)
         L     2,=V(CONST@TR)
         CL    3,0(2)
         BNE   @@L566
         B     @@L575
@@L584   EQU   *
         MVC   88(4,13),36(6)
         MVC   92(4,13),36(3)
         LA    1,88(,13)
         L     15,=V(BM@COPY)
         BALR  14,15
         B     @@L560
@@L575   EQU   *
         OC    40(4,6),=F'1'
         L     3,=A(@@26)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
* Function merge_if_block epilogue
         PDPEPIL
* Function merge_if_block literal pool
         DS    0F
         LTORG
* Function merge_if_block page table
         DS    0F
@@PGT23  EQU   *
         DC    A(@@PG23)
@@LC5    EQU   *
         DC    C'Conversion succeeded.'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func find_if_header prologue
@@27     PDPPRLG CINDEX=24,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN24
         LTORG
@@FEN24  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG24   EQU   *
         LR    11,1
         L     10,=A(@@PGT24)
* Function find_if_header code
         L     7,0(11)
         L     5,20(7)
         LTR   5,5
         BE    @@L592
         L     4,4(5)
         LR    8,4
         LTR   4,4
         BE    @@L592
         L     15,4(4)
         LTR   15,15
         BE    @@L591
@@L592   EQU   *
         SLR   15,15
         B     @@L590
@@L591   EQU   *
         L     3,24(5)
         LR    2,3
         N     2,=F'14'
         LTR   2,2
         BNE   @@L590
         L     6,24(4)
         LR    2,6
         N     2,=F'14'
         LTR   2,2
         BNE   @@L590
         N     3,=F'1'
         LTR   3,3
         BNE   @@L596
         LR    15,6
         N     15,=F'1'
         LTR   15,15
         BE    @@L590
         LR    4,5
         LR    5,8
@@L596   EQU   *
         ST    7,88(13)
         ST    5,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@28)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BNE   @@L600
         L     2,=A(@@29)
         L     2,0(2)
         LTR   2,2
         BNE   @@L606
@@L602   EQU   *
         LR    15,3
         B     @@L590
@@L606   EQU   *
         ST    7,88(13)
         ST    5,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@30)
         BALR  14,15
         LTR   15,15
         BE    @@L607
@@L600   EQU   *
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L608
@@L605   EQU   *
         LA    15,1(0,0)
         B     @@L590
@@L608   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC5)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L605
@@L607   EQU   *
         ST    7,88(13)
         ST    5,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         LTR   15,15
         BNE   @@L600
         B     @@L602
@@L590   EQU   *
* Function find_if_header epilogue
         PDPEPIL
* Function find_if_header literal pool
         DS    0F
         LTORG
* Function find_if_header page table
         DS    0F
@@PGT24  EQU   *
         DC    A(@@PG24)
@@LC6    EQU   *
         DC    X'15'
         DC    C'IF-THEN-ELSE block found, start %d, then %d, els'
         DC    C'e %d, join %d'
         DC    X'15'
         DC    X'0'
@@LC7    EQU   *
         DC    X'15'
         DC    C'IF-THEN block found, start %d, then %d, join %d'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func find_if_block prologue
@@28     PDPPRLG CINDEX=25,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN25
         LTORG
@@FEN25  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG25   EQU   *
         LR    11,1
         L     10,=A(@@PGT25)
* Function find_if_block code
         L     8,0(11)
         L     2,4(11)
         L     7,12(2)
         L     2,8(11)
         L     4,12(2)
         SLR   5,5
         L     3,20(7)
         L     6,20(4)
         L     2,16(7)
         L     2,0(2)
         LR    15,5
         LTR   2,2
         BNE   @@L609
         LTR   3,3
         BE    @@L611
         L     2,4(3)
         LTR   2,2
         BNE   @@L638
         L     2,24(3)
         N     2,=F'14'
         LTR   2,2
         BNE   @@L638
         L     2,=V(FLOW2@CO)
         L     2,0(2)
         LTR   2,2
         BNE   @@L639
@@L611   EQU   *
         LTR   3,3
         BE    @@L640
         L     2,12(3)
         CLR   2,4
         BE    @@L636
         LTR   6,6
         BE    @@L638
         CL    2,12(6)
         BE    @@L641
@@L638   EQU   *
         SLR   15,15
         B     @@L609
@@L641   EQU   *
         L     2,16(4)
         L     2,0(2)
         LTR   2,2
         BNE   @@L638
         L     2,4(6)
         LTR   2,2
         BNE   @@L638
         L     2,24(6)
         N     2,=F'14'
         LTR   2,2
         BNE   @@L638
         L     2,=V(FLOW2@CO)
         L     2,0(2)
         LTR   2,2
         BNE   @@L642
@@L626   EQU   *
         L     5,12(6)
@@L622   EQU   *
         L     2,=A(@@32)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BE    @@L628
         LTR   4,4
         BE    @@L629
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC6)
         MVC   96(4,13),44(8)
         MVC   100(4,13),44(7)
         MVC   104(4,13),44(4)
         MVC   108(4,13),44(5)
@@L637   EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L628   EQU   *
         L     2,44(7)
         LTR   4,4
         BE    @@L631
         A     2,=F'1'
         CL    2,44(4)
         BNE   @@L638
@@L631   EQU   *
         A     2,=F'1'
         L     3,44(5)
         CLR   2,3
         BE    @@L632
         L     2,=F'-2'
         CLR   3,2
         BE    @@L632
         SLR   5,5
         LR    15,4
         LTR   4,4
         BE    @@L609
@@L632   EQU   *
         ST    8,88(13)
         ST    7,92(13)
         ST    4,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=A(@@23)
         BALR  14,15
         B     @@L609
@@L629   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC7)
         MVC   96(4,13),44(8)
         MVC   100(4,13),44(7)
         MVC   104(4,13),44(5)
         B     @@L637
@@L642   EQU   *
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(TABLEJUM)
         BALR  14,15
         LTR   15,15
         BNE   @@L638
         B     @@L626
@@L636   EQU   *
         LR    5,4
         SLR   4,4
         B     @@L622
@@L640   EQU   *
         L     2,16(4)
         L     2,0(2)
         LTR   2,2
         BNE   @@L614
         L     3,4(7)
         LTR   3,3
         BE    @@L616
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L643
@@L616   EQU   *
         LTR   3,3
         BE    @@L636
         LH    2,0(3)
         CLM   2,3,=H'33'
         BNE   @@L636
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SIMPLEJU)
         BALR  14,15
         LTR   15,15
         BE    @@L609
         B     @@L636
@@L643   EQU   *
         L     15,0(7)
         CLR   3,15
         BE    @@L616
@@L619   EQU   *
         L     3,8(3)
         LTR   3,3
         BE    @@L616
         LH    2,0(3)
         CLM   2,3,=H'37'
         BNE   @@L616
         CLR   3,15
         BNE   @@L619
         B     @@L616
@@L614   EQU   *
         LR    15,3
         B     @@L609
@@L639   EQU   *
         MVC   88(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(TABLEJUM)
         BALR  14,15
         LTR   15,15
         BNE   @@L638
         B     @@L611
@@L609   EQU   *
* Function find_if_block epilogue
         PDPEPIL
* Function find_if_block literal pool
         DS    0F
         LTORG
* Function find_if_block page table
         DS    0F
@@PGT25  EQU   *
         DC    A(@@PG25)
@@LC8    EQU   *
         DC    X'15'
         DC    C'TRAP-IF block found, start %d, trap %d'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func find_cond_trap prologue
@@33     PDPPRLG CINDEX=26,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN26
         LTORG
@@FEN26  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG26   EQU   *
         LR    11,1
         L     10,=A(@@PGT26)
* Function find_cond_trap code
         L     9,0(11)
         L     2,4(11)
         L     7,12(2)
         L     3,8(11)
         L     2,12(3)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@34)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L645
         LR    6,7
         LR    8,2
@@L646   EQU   *
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L661
@@L649   EQU   *
         L     4,4(9)
         ST    4,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@20)
         BALR  14,15
         LR    3,15
         LR    2,15
         LTR   15,15
         BE    @@L644
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ONLYJUMP)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L644
         L     2,4(3)
         CLI   2(2),51
         BE    @@L662
         LH    15,0(3)
         N     15,=XL4'0000FFFF'
         CLR   7,6
         BE    @@L663
@@L653   EQU   *
         ST    15,88(13)
         MVC   92(4,13),4(3)
         MVC   96(4,13),8(3)
         L     2,16(5)
         MVC   100(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(GEN@COND)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L644
         ST    15,88(13)
         MVC   92(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(EMIBEF)
         BALR  14,15
         L     2,4(11)
         CLR   6,7
         BE    @@L657
         L     2,8(11)
@@L657   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(REMOVE@E)
         BALR  14,15
         L     2,16(6)
         LTR   2,2
         BE    @@L664
@@L658   EQU   *
         L     2,44(9)
         A     2,=F'1'
         CL    2,44(8)
         BE    @@L665
         L     3,32(4)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(EMJIA)
         BALR  14,15
         L     2,16(3)
         A     2,=F'1'
         ST    2,16(3)
         ST    3,32(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMBAF)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
@@L660   EQU   *
         LA    2,1(0,0)
         B     @@L644
@@L665   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
         B     @@L660
@@L664   EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(FDELBLK)
         BALR  14,15
         L     3,=A(@@25)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         B     @@L658
@@L663   EQU   *
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L644
         B     @@L653
@@L662   EQU   *
         SLR   2,2
         B     @@L644
@@L661   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC8)
         MVC   96(4,13),44(9)
         MVC   100(4,13),44(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L649
@@L645   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@34)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L647
         LR    6,2
         LR    8,7
         B     @@L646
@@L647   EQU   *
         LR    2,15
@@L644   EQU   *
         LR    15,2
* Function find_cond_trap epilogue
         PDPEPIL
* Function find_cond_trap literal pool
         DS    0F
         LTORG
* Function find_cond_trap page table
         DS    0F
@@PGT26  EQU   *
         DC    A(@@PG26)
         DS    0F
* S-func block_has_only_trap prologue
@@34     PDPPRLG CINDEX=27,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN27
         LTORG
@@FEN27  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG27   EQU   *
         LR    11,1
         L     10,=A(@@PGT27)
* Function block_has_only_trap code
         L     3,0(11)
         SLR   15,15
         L     2,=V(ENTRY@EX)
         LA    2,64(0,2)
         CLR   3,2
         BE    @@L666
         L     2,20(3)
         SLR   15,15
         LTR   2,2
         BNE   @@L666
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@1)
         BALR  14,15
         CL    15,4(3)
         BE    @@L671
@@L670   EQU   *
         SLR   15,15
         B     @@L666
@@L671   EQU   *
         L     3,16(15)
         LH    2,0(3)
         CLM   2,3,=H'52'
         BNE   @@L670
         L     3,4(3)
         L     2,=V(CONST@TR)
         CL    3,0(2)
         BNE   @@L670
@@L666   EQU   *
* Function block_has_only_trap epilogue
         PDPEPIL
* Function block_has_only_trap literal pool
         DS    0F
         LTORG
* Function block_has_only_trap page table
         DS    0F
@@PGT27  EQU   *
         DC    A(@@PG27)
@@LC9    EQU   *
         DC    X'15'
         DC    C'IF-CASE-1 found, start %d, then %d'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func find_if_case_1 prologue
@@30     PDPPRLG CINDEX=28,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN28
         LTORG
@@FEN28  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG28   EQU   *
         LR    11,1
         L     10,=A(@@PGT28)
* Function find_if_case_1 code
         L     7,0(11)
         L     2,4(11)
         L     4,12(2)
         L     2,8(11)
         L     6,12(2)
         L     2,20(4)
         LTR   2,2
         BE    @@L674
         L     15,4(2)
         LTR   15,15
         BE    @@L673
@@L674   EQU   *
         SLR   2,2
         B     @@L672
@@L673   EQU   *
         L     3,24(2)
         N     3,=F'15'
         LR    2,15
         LTR   3,3
         BNE   @@L672
         L     2,16(4)
         L     5,0(2)
         LR    2,3
         LTR   5,5
         BNE   @@L672
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FORWARDE)
         BALR  14,15
         LR    2,5
         CLM   15,1,=XL1'00'
         BNE   @@L672
         L     2,=A(@@32)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L684
@@L678   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         LR    2,5
         LA    3,1(0,0)
         CR    15,3
         BH    @@L672
         ST    7,88(13)
         ST    4,92(13)
         ST    6,96(13)
         L     2,20(4)
         MVC   100(4,13),12(2)
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@35)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L672
         OC    40(4,7),=F'1'
         MVC   88(4,13),36(7)
         MVC   92(4,13),32(6)
         MVC   96(4,13),36(4)
         MVC   100(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
         L     3,20(7)
         L     2,24(3)
         N     2,=F'1'
         LR    15,3
         LTR   2,2
         BNE   @@L682
         L     15,4(3)
@@L682   EQU   *
         ST    15,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(REEABFOR)
         BALR  14,15
         LTR   15,15
         BE    @@L683
         MVC   40(4,15),40(4)
         OC    40(4,4),=F'1'
@@L683   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FDELBLK)
         BALR  14,15
         L     3,=A(@@25)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         L     3,=A(@@26)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         LA    2,1(0,0)
         B     @@L672
@@L684   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC9)
         MVC   96(4,13),44(7)
         MVC   100(4,13),44(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L678
@@L672   EQU   *
         LR    15,2
* Function find_if_case_1 epilogue
         PDPEPIL
* Function find_if_case_1 literal pool
         DS    0F
         LTORG
* Function find_if_case_1 page table
         DS    0F
@@PGT28  EQU   *
         DC    A(@@PG28)
@@LC10   EQU   *
         DC    X'15'
         DC    C'IF-CASE-2 found, start %d, else %d'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func find_if_case_2 prologue
@@31     PDPPRLG CINDEX=29,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN29
         LTORG
@@FEN29  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG29   EQU   *
         LR    11,1
         L     10,=A(@@PGT29)
* Function find_if_case_2 code
         L     9,0(11)
         L     2,4(11)
         L     8,12(2)
         L     2,8(11)
         L     7,12(2)
         L     6,20(7)
         LTR   6,6
         BE    @@L687
         L     2,4(6)
         LTR   2,2
         BE    @@L686
@@L687   EQU   *
         SLR   5,5
         B     @@L685
@@L686   EQU   *
         L     4,24(6)
         N     4,=F'14'
         LR    5,2
         LTR   4,4
         BNE   @@L685
         L     2,16(7)
         L     3,0(2)
         LR    5,4
         LTR   3,3
         BNE   @@L685
         L     2,44(8)
         LR    5,3
         LTR   2,2
         BL    @@L685
         MVC   88(4,13),4(9)
         MVC   92(4,13),=F'16'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L691
         L     2,4(15)
         L     2,4(2)
         L     3,=F'4999'
         CR    2,3
         BH    @@L692
@@L691   EQU   *
         L     3,12(6)
         L     2,44(3)
         LTR   2,2
         BL    @@L692
         L     4,40(8)
         SRL   4,1
         L     2,=A(@@29)
         L     5,0(2)
         MH    4,=H'4'
         L     2,40(3)
         LR    3,2
         SRL   3,6
         MH    3,=H'4'
         A     3,0(4,5)
         SRL   2,1
         N     2,=F'31'
         L     3,12(3)
         SRL   3,0(2)
         LR    2,3
         N     2,=F'1'
         LR    5,2
         LTR   2,2
         BE    @@L685
@@L692   EQU   *
         L     2,=A(@@32)
         L     3,0(2)
         A     3,=F'1'
         ST    3,0(2)
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L699
@@L696   EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         SLR   5,5
         LA    2,1(0,0)
         CR    15,2
         BH    @@L685
         ST    9,88(13)
         ST    7,92(13)
         ST    8,96(13)
         MVC   100(4,13),12(6)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@35)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L685
         OC    40(4,9),=F'1'
         MVC   88(4,13),36(9)
         MVC   92(4,13),32(8)
         MVC   96(4,13),36(7)
         MVC   100(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(FDELBLK)
         BALR  14,15
         L     3,=A(@@25)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         L     3,=A(@@26)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         LA    5,1(0,0)
         B     @@L685
@@L699   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC10)
         MVC   96(4,13),44(9)
         MVC   100(4,13),44(7)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L696
@@L685   EQU   *
         LR    15,5
* Function find_if_case_2 epilogue
         PDPEPIL
* Function find_if_case_2 literal pool
         DS    0F
         LTORG
* Function find_if_case_2 page table
         DS    0F
@@PGT29  EQU   *
         DC    A(@@PG29)
         DS    0F
* S-func find_memory prologue
@@36     PDPPRLG CINDEX=30,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN30
         LTORG
@@FEN30  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG30   EQU   *
         LR    11,1
         L     10,=A(@@PGT30)
* Function find_memory code
         SLR   15,15
         L     2,0(11)
         L     2,0(2)
         LH    2,0(2)
         CLM   2,3,=H'66'
         BNE   @@L701
         LA    15,1(0,0)
@@L701   EQU   *
* Function find_memory epilogue
         PDPEPIL
* Function find_memory literal pool
         DS    0F
         LTORG
* Function find_memory page table
         DS    0F
@@PGT30  EQU   *
         DC    A(@@PG30)
         DS    0F
* S-func dead_or_predicable prologue
@@35     PDPPRLG CINDEX=31,FRAME=208,BASER=12,ENTRY=NO
         B     @@FEN31
         LTORG
@@FEN31  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG31   EQU   *
         LR    11,1
         L     10,=A(@@PGT31)
* Function dead_or_predicable code
         MVC   192(4,13),=F'0'
         L     2,0(11)
         MVC   188(4,13),4(2)
         L     4,4(11)
         L     3,0(4)
         ST    3,180(13)
         L     4,4(4)
         ST    4,184(13)
         LH    2,0(3)
         CLM   2,3,=H'36'
         L     14,=A(@@L878)
         BER   14
@@L703   EQU   *
         L     12,0(,10)
         L     3,180(13)
         LH    2,0(3)
         CLM   2,3,=H'37'
         L     14,=A(@@L879)
         BER   14
@@L704   EQU   *
         L     12,0(,10)
         L     4,184(13)
         LH    2,0(4)
         CLM   2,3,=H'33'
         L     14,=A(@@L880)
         BER   14
@@L716   EQU   *
         L     12,0(,10)
         MVC   204(4,13),=F'0'
         L     4,180(13)
@@L725   EQU   *
         LH    2,0(4)
         CLM   2,3,=H'34'
         L     14,=A(@@L877)
         BER   14
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L881)
         BER   14
@@L729   EQU   *
         L     12,0(,10)
         CL    4,184(13)
         BE    @@L726
         L     4,12(4)
         B     @@L725
@@L726   EQU   *
         MVC   88(4,13),188(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(@@L702)
         BER   14
         MVC   88(4,13),188(13)
         LA    2,176(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@20)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(@@L702)
         BER   14
         LA    2,128(,13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(BM@INIT)
         BALR  14,15
         LR    7,15
         LA    2,112(,13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(BM@INIT)
         BALR  14,15
         ST    15,196(13)
         LA    2,144(,13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(BM@INIT)
         BALR  14,15
         ST    15,200(13)
         LA    2,160(,13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(BM@INIT)
         BALR  14,15
         LR    8,15
         MVC   88(4,13),4(11)
         ST    7,92(13)
         MVC   96(4,13),196(13)
         MVC   100(4,13),196(13)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PROPBLK)
         BALR  14,15
         MVC   88(4,13),200(13)
         L     3,8(11)
         MVC   92(4,13),32(3)
         LA    1,88(,13)
         L     15,=V(BM@COPY)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),200(13)
         ST    8,96(13)
         ST    8,100(13)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(INIT@PRO)
         BALR  14,15
         LR    2,15
         L     4,188(13)
@@L762   EQU   *
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(PROPONEI)
         BALR  14,15
         CL    4,176(13)
         BE    @@L763
         LR    4,15
         B     @@L762
@@L763   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE@PRO)
         BALR  14,15
         ST    7,88(13)
         ST    8,92(13)
         MVC   96(4,13),200(13)
         MVC   100(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
         ST    7,88(13)
         ST    7,92(13)
         MVC   96(4,13),196(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
         L     15,0(7)
         SLR   6,6
         LR    9,6
         LTR   15,15
         BE    @@L862
@@L790   EQU   *
         LR    5,6
         MH    5,=H'4'
         AR    5,15
@@L789   EQU   *
         L     3,12(5)
         LTR   3,3
         BE    @@L781
@@L788   EQU   *
         LA    4,1(0,0)
         SLL   4,0(9)
         LR    2,3
         NR    2,4
         LTR   2,2
         BE    @@L784
         X     4,=F'-1'
         NR    3,4
         MVC   204(4,13),=F'1'
         LTR   3,3
         BE    @@L781
@@L784   EQU   *
         A     9,=F'1'
         LA    4,31(0,0)
         CLR   9,4
         BNH   @@L788
@@L781   EQU   *
         SLR   9,9
         A     5,=F'4'
         A     6,=F'1'
         LA    2,1(0,0)
         CLR   6,2
         BNH   @@L789
         LR    6,9
         L     15,0(15)
         LTR   15,15
         BNE   @@L790
@@L862   EQU   *
         ST    7,88(13)
         ST    8,92(13)
         L     3,4(11)
         MVC   96(4,13),32(3)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(BITMAP@O)
         BALR  14,15
         L     15,0(7)
         SLR   6,6
         LR    9,6
         LTR   15,15
         BE    @@L868
@@L815   EQU   *
         LR    5,6
         MH    5,=H'4'
         AR    5,15
@@L814   EQU   *
         L     3,12(5)
         LTR   3,3
         BE    @@L806
@@L813   EQU   *
         LA    4,1(0,0)
         SLL   4,0(9)
         LR    2,3
         NR    2,4
         LTR   2,2
         BE    @@L809
         X     4,=F'-1'
         NR    3,4
         MVC   204(4,13),=F'1'
         LTR   3,3
         BE    @@L806
@@L809   EQU   *
         A     9,=F'1'
         LA    4,31(0,0)
         CLR   9,4
         BNH   @@L813
@@L806   EQU   *
         SLR   9,9
         A     5,=F'4'
         A     6,=F'1'
         LA    2,1(0,0)
         CLR   6,2
         BNH   @@L814
         LR    6,9
         L     15,0(15)
         LTR   15,15
         BNE   @@L815
@@L868   EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@C)
         BALR  14,15
         SLR   7,7
         L     3,196(13)
         LTR   3,3
         BE    @@L818
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@C)
         BALR  14,15
@@L818   EQU   *
         L     4,200(13)
         LTR   4,4
         BE    @@L820
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@C)
         BALR  14,15
@@L820   EQU   *
         LTR   8,8
         BE    @@L822
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@C)
         BALR  14,15
@@L822   EQU   *
         LR    2,7
         L     3,204(13)
         LTR   3,3
         L     14,=A(@@L702)
         BNER  14
@@L706   EQU   *
         L     12,0(,10)
         L     4,188(13)
         L     3,32(4)
         L     2,8(11)
         CL    2,12(11)
         BE    @@L825
         MVC   88(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(BLOCK@LA)
         BALR  14,15
         ST    15,192(13)
         L     4,16(11)
         LTR   4,4
         BE    @@L827
         MVC   88(4,13),188(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(INVJP1)
         BALR  14,15
@@L876   EQU   *
         LTR   15,15
         BE    @@L723
@@L825   EQU   *
         LA    1,88(,13)
         L     15,=V(APPLY@CH)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(@@L702)
         BER   14
         L     2,8(11)
         CL    2,12(11)
         BE    @@L830
         LTR   3,3
         BE    @@L831
         L     2,16(3)
         BCTR  2,0
         ST    2,16(3)
@@L831   EQU   *
         L     3,192(13)
         LTR   3,3
         BE    @@L832
         L     2,16(3)
         A     2,=F'1'
         ST    2,16(3)
@@L832   EQU   *
         L     4,188(13)
         MVC   32(4,4),192(13)
         L     2,16(11)
         LTR   2,2
         BNE   @@L882
@@L833   EQU   *
         L     4,0(11)
         L     3,20(4)
         L     2,24(3)
         N     2,=F'1'
         LR    4,3
         LTR   2,2
         BE    @@L835
         L     4,4(3)
@@L835   EQU   *
         ST    4,88(13)
         MVC   92(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(REDSUC)
         BALR  14,15
         L     2,16(11)
         LTR   2,2
         BE    @@L830
         L     4,0(11)
         L     3,20(4)
         L     2,24(3)
         N     2,=F'1'
         LR    4,3
         LTR   2,2
         BE    @@L838
         L     4,4(3)
@@L838   EQU   *
         L     6,32(4)
         L     2,24(3)
         N     2,=F'1'
         LR    5,3
         LTR   2,2
         BE    @@L840
         L     5,4(3)
@@L840   EQU   *
         L     2,24(3)
         N     2,=F'1'
         LR    4,3
         LTR   2,2
         BNE   @@L842
         L     4,4(3)
@@L842   EQU   *
         MVC   32(4,5),32(4)
         L     2,24(3)
         N     2,=F'1'
         LR    4,3
         LTR   2,2
         BNE   @@L844
         L     4,4(3)
@@L844   EQU   *
         ST    6,32(4)
         L     2,24(3)
         N     2,=F'1'
         LR    4,3
         LTR   2,2
         BE    @@L846
         L     4,4(3)
@@L846   EQU   *
         L     6,28(4)
         L     2,24(3)
         N     2,=F'1'
         LR    5,3
         LTR   2,2
         BE    @@L848
         L     5,4(3)
@@L848   EQU   *
         L     2,24(3)
         N     2,=F'1'
         LR    4,3
         LTR   2,2
         BNE   @@L850
         L     4,4(3)
@@L850   EQU   *
         MVC   28(4,5),28(4)
         L     2,24(3)
         N     2,=F'1'
         LR    4,3
         LTR   2,2
         BNE   @@L852
         L     4,4(3)
@@L852   EQU   *
         ST    6,28(4)
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(UPBPROB)
         BALR  14,15
@@L830   EQU   *
         L     3,180(13)
         LTR   3,3
         BE    @@L853
         L     2,184(13)
         L     4,4(11)
         CL    2,4(4)
         BE    @@L883
@@L854   EQU   *
         LA    2,180(,13)
         ST    2,88(13)
         LA    2,184(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(SQUEEZE@)
         BALR  14,15
         LA    2,1(0,0)
         CLM   15,1,=XL1'00'
         BNE   @@L702
         MVC   88(4,13),180(13)
         MVC   92(4,13),184(13)
         L     2,176(13)
         MVC   96(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(REOINSNS)
         BALR  14,15
@@L853   EQU   *
         L     2,8(11)
         CL    2,12(11)
         BE    @@L884
@@L856   EQU   *
         LA    2,1(0,0)
         B     @@L702
@@L884   EQU   *
         MVC   88(4,13),188(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         L     4,0(11)
         L     3,20(4)
         L     2,24(3)
         N     2,=F'1'
         LR    4,3
         LTR   2,2
         BE    @@L858
         L     4,4(3)
@@L858   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(REMOVE@E)
         BALR  14,15
         B     @@L856
@@L883   EQU   *
         MVC   4(4,4),8(3)
         B     @@L854
@@L882   EQU   *
         MVC   88(4,13),188(13)
         LA    1,88(,13)
         L     15,=V(INVERT@B)
         BALR  14,15
         B     @@L833
@@L723   EQU   *
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(CANCEL@C)
         BALR  14,15
@@L877   EQU   *
         SLR   2,2
         B     @@L702
@@L827   EQU   *
         MVC   88(4,13),188(13)
         MVC   92(4,13),192(13)
         LA    1,88(,13)
         L     15,=V(REDJP1)
         BALR  14,15
         B     @@L876
@@L881   EQU   *
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(MAY@TRAP)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   @@L877
         A     4,=F'16'
         ST    4,88(13)
         A     4,=F'-16'
         MVC   92(4,13),=A(@@36)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(F@E@RTX)
         BALR  14,15
         LTR   15,15
         BE    @@L729
         B     @@L702
@@L880   EQU   *
         L     6,180(13)
         CLR   6,4
         BE    @@L885
         L     5,32(4)
         LTR   5,5
         BE    @@L709
         L     3,12(5)
         LTR   3,3
         BE    @@L709
         LH    2,0(3)
         CLM   2,3,=H'33'
         BE    @@L886
@@L709   EQU   *
         L     2,184(13)
         MVC   184(4,13),8(2)
         B     @@L716
@@L886   EQU   *
         L     2,16(3)
         LH    2,0(2)
         AH    2,=H'-44'
         CLM   2,3,=H'1'
         BH    @@L709
         LR    3,6
         CL    6,8(4)
         BE    @@L709
@@L715   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'13'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L877
         L     3,12(3)
         L     2,184(13)
         CL    3,8(2)
         BNE   @@L715
         B     @@L709
@@L885   EQU   *
         SLR   2,2
         ST    2,184(13)
         ST    2,180(13)
         B     @@L706
@@L879   EQU   *
         CLR   3,4
         BE    @@L887
         MVC   180(4,13),12(3)
         B     @@L704
@@L887   EQU   *
         MVC   184(4,13),192(13)
         MVC   180(4,13),192(13)
         B     @@L706
@@L878   EQU   *
         MVC   180(4,13),12(3)
         B     @@L703
@@L702   EQU   *
         LR    15,2
* Function dead_or_predicable epilogue
         PDPEPIL
* Function dead_or_predicable literal pool
         DS    0F
         LTORG
* Function dead_or_predicable page table
         DS    0F
@@PGT31  EQU   *
         DC    A(@@PG31)
@@LC11   EQU   *
         DC    X'15'
         DC    C'%d possible IF blocks searched.'
         DC    X'15'
         DC    X'0'
@@LC12   EQU   *
         DC    C'%d IF blocks converted.'
         DC    X'15'
         DC    X'0'
@@LC13   EQU   *
         DC    C'%d basic blocks deleted.'
         DC    X'15'
         DC    X'15'
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func if_convert prologue
IF@CONVE PDPPRLG CINDEX=32,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN32
         LTORG
@@FEN32  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG32   EQU   *
         LR    11,1
         L     10,=A(@@PGT32)
* Function if_convert code
         L     2,=A(@@32)
         MVC   0(4,2),=F'0'
         L     2,=A(@@26)
         MVC   0(4,2),=F'0'
         L     2,=A(@@25)
         MVC   0(4,2),=F'0'
         L     3,=A(@@24)
         L     4,0(11)
         LPR   2,4
         LCR   2,2
         SRL   2,31
         STC   2,0(3)
         MVC   88(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(FREE@BAS)
         BALR  14,15
         L     4,=A(@@29)
         MVC   0(4,4),=F'0'
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BNE   @@L921
@@L890   EQU   *
         SLR   5,5
         L     2,=V(N@BASIC@)
         L     4,0(2)
         CR    5,4
         BNL   @@L916
@@L895   EQU   *
         LR    2,5
         MH    2,=H'4'
         L     3,=V(BBINFO)
         A     2,0(3)
         L     3,16(2)
         LR    2,5
         SLL   2,1
         ST    2,40(3)
         A     5,=F'1'
         CR    5,4
         BL    @@L895
@@L916   EQU   *
         SLR   5,5
         L     2,=V(N@BASIC@)
         C     5,0(2)
         BL    @@L902
@@L918   EQU   *
         L     2,=A(@@29)
         L     2,0(2)
         LTR   2,2
         BNE   @@L922
@@L903   EQU   *
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L923
@@L904   EQU   *
         L     2,=A(@@25)
         L     2,0(2)
         LTR   2,2
         BE    @@L905
         L     2,=A(@@24)
         IC    2,0(2)
         CLM   2,1,=XL1'00'
         BNE   @@L924
@@L905   EQU   *
         LA    1,88(,13)
         L     15,=V(CAFBLKS)
         BALR  14,15
@@L913   EQU   *
         L     4,=V(RTDFILE)
         L     3,0(4)
         LTR   3,3
         BE    @@L888
         L     2,=A(@@32)
         L     2,0(2)
         LTR   2,2
         BNH   @@L888
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC11)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(4)
         MVC   92(4,13),=A(@@LC12)
         L     2,=A(@@26)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(4)
         MVC   92(4,13),=A(@@LC13)
         L     2,=A(@@25)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L888
@@L924   EQU   *
         L     4,=V(N@BASIC@)
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(SBALLOC)
         BALR  14,15
         LR    6,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(SBZERO)
         BALR  14,15
         L     3,=V(MAX@REGN)
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         L     2,0(3)
         CR    2,15
         BL    @@L925
@@L906   EQU   *
         SLR   5,5
         C     5,0(4)
         BNL   @@L920
@@L912   EQU   *
         LR    2,5
         MH    2,=H'4'
         L     3,=V(BBINFO)
         A     2,0(3)
         L     2,16(2)
         L     2,40(2)
         N     2,=F'1'
         LTR   2,2
         BE    @@L909
         LR    2,5
         SRL   2,5
         MH    2,=H'4'
         AR    2,6
         LR    4,5
         N     4,=F'31'
         LA    3,1(0,0)
         SLL   3,0(4)
         O     3,12(2)
         ST    3,12(2)
@@L909   EQU   *
         A     5,=F'1'
         L     2,=V(N@BASIC@)
         C     5,0(2)
         BL    @@L912
@@L920   EQU   *
         LA    1,88(,13)
         L     15,=V(CAFBLKS)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(COUNT@OR)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'25'
         LA    1,88(,13)
         L     15,=V(UPDATE@L)
         BALR  14,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     @@L913
@@L925   EQU   *
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         ST    15,0(3)
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ALLREGIN)
         BALR  14,15
         B     @@L906
@@L923   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FFLUSH)
         BALR  14,15
         B     @@L904
@@L922   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     @@L903
@@L902   EQU   *
         LR    2,5
         MH    2,=H'4'
         L     3,=V(BBINFO)
         A     2,0(3)
         L     2,16(2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@27)
         BALR  14,15
         A     5,=F'1'
         LTR   15,15
         BE    @@L896
         L     5,44(2)
@@L896   EQU   *
         L     2,=V(N@BASIC@)
         C     5,0(2)
         BL    @@L902
         B     @@L918
@@L921   EQU   *
         L     2,=V(N@BASIC@)
         MVC   88(4,13),0(2)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(SBVALLOC)
         BALR  14,15
         ST    15,0(4)
         MVC   88(4,13),=F'0'
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(CALCULAT)
         BALR  14,15
         B     @@L890
@@L888   EQU   *
* Function if_convert epilogue
         PDPEPIL
* Function if_convert literal pool
         DS    0F
         LTORG
* Function if_convert page table
         DS    0F
@@PGT32  EQU   *
         DC    A(@@PG32)
         DS    0F
@@32     EQU   *
         DC    4X'00'
         DS    0F
@@26     EQU   *
         DC    4X'00'
         DS    0F
@@25     EQU   *
         DC    4X'00'
         DS    0F
@@24     EQU   *
         DC    1X'00'
         DS    0F
@@29     EQU   *
         DC    4X'00'
         END
