         COPY  PDPTOP
         CSECT
* Program text area
         DS    0F
* X-func gntsdi prologue
GNTSDI   PDPPRLG CINDEX=0,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function gntsdi code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),4(2)
         MVC   100(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gntsdi epilogue
         PDPEPIL
* Function gntsdi literal pool
         DS    0F
         LTORG
* Function gntsdi page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
         DS    0F
* X-func gntssi prologue
GNTSSI   PDPPRLG CINDEX=1,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function gntssi code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),4(2)
         MVC   100(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gntssi epilogue
         PDPEPIL
* Function gntssi literal pool
         DS    0F
         LTORG
* Function gntssi page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
         DS    0F
* X-func gen_tsthi prologue
GEN@TSTH PDPPRLG CINDEX=2,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function gen_tsthi code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),4(2)
         MVC   100(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_tsthi epilogue
         PDPEPIL
* Function gen_tsthi literal pool
         DS    0F
         LTORG
* Function gen_tsthi page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
         DS    0F
* X-func gntsdf prologue
GNTSDF   PDPPRLG CINDEX=3,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function gntsdf code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),4(2)
         MVC   100(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gntsdf epilogue
         PDPEPIL
* Function gntsdf literal pool
         DS    0F
         LTORG
* Function gntsdf page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
         DS    0F
* X-func gntssf prologue
GNTSSF   PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN4
         LTORG
@@FEN4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         LR    11,1
         L     10,=A(@@PGT4)
* Function gntssf code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),4(2)
         MVC   100(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gntssf epilogue
         PDPEPIL
* Function gntssf literal pool
         DS    0F
         LTORG
* Function gntssf page table
         DS    0F
@@PGT4   EQU   *
         DC    A(@@PG4)
         DS    0F
* X-func gcmpsi prologue
GCMPSI   PDPPRLG CINDEX=5,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN5
         LTORG
@@FEN5   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         LR    11,1
         L     10,=A(@@PGT5)
* Function gcmpsi code
         MVC   88(4,13),=F'74'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),4(2)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gcmpsi epilogue
         PDPEPIL
* Function gcmpsi literal pool
         DS    0F
         LTORG
* Function gcmpsi page table
         DS    0F
@@PGT5   EQU   *
         DC    A(@@PG5)
         DS    0F
* X-func gen_cmphi prologue
GEN@CMPH PDPPRLG CINDEX=6,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN6
         LTORG
@@FEN6   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG6    EQU   *
         LR    11,1
         L     10,=A(@@PGT6)
* Function gen_cmphi code
         MVC   88(4,13),=F'74'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),4(2)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_cmphi epilogue
         PDPEPIL
* Function gen_cmphi literal pool
         DS    0F
         LTORG
* Function gen_cmphi page table
         DS    0F
@@PGT6   EQU   *
         DC    A(@@PG6)
         DS    0F
* X-func gen_cmpqi prologue
GEN@CMPQ PDPPRLG CINDEX=7,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN7
         LTORG
@@FEN7   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG7    EQU   *
         LR    11,1
         L     10,=A(@@PGT7)
* Function gen_cmpqi code
         MVC   88(4,13),=F'74'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),4(2)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_cmpqi epilogue
         PDPEPIL
* Function gen_cmpqi literal pool
         DS    0F
         LTORG
* Function gen_cmpqi page table
         DS    0F
@@PGT7   EQU   *
         DC    A(@@PG7)
         DS    0F
* X-func gen_cmpdf prologue
GEN@CMPD PDPPRLG CINDEX=8,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN8
         LTORG
@@FEN8   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG8    EQU   *
         LR    11,1
         L     10,=A(@@PGT8)
* Function gen_cmpdf code
         MVC   88(4,13),=F'74'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),4(2)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_cmpdf epilogue
         PDPEPIL
* Function gen_cmpdf literal pool
         DS    0F
         LTORG
* Function gen_cmpdf page table
         DS    0F
@@PGT8   EQU   *
         DC    A(@@PG8)
         DS    0F
* X-func gcmpsf prologue
GCMPSF   PDPPRLG CINDEX=9,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN9
         LTORG
@@FEN9   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG9    EQU   *
         LR    11,1
         L     10,=A(@@PGT9)
* Function gcmpsf code
         MVC   88(4,13),=F'74'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),4(2)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gcmpsf epilogue
         PDPEPIL
* Function gcmpsf literal pool
         DS    0F
         LTORG
* Function gcmpsf page table
         DS    0F
@@PGT9   EQU   *
         DC    A(@@PG9)
         DS    0F
* X-func gcmsi1 prologue
GCMSI1   PDPPRLG CINDEX=10,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN10
         LTORG
@@FEN10  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG10   EQU   *
         LR    11,1
         L     10,=A(@@PGT10)
* Function gcmsi1 code
         L     3,4(11)
         L     4,8(11)
         MVC   88(4,13),=F'51'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'51'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         MVC   88(4,13),=F'74'
         MVC   92(4,13),=F'4'
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    7,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    6,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'5'
         ST    7,92(13)
         ST    6,96(13)
         ST    5,100(13)
         ST    2,104(13)
         ST    15,108(13)
         LA    1,88(,13)
         L     15,=V(GENRV)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
* Function gcmsi1 epilogue
         PDPEPIL
* Function gcmsi1 literal pool
         DS    0F
         LTORG
* Function gcmsi1 page table
         DS    0F
@@PGT10  EQU   *
         DC    A(@@PG10)
         DS    0F
* X-func gmovdi prologue
GMOVDI   PDPPRLG CINDEX=11,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN11
         LTORG
@@FEN11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG11   EQU   *
         LR    11,1
         L     10,=A(@@PGT11)
* Function gmovdi code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gmovdi epilogue
         PDPEPIL
* Function gmovdi literal pool
         DS    0F
         LTORG
* Function gmovdi page table
         DS    0F
@@PGT11  EQU   *
         DC    A(@@PG11)
         DS    0F
* X-func gmovsi prologue
GMOVSI   PDPPRLG CINDEX=12,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN12
         LTORG
@@FEN12  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG12   EQU   *
         LR    11,1
         L     10,=A(@@PGT12)
* Function gmovsi code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gmovsi epilogue
         PDPEPIL
* Function gmovsi literal pool
         DS    0F
         LTORG
* Function gmovsi page table
         DS    0F
@@PGT12  EQU   *
         DC    A(@@PG12)
         DS    0F
* X-func gen_movhi prologue
GEN@MOVH PDPPRLG CINDEX=13,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN13
         LTORG
@@FEN13  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG13   EQU   *
         LR    11,1
         L     10,=A(@@PGT13)
* Function gen_movhi code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_movhi epilogue
         PDPEPIL
* Function gen_movhi literal pool
         DS    0F
         LTORG
* Function gen_movhi page table
         DS    0F
@@PGT13  EQU   *
         DC    A(@@PG13)
         DS    0F
* X-func gen_movqi prologue
GEN@MOVQ PDPPRLG CINDEX=14,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN14
         LTORG
@@FEN14  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG14   EQU   *
         LR    11,1
         L     10,=A(@@PGT14)
* Function gen_movqi code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_movqi epilogue
         PDPEPIL
* Function gen_movqi literal pool
         DS    0F
         LTORG
* Function gen_movqi page table
         DS    0F
@@PGT14  EQU   *
         DC    A(@@PG14)
         DS    0F
* X-func gmovthi prologue
GMOVTHI  PDPPRLG CINDEX=15,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN15
         LTORG
@@FEN15  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG15   EQU   *
         LR    11,1
         L     10,=A(@@PGT15)
* Function gmovthi code
         MVC   88(4,13),=F'64'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gmovthi epilogue
         PDPEPIL
* Function gmovthi literal pool
         DS    0F
         LTORG
* Function gmovthi page table
         DS    0F
@@PGT15  EQU   *
         DC    A(@@PG15)
         DS    0F
* X-func gmovdf prologue
GMOVDF   PDPPRLG CINDEX=16,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN16
         LTORG
@@FEN16  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG16   EQU   *
         LR    11,1
         L     10,=A(@@PGT16)
* Function gmovdf code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gmovdf epilogue
         PDPEPIL
* Function gmovdf literal pool
         DS    0F
         LTORG
* Function gmovdf page table
         DS    0F
@@PGT16  EQU   *
         DC    A(@@PG16)
         DS    0F
* X-func gmovsf prologue
GMOVSF   PDPPRLG CINDEX=17,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN17
         LTORG
@@FEN17  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG17   EQU   *
         LR    11,1
         L     10,=A(@@PGT17)
* Function gmovsf code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gmovsf epilogue
         PDPEPIL
* Function gmovsf literal pool
         DS    0F
         LTORG
* Function gmovsf page table
         DS    0F
@@PGT17  EQU   *
         DC    A(@@PG17)
         DS    0F
* X-func gmovt1 prologue
GMOVT1   PDPPRLG CINDEX=18,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN18
         LTORG
@@FEN18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG18   EQU   *
         LR    11,1
         L     10,=A(@@PGT18)
* Function gmovt1 code
         L     2,0(11)
         L     4,4(11)
         MVC   88(4,13),=F'51'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'51'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    6,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'5'
         ST    6,92(13)
         ST    5,96(13)
         ST    3,100(13)
         ST    2,104(13)
         ST    15,108(13)
         LA    1,88(,13)
         L     15,=V(GENRV)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
* Function gmovt1 epilogue
         PDPEPIL
* Function gmovt1 literal pool
         DS    0F
         LTORG
* Function gmovt1 page table
         DS    0F
@@PGT18  EQU   *
         DC    A(@@PG18)
         DS    0F
* X-func gesi2 prologue
GESI2    PDPPRLG CINDEX=19,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN19
         LTORG
@@FEN19  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG19   EQU   *
         LR    11,1
         L     10,=A(@@PGT19)
* Function gesi2 code
         MVC   88(4,13),=F'120'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gesi2 epilogue
         PDPEPIL
* Function gesi2 literal pool
         DS    0F
         LTORG
* Function gesi2 page table
         DS    0F
@@PGT19  EQU   *
         DC    A(@@PG19)
         DS    0F
* X-func geqi2 prologue
GEQI2    PDPPRLG CINDEX=20,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN20
         LTORG
@@FEN20  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG20   EQU   *
         LR    11,1
         L     10,=A(@@PGT20)
* Function geqi2 code
         MVC   88(4,13),=F'120'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function geqi2 epilogue
         PDPEPIL
* Function geqi2 literal pool
         DS    0F
         LTORG
* Function geqi2 page table
         DS    0F
@@PGT20  EQU   *
         DC    A(@@PG20)
         DS    0F
* X-func gehi2 prologue
GEHI2    PDPPRLG CINDEX=21,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN21
         LTORG
@@FEN21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG21   EQU   *
         LR    11,1
         L     10,=A(@@PGT21)
* Function gehi2 code
         MVC   88(4,13),=F'120'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gehi2 epilogue
         PDPEPIL
* Function gehi2 literal pool
         DS    0F
         LTORG
* Function gehi2 page table
         DS    0F
@@PGT21  EQU   *
         DC    A(@@PG21)
         DS    0F
* X-func gzsi2 prologue
GZSI2    PDPPRLG CINDEX=22,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN22
         LTORG
@@FEN22  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG22   EQU   *
         LR    11,1
         L     10,=A(@@PGT22)
* Function gzsi2 code
         MVC   88(4,13),=F'121'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gzsi2 epilogue
         PDPEPIL
* Function gzsi2 literal pool
         DS    0F
         LTORG
* Function gzsi2 page table
         DS    0F
@@PGT22  EQU   *
         DC    A(@@PG22)
         DS    0F
* X-func gzqsi2 prologue
GZQSI2   PDPPRLG CINDEX=23,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN23
         LTORG
@@FEN23  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG23   EQU   *
         LR    11,1
         L     10,=A(@@PGT23)
* Function gzqsi2 code
         MVC   88(4,13),=F'121'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gzqsi2 epilogue
         PDPEPIL
* Function gzqsi2 literal pool
         DS    0F
         LTORG
* Function gzqsi2 page table
         DS    0F
@@PGT23  EQU   *
         DC    A(@@PG23)
         DS    0F
* X-func gzhi2 prologue
GZHI2    PDPPRLG CINDEX=24,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN24
         LTORG
@@FEN24  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG24   EQU   *
         LR    11,1
         L     10,=A(@@PGT24)
* Function gzhi2 code
         MVC   88(4,13),=F'121'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gzhi2 epilogue
         PDPEPIL
* Function gzhi2 literal pool
         DS    0F
         LTORG
* Function gzhi2 page table
         DS    0F
@@PGT24  EQU   *
         DC    A(@@PG24)
         DS    0F
* X-func genthi2 prologue
GENTHI2  PDPPRLG CINDEX=25,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN25
         LTORG
@@FEN25  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG25   EQU   *
         LR    11,1
         L     10,=A(@@PGT25)
* Function genthi2 code
         MVC   88(4,13),=F'122'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function genthi2 epilogue
         PDPEPIL
* Function genthi2 literal pool
         DS    0F
         LTORG
* Function genthi2 page table
         DS    0F
@@PGT25  EQU   *
         DC    A(@@PG25)
         DS    0F
* X-func gen_fix_truncdfsi2 prologue
GEN@FIX@ PDPPRLG CINDEX=26,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN26
         LTORG
@@FEN26  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG26   EQU   *
         LR    11,1
         L     10,=A(@@PGT26)
* Function gen_fix_truncdfsi2 code
         MVC   88(4,13),=F'122'
         MVC   92(4,13),=F'16'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'126'
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'2'
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GENRV)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
* Function gen_fix_truncdfsi2 epilogue
         PDPEPIL
* Function gen_fix_truncdfsi2 literal pool
         DS    0F
         LTORG
* Function gen_fix_truncdfsi2 page table
         DS    0F
@@PGT26  EQU   *
         DC    A(@@PG26)
         DS    0F
* X-func gen_floatsidf2 prologue
GEN@FLOA PDPPRLG CINDEX=27,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN27
         LTORG
@@FEN27  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG27   EQU   *
         LR    11,1
         L     10,=A(@@PGT27)
* Function gen_floatsidf2 code
         MVC   88(4,13),=F'125'
         MVC   92(4,13),=F'16'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_floatsidf2 epilogue
         PDPEPIL
* Function gen_floatsidf2 literal pool
         DS    0F
         LTORG
* Function gen_floatsidf2 page table
         DS    0F
@@PGT27  EQU   *
         DC    A(@@PG27)
         DS    0F
* X-func gentsf2 prologue
GENTSF2  PDPPRLG CINDEX=28,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN28
         LTORG
@@FEN28  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG28   EQU   *
         LR    11,1
         L     10,=A(@@PGT28)
* Function gentsf2 code
         MVC   88(4,13),=F'124'
         MVC   92(4,13),=F'15'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gentsf2 epilogue
         PDPEPIL
* Function gentsf2 literal pool
         DS    0F
         LTORG
* Function gentsf2 page table
         DS    0F
@@PGT28  EQU   *
         DC    A(@@PG28)
         DS    0F
* X-func gesf2 prologue
GESF2    PDPPRLG CINDEX=29,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN29
         LTORG
@@FEN29  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG29   EQU   *
         LR    11,1
         L     10,=A(@@PGT29)
* Function gesf2 code
         MVC   88(4,13),=F'123'
         MVC   92(4,13),=F'16'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gesf2 epilogue
         PDPEPIL
* Function gesf2 literal pool
         DS    0F
         LTORG
* Function gesf2 page table
         DS    0F
@@PGT29  EQU   *
         DC    A(@@PG29)
         DS    0F
* X-func gsi3 prologue
GSI3     PDPPRLG CINDEX=30,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN30
         LTORG
@@FEN30  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG30   EQU   *
         LR    11,1
         L     10,=A(@@PGT30)
* Function gsi3 code
         MVC   88(4,13),=F'75'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gsi3 epilogue
         PDPEPIL
* Function gsi3 literal pool
         DS    0F
         LTORG
* Function gsi3 page table
         DS    0F
@@PGT30  EQU   *
         DC    A(@@PG30)
         DS    0F
* X-func gen_addhi3 prologue
GEN@ADDH PDPPRLG CINDEX=31,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN31
         LTORG
@@FEN31  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG31   EQU   *
         LR    11,1
         L     10,=A(@@PGT31)
* Function gen_addhi3 code
         MVC   88(4,13),=F'75'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_addhi3 epilogue
         PDPEPIL
* Function gen_addhi3 literal pool
         DS    0F
         LTORG
* Function gen_addhi3 page table
         DS    0F
@@PGT31  EQU   *
         DC    A(@@PG31)
         DS    0F
* X-func gen_addqi3 prologue
GEN@ADDQ PDPPRLG CINDEX=32,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN32
         LTORG
@@FEN32  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG32   EQU   *
         LR    11,1
         L     10,=A(@@PGT32)
* Function gen_addqi3 code
         MVC   88(4,13),=F'75'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_addqi3 epilogue
         PDPEPIL
* Function gen_addqi3 literal pool
         DS    0F
         LTORG
* Function gen_addqi3 page table
         DS    0F
@@PGT32  EQU   *
         DC    A(@@PG32)
         DS    0F
* X-func gdf3 prologue
GDF3     PDPPRLG CINDEX=33,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN33
         LTORG
@@FEN33  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG33   EQU   *
         LR    11,1
         L     10,=A(@@PGT33)
* Function gdf3 code
         MVC   88(4,13),=F'75'
         MVC   92(4,13),=F'16'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gdf3 epilogue
         PDPEPIL
* Function gdf3 literal pool
         DS    0F
         LTORG
* Function gdf3 page table
         DS    0F
@@PGT33  EQU   *
         DC    A(@@PG33)
         DS    0F
* X-func gsf3 prologue
GSF3     PDPPRLG CINDEX=34,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN34
         LTORG
@@FEN34  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG34   EQU   *
         LR    11,1
         L     10,=A(@@PGT34)
* Function gsf3 code
         MVC   88(4,13),=F'75'
         MVC   92(4,13),=F'15'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gsf3 epilogue
         PDPEPIL
* Function gsf3 literal pool
         DS    0F
         LTORG
* Function gsf3 page table
         DS    0F
@@PGT34  EQU   *
         DC    A(@@PG34)
         DS    0F
* X-func gen_subsi3 prologue
GEN@SUBS PDPPRLG CINDEX=35,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN35
         LTORG
@@FEN35  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG35   EQU   *
         LR    11,1
         L     10,=A(@@PGT35)
* Function gen_subsi3 code
         MVC   88(4,13),=F'76'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_subsi3 epilogue
         PDPEPIL
* Function gen_subsi3 literal pool
         DS    0F
         LTORG
* Function gen_subsi3 page table
         DS    0F
@@PGT35  EQU   *
         DC    A(@@PG35)
         DS    0F
* X-func gen_subhi3 prologue
GEN@SUBH PDPPRLG CINDEX=36,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN36
         LTORG
@@FEN36  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG36   EQU   *
         LR    11,1
         L     10,=A(@@PGT36)
* Function gen_subhi3 code
         MVC   88(4,13),=F'76'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_subhi3 epilogue
         PDPEPIL
* Function gen_subhi3 literal pool
         DS    0F
         LTORG
* Function gen_subhi3 page table
         DS    0F
@@PGT36  EQU   *
         DC    A(@@PG36)
         DS    0F
* X-func gen_subqi3 prologue
GEN@SUBQ PDPPRLG CINDEX=37,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN37
         LTORG
@@FEN37  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG37   EQU   *
         LR    11,1
         L     10,=A(@@PGT37)
* Function gen_subqi3 code
         MVC   88(4,13),=F'76'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_subqi3 epilogue
         PDPEPIL
* Function gen_subqi3 literal pool
         DS    0F
         LTORG
* Function gen_subqi3 page table
         DS    0F
@@PGT37  EQU   *
         DC    A(@@PG37)
         DS    0F
* X-func gen_subdf3 prologue
GEN@SUBD PDPPRLG CINDEX=38,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN38
         LTORG
@@FEN38  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG38   EQU   *
         LR    11,1
         L     10,=A(@@PGT38)
* Function gen_subdf3 code
         MVC   88(4,13),=F'76'
         MVC   92(4,13),=F'16'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_subdf3 epilogue
         PDPEPIL
* Function gen_subdf3 literal pool
         DS    0F
         LTORG
* Function gen_subdf3 page table
         DS    0F
@@PGT38  EQU   *
         DC    A(@@PG38)
         DS    0F
* X-func gensf3 prologue
GENSF3   PDPPRLG CINDEX=39,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN39
         LTORG
@@FEN39  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG39   EQU   *
         LR    11,1
         L     10,=A(@@PGT39)
* Function gensf3 code
         MVC   88(4,13),=F'76'
         MVC   92(4,13),=F'15'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gensf3 epilogue
         PDPEPIL
* Function gensf3 literal pool
         DS    0F
         LTORG
* Function gensf3 page table
         DS    0F
@@PGT39  EQU   *
         DC    A(@@PG39)
         DS    0F
* X-func gen_muldf3 prologue
GEN@MULD PDPPRLG CINDEX=40,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN40
         LTORG
@@FEN40  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG40   EQU   *
         LR    11,1
         L     10,=A(@@PGT40)
* Function gen_muldf3 code
         MVC   88(4,13),=F'78'
         MVC   92(4,13),=F'16'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_muldf3 epilogue
         PDPEPIL
* Function gen_muldf3 literal pool
         DS    0F
         LTORG
* Function gen_muldf3 page table
         DS    0F
@@PGT40  EQU   *
         DC    A(@@PG40)
         DS    0F
* X-func gmulsf3 prologue
GMULSF3  PDPPRLG CINDEX=41,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN41
         LTORG
@@FEN41  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG41   EQU   *
         LR    11,1
         L     10,=A(@@PGT41)
* Function gmulsf3 code
         MVC   88(4,13),=F'78'
         MVC   92(4,13),=F'15'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gmulsf3 epilogue
         PDPEPIL
* Function gmulsf3 literal pool
         DS    0F
         LTORG
* Function gmulsf3 page table
         DS    0F
@@PGT41  EQU   *
         DC    A(@@PG41)
         DS    0F
* X-func gen_divdf3 prologue
GEN@DIVD PDPPRLG CINDEX=42,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN42
         LTORG
@@FEN42  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG42   EQU   *
         LR    11,1
         L     10,=A(@@PGT42)
* Function gen_divdf3 code
         MVC   88(4,13),=F'79'
         MVC   92(4,13),=F'16'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_divdf3 epilogue
         PDPEPIL
* Function gen_divdf3 literal pool
         DS    0F
         LTORG
* Function gen_divdf3 page table
         DS    0F
@@PGT42  EQU   *
         DC    A(@@PG42)
         DS    0F
* X-func gdivsf3 prologue
GDIVSF3  PDPPRLG CINDEX=43,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN43
         LTORG
@@FEN43  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG43   EQU   *
         LR    11,1
         L     10,=A(@@PGT43)
* Function gdivsf3 code
         MVC   88(4,13),=F'79'
         MVC   92(4,13),=F'15'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gdivsf3 epilogue
         PDPEPIL
* Function gdivsf3 literal pool
         DS    0F
         LTORG
* Function gdivsf3 page table
         DS    0F
@@PGT43  EQU   *
         DC    A(@@PG43)
         DS    0F
* X-func gen_andsi3 prologue
GEN@ANDS PDPPRLG CINDEX=44,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN44
         LTORG
@@FEN44  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG44   EQU   *
         LR    11,1
         L     10,=A(@@PGT44)
* Function gen_andsi3 code
         MVC   88(4,13),=F'83'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_andsi3 epilogue
         PDPEPIL
* Function gen_andsi3 literal pool
         DS    0F
         LTORG
* Function gen_andsi3 page table
         DS    0F
@@PGT44  EQU   *
         DC    A(@@PG44)
         DS    0F
* X-func gen_andhi3 prologue
GEN@ANDH PDPPRLG CINDEX=45,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN45
         LTORG
@@FEN45  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG45   EQU   *
         LR    11,1
         L     10,=A(@@PGT45)
* Function gen_andhi3 code
         MVC   88(4,13),=F'83'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_andhi3 epilogue
         PDPEPIL
* Function gen_andhi3 literal pool
         DS    0F
         LTORG
* Function gen_andhi3 page table
         DS    0F
@@PGT45  EQU   *
         DC    A(@@PG45)
         DS    0F
* X-func gen_andqi3 prologue
GEN@ANDQ PDPPRLG CINDEX=46,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN46
         LTORG
@@FEN46  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG46   EQU   *
         LR    11,1
         L     10,=A(@@PGT46)
* Function gen_andqi3 code
         MVC   88(4,13),=F'83'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_andqi3 epilogue
         PDPEPIL
* Function gen_andqi3 literal pool
         DS    0F
         LTORG
* Function gen_andqi3 page table
         DS    0F
@@PGT46  EQU   *
         DC    A(@@PG46)
         DS    0F
* X-func gen_iorsi3 prologue
GEN@IORS PDPPRLG CINDEX=47,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN47
         LTORG
@@FEN47  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG47   EQU   *
         LR    11,1
         L     10,=A(@@PGT47)
* Function gen_iorsi3 code
         MVC   88(4,13),=F'84'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_iorsi3 epilogue
         PDPEPIL
* Function gen_iorsi3 literal pool
         DS    0F
         LTORG
* Function gen_iorsi3 page table
         DS    0F
@@PGT47  EQU   *
         DC    A(@@PG47)
         DS    0F
* X-func gen_iorhi3 prologue
GEN@IORH PDPPRLG CINDEX=48,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN48
         LTORG
@@FEN48  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG48   EQU   *
         LR    11,1
         L     10,=A(@@PGT48)
* Function gen_iorhi3 code
         MVC   88(4,13),=F'84'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_iorhi3 epilogue
         PDPEPIL
* Function gen_iorhi3 literal pool
         DS    0F
         LTORG
* Function gen_iorhi3 page table
         DS    0F
@@PGT48  EQU   *
         DC    A(@@PG48)
         DS    0F
* X-func gen_iorqi3 prologue
GEN@IORQ PDPPRLG CINDEX=49,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN49
         LTORG
@@FEN49  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG49   EQU   *
         LR    11,1
         L     10,=A(@@PGT49)
* Function gen_iorqi3 code
         MVC   88(4,13),=F'84'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_iorqi3 epilogue
         PDPEPIL
* Function gen_iorqi3 literal pool
         DS    0F
         LTORG
* Function gen_iorqi3 page table
         DS    0F
@@PGT49  EQU   *
         DC    A(@@PG49)
         DS    0F
* X-func gen_xorsi3 prologue
GEN@XORS PDPPRLG CINDEX=50,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN50
         LTORG
@@FEN50  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG50   EQU   *
         LR    11,1
         L     10,=A(@@PGT50)
* Function gen_xorsi3 code
         MVC   88(4,13),=F'85'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_xorsi3 epilogue
         PDPEPIL
* Function gen_xorsi3 literal pool
         DS    0F
         LTORG
* Function gen_xorsi3 page table
         DS    0F
@@PGT50  EQU   *
         DC    A(@@PG50)
         DS    0F
* X-func gen_xorhi3 prologue
GEN@XORH PDPPRLG CINDEX=51,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN51
         LTORG
@@FEN51  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG51   EQU   *
         LR    11,1
         L     10,=A(@@PGT51)
* Function gen_xorhi3 code
         MVC   88(4,13),=F'85'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_xorhi3 epilogue
         PDPEPIL
* Function gen_xorhi3 literal pool
         DS    0F
         LTORG
* Function gen_xorhi3 page table
         DS    0F
@@PGT51  EQU   *
         DC    A(@@PG51)
         DS    0F
* X-func gen_xorqi3 prologue
GEN@XORQ PDPPRLG CINDEX=52,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN52
         LTORG
@@FEN52  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG52   EQU   *
         LR    11,1
         L     10,=A(@@PGT52)
* Function gen_xorqi3 code
         MVC   88(4,13),=F'85'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_xorqi3 epilogue
         PDPEPIL
* Function gen_xorqi3 literal pool
         DS    0F
         LTORG
* Function gen_xorqi3 page table
         DS    0F
@@PGT52  EQU   *
         DC    A(@@PG52)
         DS    0F
* X-func gnegsi2 prologue
GNEGSI2  PDPPRLG CINDEX=53,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN53
         LTORG
@@FEN53  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG53   EQU   *
         LR    11,1
         L     10,=A(@@PGT53)
* Function gnegsi2 code
         MVC   88(4,13),=F'77'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gnegsi2 epilogue
         PDPEPIL
* Function gnegsi2 literal pool
         DS    0F
         LTORG
* Function gnegsi2 page table
         DS    0F
@@PGT53  EQU   *
         DC    A(@@PG53)
         DS    0F
* X-func gen_neghi2 prologue
GEN@NEGH PDPPRLG CINDEX=54,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN54
         LTORG
@@FEN54  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG54   EQU   *
         LR    11,1
         L     10,=A(@@PGT54)
* Function gen_neghi2 code
         MVC   88(4,13),=F'77'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_neghi2 epilogue
         PDPEPIL
* Function gen_neghi2 literal pool
         DS    0F
         LTORG
* Function gen_neghi2 page table
         DS    0F
@@PGT54  EQU   *
         DC    A(@@PG54)
         DS    0F
* X-func gen_negdf2 prologue
GEN@NEGD PDPPRLG CINDEX=55,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN55
         LTORG
@@FEN55  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG55   EQU   *
         LR    11,1
         L     10,=A(@@PGT55)
* Function gen_negdf2 code
         MVC   88(4,13),=F'77'
         MVC   92(4,13),=F'16'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_negdf2 epilogue
         PDPEPIL
* Function gen_negdf2 literal pool
         DS    0F
         LTORG
* Function gen_negdf2 page table
         DS    0F
@@PGT55  EQU   *
         DC    A(@@PG55)
         DS    0F
* X-func gnegsf2 prologue
GNEGSF2  PDPPRLG CINDEX=56,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN56
         LTORG
@@FEN56  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG56   EQU   *
         LR    11,1
         L     10,=A(@@PGT56)
* Function gnegsf2 code
         MVC   88(4,13),=F'77'
         MVC   92(4,13),=F'15'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gnegsf2 epilogue
         PDPEPIL
* Function gnegsf2 literal pool
         DS    0F
         LTORG
* Function gnegsf2 page table
         DS    0F
@@PGT56  EQU   *
         DC    A(@@PG56)
         DS    0F
* X-func gsi2 prologue
GSI2     PDPPRLG CINDEX=57,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN57
         LTORG
@@FEN57  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG57   EQU   *
         LR    11,1
         L     10,=A(@@PGT57)
* Function gsi2 code
         MVC   88(4,13),=F'129'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gsi2 epilogue
         PDPEPIL
* Function gsi2 literal pool
         DS    0F
         LTORG
* Function gsi2 page table
         DS    0F
@@PGT57  EQU   *
         DC    A(@@PG57)
         DS    0F
* X-func gen_abshi2 prologue
GEN@ABSH PDPPRLG CINDEX=58,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN58
         LTORG
@@FEN58  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG58   EQU   *
         LR    11,1
         L     10,=A(@@PGT58)
* Function gen_abshi2 code
         MVC   88(4,13),=F'129'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_abshi2 epilogue
         PDPEPIL
* Function gen_abshi2 literal pool
         DS    0F
         LTORG
* Function gen_abshi2 page table
         DS    0F
@@PGT58  EQU   *
         DC    A(@@PG58)
         DS    0F
* X-func gen_absdf2 prologue
GEN@ABSD PDPPRLG CINDEX=59,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN59
         LTORG
@@FEN59  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG59   EQU   *
         LR    11,1
         L     10,=A(@@PGT59)
* Function gen_absdf2 code
         MVC   88(4,13),=F'129'
         MVC   92(4,13),=F'16'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_absdf2 epilogue
         PDPEPIL
* Function gen_absdf2 literal pool
         DS    0F
         LTORG
* Function gen_absdf2 page table
         DS    0F
@@PGT59  EQU   *
         DC    A(@@PG59)
         DS    0F
* X-func gsf2 prologue
GSF2     PDPPRLG CINDEX=60,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN60
         LTORG
@@FEN60  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG60   EQU   *
         LR    11,1
         L     10,=A(@@PGT60)
* Function gsf2 code
         MVC   88(4,13),=F'129'
         MVC   92(4,13),=F'15'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gsf2 epilogue
         PDPEPIL
* Function gsf2 literal pool
         DS    0F
         LTORG
* Function gsf2 page table
         DS    0F
@@PGT60  EQU   *
         DC    A(@@PG60)
         DS    0F
* X-func cocli2 prologue
COCLI2   PDPPRLG CINDEX=61,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN61
         LTORG
@@FEN61  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG61   EQU   *
         LR    11,1
         L     10,=A(@@PGT61)
* Function cocli2 code
         MVC   88(4,13),=F'86'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function cocli2 epilogue
         PDPEPIL
* Function cocli2 literal pool
         DS    0F
         LTORG
* Function cocli2 page table
         DS    0F
@@PGT61  EQU   *
         DC    A(@@PG61)
         DS    0F
* X-func gochi2 prologue
GOCHI2   PDPPRLG CINDEX=62,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN62
         LTORG
@@FEN62  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG62   EQU   *
         LR    11,1
         L     10,=A(@@PGT62)
* Function gochi2 code
         MVC   88(4,13),=F'86'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gochi2 epilogue
         PDPEPIL
* Function gochi2 literal pool
         DS    0F
         LTORG
* Function gochi2 page table
         DS    0F
@@PGT62  EQU   *
         DC    A(@@PG62)
         DS    0F
* X-func gocqi2 prologue
GOCQI2   PDPPRLG CINDEX=63,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN63
         LTORG
@@FEN63  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG63   EQU   *
         LR    11,1
         L     10,=A(@@PGT63)
* Function gocqi2 code
         MVC   88(4,13),=F'86'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gocqi2 epilogue
         PDPEPIL
* Function gocqi2 literal pool
         DS    0F
         LTORG
* Function gocqi2 page table
         DS    0F
@@PGT63  EQU   *
         DC    A(@@PG63)
         DS    0F
* X-func gdi3 prologue
GDI3     PDPPRLG CINDEX=64,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN64
         LTORG
@@FEN64  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG64   EQU   *
         LR    11,1
         L     10,=A(@@PGT64)
* Function gdi3 code
         MVC   88(4,13),=F'87'
         MVC   92(4,13),=F'5'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gdi3 epilogue
         PDPEPIL
* Function gdi3 literal pool
         DS    0F
         LTORG
* Function gdi3 page table
         DS    0F
@@PGT64  EQU   *
         DC    A(@@PG64)
         DS    0F
* X-func gen_ashrdi3 prologue
GEN@ASHR PDPPRLG CINDEX=65,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN65
         LTORG
@@FEN65  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG65   EQU   *
         LR    11,1
         L     10,=A(@@PGT65)
* Function gen_ashrdi3 code
         MVC   88(4,13),=F'89'
         MVC   92(4,13),=F'5'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_ashrdi3 epilogue
         PDPEPIL
* Function gen_ashrdi3 literal pool
         DS    0F
         LTORG
* Function gen_ashrdi3 page table
         DS    0F
@@PGT65  EQU   *
         DC    A(@@PG65)
         DS    0F
* X-func galsi3 prologue
GALSI3   PDPPRLG CINDEX=66,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN66
         LTORG
@@FEN66  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG66   EQU   *
         LR    11,1
         L     10,=A(@@PGT66)
* Function galsi3 code
         MVC   88(4,13),=F'87'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function galsi3 epilogue
         PDPEPIL
* Function galsi3 literal pool
         DS    0F
         LTORG
* Function galsi3 page table
         DS    0F
@@PGT66  EQU   *
         DC    A(@@PG66)
         DS    0F
* X-func gasi3 prologue
GASI3    PDPPRLG CINDEX=67,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN67
         LTORG
@@FEN67  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG67   EQU   *
         LR    11,1
         L     10,=A(@@PGT67)
* Function gasi3 code
         MVC   88(4,13),=F'89'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gasi3 epilogue
         PDPEPIL
* Function gasi3 literal pool
         DS    0F
         LTORG
* Function gasi3 page table
         DS    0F
@@PGT67  EQU   *
         DC    A(@@PG67)
         DS    0F
* X-func ghi3 prologue
GHI3     PDPPRLG CINDEX=68,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN68
         LTORG
@@FEN68  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG68   EQU   *
         LR    11,1
         L     10,=A(@@PGT68)
* Function ghi3 code
         MVC   88(4,13),=F'87'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function ghi3 epilogue
         PDPEPIL
* Function ghi3 literal pool
         DS    0F
         LTORG
* Function ghi3 page table
         DS    0F
@@PGT68  EQU   *
         DC    A(@@PG68)
         DS    0F
* X-func gahi3 prologue
GAHI3    PDPPRLG CINDEX=69,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN69
         LTORG
@@FEN69  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG69   EQU   *
         LR    11,1
         L     10,=A(@@PGT69)
* Function gahi3 code
         MVC   88(4,13),=F'89'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gahi3 epilogue
         PDPEPIL
* Function gahi3 literal pool
         DS    0F
         LTORG
* Function gahi3 page table
         DS    0F
@@PGT69  EQU   *
         DC    A(@@PG69)
         DS    0F
* X-func gqi3 prologue
GQI3     PDPPRLG CINDEX=70,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN70
         LTORG
@@FEN70  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG70   EQU   *
         LR    11,1
         L     10,=A(@@PGT70)
* Function gqi3 code
         MVC   88(4,13),=F'87'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gqi3 epilogue
         PDPEPIL
* Function gqi3 literal pool
         DS    0F
         LTORG
* Function gqi3 page table
         DS    0F
@@PGT70  EQU   *
         DC    A(@@PG70)
         DS    0F
* X-func gaqi3 prologue
GAQI3    PDPPRLG CINDEX=71,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN71
         LTORG
@@FEN71  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG71   EQU   *
         LR    11,1
         L     10,=A(@@PGT71)
* Function gaqi3 code
         MVC   88(4,13),=F'89'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gaqi3 epilogue
         PDPEPIL
* Function gaqi3 literal pool
         DS    0F
         LTORG
* Function gaqi3 page table
         DS    0F
@@PGT71  EQU   *
         DC    A(@@PG71)
         DS    0F
* X-func gldi3 prologue
GLDI3    PDPPRLG CINDEX=72,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN72
         LTORG
@@FEN72  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG72   EQU   *
         LR    11,1
         L     10,=A(@@PGT72)
* Function gldi3 code
         MVC   88(4,13),=F'90'
         MVC   92(4,13),=F'5'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gldi3 epilogue
         PDPEPIL
* Function gldi3 literal pool
         DS    0F
         LTORG
* Function gldi3 page table
         DS    0F
@@PGT72  EQU   *
         DC    A(@@PG72)
         DS    0F
* X-func glsi3 prologue
GLSI3    PDPPRLG CINDEX=73,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN73
         LTORG
@@FEN73  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG73   EQU   *
         LR    11,1
         L     10,=A(@@PGT73)
* Function glsi3 code
         MVC   88(4,13),=F'90'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function glsi3 epilogue
         PDPEPIL
* Function glsi3 literal pool
         DS    0F
         LTORG
* Function glsi3 page table
         DS    0F
@@PGT73  EQU   *
         DC    A(@@PG73)
         DS    0F
* X-func glhi3 prologue
GLHI3    PDPPRLG CINDEX=74,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN74
         LTORG
@@FEN74  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG74   EQU   *
         LR    11,1
         L     10,=A(@@PGT74)
* Function glhi3 code
         MVC   88(4,13),=F'90'
         MVC   92(4,13),=F'3'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function glhi3 epilogue
         PDPEPIL
* Function glhi3 literal pool
         DS    0F
         LTORG
* Function glhi3 page table
         DS    0F
@@PGT74  EQU   *
         DC    A(@@PG74)
         DS    0F
* X-func glqi3 prologue
GLQI3    PDPPRLG CINDEX=75,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN75
         LTORG
@@FEN75  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG75   EQU   *
         LR    11,1
         L     10,=A(@@PGT75)
* Function glqi3 code
         MVC   88(4,13),=F'90'
         MVC   92(4,13),=F'2'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function glqi3 epilogue
         PDPEPIL
* Function glqi3 literal pool
         DS    0F
         LTORG
* Function glqi3 page table
         DS    0F
@@PGT75  EQU   *
         DC    A(@@PG75)
         DS    0F
* X-func gen_beq prologue
GEN@BEQ  PDPPRLG CINDEX=76,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN76
         LTORG
@@FEN76  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG76   EQU   *
         LR    11,1
         L     10,=A(@@PGT76)
* Function gen_beq code
         MVC   88(4,13),=F'103'
         MVC   92(4,13),=F'0'
         L     3,=V(GLBRTL)
         MVC   96(4,13),4(3)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_beq epilogue
         PDPEPIL
* Function gen_beq literal pool
         DS    0F
         LTORG
* Function gen_beq page table
         DS    0F
@@PGT76  EQU   *
         DC    A(@@PG76)
         DS    0F
* X-func gen_bne prologue
GEN@BNE  PDPPRLG CINDEX=77,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN77
         LTORG
@@FEN77  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG77   EQU   *
         LR    11,1
         L     10,=A(@@PGT77)
* Function gen_bne code
         MVC   88(4,13),=F'102'
         MVC   92(4,13),=F'0'
         L     3,=V(GLBRTL)
         MVC   96(4,13),4(3)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_bne epilogue
         PDPEPIL
* Function gen_bne literal pool
         DS    0F
         LTORG
* Function gen_bne page table
         DS    0F
@@PGT77  EQU   *
         DC    A(@@PG77)
         DS    0F
* X-func gen_bgt prologue
GEN@BGT  PDPPRLG CINDEX=78,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN78
         LTORG
@@FEN78  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG78   EQU   *
         LR    11,1
         L     10,=A(@@PGT78)
* Function gen_bgt code
         MVC   88(4,13),=F'105'
         MVC   92(4,13),=F'0'
         L     3,=V(GLBRTL)
         MVC   96(4,13),4(3)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_bgt epilogue
         PDPEPIL
* Function gen_bgt literal pool
         DS    0F
         LTORG
* Function gen_bgt page table
         DS    0F
@@PGT78  EQU   *
         DC    A(@@PG78)
         DS    0F
* X-func gen_bgtu prologue
GEN@BGTU PDPPRLG CINDEX=79,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN79
         LTORG
@@FEN79  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG79   EQU   *
         LR    11,1
         L     10,=A(@@PGT79)
* Function gen_bgtu code
         MVC   88(4,13),=F'109'
         MVC   92(4,13),=F'0'
         L     3,=V(GLBRTL)
         MVC   96(4,13),4(3)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_bgtu epilogue
         PDPEPIL
* Function gen_bgtu literal pool
         DS    0F
         LTORG
* Function gen_bgtu page table
         DS    0F
@@PGT79  EQU   *
         DC    A(@@PG79)
         DS    0F
* X-func gen_blt prologue
GEN@BLT  PDPPRLG CINDEX=80,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN80
         LTORG
@@FEN80  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG80   EQU   *
         LR    11,1
         L     10,=A(@@PGT80)
* Function gen_blt code
         MVC   88(4,13),=F'107'
         MVC   92(4,13),=F'0'
         L     3,=V(GLBRTL)
         MVC   96(4,13),4(3)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_blt epilogue
         PDPEPIL
* Function gen_blt literal pool
         DS    0F
         LTORG
* Function gen_blt page table
         DS    0F
@@PGT80  EQU   *
         DC    A(@@PG80)
         DS    0F
* X-func gen_bltu prologue
GEN@BLTU PDPPRLG CINDEX=81,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN81
         LTORG
@@FEN81  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG81   EQU   *
         LR    11,1
         L     10,=A(@@PGT81)
* Function gen_bltu code
         MVC   88(4,13),=F'111'
         MVC   92(4,13),=F'0'
         L     3,=V(GLBRTL)
         MVC   96(4,13),4(3)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_bltu epilogue
         PDPEPIL
* Function gen_bltu literal pool
         DS    0F
         LTORG
* Function gen_bltu page table
         DS    0F
@@PGT81  EQU   *
         DC    A(@@PG81)
         DS    0F
* X-func gen_bge prologue
GEN@BGE  PDPPRLG CINDEX=82,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN82
         LTORG
@@FEN82  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG82   EQU   *
         LR    11,1
         L     10,=A(@@PGT82)
* Function gen_bge code
         MVC   88(4,13),=F'104'
         MVC   92(4,13),=F'0'
         L     3,=V(GLBRTL)
         MVC   96(4,13),4(3)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_bge epilogue
         PDPEPIL
* Function gen_bge literal pool
         DS    0F
         LTORG
* Function gen_bge page table
         DS    0F
@@PGT82  EQU   *
         DC    A(@@PG82)
         DS    0F
* X-func gen_bgeu prologue
GEN@BGEU PDPPRLG CINDEX=83,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN83
         LTORG
@@FEN83  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG83   EQU   *
         LR    11,1
         L     10,=A(@@PGT83)
* Function gen_bgeu code
         MVC   88(4,13),=F'108'
         MVC   92(4,13),=F'0'
         L     3,=V(GLBRTL)
         MVC   96(4,13),4(3)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_bgeu epilogue
         PDPEPIL
* Function gen_bgeu literal pool
         DS    0F
         LTORG
* Function gen_bgeu page table
         DS    0F
@@PGT83  EQU   *
         DC    A(@@PG83)
         DS    0F
* X-func gen_ble prologue
GEN@BLE  PDPPRLG CINDEX=84,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN84
         LTORG
@@FEN84  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG84   EQU   *
         LR    11,1
         L     10,=A(@@PGT84)
* Function gen_ble code
         MVC   88(4,13),=F'106'
         MVC   92(4,13),=F'0'
         L     3,=V(GLBRTL)
         MVC   96(4,13),4(3)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_ble epilogue
         PDPEPIL
* Function gen_ble literal pool
         DS    0F
         LTORG
* Function gen_ble page table
         DS    0F
@@PGT84  EQU   *
         DC    A(@@PG84)
         DS    0F
* X-func gen_bleu prologue
GEN@BLEU PDPPRLG CINDEX=85,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN85
         LTORG
@@FEN85  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG85   EQU   *
         LR    11,1
         L     10,=A(@@PGT85)
* Function gen_bleu code
         MVC   88(4,13),=F'110'
         MVC   92(4,13),=F'0'
         L     3,=V(GLBRTL)
         MVC   96(4,13),4(3)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         ST    15,100(13)
         MVC   104(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(GREEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_bleu epilogue
         PDPEPIL
* Function gen_bleu literal pool
         DS    0F
         LTORG
* Function gen_bleu page table
         DS    0F
@@PGT85  EQU   *
         DC    A(@@PG85)
         DS    0F
* X-func gen_jump prologue
GEN@JUMP PDPPRLG CINDEX=86,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN86
         LTORG
@@FEN86  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG86   EQU   *
         LR    11,1
         L     10,=A(@@PGT86)
* Function gen_jump code
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),0(2)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_jump epilogue
         PDPEPIL
* Function gen_jump literal pool
         DS    0F
         LTORG
* Function gen_jump page table
         DS    0F
@@PGT86  EQU   *
         DC    A(@@PG86)
         DS    0F
* X-func gen_indirect_jump prologue
GEN@INDI PDPPRLG CINDEX=87,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN87
         LTORG
@@FEN87  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG87   EQU   *
         LR    11,1
         L     10,=A(@@PGT87)
* Function gen_indirect_jump code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),0(2)
         MVC   100(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gen_indirect_jump epilogue
         PDPEPIL
* Function gen_indirect_jump literal pool
         DS    0F
         LTORG
* Function gen_indirect_jump page table
         DS    0F
@@PGT87  EQU   *
         DC    A(@@PG87)
         DS    0F
* X-func gen_tablejump prologue
GEN@TABL PDPPRLG CINDEX=88,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN88
         LTORG
@@FEN88  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG88   EQU   *
         LR    11,1
         L     10,=A(@@PGT88)
* Function gen_tablejump code
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,=V(GLBRTL)
         MVC   96(4,13),0(2)
         MVC   100(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'2'
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GENRV)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
* Function gen_tablejump epilogue
         PDPEPIL
* Function gen_tablejump literal pool
         DS    0F
         LTORG
* Function gen_tablejump page table
         DS    0F
@@PGT88  EQU   *
         DC    A(@@PG88)
         DS    0F
* X-func gcall prologue
GCALL    PDPPRLG CINDEX=89,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN89
         LTORG
@@FEN89  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG89   EQU   *
         LR    11,1
         L     10,=A(@@PGT89)
* Function gcall code
         MVC   88(4,13),=F'50'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gcall epilogue
         PDPEPIL
* Function gcall literal pool
         DS    0F
         LTORG
* Function gcall page table
         DS    0F
@@PGT89  EQU   *
         DC    A(@@PG89)
         DS    0F
* X-func gcallval prologue
GCALLVAL PDPPRLG CINDEX=90,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN90
         LTORG
@@FEN90  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG90   EQU   *
         LR    11,1
         L     10,=A(@@PGT90)
* Function gcallval code
         MVC   88(4,13),=F'50'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),0(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
* Function gcallval epilogue
         PDPEPIL
* Function gcallval literal pool
         DS    0F
         LTORG
* Function gcallval page table
         DS    0F
@@PGT90  EQU   *
         DC    A(@@PG90)
         DS    0F
* X-func gen_nop prologue
GEN@NOP  PDPPRLG CINDEX=91,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN91
         LTORG
@@FEN91  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG91   EQU   *
         LR    11,1
         L     10,=A(@@PGT91)
* Function gen_nop code
         L     2,=V(CIRTX)
         L     15,256(2)
* Function gen_nop epilogue
         PDPEPIL
* Function gen_nop literal pool
         DS    0F
         LTORG
* Function gen_nop page table
         DS    0F
@@PGT91  EQU   *
         DC    A(@@PG91)
         DS    0F
* X-func gcmpssi prologue
GCMPSSI  PDPPRLG CINDEX=92,FRAME=128,BASER=12,ENTRY=YES
         B     @@FEN92
         LTORG
@@FEN92  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG92   EQU   *
         LR    11,1
         L     10,=A(@@PGT92)
* Function gcmpssi code
         L     5,4(11)
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   104(4,13),0(11)
         ST    5,108(13)
         MVC   112(4,13),8(11)
         MVC   116(4,13),12(11)
         MVC   120(4,13),16(11)
         L     4,4(5)
         LH    2,0(4)
         CLM   2,3,=H'61'
         BE    @@L95
         CLM   2,3,=H'75'
         BE    @@L104
@@L94    EQU   *
         MVC   88(4,13),=F'4'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(COPYTMR)
         BALR  14,15
         MVC   88(4,13),=F'51'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         LR    4,15
@@L96    EQU   *
         L     5,112(13)
         L     15,4(5)
         LH    2,0(15)
         CLM   2,3,=H'61'
         BE    @@L98
         CLM   2,3,=H'75'
         BE    @@L105
@@L97    EQU   *
         MVC   88(4,13),=F'4'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(COPYTMR)
         BALR  14,15
         MVC   88(4,13),=F'51'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
@@L99    EQU   *
         L     3,116(13)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L106
@@L100   EQU   *
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    6,15
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    5,15
         L     9,104(13)
         L     7,108(13)
         L     8,112(13)
         L     4,116(13)
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L102
         CLM   3,3,=H'54'
         BE    @@L102
         CLM   3,3,=H'55'
         BE    @@L102
         CLM   3,3,=H'58'
         BE    @@L102
         CLM   3,3,=H'134'
         BE    @@L102
         CLM   3,3,=H'56'
         BE    @@L102
         CLM   3,3,=H'140'
         BE    @@L102
         MVC   88(4,13),=F'4'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@RE)
         BALR  14,15
         LR    4,15
@@L102   EQU   *
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    6,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(7)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    6,92(13)
         L     2,=V(MODE@SIZ)
         SLR   3,3
         IC    3,4(2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    5,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(8)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    5,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         ST    9,88(13)
         ST    6,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(GCMSI1)
         BALR  14,15
         B     @@L103
@@L106   EQU   *
         L     2,4(3)
         LA    3,256(0,0)
         CLR   2,3
         BH    @@L100
         MVC   88(4,13),=F'74'
         MVC   92(4,13),=F'4'
         ST    4,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),104(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'2'
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GENRV)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
         B     @@L103
@@L105   EQU   *
         L     2,4(15)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L97
         L     3,8(15)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L97
         L     2,4(3)
         LA    3,4095(0,0)
         CLR   2,3
         BH    @@L97
@@L98    EQU   *
         LR    15,5
         B     @@L99
@@L104   EQU   *
         L     2,4(4)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L94
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L94
         L     2,4(3)
         LA    3,4095(0,0)
         CLR   2,3
         BH    @@L94
@@L95    EQU   *
         LR    4,5
         B     @@L96
@@L103   EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,2
* Function gcmpssi epilogue
         PDPEPIL
* Function gcmpssi literal pool
         DS    0F
         LTORG
* Function gcmpssi page table
         DS    0F
@@PGT92  EQU   *
         DC    A(@@PG92)
         DS    0F
* X-func gen_clrstrsi prologue
GEN@CLRS PDPPRLG CINDEX=93,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN93
         LTORG
@@FEN93  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG93   EQU   *
         LR    11,1
         L     10,=A(@@PGT93)
* Function gen_clrstrsi code
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   104(4,13),0(11)
         MVC   108(4,13),4(11)
         MVC   112(4,13),8(11)
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    4,15
         L     6,104(13)
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    7,15
         L     3,108(13)
         LH    15,0(3)
         LR    2,15
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L108
         CLM   15,3,=H'54'
         BE    @@L108
         CLM   15,3,=H'55'
         BE    @@L108
         CLM   15,3,=H'58'
         BE    @@L108
         CLM   15,3,=H'134'
         BE    @@L108
         CLM   15,3,=H'56'
         BE    @@L108
         CLM   15,3,=H'140'
         BE    @@L108
         MVC   88(4,13),=F'4'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@RE)
         BALR  14,15
         LR    3,15
@@L108   EQU   *
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    5,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(6)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    5,92(13)
         L     2,=V(MODE@SIZ)
         SLR   6,6
         IC    6,4(2)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         ST    15,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    4,92(13)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         ST    15,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(GMOVT1)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,2
* Function gen_clrstrsi epilogue
         PDPEPIL
* Function gen_clrstrsi literal pool
         DS    0F
         LTORG
* Function gen_clrstrsi page table
         DS    0F
@@PGT93  EQU   *
         DC    A(@@PG93)
         DS    0F
* X-func gmovtrsi prologue
GMOVTRSI PDPPRLG CINDEX=94,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN94
         LTORG
@@FEN94  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG94   EQU   *
         LR    11,1
         L     10,=A(@@PGT94)
* Function gmovtrsi code
         L     5,0(11)
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    5,104(13)
         MVC   108(4,13),4(11)
         MVC   112(4,13),8(11)
         MVC   116(4,13),12(11)
         L     4,4(5)
         LH    2,0(4)
         CLM   2,3,=H'61'
         BE    @@L111
         CLM   2,3,=H'75'
         BE    @@L120
@@L110   EQU   *
         MVC   88(4,13),=F'4'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(COPYTMR)
         BALR  14,15
         MVC   88(4,13),104(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(REPEQADD)
         BALR  14,15
         LR    4,15
@@L112   EQU   *
         L     5,108(13)
         L     15,4(5)
         LH    2,0(15)
         CLM   2,3,=H'61'
         BE    @@L114
         CLM   2,3,=H'75'
         BE    @@L121
@@L113   EQU   *
         MVC   88(4,13),=F'4'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(COPYTMR)
         BALR  14,15
         MVC   88(4,13),108(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(REPEQADD)
         BALR  14,15
@@L115   EQU   *
         L     3,112(13)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L122
@@L116   EQU   *
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    6,15
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    5,15
         L     7,104(13)
         L     8,108(13)
         L     4,112(13)
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L118
         CLM   3,3,=H'54'
         BE    @@L118
         CLM   3,3,=H'55'
         BE    @@L118
         CLM   3,3,=H'58'
         BE    @@L118
         CLM   3,3,=H'134'
         BE    @@L118
         CLM   3,3,=H'56'
         BE    @@L118
         CLM   3,3,=H'140'
         BE    @@L118
         MVC   88(4,13),=F'4'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@RE)
         BALR  14,15
         LR    4,15
@@L118   EQU   *
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    6,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(7)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    6,92(13)
         L     2,=V(MODE@SIZ)
         SLR   3,3
         IC    3,4(2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    5,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(8)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    5,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         ST    6,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(GMOVT1)
         BALR  14,15
         B     @@L119
@@L122   EQU   *
         L     2,4(3)
         LA    3,256(0,0)
         CLR   2,3
         BH    @@L116
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'2'
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GENRV)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
         B     @@L119
@@L121   EQU   *
         L     2,4(15)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L113
         L     3,8(15)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L113
         L     2,4(3)
         LA    3,4095(0,0)
         CLR   2,3
         BH    @@L113
@@L114   EQU   *
         LR    15,5
         B     @@L115
@@L120   EQU   *
         L     2,4(4)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L110
         L     3,8(4)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L110
         L     2,4(3)
         LA    3,4095(0,0)
         CLR   2,3
         BH    @@L110
@@L111   EQU   *
         LR    4,5
         B     @@L112
@@L119   EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,2
* Function gmovtrsi epilogue
         PDPEPIL
* Function gmovtrsi literal pool
         DS    0F
         LTORG
* Function gmovtrsi page table
         DS    0F
@@PGT94  EQU   *
         DC    A(@@PG94)
         DS    0F
* X-func gesid2 prologue
GESID2   PDPPRLG CINDEX=95,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN95
         LTORG
@@FEN95  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG95   EQU   *
         LR    11,1
         L     10,=A(@@PGT95)
* Function gesid2 code
         L     5,0(11)
         L     3,4(11)
         SLR   4,4
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         LR    6,5
         LR    7,3
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L124
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(OPSUBW)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    4,92(13)
         ST    15,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'89'
         MVC   92(4,13),=F'5'
         ST    5,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    4,92(13)
         ST    5,96(13)
         ST    15,100(13)
         B     @@L129
@@L124   EQU   *
         L     2,4(3)
         LTR   2,2
         BL    @@L130
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(OPSUBW)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'4'
         ST    4,92(13)
@@L128   EQU   *
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    4,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@LOWP)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         ST    7,100(13)
         B     @@L129
@@L130   EQU   *
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(OPSUBW)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'-1'
         B     @@L128
@@L129   EQU   *
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    4,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,4
* Function gesid2 epilogue
         PDPEPIL
* Function gesid2 literal pool
         DS    0F
         LTORG
* Function gesid2 page table
         DS    0F
@@PGT95  EQU   *
         DC    A(@@PG95)
         DS    0F
* X-func gzei2 prologue
GZEI2    PDPPRLG CINDEX=96,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN96
         LTORG
@@FEN96  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG96   EQU   *
         LR    11,1
         L     10,=A(@@PGT96)
* Function gzei2 code
         L     2,0(11)
         SLR   3,3
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    2,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(OPSUBW)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    3,92(13)
         ST    15,96(13)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'90'
         MVC   92(4,13),=F'5'
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    3,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,3
* Function gzei2 epilogue
         PDPEPIL
* Function gzei2 literal pool
         DS    0F
         LTORG
* Function gzei2 page table
         DS    0F
@@PGT96  EQU   *
         DC    A(@@PG96)
         DS    0F
* X-func gadddi3 prologue
GADDDI3  PDPPRLG CINDEX=97,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN97
         LTORG
@@FEN97  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG97   EQU   *
         LR    11,1
         L     10,=A(@@PGT97)
* Function gadddi3 code
         SLR   6,6
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   104(4,13),0(11)
         MVC   108(4,13),4(11)
         MVC   112(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),104(13)
         ST    6,92(13)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(OPSUBW)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'4'
         MVC   92(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(GEN@LOWP)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),108(13)
         ST    6,92(13)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(OPSUBW)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),112(13)
         ST    6,92(13)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(OPSUBW)
         BALR  14,15
         MVC   88(4,13),=F'75'
         MVC   92(4,13),=F'4'
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    6,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         MVC   92(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(GEN@LOWP)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'4'
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GEN@LOWP)
         BALR  14,15
         MVC   88(4,13),=F'75'
         MVC   92(4,13),=F'4'
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    6,92(13)
         ST    4,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'67'
         ST    6,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),=F'48'
         ST    6,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'2'
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GENRV)
         BALR  14,15
         MVC   88(4,13),=F'39'
         ST    6,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'75'
         MVC   92(4,13),=F'4'
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    6,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    6,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,6
* Function gadddi3 epilogue
         PDPEPIL
* Function gadddi3 literal pool
         DS    0F
         LTORG
* Function gadddi3 page table
         DS    0F
@@PGT97  EQU   *
         DC    A(@@PG97)
         DS    0F
* X-func gmulsi3 prologue
GMULSI3  PDPPRLG CINDEX=98,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN98
         LTORG
@@FEN98  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG98   EQU   *
         LR    11,1
         L     10,=A(@@PGT98)
* Function gmulsi3 code
         L     5,0(11)
         L     3,4(11)
         L     6,8(11)
         SLR   4,4
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    5,104(13)
         ST    3,108(13)
         ST    6,112(13)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L143
@@L134   EQU   *
         L     15,112(13)
         LH    2,0(15)
         CLM   2,3,=H'54'
         BE    @@L144
@@L136   EQU   *
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    3,15
         L     2,108(13)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BE    @@L145
         MVC   88(4,13),=F'4'
         ST    15,92(13)
         L     2,=V(MODE@SIZ)
         SLR   5,5
         IC    5,4(2)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'78'
         MVC   92(4,13),=F'5'
         ST    3,96(13)
         MVC   100(4,13),108(13)
@@L140   EQU   *
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    3,92(13)
         L     2,=V(MODE@SIZ)
         SLR   3,3
         IC    3,4(2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
@@L141   EQU   *
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         B     @@L142
@@L145   EQU   *
         MVC   88(4,13),=F'4'
         ST    15,92(13)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,4(2)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'78'
         MVC   92(4,13),=F'5'
         ST    3,96(13)
         MVC   100(4,13),112(13)
         B     @@L140
@@L144   EQU   *
         L     2,104(13)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L136
         L     2,4(15)
         A     2,=F'32768'
         L     3,=F'65535'
         CLR   2,3
         BH    @@L136
         MVC   88(4,13),=F'78'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),108(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L141
@@L143   EQU   *
         LH    2,0(5)
         CLM   2,3,=H'61'
         BNE   @@L134
         L     2,4(3)
         A     2,=F'32768'
         L     5,=F'65535'
         CLR   2,5
         BH    @@L134
         MVC   88(4,13),=F'78'
         MVC   92(4,13),=F'4'
         ST    6,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    4,92(13)
@@L142   EQU   *
         MVC   96(4,13),104(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    4,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,4
* Function gmulsi3 epilogue
         PDPEPIL
* Function gmulsi3 literal pool
         DS    0F
         LTORG
* Function gmulsi3 page table
         DS    0F
@@PGT98  EQU   *
         DC    A(@@PG98)
         DS    0F
* X-func gdifsi3 prologue
GDIFSI3  PDPPRLG CINDEX=99,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN99
         LTORG
@@FEN99  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG99   EQU   *
         LR    11,1
         L     10,=A(@@PGT99)
* Function gdifsi3 code
         SLR   3,3
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   104(4,13),0(11)
         MVC   108(4,13),4(11)
         MVC   112(4,13),8(11)
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         MVC   92(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(GESID2)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'79'
         MVC   92(4,13),=F'5'
         ST    2,96(13)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    3,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    2,92(13)
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,4(2)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    3,92(13)
         MVC   96(4,13),104(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,3
* Function gdifsi3 epilogue
         PDPEPIL
* Function gdifsi3 literal pool
         DS    0F
         LTORG
* Function gdifsi3 page table
         DS    0F
@@PGT99  EQU   *
         DC    A(@@PG99)
         DS    0F
* X-func gen_udivsi3 prologue
GEN@UDIV PDPPRLG CINDEX=100,FRAME=128,BASER=12,ENTRY=YES
         B     @@FEN100
         LTORG
@@FEN100 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG100  EQU   *
         LR    11,1
         L     10,=A(@@PGT100)
* Function gen_udivsi3 code
         SLR   8,8
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   104(4,13),0(11)
         MVC   108(4,13),4(11)
         MVC   112(4,13),8(11)
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    7,15
         MVC   88(4,13),=F'4'
         ST    15,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         LR    9,15
         MVC   88(4,13),=F'4'
         ST    7,92(13)
         L     2,=V(MODE@SIZ)
         SLR   3,3
         IC    3,4(2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         LR    6,15
         L     3,112(13)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L153
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    5,15
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,120(13)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    2,96(13)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    6,96(13)
         L     3,=V(CIRTX)
         MVC   100(4,13),256(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    2,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(GCMPSI)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@BGTU)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),256(3)
         LA    1,88(,13)
         L     15,=A(GCMPSI)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),120(13)
         LA    1,88(,13)
         L     15,=A(GEN@BLT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),260(3)
         LA    1,88(,13)
         L     15,=A(GCMPSI)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@BEQ)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'90'
         MVC   92(4,13),=F'5'
         ST    7,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    7,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'79'
         MVC   92(4,13),=F'5'
         ST    7,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    7,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    6,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         MVC   88(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    6,96(13)
         MVC   100(4,13),260(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    4,88(13)
@@L152   EQU   *
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         B     @@L151
@@L153   EQU   *
         L     2,4(3)
         LTR   2,2
         BNH   @@L149
         ST    7,88(13)
         MVC   92(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(GZEI2)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'79'
         MVC   92(4,13),=F'5'
         ST    7,96(13)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    7,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         B     @@L151
@@L149   EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    6,96(13)
         L     2,=V(CIRTX)
         MVC   100(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    9,88(13)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(GCMPSI)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@BLTU)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    6,96(13)
         MVC   100(4,13),260(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    3,88(13)
         B     @@L152
@@L151   EQU   *
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),104(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    8,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,8
* Function gen_udivsi3 epilogue
         PDPEPIL
* Function gen_udivsi3 literal pool
         DS    0F
         LTORG
* Function gen_udivsi3 page table
         DS    0F
@@PGT100 EQU   *
         DC    A(@@PG100)
         DS    0F
* X-func gen_modsi3 prologue
GEN@MODS PDPPRLG CINDEX=101,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN101
         LTORG
@@FEN101 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG101  EQU   *
         LR    11,1
         L     10,=A(@@PGT101)
* Function gen_modsi3 code
         SLR   3,3
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   104(4,13),0(11)
         MVC   108(4,13),4(11)
         MVC   112(4,13),8(11)
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         MVC   92(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(GESID2)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'80'
         MVC   92(4,13),=F'5'
         ST    2,96(13)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    3,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'4'
         ST    2,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    3,92(13)
         MVC   96(4,13),104(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,3
* Function gen_modsi3 epilogue
         PDPEPIL
* Function gen_modsi3 literal pool
         DS    0F
         LTORG
* Function gen_modsi3 page table
         DS    0F
@@PGT101 EQU   *
         DC    A(@@PG101)
         DS    0F
* X-func gen_umodsi3 prologue
GEN@UMOD PDPPRLG CINDEX=102,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN102
         LTORG
@@FEN102 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG102  EQU   *
         LR    11,1
         L     10,=A(@@PGT102)
* Function gen_umodsi3 code
         SLR   8,8
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   104(4,13),0(11)
         MVC   108(4,13),4(11)
         MVC   112(4,13),8(11)
         MVC   88(4,13),=F'5'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    7,15
         MVC   88(4,13),=F'4'
         ST    15,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(GRSUB)
         BALR  14,15
         LR    9,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    15,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         L     3,112(13)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L161
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    5,15
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    6,15
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    2,96(13)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    2,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(GCMPSI)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@BGTU)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         ST    2,88(13)
         L     3,=V(CIRTX)
         MVC   92(4,13),256(3)
         LA    1,88(,13)
         L     15,=A(GCMPSI)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@BLT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),260(3)
         LA    1,88(,13)
         L     15,=A(GCMPSI)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@BEQ)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'90'
         MVC   92(4,13),=F'5'
         ST    7,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    7,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'80'
         MVC   92(4,13),=F'5'
         ST    7,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    7,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    9,96(13)
         MVC   100(4,13),256(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         MVC   88(4,13),=F'76'
         MVC   92(4,13),=F'4'
         ST    9,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    9,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    4,88(13)
@@L160   EQU   *
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         B     @@L159
@@L161   EQU   *
         L     2,4(3)
         LTR   2,2
         BNH   @@L157
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'90'
         MVC   92(4,13),=F'5'
         ST    7,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    7,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'80'
         MVC   92(4,13),=F'5'
         ST    7,96(13)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    7,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         B     @@L159
@@L157   EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    15,96(13)
         MVC   100(4,13),112(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    9,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(GCMPSI)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(GEN@BLTU)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         MVC   88(4,13),=F'129'
         MVC   92(4,13),=F'4'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'75'
         MVC   92(4,13),=F'4'
         ST    9,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'47'
         ST    8,92(13)
         ST    9,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    3,88(13)
         B     @@L160
@@L159   EQU   *
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),104(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    8,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,8
* Function gen_umodsi3 epilogue
         PDPEPIL
* Function gen_umodsi3 literal pool
         DS    0F
         LTORG
* Function gen_umodsi3 page table
         DS    0F
@@PGT102 EQU   *
         DC    A(@@PG102)
         DS    0F
* X-func gen_untyped_call prologue
GEN@UNTY PDPPRLG CINDEX=103,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN103
         LTORG
@@FEN103 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG103  EQU   *
         LR    11,1
         L     10,=A(@@PGT103)
* Function gen_untyped_call code
         L     2,0(11)
         SLR   3,3
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    2,104(13)
         MVC   108(4,13),4(11)
         MVC   112(4,13),8(11)
         ST    2,88(13)
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         LA    1,88(,13)
         L     15,=A(GCALL)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMCINS)
         BALR  14,15
         L     2,112(13)
         L     15,4(2)
         C     3,0(15)
         BNL   @@L169
@@L167   EQU   *
         LR    2,3
         MH    2,=H'4'
         L     2,4(2,15)
         MVC   88(4,13),4(2)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         A     3,=F'1'
         L     2,112(13)
         L     15,4(2)
         C     3,0(15)
         BL    @@L167
@@L169   EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,3
* Function gen_untyped_call epilogue
         PDPEPIL
* Function gen_untyped_call literal pool
         DS    0F
         LTORG
* Function gen_untyped_call page table
         DS    0F
@@PGT103 EQU   *
         DC    A(@@PG103)
@@LC0    EQU   *
         DC    C'<stdin>'
         DC    X'0'
@@LC1    EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* X-func add_clobbers prologue
ADD@CLOB PDPPRLG CINDEX=104,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN104
         LTORG
@@FEN104 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG104  EQU   *
         LR    11,1
         L     10,=A(@@PGT104)
* Function add_clobbers code
         L     2,4(11)
         LA    3,34(0,0)
         CLR   2,3
         BE    @@L175
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1938'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L170
@@L175   EQU   *
         L     2,0(11)
         L     2,4(2)
         MVC   88(4,13),=F'16'
         MVC   92(4,13),=F'16'
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,8(2)
@@L170   EQU   *
* Function add_clobbers epilogue
         PDPEPIL
* Function add_clobbers literal pool
         DS    0F
         LTORG
* Function add_clobbers page table
         DS    0F
@@PGT104 EQU   *
         DC    A(@@PG104)
         DS    0F
* X-func added_clobbers_hard_reg_p prologue
ADDED@CL PDPPRLG CINDEX=105,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN105
         LTORG
@@FEN105 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG105  EQU   *
         LR    11,1
         L     10,=A(@@PGT105)
* Function added_clobbers_hard_reg_p code
         LA    15,1(0,0)
         L     2,0(11)
         LA    3,34(0,0)
         CLR   2,3
         BE    @@L176
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1953'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L176   EQU   *
* Function added_clobbers_hard_reg_p epilogue
         PDPEPIL
* Function added_clobbers_hard_reg_p literal pool
         DS    0F
         LTORG
* Function added_clobbers_hard_reg_p page table
         DS    0F
@@PGT105 EQU   *
         DC    A(@@PG105)
         END
