         COPY  PDPTOP
         CSECT
* Program text area
         DS    0F
* X-func init_loop prologue
INIT@LOO PDPPRLG CINDEX=0,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function init_loop code
         L     2,=V(WORD@MOD)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'25'
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(ADRCOST)
         BALR  14,15
         L     2,=A(@@0)
         ST    15,0(2)
         L     2,=A(@@1)
         MVC   0(4,2),=F'4'
* Function init_loop epilogue
         PDPEPIL
* Function init_loop literal pool
         DS    0F
         LTORG
* Function init_loop page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
         DS    0F
* S-func compute_luids prologue
@@2      PDPPRLG CINDEX=1,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function compute_luids code
         L     5,4(11)
         L     4,0(11)
         L     15,8(11)
         CR    4,5
         BE    @@L13
@@L11    EQU   *
         L     3,4(4)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BNL   @@L5
         LH    2,0(4)
         CLM   2,3,=H'37'
         BE    @@L15
@@L9     EQU   *
         L     2,=A(UID@LUID)
         L     2,0(2)
         MH    3,=H'4'
         A     15,=F'1'
@@L14    EQU   *
         ST    15,0(3,2)
@@L5     EQU   *
         L     4,12(4)
         CLR   4,5
         BNE   @@L11
         B     @@L13
@@L15    EQU   *
         L     2,20(4)
         LTR   2,2
         BNH   @@L9
         L     2,=A(UID@LUID)
         L     2,0(2)
         MH    3,=H'4'
         B     @@L14
@@L13    EQU   *
         A     15,=F'1'
* Function compute_luids epilogue
         PDPEPIL
* Function compute_luids literal pool
         DS    0F
         LTORG
* Function compute_luids page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
@@LC0    EQU   *
         DC    C'<stdin>'
         DC    X'0'
@@LC1    EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* X-func loop_optimize prologue
LOOP@OPT PDPPRLG CINDEX=2,FRAME=136,BASER=12,ENTRY=YES
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function loop_optimize code
         L     7,0(11)
         L     9,8(11)
         LA    6,104(,13)
         L     2,=A(LOOP@DUM)
         MVC   0(4,2),4(11)
         LA    1,88(,13)
         L     15,=V(IRECNOV)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         L     2,=A(MXRGBL)
         ST    15,0(2)
         L     2,=A(@@3)
         ST    15,0(2)
         L     2,=V(REGS@MAY)
         MVC   0(4,2),=F'0'
         L     2,=A(@@4)
         MVC   0(4,2),=F'0'
         LR    4,7
         LTR   7,7
         BE    @@L50
@@L22    EQU   *
         LH    2,0(4)
         CLM   2,3,=H'37'
         BE    @@L58
@@L19    EQU   *
         L     4,12(4)
         LTR   4,4
         BNE   @@L22
@@L50    EQU   *
         L     4,=A(@@4)
         L     2,0(4)
         LTR   2,2
         BE    @@L16
         ST    2,0(6)
         L     3,=A(MAX@UID@)
         LA    1,88(,13)
         L     15,=V(GET@MAX@)
         BALR  14,15
         L     2,0(4)
         SLL   2,5
         AR    15,2
         A     15,=F'1'
         ST    15,0(3)
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     2,=A(UID@LUID)
         ST    15,0(2)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         L     2,=A(UID@LOOP)
         ST    15,0(2)
         MVC   88(4,13),0(6)
         MVC   92(4,13),=F'132'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,8(6)
         ST    7,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@5)
         BALR  14,15
         MVC   88(4,13),0(6)
         MVC   92(4,13),=F'152'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         LR    8,15
         L     3,0(6)
         LTR   3,3
         BNH   @@L52
         LR    5,15
         LR    4,3
         L     2,8(6)
         A     2,=F'88'
@@L28    EQU   *
         ST    5,0(2)
         A     5,=F'152'
         A     2,=F'132'
         BCTR  4,0
         LTR   4,4
         BNE   @@L28
@@L52    EQU   *
         ST    7,88(13)
         L     2,=A(MXRGBL)
         MVC   92(4,13),0(2)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(RSCAN)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(IA@ANAL)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GET@MAX@)
         BALR  14,15
         L     3,=A(MAX@UID@)
         C     15,0(3)
         BH    @@L59
@@L29    EQU   *
         LA    1,88(,13)
         L     15,=V(GET@MAX@)
         BALR  14,15
         ST    15,0(3)
         ST    7,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@2)
         BALR  14,15
         L     2,=A(@@6)
         ST    15,0(2)
         SLR   4,4
         C     4,0(3)
         BNL   @@L31
@@L35    EQU   *
         L     2,=A(UID@LUID)
         L     2,0(2)
         LR    3,4
         MH    3,=H'4'
         L     3,0(3,2)
         ST    3,0(2)
         LTR   3,3
         BNE   @@L31
         A     4,=F'1'
         L     2,=A(MAX@UID@)
         C     4,0(2)
         BL    @@L35
@@L31    EQU   *
         SLR   4,4
         L     2,=A(MAX@UID@)
         C     4,0(2)
         BNL   @@L55
@@L41    EQU   *
         L     2,=A(UID@LUID)
         L     5,0(2)
         LR    3,4
         MH    3,=H'4'
         L     2,0(3,5)
         LTR   2,2
         BNE   @@L38
         AR    3,5
         LR    2,3
         A     2,=F'-4'
         MVC   0(4,3),0(2)
@@L38    EQU   *
         A     4,=F'1'
         L     2,=A(MAX@UID@)
         C     4,0(2)
         BL    @@L41
@@L55    EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         L     2,=A(@@7)
         ST    15,0(2)
         L     2,=A(@@4)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    @@L57
         LR    5,4
         SLL   5,5
         AR    5,4
         SLL   5,2
@@L47    EQU   *
         L     3,8(6)
         AR    3,5
         L     2,84(3)
         LTR   2,2
         BNE   @@L44
         L     2,108(3)
         LTR   2,2
         BNE   @@L60
@@L44    EQU   *
         A     5,=F'-132'
         BCTR  4,0
         LTR   4,4
         BNL   @@L47
@@L57    EQU   *
         L     2,=V(WRITE@SY)
         L     2,0(2)
         LTR   2,2
         BNE   @@L61
@@L48    EQU   *
         LA    1,88(,13)
         L     15,=V(END@ALIA)
         BALR  14,15
         L     2,=A(UID@LUID)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(UID@LOOP)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     @@L16
@@L61    EQU   *
         LA    1,88(,13)
         L     15,=V(REORB)
         BALR  14,15
         B     @@L48
@@L60    EQU   *
         ST    3,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
         B     @@L44
@@L59    EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'518'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L29
@@L58    EQU   *
         L     2,20(4)
         L     3,=F'-96'
         CLR   2,3
         BNE   @@L19
         L     3,=A(@@4)
         L     2,0(3)
         A     2,=F'1'
         ST    2,0(3)
         B     @@L19
@@L16    EQU   *
* Function loop_optimize epilogue
         PDPEPIL
* Function loop_optimize literal pool
         DS    0F
         LTORG
* Function loop_optimize page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
         DS    0F
* S-func next_insn_in_loop prologue
@@10     PDPPRLG CINDEX=3,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function next_insn_in_loop code
         L     2,0(11)
         L     15,4(11)
         L     15,12(15)
         CL    15,108(2)
         BE    @@L67
@@L63    EQU   *
         CL    15,116(2)
         BNE   @@L66
         SLR   15,15
         B     @@L66
@@L67    EQU   *
         L     15,112(2)
         B     @@L63
@@L66    EQU   *
* Function next_insn_in_loop epilogue
         PDPEPIL
* Function next_insn_in_loop literal pool
         DS    0F
         LTORG
* Function next_insn_in_loop page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
@@LC2    EQU   *
         DC    X'15'
         DC    C'Loop from %d to %d is phony.'
         DC    X'15'
         DC    X'15'
         DC    X'0'
@@LC3    EQU   *
         DC    X'15'
         DC    C'Loop from %d to %d: %d real insns.'
         DC    X'15'
         DC    X'0'
@@LC4    EQU   *
         DC    C'Continue at insn %d.'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func scan_loop prologue
@@9      PDPPRLG CINDEX=4,FRAME=200,BASER=12,ENTRY=NO
         B     @@FEN4
         LTORG
@@FEN4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         LR    11,1
         L     10,=A(@@PGT4)
* Function scan_loop code
         L     2,0(11)
         MVC   112(4,13),88(2)
         L     3,112(13)
         A     3,=F'120'
         ST    3,116(13)
         MVC   120(4,13),104(2)
         MVC   124(4,13),108(2)
         MVC   128(4,13),=F'0'
         MVC   132(4,13),128(13)
         L     4,112(13)
         A     4,=F'112'
         ST    4,148(13)
         MVC   156(4,13),128(13)
         MVC   112(4,2),156(13)
         MVC   0(4,4),156(13)
         MVC   4(4,4),156(13)
         L     5,120(13)
         L     7,12(5)
         CL    7,124(13)
         BE    @@L70
         LH    4,0(7)
         CLM   4,3,=H'36'
         BE    @@L70
         LR    2,4
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L70
         CLM   4,3,=H'37'
         L     14,=A(@@L244)
         BER   14
@@L74    EQU   *
         L     12,0(,10)
         L     7,12(7)
         CL    7,124(13)
         BE    @@L70
         LH    4,0(7)
         CLM   4,3,=H'36'
         BE    @@L70
         LR    2,4
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L70
         CLM   4,3,=H'37'
         BNE   @@L74
         L     2,20(7)
         A     2,=F'96'
         LA    8,1(0,0)
         CLR   2,8
         BH    @@L74
@@L70    EQU   *
         L     12,0(,10)
         L     15,0(11)
         ST    7,116(15)
         L     3,124(13)
         L     2,12(3)
         LTR   2,2
         L     14,=A(@@L75)
         BER   14
         ST    2,120(15)
@@L76    EQU   *
         L     12,0(,10)
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@11)
         BALR  14,15
         L     2,=V(N@NON@FI)
         L     3,0(2)
         A     3,=F'1'
         L     5,112(13)
         L     2,0(5)
         ST    3,152(13)
         BCTR  3,0
         LTR   2,2
         BNE   @@L78
         MH    3,=H'2'
         A     3,=F'2'
         ST    3,152(13)
@@L78    EQU   *
         LH    2,0(7)
         CH    2,=H'33'
         L     14,=A(@@L245)
         BER   14
@@L79    EQU   *
         L     12,0(,10)
         L     5,0(11)
         L     4,116(5)
         L     3,4(4)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BNL   @@L90
         LH    2,0(4)
         CLM   2,3,=H'36'
         BE    @@L89
@@L90    EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(@@L68)
         BER   14
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC2)
         L     6,120(13)
         MVC   96(4,13),4(6)
         L     8,124(13)
         MVC   100(4,13),4(8)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L68)
         BR    14
@@L89    EQU   *
         MVC   88(4,13),0(11)
         L     15,112(13)
         L     2,88(15)
         A     2,=F'16'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@12)
         BALR  14,15
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@13)
         BALR  14,15
         ST    15,136(13)
         L     3,=A(LOOP@DUM)
         L     2,0(3)
         LTR   2,2
         L     14,=A(@@L246)
         BNER  14
@@L92    EQU   *
         L     12,0(,10)
         MVC   160(4,13),=F'0'
         MVC   88(4,13),0(11)
         L     6,0(11)
         MVC   92(4,13),116(6)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BE    @@L235
@@L208   EQU   *
         L     8,160(13)
         LTR   8,8
         BE    @@L98
         LH    2,0(7)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L247)
         BER   14
@@L98    EQU   *
         L     12,0(,10)
         LH    3,0(7)
         CLM   3,3,=H'32'
         L     14,=A(@@L248)
         BER   14
         L     2,0(7)
         N     2,=F'-65504'
         L     4,=F'2228224'
         CLR   2,4
         L     14,=A(@@L249)
         BER   14
         CLM   3,3,=H'36'
         BE    @@L199
         CLM   3,3,=H'33'
         BE    @@L199
@@L198   EQU   *
         LH    2,0(7)
         CLM   2,3,=H'37'
         BE    @@L250
@@L96    EQU   *
         L     12,0(,10)
         MVC   88(4,13),0(11)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         LR    7,15
         LTR   15,15
         BNE   @@L208
@@L235   EQU   *
         MVC   88(4,13),148(13)
         LA    1,88(,13)
         L     15,=A(@@21)
         BALR  14,15
         MVC   88(4,13),148(13)
         LA    1,88(,13)
         L     15,=A(@@22)
         BALR  14,15
         MVC   88(4,13),148(13)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=A(@@23)
         BALR  14,15
         L     2,=V(OPTZSZ)
         L     2,0(2)
         LTR   2,2
         BE    @@L251
@@L209   EQU   *
         SLR   5,5
         L     8,116(13)
         C     5,0(8)
         BNL   @@L239
@@L222   EQU   *
         L     15,116(13)
         L     4,8(15)
         LR    3,5
         MH    3,=H'16'
         L     2,0(3,4)
         LTR   2,2
         BL    @@L252
@@L219   EQU   *
         A     5,=F'1'
         L     3,116(13)
         C     5,0(3)
         BL    @@L222
@@L239   EQU   *
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@25)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         L     4,116(13)
         C     15,0(4)
         BH    @@L253
@@L223   EQU   *
         L     4,120(13)
         L     2,8(4)
         LTR   2,2
         BE    @@L225
         LH    2,0(2)
         CLM   2,3,=H'36'
         BE    @@L225
@@L229   EQU   *
         L     4,8(4)
         L     2,8(4)
         LTR   2,2
         BE    @@L225
         LH    2,0(2)
         CLM   2,3,=H'36'
         BNE   @@L229
@@L225   EQU   *
         L     5,124(13)
         L     3,12(5)
         ST    4,88(13)
         ST    3,92(13)
         L     2,=A(@@3)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(RSCANU)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         ST    15,0(2)
         L     2,=V(FSREDUCE)
         L     2,0(2)
         LTR   2,2
         BE    @@L230
         LTR   3,3
         BE    @@L231
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L254
@@L231   EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@26)
         BALR  14,15
         ST    4,88(13)
         ST    3,92(13)
         L     2,=A(@@3)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(RSCANU)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         ST    15,0(2)
         LTR   3,3
         BE    @@L230
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L255
@@L230   EQU   *
         MVC   88(4,13),148(13)
         LA    1,88(,13)
         L     15,=A(@@27)
         BALR  14,15
         L     6,116(13)
         MVC   88(4,13),8(6)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   8(4,6),=F'0'
         MVC   0(4,6),=F'0'
         L     14,=A(@@L68)
         BR    14
@@L255   EQU   *
         L     2,16(3)
         BCTR  2,0
         ST    2,16(3)
         LTR   2,2
         BNE   @@L230
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         B     @@L230
@@L254   EQU   *
         L     2,16(3)
         A     2,=F'1'
         ST    2,16(3)
         B     @@L231
@@L253   EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@12)
         BALR  14,15
         B     @@L223
@@L252   EQU   *
         L     2,4(3,4)
         ST    2,0(3,4)
         B     @@L219
@@L251   EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),148(13)
         MVC   96(4,13),152(13)
         MVC   100(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@24)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         L     5,116(13)
         C     15,0(5)
         BNH   @@L209
         MVC   88(4,13),0(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@12)
         BALR  14,15
         L     4,120(13)
         L     2,8(4)
         LTR   2,2
         BE    @@L212
         LH    2,0(2)
         CLM   2,3,=H'36'
         BE    @@L212
@@L216   EQU   *
         L     4,8(4)
         L     2,8(4)
         LTR   2,2
         BE    @@L212
         LH    2,0(2)
         CLM   2,3,=H'36'
         BNE   @@L216
@@L212   EQU   *
         L     6,124(13)
         L     3,12(6)
         ST    4,88(13)
         ST    3,92(13)
         L     2,=A(@@3)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(RSCANU)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         ST    15,0(2)
         B     @@L209
@@L250   EQU   *
         L     2,20(7)
         L     6,=F'-93'
         CLR   2,6
         BE    @@L256
@@L203   EQU   *
         L     15,=F'-96'
         CLR   2,15
         BE    @@L257
         L     3,=F'-95'
         CLR   2,3
         BNE   @@L96
         L     4,156(13)
         BCTR  4,0
         ST    4,156(13)
         B     @@L96
@@L257   EQU   *
         L     2,156(13)
         A     2,=F'1'
         ST    2,156(13)
         B     @@L96
@@L256   EQU   *
         L     8,156(13)
         LTR   8,8
         BNE   @@L203
         ST    8,132(13)
         ST    8,128(13)
         B     @@L96
@@L199   EQU   *
         CLM   3,3,=H'33'
         BE    @@L258
@@L200   EQU   *
         MVC   128(4,13),=F'1'
         B     @@L96
@@L258   EQU   *
         L     2,32(7)
         L     5,0(11)
         CL    2,112(5)
         BNE   @@L200
         L     2,12(7)
         L     2,12(2)
         CL    2,124(13)
         BNE   @@L200
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@UNCO)
         BALR  14,15
         LTR   15,15
         BNE   @@L198
         B     @@L200
@@L249   EQU   *
         MVC   132(4,13),=F'1'
         B     @@L96
@@L248   EQU   *
         ST    7,88(13)
         MVC   92(4,13),=F'7'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L100
         L     15,160(13)
         A     15,=F'1'
         ST    15,160(13)
@@L100   EQU   *
         L     2,160(13)
         LTR   2,2
         BNE   @@L96
         LH    2,0(7)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L259)
         BER   14
         L     9,160(13)
@@L103   EQU   *
         L     12,0(,10)
         LTR   9,9
         BE    @@L96
         L     3,4(9)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L96
         L     4,116(13)
         L     2,8(4)
         L     3,4(3)
         SLL   3,4
         IC    2,12(3,2)
         CLM   2,1,=XL1'00'
         BNE   @@L96
         MVC   168(4,13),=F'0'
         MVC   164(4,13),168(13)
         MVC   172(4,13),168(13)
         L     8,8(9)
         MVC   176(4,13),172(13)
         ST    7,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),172(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L106)
         BER   14
         L     8,4(15)
         MVC   172(4,13),=F'1'
@@L107   EQU   *
         L     12,0(,10)
         L     3,16(7)
         LH    2,0(3)
         CLM   2,3,=H'39'
         L     14,=A(@@L260)
         BER   14
@@L111   EQU   *
         L     12,0(,10)
         L     2,4(9)
         L     3,4(2)
         L     2,=A(MXRGBL)
         CL    3,0(2)
         BNL   @@L96
         ST    7,88(13)
         MVC   92(4,13),4(9)
         LA    1,88(,13)
         L     15,=A(@@14)
         BALR  14,15
         LTR   15,15
         BNE   @@L120
         L     5,128(13)
         LTR   5,5
         BNE   @@L96
         MVC   88(4,13),0(11)
         ST    9,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@15)
         BALR  14,15
         LTR   15,15
         BNE   @@L96
@@L120   EQU   *
         MVC   88(4,13),0(11)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         ST    15,140(13)
         LTR   15,15
         L     14,=A(@@L123)
         BER   14
         L     6,176(13)
         LTR   6,6
         BE    @@L124
         MVC   88(4,13),0(11)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         ST    15,168(13)
         LTR   15,15
         L     14,=A(@@L123)
         BER   14
@@L124   EQU   *
         L     2,4(9)
         L     15,116(13)
         L     3,8(15)
         L     2,4(2)
         SLL   2,4
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L125
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(9)
         L     2,4(9)
         L     3,8(15)
         L     2,4(2)
         SLL   2,4
         L     3,0(2,3)
         ST    3,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=A(@@16)
         BALR  14,15
         ST    15,164(13)
         LTR   15,15
         L     14,=A(@@L123)
         BER   14
@@L125   EQU   *
         L     4,128(13)
         LTR   4,4
         BNE   @@L127
         L     5,132(13)
         LTR   5,5
         BE    @@L126
@@L127   EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(MAY@TRAP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L123)
         BNER  14
@@L126   EQU   *
         L     2,4(9)
         MVC   180(4,13),4(2)
         L     6,112(13)
         L     2,0(6)
         LTR   2,2
         BE    @@L128
         L     15,116(13)
         L     5,8(15)
         L     6,180(13)
         MH    6,=H'16'
         L     4,8(6,5)
         LTR   4,4
         BE    @@L128
         L     2,=V(CIRTX)
         CL    4,256(2)
         BE    @@L128
         L     2,180(13)
         MH    2,=H'4'
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,0(3)
         CL    2,4(7)
         L     14,=A(@@L261)
         BER   14
@@L128   EQU   *
         L     12,0(,10)
         MVC   88(4,13),=F'48'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    6,15
         MVC   44(4,15),=F'0'
         ST    7,0(15)
         ST    8,4(15)
         MVC   12(4,15),176(13)
         MVC   8(4,15),4(9)
         L     4,28(15)
         LR    15,4
         N     15,=F'-1073741825'
         ST    15,28(6)
         L     2,4(9)
         L     5,116(13)
         L     3,8(5)
         L     2,4(2)
         SLL   2,4
         L     2,0(2,3)
         BCTR  2,0
         ST    2,16(6)
         MVC   40(4,6),=F'0'
         L     2,172(13)
         SLL   2,26
         N     4,=F'-1577058305'
         OR    4,2
         ST    4,28(6)
         SLR   3,3
         ST    7,88(13)
         MVC   92(4,13),=F'3'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L140
         LA    3,1(0,0)
@@L140   EQU   *
         SLL   3,24
         L     2,28(6)
         N     2,=F'-16777217'
         OR    2,3
         ST    2,28(6)
         MVC   32(4,6),=F'0'
         MVC   20(4,6),180(13)
         SLR   3,3
         L     8,140(13)
         O     8,164(13)
         O     8,168(13)
         LA    15,1(0,0)
         CR    8,15
         BNH   @@L141
         LR    3,15
@@L141   EQU   *
         SLL   3,31
         N     2,=F'2147483647'
         OR    2,3
         ST    2,28(6)
         MVC   184(4,13),=F'0'
         L     4,180(13)
         MH    4,=H'4'
         L     2,=V(REG@N@IN)
         LR    3,4
         A     3,0(2)
         L     3,16(3)
         L     2,=A(UID@LUID)
         L     5,0(2)
         L     2,4(3)
         SLL   2,2
         L     8,0(2,5)
         L     15,0(11)
         L     2,108(15)
         L     3,4(2)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         L     14,=A(@@L144)
         BNLR  14
         MH    3,=H'4'
         C     8,0(3,5)
         L     14,=A(@@L143)
         BHR   14
@@L145   EQU   *
         L     12,0(,10)
         L     2,=V(REG@N@IN)
         A     4,0(2)
         L     3,16(4)
         L     2,=A(UID@LUID)
         L     4,0(2)
         L     2,0(3)
         SLL   2,2
         L     5,0(2,4)
         L     3,0(11)
         L     2,104(3)
         L     3,4(2)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         L     14,=A(@@L146)
         BNLR  14
         MH    3,=H'4'
         C     5,0(3,4)
         L     14,=A(@@L143)
         BLR   14
@@L142   EQU   *
         L     12,0(,10)
         L     5,184(13)
         SLL   5,29
         L     2,28(6)
         N     2,=F'-536870913'
         OR    2,5
         ST    2,28(6)
         MVC   36(4,6),=F'0'
         L     2,180(13)
         MH    2,=H'4'
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     5,16(2)
         L     2,=A(UID@LUID)
         L     3,0(2)
         L     4,4(5)
         SLL   4,2
         L     2,0(5)
         SLL   2,2
         L     4,0(4,3)
         S     4,0(2,3)
         STH   4,24(6)
         L     8,116(13)
         L     2,8(8)
         L     3,180(13)
         MH    3,=H'16'
         LH    2,6(3,2)
         STH   2,26(6)
         ST    7,88(13)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L262)
         BNER  14
@@L148   EQU   *
         L     12,0(,10)
         SLR   5,5
         LR    4,3
@@L149   EQU   *
         L     3,180(13)
         LA    2,19(0,0)
         CR    3,2
         L     14,=A(@@L153)
         BHR   14
         LA    8,15(0,0)
         CR    3,8
         L     14,=A(@@L155)
         BNHR  14
         L     2,4(9)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,3)
         LR    2,15
         A     2,=F'7'
         SRA   2,3
@@L241   EQU   *
         L     12,0(,10)
         CR    5,2
         BNL   @@L150
@@L161   EQU   *
         L     12,0(,10)
         L     15,116(13)
         L     3,8(15)
         L     2,172(13)
         X     2,=F'1'
         A     2,=F'-2'
         ST    2,0(4,3)
         A     4,=F'16'
         A     5,=F'1'
         B     @@L149
@@L150   EQU   *
         L     12,0(,10)
         MVC   88(4,13),148(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@18)
         BALR  14,15
         L     2,16(6)
         LTR   2,2
         BNH   @@L96
         L     2,28(6)
         LR    3,2
         SRL   3,1
         N     3,=F'33554432'
         N     2,=F'-33554433'
         OR    2,3
         ST    2,28(6)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),16(6)
         LA    1,88(,13)
         L     15,=A(@@19)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LR    7,15
         ST    15,88(13)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    4,15
         LTR   15,15
         L     14,=A(@@L264)
         BER   14
@@L166   EQU   *
         L     12,0(,10)
         MVC   4(4,6),4(4)
         OC    28(4,6),=F'67108864'
@@L164   EQU   *
         L     12,0(,10)
         SLR   3,3
         ST    7,88(13)
         MVC   92(4,13),=F'3'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L168
         LA    3,1(0,0)
@@L168   EQU   *
         SLL   3,24
         L     2,28(6)
         N     2,=F'-16777217'
         OR    2,3
         ST    2,28(6)
         B     @@L96
@@L264   EQU   *
         ST    7,88(13)
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    4,15
         LTR   15,15
         L     14,=A(@@L165)
         BER   14
         L     2,4(15)
         LH    3,0(2)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L166
         CLM   3,3,=H'54'
         BE    @@L166
         CLM   3,3,=H'55'
         BE    @@L166
         CLM   3,3,=H'58'
         BE    @@L166
         CLM   3,3,=H'134'
         BE    @@L166
         B     @@PGE4
         DS    0F
         LTORG
         DS    0F
@@PGE4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         CLM   3,3,=H'56'
         L     14,=A(@@L166)
         BER   14
         CLM   3,3,=H'140'
         L     14,=A(@@L166)
         BER   14
@@L165   EQU   *
         L     12,4(,10)
         NC    28(4,6),=F'-67108865'
         L     14,=A(@@L164)
         BR    14
@@L155   EQU   *
         L     12,4(,10)
         L     2,4(9)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   8,8
         IC    8,0(2,3)
         LR    2,8
         A     2,=F'3'
         SRA   2,2
         L     14,=A(@@L241)
         BR    14
@@L153   EQU   *
         L     12,4(,10)
         LTR   5,5
         L     14,=A(@@L161)
         BNHR  14
         L     14,=A(@@L150)
         BR    14
@@L262   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@17)
         BALR  14,15
         SLL   15,16
         SRA   15,16
         AH    15,26(6)
         STH   15,26(6)
         L     14,=A(@@L148)
         BR    14
@@L143   EQU   *
         L     12,4(,10)
         MVC   184(4,13),=F'1'
         L     14,=A(@@L142)
         BR    14
@@L146   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'950'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     4,=F'-1'
         CR    5,4
         L     14,=A(@@L142)
         BNLR  14
         B     @@L143
@@L144   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'950'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=F'-1'
         CR    8,2
         BH    @@L143
         L     14,=A(@@L145)
         BR    14
@@L261   EQU   *
         L     12,4(,10)
         L     2,4(3)
         CL    2,4(4)
         L     14,=A(@@L128)
         BNER  14
         L     2,0(6,5)
         LA    3,1(0,0)
         CLR   2,3
         L     14,=A(@@L128)
         BNER  14
         L     3,8(9)
         LH    2,0(3)
         CLM   2,3,=H'41'
         L     14,=A(@@L128)
         BER   14
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L128)
         BNER  14
         ST    7,88(13)
         MVC   92(4,13),=F'6'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L128)
         BNER  14
         MVC   88(4,13),8(9)
         ST    7,92(13)
         L     4,116(13)
         L     2,8(4)
         L     2,8(6,2)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(MODBETWE)
         BALR  14,15
         LR    4,15
         LTR   15,15
         L     14,=A(@@L128)
         BNER  14
         ST    7,88(13)
         L     5,116(13)
         L     2,8(5)
         L     2,8(6,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(NO@LABEL)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L128)
         BER   14
         MVC   88(4,13),4(9)
         MVC   92(4,13),8(9)
         L     2,8(5)
         L     2,8(6,2)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(VALRRTX)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L128)
         BER   14
         L     2,8(5)
         L     3,8(6,2)
         MVC   88(4,13),8(9)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         L     2,8(5)
         L     2,8(6,2)
         MVC   88(4,13),28(2)
         MVC   92(4,13),4(9)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(RPLRTX)
         BALR  14,15
         ST    15,28(3)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         LR    5,4
         LR    4,6
@@L129   EQU   *
         L     12,4(,10)
         L     2,180(13)
         LA    15,19(0,0)
         CR    2,15
         BH    @@L133
         LA    3,15(0,0)
         CR    2,3
         BNH   @@L135
         L     2,4(9)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   6,6
         IC    6,0(2,3)
         LR    2,6
         A     2,=F'7'
         SRA   2,3
@@L243   EQU   *
         L     12,4(,10)
         CR    5,2
         L     14,=A(@@L96)
         BNLR  14
@@L139   EQU   *
         L     12,4(,10)
         L     6,116(13)
         L     2,8(6)
         SLR   8,8
         ST    8,0(4,2)
         A     4,=F'16'
         A     5,=F'1'
         B     @@L129
@@L135   EQU   *
         L     12,4(,10)
         L     2,4(9)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   8,8
         IC    8,0(2,3)
         LR    2,8
         A     2,=F'3'
         SRA   2,2
         B     @@L243
@@L133   EQU   *
         L     12,4(,10)
         LTR   5,5
         BNH   @@L139
         L     14,=A(@@L96)
         BR    14
@@L123   EQU   *
         L     12,4(,10)
         L     3,8(9)
         L     2,=V(CIRTX)
         CL    3,256(2)
         L     14,=A(@@L96)
         BNER  14
         L     4,12(7)
         LH    2,0(4)
         CLM   2,3,=H'32'
         L     14,=A(@@L96)
         BNER  14
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L266
         MVC   144(4,13),=F'0'
@@L172   EQU   *
         L     12,4(,10)
         L     15,144(13)
         LTR   15,15
         L     14,=A(@@L96)
         BER   14
         LH    2,0(15)
         CLM   2,3,=H'47'
         L     14,=A(@@L96)
         BNER  14
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'64'
         L     14,=A(@@L96)
         BNER  14
         L     3,4(3)
         LH    2,0(3)
         CLM   2,3,=H'63'
         L     14,=A(@@L96)
         BNER  14
         L     2,4(3)
         CL    2,4(9)
         L     14,=A(@@L96)
         BNER  14
         ST    2,88(13)
         MVC   92(4,13),8(15)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LR    4,15
         LTR   15,15
         L     14,=A(@@L96)
         BNER  14
         L     2,4(9)
         MVC   188(4,13),4(2)
         L     2,116(13)
         L     3,8(2)
         L     2,188(13)
         MH    2,=H'16'
         L     2,0(2,3)
         LA    3,2(0,0)
         CLR   2,3
         L     14,=A(@@L96)
         BNER  14
         MVC   88(4,13),=F'48'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    6,15
         ST    4,44(15)
         ST    7,0(15)
         MVC   8(4,15),4(9)
         ST    4,12(15)
         L     2,28(15)
         ST    4,16(15)
         ST    4,40(15)
         N     2,=F'-1442840577'
         O     2,=F'134217728'
         ST    2,28(15)
         ST    4,192(13)
         L     3,4(7)
         L     2,=A(MAX@UID@)
         L     5,0(2)
         CR    3,5
         BNL   @@L177
         L     8,188(13)
         MH    8,=H'4'
         L     2,=V(REG@N@IN)
         LR    4,8
         A     4,0(2)
         L     3,16(4)
         L     2,=A(UID@LUID)
         L     4,0(2)
         L     2,4(3)
         SLL   2,2
         L     3,0(2,4)
         L     15,0(11)
         L     2,108(15)
         L     2,4(2)
         CR    2,5
         BNL   @@L178
         MH    2,=H'4'
         C     3,0(2,4)
         BH    @@L177
@@L179   EQU   *
         L     12,4(,10)
         L     2,=V(REG@N@IN)
         LR    3,8
         A     3,0(2)
         L     3,16(3)
         L     2,=A(UID@LUID)
         L     4,0(2)
         L     2,0(3)
         SLL   2,2
         L     5,0(2,4)
         L     15,0(11)
         L     2,104(15)
         L     3,4(2)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BNL   @@L180
         MH    3,=H'4'
         C     5,0(3,4)
         BL    @@L177
@@L181   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         L     2,=V(REG@N@IN)
         A     8,0(2)
         L     4,16(8)
         L     2,=A(UID@LUID)
         L     3,0(2)
         L     2,0(4)
         SLL   2,2
         L     3,0(2,3)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@20)
         BALR  14,15
         LTR   15,15
         BE    @@L176
@@L177   EQU   *
         L     12,4(,10)
         MVC   192(4,13),=F'1'
@@L176   EQU   *
         L     12,4(,10)
         NC    192(4,13),=F'1'
         L     3,192(13)
         SLL   3,29
         L     2,28(6)
         N     2,=F'-536870913'
         OR    2,3
         ST    2,28(6)
         L     4,128(13)
         LTR   4,4
         BE    @@L182
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BE    @@L182
         L     5,144(13)
         L     2,8(5)
         SLR   8,8
         IC    8,2(2)
         ST    8,32(6)
@@L183   EQU   *
         L     12,4(,10)
         MVC   20(4,6),188(13)
         NC    28(4,6),=F'2147483647'
         MVC   36(4,6),=F'0'
         L     2,188(13)
         MH    2,=H'4'
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     5,16(2)
         L     2,=A(UID@LUID)
         L     3,0(2)
         L     4,4(5)
         SLL   4,2
         L     2,0(5)
         SLL   2,2
         L     4,0(4,3)
         S     4,0(2,3)
         STH   4,24(6)
         MVC   26(2,6),=H'1'
         SLR   5,5
         L     4,188(13)
         MH    4,=H'16'
@@L184   EQU   *
         L     12,4(,10)
         L     15,188(13)
         LA    8,19(0,0)
         CR    15,8
         BH    @@L188
         LA    2,15(0,0)
         CR    15,2
         BNH   @@L190
         L     2,4(9)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   8,8
         IC    8,0(2,3)
         LR    2,8
         A     2,=F'7'
         SRA   2,3
@@L242   EQU   *
         L     12,4(,10)
         CR    5,2
         BNL   @@L185
@@L194   EQU   *
         L     12,4(,10)
         L     15,116(13)
         L     2,8(15)
         L     3,=F'-1'
         ST    3,0(4,2)
         A     4,=F'16'
         A     5,=F'1'
         B     @@L184
@@L185   EQU   *
         L     12,4(,10)
         MVC   88(4,13),148(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@18)
         BALR  14,15
         L     14,=A(@@L96)
         BR    14
@@L190   EQU   *
         L     12,4(,10)
         L     2,4(9)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,3)
         LR    2,15
         A     2,=F'3'
         SRA   2,2
         B     @@L242
@@L188   EQU   *
         L     12,4(,10)
         LTR   5,5
         BNH   @@L194
         B     @@L185
@@L182   EQU   *
         L     12,4(,10)
         MVC   32(4,6),=F'0'
         B     @@L183
@@L180   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1047'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=F'-1'
         CR    5,2
         BNL   @@L181
         B     @@L177
@@L178   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1047'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=F'-1'
         CR    3,2
         BH    @@L177
         B     @@L179
@@L266   EQU   *
         L     12,4(,10)
         L     2,16(4)
         LH    3,0(2)
         ST    2,144(13)
         CLM   3,3,=H'47'
         BE    @@L172
         ST    4,88(13)
         L     2,12(7)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         ST    15,144(13)
         B     @@L172
@@L260   EQU   *
         L     12,4(,10)
         SLR   5,5
         L     3,4(3)
         C     5,0(3)
         L     14,=A(@@L111)
         BNLR  14
@@L117   EQU   *
         L     12,4(,10)
         LR    2,5
         MH    2,=H'4'
         L     3,4(2,3)
         LH    2,0(3)
         CH    2,=H'48'
         BE    @@L268
@@L114   EQU   *
         L     12,4(,10)
         A     5,=F'1'
         L     3,16(7)
         L     3,4(3)
         C     5,0(3)
         BL    @@L117
         L     14,=A(@@L111)
         BR    14
@@L268   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),4(3)
         MVC   100(4,13),176(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,176(13)
         B     @@L114
@@L106   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L108
         L     5,4(15)
         LH    3,0(5)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L109
         CLM   3,3,=H'54'
         BE    @@L109
         CLM   3,3,=H'55'
         BE    @@L109
         CLM   3,3,=H'58'
         BE    @@L109
         CLM   3,3,=H'134'
         BE    @@L109
         CLM   3,3,=H'56'
         BE    @@L109
         CLM   3,3,=H'140'
         BE    @@L109
@@L108   EQU   *
         L     12,4(,10)
         LTR   4,4
         L     14,=A(@@L107)
         BER   14
         ST    7,88(13)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L107)
         BER   14
         L     8,4(4)
         ST    7,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(LIBCALL@)
         BALR  14,15
         ST    15,176(13)
         L     14,=A(@@L107)
         BR    14
@@L109   EQU   *
         L     12,4(,10)
         LR    8,5
         MVC   172(4,13),=F'1'
         B     @@L108
@@L259   EQU   *
         L     12,4(,10)
         L     2,16(7)
         LH    3,0(2)
         LR    9,2
         CLM   3,3,=H'47'
         L     14,=A(@@L103)
         BER   14
         ST    7,88(13)
         MVC   92(4,13),16(7)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    9,15
         L     14,=A(@@L103)
         BR    14
@@L247   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L98)
         BER   14
         BCTR  8,0
         ST    8,160(13)
         L     14,=A(@@L98)
         BR    14
@@L246   EQU   *
         L     12,4(,10)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC3)
         L     2,120(13)
         MVC   96(4,13),4(2)
         L     4,124(13)
         MVC   100(4,13),4(4)
         ST    15,104(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     5,0(11)
         L     2,96(5)
         LTR   2,2
         L     14,=A(@@L92)
         BER   14
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC4)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L92)
         BR    14
@@L245   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@UNCO)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L79)
         BER   14
         L     2,32(7)
         LTR   2,2
         L     14,=A(@@L79)
         BER   14
         L     3,4(2)
         L     2,=A(MAX@UID@)
         L     4,0(2)
         CR    3,4
         L     14,=A(@@L79)
         BNLR  14
         L     2,=A(UID@LUID)
         L     2,0(2)
         MH    3,=H'4'
         L     5,0(3,2)
         L     6,120(13)
         L     3,4(6)
         CR    3,4
         BNL   @@L83
         MH    3,=H'4'
         C     5,0(3,2)
         L     14,=A(@@L79)
         BLR   14
@@L84    EQU   *
         L     12,4(,10)
         L     2,32(7)
         L     3,4(2)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BNL   @@L85
         L     2,=A(UID@LUID)
         L     2,0(2)
         MH    3,=H'4'
         L     4,0(3,2)
@@L86    EQU   *
         L     12,4(,10)
         L     15,124(13)
         L     3,4(15)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BNL   @@L87
         L     2,=A(UID@LUID)
         L     2,0(2)
         MH    3,=H'4'
         C     4,0(3,2)
         L     14,=A(@@L79)
         BHR   14
@@L88    EQU   *
         L     12,4(,10)
         L     3,0(11)
         MVC   88(4,13),116(3)
         LA    1,88(,13)
         L     15,=V(NEXT@LAB)
         BALR  14,15
         ST    15,112(3)
         MVC   116(4,3),32(7)
         L     14,=A(@@L79)
         BR    14
@@L87    EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'708'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=F'-1'
         CR    4,2
         L     14,=A(@@L79)
         BHR   14
         B     @@L88
@@L85    EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'708'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     4,=F'-1'
         B     @@L86
@@L83    EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'708'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     8,=F'-1'
         CR    5,8
         BNL   @@L84
         L     14,=A(@@L79)
         BR    14
@@L75    EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'-99'
         MVC   92(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(EMNOTA)
         BALR  14,15
         L     4,0(11)
         ST    15,120(4)
         L     14,=A(@@L76)
         BR    14
@@L244   EQU   *
         L     12,4(,10)
         L     2,20(7)
         A     2,=F'96'
         LA    6,1(0,0)
         CLR   2,6
         L     14,=A(@@L74)
         BHR   14
         L     14,=A(@@L70)
         BR    14
@@L68    EQU   *
         L     12,4(,10)
* Function scan_loop epilogue
         PDPEPIL
* Function scan_loop literal pool
         DS    0F
         LTORG
* Function scan_loop page table
         DS    0F
@@PGT4   EQU   *
         DC    A(@@PG4)
         DC    A(@@PG5)
         DS    0F
* X-func record_excess_regs prologue
RECORD@E PDPPRLG CINDEX=6,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN6
         LTORG
@@FEN6   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG6    EQU   *
         LR    11,1
         L     10,=A(@@PGT6)
* Function record_excess_regs code
         L     2,0(11)
         LH    4,0(2)
         N     4,=XL4'0000FFFF'
         LR    3,4
         A     3,=F'-54'
         LA    2,15(0,0)
         CLR   3,2
         BH    @@L270
         MH    3,=H'4'
         L     2,=A(@@L281)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L281   EQU   *
         DC    A(@@L269)
         DC    A(@@L269)
         DC    A(@@L270)
         DC    A(@@L270)
         DC    A(@@L269)
         DC    A(@@L269)
         DC    A(@@L270)
         DC    A(@@L278)
         DC    A(@@L270)
         DC    A(@@L270)
         DC    A(@@L270)
         DC    A(@@L270)
         DC    A(@@L270)
         DC    A(@@L269)
         DC    A(@@L269)
         DC    A(@@L269)
@@L278   EQU   *
         L     3,0(11)
         L     2,4(3)
         LA    3,19(0,0)
         CLR   2,3
         BNH   @@L269
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BNE   @@L269
         MVC   88(4,13),=F'3'
         ST    15,92(13)
         MVC   96(4,13),0(11)
         L     2,8(11)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,0(2)
         B     @@L269
@@L270   EQU   *
         LR    2,4
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         ST    3,104(13)
         L     2,=V(RTX@LENG)
         SLR   5,5
         IC    5,0(2,4)
         BCTR  5,0
         LTR   5,5
         BL    @@L269
         LR    8,5
         MH    8,=H'4'
         L     7,0(11)
         AR    7,8
         A     7,=F'4'
@@L297   EQU   *
         L     3,104(13)
         SLR   2,2
         IC    2,0(5,3)
         LA    3,133(0,0)
         CLR   2,3
         BE    @@L294
         LA    3,197(0,0)
         CR    2,3
         BE    @@L300
@@L284   EQU   *
         A     7,=F'-4'
         A     8,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L297
         B     @@L269
@@L300   EQU   *
         SLR   6,6
         LR    9,8
         L     2,0(7)
         C     6,0(2)
         BNL   @@L284
@@L293   EQU   *
         L     4,0(11)
         AR    4,9
         A     4,=F'4'
         L     3,0(4)
         LR    2,6
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(RECORD@E)
         BALR  14,15
         A     6,=F'1'
         L     2,0(4)
         C     6,0(2)
         BL    @@L293
         B     @@L284
@@L294   EQU   *
         MVC   88(4,13),0(7)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(RECORD@E)
         BALR  14,15
         B     @@L284
@@L269   EQU   *
* Function record_excess_regs epilogue
         PDPEPIL
* Function record_excess_regs literal pool
         DS    0F
         LTORG
* Function record_excess_regs page table
         DS    0F
@@PGT6   EQU   *
         DC    A(@@PG6)
         DS    0F
* X-func libcall_other_reg prologue
LIBCALL@ PDPPRLG CINDEX=7,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN7
         LTORG
@@FEN7   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG7    EQU   *
         LR    11,1
         L     10,=A(@@PGT7)
* Function libcall_other_reg code
         L     4,0(11)
         L     5,4(11)
         ST    4,88(13)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         L     3,4(15)
         MVC   104(4,13),=F'0'
         CLR   3,4
         BE    @@L308
@@L306   EQU   *
         LH    2,0(3)
         AH    2,=H'-32'
         CLM   2,3,=H'2'
         BNH   @@L309
@@L305   EQU   *
         L     3,12(3)
         CLR   3,4
         BNE   @@L306
         B     @@L308
@@L309   EQU   *
         MVC   88(4,13),16(3)
         ST    5,92(13)
         LA    2,104(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(RECORD@E)
         BALR  14,15
         B     @@L305
@@L308   EQU   *
         L     15,104(13)
* Function libcall_other_reg epilogue
         PDPEPIL
* Function libcall_other_reg literal pool
         DS    0F
         LTORG
* Function libcall_other_reg page table
         DS    0F
@@PGT7   EQU   *
         DC    A(@@PG7)
         DS    0F
* S-func reg_in_basic_block_p prologue
@@14     PDPPRLG CINDEX=8,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN8
         LTORG
@@FEN8   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG8    EQU   *
         LR    11,1
         L     10,=A(@@PGT8)
* Function reg_in_basic_block_p code
         L     3,0(11)
         L     2,4(11)
         L     4,4(2)
         LR    5,4
         MH    5,=H'4'
         L     2,=V(REG@N@IN)
         LR    6,5
         A     6,0(2)
         L     2,16(6)
         L     2,0(2)
         CL    2,4(3)
         BE    @@L330
@@L324   EQU   *
         SLR   15,15
         B     @@L310
@@L330   EQU   *
         LR    15,3
         LTR   3,3
         BE    @@L329
@@L327   EQU   *
         LH    3,0(15)
         N     3,=XL4'0000FFFF'
         A     3,=F'-32'
         LA    2,5(0,0)
         CLR   3,2
         BH    @@L314
         MH    3,=H'4'
         L     2,=A(@@L326)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L326   EQU   *
         DC    A(@@L319)
         DC    A(@@L321)
         DC    A(@@L319)
         DC    A(@@L324)
         DC    A(@@L324)
         DC    A(@@L314)
@@L319   EQU   *
         L     2,=V(REG@N@IN)
         LR    3,5
         A     3,0(2)
         L     2,16(3)
         L     2,4(2)
         CL    2,4(15)
         BE    @@L329
@@L314   EQU   *
         L     15,12(15)
         LTR   15,15
         BNE   @@L327
@@L329   EQU   *
         LA    15,1(0,0)
         B     @@L310
@@L321   EQU   *
         MH    4,=H'4'
         L     2,=V(REG@N@IN)
         A     4,0(2)
         L     2,16(4)
         L     2,4(2)
         X     2,4(15)
         LPR   15,2
         BCTR  15,0
         SRL   15,31
@@L310   EQU   *
* Function reg_in_basic_block_p epilogue
         PDPEPIL
* Function reg_in_basic_block_p literal pool
         DS    0F
         LTORG
* Function reg_in_basic_block_p page table
         DS    0F
@@PGT8   EQU   *
         DC    A(@@PG8)
         DS    0F
* S-func libcall_benefit prologue
@@17     PDPPRLG CINDEX=9,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN9
         LTORG
@@FEN9   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG9    EQU   *
         LR    11,1
         L     10,=A(@@PGT9)
* Function libcall_benefit code
         L     4,0(11)
         SLR   3,3
         ST    4,88(13)
         MVC   92(4,13),=F'6'
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         L     15,4(15)
         CLR   15,4
         BE    @@L342
@@L340   EQU   *
         LH    2,0(15)
         CLM   2,3,=H'34'
         BE    @@L343
         CLM   2,3,=H'32'
         BE    @@L344
@@L335   EQU   *
         L     15,12(15)
         CLR   15,4
         BNE   @@L340
         B     @@L342
@@L344   EQU   *
         L     2,16(15)
         LH    2,0(2)
         CLM   2,3,=H'48'
         BE    @@L335
         CLM   2,3,=H'49'
         BE    @@L335
         A     3,=F'1'
         B     @@L335
@@L343   EQU   *
         A     3,=F'10'
         B     @@L335
@@L342   EQU   *
         LR    15,3
* Function libcall_benefit epilogue
         PDPEPIL
* Function libcall_benefit literal pool
         DS    0F
         LTORG
* Function libcall_benefit page table
         DS    0F
@@PGT9   EQU   *
         DC    A(@@PG9)
         DS    0F
* S-func skip_consec_insns prologue
@@19     PDPPRLG CINDEX=10,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN10
         LTORG
@@FEN10  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG10   EQU   *
         LR    11,1
         L     10,=A(@@PGT10)
* Function skip_consec_insns code
         L     3,0(11)
         L     4,4(11)
         LTR   4,4
         BNH   @@L357
@@L355   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L351
         ST    3,88(13)
         MVC   92(4,13),=F'7'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L351
         L     3,4(15)
@@L351   EQU   *
         L     3,12(3)
         LH    2,0(3)
         CH    2,=H'37'
         BE    @@L351
         BCTR  4,0
         LTR   4,4
         BH    @@L355
@@L357   EQU   *
         LR    15,3
* Function skip_consec_insns epilogue
         PDPEPIL
* Function skip_consec_insns literal pool
         DS    0F
         LTORG
* Function skip_consec_insns page table
         DS    0F
@@PGT10  EQU   *
         DC    A(@@PG10)
         DS    0F
* S-func ignore_some_movables prologue
@@21     PDPPRLG CINDEX=11,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN11
         LTORG
@@FEN11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG11   EQU   *
         LR    11,1
         L     10,=A(@@PGT11)
* Function ignore_some_movables code
         L     5,0(11)
         L     4,0(5)
         LTR   4,4
         BE    @@L377
@@L375   EQU   *
         MVC   88(4,13),0(4)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L361
         L     15,4(15)
         CL    15,0(4)
         BE    @@L361
@@L374   EQU   *
         L     3,0(5)
         CLR   3,4
         BE    @@L380
@@L373   EQU   *
         L     2,0(3)
         CLR   2,15
         BE    @@L381
@@L370   EQU   *
         L     3,44(3)
         CLR   3,4
         BNE   @@L373
@@L380   EQU   *
         L     15,12(15)
         CL    15,0(4)
         BNE   @@L374
@@L361   EQU   *
         L     4,44(4)
         LTR   4,4
         BNE   @@L375
         B     @@L377
@@L381   EQU   *
         OC    28(4,3),=F'268435456'
         B     @@L370
@@L377   EQU   *
* Function ignore_some_movables epilogue
         PDPEPIL
* Function ignore_some_movables literal pool
         DS    0F
         LTORG
* Function ignore_some_movables page table
         DS    0F
@@PGT11  EQU   *
         DC    A(@@PG11)
         DS    0F
* S-func force_movables prologue
@@22     PDPPRLG CINDEX=12,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN12
         LTORG
@@FEN12  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG12   EQU   *
         LR    11,1
         L     10,=A(@@PGT12)
* Function force_movables code
         L     2,0(11)
         L     5,0(2)
         LTR   5,5
         BE    @@L398
@@L396   EQU   *
         L     2,28(5)
         N     2,=F'402653184'
         LTR   2,2
         BNE   @@L385
         L     6,20(5)
         L     15,44(5)
         LTR   15,15
         BE    @@L389
@@L393   EQU   *
         L     4,0(15)
         LR    2,6
         MH    2,=H'4'
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,4(4)
         CL    2,4(3)
         BE    @@L400
@@L390   EQU   *
         L     15,44(15)
         LTR   15,15
         BNE   @@L393
@@L389   EQU   *
         LTR   15,15
         BE    @@L394
         L     2,4(15)
         CL    2,8(5)
         BE    @@L401
@@L394   EQU   *
         LTR   15,15
         BE    @@L385
         ST    5,40(15)
         LH    2,24(5)
         AH    2,24(15)
         STH   2,24(5)
         LH    2,26(5)
         AH    2,26(15)
         STH   2,26(5)
@@L385   EQU   *
         L     5,44(5)
         LTR   5,5
         BNE   @@L396
         B     @@L398
@@L401   EQU   *
         L     2,16(15)
         LTR   2,2
         BNE   @@L394
         LR    15,2
         B     @@L394
@@L400   EQU   *
         L     2,28(15)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BNE   @@L390
         B     @@L389
@@L398   EQU   *
* Function force_movables epilogue
         PDPEPIL
* Function force_movables literal pool
         DS    0F
         LTORG
* Function force_movables page table
         DS    0F
@@PGT12  EQU   *
         DC    A(@@PG12)
         DS    0F
* S-func combine_movables prologue
@@23     PDPPRLG CINDEX=13,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN13
         LTORG
@@FEN13  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG13   EQU   *
         LR    11,1
         L     10,=A(@@PGT13)
* Function combine_movables code
         L     6,4(11)
         MVC   88(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    8,15
         L     2,0(11)
         L     5,0(2)
         LTR   5,5
         BE    @@L438
@@L414   EQU   *
         L     2,36(5)
         LTR   2,2
         BNE   @@L405
         L     4,20(5)
         L     3,8(6)
         LR    2,4
         MH    2,=H'16'
         L     3,4(2,3)
         LA    2,1(0,0)
         CLR   3,2
         BE    @@L446
@@L405   EQU   *
         L     5,44(5)
         LTR   5,5
         BNE   @@L414
@@L438   EQU   *
         L     2,=V(CLASS@NA)
         L     7,4(2)
         LTR   7,7
         BE    @@L441
@@L436   EQU   *
         SLR   6,6
         L     3,0(11)
         L     5,0(3)
         LTR   5,5
         BE    @@L443
@@L435   EQU   *
         L     2,28(5)
         N     2,=F'671088640'
         L     3,=F'134217728'
         CLR   2,3
         BE    @@L447
@@L433   EQU   *
@@L421   EQU   *
         L     5,44(5)
         LTR   5,5
         BNE   @@L435
@@L443   EQU   *
         L     2,=V(MODE@WID)
         SLR   3,3
         IC    3,0(2,7)
         LR    7,3
         LTR   3,3
         BNE   @@L436
         B     @@L441
@@L447   EQU   *
         L     2,0(5)
         L     2,12(2)
         L     2,16(2)
         L     2,8(2)
         SLR   3,3
         IC    3,2(2)
         CLR   7,3
         BNE   @@L421
         L     2,20(5)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     4,16(2)
         L     2,=A(UID@LUID)
         L     3,0(2)
         L     2,0(4)
         SLL   2,2
         L     2,0(2,3)
         ST    2,104(13)
         L     2,4(4)
         SLL   2,2
         L     9,0(2,3)
         LTR   6,6
         BE    @@L448
         L     3,8(5)
         L     2,8(6)
         CLC   2(1,3),2(2)
         BNE   @@L421
         L     2,0(11)
         L     4,0(2)
         CLR   4,5
         BE    @@L445
@@L434   EQU   *
         CLR   4,6
         BE    @@L431
         L     2,28(4)
         SRL   2,27
         N     2,=F'1'
         LTR   2,2
         BE    @@L428
         L     2,36(4)
         CLR   2,6
         BE    @@L431
@@L428   EQU   *
         L     4,44(4)
         CLR   4,5
         BNE   @@L434
@@L445   EQU   *
         LH    2,24(6)
         AH    2,24(5)
         STH   2,24(6)
         LH    2,26(6)
         AH    2,26(5)
         STH   2,26(6)
         OC    28(4,5),=F'268435456'
         ST    6,36(5)
         B     @@L421
@@L431   EQU   *
         L     2,20(4)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     15,16(2)
         L     2,=A(UID@LUID)
         L     3,0(2)
         L     2,0(15)
         SLL   2,2
         L     2,0(2,3)
         CR    2,9
         BH    @@L428
         L     2,4(15)
         SLL   2,2
         L     2,0(2,3)
         C     2,104(13)
         BL    @@L428
         B     @@L421
@@L448   EQU   *
         LR    6,5
         B     @@L421
@@L446   EQU   *
         L     2,28(5)
         SRL   2,27
         N     2,=F'1'
         LTR   2,2
         BNE   @@L405
         ST    8,88(13)
         ST    2,92(13)
         MVC   96(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         STC   3,0(4,8)
         L     2,44(5)
         LTR   2,2
         BE    @@L405
@@L413   EQU   *
         L     2,44(2)
         LTR   2,2
         BNE   @@L413
         B     @@L405
@@L441   EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function combine_movables epilogue
         PDPEPIL
* Function combine_movables literal pool
         DS    0F
         LTORG
* Function combine_movables page table
         DS    0F
@@PGT13  EQU   *
         DC    A(@@PG13)
         DS    0F
* S-func num_unmoved_movables prologue
@@28     PDPPRLG CINDEX=14,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN14
         LTORG
@@FEN14  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG14   EQU   *
         LR    11,1
         L     10,=A(@@PGT14)
* Function num_unmoved_movables code
         SLR   15,15
         L     2,0(11)
         L     2,88(2)
         L     3,112(2)
         LTR   3,3
         BE    @@L457
@@L455   EQU   *
         L     2,28(3)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BNE   @@L452
         A     15,=F'1'
@@L452   EQU   *
         L     3,44(3)
         LTR   3,3
         BNE   @@L455
@@L457   EQU   *
* Function num_unmoved_movables epilogue
         PDPEPIL
* Function num_unmoved_movables literal pool
         DS    0F
         LTORG
* Function num_unmoved_movables page table
         DS    0F
@@PGT14  EQU   *
         DC    A(@@PG14)
         DS    0F
* S-func regs_match_p prologue
@@29     PDPPRLG CINDEX=15,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN15
         LTORG
@@FEN15  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG15   EQU   *
         LR    11,1
         L     10,=A(@@PGT15)
* Function regs_match_p code
         L     2,0(11)
         L     5,4(2)
         L     2,4(11)
         L     15,4(2)
         L     2,8(11)
         L     4,0(2)
         LR    3,4
         LTR   4,4
         BE    @@L460
@@L464   EQU   *
         L     2,20(4)
         CLR   2,5
         BE    @@L460
         L     4,44(4)
         LTR   4,4
         BNE   @@L464
@@L460   EQU   *
         LTR   3,3
         BE    @@L466
@@L470   EQU   *
         L     2,20(3)
         CLR   2,15
         BE    @@L466
         L     3,44(3)
         LTR   3,3
         BNE   @@L470
@@L466   EQU   *
         SLR   15,15
         LTR   4,4
         BE    @@L471
         LTR   3,3
         BE    @@L471
         L     5,36(4)
         L     2,36(3)
         CLR   5,2
         BE    @@L476
@@L473   EQU   *
         CLR   5,3
         BE    @@L472
         CLR   4,2
         BNE   @@L471
@@L472   EQU   *
         LA    15,1(0,0)
         B     @@L471
@@L476   EQU   *
         LTR   2,2
         BNE   @@L472
         B     @@L473
@@L471   EQU   *
* Function regs_match_p epilogue
         PDPEPIL
* Function regs_match_p literal pool
         DS    0F
         LTORG
* Function regs_match_p page table
         DS    0F
@@PGT15  EQU   *
         DC    A(@@PG15)
         DS    0F
* S-func rtx_equal_for_loop_p prologue
@@30     PDPPRLG CINDEX=16,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN16
         LTORG
@@FEN16  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG16   EQU   *
         LR    11,1
         L     10,=A(@@PGT16)
* Function rtx_equal_for_loop_p code
         L     9,4(11)
         LA    3,1(0,0)
         L     2,0(11)
         CLR   2,9
         BE    @@L477
         L     3,0(11)
         LTR   3,3
         BE    @@L546
         LTR   9,9
         BE    @@L546
         L     4,0(11)
         LH    5,0(4)
         N     5,=XL4'0000FFFF'
         LH    4,0(4)
         CLM   4,3,=H'61'
         BE    @@L550
@@L481   EQU   *
         LH    2,0(9)
         CLM   2,3,=H'61'
         BE    @@L551
@@L489   EQU   *
         LH    2,0(9)
         N     2,=XL4'0000FFFF'
         SLR   3,3
         CLR   5,2
         BNE   @@L477
         L     3,0(11)
         CLC   2(1,3),2(9)
         BE    @@L552
@@L546   EQU   *
         SLR   3,3
         B     @@L477
@@L552   EQU   *
         LA    4,61(0,0)
         CLR   5,4
         BE    @@L553
         LA    2,67(0,0)
         CLR   5,2
         BE    @@L554
         LA    4,68(0,0)
         CR    5,4
         BE    @@L555
         LR    2,5
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         ST    3,104(13)
         L     2,=V(RTX@LENG)
         SLR   8,8
         IC    8,0(2,5)
         BCTR  8,0
         LTR   8,8
         BL    @@L540
         LR    5,8
         MH    5,=H'4'
@@L536   EQU   *
         L     3,104(13)
         SLR   2,2
         IC    2,0(8,3)
         LA    4,164(0,0)
         CR    2,4
         BE    @@L509
         BH    @@L533
         LA    6,137(0,0)
         CR    2,6
         BE    @@L514
         BH    @@L534
         LA    3,133(0,0)
         CLR   2,3
         BE    @@L525
@@L531   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1740'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L509   EQU   *
         A     5,=F'-4'
         BCTR  8,0
         LTR   8,8
         BNL   @@L536
@@L540   EQU   *
         LA    3,1(0,0)
         B     @@L477
@@L525   EQU   *
         L     6,0(11)
         L     6,4(6,5)
         ST    6,88(13)
         L     2,4(9,5)
         ST    2,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@30)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L477
         B     @@L509
@@L534   EQU   *
         LA    4,162(0,0)
         CLR   2,4
         BNE   @@L531
         L     3,0(11)
         L     3,4(3,5)
         ST    3,88(13)
         L     4,4(9,5)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         SLR   3,3
         LTR   15,15
         BNE   @@L477
         B     @@L509
@@L514   EQU   *
         L     3,0(11)
         L     2,4(3,5)
@@L548   EQU   *
         CL    2,4(9,5)
         BE    @@L509
         B     @@L546
@@L533   EQU   *
         LA    6,197(0,0)
         CR    2,6
         BE    @@L516
         BH    @@L535
         LA    3,166(0,0)
         CLR   2,3
         BNE   @@L531
         L     6,0(11)
         L     2,4(6,5)
         B     @@L548
@@L535   EQU   *
         LA    4,240(0,0)
         CLR   2,4
         BE    @@L509
         B     @@L531
@@L516   EQU   *
         ST    5,108(13)
         L     4,0(11)
         L     2,4(4,5)
         L     3,4(9,5)
         L     2,0(2)
         C     2,0(3)
         BNE   @@L546
         SLR   7,7
         CR    7,2
         BNL   @@L509
@@L524   EQU   *
         LA    4,4(0,0)
         L     6,108(13)
         A     6,0(11)
         AR    6,4
         L     2,0(6)
         LR    3,7
         MH    3,=H'4'
         L     2,4(3,2)
         ST    2,88(13)
         L     2,108(13)
         AR    2,9
         L     2,0(4,2)
         L     2,4(3,2)
         ST    2,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@30)
         BALR  14,15
         LTR   15,15
         BE    @@L546
         A     7,=F'1'
         L     2,0(6)
         C     7,0(2)
         BL    @@L524
         B     @@L509
@@L555   EQU   *
         SLR   15,15
         L     6,0(11)
         L     2,4(6)
@@L549   EQU   *
         CL    2,4(9)
         BE    @@L556
@@L506   EQU   *
         LR    3,15
         B     @@L477
@@L556   EQU   *
         LA    15,1(0,0)
         B     @@L506
@@L554   EQU   *
         SLR   15,15
         L     3,0(11)
         L     2,4(3)
         B     @@L549
@@L553   EQU   *
         SLR   3,3
         L     6,0(11)
         L     2,4(6)
         CL    2,4(9)
         BE    @@L540
         ST    6,88(13)
         ST    9,92(13)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@29)
         BALR  14,15
         LTR   15,15
         BE    @@L477
         B     @@L540
@@L551   EQU   *
         L     3,12(11)
         L     2,8(3)
         L     3,4(9)
         SLL   3,4
         L     2,0(3,2)
         L     6,=F'-2'
         CLR   2,6
         BNE   @@L489
         LR    2,4
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L491
         CLM   4,3,=H'54'
         BE    @@L491
         CLM   4,3,=H'55'
         BE    @@L491
         CLM   4,3,=H'58'
         BE    @@L491
         CLM   4,3,=H'134'
         BE    @@L491
         CLM   4,3,=H'56'
         BE    @@L491
         CLM   4,3,=H'140'
         BNE   @@L489
@@L491   EQU   *
         L     2,8(11)
         L     3,0(2)
         LTR   3,3
         BE    @@L489
@@L497   EQU   *
         L     2,28(3)
         SRL   2,26
         N     2,=F'1'
         LTR   2,2
         BE    @@L494
         L     2,20(3)
         CL    2,4(9)
         BE    @@L557
@@L494   EQU   *
         L     3,44(3)
         LTR   3,3
         BNE   @@L497
         B     @@L489
@@L557   EQU   *
         MVC   88(4,13),4(3)
         MVC   92(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L494
         B     @@L540
@@L550   EQU   *
         L     6,12(11)
         L     2,8(6)
         L     6,0(11)
         L     3,4(6)
         SLL   3,4
         L     2,0(3,2)
         L     3,=F'-2'
         CLR   2,3
         BNE   @@L481
         LH    3,0(9)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L482
         CLM   3,3,=H'54'
         BE    @@L482
         CLM   3,3,=H'55'
         BE    @@L482
         CLM   3,3,=H'58'
         BE    @@L482
         CLM   3,3,=H'134'
         BE    @@L482
         CLM   3,3,=H'56'
         BE    @@L482
         CLM   3,3,=H'140'
         BNE   @@L481
@@L482   EQU   *
         L     4,8(11)
         L     3,0(4)
         LTR   3,3
         BE    @@L489
@@L488   EQU   *
         L     2,28(3)
         SRL   2,26
         N     2,=F'1'
         LTR   2,2
         BE    @@L485
         L     2,20(3)
         L     6,0(11)
         CL    2,4(6)
         BE    @@L558
@@L485   EQU   *
         L     3,44(3)
         LTR   3,3
         BNE   @@L488
         B     @@L489
@@L558   EQU   *
         MVC   88(4,13),4(3)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L485
         B     @@L540
@@L477   EQU   *
         LR    15,3
* Function rtx_equal_for_loop_p epilogue
         PDPEPIL
* Function rtx_equal_for_loop_p literal pool
         DS    0F
         LTORG
* Function rtx_equal_for_loop_p page table
         DS    0F
@@PGT16  EQU   *
         DC    A(@@PG16)
         DS    0F
* S-func add_label_notes prologue
@@31     PDPPRLG CINDEX=17,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN17
         LTORG
@@FEN17  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG17   EQU   *
         LR    11,1
         L     10,=A(@@PGT17)
* Function add_label_notes code
         L     9,0(11)
         L     2,0(9)
         LR    5,2
         SRL   5,16
         LA    3,67(0,0)
         CR    5,3
         BE    @@L586
@@L560   EQU   *
         LR    2,5
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         ST    3,104(13)
         L     2,=V(RTX@LENG)
         SLR   3,3
         IC    3,0(2,5)
         LR    5,3
         BCTR  5,0
         LTR   5,5
         BL    @@L584
         LR    7,5
         MH    7,=H'4'
         LR    6,7
         AR    6,9
         A     6,=F'4'
@@L581   EQU   *
         L     3,104(13)
         IC    2,0(5,3)
         CLM   2,1,=XL1'85'
         BE    @@L587
         SLL   2,24
         SRA   2,24
         C     2,=F'-59'
         BE    @@L588
@@L570   EQU   *
         A     6,=F'-4'
         A     7,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L581
         B     @@L584
@@L588   EQU   *
         LR    8,7
         L     2,0(6)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    @@L570
@@L580   EQU   *
         L     3,4(9,8)
         LR    2,4
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,88(13)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         BCTR  4,0
         LTR   4,4
         BNL   @@L580
         B     @@L570
@@L587   EQU   *
         MVC   88(4,13),0(6)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         B     @@L570
@@L586   EQU   *
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   @@L560
         L     4,4(11)
         LTR   4,4
         BE    @@L560
@@L567   EQU   *
         MVC   88(4,13),4(9)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BNE   @@L589
@@L563   EQU   *
         L     4,12(4)
         LTR   4,4
         BNE   @@L567
         B     @@L560
@@L589   EQU   *
         MVC   88(4,13),=F'4'
         MVC   92(4,13),=F'13'
         MVC   96(4,13),4(9)
         MVC   100(4,13),28(4)
         LA    1,88(,13)
         L     15,=V(GRFMUE)
         BALR  14,15
         ST    15,28(4)
         L     3,4(9)
         LH    2,0(3)
         CLM   2,3,=H'36'
         BNE   @@L563
         L     2,16(3)
         A     2,=F'1'
         ST    2,16(3)
         B     @@L563
@@L584   EQU   *
* Function add_label_notes epilogue
         PDPEPIL
* Function add_label_notes literal pool
         DS    0F
         LTORG
* Function add_label_notes page table
         DS    0F
@@PGT17  EQU   *
         DC    A(@@PG17)
@@LC19   EQU   *
         DC    X'15'
         DC    X'0'
@@LC17   EQU   *
         DC    C'not desirable'
         DC    X'0'
@@LC16   EQU   *
         DC    C' moved to %d'
         DC    X'0'
@@LC15   EQU   *
         DC    C'halved since already moved '
         DC    X'0'
@@LC14   EQU   *
         DC    C'savings %d '
         DC    X'0'
@@LC18   EQU   *
         DC    C'not safe'
         DC    X'0'
@@LC5    EQU   *
         DC    C'Insn %d: regno %d (life %d), '
         DC    X'0'
@@LC6    EQU   *
         DC    C'consec %d, '
         DC    X'0'
@@LC13   EQU   *
         DC    C'forces %d '
         DC    X'0'
@@LC12   EQU   *
         DC    C'matches %d '
         DC    X'0'
@@LC11   EQU   *
         DC    C'move-insn '
         DC    X'0'
@@LC10   EQU   *
         DC    C'done '
         DC    X'0'
@@LC9    EQU   *
         DC    C'global '
         DC    X'0'
@@LC8    EQU   *
         DC    C'force '
         DC    X'0'
@@LC7    EQU   *
         DC    C'cond '
         DC    X'0'
         DS    0F
* S-func move_movables prologue
@@24     PDPPRLG CINDEX=18,FRAME=184,BASER=12,ENTRY=NO
         B     @@FEN18
         LTORG
@@FEN18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG18   EQU   *
         LR    11,1
         L     10,=A(@@PGT18)
* Function move_movables code
         SLR   2,2
         SLR   3,3
         ST    2,152(13)
         ST    3,4+152(13)
         ST    2,160(13)
         ST    3,4+160(13)
         L     3,0(11)
         L     4,88(3)
         A     4,=F'120'
         ST    4,120(13)
         MVC   124(4,13),0(4)
         MVC   128(4,13),=F'0'
         MVC   132(4,13),104(3)
         MVC   136(4,13),108(3)
         MVC   88(4,13),124(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,140(13)
         MVC   88(4,13),124(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,144(13)
         L     6,4(11)
         L     5,0(6)
         LTR   5,5
         BE    @@L751
@@L742   EQU   *
         L     3,=A(LOOP@DUM)
         L     2,0(3)
         LTR   2,2
         L     14,=A(@@L771)
         BNER  14
@@L595   EQU   *
         L     12,0(,10)
         L     3,28(5)
         LR    2,3
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L604)
         BNER  14
         LTR   3,3
         L     14,=A(@@L772)
         BLR   14
@@L605   EQU   *
         L     12,0(,10)
         L     2,40(5)
         LTR   2,2
         BE    @@L607
         L     2,28(2)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L604)
         BER   14
@@L607   EQU   *
         LH    4,26(5)
         L     6,0(5)
         MVC   148(4,13),20(5)
         L     3,=A(LOOP@DUM)
         L     2,0(3)
         LTR   2,2
         L     14,=A(@@L773)
         BNER  14
@@L608   EQU   *
         L     12,0(,10)
         L     7,120(13)
         L     2,8(7)
         L     7,148(13)
         MH    7,=H'16'
         IC    2,13(7,2)
         CLM   2,1,=XL1'00'
         BE    @@L609
         L     2,0(3)
         LTR   2,2
         L     14,=A(@@L774)
         BNER  14
@@L609   EQU   *
         L     12,0(,10)
         L     8,144(13)
         L     3,148(13)
         IC    2,0(3,8)
         CLM   2,1,=XL1'00'
         BNE   @@L611
         L     2,=V(FLAG@MOV)
         L     2,0(2)
         LTR   2,2
         BNE   @@L611
         ST    4,156(13)
         L     2,152(13)
         L     3,4+152(13)
         M     2,8(11)
         ST    2,152(13)
         ST    3,4+152(13)
         LH    3,24(5)
         ST    3,164(13)
         L     2,160(13)
         L     3,4+160(13)
         M     2,156(13)
         ST    2,160(13)
         ST    3,4+160(13)
         L     3,164(13)
         L     8,120(13)
         L     4,8(8)
         IC    2,13(7,4)
         SLL   2,24
         SRA   2,24
         C     2,=F'0'
         L     14,=A(@@L612)
         BER   14
         L     2,12(11)
         MH    2,=H'2'
         CR    3,2
         BNL   @@L611
@@L613   EQU   *
         L     12,0(,10)
         L     3,40(5)
         LTR   3,3
         BE    @@L610
         L     2,28(3)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BE    @@L610
         L     2,20(3)
         SLL   2,4
         L     2,4(2,4)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L611
@@L610   EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L775
@@L739   EQU   *
         L     12,0(,10)
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L776
@@L593   EQU   *
         L     5,44(5)
         LTR   5,5
         BNE   @@L742
@@L751   EQU   *
         L     2,128(13)
         LTR   2,2
         BE    @@L777
@@L743   EQU   *
         L     3,128(13)
         CL    3,136(13)
         L     14,=A(@@L766)
         BER   14
@@L749   EQU   *
         LH    2,0(3)
         AH    2,=H'-32'
         CLM   2,3,=H'2'
         BNH   @@L778
@@L746   EQU   *
         L     3,12(3)
         CL    3,136(13)
         BNE   @@L749
         L     14,=A(@@L766)
         BR    14
@@L778   EQU   *
         MVC   88(4,13),16(3)
         MVC   92(4,13),140(13)
         MVC   96(4,13),124(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(RREGS)
         BALR  14,15
         MVC   88(4,13),28(3)
         MVC   92(4,13),140(13)
         MVC   96(4,13),124(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(RREGS)
         BALR  14,15
         MVC   20(4,3),=F'-1'
         B     @@L746
@@L777   EQU   *
         MVC   128(4,13),132(13)
         B     @@L743
@@L776   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC19)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L593
@@L775   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC17)
@@L770   EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L739
@@L611   EQU   *
         L     12,0(,10)
         MVC   168(4,13),=F'0'
         L     3,28(5)
         LR    2,3
         SRL   2,27
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L614)
         BER   14
         L     2,36(5)
         LTR   2,2
         L     14,=A(@@L614)
         BER   14
         LR    4,5
@@L619   EQU   *
         L     4,36(4)
         L     6,36(4)
         LTR   6,6
         BNE   @@L619
         L     2,0(5)
         L     2,16(2)
         MVC   88(4,13),4(2)
         L     2,0(4)
         L     2,16(2)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
         LR    7,15
         L     2,0(5)
         MVC   28(4,15),28(2)
         L     2,0(5)
         L     2,16(2)
         L     3,4(2)
         L     2,0(4)
         L     2,16(2)
         L     2,4(2)
         MVC   88(4,13),=F'3'
         ST    6,92(13)
         ST    2,96(13)
         L     2,=V(REGS@MAY)
         MVC   100(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'3'
         ST    6,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,0(2)
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         L     4,128(13)
         LTR   4,4
         L     14,=A(@@L779)
         BER   14
@@L620   EQU   *
         L     12,0(,10)
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(@@L780)
         BNER  14
@@L622   EQU   *
         L     12,0(,10)
         LA    2,1(0,0)
         L     7,144(13)
         L     8,148(13)
         STC   2,0(8,7)
         L     3,120(13)
         L     2,8(3)
         LR    3,8
         MH    3,=H'16'
         LA    4,1(0,0)
         STC   4,13(3,2)
         L     2,28(5)
         SRL   2,27
         N     2,=F'1'
         LTR   2,2
         BNE   @@L696
         LR    6,2
         LR    4,3
@@L697   EQU   *
         L     2,148(13)
         LA    3,19(0,0)
         CR    2,3
         BH    @@L701
         LA    7,15(0,0)
         CR    2,7
         BNH   @@L703
         L     2,8(5)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   8,8
         IC    8,0(2,3)
         LR    2,8
         A     2,=F'7'
         SRA   2,3
@@L768   EQU   *
         CR    6,2
         BNL   @@L696
@@L707   EQU   *
         L     7,120(13)
         L     2,8(7)
         SLR   8,8
         ST    8,0(4,2)
         A     4,=F'16'
         A     6,=F'1'
         B     @@L697
@@L696   EQU   *
         OC    28(4,5),=F'268435456'
         L     6,148(13)
         MH    6,=H'4'
         L     2,=V(REG@N@IN)
         LR    8,6
         A     8,0(2)
         L     3,16(8)
         L     2,=A(UID@LUID)
         L     4,0(2)
         L     2,0(3)
         SLL   2,2
         L     7,0(2,4)
         L     2,132(13)
         L     3,4(2)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BNL   @@L709
         MH    3,=H'4'
         C     7,0(3,4)
         BH    @@L710
@@L708   EQU   *
         L     6,148(13)
         MH    6,=H'4'
         L     2,=V(REG@N@IN)
         LR    7,6
         A     7,0(2)
         L     3,16(7)
         L     2,=A(UID@LUID)
         L     4,0(2)
         L     2,4(3)
         SLL   2,2
         L     7,0(2,4)
         L     8,136(13)
         L     3,4(8)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BNL   @@L712
         MH    3,=H'4'
         C     7,0(3,4)
         BL    @@L713
@@L711   EQU   *
         L     2,28(5)
         SRL   2,27
         N     2,=F'1'
         LTR   2,2
         BNE   @@L739
         L     6,4(11)
         L     4,0(6)
         LTR   4,4
         BE    @@L739
@@L736   EQU   *
         L     2,36(4)
         CLR   2,5
         BE    @@L782
@@L717   EQU   *
         L     4,44(4)
         LTR   4,4
         BNE   @@L736
         B     @@L739
@@L782   EQU   *
         L     3,8(5)
         L     2,8(4)
         CLC   2(1,3),2(2)
         BE    @@L783
         SLR   8,8
         IC    8,2(2)
         ST    8,88(13)
         MVC   92(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(GENLPC)
         BALR  14,15
         L     2,20(4)
         SLL   2,2
         L     3,140(13)
         ST    15,0(2,3)
@@L721   EQU   *
         OC    28(4,4),=F'268435456'
         MVC   88(4,13),0(4)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L722
         MVC   88(4,13),4(15)
         MVC   92(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(DELINCHA)
         BALR  14,15
@@L723   EQU   *
         L     2,20(4)
         LA    7,1(0,0)
         L     6,144(13)
         STC   7,0(2,6)
         L     2,28(5)
         SRL   2,27
         N     2,=F'1'
         LR    6,2
         LTR   2,2
         BNE   @@L717
@@L725   EQU   *
         L     8,148(13)
         LA    2,19(0,0)
         CR    8,2
         BH    @@L729
         LA    3,15(0,0)
         CR    8,3
         BNH   @@L731
         L     2,8(4)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   7,7
         IC    7,0(2,3)
         LR    2,7
         A     2,=F'7'
         SRA   2,3
@@L769   EQU   *
         CR    6,2
         BNL   @@L717
@@L735   EQU   *
         L     2,20(4)
         AR    2,6
         L     8,120(13)
         L     3,8(8)
         MH    2,=H'16'
         SLR   7,7
         ST    7,0(2,3)
         A     6,=F'1'
         B     @@L725
@@L731   EQU   *
         L     2,8(4)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   8,8
         IC    8,0(2,3)
         LR    2,8
         A     2,=F'3'
         SRA   2,2
         B     @@L769
@@L729   EQU   *
         LTR   6,6
         BNH   @@L735
         B     @@L717
@@L722   EQU   *
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         B     @@L723
@@L783   EQU   *
         L     2,20(4)
         SLL   2,2
         L     7,140(13)
         ST    3,0(2,7)
         B     @@L721
@@L713   EQU   *
         L     2,=V(REG@N@IN)
         A     6,0(2)
         L     2,16(6)
         L     3,136(13)
         MVC   4(4,2),4(3)
         B     @@L711
@@L712   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2218'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=F'-1'
         CR    7,2
         BNL   @@L711
         B     @@L713
@@L710   EQU   *
         L     2,=V(REG@N@IN)
         A     6,0(2)
         L     2,16(6)
         L     4,132(13)
         MVC   0(4,2),4(4)
         B     @@L708
@@L709   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2213'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     3,=F'-1'
         CR    7,3
         BH    @@L710
         B     @@L708
@@L703   EQU   *
         L     2,8(5)
         SLR   3,3
         IC    3,2(2)
         L     2,=V(MODE@SIZ)
         SLR   7,7
         IC    7,0(2,3)
         LR    2,7
         A     2,=F'3'
         SRA   2,2
         B     @@L768
@@L701   EQU   *
         LTR   6,6
         BNH   @@L707
         B     @@L696
@@L780   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC16)
         MVC   96(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L622
@@L779   EQU   *
         ST    7,128(13)
         B     @@L620
@@L614   EQU   *
         SRL   3,26
         N     3,=F'1'
         LTR   3,3
         L     14,=A(@@L623)
         BER   14
         L     8,16(5)
         LTR   8,8
         BL    @@L755
@@L639   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'37'
         BE    @@L628
         ST    6,88(13)
         MVC   92(4,13),=F'7'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L628
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1939'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L628   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'37'
         BE    @@L629
         ST    6,88(13)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L629
         L     3,4(15)
         CLR   3,6
         BE    @@L629
@@L633   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         LR    3,15
         CLR   15,6
         BNE   @@L633
@@L629   EQU   *
         LR    3,6
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BE    @@L626
         LH    2,0(15)
         CH    2,=H'37'
         BE    @@L638
@@L626   EQU   *
         BCTR  8,0
         LTR   8,8
         BNL   @@L639
@@L755   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   88(4,13),8(5)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         MVC   88(4,13),4(5)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L785
@@L640   EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L786
@@L759   EQU   *
         L     12,0(,10)
         L     6,8(11)
         A     6,=F'-3'
         ST    6,8(11)
         B     @@L622
@@L786   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC16)
         MVC   96(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L759
@@L785   EQU   *
         ST    3,88(13)
         IC    2,28(5)
         N     2,=F'1'
         X     2,=F'1'
         A     2,=F'3'
         ST    2,92(13)
         MVC   96(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(SET@UNIQ)
         BALR  14,15
         B     @@L640
@@L638   EQU   *
         L     2,12(6)
         ST    2,12(3)
         LR    6,2
         LTR   2,2
         BE    @@L626
         LH    2,0(2)
         CLM   2,3,=H'37'
         BE    @@L638
         B     @@L626
@@L623   EQU   *
         L     8,16(5)
         LTR   8,8
         BL    @@L759
@@L695   EQU   *
         L     12,0(,10)
         LH    2,0(6)
         CLM   2,3,=H'37'
         BE    @@L649
         ST    6,88(13)
         MVC   92(4,13),=F'7'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L649
         L     6,4(15)
@@L649   EQU   *
         LH    2,0(6)
         CLM   2,3,=H'37'
         BE    @@L650
         ST    6,88(13)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L650
         SLR   9,9
         ST    9,172(13)
         ST    9,168(13)
         ST    9,176(13)
         L     4,4(15)
         CLR   4,6
         BE    @@L761
@@L671   EQU   *
         LH    2,0(4)
         CLM   2,3,=H'37'
         BE    @@L653
         L     7,16(4)
         L     3,12(4)
         CLR   3,6
         BE    @@L657
@@L662   EQU   *
         LH    15,0(3)
         CLM   15,3,=H'32'
         L     14,=A(@@L787)
         BER   14
@@L661   EQU   *
         L     12,0(,10)
         CLM   15,3,=H'37'
         BNE   @@L657
@@L658   EQU   *
         L     12,0(,10)
         L     3,12(3)
         CLR   3,6
         BNE   @@L662
@@L657   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'34'
         L     14,=A(@@L788)
         BER   14
@@L663   EQU   *
         L     12,0(,10)
         LH    2,0(4)
         CLM   2,3,=H'34'
         L     14,=A(@@L789)
         BER   14
@@L665   EQU   *
         L     12,0(,10)
         LH    2,0(4)
         CLM   2,3,=H'34'
         L     14,=A(@@L790)
         BER   14
         MVC   88(4,13),0(11)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
         LR    3,15
@@L668   EQU   *
         L     12,0(,10)
         L     7,168(13)
         LTR   7,7
         L     14,=A(@@L791)
         BER   14
@@L669   EQU   *
         L     12,0(,10)
         CL    4,176(13)
         L     14,=A(@@L792)
         BER   14
@@L670   EQU   *
         L     12,0(,10)
         MVC   28(4,3),28(4)
         MVC   28(4,4),=F'0'
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
@@L653   EQU   *
         L     4,12(4)
         CLR   4,6
         BNE   @@L671
@@L761   EQU   *
         L     2,128(13)
         LTR   2,2
         L     14,=A(@@L793)
         BER   14
@@L650   EQU   *
         L     12,0(,10)
         L     7,32(5)
         LTR   7,7
         L     14,=A(@@L794)
         BNER  14
         LH    2,0(6)
         CLM   2,3,=H'34'
         L     14,=A(@@L795)
         BER   14
         CL    8,16(5)
         L     14,=A(@@L796)
         BER   14
@@L680   EQU   *
         L     12,0(,10)
         MVC   88(4,13),0(11)
         MVC   92(4,13),16(6)
@@L767   EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
         LR    3,15
@@L676   EQU   *
         L     12,0(,10)
         L     2,28(3)
         LTR   2,2
         L     14,=A(@@L797)
         BER   14
@@L685   EQU   *
         L     12,0(,10)
         L     4,128(13)
         LTR   4,4
         L     14,=A(@@L798)
         BER   14
@@L687   EQU   *
         L     12,0(,10)
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(@@L799)
         BNER  14
@@L688   EQU   *
         L     12,0(,10)
         ST    3,88(13)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L689
         MVC   4(4,15),168(13)
         MVC   88(4,13),168(13)
         MVC   92(4,13),=F'7'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         ST    3,4(15)
@@L689   EQU   *
         LR    4,6
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         L     6,12(6)
         LTR   6,6
         BE    @@L647
         LH    2,0(6)
         CH    2,=H'37'
         BE    @@L694
@@L647   EQU   *
         BCTR  8,0
         LTR   8,8
         BNL   @@L695
         B     @@L759
@@L694   EQU   *
         L     2,12(6)
         ST    2,12(4)
         LR    6,2
         LTR   2,2
         BE    @@L647
         LH    2,0(2)
         CLM   2,3,=H'37'
         BE    @@L694
         B     @@L647
@@L799   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC16)
         MVC   96(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L688
@@L798   EQU   *
         ST    3,128(13)
         B     @@L687
@@L797   EQU   *
         MVC   28(4,3),28(6)
         ST    2,28(6)
         ST    3,88(13)
         MVC   92(4,13),=F'4'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L685
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(15)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BNE   @@L685
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(REMNOTE)
         BALR  14,15
         B     @@L685
@@L796   EQU   *
         L     2,28(5)
         SRL   2,25
         B     @@PGE18
         DS    0F
         LTORG
         DS    0F
@@PGE18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG19   EQU   *
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L680)
         BER   14
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   88(4,13),8(5)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    4,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         MVC   88(4,13),4(5)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L676)
         BNER  14
         ST    3,88(13)
         IC    2,28(5)
         N     2,=F'1'
         X     2,=F'1'
         A     2,=F'3'
         ST    2,92(13)
         MVC   96(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(SET@UNIQ)
         BALR  14,15
         L     14,=A(@@L676)
         BR    14
@@L795   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(11)
         MVC   92(4,13),16(6)
         LA    1,88(,13)
         L     15,=A(@@33)
         BALR  14,15
         LR    3,15
         L     2,32(6)
         LTR   2,2
         L     14,=A(@@L676)
         BER   14
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,32(3)
         L     14,=A(@@L676)
         BR    14
@@L794   EQU   *
         L     12,4(,10)
         L     4,8(5)
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   88(4,13),=F'0'
         L     3,32(5)
         SLL   3,1
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         N     3,=XL4'0000FFFF'
         LA    2,1(0,0)
         SLL   2,0(3)
         BCTR  2,0
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         SLR   2,2
         IC    2,2(4)
         ST    2,88(13)
         MVC   92(4,13),=F'83'
         ST    4,96(13)
         ST    15,100(13)
         ST    4,104(13)
         MVC   108(4,13),=F'1'
         MVC   112(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(EXPSBIN)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L800
@@L674   EQU   *
         L     12,4(,10)
         CLR   2,4
         BE    @@L675
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
@@L675   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    2,92(13)
         L     14,=A(@@L767)
         BR    14
@@L800   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2103'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L674
@@L793   EQU   *
         L     12,4(,10)
         MVC   128(4,13),168(13)
         L     14,=A(@@L650)
         BR    14
@@L792   EQU   *
         L     12,4(,10)
         ST    3,176(13)
         L     14,=A(@@L670)
         BR    14
@@L791   EQU   *
         L     12,4(,10)
         ST    3,168(13)
         L     14,=A(@@L669)
         BR    14
@@L790   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(11)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(@@33)
         BALR  14,15
         LR    3,15
         L     2,32(4)
         LTR   2,2
         L     14,=A(@@L668)
         BER   14
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,32(3)
         L     14,=A(@@L668)
         BR    14
@@L789   EQU   *
         L     12,4(,10)
         LTR   9,9
         L     14,=A(@@L665)
         BER   14
         MVC   88(4,13),172(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(RREFP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L665)
         BER   14
         MVC   88(4,13),172(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),176(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@32)
         BALR  14,15
         L     14,=A(@@L665)
         BR    14
@@L788   EQU   *
         L     12,4(,10)
         LH    2,0(7)
         CLM   2,3,=H'47'
         L     14,=A(@@L663)
         BNER  14
         L     2,4(7)
         LH    2,0(2)
         CLM   2,3,=H'61'
         L     14,=A(@@L663)
         BNER  14
         ST    4,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L663)
         BER   14
         MVC   172(4,13),8(7)
         L     3,172(13)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L664
         MVC   172(4,13),4(7)
@@L664   EQU   *
         L     12,4(,10)
         L     9,4(15)
         ST    4,176(13)
         L     14,=A(@@L663)
         BR    14
@@L787   EQU   *
         L     12,4(,10)
         L     2,16(3)
         LH    2,0(2)
         CLM   2,3,=H'48'
         L     14,=A(@@L661)
         BNER  14
         L     14,=A(@@L658)
         BR    14
@@L612   EQU   *
         L     12,4(,10)
         C     3,12(11)
         L     14,=A(@@L611)
         BNLR  14
         L     14,=A(@@L613)
         BR    14
@@L774   EQU   *
         L     12,4(,10)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC15)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L609)
         BR    14
@@L773   EQU   *
         L     12,4(,10)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC14)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L608)
         BR    14
@@L604   EQU   *
         L     12,4(,10)
         L     2,=A(LOOP@DUM)
         L     3,0(2)
         LTR   3,3
         L     14,=A(@@L739)
         BER   14
         L     2,36(5)
         LTR   2,2
         L     14,=A(@@L739)
         BNER  14
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC18)
         L     14,=A(@@L770)
         BR    14
@@L772   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LA    8,1(0,0)
         CLR   15,8
         BNE   @@L604
         L     2,12(5)
         LTR   2,2
         BNE   @@L801
@@L606   EQU   *
         L     12,4(,10)
         L     2,16(5)
         LTR   2,2
         L     14,=A(@@L605)
         BER   14
         MVC   88(4,13),0(11)
         MVC   92(4,13),8(5)
         L     2,16(5)
         A     2,=F'1'
         ST    2,96(13)
         MVC   100(4,13),0(5)
         LA    1,88(,13)
         L     15,=A(@@16)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BNE   @@L604
         L     14,=A(@@L605)
         BR    14
@@L801   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(11)
         MVC   92(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         CLR   15,8
         BNE   @@L604
         B     @@L606
@@L771   EQU   *
         L     12,4(,10)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC5)
         L     2,0(5)
         MVC   96(4,13),4(2)
         MVC   100(4,13),20(5)
         LH    7,24(5)
         SLL   7,16
         SRA   7,16
         ST    7,104(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,16(5)
         LTR   2,2
         BNH   @@L596
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC6)
         MVC   96(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L596   EQU   *
         L     12,4(,10)
         L     2,28(5)
         SRL   2,31
         LTR   2,2
         BNE   @@L802
@@L597   EQU   *
         L     12,4(,10)
         L     2,28(5)
         SRL   2,30
         N     2,=F'1'
         LTR   2,2
         BNE   @@L803
@@L598   EQU   *
         L     12,4(,10)
         L     2,28(5)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BNE   @@L804
@@L599   EQU   *
         L     12,4(,10)
         L     2,28(5)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BNE   @@L805
@@L600   EQU   *
         L     12,4(,10)
         L     2,28(5)
         SRL   2,26
         N     2,=F'1'
         LTR   2,2
         BNE   @@L806
@@L601   EQU   *
         L     12,4(,10)
         L     2,36(5)
         LTR   2,2
         BNE   @@L807
@@L602   EQU   *
         L     12,4(,10)
         L     2,40(5)
         LTR   2,2
         L     14,=A(@@L595)
         BER   14
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC13)
         L     2,40(5)
         L     2,0(2)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L595)
         BR    14
@@L807   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC12)
         L     2,36(5)
         L     2,0(2)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L602
@@L806   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC11)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L601
@@L805   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L600
@@L804   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC9)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L599
@@L803   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC8)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L598
@@L802   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC7)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L597
@@L766   EQU   *
         L     12,4(,10)
         MVC   88(4,13),140(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),144(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function move_movables epilogue
         PDPEPIL
* Function move_movables literal pool
         DS    0F
         LTORG
* Function move_movables page table
         DS    0F
@@PGT18  EQU   *
         DC    A(@@PG18)
         DC    A(@@PG19)
         DS    0F
* S-func loop_movables_add prologue
@@18     PDPPRLG CINDEX=20,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN20
         LTORG
@@FEN20  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG20   EQU   *
         LR    11,1
         L     10,=A(@@PGT20)
* Function loop_movables_add code
         L     15,0(11)
         L     3,4(11)
         L     2,0(15)
         LTR   2,2
         BNE   @@L809
         ST    3,0(15)
         B     @@L810
@@L809   EQU   *
         L     2,4(15)
         ST    3,44(2)
@@L810   EQU   *
         ST    3,4(15)
* Function loop_movables_add epilogue
         PDPEPIL
* Function loop_movables_add literal pool
         DS    0F
         LTORG
* Function loop_movables_add page table
         DS    0F
@@PGT20  EQU   *
         DC    A(@@PG20)
         DS    0F
* S-func loop_movables_free prologue
@@27     PDPPRLG CINDEX=21,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN21
         LTORG
@@FEN21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG21   EQU   *
         LR    11,1
         L     10,=A(@@PGT21)
* Function loop_movables_free code
         L     2,0(11)
         L     15,0(2)
         LTR   15,15
         BE    @@L818
@@L816   EQU   *
         L     2,44(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    15,2
         LTR   2,2
         BNE   @@L816
@@L818   EQU   *
* Function loop_movables_free epilogue
         PDPEPIL
* Function loop_movables_free literal pool
         DS    0F
         LTORG
* Function loop_movables_free page table
         DS    0F
@@PGT21  EQU   *
         DC    A(@@PG21)
         DS    0F
* S-func count_nonfixed_reads prologue
@@34     PDPPRLG CINDEX=22,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN22
         LTORG
@@FEN22  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG22   EQU   *
         LR    11,1
         L     10,=A(@@PGT22)
* Function count_nonfixed_reads code
         L     9,4(11)
         LR    15,9
         LTR   9,9
         BE    @@L819
         LH    4,0(9)
         N     4,=XL4'0000FFFF'
         LR    3,4
         A     3,=F'-54'
         LA    2,15(0,0)
         CLR   3,2
         BH    @@L821
         MH    3,=H'4'
         L     2,=A(@@L835)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L835   EQU   *
         DC    A(@@L829)
         DC    A(@@L829)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L829)
         DC    A(@@L829)
         DC    A(@@L821)
         DC    A(@@L829)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L821)
         DC    A(@@L830)
         DC    A(@@L829)
         DC    A(@@L829)
         DC    A(@@L829)
@@L829   EQU   *
         SLR   15,15
         B     @@L819
@@L821   EQU   *
         MVC   96(4,13),=F'0'
         LR    2,4
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         L     2,=V(RTX@LENG)
         SLR   5,5
         IC    5,0(2,4)
         BCTR  5,0
         LTR   5,5
         BL    @@L849
         LR    8,5
         AR    8,3
         LR    6,5
         MH    6,=H'4'
         AR    6,9
         A     6,=F'4'
@@L847   EQU   *
         CLI   0(8),133
         BE    @@L851
@@L840   EQU   *
         IC    2,0(8)
         SLL   2,24
         SRA   2,24
         C     2,=F'-59'
         BE    @@L852
@@L838   EQU   *
         BCTR  8,0
         A     6,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L847
@@L849   EQU   *
         L     15,96(13)
         B     @@L819
@@L852   EQU   *
         SLR   7,7
         LR    2,5
         MH    2,=H'4'
         ST    2,100(13)
         L     2,4(9,2)
         C     7,0(2)
         BNL   @@L838
@@L846   EQU   *
         MVC   88(4,13),0(11)
         L     4,100(13)
         AR    4,9
         A     4,=F'4'
         L     3,0(4)
         LR    2,7
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@34)
         BALR  14,15
         A     15,96(13)
         ST    15,96(13)
         A     7,=F'1'
         L     2,0(4)
         C     7,0(2)
         BL    @@L846
         B     @@L838
@@L851   EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(6)
         LA    1,88(,13)
         L     15,=A(@@34)
         BALR  14,15
         A     15,96(13)
         ST    15,96(13)
         B     @@L840
@@L830   EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(9)
         LA    1,88(,13)
         L     15,=A(@@34)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(9)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LR    2,3
         A     2,=F'1'
         LA    4,1(0,0)
         CLR   15,4
         BE    @@L853
@@L833   EQU   *
         LR    15,2
         B     @@L819
@@L853   EQU   *
         LR    2,3
         B     @@L833
@@L819   EQU   *
* Function count_nonfixed_reads epilogue
         PDPEPIL
* Function count_nonfixed_reads literal pool
         DS    0F
         LTORG
* Function count_nonfixed_reads page table
         DS    0F
@@PGT22  EQU   *
         DC    A(@@PG22)
         DS    0F
* S-func prescan_loop prologue
@@11     PDPPRLG CINDEX=23,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN23
         LTORG
@@FEN23  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG23   EQU   *
         LR    11,1
         L     10,=A(@@PGT23)
* Function prescan_loop code
         L     8,0(11)
         L     4,88(8)
         L     6,104(8)
         L     7,108(8)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LR    9,15
         L     2,=A(@@7)
         MVC   24(4,4),0(2)
         MVC   148(4,4),=F'0'
         MVC   0(4,4),=F'0'
         MVC   8(4,4),=F'0'
         MVC   12(4,4),=F'0'
         MVC   16(4,4),=F'0'
         MVC   20(4,4),=F'0'
         MVC   64(4,8),=F'1'
         MVC   96(4,4),=F'0'
         MVC   100(4,4),=F'0'
         MVC   80(4,4),=F'0'
         MVC   108(4,4),=F'0'
         MVC   88(4,4),=F'0'
         MVC   104(4,4),=F'0'
         ST    6,104(13)
         LTR   6,6
         BE    @@L856
         LH    2,0(6)
         CLM   2,3,=H'36'
         BE    @@L856
         LR    3,6
@@L861   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'34'
         BE    @@L917
         L     3,8(3)
         LTR   3,3
         BE    @@L913
         LH    2,0(3)
         CLM   2,3,=H'36'
         BNE   @@L861
@@L913   EQU   *
         ST    3,104(13)
@@L856   EQU   *
         L     2,12(6)
         ST    2,104(13)
         CL    2,12(7)
         BE    @@L909
@@L898   EQU   *
         L     15,104(13)
         L     3,0(15)
         LR    2,3
         SRL   2,16
         LA    5,33(0,0)
         CLR   2,5
         BE    @@L876
         BH    @@L897
         LA    3,32(0,0)
         CLR   2,3
         BE    @@L890
@@L864   EQU   *
         L     2,104(13)
         L     2,12(2)
         ST    2,104(13)
         CL    2,12(7)
         BNE   @@L898
@@L909   EQU   *
         L     2,8(4)
         LTR   2,2
         BNE   @@L899
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,224(2)
         SRL   2,25
         N     2,=F'1'
         LTR   2,2
         BNE   @@L899
         L     2,20(4)
         LTR   2,2
         BNE   @@L899
         L     2,12(6)
         ST    2,104(13)
         CL    2,12(7)
         BE    @@L899
@@L904   EQU   *
         LA    2,104(,13)
         ST    2,88(13)
         MVC   92(4,13),=A(@@36)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(F@E@RTX)
         BALR  14,15
         L     2,104(13)
         MVC   104(4,13),12(2)
         L     2,104(13)
         CL    2,12(7)
         BNE   @@L904
@@L899   EQU   *
         L     2,96(4)
         LTR   2,2
         BNE   @@L918
@@L905   EQU   *
         L     2,100(4)
         LTR   2,2
         BE    @@L854
         MVC   88(4,13),=F'51'
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         OC    0(4,15),=F'32'
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         MVC   100(4,13),80(4)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,80(4)
         B     @@L854
@@L918   EQU   *
         MVC   88(4,13),=F'51'
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         MVC   100(4,13),80(4)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,80(4)
         B     @@L905
@@L890   EQU   *
         L     2,104(13)
         MVC   88(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(VOLREFP)
         BALR  14,15
         LTR   15,15
         BE    @@L891
         MVC   12(4,4),=F'1'
@@L891   EQU   *
         L     3,104(13)
         LH    2,0(3)
         CLM   2,3,=H'33'
         BE    @@L919
@@L892   EQU   *
         MVC   88(4,13),16(3)
         MVC   92(4,13),=A(@@35)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(NOTE@STO)
         BALR  14,15
         L     2,108(4)
         LTR   2,2
         BNE   @@L893
         L     2,80(4)
         LTR   2,2
         BE    @@L893
         MVC   108(4,4),104(13)
@@L893   EQU   *
         L     2,=V(FLNCALXC)
         L     2,0(2)
         LTR   2,2
         BE    @@L864
@@L916   EQU   *
         MVC   88(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(CANTINT)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BE    @@L864
         MVC   20(4,4),=F'1'
         B     @@L864
@@L919   EQU   *
         L     2,16(3)
         LH    2,0(2)
         AH    2,=H'-44'
         CLM   2,3,=H'1'
         BH    @@L892
         MVC   16(4,4),=F'1'
         B     @@L892
@@L897   EQU   *
         LA    5,34(0,0)
         CLR   2,5
         BE    @@L871
         LA    3,37(0,0)
         CLR   2,3
         BNE   @@L864
         L     2,20(15)
         L     5,=F'-96'
         CLR   2,5
         BNE   @@L864
         L     2,64(8)
         A     2,=F'1'
         ST    2,64(8)
         B     @@L864
@@L871   EQU   *
         SRL   3,5
         N     3,=F'1'
         LTR   3,3
         BNE   @@L872
         MVC   96(4,4),=F'1'
@@L914   EQU   *
         MVC   8(4,4),=F'1'
@@L873   EQU   *
         MVC   0(4,4),=F'1'
         B     @@L916
@@L872   EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(PURE@CAL)
         BALR  14,15
         LTR   15,15
         BE    @@L873
         B     @@L914
@@L876   EQU   *
         L     5,20(4)
         LTR   5,5
         BNE   @@L890
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(PC@SET)
         BALR  14,15
         LTR   15,15
         BE    @@L878
         L     15,8(15)
         LH    2,0(15)
         CLM   2,3,=H'72'
         BE    @@L920
         LR    3,15
         LR    15,5
@@L881   EQU   *
         LTR   3,3
         BE    @@L884
         L     2,=V(GLBRTL)
         CL    3,0(2)
         BE    @@L884
         LH    2,0(3)
         CLM   2,3,=H'67'
         BNE   @@L878
         L     2,4(3)
         CLR   2,9
         BE    @@L884
         L     2,0(3)
         SRL   2,3
         N     2,=F'1'
         LTR   2,2
         BNE   @@L878
@@L884   EQU   *
         LR    3,15
         SLR   15,15
         LTR   3,3
         BNE   @@L881
         B     @@L890
@@L878   EQU   *
         MVC   20(4,4),=F'1'
         B     @@L890
@@L920   EQU   *
         L     3,8(15)
         L     15,12(15)
         B     @@L881
@@L917   EQU   *
         MVC   148(4,4),=F'1'
         B     @@L913
@@L854   EQU   *
* Function prescan_loop epilogue
         PDPEPIL
* Function prescan_loop literal pool
         DS    0F
         LTORG
* Function prescan_loop page table
         DS    0F
@@PGT23  EQU   *
         DC    A(@@PG23)
         DS    0F
* S-func invalidate_loops_containing_label prologue
@@37     PDPPRLG CINDEX=24,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN24
         LTORG
@@FEN24  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG24   EQU   *
         LR    11,1
         L     10,=A(@@PGT24)
* Function invalidate_loops_containing_label code
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,0(11)
         L     2,4(2)
         SLL   2,2
         L     2,0(2,3)
         LTR   2,2
         BE    @@L928
@@L926   EQU   *
         MVC   84(4,2),=F'1'
         L     2,68(2)
         LTR   2,2
         BNE   @@L926
@@L928   EQU   *
* Function invalidate_loops_containing_label epilogue
         PDPEPIL
* Function invalidate_loops_containing_label literal pool
         DS    0F
         LTORG
* Function invalidate_loops_containing_label page table
         DS    0F
@@PGT24  EQU   *
         DC    A(@@PG24)
@@LC20   EQU   *
         DC    X'15'
         DC    C'Loop at %d ignored due to setjmp.'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func find_and_verify_loops prologue
@@5      PDPPRLG CINDEX=25,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN25
         LTORG
@@FEN25  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG25   EQU   *
         LR    11,1
         L     10,=A(@@PGT25)
* Function find_and_verify_loops code
         L     8,0(11)
         L     9,4(11)
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@2)
         BALR  14,15
         L     2,=A(UID@LOOP)
         L     2,0(2)
         MVC   0(4,2),=F'0'
         SLR   4,4
         LR    7,4
         LR    5,8
         LTR   8,8
         BE    @@L1037
         LR    6,4
@@L951   EQU   *
         LH    2,0(5)
         CLM   2,3,=H'37'
         L     14,=A(@@L1052)
         BER   14
@@L934   EQU   *
         L     12,0(,10)
         LH    2,0(5)
         CLM   2,3,=H'34'
         L     14,=A(@@L1053)
         BER   14
@@L944   EQU   *
         L     12,0(,10)
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,4(5)
         SLL   2,2
         ST    4,0(2,3)
         L     5,12(5)
         LTR   5,5
         BNE   @@L951
@@L1037  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,8(2)
         L     2,20(2)
         LTR   2,2
         BE    @@L1040
@@L956   EQU   *
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         L     2,8(2)
         LTR   2,2
         BNE   @@L956
@@L1040  EQU   *
         MVC   88(4,13),=A(@@37)
         LA    1,88(,13)
         L     15,=V(FEEHLAB)
         BALR  14,15
         LR    5,8
         LTR   8,8
         L     14,=A(@@L1042)
         BER   14
@@L1035  EQU   *
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L1054
@@L959   EQU   *
         L     5,12(5)
         LTR   5,5
         BNE   @@L1035
         L     14,=A(@@L1042)
         BR    14
@@L1054  EQU   *
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,4(5)
         SLL   2,2
         L     8,0(2,3)
         LH    2,0(5)
         CLM   2,3,=H'32'
         L     14,=A(@@L963)
         BER   14
         CLM   2,3,=H'34'
         L     14,=A(@@L963)
         BER   14
@@L962   EQU   *
         L     12,0(,10)
         LH    2,0(5)
         CLM   2,3,=H'33'
         BNE   @@L959
         MVC   88(4,13),16(5)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@38)
         BALR  14,15
         LTR   8,8
         BE    @@L959
         L     2,16(5)
         LH    2,0(2)
         CLM   2,3,=H'51'
         BE    @@L967
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@UNCO)
         BALR  14,15
         LTR   15,15
         BE    @@L959
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(ONLYJUMP)
         BALR  14,15
         LTR   15,15
         BE    @@L959
         L     4,32(5)
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,4(4)
         SLL   2,2
         L     2,0(2,3)
         CLR   2,8
         BE    @@L959
@@L967   EQU   *
         LA    1,88(,13)
         L     15,=V(GET@MAX@)
         BALR  14,15
         L     2,=A(MAX@UID@)
         C     15,0(2)
         BNL   @@L959
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         LR    9,15
         MVC   104(4,13),12(5)
         SLR   6,6
         L     7,8(5)
@@L968   EQU   *
         LH    15,0(7)
         CLM   15,3,=H'36'
         BE    @@L969
         CLM   15,3,=H'37'
         L     14,=A(@@L1055)
         BER   14
@@L973   EQU   *
         L     12,0(,10)
         CLM   15,3,=H'33'
         BE    @@L969
         L     7,8(7)
         B     @@L968
@@L969   EQU   *
         L     12,0(,10)
         L     4,32(5)
         LTR   4,4
         BE    @@L975
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,4(4)
         SLL   2,2
         L     2,0(2,3)
         LTR   2,2
         BE    @@L975
         LR    6,2
@@L982   EQU   *
         CLR   6,8
         BE    @@L975
         L     6,68(6)
         LTR   6,6
         BNE   @@L982
@@L975   EQU   *
         CLM   15,3,=H'33'
         L     14,=A(@@L1056)
         BER   14
@@L983   EQU   *
         L     12,0(,10)
         LTR   6,6
         BNE   @@L959
         CLM   15,3,=H'33'
         BNE   @@L959
         L     2,32(7)
         LTR   2,2
         BE    @@L959
         L     2,4(2)
         LTR   2,2
         BE    @@L959
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LTR   15,15
         BE    @@L959
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ONLYJUMP)
         BALR  14,15
         LTR   15,15
         BE    @@L959
         MVC   88(4,13),32(7)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         CLR   15,9
         BNE   @@L959
         ST    7,88(13)
         MVC   92(4,13),12(5)
         LA    2,104(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(INSNS@SA)
         BALR  14,15
         LTR   15,15
         BE    @@L959
         L     6,32(5)
         LTR   6,6
         L     14,=A(@@L1057)
         BER   14
@@L985   EQU   *
         L     12,0(,10)
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,4(6)
         SLL   2,2
         L     9,0(2,3)
         L     3,104(13)
         LTR   3,3
         BE    @@L987
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L987
         LR    4,3
@@L992   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'35'
         BE    @@L1058
@@L988   EQU   *
         L     3,12(3)
         LTR   3,3
         BE    @@L1051
         LH    2,0(3)
         CLM   2,3,=H'36'
         BNE   @@L992
@@L1051  EQU   *
         ST    4,104(13)
@@L987   EQU   *
         LR    4,6
         LTR   6,6
         BE    @@L994
@@L999   EQU   *
         LH    2,0(4)
         CLM   2,3,=H'35'
         BE    @@L1059
@@L995   EQU   *
         L     4,8(4)
         LTR   4,4
         BNE   @@L999
@@L994   EQU   *
         LTR   4,4
         BE    @@L1060
@@L1000  EQU   *
         LTR   4,4
         BE    @@L959
         L     6,32(7)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(GLABAFT)
         BALR  14,15
         ST    15,108(13)
         L     2,16(6)
         A     2,=F'1'
         ST    2,16(6)
         ST    7,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(INVJMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L1061
@@L1009  EQU   *
         L     5,12(6)
         L     2,16(6)
         BCTR  2,0
         ST    2,16(6)
         LTR   2,2
         BE    @@L1062
@@L1034  EQU   *
         L     5,8(5)
         B     @@L959
@@L1062  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         B     @@L1034
@@L1061  EQU   *
         LA    2,108(,13)
         ST    2,88(13)
         LA    3,104(,13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(SQUEEZE@)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   @@L1063
@@L1011  EQU   *
         MVC   88(4,13),108(13)
         MVC   92(4,13),104(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(REOINSNS)
         BALR  14,15
         L     15,108(13)
         L     4,104(13)
         CL    15,12(4)
         BE    @@L1048
@@L1016  EQU   *
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,4(15)
         SLL   2,2
         ST    9,0(2,3)
         L     15,12(15)
         CL    15,12(4)
         BNE   @@L1016
@@L1048  EQU   *
         L     3,32(5)
         LTR   3,3
         BE    @@L1017
         SLR   15,15
         L     4,124(8)
         LTR   4,4
         BE    @@L1019
@@L1025  EQU   *
         L     2,4(4)
         CLR   2,3
         BE    @@L1064
         LR    15,4
         L     4,8(4)
         LTR   4,4
         BNE   @@L1025
@@L1019  EQU   *
         LR    3,8
         LTR   8,8
         BE    @@L1027
         CLR   8,9
         BE    @@L1027
@@L1031  EQU   *
         L     2,128(3)
         BCTR  2,0
         ST    2,128(3)
         L     3,68(3)
         LTR   3,3
         BE    @@L1027
         CLR   3,9
         BNE   @@L1031
@@L1027  EQU   *
         LTR   4,4
         BE    @@L1065
@@L1017  EQU   *
         MVC   88(4,13),16(7)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(@@38)
         BALR  14,15
         L     2,32(5)
         LTR   2,2
         BE    @@L1009
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         CLR   2,15
         BNE   @@L1009
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         B     @@L1009
@@L1065  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2950'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L1017
@@L1064  EQU   *
         NC    0(4,4),=F'-9'
         LTR   15,15
         BE    @@L1023
         MVC   8(4,15),8(4)
         B     @@L1019
@@L1023  EQU   *
         MVC   124(4,8),8(4)
         B     @@L1019
@@L1063  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2914'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L1011
@@L1060  EQU   *
         LR    4,6
         LTR   6,6
         BE    @@L1000
@@L1007  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'35'
         BE    @@L1066
@@L1003  EQU   *
         L     4,12(4)
         LTR   4,4
         BNE   @@L1007
         B     @@L1000
@@L1066  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BE    @@L1006
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L1067
@@L1006  EQU   *
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,4(4)
         SLL   2,2
         L     2,0(2,3)
         CLR   2,9
         BNE   @@L1003
         B     @@L1000
@@L1067  EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BE    @@L1006
         LH    2,0(15)
         CLM   2,3,=H'33'
         BNE   @@L1006
         L     2,16(15)
         LH    2,0(2)
         AH    2,=H'-44'
         CLM   2,3,=H'1'
         BNH   @@L1003
         B     @@L1006
@@L1059  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BE    @@L998
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L1068
@@L998   EQU   *
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,4(4)
         SLL   2,2
         L     2,0(2,3)
         CLR   2,9
         BNE   @@L995
         B     @@L994
@@L1068  EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BE    @@L998
         LH    2,0(15)
         CLM   2,3,=H'33'
         BNE   @@L998
         L     2,16(15)
         LH    2,0(2)
         AH    2,=H'-44'
         CLM   2,3,=H'1'
         BNH   @@L995
         B     @@L998
@@L1058  EQU   *
         LR    4,3
         B     @@L988
@@L1057  EQU   *
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LR    6,15
         B     @@L985
@@L1056  EQU   *
         L     4,32(7)
         LTR   4,4
         BE    @@L983
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,4(4)
         SLL   2,2
         L     2,0(2,3)
         CLR   2,8
         BE    @@L983
         LR    6,8
         B     @@L983
@@L1055  EQU   *
         L     2,20(7)
         L     3,=F'-96'
         CLR   2,3
         BNE   @@L973
         B     @@L969
@@L963   EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'13'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L962
         MVC   88(4,13),4(15)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         B     @@L962
@@L1053  EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'28'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L944
         LR    3,4
         LTR   4,4
         BE    @@L944
@@L950   EQU   *
         MVC   84(4,3),=F'1'
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L1069
@@L947   EQU   *
         L     3,68(3)
         LTR   3,3
         BNE   @@L950
         B     @@L944
@@L1069  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC20)
         L     2,104(3)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L947
@@L1052  EQU   *
         L     2,20(5)
         L     3,=F'-95'
         CR    2,3
         BE    @@L939
         BH    @@L943
         L     3,=F'-96'
         CLR   2,3
         BNE   @@L934
         L     2,8(9)
         AR    2,6
         ST    7,0(2)
         A     6,=F'132'
         A     7,=F'1'
         ST    5,104(2)
         ST    4,68(2)
         LR    4,2
         B     @@L934
@@L943   EQU   *
         L     3,=F'-94'
         CLR   2,3
         BE    @@L937
         A     3,=F'1'
         CLR   2,3
         BNE   @@L934
         ST    5,92(4)
         B     @@L934
@@L937   EQU   *
         ST    5,96(4)
         B     @@L934
@@L939   EQU   *
         LTR   4,4
         BE    @@L1070
@@L940   EQU   *
         ST    5,108(4)
         L     4,68(4)
         B     @@L934
@@L1070  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2701'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L940
@@L1042  EQU   *
* Function find_and_verify_loops epilogue
         PDPEPIL
* Function find_and_verify_loops literal pool
         DS    0F
         LTORG
* Function find_and_verify_loops page table
         DS    0F
@@PGT25  EQU   *
         DC    A(@@PG25)
@@LC21   EQU   *
         DC    X'15'
         DC    C'Loop at %d ignored due to multiple entry points.'
         DC    X'15'
         DC    X'0'
@@LC22   EQU   *
         DC    X'15'
         DC    C'Loop at %d ignored due to unknown exit jump.'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func mark_loop_jump prologue
@@38     PDPPRLG CINDEX=26,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN26
         LTORG
@@FEN26  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG26   EQU   *
         LR    11,1
         L     10,=A(@@PGT26)
* Function mark_loop_jump code
         L     5,0(11)
         L     6,4(11)
@@L1082  EQU   *
         LH    3,0(5)
         N     3,=XL4'0000FFFF'
         A     3,=F'-39'
         LA    2,96(0,0)
         CLR   3,2
         BH    @@L1134
         MH    3,=H'4'
         L     2,=A(@@L1142)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1142  EQU   *
         DC    A(@@L1122)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1122)
         DC    A(@@L1128)
         DC    A(@@L1134)
         DC    A(@@L1118)
         DC    A(@@L1071)
         DC    A(@@L1071)
         DC    A(@@L1134)
         DC    A(@@L1071)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1071)
         DC    A(@@L1071)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1088)
         DC    A(@@L1071)
         DC    A(@@L1134)
         DC    A(@@L1071)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1071)
         DC    A(@@L1089)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1120)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1085)
         DC    A(@@L1085)
         DC    A(@@L1134)
         DC    A(@@L1085)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1088)
         DC    A(@@L1088)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1134)
         DC    A(@@L1151)
@@L1085  EQU   *
         MVC   88(4,13),4(5)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@38)
         BALR  14,15
@@L1151  EQU   *
         L     5,8(5)
         B     @@L1082
@@L1122  EQU   *
         SLR   4,4
         L     2,4(5)
         C     4,0(2)
         BNL   @@L1071
@@L1127  EQU   *
         L     2,4(5)
         LR    3,4
         MH    3,=H'4'
         L     2,4(3,2)
         ST    2,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@38)
         BALR  14,15
         A     4,=F'1'
         L     2,4(5)
         C     4,0(2)
         BL    @@L1127
         B     @@L1071
@@L1128  EQU   *
         SLR   4,4
         L     2,8(5)
         C     4,0(2)
         BNL   @@L1071
@@L1133  EQU   *
         L     2,8(5)
         LR    3,4
         MH    3,=H'4'
         L     2,4(3,2)
         ST    2,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@38)
         BALR  14,15
         A     4,=F'1'
         L     2,8(5)
         C     4,0(2)
         BL    @@L1133
         B     @@L1071
@@L1118  EQU   *
         L     3,4(5)
         L     2,=V(GLBRTL)
         CL    3,0(2)
         BE    @@L1151
         B     @@L1071
@@L1089  EQU   *
         L     4,4(5)
         L     2,=A(UID@LOOP)
         L     3,0(2)
         L     2,4(4)
         SLL   2,2
         L     4,0(2,3)
         SLR   3,3
         LTR   4,4
         BE    @@L1097
         LR    3,4
@@L1096  EQU   *
         CLR   3,6
         BE    @@L1097
         L     3,68(3)
         LTR   3,3
         BNE   @@L1096
@@L1097  EQU   *
         LTR   6,6
         BE    @@L1098
         LTR   3,3
         BE    @@L1152
@@L1098  EQU   *
         LTR   4,4
         BE    @@L1071
@@L1117  EQU   *
         LR    3,6
         LTR   6,6
         BE    @@L1147
@@L1115  EQU   *
         CLR   4,3
         BE    @@L1071
         L     3,68(3)
         LTR   3,3
         BNE   @@L1115
@@L1147  EQU   *
         L     2,=A(LOOP@DUM)
         L     3,0(2)
         LTR   3,3
         BE    @@L1116
         L     2,84(4)
         LTR   2,2
         BE    @@L1153
@@L1116  EQU   *
         MVC   84(4,4),=F'1'
         L     4,68(4)
         LTR   4,4
         BNE   @@L1117
         B     @@L1071
@@L1153  EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC21)
         L     2,104(4)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1116
@@L1152  EQU   *
         OC    0(4,5),=F'8'
         MVC   8(4,5),124(6)
         ST    5,124(6)
         LR    3,6
         CLR   6,4
         BE    @@L1098
@@L1104  EQU   *
         L     2,128(3)
         A     2,=F'1'
         ST    2,128(3)
         L     3,68(3)
         LTR   3,3
         BE    @@L1098
         CLR   3,4
         BNE   @@L1104
         B     @@L1098
@@L1120  EQU   *
         MVC   88(4,13),8(5)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@38)
         BALR  14,15
         L     5,12(5)
         B     @@L1082
@@L1088  EQU   *
         L     5,4(5)
         B     @@L1082
@@L1134  EQU   *
         LTR   6,6
         BE    @@L1071
         LR    3,6
@@L1141  EQU   *
         L     2,=A(LOOP@DUM)
         L     4,0(2)
         LTR   4,4
         BE    @@L1140
         L     2,84(3)
         LTR   2,2
         BE    @@L1154
@@L1140  EQU   *
         MVC   84(4,3),=F'1'
         L     3,68(3)
         LTR   3,3
         BNE   @@L1141
         B     @@L1071
@@L1154  EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC22)
         L     2,104(3)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1140
@@L1071  EQU   *
* Function mark_loop_jump epilogue
         PDPEPIL
* Function mark_loop_jump literal pool
         DS    0F
         LTORG
* Function mark_loop_jump page table
         DS    0F
@@PGT26  EQU   *
         DC    A(@@PG26)
         DS    0F
* S-func labels_in_range_p prologue
@@20     PDPPRLG CINDEX=27,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN27
         LTORG
@@FEN27  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG27   EQU   *
         LR    11,1
         L     10,=A(@@PGT27)
* Function labels_in_range_p code
         L     3,0(11)
         L     4,4(11)
@@L1156  EQU   *
         LTR   3,3
         BE    @@L1157
         L     15,4(3)
         L     2,=A(MAX@UID@)
         C     15,0(2)
         BNL   @@L1160
         L     2,=A(UID@LUID)
         L     2,0(2)
         MH    15,=H'4'
         L     2,0(15,2)
         CR    2,4
         BH    @@L1157
@@L1163  EQU   *
         LH    2,0(3)
         LA    15,1(0,0)
         CLM   2,3,=H'36'
         BE    @@L1155
         L     3,12(3)
         B     @@L1156
@@L1157  EQU   *
         SLR   15,15
         B     @@L1155
@@L1160  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3142'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=F'-1'
         CR    4,2
         BNL   @@L1163
         B     @@L1157
@@L1155  EQU   *
* Function labels_in_range_p epilogue
         PDPEPIL
* Function labels_in_range_p literal pool
         DS    0F
         LTORG
* Function labels_in_range_p page table
         DS    0F
@@PGT27  EQU   *
         DC    A(@@PG27)
         DS    0F
* S-func note_addr_stored prologue
@@35     PDPPRLG CINDEX=28,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN28
         LTORG
@@FEN28  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG28   EQU   *
         LR    11,1
         L     10,=A(@@PGT28)
* Function note_addr_stored code
         L     15,0(11)
         L     3,8(11)
         LTR   15,15
         BE    @@L1165
         LH    2,0(15)
         CLM   2,3,=H'66'
         BNE   @@L1165
         L     2,104(3)
         A     2,=F'1'
         ST    2,104(3)
         CLI   2(15),51
         BE    @@L1171
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         MVC   100(4,13),80(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,80(3)
         B     @@L1165
@@L1171  EQU   *
         L     2,0(15)
         SRL   2,5
         N     2,=F'1'
         LTR   2,2
         BE    @@L1169
         MVC   100(4,3),=F'1'
         B     @@L1165
@@L1169  EQU   *
         MVC   96(4,3),=F'1'
@@L1165  EQU   *
* Function note_addr_stored epilogue
         PDPEPIL
* Function note_addr_stored literal pool
         DS    0F
         LTORG
* Function note_addr_stored page table
         DS    0F
@@PGT28  EQU   *
         DC    A(@@PG28)
         DS    0F
* S-func note_set_pseudo_multiple_uses prologue
@@39     PDPPRLG CINDEX=29,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN29
         LTORG
@@FEN29  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG29   EQU   *
         LR    11,1
         L     10,=A(@@PGT29)
* Function note_set_pseudo_multiple_uses code
         L     15,0(11)
         L     3,8(11)
         LTR   15,15
         BE    @@L1172
         LH    2,0(15)
         CLM   2,3,=H'64'
         BE    @@L1177
         CLM   2,3,=H'132'
         BE    @@L1177
         CLM   2,3,=H'133'
         BE    @@L1177
         CLM   2,3,=H'63'
         BE    @@L1177
@@L1183  EQU   *
         LH    2,0(15)
         CLM   2,3,=H'61'
         BNE   @@L1172
         L     15,4(15)
         LA    2,19(0,0)
         CLR   15,2
         BNH   @@L1172
         L     2,=A(MXRGBL)
         CL    15,0(2)
         BNL   @@L1181
         L     2,8(3)
         MH    15,=H'16'
         L     15,8(15,2)
         LTR   15,15
         BE    @@L1181
         L     2,=V(CIRTX)
         CL    15,256(2)
         BNE   @@L1172
@@L1181  EQU   *
         MVC   12(4,3),=F'1'
         B     @@L1172
@@L1177  EQU   *
         L     15,4(15)
         LH    2,0(15)
         CLM   2,3,=H'64'
         BE    @@L1177
         CLM   2,3,=H'132'
         BE    @@L1177
         CLM   2,3,=H'133'
         BE    @@L1177
         CLM   2,3,=H'63'
         BE    @@L1177
         B     @@L1183
@@L1172  EQU   *
* Function note_set_pseudo_multiple_uses epilogue
         PDPEPIL
* Function note_set_pseudo_multiple_uses literal pool
         DS    0F
         LTORG
* Function note_set_pseudo_multiple_uses page table
         DS    0F
@@PGT29  EQU   *
         DC    A(@@PG29)
         DS    0F
* X-func loop_invariant_p prologue
LOOP@INV PDPPRLG CINDEX=30,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN30
         LTORG
@@FEN30  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG30   EQU   *
         LR    11,1
         L     10,=A(@@PGT30)
* Function loop_invariant_p code
         L     9,4(11)
         L     2,0(11)
         L     5,88(2)
         LR    7,5
         A     7,=F'120'
         MVC   108(4,13),=F'0'
         LA    3,1(0,0)
         LTR   9,9
         BE    @@L1184
         L     4,0(9)
         LR    6,4
         SRL   6,16
         LR    3,6
         A     3,=F'-41'
         LA    2,28(0,0)
         CLR   3,2
         BH    @@L1186
         MH    3,=H'4'
         L     2,=A(@@L1213)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1213  EQU   *
         DC    A(@@L1210)
         DC    A(@@L1186)
         DC    A(@@L1236)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1190)
         DC    A(@@L1190)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1190)
         DC    A(@@L1236)
         DC    A(@@L1186)
         DC    A(@@L1197)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1186)
         DC    A(@@L1203)
         DC    A(@@L1191)
         DC    A(@@L1190)
         DC    A(@@L1236)
@@L1190  EQU   *
         LA    3,1(0,0)
         B     @@L1184
@@L1210  EQU   *
         SRL   4,4
         N     4,=F'1'
         SLR   3,3
         LTR   4,4
         BNE   @@L1184
@@L1186  EQU   *
         LR    2,6
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         ST    3,104(13)
         L     2,=V(RTX@LENG)
         SLR   5,5
         IC    5,0(2,6)
         BCTR  5,0
         LTR   5,5
         BL    @@L1234
         LR    6,5
         MH    6,=H'4'
         LR    8,6
         AR    8,9
         A     8,=F'4'
@@L1231  EQU   *
         L     3,104(13)
         IC    2,0(5,3)
         CLM   2,1,=XL1'85'
         BE    @@L1240
         SLL   2,24
         SRA   2,24
         C     2,=F'-59'
         BE    @@L1241
@@L1216  EQU   *
         A     8,=F'-4'
         A     6,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L1231
@@L1234  EQU   *
         L     3,108(13)
         A     3,=F'1'
         B     @@L1184
@@L1241  EQU   *
         SLR   7,7
         ST    6,112(13)
         LA    3,4(0,0)
         L     2,4(9,6)
         C     7,0(2)
         BNL   @@L1216
@@L1230  EQU   *
         MVC   88(4,13),0(11)
         L     4,112(13)
         AR    4,9
         AR    4,3
         L     3,0(4)
         LR    2,7
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L1184
         LA    3,2(0,0)
         CR    15,3
         BE    @@L1242
@@L1226  EQU   *
         A     7,=F'1'
         LA    3,4(0,0)
         L     2,0(4)
         C     7,0(2)
         BL    @@L1230
         B     @@L1216
@@L1242  EQU   *
         MVC   108(4,13),=F'1'
         B     @@L1226
@@L1240  EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(8)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L1184
         LA    2,2(0,0)
         CLR   15,2
         BNE   @@L1216
         MVC   108(4,13),=F'1'
         B     @@L1216
@@L1197  EQU   *
         L     2,=V(GLBRTL)
         CL    9,12(2)
         BE    @@L1199
         CL    9,16(2)
         BE    @@L1199
         L     2,=V(PIC@OFFS)
         CL    9,0(2)
         BE    @@L1199
@@L1198  EQU   *
         L     2,0(5)
         LTR   2,2
         BE    @@L1200
         L     3,4(9)
         LA    2,19(0,0)
         CLR   3,2
         BH    @@L1200
         L     2,=V(CUSDREGS)
         IC    2,0(2,3)
         SLR   3,3
         CLM   2,1,=XL1'00'
         BNE   @@L1184
@@L1200  EQU   *
         L     3,8(7)
         L     2,4(9)
         SLL   2,4
         L     2,0(2,3)
         LA    3,2(0,0)
         LTR   2,2
         BL    @@L1184
@@L1239  EQU   *
         LPR   3,2
         BCTR  3,0
         SRL   3,31
         B     @@L1184
@@L1199  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,224(2)
         SRL   2,22
         N     2,=F'1'
         LA    3,1(0,0)
         LTR   2,2
         BE    @@L1184
         B     @@L1198
@@L1203  EQU   *
         SRL   4,4
         N     4,=F'1'
         SLR   3,3
         LTR   4,4
         BNE   @@L1184
         L     2,80(5)
         LTR   2,2
         BE    @@L1186
@@L1209  EQU   *
         MVC   88(4,13),4(2)
         MVC   92(4,13),=F'0'
         ST    9,96(13)
         MVC   100(4,13),=V(RTX@VARI)
         LA    1,88(,13)
         L     15,=V(TRUE@DEP)
         BALR  14,15
         LTR   15,15
         BNE   @@L1236
         L     2,8(2)
         LTR   2,2
         BNE   @@L1209
         B     @@L1186
@@L1236  EQU   *
         SLR   3,3
         B     @@L1184
@@L1191  EQU   *
         L     2,=V(FUNRLOOP)
         L     2,0(2)
         B     @@L1239
@@L1184  EQU   *
         LR    15,3
* Function loop_invariant_p epilogue
         PDPEPIL
* Function loop_invariant_p literal pool
         DS    0F
         LTORG
* Function loop_invariant_p page table
         DS    0F
@@PGT30  EQU   *
         DC    A(@@PG30)
         DS    0F
* S-func consec_sets_invariant_p prologue
@@16     PDPPRLG CINDEX=31,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN31
         LTORG
@@FEN31  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG31   EQU   *
         LR    11,1
         L     10,=A(@@PGT31)
* Function consec_sets_invariant_p code
         L     3,8(11)
         L     2,0(11)
         L     4,88(2)
         A     4,=F'120'
         ST    4,104(13)
         L     5,12(11)
         L     2,4(11)
         MVC   108(4,13),4(2)
         LR    8,3
         BCTR  8,0
         L     2,8(4)
         L     9,108(13)
         MH    9,=H'16'
         L     4,0(9,2)
         ST    4,112(13)
         SLR   7,7
         LR    15,7
         LA    4,127(0,0)
         CR    3,4
         BE    @@L1243
         ST    7,0(9,2)
         LTR   8,8
         BNH   @@L1265
@@L1263  EQU   *
         L     5,12(5)
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         ST    2,116(13)
         LA    3,32(0,0)
         CLR   2,3
         BE    @@L1268
@@L1248  EQU   *
         SLR   6,6
         L     2,116(13)
         LA    4,32(0,0)
         CLR   2,4
         BE    @@L1269
@@L1249  EQU   *
         LTR   6,6
         BE    @@L1260
         BCTR  8,0
@@L1245  EQU   *
         LTR   8,8
         BH    @@L1263
@@L1265  EQU   *
         L     3,104(13)
         L     2,8(3)
         L     4,112(13)
         ST    4,0(9,2)
         LR    15,7
         N     15,=F'2'
         A     15,=F'1'
         B     @@L1243
@@L1260  EQU   *
         L     4,116(13)
         LA    3,37(0,0)
         CLR   4,3
         BE    @@L1245
         L     3,104(13)
         L     2,8(3)
         L     4,112(13)
         ST    4,0(9,2)
         LR    15,6
         B     @@L1243
@@L1269  EQU   *
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L1270
         LR    15,6
@@L1251  EQU   *
         LTR   15,15
         BE    @@L1249
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L1249
         L     2,4(3)
         CL    2,108(13)
         BNE   @@L1249
         MVC   88(4,13),0(11)
         MVC   92(4,13),8(15)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BE    @@L1271
@@L1267  EQU   *
         OR    7,6
         B     @@L1249
@@L1271  EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L1249
         L     2,4(15)
         LH    3,0(2)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1258
         CLM   3,3,=H'54'
         BE    @@L1258
         CLM   3,3,=H'55'
         BE    @@L1258
         CLM   3,3,=H'58'
         BE    @@L1258
         CLM   3,3,=H'134'
         BE    @@L1258
         CLM   3,3,=H'56'
         BE    @@L1258
         CLM   3,3,=H'140'
         BE    @@L1258
         ST    5,88(13)
         MVC   92(4,13),=F'6'
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1272
@@L1257  EQU   *
         LTR   6,6
         BE    @@L1249
         B     @@L1267
@@L1272  EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BE    @@L1257
@@L1258  EQU   *
         LA    6,1(0,0)
         B     @@L1257
@@L1270  EQU   *
         L     2,16(5)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'47'
         BE    @@L1251
         ST    5,88(13)
         MVC   92(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         B     @@L1251
@@L1268  EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'7'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L1248
         L     5,4(15)
         B     @@L1248
@@L1243  EQU   *
* Function consec_sets_invariant_p epilogue
         PDPEPIL
* Function consec_sets_invariant_p literal pool
         DS    0F
         LTORG
* Function consec_sets_invariant_p page table
         DS    0F
@@PGT31  EQU   *
         DC    A(@@PG31)
         DS    0F
* S-func find_single_use_in_loop prologue
@@40     PDPPRLG CINDEX=32,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN32
         LTORG
@@FEN32  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG32   EQU   *
         LR    11,1
         L     10,=A(@@PGT32)
* Function find_single_use_in_loop code
         L     9,0(11)
         L     8,4(11)
         L     7,8(11)
@@L1280  EQU   *
         LH    15,0(7)
         N     15,=XL4'0000FFFF'
         LR    3,15
         MH    3,=H'4'
         L     2,=V(RTX@FORM)
         L     2,0(3,2)
         ST    2,104(13)
         LA    2,61(0,0)
         CLR   15,2
         BE    @@L1297
         LA    2,47(0,0)
         CLR   15,2
         BNE   @@L1278
         L     2,4(7)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BE    @@L1279
         ST    9,88(13)
         ST    8,92(13)
         MVC   96(4,13),4(7)
         LA    1,88(,13)
         L     15,=A(@@40)
         BALR  14,15
@@L1279  EQU   *
         L     7,8(7)
         B     @@L1280
@@L1278  EQU   *
         L     2,=V(RTX@LENG)
         SLR   5,5
         IC    5,0(2,15)
         BCTR  5,0
         LTR   5,5
         BL    @@L1273
         LR    6,5
         MH    6,=H'4'
         AR    6,7
         A     6,=F'4'
@@L1294  EQU   *
         L     2,104(13)
         IC    3,0(5,2)
         CLM   3,1,=XL1'85'
         BE    @@L1298
@@L1286  EQU   *
         SLL   3,24
         SRA   3,24
         C     3,=F'-59'
         BE    @@L1299
@@L1284  EQU   *
         A     6,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L1294
         B     @@L1273
@@L1299  EQU   *
         LR    2,5
         MH    2,=H'4'
         ST    2,108(13)
         L     2,0(6)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    @@L1284
@@L1293  EQU   *
         ST    9,88(13)
         ST    8,92(13)
         L     2,108(13)
         L     3,4(7,2)
         LR    2,4
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=A(@@40)
         BALR  14,15
         BCTR  4,0
         LTR   4,4
         BNL   @@L1293
         B     @@L1284
@@L1298  EQU   *
         L     2,0(6)
         LTR   2,2
         BE    @@L1286
         ST    9,88(13)
         ST    8,92(13)
         MVC   96(4,13),0(6)
         LA    1,88(,13)
         L     15,=A(@@40)
         BALR  14,15
         B     @@L1284
@@L1297  EQU   *
         L     4,8(9)
         L     3,4(7)
         SLL   3,4
         L     2,8(3,4)
         LTR   2,2
         BE    @@L1275
         CLR   2,8
         BE    @@L1275
         L     2,=V(CIRTX)
         L     2,256(2)
@@L1276  EQU   *
         ST    2,8(3,4)
         B     @@L1273
@@L1275  EQU   *
         LR    2,8
         B     @@L1276
@@L1273  EQU   *
* Function find_single_use_in_loop epilogue
         PDPEPIL
* Function find_single_use_in_loop literal pool
         DS    0F
         LTORG
* Function find_single_use_in_loop page table
         DS    0F
@@PGT32  EQU   *
         DC    A(@@PG32)
         DS    0F
* S-func count_one_set prologue
@@41     PDPPRLG CINDEX=33,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN33
         LTORG
@@FEN33  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG33   EQU   *
         LR    11,1
         L     10,=A(@@PGT33)
* Function count_one_set code
         L     9,0(11)
         L     4,8(11)
         LH    2,0(4)
         CLM   2,3,=H'49'
         BE    @@L1325
@@L1301  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'47'
         BE    @@L1303
         CLM   2,3,=H'49'
         BNE   @@L1300
@@L1303  EQU   *
         L     4,4(4)
         LH    2,0(4)
         CLM   2,3,=H'63'
         BE    @@L1307
         CLM   2,3,=H'133'
         BE    @@L1307
         CLM   2,3,=H'132'
         BE    @@L1307
         CLM   2,3,=H'64'
         BE    @@L1307
@@L1324  EQU   *
         LH    2,0(4)
         CH    2,=H'61'
         BNE   @@L1300
         L     6,4(4)
         SLR   8,8
         LR    5,6
         MH    5,=H'16'
         LR    7,6
@@L1309  EQU   *
         LA    2,19(0,0)
         CR    6,2
         BH    @@L1313
         LA    3,15(0,0)
         CR    6,3
         BNH   @@L1315
         SLR   3,3
         IC    3,2(4)
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,3)
         LR    2,15
         A     2,=F'7'
         SRA   2,3
         CR    8,2
         BNL   @@L1300
@@L1322  EQU   *
         L     3,8(9)
         LR    2,6
         MH    2,=H'16'
         L     2,0(2,3)
         LTR   2,2
         BNH   @@L1319
         L     15,12(11)
         LTR   15,15
         BE    @@L1327
@@L1319  EQU   *
         LR    2,6
         MH    2,=H'4'
         L     3,12(11)
         L     2,0(2,3)
         LTR   2,2
         BNE   @@L1328
@@L1320  EQU   *
         L     3,8(9)
         L     2,0(5,3)
         LA    15,126(0,0)
         CR    2,15
         BH    @@L1321
         A     2,=F'1'
         ST    2,0(5,3)
@@L1321  EQU   *
         LR    2,7
         MH    2,=H'4'
         L     15,4(11)
         L     3,12(11)
         ST    15,0(2,3)
         A     5,=F'16'
         A     7,=F'1'
         A     8,=F'1'
         B     @@L1309
@@L1328  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(REG@USED)
         BALR  14,15
         LTR   15,15
         BE    @@L1320
         L     2,8(9)
         LA    15,1(0,0)
         STC   15,12(5,2)
         B     @@L1320
@@L1327  EQU   *
         LA    2,1(0,0)
         STC   2,12(5,3)
         B     @@L1319
@@L1315  EQU   *
         SLR   3,3
         IC    3,2(4)
         L     2,=V(MODE@SIZ)
         SLR   15,15
         IC    15,0(2,3)
         LR    2,15
         A     2,=F'3'
         SRA   2,2
         CR    8,2
         BL    @@L1322
         B     @@L1300
@@L1313  EQU   *
         LTR   8,8
         BNH   @@L1322
         B     @@L1300
@@L1307  EQU   *
         L     4,4(4)
         LH    2,0(4)
         CLM   2,3,=H'63'
         BE    @@L1307
         CLM   2,3,=H'133'
         BE    @@L1307
         CLM   2,3,=H'132'
         BE    @@L1307
         CLM   2,3,=H'64'
         BE    @@L1307
         B     @@L1324
@@L1325  EQU   *
         L     15,4(4)
         LH    2,0(15)
         CLM   2,3,=H'61'
         BNE   @@L1301
         L     3,8(9)
         L     2,4(15)
         SLL   2,4
         LA    5,1(0,0)
         STC   5,12(2,3)
         B     @@L1301
@@L1300  EQU   *
* Function count_one_set epilogue
         PDPEPIL
* Function count_one_set literal pool
         DS    0F
         LTORG
* Function count_one_set page table
         DS    0F
@@PGT33  EQU   *
         DC    A(@@PG33)
         DS    0F
* S-func loop_reg_used_before_p prologue
@@15     PDPPRLG CINDEX=34,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN34
         LTORG
@@FEN34  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG34   EQU   *
         LR    11,1
         L     10,=A(@@PGT34)
* Function loop_reg_used_before_p code
         L     5,0(11)
         L     7,8(11)
         L     2,4(11)
         L     6,4(2)
         L     4,116(5)
         CLR   4,7
         BE    @@L1338
@@L1336  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L1339
@@L1334  EQU   *
         CL    4,108(5)
         BE    @@L1340
@@L1332  EQU   *
         L     4,12(4)
         CLR   4,7
         BNE   @@L1336
@@L1338  EQU   *
         SLR   2,2
         B     @@L1329
@@L1340  EQU   *
         L     4,104(5)
         B     @@L1332
@@L1339  EQU   *
         ST    6,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(ROMP)
         BALR  14,15
         LA    2,1(0,0)
         LTR   15,15
         BE    @@L1334
@@L1329  EQU   *
         LR    15,2
* Function loop_reg_used_before_p epilogue
         PDPEPIL
* Function loop_reg_used_before_p literal pool
         DS    0F
         LTORG
* Function loop_reg_used_before_p page table
         DS    0F
@@PGT34  EQU   *
         DC    A(@@PG34)
         DS    0F
* S-func check_store prologue
@@42     PDPPRLG CINDEX=35,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN35
         LTORG
@@FEN35  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG35   EQU   *
         LR    11,1
         L     10,=A(@@PGT35)
* Function check_store code
         L     15,0(11)
         L     3,8(11)
         LH    2,0(15)
         CLM   2,3,=H'66'
         BNE   @@L1341
         MVC   88(4,13),0(3)
         MVC   92(4,13),4(15)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1341
         MVC   4(4,3),=F'1'
@@L1341  EQU   *
* Function check_store epilogue
         PDPEPIL
* Function check_store literal pool
         DS    0F
         LTORG
* Function check_store page table
         DS    0F
@@PGT35  EQU   *
         DC    A(@@PG35)
         DS    0F
* S-func rtx_equal_for_prefetch_p prologue
@@43     PDPPRLG CINDEX=36,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN36
         LTORG
@@FEN36  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG36   EQU   *
         LR    11,1
         L     10,=A(@@PGT36)
* Function rtx_equal_for_prefetch_p code
         L     9,0(11)
         LH    4,0(9)
         N     4,=XL4'0000FFFF'
         LA    3,1(0,0)
         CL    9,4(11)
         BE    @@L1343
         L     3,4(11)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         SLR   3,3
         CLR   4,2
         BNE   @@L1343
         L     2,=V(RTX@CLAS)
         IC    2,0(2,4)
         CLM   2,1,=XL1'83'
         BE    @@L1386
         LR    2,4
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         ST    3,104(13)
         L     2,=V(RTX@LENG)
         SLR   8,8
         IC    8,0(2,4)
         BCTR  8,0
         LTR   8,8
         BL    @@L1381
         LR    6,8
         MH    6,=H'4'
@@L1379  EQU   *
         L     4,104(13)
         SLR   2,2
         IC    2,0(8,4)
         LA    3,164(0,0)
         CR    2,3
         BE    @@L1353
         BH    @@L1376
         LA    4,137(0,0)
         CR    2,4
         BE    @@L1358
         BH    @@L1377
         LA    3,133(0,0)
         CLR   2,3
         BE    @@L1368
@@L1374  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3710'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L1353  EQU   *
         A     6,=F'-4'
         BCTR  8,0
         LTR   8,8
         BNL   @@L1379
@@L1381  EQU   *
         LA    3,1(0,0)
         B     @@L1343
@@L1368  EQU   *
         L     2,4(9,6)
         ST    2,88(13)
         L     3,4(11)
         L     3,4(3,6)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L1343
         B     @@L1353
@@L1377  EQU   *
         LA    4,162(0,0)
         CLR   2,4
         BNE   @@L1374
         L     4,4(9,6)
         ST    4,88(13)
         L     2,4(11)
         L     2,4(2,6)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(STRCMP)
         BALR  14,15
         SLR   3,3
         LTR   15,15
         BNE   @@L1343
         B     @@L1353
@@L1358  EQU   *
         L     2,4(9,6)
         L     3,4(11)
         CL    2,4(3,6)
         BE    @@L1353
@@L1385  EQU   *
         SLR   3,3
         B     @@L1343
@@L1376  EQU   *
         LA    3,197(0,0)
         CR    2,3
         BE    @@L1360
         BH    @@L1378
         LA    4,166(0,0)
         CLR   2,4
         BNE   @@L1374
         L     2,4(9,6)
         L     4,4(11)
         CL    2,4(4,6)
         BE    @@L1353
         B     @@L1385
@@L1378  EQU   *
         LA    3,240(0,0)
         CLR   2,3
         BE    @@L1353
         B     @@L1374
@@L1360  EQU   *
         ST    6,108(13)
         L     2,4(9,6)
         L     4,4(11)
         L     3,4(4,6)
         L     2,0(2)
         C     2,0(3)
         BNE   @@L1385
         SLR   7,7
         CR    7,2
         BNL   @@L1353
@@L1367  EQU   *
         LA    4,4(0,0)
         L     5,108(13)
         AR    5,9
         AR    5,4
         L     2,0(5)
         LR    3,7
         MH    3,=H'4'
         L     2,4(3,2)
         ST    2,88(13)
         L     2,108(13)
         A     2,4(11)
         L     2,0(4,2)
         L     2,4(3,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LTR   15,15
         BE    @@L1385
         A     7,=F'1'
         L     2,0(5)
         C     7,0(2)
         BL    @@L1367
         B     @@L1353
@@L1386  EQU   *
         SLR   2,2
         MVC   88(4,13),4(9)
         L     4,4(11)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LTR   15,15
         BE    @@L1349
         MVC   88(4,13),8(9)
         MVC   92(4,13),8(4)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LTR   15,15
         BNE   @@L1348
@@L1349  EQU   *
         MVC   88(4,13),4(9)
         L     3,4(11)
         MVC   92(4,13),8(3)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LTR   15,15
         BNE   @@L1387
@@L1347  EQU   *
         LR    3,2
         B     @@L1343
@@L1387  EQU   *
         MVC   88(4,13),8(9)
         MVC   92(4,13),4(3)
         LA    1,88(,13)
         L     15,=A(@@43)
         BALR  14,15
         LTR   15,15
         BE    @@L1347
@@L1348  EQU   *
         LA    2,1(0,0)
         B     @@L1347
@@L1343  EQU   *
         LR    15,3
* Function rtx_equal_for_prefetch_p epilogue
         PDPEPIL
* Function rtx_equal_for_prefetch_p literal pool
         DS    0F
         LTORG
* Function rtx_equal_for_prefetch_p page table
         DS    0F
@@PGT36  EQU   *
         DC    A(@@PG36)
         DS    0F
* S-func remove_constant_addition prologue
@@44     PDPPRLG CINDEX=37,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN37
         LTORG
@@FEN37  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG37   EQU   *
         LR    11,1
         L     10,=A(@@PGT37)
* Function remove_constant_addition code
         L     6,0(11)
         SLR   5,5
         L     3,0(6)
         LH    2,0(3)
         CLM   2,3,=H'58'
         BE    @@L1398
         CLM   2,3,=H'54'
         BE    @@L1399
         CLM   2,3,=H'75'
         BE    @@L1400
@@L1392  EQU   *
         LR    15,5
         B     @@L1388
@@L1400  EQU   *
         LR    2,3
         A     2,=F'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         LR    5,15
         A     3,=F'8'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(@@44)
         BALR  14,15
         AR    5,15
         L     4,0(2)
         L     2,=V(CIRTX)
         L     15,256(2)
         CLR   4,15
         BE    @@L1401
         L     2,0(3)
         CLR   2,15
         BNE   @@L1392
         ST    4,0(6)
         B     @@L1392
@@L1401  EQU   *
         MVC   0(4,6),0(3)
         B     @@L1392
@@L1399  EQU   *
         L     5,4(3)
         L     2,=V(CIRTX)
         MVC   0(4,6),256(2)
         B     @@L1392
@@L1398  EQU   *
         L     15,4(3)
         LH    2,0(15)
         CLM   2,3,=H'75'
         BE    @@L1402
@@L1390  EQU   *
         SLR   15,15
         B     @@L1388
@@L1402  EQU   *
         L     4,4(15)
         LH    2,0(4)
         CLM   2,3,=H'68'
         BNE   @@L1390
         L     2,8(15)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L1390
         ST    4,0(6)
         L     2,4(3)
         L     2,8(2)
         L     15,4(2)
@@L1388  EQU   *
* Function remove_constant_addition epilogue
         PDPEPIL
* Function remove_constant_addition literal pool
         DS    0F
         LTORG
* Function remove_constant_addition page table
         DS    0F
@@PGT37  EQU   *
         DC    A(@@PG37)
         DS    0F
* S-func emit_prefetch_instructions prologue
@@45     PDPPRLG CINDEX=38,FRAME=3320,BASER=12,ENTRY=NO
         B     @@FEN38
         LTORG
@@FEN38  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG38   EQU   *
         LR    11,1
         L     10,=A(@@PGT38)
* Function emit_prefetch_instructions code
* Function emit_prefetch_instructions epilogue
         PDPEPIL
* Function emit_prefetch_instructions literal pool
         DS    0F
         LTORG
* Function emit_prefetch_instructions page table
         DS    0F
@@PGT38  EQU   *
         DC    A(@@PG38)
         DS    0F
* X-func f_e_iil prologue
F@E@IIL  PDPPRLG CINDEX=39,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN39
         LTORG
@@FEN39  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG39   EQU   *
         LR    11,1
         L     10,=A(@@PGT39)
* Function f_e_iil code
         L     5,0(11)
         SLR   6,6
         LR    8,6
         LR    9,6
         LR    7,6
         MVC   88(4,13),116(5)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),104(5)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         CLR   2,15
         BE    @@L1510
         ST    5,88(13)
         MVC   92(4,13),116(5)
         LA    1,88(,13)
         L     15,=V(BACK@BRA)
         BALR  14,15
         LR    8,15
@@L1510  EQU   *
         ST    5,88(13)
         MVC   92(4,13),116(5)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L1548
@@L1546  EQU   *
         ST    5,88(13)
         ST    4,92(13)
         ST    6,96(13)
         ST    8,100(13)
         L     2,4(11)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    4,15
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L1550
@@L1515  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'33'
         BE    @@L1551
@@L1527  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'37'
         BE    @@L1552
@@L1537  EQU   *
         LH    15,0(4)
         CLM   15,3,=H'33'
         BE    @@L1553
@@L1544  EQU   *
         LTR   6,6
         BE    @@L1513
         LTR   9,9
         BNE   @@L1513
         CLM   15,3,=H'36'
         BE    @@L1554
@@L1513  EQU   *
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L1546
         B     @@L1548
@@L1554  EQU   *
         ST    4,88(13)
         MVC   92(4,13),108(5)
         LA    1,88(,13)
         L     15,=V(NO@LABEL)
         BALR  14,15
         LTR   15,15
         BE    @@L1513
         ST    4,88(13)
         MVC   92(4,13),96(5)
         LA    1,88(,13)
         L     15,=V(LI@FIRST)
         BALR  14,15
         LTR   15,15
         BE    @@L1513
         LR    6,9
         B     @@L1513
@@L1553  EQU   *
         L     3,104(5)
         L     2,32(4)
         CL    2,12(3)
         BNE   @@L1544
         LA    9,1(0,0)
         B     @@L1544
@@L1552  EQU   *
         L     3,20(4)
         LR    2,3
         A     2,=F'94'
         LA    15,1(0,0)
         CLR   2,15
         BH    @@L1539
         LTR   7,7
         BNE   @@L1539
         LR    6,7
         B     @@L1537
@@L1539  EQU   *
         L     2,=F'-96'
         CLR   3,2
         BE    @@L1555
         L     15,=F'-95'
         CLR   3,15
         BNE   @@L1537
         BCTR  7,0
         B     @@L1537
@@L1555  EQU   *
         A     7,=F'1'
         B     @@L1537
@@L1551  EQU   *
         L     2,32(4)
         CL    2,112(5)
         BE    @@L1556
@@L1528  EQU   *
         L     3,124(5)
         LTR   3,3
         BE    @@L1531
@@L1535  EQU   *
         L     2,4(3)
         CL    2,32(4)
         BE    @@L1531
         L     3,8(3)
         LTR   3,3
         BNE   @@L1535
@@L1531  EQU   *
         LTR   3,3
         BNE   @@L1537
         LA    6,1(0,0)
         B     @@L1537
@@L1556  EQU   *
         L     2,12(4)
         L     2,12(2)
         CL    2,108(5)
         BE    @@L1557
@@L1529  EQU   *
         L     2,12(4)
         CL    2,108(5)
         BNE   @@L1528
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LTR   15,15
         BNE   @@L1527
         B     @@L1528
@@L1557  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@UNCO)
         BALR  14,15
         LTR   15,15
         BNE   @@L1527
         B     @@L1529
@@L1550  EQU   *
         LR    3,15
         SLR   8,8
@@L1526  EQU   *
         L     3,12(3)
         L     15,116(5)
         CLR   3,15
         BE    @@L1515
         CL    3,108(5)
         BE    @@L1558
@@L1520  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'33'
         BNE   @@L1526
         L     2,16(3)
         LH    2,0(2)
         CLM   2,3,=H'51'
         BE    @@L1526
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LTR   15,15
         BE    @@L1525
         L     2,32(3)
         LTR   2,2
         BE    @@L1526
         CL    2,116(5)
         BE    @@L1526
         ST    4,88(13)
         MVC   92(4,13),32(3)
         LA    1,88(,13)
         L     15,=V(LI@FIRST)
         BALR  14,15
         LTR   15,15
         BNE   @@L1526
@@L1525  EQU   *
         LA    8,1(0,0)
         B     @@L1515
@@L1558  EQU   *
         L     2,112(5)
         LTR   2,2
         BE    @@L1515
         LR    3,2
         CLR   2,15
         BNE   @@L1520
         B     @@L1515
@@L1548  EQU   *
* Function f_e_iil epilogue
         PDPEPIL
* Function f_e_iil literal pool
         DS    0F
         LTORG
* Function f_e_iil page table
         DS    0F
@@PGT39  EQU   *
         DC    A(@@PG39)
@@LC39   EQU   *
         DC    C'Biv %d: discarded, %s'
         DC    X'15'
         DC    X'0'
@@LC42   EQU   *
         DC    C'not induction variable'
         DC    X'0'
@@LC40   EQU   *
         DC    C'never incremented'
         DC    X'0'
@@LC41   EQU   *
         DC    C'count error'
         DC    X'0'
@@LC43   EQU   *
         DC    C'Biv %d: verified'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func loop_bivs_find prologue
@@47     PDPPRLG CINDEX=40,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN40
         LTORG
@@FEN40  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG40   EQU   *
         LR    11,1
         L     10,=A(@@PGT40)
* Function loop_bivs_find code
         L     3,0(11)
         L     2,88(3)
         LR    7,2
         A     7,=F'120'
         LR    5,2
         A     5,=F'136'
         MVC   8(4,5),=F'0'
         ST    3,88(13)
         MVC   92(4,13),=A(@@48)
         LA    1,88(,13)
         L     15,=A(F@E@IIL)
         BALR  14,15
         LR    6,2
         A     6,=F'144'
         L     4,0(6)
         LTR   4,4
         BE    @@L1575
@@L1573  EQU   *
         L     15,0(4)
         L     2,0(5)
         LR    3,15
         MH    3,=H'8'
         L     2,0(3,2)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L1576
@@L1565  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L1566
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC39)
         MVC   96(4,13),0(4)
         L     2,0(5)
         L     3,0(4)
         SLL   3,3
         L     2,0(3,2)
         LA    8,1(0,0)
         CLR   2,8
         BE    @@L1577
         L     3,=A(@@LC42)
@@L1568  EQU   *
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L1566  EQU   *
         L     3,0(5)
         L     2,0(4)
         SLL   2,3
         LA    8,2(0,0)
         ST    8,0(2,3)
         MVC   0(4,6),36(4)
@@L1562  EQU   *
         L     4,36(4)
         LTR   4,4
         BNE   @@L1573
         B     @@L1575
@@L1577  EQU   *
         L     2,48(4)
         SRL   2,31
         L     3,=A(@@LC40)
         LTR   2,2
         BE    @@L1568
         L     3,=A(@@LC41)
         B     @@L1568
@@L1576  EQU   *
         L     2,8(7)
         MH    15,=H'16'
         L     2,4(15,2)
         CL    2,4(4)
         BNE   @@L1565
         L     2,48(4)
         SRL   2,31
         LTR   2,2
         BE    @@L1565
         LR    6,4
         A     6,=F'36'
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L1562
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC43)
         MVC   96(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1562
@@L1575  EQU   *
* Function loop_bivs_find epilogue
         PDPEPIL
* Function loop_bivs_find literal pool
         DS    0F
         LTORG
* Function loop_bivs_find page table
         DS    0F
@@PGT40  EQU   *
         DC    A(@@PG40)
         DS    0F
* S-func loop_bivs_init_find prologue
@@49     PDPPRLG CINDEX=41,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN41
         LTORG
@@FEN41  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG41   EQU   *
         LR    11,1
         L     10,=A(@@PGT41)
* Function loop_bivs_init_find code
         L     6,0(11)
         L     7,88(6)
         A     7,=F'136'
         SLR   8,8
         L     4,104(6)
         LTR   4,4
         BE    @@L1578
         LH    2,0(4)
         CLM   2,3,=H'36'
         BE    @@L1578
@@L1589  EQU   *
         L     2,=A(@@50)
         ST    4,0(2)
         LH    2,0(4)
         CLM   2,3,=H'34'
         BE    @@L1591
@@L1584  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L1592
@@L1585  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'33'
         BE    @@L1593
@@L1581  EQU   *
         L     4,8(4)
         LTR   4,4
         BE    @@L1578
         LH    2,0(4)
         CLM   2,3,=H'36'
         BNE   @@L1589
         B     @@L1578
@@L1593  EQU   *
         L     2,32(4)
         LTR   2,2
         BE    @@L1581
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),108(6)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         CLR   2,15
         BNE   @@L1581
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GCONDFL)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L1581
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L1581
         L     3,4(3)
         L     2,=A(MXRGBL)
         CL    3,0(2)
         BNL   @@L1581
         L     2,0(7)
         MH    3,=H'8'
         L     3,4(3,2)
         LTR   3,3
         BE    @@L1581
         MVC   88(4,13),8(15)
         ST    4,92(13)
         ST    8,96(13)
         MVC   100(4,13),104(6)
         LA    1,88(,13)
         L     15,=A(@@52)
         BALR  14,15
         LTR   15,15
         BE    @@L1581
         L     15,40(3)
         LTR   15,15
         BNE   @@L1581
         LH    2,0(5)
         CLM   2,3,=H'102'
         BE    @@L1594
         ST    5,28(3)
         B     @@L1581
@@L1594  EQU   *
         ST    4,40(3)
         MVC   88(4,13),=F'47'
         ST    15,92(13)
         MVC   96(4,13),4(5)
         MVC   100(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,44(3)
         B     @@L1581
@@L1592  EQU   *
         MVC   88(4,13),16(4)
         MVC   92(4,13),=A(@@51)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(NOTE@STO)
         BALR  14,15
         B     @@L1585
@@L1591  EQU   *
         LA    8,1(0,0)
         B     @@L1584
@@L1578  EQU   *
* Function loop_bivs_init_find epilogue
         PDPEPIL
* Function loop_bivs_init_find literal pool
         DS    0F
         LTORG
* Function loop_bivs_init_find page table
         DS    0F
@@PGT41  EQU   *
         DC    A(@@PG41)
@@LC45   EQU   *
         DC    C'is complex'
         DC    X'15'
         DC    X'0'
@@LC44   EQU   *
         DC    C'Biv %d: initialized at insn %d: initial value '
         DC    X'0'
         DS    0F
* S-func loop_bivs_check prologue
@@53     PDPPRLG CINDEX=42,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN42
         LTORG
@@FEN42  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG42   EQU   *
         LR    11,1
         L     10,=A(@@PGT42)
* Function loop_bivs_check code
         L     7,0(11)
         L     2,88(7)
         A     2,=F'144'
         L     4,0(2)
         LTR   4,4
         BE    @@L1613
@@L1611  EQU   *
         L     2,40(4)
         LTR   2,2
         BNE   @@L1614
@@L1598  EQU   *
         L     4,36(4)
         LTR   4,4
         BNE   @@L1611
         B     @@L1613
@@L1614  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L1603
         L     2,4(15)
         LH    3,0(2)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1602
         CLM   3,3,=H'54'
         BE    @@L1602
         CLM   3,3,=H'55'
         BE    @@L1602
         CLM   3,3,=H'58'
         BE    @@L1602
         CLM   3,3,=H'134'
         BE    @@L1602
         CLM   3,3,=H'56'
         BE    @@L1602
         CLM   3,3,=H'140'
         BE    @@L1602
@@L1603  EQU   *
         MVC   88(4,13),40(4)
         MVC   92(4,13),=F'3'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L1601
         L     2,4(15)
         LH    3,0(2)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1602
         CLM   3,3,=H'54'
         BE    @@L1602
         CLM   3,3,=H'55'
         BE    @@L1602
         CLM   3,3,=H'58'
         BE    @@L1602
         CLM   3,3,=H'134'
         BE    @@L1602
         CLM   3,3,=H'56'
         BE    @@L1602
         CLM   3,3,=H'140'
         BE    @@L1602
@@L1601  EQU   *
         L     2,44(4)
         L     5,8(2)
@@L1604  EQU   *
         L     6,=A(LOOP@DUM)
         L     2,0(6)
         LTR   2,2
         BNE   @@L1615
@@L1605  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,48(2)
         L     2,0(4)
         SLL   2,2
         L     2,0(2,3)
         IC    3,2(5)
         CLM   3,1,2(2)
         BE    @@L1607
         CLM   3,1,=XL1'00'
         BNE   @@L1606
@@L1607  EQU   *
         ST    5,88(13)
         MVC   92(4,13),40(4)
         L     2,88(7)
         MVC   96(4,13),148(2)
         MVC   100(4,13),104(7)
         LA    1,88(,13)
         L     15,=A(@@52)
         BALR  14,15
         LTR   15,15
         BE    @@L1606
         ST    5,24(4)
         L     2,0(6)
         LTR   2,2
         BE    @@L1598
         ST    2,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         MVC   88(4,13),=F'21'
         MVC   92(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L1598
@@L1606  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L1598
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC45)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1598
@@L1615  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC44)
         MVC   96(4,13),0(4)
         L     2,40(4)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1605
@@L1602  EQU   *
         L     5,4(15)
         B     @@L1604
@@L1613  EQU   *
* Function loop_bivs_check epilogue
         PDPEPIL
* Function loop_bivs_check literal pool
         DS    0F
         LTORG
* Function loop_bivs_check page table
         DS    0F
@@PGT42  EQU   *
         DC    A(@@PG42)
         DS    0F
* S-func loop_givs_find prologue
@@54     PDPPRLG CINDEX=43,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN43
         LTORG
@@FEN43  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG43   EQU   *
         LR    11,1
         L     10,=A(@@PGT43)
* Function loop_givs_find code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=A(@@46)
         LA    1,88(,13)
         L     15,=A(F@E@IIL)
         BALR  14,15
* Function loop_givs_find epilogue
         PDPEPIL
* Function loop_givs_find literal pool
         DS    0F
         LTORG
* Function loop_givs_find page table
         DS    0F
@@PGT43  EQU   *
         DC    A(@@PG43)
         DS    0F
* S-func loop_givs_check prologue
@@55     PDPPRLG CINDEX=44,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN44
         LTORG
@@FEN44  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG44   EQU   *
         LR    11,1
         L     10,=A(@@PGT44)
* Function loop_givs_check code
         L     5,0(11)
         L     2,88(5)
         A     2,=F'136'
         L     4,8(2)
         LTR   4,4
         BE    @@L1630
@@L1628  EQU   *
         L     3,16(4)
         LTR   3,3
         BE    @@L1632
@@L1627  EQU   *
         L     2,52(3)
         N     2,=F'-1073741824'
         LTR   2,2
         BE    @@L1633
@@L1624  EQU   *
         L     3,68(3)
         LTR   3,3
         BNE   @@L1627
@@L1632  EQU   *
         L     4,36(4)
         LTR   4,4
         BNE   @@L1628
         B     @@L1630
@@L1633  EQU   *
         ST    5,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@56)
         BALR  14,15
         B     @@L1624
@@L1630  EQU   *
* Function loop_givs_check epilogue
         PDPEPIL
* Function loop_givs_check literal pool
         DS    0F
         LTORG
* Function loop_givs_check page table
         DS    0F
@@PGT44  EQU   *
         DC    A(@@PG44)
@@LC46   EQU   *
         DC    C'Cannot eliminate biv %d.'
         DC    X'15'
         DC    X'0'
@@LC47   EQU   *
         DC    C'First use: insn %d, last use: insn %d.'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func loop_biv_eliminable_p prologue
@@57     PDPPRLG CINDEX=45,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN45
         LTORG
@@FEN45  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG45   EQU   *
         LR    11,1
         L     10,=A(@@PGT45)
* Function loop_biv_eliminable_p code
         L     7,0(11)
         L     6,4(11)
         L     2,0(6)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,=A(UID@LUID)
         L     4,0(2)
         L     2,4(3)
         SLL   2,2
         L     5,0(2,4)
         L     2,108(7)
         L     3,4(2)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BNL   @@L1638
         MH    3,=H'4'
         C     5,0(3,4)
         BL    @@L1639
@@L1637  EQU   *
         ST    7,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(FINAL@BI)
         BALR  14,15
         LR    4,15
         ST    15,32(6)
         LTR   15,15
         BE    @@L1635
@@L1636  EQU   *
         ST    7,88(13)
         ST    6,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),8(11)
         MVC   104(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         B     @@L1634
@@L1635  EQU   *
         L     3,=A(LOOP@DUM)
         L     2,0(3)
         LTR   2,2
         BNE   @@L1643
@@L1642  EQU   *
         LR    15,4
         B     @@L1634
@@L1643  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC46)
         MVC   96(4,13),0(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC47)
         L     3,0(6)
         SLL   3,2
         L     2,=V(REG@N@IN)
         A     3,0(2)
         A     3,=F'16'
         L     2,0(3)
         MVC   96(4,13),0(2)
         L     2,0(3)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1642
@@L1639  EQU   *
         L     2,40(6)
         LTR   2,2
         BE    @@L1637
         L     15,4(2)
         L     2,=A(MAX@UID@)
         C     15,0(2)
         BNL   @@L1637
         L     2,0(6)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     4,16(2)
         L     2,=A(UID@LUID)
         L     3,0(2)
         L     2,0(4)
         SLL   2,2
         L     2,0(2,3)
         MH    15,=H'4'
         C     2,0(15,3)
         BL    @@L1637
         L     2,8(6)
         MVC   88(4,13),16(2)
         L     2,44(6)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L1636
         B     @@L1637
@@L1638  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'4558'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=F'-1'
         CR    5,2
         BNL   @@L1637
         B     @@L1639
@@L1634  EQU   *
* Function loop_biv_eliminable_p epilogue
         PDPEPIL
* Function loop_biv_eliminable_p literal pool
         DS    0F
         LTORG
* Function loop_biv_eliminable_p page table
         DS    0F
@@PGT45  EQU   *
         DC    A(@@PG45)
         DS    0F
* S-func loop_givs_reduce prologue
@@59     PDPPRLG CINDEX=46,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN46
         LTORG
@@FEN46  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG46   EQU   *
         LR    11,1
         L     10,=A(@@PGT46)
* Function loop_givs_reduce code
         L     7,0(11)
         L     6,4(11)
         L     4,16(6)
         LTR   4,4
         BE    @@L1664
@@L1662  EQU   *
         L     2,52(4)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1647
         L     2,72(4)
         LTR   2,2
         BNE   @@L1647
         L     2,4(4)
         LTR   2,2
         BE    @@L1668
@@L1650  EQU   *
         L     5,8(6)
         LTR   5,5
         BE    @@L1666
@@L1661  EQU   *
         L     15,0(5)
         L     3,32(5)
         L     2,=V(CIRTX)
         CL    3,260(2)
         BE    @@L1669
         ST    7,88(13)
         MVC   92(4,13),36(5)
         MVC   96(4,13),32(4)
         MVC   100(4,13),36(4)
@@L1667  EQU   *
         MVC   104(4,13),4(4)
         MVC   108(4,13),=F'0'
         ST    15,112(13)
         LA    1,88(,13)
         L     15,=V(LI@AMEB)
         BALR  14,15
         L     5,68(5)
         LTR   5,5
         BNE   @@L1661
@@L1666  EQU   *
         ST    4,88(13)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(EXTEND@V)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         MVC   96(4,13),32(4)
         MVC   100(4,13),36(4)
         MVC   104(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(LI@AMH)
         BALR  14,15
@@L1647  EQU   *
         L     4,68(4)
         LTR   4,4
         BNE   @@L1662
         B     @@L1664
@@L1669  EQU   *
         ST    7,88(13)
         MVC   92(4,13),36(5)
         MVC   96(4,13),32(4)
         MVC   100(4,13),4(4)
         B     @@L1667
@@L1668  EQU   *
         MVC   88(4,13),24(4)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         ST    15,4(4)
         B     @@L1650
@@L1664  EQU   *
* Function loop_givs_reduce epilogue
         PDPEPIL
* Function loop_givs_reduce literal pool
         DS    0F
         LTORG
* Function loop_givs_reduce page table
         DS    0F
@@PGT46  EQU   *
         DC    A(@@PG46)
         DS    0F
* S-func loop_givs_dead_check prologue
@@60     PDPPRLG CINDEX=47,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN47
         LTORG
@@FEN47  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG47   EQU   *
         LR    11,1
         L     10,=A(@@PGT47)
* Function loop_givs_dead_check code
         L     6,4(11)
         L     15,16(6)
         LTR   15,15
         BE    @@L1686
@@L1684  EQU   *
         L     2,52(15)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1673
         L     2,72(15)
         LTR   2,2
         BE    @@L1675
         L     2,52(2)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1673
@@L1675  EQU   *
         L     2,12(15)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L1688
@@L1673  EQU   *
         L     15,68(15)
         LTR   15,15
         BNE   @@L1684
         B     @@L1686
@@L1688  EQU   *
         L     5,16(15)
         L     2,4(5)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     2,16(2)
         L     3,0(15)
         L     2,0(2)
         CL    2,4(3)
         BNE   @@L1673
         L     4,16(6)
         LTR   4,4
         BE    @@L1673
@@L1683  EQU   *
         L     2,4(5)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     2,16(2)
         L     3,0(4)
         L     2,4(2)
         CL    2,4(3)
         BE    @@L1689
@@L1680  EQU   *
         L     4,68(4)
         LTR   4,4
         BNE   @@L1683
         B     @@L1673
@@L1689  EQU   *
         OC    52(4,15),=F'16777216'
         B     @@L1680
@@L1686  EQU   *
* Function loop_givs_dead_check epilogue
         PDPEPIL
* Function loop_givs_dead_check literal pool
         DS    0F
         LTORG
* Function loop_givs_dead_check page table
         DS    0F
@@PGT47  EQU   *
         DC    A(@@PG47)
@@LC48   EQU   *
         DC    C'giv at %d reduced to '
         DC    X'0'
         DS    0F
* S-func loop_givs_rescan prologue
@@61     PDPPRLG CINDEX=48,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN48
         LTORG
@@FEN48  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG48   EQU   *
         LR    11,1
         L     10,=A(@@PGT48)
* Function loop_givs_rescan code
         SLR   8,8
         SLR   9,9
         LR    6,8
         LR    7,9
         L     2,4(11)
         L     5,16(2)
         LTR   5,5
         BE    @@L1725
@@L1723  EQU   *
         L     3,72(5)
         LTR   3,3
         BE    @@L1695
         L     2,52(3)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BE    @@L1695
         OC    52(4,5),=F'536870912'
@@L1695  EQU   *
         L     2,52(5)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1693
         LTR   3,3
         BNE   @@L1728
@@L1697  EQU   *
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L1729
@@L1698  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L1730
@@L1700  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L1731
@@L1707  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L1732
@@L1699  EQU   *
         L     2,12(5)
         LTR   2,2
         BE    @@L1733
         L     2,52(5)
         SRL   2,31
         LTR   2,2
         BE    @@L1717
         L     2,16(5)
         L     2,4(2)
         SLL   2,2
         L     15,4(5)
         L     4,8(11)
         ST    15,0(2,4)
@@L1716  EQU   *
         L     3,4(11)
         L     2,48(3)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BE    @@L1719
         L     2,52(5)
         SRL   2,31
         LTR   2,2
         BE    @@L1734
@@L1719  EQU   *
         L     2,44(5)
         LTR   2,2
         BNE   @@L1735
@@L1720  EQU   *
         L     3,=A(LOOP@DUM)
         L     2,0(3)
         LTR   2,2
         BNE   @@L1736
@@L1693  EQU   *
         L     5,68(5)
         LTR   5,5
         BNE   @@L1723
         B     @@L1725
@@L1736  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC48)
         L     2,0(5)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC19)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1693
@@L1735  EQU   *
         MVC   88(4,13),16(5)
         MVC   92(4,13),44(5)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
         B     @@L1720
@@L1734  EQU   *
         ST    5,88(13)
         MVC   92(4,13),24(3)
         LA    1,88(,13)
         L     15,=V(EXTEND@V)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         MVC   96(4,13),32(5)
         MVC   100(4,13),36(5)
         MVC   104(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(LI@AMS)
         BALR  14,15
         B     @@L1720
@@L1717  EQU   *
         MVC   88(4,13),16(5)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    2,92(13)
         MVC   96(4,13),0(5)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@32)
         BALR  14,15
         B     @@L1716
@@L1733  EQU   *
         MVC   88(4,13),0(5)
         MVC   92(4,13),20(5)
         MVC   96(4,13),4(5)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         B     @@L1716
@@L1732  EQU   *
         L     2,12(5)
         LTR   2,2
         BNE   @@L1699
         ST    3,88(13)
@@L1727  EQU   *
         ST    2,92(13)
@@L1726  EQU   *
         LA    1,88(,13)
         L     15,=V(MARK@REG)
         BALR  14,15
         B     @@L1699
@@L1731  EQU   *
         L     4,36(5)
         L     2,0(4)
         N     2,=F'-65535'
         L     15,=F'3997697'
         CLR   2,15
         BNE   @@L1707
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,40(2)
         L     2,4(4)
         SLR   4,4
         IC    4,0(2,3)
         LTR   4,4
         BE    @@L1709
         L     3,32(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L1737
@@L1709  EQU   *
         SLR   4,4
@@L1708  EQU   *
         MVC   88(4,13),4(5)
         ST    4,92(13)
         B     @@L1726
@@L1737  EQU   *
         LR    2,4
         SRL   2,3
         L     6,4(3)
         CLR   2,6
         BH    @@L1712
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L1710
         SRDL  6,32
         DR    6,2
@@L1712  EQU   *
         LTR   6,6
         BE    @@L1708
         B     @@L1709
@@L1710  EQU   *
         SLR   6,6
         B     @@L1712
@@L1730  EQU   *
         L     4,8(5)
         L     2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    @@L1700
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,40(2)
         L     2,4(4)
         SLR   4,4
         IC    4,0(2,3)
         LTR   4,4
         BE    @@L1709
         L     3,36(5)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1709
         LR    2,4
         SRL   2,3
         L     8,4(3)
         CLR   2,8
         BH    @@L1705
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L1703
         SRDL  8,32
         DR    8,2
@@L1705  EQU   *
         LTR   8,8
         BE    @@L1708
         B     @@L1709
@@L1703  EQU   *
         SLR   8,8
         B     @@L1705
@@L1729  EQU   *
         L     2,12(5)
         LA    4,1(0,0)
         CLR   2,4
         BNE   @@L1698
         L     2,16(5)
         L     2,0(2)
         NR    2,4
         LTR   2,2
         BE    @@L1698
         ST    3,88(13)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,16(5)
         L     4,40(2)
         L     2,4(3)
         SLR   15,15
         IC    15,0(2,4)
         LR    2,15
         B     @@L1727
@@L1728  EQU   *
         MVC   88(4,13),4(5)
         L     2,72(5)
         MVC   92(4,13),16(2)
         L     2,72(5)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(RPLRTX)
         BALR  14,15
         ST    15,4(5)
         B     @@L1697
@@L1725  EQU   *
* Function loop_givs_rescan epilogue
         PDPEPIL
* Function loop_givs_rescan literal pool
         DS    0F
         LTORG
* Function loop_givs_rescan page table
         DS    0F
@@PGT48  EQU   *
         DC    A(@@PG48)
         DS    0F
* S-func loop_giv_reduce_benefit prologue
@@63     PDPPRLG CINDEX=49,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN49
         LTORG
@@FEN49  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG49   EQU   *
         LR    11,1
         L     10,=A(@@PGT49)
* Function loop_giv_reduce_benefit code
         SLR   6,6
         SLR   7,7
         L     8,4(11)
         L     5,8(11)
         L     2,12(11)
         L     4,40(5)
         MVC   2(1,2),27(5)
         L     3,8(8)
         MVC   88(4,13),36(3)
         MVC   92(4,13),32(5)
         ST    2,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@64)
         BALR  14,15
         L     2,52(5)
         SRL   2,31
         LTR   2,2
         BNE   @@L1739
         L     2,48(8)
         SRL   2,30
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1739
         L     2,16(5)
         L     2,0(2)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BE    @@L1739
         L     2,=A(@@1)
         S     4,0(2)
@@L1739  EQU   *
         L     7,4(8)
         MR    6,15
         SR    4,7
         LR    15,4
* Function loop_giv_reduce_benefit epilogue
         PDPEPIL
* Function loop_giv_reduce_benefit literal pool
         DS    0F
         LTORG
* Function loop_giv_reduce_benefit page table
         DS    0F
@@PGT49  EQU   *
         DC    A(@@PG49)
         DS    0F
* S-func loop_ivs_free prologue
@@65     PDPPRLG CINDEX=50,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN50
         LTORG
@@FEN50  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG50   EQU   *
         LR    11,1
         L     10,=A(@@PGT50)
* Function loop_ivs_free code
         L     2,0(11)
         L     2,88(2)
         A     2,=F'136'
         L     4,8(2)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LTR   4,4
         BE    @@L1756
@@L1754  EQU   *
         L     5,36(4)
         L     2,8(4)
         LTR   2,2
         BE    @@L1758
@@L1748  EQU   *
         L     3,68(2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    2,3
         LTR   3,3
         BNE   @@L1748
@@L1758  EQU   *
         L     2,16(4)
         LTR   2,2
         BE    @@L1760
@@L1753  EQU   *
         L     3,68(2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    2,3
         LTR   3,3
         BNE   @@L1753
@@L1760  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    4,5
         LTR   5,5
         BNE   @@L1754
@@L1756  EQU   *
* Function loop_ivs_free epilogue
         PDPEPIL
* Function loop_ivs_free literal pool
         DS    0F
         LTORG
* Function loop_ivs_free page table
         DS    0F
@@PGT50  EQU   *
         DC    A(@@PG50)
@@LC51   EQU   *
         DC    C'Reg %d: biv eliminated'
         DC    X'15'
         DC    X'0'
@@LC49   EQU   *
         DC    C'giv of insn %d not worth while, %d vs %d.'
         DC    X'15'
         DC    X'0'
@@LC50   EQU   *
         DC    C'giv of insn %d: would need a multiply.'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func strength_reduce prologue
@@26     PDPPRLG CINDEX=51,FRAME=200,BASER=12,ENTRY=NO
         B     @@FEN51
         LTORG
@@FEN51  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG51   EQU   *
         LR    11,1
         L     10,=A(@@PGT51)
* Function strength_reduce code
         SLR   2,2
         SLR   3,3
         ST    2,144(13)
         ST    3,4+144(13)
         ST    2,152(13)
         ST    3,4+152(13)
         ST    2,160(13)
         ST    3,4+160(13)
         ST    2,168(13)
         ST    3,4+168(13)
         ST    2,176(13)
         ST    3,4+176(13)
         ST    2,184(13)
         ST    3,4+184(13)
         ST    2,192(13)
         ST    3,4+192(13)
         L     7,0(11)
         MVC   112(4,13),88(7)
         L     3,112(13)
         A     3,=F'120'
         ST    3,116(13)
         L     4,112(13)
         A     4,=F'136'
         L     2,=V(N@NON@FI)
         L     3,0(2)
         A     3,=F'3'
         L     5,112(13)
         L     2,0(5)
         ST    3,120(13)
         A     3,=F'-3'
         LTR   2,2
         BNE   @@L1763
         MH    3,=H'2'
         A     3,=F'6'
         ST    3,120(13)
@@L1763  EQU   *
         MVC   124(4,13),=F'0'
         MVC   132(4,13),124(13)
         L     2,=V(WORD@MOD)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'25'
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
         ST    15,136(13)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@13)
         BALR  14,15
         ST    15,140(13)
         MVC   88(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         L     2,=A(@@66)
         ST    15,0(2)
         L     2,=A(MXRGBL)
         MVC   4(4,4),0(2)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,0(4)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@47)
         BALR  14,15
         L     2,8(4)
         LTR   2,2
         BNE   @@L1764
         NC    4(4,11),=F'1'
         L     2,4(11)
         LTR   2,2
         BNE   @@L1828
@@L1765  EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@65)
         BALR  14,15
         L     14,=A(@@L1761)
         BR    14
@@L1828  EQU   *
         ST    7,88(13)
         MVC   92(4,13),140(13)
         MVC   96(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(UNROLL@L)
         BALR  14,15
         B     @@L1765
@@L1764  EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@49)
         BALR  14,15
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@53)
         BALR  14,15
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@54)
         BALR  14,15
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(LOOP@ITE)
         BALR  14,15
         L     2,4(11)
         N     2,=F'4'
         LTR   2,2
         BE    @@L1766
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@45)
         BALR  14,15
@@L1766  EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@55)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),140(13)
         LA    1,88(,13)
         L     15,=A(@@67)
         BALR  14,15
         MVC   128(4,13),4(4)
         MVC   88(4,13),128(13)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,124(13)
         L     5,8(4)
         LTR   5,5
         BE    @@L1820
@@L1799  EQU   *
         ST    7,88(13)
         ST    5,92(13)
         MVC   96(4,13),120(13)
         MVC   100(4,13),140(13)
         LA    1,88(,13)
         L     15,=A(@@57)
         BALR  14,15
         N     15,=F'1'
         SLL   15,30
         L     2,48(5)
         N     2,=F'-1073741825'
         OR    2,15
         O     2,=F'134217728'
         ST    2,48(5)
         ST    5,88(13)
         MVC   92(4,13),112(13)
         LA    1,88(,13)
         L     15,=A(@@68)
         BALR  14,15
         MVC   88(4,13),116(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@69)
         BALR  14,15
         L     4,16(5)
         LTR   4,4
         BE    @@L1822
@@L1787  EQU   *
         L     2,52(4)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1773
         L     2,72(4)
         LTR   2,2
         L     14,=A(@@L1829)
         BER   14
@@L1773  EQU   *
         L     12,0(,10)
         L     4,68(4)
         LTR   4,4
         BNE   @@L1787
@@L1822  EQU   *
         ST    7,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@60)
         BALR  14,15
         ST    7,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@59)
         BALR  14,15
         ST    7,88(13)
         ST    5,92(13)
         MVC   96(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@61)
         BALR  14,15
         L     4,16(5)
         LTR   4,4
         BE    @@L1825
@@L1793  EQU   *
         IC    2,52(4)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1790
         L     2,72(4)
         LTR   2,2
         BE    @@L1790
         NC    52(4,2),=F'-16777217'
@@L1790  EQU   *
         L     4,68(4)
         LTR   4,4
         BNE   @@L1793
@@L1825  EQU   *
         L     2,48(5)
         N     2,=F'1207959552'
         L     3,=F'1207959552'
         CLR   2,3
         BE    @@L1830
@@L1794  EQU   *
         L     2,32(5)
         LTR   2,2
         BE    @@L1769
         L     2,48(5)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BE    @@L1831
@@L1769  EQU   *
         L     5,36(5)
         LTR   5,5
         BNE   @@L1799
@@L1820  EQU   *
         L     3,104(7)
         CL    3,108(7)
         BE    @@L1827
@@L1805  EQU   *
         LH    2,0(3)
         AH    2,=H'-32'
         CLM   2,3,=H'2'
         BNH   @@L1832
@@L1802  EQU   *
         L     3,12(3)
         CL    3,108(7)
         BNE   @@L1805
@@L1827  EQU   *
         L     4,112(13)
         L     3,64(4)
         LTR   3,3
         BE    @@L1806
         L     5,140(13)
         A     5,=F'-3'
         ST    5,140(13)
         ST    3,180(13)
         L     4,176(13)
         L     5,4+176(13)
         M     4,140(13)
         ST    4,176(13)
         ST    5,4+176(13)
         L     5,140(13)
         A     5,=F'3'
         ST    5,140(13)
         L     2,180(13)
         BCTR  2,0
         ST    2,132(13)
         LTR   2,2
         BL    @@L1833
@@L1806  EQU   *
         L     2,4(11)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1809
         L     2,4(11)
         N     2,=F'8'
         LTR   2,2
         BNE   @@L1808
         LTR   3,3
         BE    @@L1808
         L     3,132(13)
         C     3,140(13)
         BH    @@L1808
@@L1809  EQU   *
         ST    7,88(13)
         MVC   92(4,13),140(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(UNROLL@L)
         BALR  14,15
@@L1808  EQU   *
         NC    4(4,11),=F'2'
         L     4,4(11)
         LTR   4,4
         BE    @@L1810
         L     5,112(13)
         L     3,64(5)
         L     2,68(5)
         LR    8,3
         SLR   9,9
         CLR   2,3
         BH    @@L1813
         LTR   2,2
         BL    @@L1812
         LA    4,1(0,0)
         CLR   2,4
         BE    @@L1811
         SRDL  8,32
         DR    8,2
@@L1813  EQU   *
         LA    5,1(0,0)
         CLR   9,5
         BNH   @@L1810
         ST    3,184(13)
         MVC   188(4,13),=F'0'
         CLR   2,3
         BH    @@L1816
         LTR   2,2
         BL    @@L1815
         CLR   2,5
         BE    @@L1814
         L     4,184(13)
         L     5,4+184(13)
         SRDL  4,32
         DR    4,2
         ST    4,184(13)
         ST    5,4+184(13)
@@L1816  EQU   *
         L     2,108(7)
         MVC   88(4,13),8(2)
         MVC   92(4,13),=F'5'
         MVC   192(4,13),=F'0'
         MVC   196(4,13),=F'10000'
         L     2,192(13)
         L     3,4+192(13)
         D     2,188(13)
         ST    2,192(13)
         ST    3,4+192(13)
         L     2,=F'10000'
         SR    2,3
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(PREDINSN)
         BALR  14,15
@@L1810  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L1834
@@L1817  EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(@@65)
         BALR  14,15
         L     3,124(13)
         LTR   3,3
         BE    @@L1761
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     @@L1761
@@L1834  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC19)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1817
@@L1814  EQU   *
         MVC   188(4,13),184(13)
         B     @@L1816
@@L1815  EQU   *
         MVC   188(4,13),=F'1'
         B     @@L1816
@@L1811  EQU   *
         LR    9,3
         B     @@L1813
@@L1812  EQU   *
         LA    9,1(0,0)
         B     @@L1813
@@L1833  EQU   *
         MVC   132(4,13),=F'0'
         B     @@L1806
@@L1832  EQU   *
         MVC   88(4,13),16(3)
         MVC   92(4,13),124(13)
         MVC   96(4,13),128(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(RREGS)
         BALR  14,15
         MVC   88(4,13),28(3)
         MVC   92(4,13),124(13)
         MVC   96(4,13),128(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(RREGS)
         BALR  14,15
         MVC   20(4,3),=F'-1'
         B     @@L1802
@@L1831  EQU   *
         L     2,8(5)
         MVC   88(4,13),16(2)
         MVC   92(4,13),32(5)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(LI@SINK)
         BALR  14,15
         B     @@L1769
@@L1830  EQU   *
         ST    7,88(13)
         ST    5,92(13)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),120(13)
         MVC   104(4,13),140(13)
         LA    1,88(,13)
         L     15,=A(@@58)
         BALR  14,15
         LTR   15,15
         BE    @@L1794
         L     2,32(5)
         LTR   2,2
         BE    @@L1795
         L     2,48(5)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BE    @@L1835
@@L1795  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L1769
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC51)
         MVC   96(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1769
@@L1835  EQU   *
         L     2,8(5)
         MVC   88(4,13),16(2)
         MVC   92(4,13),32(5)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@62)
         BALR  14,15
         B     @@L1795
@@L1829  EQU   *
         ST    7,88(13)
         ST    5,92(13)
         ST    4,96(13)
         MVC   100(4,13),136(13)
         LA    1,88(,13)
         L     15,=A(@@63)
         BALR  14,15
         L     2,=V(FLAG@RED)
         L     2,0(2)
         LTR   2,2
         BNE   @@L1777
         MVC   148(4,13),120(13)
         L     2,144(13)
         L     3,4+144(13)
         M     2,56(4)
         ST    2,144(13)
         ST    3,4+144(13)
         ST    15,156(13)
         L     2,152(13)
         L     3,4+152(13)
         M     2,148(13)
         ST    2,152(13)
         ST    3,4+152(13)
         L     2,140(13)
         CR    2,3
         BNH   @@L1777
         L     2,48(5)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1777
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L1836
@@L1785  EQU   *
         OC    52(4,4),=F'536870912'
         NC    48(4,5),=F'-134217729'
         B     @@L1773
@@L1836  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC49)
         L     2,0(4)
         MVC   96(4,13),4(2)
         MVC   164(4,13),120(13)
         L     2,160(13)
         L     3,4+160(13)
         M     2,56(4)
         ST    2,160(13)
         ST    3,4+160(13)
         ST    15,172(13)
         L     2,168(13)
         L     3,4+168(13)
         M     2,164(13)
         ST    2,168(13)
         ST    3,4+168(13)
         MVC   100(4,13),172(13)
         MVC   104(4,13),140(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1785
@@L1777  EQU   *
         L     6,8(5)
         LTR   6,6
         BE    @@L1773
@@L1786  EQU   *
         L     3,32(6)
         L     2,=V(CIRTX)
         CL    3,260(2)
         BE    @@L1837
@@L1782  EQU   *
         L     6,68(6)
         LTR   6,6
         BNE   @@L1786
         B     @@L1773
@@L1837  EQU   *
         MVC   88(4,13),36(6)
         MVC   92(4,13),32(4)
         LA    1,88(,13)
         L     15,=A(@@70)
         BALR  14,15
         LTR   15,15
         BNE   @@L1782
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L1785
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC50)
         L     2,0(4)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1785
@@L1761  EQU   *
* Function strength_reduce epilogue
         PDPEPIL
* Function strength_reduce literal pool
         DS    0F
         LTORG
* Function strength_reduce page table
         DS    0F
@@PGT51  EQU   *
         DC    A(@@PG51)
         DS    0F
* S-func check_insn_for_bivs prologue
@@48     PDPPRLG CINDEX=52,FRAME=144,BASER=12,ENTRY=NO
         B     @@FEN52
         LTORG
@@FEN52  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG52   EQU   *
         LR    11,1
         L     10,=A(@@PGT52)
* Function check_insn_for_bivs code
         L     7,0(11)
         L     5,4(11)
         L     6,88(7)
         A     6,=F'136'
         LH    2,0(5)
         CLM   2,3,=H'32'
         BNE   @@L1839
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L1848
         SLR   15,15
@@L1841  EQU   *
         LTR   15,15
         BE    @@L1839
         L     4,4(15)
         LH    2,0(4)
         CLM   2,3,=H'61'
         BNE   @@L1839
         L     3,4(4)
         L     2,=A(MXRGBL)
         CL    3,0(2)
         BNL   @@L1839
         LA    2,19(0,0)
         CLR   3,2
         BNH   @@L1839
         L     2,0(6)
         MH    3,=H'8'
         L     2,0(3,2)
         LA    3,2(0,0)
         CLR   2,3
         BE    @@L1839
         ST    7,88(13)
         MVC   92(4,13),8(15)
         L     2,8(15)
         SLR   3,3
         IC    3,2(2)
         ST    3,96(13)
         ST    4,100(13)
         ST    5,104(13)
         LA    2,128(,13)
         ST    2,108(13)
         LA    2,132(,13)
         ST    2,112(13)
         LA    2,136(,13)
         ST    2,116(13)
         LA    1,88(,13)
         L     15,=A(@@71)
         BALR  14,15
         LTR   15,15
         BNE   @@L1849
         L     15,4(4)
         CL    15,4(6)
         BNL   @@L1839
         L     2,0(6)
         MH    15,=H'8'
         LA    3,2(0,0)
         ST    3,0(15,2)
         B     @@L1839
@@L1849  EQU   *
         MVC   88(4,13),=F'88'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    7,88(13)
         ST    15,92(13)
         ST    5,96(13)
         ST    4,100(13)
         MVC   104(4,13),128(13)
         MVC   108(4,13),132(13)
         MVC   112(4,13),136(13)
         MVC   116(4,13),8(11)
         MVC   120(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@72)
         BALR  14,15
         L     3,0(6)
         L     2,4(4)
         SLL   2,3
         LA    4,1(0,0)
         ST    4,0(2,3)
         B     @@L1839
@@L1848  EQU   *
         L     3,16(5)
         LH    2,0(3)
         LR    15,3
         CLM   2,3,=H'47'
         BE    @@L1841
         ST    5,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         B     @@L1841
@@L1839  EQU   *
         LR    15,5
* Function check_insn_for_bivs epilogue
         PDPEPIL
* Function check_insn_for_bivs literal pool
         DS    0F
         LTORG
* Function check_insn_for_bivs page table
         DS    0F
@@PGT52  EQU   *
         DC    A(@@PG52)
         DS    0F
* S-func check_insn_for_givs prologue
@@46     PDPPRLG CINDEX=53,FRAME=176,BASER=12,ENTRY=NO
         B     @@FEN53
         LTORG
@@FEN53  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG53   EQU   *
         LR    11,1
         L     10,=A(@@PGT53)
* Function check_insn_for_givs code
         L     9,0(11)
         L     4,4(11)
         L     2,88(9)
         A     2,=F'120'
         ST    2,168(13)
         LH    2,0(4)
         CLM   2,3,=H'32'
         BE    @@L1865
@@L1851  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'32'
         BE    @@L1866
@@L1862  EQU   *
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-32'
         CLM   2,3,=H'1'
         BNH   @@L1864
         CLM   3,3,=H'36'
         BNE   @@L1850
@@L1864  EQU   *
         ST    9,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@77)
         BALR  14,15
         B     @@L1850
@@L1866  EQU   *
         ST    9,88(13)
         MVC   92(4,13),16(4)
         ST    4,96(13)
         MVC   100(4,13),8(11)
         MVC   104(4,13),12(11)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         B     @@L1862
@@L1865  EQU   *
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L1867
         SLR   15,15
@@L1853  EQU   *
         LTR   15,15
         BE    @@L1851
         L     6,4(15)
         LH    2,0(6)
         CLM   2,3,=H'61'
         BNE   @@L1851
         L     5,4(6)
         L     3,168(13)
         L     2,8(3)
         LR    3,5
         MH    3,=H'16'
         IC    2,12(3,2)
         CLM   2,1,=XL1'00'
         BNE   @@L1851
         SLR   3,3
         LA    2,19(0,0)
         CLR   5,2
         BNH   @@L1850
         ST    9,88(13)
         MVC   92(4,13),8(15)
         LA    15,144(,13)
         ST    15,96(13)
         LA    2,148(,13)
         ST    2,100(13)
         LA    8,152(,13)
         ST    8,104(13)
         LA    7,156(,13)
         ST    7,108(13)
         ST    3,112(13)
         LA    5,160(,13)
         ST    5,116(13)
         ST    3,120(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L1868
@@L1858  EQU   *
         L     3,4(6)
         L     2,=A(MXRGBL)
         CL    3,0(2)
         BNL   @@L1851
         L     5,144(13)
         CLR   6,5
         BE    @@L1851
         L     15,168(13)
         L     2,8(15)
         MH    3,=H'16'
         L     2,4(3,2)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L1859
         ST    9,88(13)
         MVC   92(4,13),160(13)
         ST    4,96(13)
         ST    5,100(13)
         ST    6,104(13)
         LA    15,148(,13)
         ST    15,108(13)
         ST    8,112(13)
         ST    7,116(13)
         LA    2,164(,13)
         ST    2,120(13)
         LA    1,88(,13)
         L     15,=A(@@74)
         BALR  14,15
         ST    15,160(13)
         LTR   15,15
         BE    @@L1851
@@L1859  EQU   *
         MVC   88(4,13),=F'88'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    5,15
         ST    4,88(13)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1869
@@L1860  EQU   *
         L     3,168(13)
         L     2,8(3)
         L     3,4(6)
         SLL   3,4
         L     2,4(3,2)
         LA    15,1(0,0)
         CLR   2,15
         BE    @@L1861
         L     4,164(13)
@@L1861  EQU   *
         ST    9,88(13)
         ST    5,92(13)
         ST    4,96(13)
         MVC   100(4,13),144(13)
         ST    6,104(13)
         MVC   108(4,13),152(13)
         MVC   112(4,13),148(13)
         MVC   116(4,13),156(13)
         MVC   120(4,13),160(13)
         MVC   124(4,13),=F'1'
         MVC   128(4,13),8(11)
         MVC   132(4,13),12(11)
         MVC   136(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         B     @@L1851
@@L1869  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@17)
         BALR  14,15
         A     15,160(13)
         ST    15,160(13)
         B     @@L1860
@@L1868  EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L1851
         ST    9,88(13)
         MVC   92(4,13),4(15)
         LA    3,144(,13)
         ST    3,96(13)
         LA    15,148(,13)
         ST    15,100(13)
         ST    8,104(13)
         ST    7,108(13)
         ST    2,112(13)
         ST    5,116(13)
         ST    2,120(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LTR   15,15
         BE    @@L1851
         B     @@L1858
@@L1867  EQU   *
         L     2,16(4)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'47'
         BE    @@L1853
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         B     @@L1853
@@L1850  EQU   *
         LR    15,4
* Function check_insn_for_givs epilogue
         PDPEPIL
* Function check_insn_for_givs literal pool
         DS    0F
         LTORG
* Function check_insn_for_givs page table
         DS    0F
@@PGT53  EQU   *
         DC    A(@@PG53)
         DS    0F
* S-func valid_initial_value_p prologue
@@52     PDPPRLG CINDEX=54,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN54
         LTORG
@@FEN54  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG54   EQU   *
         LR    11,1
         L     10,=A(@@PGT54)
* Function valid_initial_value_p code
         L     3,0(11)
         LH    15,0(3)
         LR    2,15
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1872
         CLM   15,3,=H'54'
         BE    @@L1872
         CLM   15,3,=H'55'
         BE    @@L1872
         CLM   15,3,=H'58'
         BE    @@L1872
         CLM   15,3,=H'134'
         BE    @@L1872
         CLM   15,3,=H'56'
         BE    @@L1872
         CLM   15,3,=H'140'
         BE    @@L1872
         CLM   15,3,=H'61'
         BE    @@L1877
@@L1874  EQU   *
         SLR   15,15
         B     @@L1870
@@L1877  EQU   *
         L     15,4(3)
         L     2,=A(MXRGBL)
         CL    15,0(2)
         BNL   @@L1874
         LA    2,19(0,0)
         CLR   15,2
         BH    @@L1875
         L     2,=V(CUSDREGS)
         IC    2,0(2,15)
         CLM   2,1,=XL1'00'
         BE    @@L1875
         SLR   15,15
         L     2,8(11)
         LTR   2,2
         BNE   @@L1870
@@L1875  EQU   *
         ST    3,88(13)
         MVC   92(4,13),4(11)
         MVC   96(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(REGSTBP)
         BALR  14,15
         LPR   15,15
         BCTR  15,0
         SRL   15,31
         B     @@L1870
@@L1872  EQU   *
         LA    15,1(0,0)
@@L1870  EQU   *
* Function valid_initial_value_p epilogue
         PDPEPIL
* Function valid_initial_value_p literal pool
         DS    0F
         LTORG
* Function valid_initial_value_p page table
         DS    0F
@@PGT54  EQU   *
         DC    A(@@PG54)
         DS    0F
* S-func find_mem_givs prologue
@@76     PDPPRLG CINDEX=55,FRAME=168,BASER=12,ENTRY=NO
         B     @@FEN55
         LTORG
@@FEN55  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG55   EQU   *
         LR    11,1
         L     10,=A(@@PGT55)
* Function find_mem_givs code
         L     7,4(11)
         LTR   7,7
         BE    @@L1878
         L     5,0(7)
         LR    4,5
         SRL   4,16
         LR    3,4
         A     3,=F'-44'
         LA    2,25(0,0)
         CLR   3,2
         BH    @@L1880
         MH    3,=H'4'
         L     2,=A(@@L1896)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L1896  EQU   *
         DC    A(@@L1878)
         DC    A(@@L1878)
         DC    A(@@L1880)
         DC    A(@@L1880)
         DC    A(@@L1878)
         DC    A(@@L1878)
         DC    A(@@L1880)
         DC    A(@@L1880)
         DC    A(@@L1880)
         DC    A(@@L1880)
         DC    A(@@L1878)
         DC    A(@@L1878)
         DC    A(@@L1880)
         DC    A(@@L1880)
         DC    A(@@L1878)
         DC    A(@@L1878)
         DC    A(@@L1880)
         DC    A(@@L1878)
         DC    A(@@L1880)
         DC    A(@@L1880)
         DC    A(@@L1880)
         DC    A(@@L1880)
         DC    A(@@L1893)
         DC    A(@@L1878)
         DC    A(@@L1878)
         DC    A(@@L1878)
@@L1893  EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(7)
         LA    2,144(,13)
         ST    2,96(13)
         LA    2,148(,13)
         ST    2,100(13)
         LA    2,152(,13)
         ST    2,104(13)
         LA    2,156(,13)
         ST    2,108(13)
         MVC   112(4,13),=F'1'
         LA    2,160(,13)
         ST    2,116(13)
         SRL   5,8
         N     5,=F'255'
         ST    5,120(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LTR   15,15
         BE    @@L1878
         MVC   88(4,13),=F'88'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),144(13)
         L     2,=A(@@66)
         MVC   104(4,13),0(2)
         MVC   108(4,13),152(13)
         MVC   112(4,13),148(13)
         MVC   116(4,13),156(13)
         MVC   120(4,13),160(13)
         MVC   124(4,13),=F'0'
         MVC   128(4,13),12(11)
         MVC   132(4,13),16(11)
         A     7,=F'4'
         ST    7,136(13)
         A     7,=F'-4'
         LA    1,88(,13)
         L     15,=A(@@75)
         BALR  14,15
         ST    7,28(3)
         B     @@L1878
@@L1880  EQU   *
         LR    2,4
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     3,0(2,3)
         ST    3,164(13)
         L     2,=V(RTX@LENG)
         SLR   5,5
         IC    5,0(2,4)
         BCTR  5,0
         LTR   5,5
         BL    @@L1878
         LR    6,5
         MH    6,=H'4'
         AR    6,7
         A     6,=F'4'
@@L1910  EQU   *
         L     3,164(13)
         IC    2,0(5,3)
         CLM   2,1,=XL1'85'
         BE    @@L1913
         SLL   2,24
         SRA   2,24
         C     2,=F'-59'
         BE    @@L1914
@@L1899  EQU   *
         A     6,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L1910
         B     @@L1878
@@L1914  EQU   *
         SLR   8,8
         LR    9,5
         MH    9,=H'4'
         L     2,4(7,9)
         C     8,0(2)
         BNL   @@L1899
@@L1909  EQU   *
         MVC   88(4,13),0(11)
         LR    4,9
         AR    4,7
         A     4,=F'4'
         L     3,0(4)
         LR    2,8
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         A     8,=F'1'
         L     2,0(4)
         C     8,0(2)
         BL    @@L1909
         B     @@L1899
@@L1913  EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(6)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         MVC   104(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@76)
         BALR  14,15
         B     @@L1899
@@L1878  EQU   *
* Function find_mem_givs epilogue
         PDPEPIL
* Function find_mem_givs literal pool
         DS    0F
         LTORG
* Function find_mem_givs page table
         DS    0F
@@PGT55  EQU   *
         DC    A(@@PG55)
         DS    0F
* S-func record_biv prologue
@@72     PDPPRLG CINDEX=56,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN56
         LTORG
@@FEN56  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG56   EQU   *
         LR    11,1
         L     10,=A(@@PGT56)
* Function record_biv code
         L     6,4(11)
         L     7,12(11)
         L     9,20(11)
         L     5,32(11)
         L     2,0(11)
         L     8,88(2)
         A     8,=F'136'
         MVC   0(4,6),8(11)
         ST    7,8(6)
         ST    7,16(6)
         ST    9,32(6)
         MVC   36(4,6),16(11)
         MVC   64(4,6),=F'0'
         MVC   20(4,6),24(11)
         SLR   2,2
         IC    2,2(7)
         ST    2,24(6)
         L     3,28(11)
         LPR   2,3
         BCTR  2,0
         SRL   2,31
         L     3,52(6)
         N     3,=F'-402653185'
         LR    4,2
         SLL   4,27
         SLL   2,28
         OR    3,2
         OR    3,4
         N     5,=F'1'
         SLL   5,26
         N     3,=F'-67108865'
         OR    3,5
         ST    3,52(6)
         L     3,0(8)
         L     2,4(7)
         SLL   2,3
         L     15,4(2,3)
         LTR   15,15
         BE    @@L1921
@@L1918  EQU   *
         MVC   68(4,6),8(15)
         ST    6,8(15)
         L     2,4(15)
         A     2,=F'1'
         ST    2,4(15)
         L     2,=V(CIRTX)
         CL    9,260(2)
         BE    @@L1922
@@L1919  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L1915
         ST    6,88(13)
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
         B     @@L1915
@@L1922  EQU   *
         OC    48(4,15),=F'-2147483648'
         B     @@L1919
@@L1921  EQU   *
         MVC   88(4,13),=F'52'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         MVC   0(4,15),4(7)
         MVC   8(4,15),=F'0'
         MVC   16(4,15),=F'0'
         MVC   4(4,15),=F'0'
         MVC   12(4,15),=F'0'
         ST    7,24(15)
         MVC   32(4,15),=F'0'
         MVC   40(4,15),=F'0'
         MVC   44(4,15),=F'0'
         MVC   28(4,15),=F'0'
         NC    48(4,15),=F'268435455'
         MVC   20(4,15),=F'0'
         MVC   36(4,15),8(8)
         ST    15,8(8)
         L     3,0(8)
         L     2,4(7)
         SLL   2,3
         ST    15,4(2,3)
         B     @@L1918
@@L1915  EQU   *
* Function record_biv epilogue
         PDPEPIL
* Function record_biv literal pool
         DS    0F
         LTORG
* Function record_biv page table
         DS    0F
@@PGT56  EQU   *
         DC    A(@@PG56)
         DS    0F
* S-func record_giv prologue
@@75     PDPPRLG CINDEX=57,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN57
         LTORG
@@FEN57  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG57   EQU   *
         LR    11,1
         L     10,=A(@@PGT57)
* Function record_giv code
         L     6,4(11)
         L     9,16(11)
         L     8,32(11)
         L     4,44(11)
         L     2,0(11)
         L     7,88(2)
         A     7,=F'136'
         L     3,8(11)
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L1984
         SLR   5,5
@@L1925  EQU   *
         L     12,0(,10)
         MVC   88(4,13),24(11)
         LA    1,88(,13)
         L     15,=V(SFYRTX)
         BALR  14,15
         LTR   15,15
         BE    @@L1928
         L     3,24(11)
         LH    2,0(3)
         CLM   2,3,=H'78'
         BE    @@L1985
@@L1929  EQU   *
         ST    15,24(11)
@@L1928  EQU   *
         MVC   0(4,6),8(11)
         MVC   8(4,6),12(11)
         MVC   12(4,6),36(11)
         ST    9,16(6)
         MVC   32(4,6),20(11)
         MVC   36(4,6),24(11)
         MVC   64(4,6),28(11)
         ST    8,40(6)
         MVC   20(4,6),48(11)
         L     3,52(6)
         MVC   48(4,6),=F'0'
         N     4,=F'1'
         SLL   4,26
         N     3,=F'-100663297'
         OR    3,4
         MVC   60(4,6),=F'0'
         MVC   72(4,6),=F'0'
         MVC   4(4,6),=F'0'
         MVC   44(4,6),=F'0'
         MVC   80(4,6),=F'0'
         LR    2,3
         N     2,=F'-568328193'
         ST    2,52(6)
         L     4,36(11)
         LTR   4,4
         BNE   @@L1930
         O     2,=F'268435456'
         ST    2,52(6)
@@L1931  EQU   *
         L     3,40(11)
         LPR   2,3
         BCTR  2,0
         SRL   2,31
         SLL   2,27
         L     15,52(6)
         N     15,=F'-134217729'
         OR    15,2
         ST    15,52(6)
         L     4,36(11)
         LTR   4,4
         BNE   @@L1934
         L     3,48(11)
         L     2,0(3)
         SLR   4,4
         IC    4,2(2)
         ST    4,24(6)
         MVC   56(4,6),=F'1'
@@L1935  EQU   *
         L     3,0(7)
         L     4,12(11)
         L     2,4(4)
         SLL   2,3
         L     7,4(2,3)
         LTR   7,7
         BE    @@L1937
         MVC   68(4,6),16(7)
         ST    6,16(7)
         L     3,36(11)
         LA    2,1(0,0)
         CLR   3,2
         BE    @@L1986
@@L1938  EQU   *
         A     8,20(7)
         ST    8,20(7)
@@L1939  EQU   *
         L     4,36(11)
         LTR   4,4
         BNE   @@L1940
         OC    52(4,6),=F'-2147483648'
@@L1941  EQU   *
         L     4,24(11)
         OC    52(4,6),=F'1048576'
         L     2,=V(CIRTX)
         CL    4,256(2)
         BE    @@L1966
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1968
         CLM   3,3,=H'54'
         BE    @@L1968
         CLM   3,3,=H'55'
         BE    @@L1968
         CLM   3,3,=H'58'
         BE    @@L1968
         CLM   3,3,=H'134'
         BE    @@L1968
         CLM   3,3,=H'56'
         BE    @@L1968
         CLM   3,3,=H'140'
         BE    @@L1968
@@L1966  EQU   *
         L     3,24(11)
         LH    2,0(3)
         CLM   2,3,=H'75'
         BE    @@L1977
@@L1969  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L1923
         ST    6,88(13)
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@80)
         BALR  14,15
         B     @@L1923
@@L1977  EQU   *
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'75'
         BE    @@L1987
         L     2,8(4)
         LH    3,0(2)
         LR    4,2
         CLM   3,3,=H'75'
         BE    @@L1977
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L1979
         CLM   3,3,=H'54'
         BE    @@L1979
         CLM   3,3,=H'55'
         BE    @@L1979
         CLM   3,3,=H'58'
         BE    @@L1979
         CLM   3,3,=H'134'
         BE    @@L1979
         CLM   3,3,=H'56'
         BE    @@L1979
         CLM   3,3,=H'140'
         BNE   @@L1969
@@L1979  EQU   *
         NC    52(4,6),=F'-1048577'
         B     @@L1969
@@L1987  EQU   *
         LR    4,3
         B     @@L1977
@@L1968  EQU   *
         NC    52(4,6),=F'-1048577'
         B     @@L1966
@@L1940  EQU   *
         L     2,4(9)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,0(3)
         L     4,8(11)
         CL    2,4(4)
         BE    @@L1988
@@L1942  EQU   *
         NC    52(4,6),=F'1073741823'
         B     @@L1941
@@L1988  EQU   *
         L     2,=A(UID@LUID)
         L     4,0(2)
         L     2,4(3)
         SLL   2,2
         L     5,0(2,4)
         L     3,0(11)
         L     2,108(3)
         L     3,4(2)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BNL   @@L1943
         MH    3,=H'4'
         C     5,0(3,4)
         BNL   @@L1942
@@L1944  EQU   *
         L     2,40(11)
         LTR   2,2
         BNE   @@L1989
@@L1945  EQU   *
         OC    52(4,6),=F'-2147483648'
         L     4,8(7)
         LTR   4,4
         BE    @@L1947
@@L1956  EQU   *
         L     2,0(4)
         L     5,4(2)
         L     2,=A(MAX@UID@)
         C     5,0(2)
         BNL   @@L1951
         L     2,4(9)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     15,16(2)
         L     2,=A(UID@LUID)
         L     3,0(2)
         L     2,0(15)
         SLL   2,2
         MH    5,=H'4'
         L     5,0(5,3)
         C     5,0(2,3)
         BL    @@L1948
         L     2,4(15)
         SLL   2,2
         C     5,0(2,3)
         BNH   @@L1951
@@L1948  EQU   *
         L     4,68(4)
         LTR   4,4
         BNE   @@L1956
@@L1947  EQU   *
         L     2,52(6)
         SRL   2,31
         LTR   2,2
         BE    @@L1941
         L     4,8(7)
         LTR   4,4
         BE    @@L1941
@@L1963  EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(BACK@BRA)
         BALR  14,15
         LTR   15,15
         BNE   @@L1983
         L     4,68(4)
         LTR   4,4
         BNE   @@L1963
         B     @@L1941
@@L1983  EQU   *
         L     2,52(6)
         N     2,=F'2147483647'
         O     2,=F'1073741824'
         ST    2,52(6)
         B     @@L1941
@@L1951  EQU   *
         L     2,52(6)
         N     2,=F'2147483647'
         O     2,=F'1073741824'
         ST    2,52(6)
         B     @@L1947
@@L1989  EQU   *
         ST    9,88(13)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@79)
         BALR  14,15
         LTR   15,15
         BE    @@L1942
         B     @@L1945
@@L1943  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'5760'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     4,=F'-1'
         CR    5,4
         BNL   @@L1942
         B     @@L1944
@@L1986  EQU   *
         L     2,12(7)
         A     2,=F'1'
         ST    2,12(7)
         B     @@L1938
@@L1937  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'5741'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L1939
@@L1934  EQU   *
         L     2,4(5)
         SLR   3,3
         IC    3,2(2)
         ST    3,24(6)
         L     2,4(9)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     5,16(2)
         L     2,=A(UID@LUID)
         L     3,0(2)
         L     4,4(5)
         SLL   4,2
         L     2,0(5)
         SLL   2,2
         L     4,0(4,3)
         S     4,0(2,3)
         ST    4,56(6)
         BNE   @@L1936
         O     15,=F'536870912'
         ST    15,52(6)
@@L1936  EQU   *
         L     2,0(7)
         L     3,4(9)
         SLL   3,3
         LA    4,3(0,0)
         ST    4,0(3,2)
         L     3,4(9)
         SLL   3,0(4)
         ST    6,4(3,2)
         B     @@L1935
@@L1930  EQU   *
         L     4,40(11)
         LPR   2,4
         BCTR  2,0
         SRL   2,31
         SLL   2,28
         N     3,=F'-836763649'
         OR    3,2
         ST    3,52(6)
         B     @@L1931
@@L1985  EQU   *
         LH    2,0(15)
         CLM   2,3,=H'87'
         BNE   @@L1929
         B     @@L1928
@@L1984  EQU   *
         L     2,8(11)
         L     3,16(2)
         LH    2,0(3)
         LR    5,3
         CLM   2,3,=H'47'
         BE    @@L1925
         MVC   88(4,13),8(11)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    5,15
         B     @@L1925
@@L1923  EQU   *
* Function record_giv epilogue
         PDPEPIL
* Function record_giv literal pool
         DS    0F
         LTORG
* Function record_giv page table
         DS    0F
@@PGT57  EQU   *
         DC    A(@@PG57)
@@LC53   EQU   *
         DC    C'Insn %d: giv reg %d final_value replaceable'
         DC    X'15'
         DC    X'0'
@@LC52   EQU   *
         DC    C'Found branch outside giv lifetime.'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func check_final_value prologue
@@56     PDPPRLG CINDEX=58,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN58
         LTORG
@@FEN58  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG58   EQU   *
         LR    11,1
         L     10,=A(@@PGT58)
* Function check_final_value code
         L     5,0(11)
         L     4,4(11)
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(FINAL@GI)
         BALR  14,15
         LR    9,15
         LTR   15,15
         BE    @@L1991
         L     2,52(4)
         SRL   2,27
         N     2,=F'1'
         LTR   2,2
         BE    @@L2018
@@L1992  EQU   *
         SLR   7,7
         LR    6,7
         L     3,0(4)
         OC    52(4,4),=F'-2147483648'
@@L2017  EQU   *
         LR    8,3
@@L2003  EQU   *
         L     3,12(3)
         CL    3,108(5)
         BE    @@L2019
@@L1996  EQU   *
         CL    3,0(4)
         BE    @@L1994
         LH    2,0(3)
         AH    2,=H'-32'
         CLM   2,3,=H'2'
         BH    @@L2003
         LTR   6,6
         BE    @@L2020
@@L1999  EQU   *
         MVC   88(4,13),16(4)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L2003
         LTR   6,6
         BNE   @@L2002
         LTR   7,7
         BE    @@L2017
@@L2002  EQU   *
         L     2,52(4)
         N     2,=F'2147483647'
         O     2,=F'1073741824'
         ST    2,52(4)
@@L1994  EQU   *
         L     2,52(4)
         SRL   2,31
         LTR   2,2
         BE    @@L2004
         L     3,0(4)
@@L2014  EQU   *
         L     3,12(3)
         CL    3,108(5)
         BE    @@L2021
@@L2008  EQU   *
         CLR   3,8
         BE    @@L2004
         LH    2,0(3)
         CLM   2,3,=H'33'
         BNE   @@L2014
         L     15,32(3)
         LTR   15,15
         BE    @@L2014
         L     2,28(15)
         LTR   2,2
         BE    @@L2014
         ST    15,88(13)
         MVC   92(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(LI@FIRST)
         BALR  14,15
         LTR   15,15
         BE    @@L2012
         MVC   88(4,13),104(5)
         MVC   92(4,13),32(3)
         LA    1,88(,13)
         L     15,=V(LI@FIRST)
         BALR  14,15
         LTR   15,15
         BNE   @@L2011
@@L2012  EQU   *
         ST    8,88(13)
         MVC   92(4,13),32(3)
         LA    1,88(,13)
         L     15,=V(LI@FIRST)
         BALR  14,15
         LTR   15,15
         BE    @@L2014
         MVC   88(4,13),32(3)
         MVC   92(4,13),108(5)
         LA    1,88(,13)
         L     15,=V(LI@FIRST)
         BALR  14,15
         LTR   15,15
         BE    @@L2014
@@L2011  EQU   *
         L     2,52(4)
         N     2,=F'2147483647'
         O     2,=F'1073741824'
         ST    2,52(4)
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L2022
@@L2004  EQU   *
         L     2,52(4)
         SRL   2,31
         LTR   2,2
         BE    @@L1991
         ST    9,44(4)
@@L1991  EQU   *
         L     2,=A(LOOP@DUM)
         L     3,0(2)
         LTR   3,3
         BE    @@L1990
         L     2,52(4)
         SRL   2,31
         LTR   2,2
         BE    @@L1990
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC53)
         L     2,0(4)
         MVC   96(4,13),4(2)
         L     2,16(4)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L1990
@@L2022  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC52)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L2004
@@L2021  EQU   *
         L     2,104(5)
         L     3,12(2)
         B     @@L2008
@@L2020  EQU   *
         MVC   88(4,13),8(4)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         BE    @@L1999
         LA    6,1(0,0)
         B     @@L1999
@@L2019  EQU   *
         LA    7,1(0,0)
         L     2,104(5)
         L     3,12(2)
         B     @@L1996
@@L2018  EQU   *
         MVC   88(4,13),16(4)
         MVC   92(4,13),0(4)
         LA    1,88(,13)
         L     15,=A(@@79)
         BALR  14,15
         LTR   15,15
         BE    @@L1991
         B     @@L1992
@@L1990  EQU   *
* Function check_final_value epilogue
         PDPEPIL
* Function check_final_value literal pool
         DS    0F
         LTORG
* Function check_final_value page table
         DS    0F
@@PGT58  EQU   *
         DC    A(@@PG58)
         DS    0F
* S-func update_giv_derive prologue
@@77     PDPPRLG CINDEX=59,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN59
         LTORG
@@FEN59  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG59   EQU   *
         LR    11,1
         L     10,=A(@@PGT59)
* Function update_giv_derive code
         L     9,0(11)
         L     8,4(11)
         L     2,88(9)
         A     2,=F'136'
         L     6,8(2)
         LTR   6,6
         BE    @@L2057
@@L2055  EQU   *
         L     5,8(6)
         LTR   5,5
         BE    @@L2059
@@L2054  EQU   *
         LH    2,0(8)
         CLM   2,3,=H'36'
         BE    @@L2033
         CLM   2,3,=H'33'
         BE    @@L2033
         L     2,0(5)
         CLR   2,8
         BE    @@L2033
@@L2030  EQU   *
         L     5,68(5)
         LTR   5,5
         BNE   @@L2054
@@L2059  EQU   *
         L     6,36(6)
         LTR   6,6
         BNE   @@L2055
         B     @@L2057
@@L2033  EQU   *
         L     3,16(6)
         LTR   3,3
         BE    @@L2030
@@L2053  EQU   *
         L     15,52(3)
         LR    2,15
         SRL   2,25
         N     2,=F'1'
         LTR   2,2
         BNE   @@L2036
         LH    4,0(8)
         CLM   4,3,=H'36'
         BE    @@L2061
@@L2039  EQU   *
         L     7,=V(CIRTX)
         L     2,32(3)
         CL    2,256(7)
         BE    @@L2036
         SRL   15,31
         LTR   15,15
         BNE   @@L2036
         L     2,0(5)
         CLR   2,8
         BE    @@L2062
         CLM   4,3,=H'36'
         BE    @@L2063
@@L2052  EQU   *
         CLM   4,3,=H'33'
         BE    @@L2064
@@L2036  EQU   *
         L     3,68(3)
         LTR   3,3
         BNE   @@L2053
         B     @@L2030
@@L2064  EQU   *
         L     2,52(5)
         SRL   2,26
         N     2,=F'1'
         LTR   2,2
         BE    @@L2036
@@L2051  EQU   *
         OC    52(4,3),=F'33554432'
         B     @@L2036
@@L2063  EQU   *
         L     2,52(5)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BE    @@L2051
         B     @@L2052
@@L2062  EQU   *
         L     2,32(5)
         CL    2,260(7)
         BE    @@L2065
@@L2045  EQU   *
         LTR   15,15
         BE    @@L2046
         L     2,60(3)
         LTR   2,2
         BNE   @@L2066
@@L2046  EQU   *
         LTR   15,15
         BE    @@L2051
         ST    15,60(3)
         B     @@L2036
@@L2066  EQU   *
         MVC   88(4,13),=F'75'
         MVC   92(4,13),24(3)
         ST    15,96(13)
         MVC   100(4,13),60(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    9,88(13)
         ST    15,92(13)
         LA    2,104(,13)
         ST    2,96(13)
         LA    2,108(,13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         B     @@L2046
@@L2065  EQU   *
         MVC   88(4,13),=F'78'
         MVC   92(4,13),24(3)
         MVC   96(4,13),36(5)
         MVC   100(4,13),32(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    9,88(13)
         ST    15,92(13)
         LA    2,104(,13)
         ST    2,96(13)
         LA    2,108(,13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         B     @@L2045
@@L2061  EQU   *
         LR    2,15
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         BNE   @@L2039
         O     15,=F'33554432'
         ST    15,52(3)
         B     @@L2036
@@L2057  EQU   *
* Function update_giv_derive epilogue
         PDPEPIL
* Function update_giv_derive literal pool
         DS    0F
         LTORG
* Function update_giv_derive page table
         DS    0F
@@PGT59  EQU   *
         DC    A(@@PG59)
         DS    0F
* S-func basic_induction_var prologue
@@71     PDPPRLG CINDEX=60,FRAME=136,BASER=12,ENTRY=NO
         B     @@FEN60
         LTORG
@@FEN60  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG60   EQU   *
         LR    11,1
         L     10,=A(@@PGT60)
* Function basic_induction_var code
         MVC   120(4,13),0(11)
         L     5,4(11)
         L     9,8(11)
         L     8,12(11)
         L     4,16(11)
         MVC   124(4,13),20(11)
         MVC   128(4,13),24(11)
         MVC   132(4,13),28(11)
@@L2078  EQU   *
         L     12,0(,10)
         SLR   7,7
         LH    3,0(5)
         N     3,=XL4'0000FFFF'
         L     2,132(13)
         ST    7,0(2)
         A     3,=F'-54'
         LA    2,66(0,0)
         CLR   3,2
         BH    @@L2128
         MH    3,=H'4'
         L     2,=A(@@L2129)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2129  EQU   *
         DC    A(@@L2111)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2111)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2079)
         DC    A(@@L2128)
         DC    A(@@L2114)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2107)
         DC    A(@@L2128)
         DC    A(@@L2111)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2069)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2115)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2128)
         DC    A(@@L2114)
@@L2069  EQU   *
         MVC   88(4,13),4(5)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L2071
         L     3,4(5)
         L     2,0(3)
         N     2,=F'-65528'
         L     4,=F'4128776'
         CLR   2,4
         BE    @@L2134
@@L2070  EQU   *
         MVC   88(4,13),8(5)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L2074
         L     3,8(5)
         L     2,0(3)
         N     2,=F'-65528'
         L     7,=F'4128776'
         CLR   2,7
         BE    @@L2135
@@L2128  EQU   *
         SLR   2,2
         B     @@L2067
@@L2135  EQU   *
         L     2,4(3)
         CLR   2,8
         BNE   @@L2128
@@L2074  EQU   *
         LR    3,5
         A     3,=F'4'
@@L2072  EQU   *
         L     4,0(3)
         MVC   88(4,13),120(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         SLR   2,2
         LA    7,1(0,0)
         CLR   15,7
         BNE   @@L2067
         SLR   2,2
         IC    2,2(8)
         ST    2,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         ST    4,96(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         L     2,124(13)
         ST    15,0(2)
         L     2,=V(CIRTX)
         L     4,128(13)
         MVC   0(4,4),260(2)
         L     7,132(13)
         ST    3,0(7)
@@L2133  EQU   *
         LA    2,1(0,0)
         B     @@L2067
@@L2134  EQU   *
         L     2,4(3)
         CLR   2,8
         BNE   @@L2070
@@L2071  EQU   *
         LR    3,5
         A     3,=F'8'
         B     @@L2072
@@L2079  EQU   *
         ST    8,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         SLR   2,2
         LTR   15,15
         BNE   @@L2067
@@L2084  EQU   *
         L     4,8(4)
         LTR   4,4
         BE    @@L2085
         LH    2,0(4)
         CLM   2,3,=H'37'
         BNE   @@L2085
         L     2,20(4)
         L     3,=F'-96'
         CLR   2,3
         BNE   @@L2084
@@L2085  EQU   *
         LTR   4,4
         BE    @@L2107
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L2136
         SLR   7,7
@@L2091  EQU   *
         LTR   7,7
         BE    @@L2107
         L     15,4(7)
         CLR   15,5
         BE    @@L2096
         LH    6,0(15)
         CLM   6,3,=H'63'
         BE    @@L2137
@@L2095  EQU   *
         LR    2,6
         AH    2,=H'-132'
         CLM   2,3,=H'1'
         BH    @@L2138
@@L2104  EQU   *
         L     15,4(15)
         LH    3,0(15)
         LR    2,3
         AH    2,=H'-132'
         CLM   2,3,=H'1'
         BNH   @@L2104
         CLM   3,3,=H'63'
         BE    @@L2104
         CLM   3,3,=H'64'
         BE    @@L2104
@@L2131  EQU   *
         CLR   15,5
         BNE   @@L2084
@@L2107  EQU   *
         MVC   88(4,13),120(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         SLR   2,2
         LA    4,1(0,0)
         CLR   15,4
         BNE   @@L2067
@@L2111  EQU   *
         L     2,120(13)
         L     7,64(2)
         LA    3,1(0,0)
         CLR   7,3
         BNE   @@L2128
         L     4,=V(MODE@CLA)
         LR    3,9
         MH    3,=H'4'
         SLR   6,6
         IC    6,2(8)
         LR    2,6
         MH    2,=H'4'
         L     3,0(3,4)
         CL    3,0(2,4)
         BNE   @@L2128
         LA    4,4(0,0)
         CLR   3,4
         BE    @@L2128
         ST    6,88(13)
         ST    9,92(13)
         ST    5,96(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         L     2,124(13)
         ST    15,0(2)
         L     2,=V(CIRTX)
         L     3,128(13)
         MVC   0(4,3),256(2)
         B     @@L2133
@@L2138  EQU   *
         CLM   6,3,=H'63'
         BE    @@L2104
         CLM   6,3,=H'64'
         BNE   @@L2131
         B     @@L2104
@@L2137  EQU   *
         SLR   3,3
         IC    3,2(15)
         L     2,=V(MODE@SIZ)
         IC    2,0(2,3)
         CLM   2,1,=XL1'04'
         BH    @@L2095
         MH    3,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(3,2)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L2095
         L     2,4(15)
         CLR   2,5
         BNE   @@L2095
@@L2096  EQU   *
         L     15,8(7)
         IC    2,2(15)
         CLM   2,1,=XL1'00'
         BNE   @@L2097
         SLR   3,3
         IC    3,2(5)
@@L2098  EQU   *
         LR    5,15
         LR    9,3
         B     @@L2078
@@L2097  EQU   *
         SLR   3,3
         IC    3,2(15)
         B     @@L2098
@@L2136  EQU   *
         L     2,16(4)
         LH    3,0(2)
         LR    7,2
         CLM   3,3,=H'47'
         BE    @@L2091
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    7,15
         B     @@L2091
@@L2115  EQU   *
         L     4,8(4)
         LTR   4,4
         BE    @@L2117
         LH    2,0(4)
         CLM   2,3,=H'37'
         BE    @@L2139
@@L2117  EQU   *
         LTR   4,4
         BE    @@L2122
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L2140
         SLR   7,7
@@L2122  EQU   *
         ST    8,88(13)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L2128
         LTR   7,7
         BE    @@L2128
         L     6,4(7)
         CL    6,4(5)
         BNE   @@L2128
         L     3,8(5)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L2128
         L     2,4(3)
         LTR   2,2
         BL    @@L2128
         L     15,8(7)
         LH    2,0(15)
         CLM   2,3,=H'87'
         BNE   @@L2128
         CL    3,8(15)
         BNE   @@L2128
         L     5,4(15)
         SLR   9,9
         IC    9,2(6)
         B     @@L2078
@@L2140  EQU   *
         L     2,16(4)
         LH    3,0(2)
         LR    7,2
         CLM   3,3,=H'47'
         BE    @@L2122
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    7,15
         B     @@L2122
@@L2139  EQU   *
         L     2,20(4)
         L     3,=F'-96'
         CLR   2,3
         BE    @@L2117
@@L2121  EQU   *
         L     4,8(4)
         LTR   4,4
         BE    @@L2117
         LH    2,0(4)
         CLM   2,3,=H'37'
         BNE   @@L2117
         L     2,20(4)
         L     3,=F'-96'
         CLR   2,3
         BNE   @@L2121
         B     @@L2117
@@L2114  EQU   *
         L     2,4(5)
         LR    5,2
         SLR   9,9
         IC    9,2(2)
         B     @@L2078
@@L2067  EQU   *
         LR    15,2
* Function basic_induction_var epilogue
         PDPEPIL
* Function basic_induction_var literal pool
         DS    0F
         LTORG
* Function basic_induction_var page table
         DS    0F
@@PGT60  EQU   *
         DC    A(@@PG60)
         DS    0F
* S-func general_induction_var prologue
@@73     PDPPRLG CINDEX=61,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN61
         LTORG
@@FEN61  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG61   EQU   *
         LR    11,1
         L     10,=A(@@PGT61)
* Function general_induction_var code
         L     3,0(11)
         L     6,8(11)
         L     7,12(11)
         L     4,16(11)
         L     9,28(11)
         L     2,88(3)
         A     2,=F'136'
         ST    2,104(13)
         L     5,4(11)
         ST    3,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         SLR   2,2
         LA    8,1(0,0)
         CLR   15,8
         BE    @@L2141
         MVC   0(4,9),=F'0'
         L     15,20(11)
         MVC   0(4,15),=F'0'
         ST    3,88(13)
         ST    5,92(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L2141
         LH    3,0(15)
         N     3,=XL4'0000FFFF'
         A     3,=F'-48'
         LA    2,30(0,0)
         CLR   3,2
         BH    @@L2152
         MH    3,=H'4'
         L     2,=A(@@L2153)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2153  EQU   *
         DC    A(@@L2146)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2146)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2147)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2148)
         DC    A(@@L2152)
         DC    A(@@L2152)
         DC    A(@@L2151)
@@L2146  EQU   *
         L     3,104(13)
         L     2,8(3)
         L     2,8(2)
         MVC   0(4,6),16(2)
         L     2,=V(CIRTX)
         MVC   0(4,4),256(2)
         ST    15,0(7)
@@L2144  EQU   *
         L     3,0(7)
         LH    2,0(3)
         CLM   2,3,=H'48'
         BE    @@L2160
@@L2154  EQU   *
         L     3,0(4)
         LH    2,0(3)
         CLM   2,3,=H'48'
         BE    @@L2161
@@L2155  EQU   *
         L     2,24(11)
         LTR   2,2
         BE    @@L2156
         ST    5,88(13)
         MVC   92(4,13),32(11)
         LA    1,88(,13)
         L     15,=V(ADRCOST)
         BALR  14,15
         L     2,=A(@@0)
         S     15,0(2)
@@L2159  EQU   *
         A     15,0(9)
         ST    15,0(9)
         LA    2,1(0,0)
         B     @@L2141
@@L2156  EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         B     @@L2159
@@L2161  EQU   *
         MVC   0(4,4),4(3)
         B     @@L2155
@@L2160  EQU   *
         MVC   0(4,7),4(3)
         B     @@L2154
@@L2147  EQU   *
         ST    15,0(6)
         L     2,=V(CIRTX)
         MVC   0(4,4),260(2)
@@L2158  EQU   *
         MVC   0(4,7),256(2)
         B     @@L2144
@@L2148  EQU   *
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'78'
         BE    @@L2162
         ST    3,0(6)
         L     2,=V(CIRTX)
         MVC   0(4,4),260(2)
@@L2150  EQU   *
         MVC   0(4,7),8(15)
         B     @@L2144
@@L2162  EQU   *
         MVC   0(4,6),4(3)
         L     2,4(15)
         MVC   0(4,4),8(2)
         B     @@L2150
@@L2152  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'6378'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L2144
@@L2151  EQU   *
         MVC   0(4,6),4(15)
         MVC   0(4,4),8(15)
         L     2,=V(CIRTX)
         B     @@L2158
@@L2141  EQU   *
         LR    15,2
* Function general_induction_var epilogue
         PDPEPIL
* Function general_induction_var literal pool
         DS    0F
         LTORG
* Function general_induction_var page table
         DS    0F
@@PGT61  EQU   *
         DC    A(@@PG61)
         DS    0F
* S-func simplify_giv_expr prologue
@@81     PDPPRLG CINDEX=62,FRAME=128,BASER=12,ENTRY=NO
         B     @@FEN62
         LTORG
@@FEN62  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG62   EQU   *
         LR    11,1
         L     10,=A(@@PGT62)
* Function simplify_giv_expr code
         SLR   2,2
         SLR   3,3
         ST    2,112(13)
         ST    3,4+112(13)
         MVC   104(4,13),0(11)
         L     6,4(11)
         L     9,8(11)
         MVC   108(4,13),12(11)
@@L2168  EQU   *
         L     12,0(,10)
         L     3,104(13)
         L     2,88(3)
         LR    5,2
         A     5,=F'136'
         A     2,=F'120'
         ST    2,120(13)
         L     4,0(6)
         SLR   7,7
         IC    7,2(6)
         LTR   7,7
         BE    @@L2164
         LR    2,7
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    8,1(0,0)
         CLR   2,8
         BNE   @@L2274
         LR    2,7
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L2274
@@L2164  EQU   *
         LR    3,4
         SRL   3,16
         A     3,=F'-48'
         LA    2,74(0,0)
         CLR   3,2
         L     14,=A(@@L2272)
         BHR   14
         MH    3,=H'4'
         L     2,=A(@@L2278)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2278  EQU   *
         DC    A(@@L2225)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2232)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2167)
         DC    A(@@L2199)
         DC    A(@@L2223)
         DC    A(@@L2200)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2224)
         DC    A(@@L2221)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2272)
         DC    A(@@L2228)
         DC    A(@@L2228)
         DC    A(@@L2228)
@@L2167  EQU   *
         MVC   88(4,13),104(13)
         MVC   92(4,13),4(6)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),104(13)
         MVC   92(4,13),8(6)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         LR    5,15
         LTR   4,4
         BE    @@L2274
         LTR   15,15
         BE    @@L2274
         LH    2,0(4)
         CLM   2,3,=H'48'
         BE    @@L2172
         CLM   2,3,=H'54'
         BE    @@L2172
@@L2171  EQU   *
         L     2,=V(CIRTX)
         CL    5,256(2)
         BE    @@L2289
         LH    6,0(5)
         CLM   6,3,=H'54'
         BE    @@L2177
         CLM   6,3,=H'48'
         BNE   @@L2175
@@L2177  EQU   *
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         A     3,=F'-48'
         LA    8,30(0,0)
         CLR   3,8
         BH    @@L2190
         MH    3,=H'4'
         L     2,=A(@@L2191)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2191  EQU   *
         DC    A(@@L2180)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2180)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2188)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2189)
         DC    A(@@L2190)
         DC    A(@@L2190)
         DC    A(@@L2188)
@@L2180  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'48'
         BE    @@L2297
@@L2181  EQU   *
         CLM   6,3,=H'48'
         BE    @@L2298
@@L2182  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L2299
@@L2183  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'54'
         BE    @@L2300
         ST    7,88(13)
         ST    4,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(@@83)
         BALR  14,15
@@L2185  EQU   *
         LH    2,0(15)
         CLM   2,3,=H'54'
         L     14,=A(@@L2163)
         BER   14
@@L2292  EQU   *
         L     12,0(,10)
         MVC   88(4,13),=F'48'
         ST    7,92(13)
         ST    15,96(13)
@@L2290  EQU   *
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         L     14,=A(@@L2163)
         BR    14
@@L2300  EQU   *
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         B     @@L2185
@@L2299  EQU   *
         LR    15,4
         LR    4,5
         LR    5,15
         B     @@L2183
@@L2298  EQU   *
         L     5,4(5)
         B     @@L2182
@@L2297  EQU   *
         L     4,4(4)
         B     @@L2181
@@L2189  EQU   *
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         MVC   96(4,13),8(4)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'75'
@@L2294  EQU   *
         ST    7,92(13)
         MVC   96(4,13),4(4)
@@L2288  EQU   *
         L     12,0(,10)
         ST    15,100(13)
@@L2281  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    6,15
         B     @@L2168
@@L2190  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'6501'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L2175  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'61'
         BE    @@L2301
@@L2192  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'61'
         BE    @@L2302
@@L2193  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'78'
         BE    @@L2303
@@L2194  EQU   *
         LH    3,0(5)
         CLM   3,3,=H'75'
         BE    @@L2304
         LH    2,0(4)
         CLM   2,3,=H'78'
         BNE   @@L2274
         CLM   3,3,=H'78'
         BNE   @@L2274
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2163)
         BER   14
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         MVC   96(4,13),8(4)
         MVC   100(4,13),8(5)
@@L2295  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'78'
         B     @@L2294
@@L2274  EQU   *
         L     12,0(,10)
         SLR   15,15
         L     14,=A(@@L2163)
         BR    14
@@L2304  EQU   *
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         ST    4,96(13)
         MVC   100(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         ST    15,96(13)
         MVC   100(4,13),8(5)
         B     @@L2281
@@L2303  EQU   *
         LR    15,4
         LR    4,5
         LR    5,15
         B     @@L2194
@@L2302  EQU   *
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         ST    5,96(13)
         L     2,=V(CIRTX)
         MVC   100(4,13),260(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    5,15
         B     @@L2193
@@L2301  EQU   *
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         ST    4,96(13)
         L     2,=V(CIRTX)
         MVC   100(4,13),260(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    4,15
         B     @@L2192
@@L2188  EQU   *
         MVC   88(4,13),=F'75'
@@L2291  EQU   *
         L     12,0(,10)
         ST    7,92(13)
         ST    4,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     14,=A(@@L2163)
         BR    14
@@L2289  EQU   *
         L     12,0(,10)
         LR    15,4
         L     14,=A(@@L2163)
         BR    14
@@L2172  EQU   *
         CLM   2,3,=H'48'
         BE    @@L2305
@@L2173  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'54'
         BE    @@L2171
         LR    15,4
         LR    4,5
         LR    5,15
         B     @@L2171
@@L2305  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'48'
         BNE   @@L2173
         B     @@L2171
@@L2225  EQU   *
         LR    15,6
         L     14,=A(@@L2163)
         BR    14
@@L2232  EQU   *
         L     4,4(6)
         L     2,=A(MXRGBL)
         CL    4,0(2)
         BNL   @@L2274
         L     5,0(5)
         LR    2,4
         MH    2,=H'8'
         L     3,0(2,5)
         LR    15,6
         LA    8,1(0,0)
         CLR   3,8
         L     14,=A(@@L2163)
         BER   14
         LA    8,3(0,0)
         CLR   3,8
         BE    @@L2306
@@L2231  EQU   *
         L     12,0(,10)
         MVC   88(4,13),104(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LA    2,1(0,0)
         CLR   15,2
         BNE   @@L2272
         L     3,104(13)
         L     2,88(3)
         A     2,=F'112'
         L     4,0(2)
         LTR   4,4
         BE    @@L2272
@@L2270  EQU   *
         ST    6,88(13)
         MVC   92(4,13),8(4)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L2307
         L     4,44(4)
         LTR   4,4
         BNE   @@L2270
@@L2272  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'48'
         BE    @@L2308
@@L2273  EQU   *
         MVC   88(4,13),104(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LA    4,1(0,0)
         CLR   15,4
         BNE   @@L2274
         LH    2,0(6)
         LR    15,6
         CLM   2,3,=H'54'
         L     14,=A(@@L2163)
         BER   14
         CLM   2,3,=H'58'
         BE    @@L2309
@@L2276  EQU   *
         MVC   88(4,13),=F'48'
         ST    7,92(13)
         ST    6,96(13)
         B     @@L2290
@@L2309  EQU   *
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'75'
         BNE   @@L2276
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'68'
         BNE   @@L2276
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L2276
         LR    6,3
         B     @@L2276
@@L2308  EQU   *
         L     6,4(6)
         B     @@L2273
@@L2307  EQU   *
         L     2,36(4)
         LTR   2,2
         BE    @@L2310
         L     6,8(2)
         B     @@L2168
@@L2310  EQU   *
         L     15,16(4)
         LTR   15,15
         BE    @@L2251
         LR    2,15
         L     15,0(4)
@@L2252  EQU   *
         L     15,12(15)
         BCTR  2,0
         LTR   2,2
         BH    @@L2252
         ST    15,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L2257
         L     15,4(15)
@@L2257  EQU   *
         LTR   15,15
         BE    @@L2272
         LH    2,0(15)
         CLM   2,3,=H'75'
         BE    @@L2265
         CLM   2,3,=H'78'
         BE    @@L2265
         CLM   2,3,=H'87'
         BE    @@L2265
         CLM   2,3,=H'54'
         BE    @@L2265
         CLM   2,3,=H'68'
         BE    @@L2265
         CLM   2,3,=H'58'
         BNE   @@L2272
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'75'
         BNE   @@L2272
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'68'
         BNE   @@L2272
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L2272
         MVC   88(4,13),104(13)
         MVC   92(4,13),4(15)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2163)
         BNER  14
         B     @@L2272
@@L2265  EQU   *
         MVC   88(4,13),104(13)
         ST    15,92(13)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2163)
         BNER  14
         B     @@L2272
@@L2251  EQU   *
         L     5,0(4)
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L2311
@@L2259  EQU   *
         LTR   15,15
         BE    @@L2257
         L     15,8(15)
         B     @@L2257
@@L2311  EQU   *
         L     2,16(5)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'47'
         BE    @@L2259
         ST    5,88(13)
         L     2,0(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         B     @@L2259
@@L2306  EQU   *
         L     3,4(2,5)
         L     5,120(13)
         L     2,8(5)
         MH    4,=H'16'
         L     4,8(4,2)
         LTR   4,4
         BE    @@L2237
         L     2,=V(CIRTX)
         CL    4,256(2)
         BE    @@L2237
         L     8,108(13)
         L     2,0(8)
         A     2,40(3)
         ST    2,0(8)
@@L2237  EQU   *
         L     5,52(3)
         SRL   5,25
         N     5,=F'1'
         SLR   15,15
         LTR   5,5
         L     14,=A(@@L2163)
         BNER  14
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         MVC   96(4,13),8(3)
         MVC   100(4,13),32(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         ST    15,96(13)
         MVC   100(4,13),36(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     2,60(3)
         LTR   2,2
         BNE   @@L2312
@@L2239  EQU   *
         MVC   88(4,13),104(13)
         ST    15,92(13)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         LR    4,15
         L     2,0(9)
         LTR   2,2
         BE    @@L2240
         L     2,64(3)
         LTR   2,2
         L     14,=A(@@L2163)
         BER   14
         B     @@L2274
@@L2240  EQU   *
         MVC   0(4,9),64(3)
         B     @@L2289
@@L2312  EQU   *
         MVC   88(4,13),=F'76'
         ST    7,92(13)
         ST    15,96(13)
         MVC   100(4,13),60(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L2239
@@L2199  EQU   *
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         MVC   96(4,13),8(6)
         L     2,=V(CIRTX)
         MVC   100(4,13),252(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'75'
@@L2293  EQU   *
         L     12,0(,10)
         ST    7,92(13)
         MVC   96(4,13),4(6)
         B     @@L2288
@@L2223  EQU   *
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         MVC   96(4,13),4(6)
         L     2,=V(CIRTX)
         MVC   100(4,13),252(2)
         B     @@L2281
@@L2200  EQU   *
         MVC   88(4,13),104(13)
         MVC   92(4,13),4(6)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),104(13)
         MVC   92(4,13),8(6)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         LR    5,15
         LTR   4,4
         BE    @@L2274
         LTR   15,15
         BE    @@L2274
         LH    2,0(4)
         CLM   2,3,=H'48'
         L     14,=A(@@L2204)
         BER   14
         CLM   2,3,=H'54'
         L     14,=A(@@L2204)
         BER   14
@@L2203  EQU   *
         L     12,0(,10)
         LH    8,0(5)
         CLM   8,3,=H'48'
         BE    @@L2205
         SLR   15,15
         CLM   8,3,=H'54'
         L     14,=A(@@L2163)
         BNER  14
@@L2205  EQU   *
         L     2,=V(CIRTX)
         CL    5,256(2)
         L     14,=A(@@L2313)
         BER   14
         CL    5,260(2)
         BE    @@L2289
         LH    3,0(4)
         N     3,=XL4'0000FFFF'
         A     3,=F'-48'
         LA    2,30(0,0)
         CLR   3,2
         L     14,=A(@@L2219)
         BHR   14
         MH    3,=H'4'
         L     2,=A(@@L2220)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L2220  EQU   *
         DC    A(@@L2212)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2211)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2210)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2218)
         DC    A(@@L2219)
         DC    A(@@L2219)
         DC    A(@@L2217)
@@L2210  EQU   *
         MVC   88(4,13),=F'78'
         B     @@L2291
@@L2212  EQU   *
         SLR   15,15
         CLM   8,3,=H'54'
         L     14,=A(@@L2163)
         BNER  14
         L     4,4(4)
         LH    2,0(4)
         CLM   2,3,=H'78'
         BE    @@L2217
         CLM   2,3,=H'75'
         BNE   @@L2314
@@L2218  EQU   *
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         MVC   96(4,13),4(4)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         MVC   96(4,13),8(4)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         MVC   88(4,13),=F'75'
         ST    7,92(13)
         ST    2,96(13)
         B     @@L2288
@@L2314  EQU   *
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         ST    4,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L2292
@@L2217  EQU   *
         MVC   88(4,13),=F'78'
         ST    7,92(13)
         MVC   96(4,13),8(4)
         ST    5,100(13)
         B     @@L2295
@@L2211  EQU   *
         MVC   88(4,13),=F'0'
         MVC   116(4,13),4(5)
         L     2,112(13)
         L     3,4+112(13)
         M     2,4(4)
         ST    2,112(13)
         ST    3,4+112(13)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         L     14,=A(@@L2163)
         BR    14
@@L2219  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'6642'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L2221  EQU   *
         L     2,8(6)
         LH    2,0(2)
         SLR   15,15
         CLM   2,3,=H'54'
         L     14,=A(@@L2163)
         BNER  14
         MVC   88(4,13),=F'0'
         L     2,8(6)
         LA    3,1(0,0)
         L     2,4(2)
         SLL   3,0(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'78'
         B     @@L2293
@@L2313  EQU   *
         LR    15,5
         L     14,=A(@@L2163)
         BR    14
@@L2204  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'54'
         BE    @@L2203
         LR    15,4
         LR    4,5
         LR    5,15
         B     @@L2203
@@L2224  EQU   *
         MVC   88(4,13),=F'77'
         ST    7,92(13)
         MVC   96(4,13),4(6)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         MVC   88(4,13),=F'76'
         ST    7,92(13)
         ST    15,96(13)
         L     2,=V(CIRTX)
         MVC   100(4,13),260(2)
         B     @@L2281
@@L2228  EQU   *
         L     2,0(9)
         LTR   2,2
         BNE   @@L2231
         MVC   88(4,13),104(13)
         MVC   92(4,13),4(6)
         ST    9,96(13)
         MVC   100(4,13),108(13)
         LA    1,88(,13)
         L     15,=A(@@81)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L2231
         L     2,0(9)
         LTR   2,2
         BNE   @@L2231
         LH    2,0(15)
         CLM   2,3,=H'61'
         BNE   @@L2231
         LH    2,0(6)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         ST    7,92(13)
         ST    15,96(13)
         B     @@PGE62
         DS    0F
         LTORG
         DS    0F
@@PGE62  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG63   EQU   *
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,0(9)
         L     14,=A(@@L2289)
         BR    14
@@L2163  EQU   *
         L     12,4(,10)
* Function simplify_giv_expr epilogue
         PDPEPIL
* Function simplify_giv_expr literal pool
         DS    0F
         LTORG
* Function simplify_giv_expr page table
         DS    0F
@@PGT62  EQU   *
         DC    A(@@PG62)
         DC    A(@@PG63)
         DS    0F
* S-func sge_plus_constant prologue
@@82     PDPPRLG CINDEX=64,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN64
         LTORG
@@FEN64  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG64   EQU   *
         LR    11,1
         L     10,=A(@@PGT64)
* Function sge_plus_constant code
         L     4,0(11)
         L     6,4(11)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L2326
         CLM   2,3,=H'75'
         BE    @@L2318
         MVC   88(4,13),=F'75'
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         ST    4,96(13)
         ST    6,100(13)
@@L2325  EQU   *
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L2315
@@L2318  EQU   *
         L     15,8(4)
         LH    5,0(15)
         CLM   5,3,=H'54'
         BE    @@L2327
         L     3,4(4)
         LH    2,0(3)
         CLM   2,3,=H'75'
         BE    @@L2323
         CLM   5,3,=H'75'
         BE    @@L2322
@@L2323  EQU   *
         ST    3,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         MVC   88(4,13),=F'75'
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         ST    15,96(13)
         MVC   100(4,13),8(4)
         B     @@L2325
@@L2322  EQU   *
         ST    15,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         MVC   88(4,13),=F'75'
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         ST    15,96(13)
         MVC   100(4,13),4(4)
         B     @@L2325
@@L2327  EQU   *
         MVC   88(4,13),=F'0'
         L     2,4(15)
         A     2,4(6)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'75'
         SLR   2,2
         IC    2,2(4)
         ST    2,92(13)
         MVC   96(4,13),4(4)
         ST    15,100(13)
         B     @@L2325
@@L2326  EQU   *
         MVC   88(4,13),=F'0'
         L     2,4(4)
         A     2,4(6)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
@@L2315  EQU   *
* Function sge_plus_constant epilogue
         PDPEPIL
* Function sge_plus_constant literal pool
         DS    0F
         LTORG
* Function sge_plus_constant page table
         DS    0F
@@PGT64  EQU   *
         DC    A(@@PG64)
         DS    0F
* S-func sge_plus prologue
@@83     PDPPRLG CINDEX=65,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN65
         LTORG
@@FEN65  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG65   EQU   *
         LR    11,1
         L     10,=A(@@PGT65)
* Function sge_plus code
         L     5,0(11)
         L     15,4(11)
         L     3,8(11)
         LH    2,0(3)
         CLM   2,3,=H'75'
         BE    @@L2334
@@L2338  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L2339
         MVC   88(4,13),=F'75'
         ST    5,92(13)
         ST    15,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L2336
@@L2339  EQU   *
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         B     @@L2336
@@L2334  EQU   *
         L     4,4(3)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L2340
         MVC   88(4,13),=F'75'
         ST    5,92(13)
         ST    15,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
@@L2333  EQU   *
         L     3,8(3)
         LH    2,0(3)
         CLM   2,3,=H'75'
         BE    @@L2334
         B     @@L2338
@@L2340  EQU   *
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@82)
         BALR  14,15
         B     @@L2333
@@L2336  EQU   *
* Function sge_plus epilogue
         PDPEPIL
* Function sge_plus literal pool
         DS    0F
         LTORG
* Function sge_plus page table
         DS    0F
@@PGT65  EQU   *
         DC    A(@@PG65)
         DS    0F
* S-func consec_sets_giv prologue
@@74     PDPPRLG CINDEX=66,FRAME=136,BASER=12,ENTRY=NO
         B     @@FEN66
         LTORG
@@FEN66  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG66   EQU   *
         LR    11,1
         L     10,=A(@@PGT66)
* Function consec_sets_giv code
         L     4,8(11)
         L     7,16(11)
         L     3,0(11)
         L     2,88(3)
         LR    6,2
         A     6,=F'136'
         ST    6,132(13)
         A     6,=F'-16'
         L     8,132(13)
         L     3,0(8)
         L     2,4(7)
         SLL   2,3
         L     2,0(2,3)
         SLR   15,15
         LTR   2,2
         BNE   @@L2341
         MVC   88(4,13),=F'88'
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    5,15
         MVC   8(4,15),12(11)
         L     3,24(11)
         MVC   32(4,15),0(3)
         L     8,20(11)
         MVC   36(4,15),0(8)
         MVC   40(4,15),4(11)
         NC    52(4,15),=F'-33554433'
         ST    2,60(15)
         ST    2,64(15)
         L     2,132(13)
         L     3,0(2)
         L     2,4(7)
         SLL   2,3
         LA    8,3(0,0)
         ST    8,0(2,3)
         L     2,4(7)
         SLL   2,0(8)
         ST    15,4(2,3)
         L     3,8(6)
         L     2,4(7)
         SLL   2,4
         L     8,4(2,3)
         BCTR  8,0
         LTR   8,8
         BNH   @@L2364
@@L2362  EQU   *
         L     4,12(4)
         LH    6,0(4)
         N     6,=XL4'0000FFFF'
         LA    2,32(0,0)
         CLR   6,2
         BE    @@L2365
@@L2346  EQU   *
         LA    3,32(0,0)
         CLR   6,3
         BE    @@L2366
@@L2347  EQU   *
         LA    3,37(0,0)
         CLR   6,3
         BE    @@L2343
         LA    2,32(0,0)
         CLR   6,2
         BNE   @@L2356
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L2367
         SLR   15,15
@@L2358  EQU   *
         LTR   15,15
         BE    @@L2356
         L     2,4(15)
         CLR   2,7
         BE    @@L2356
         L     2,8(15)
         LH    15,0(2)
         LR    2,15
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L2343
         CLM   15,3,=H'54'
         BE    @@L2343
         CLM   15,3,=H'55'
         BE    @@L2343
         CLM   15,3,=H'58'
         BE    @@L2343
         CLM   15,3,=H'134'
         BE    @@L2343
         CLM   15,3,=H'56'
         BE    @@L2343
         CH    15,=H'140'
         BNE   @@L2356
@@L2343  EQU   *
         LTR   8,8
         BH    @@L2362
@@L2364  EQU   *
         L     8,132(13)
         L     2,0(8)
         L     3,4(7)
         SLL   3,3
         SLR   6,6
         ST    6,0(3,2)
         L     2,32(11)
         ST    4,0(2)
         L     15,40(5)
         B     @@L2341
@@L2356  EQU   *
         L     4,132(13)
         L     3,0(4)
         L     2,4(7)
         SLL   2,3
         SLR   6,6
         ST    6,0(2,3)
         LR    15,6
         B     @@L2341
@@L2367  EQU   *
         L     2,16(4)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'47'
         BE    @@L2358
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         B     @@L2358
@@L2366  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L2368
         SLR   15,15
@@L2349  EQU   *
         LTR   15,15
         BE    @@L2347
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L2347
         CLR   3,7
         BNE   @@L2347
         MVC   88(4,13),0(11)
         MVC   92(4,13),8(15)
         LA    9,12(,11)
         ST    9,96(13)
         MVC   100(4,13),20(11)
         MVC   104(4,13),24(11)
         MVC   108(4,13),28(11)
         MVC   112(4,13),=F'0'
         LA    3,128(,13)
         ST    3,116(13)
         MVC   120(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L2369
@@L2352  EQU   *
         L     2,12(11)
         CL    2,8(5)
         BNE   @@L2347
         ST    4,88(13)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L2370
@@L2353  EQU   *
         BCTR  8,0
         L     6,24(11)
         MVC   32(4,5),0(6)
         L     2,20(11)
         MVC   36(4,5),0(2)
         L     2,40(5)
         A     2,128(13)
         ST    2,40(5)
         B     @@L2343
@@L2370  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@17)
         BALR  14,15
         A     15,128(13)
         ST    15,128(13)
         B     @@L2353
@@L2369  EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L2347
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(15)
         ST    9,96(13)
         MVC   100(4,13),20(11)
         MVC   104(4,13),24(11)
         MVC   108(4,13),28(11)
         ST    2,112(13)
         ST    3,116(13)
         ST    2,120(13)
         LA    1,88(,13)
         L     15,=A(@@73)
         BALR  14,15
         LTR   15,15
         BE    @@L2347
         B     @@L2352
@@L2368  EQU   *
         L     2,16(4)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'47'
         BE    @@L2349
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         B     @@L2349
@@L2365  EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'7'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L2346
         L     4,4(15)
         B     @@L2346
@@L2341  EQU   *
* Function consec_sets_giv epilogue
         PDPEPIL
* Function consec_sets_giv literal pool
         DS    0F
         LTORG
* Function consec_sets_giv page table
         DS    0F
@@PGT66  EQU   *
         DC    A(@@PG66)
         DS    0F
* S-func express_from_1 prologue
@@84     PDPPRLG CINDEX=67,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN67
         LTORG
@@FEN67  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG67   EQU   *
         LR    11,1
         L     10,=A(@@PGT67)
* Function express_from_1 code
         SLR   2,2
         SLR   3,3
         ST    2,104(13)
         ST    3,4+104(13)
         ST    2,112(13)
         ST    3,4+112(13)
         L     4,0(11)
         L     5,4(11)
         L     9,8(11)
         L     2,=V(CIRTX)
         CL    9,256(2)
         BE    @@L2411
         CL    9,260(2)
         BE    @@L2373
         LH    2,0(4)
         SLR   15,15
         CLM   2,3,=H'54'
         BNE   @@L2371
@@L2373  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'75'
         BE    @@L2412
@@L2375  EQU   *
         LH    15,0(4)
         CLM   15,3,=H'75'
         BE    @@L2413
         CLM   15,3,=H'54'
         BE    @@L2414
         LR    2,15
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L2398
         CLM   15,3,=H'55'
         BE    @@L2398
         CLM   15,3,=H'58'
         BE    @@L2398
         CLM   15,3,=H'134'
         BE    @@L2398
         CLM   15,3,=H'56'
         BE    @@L2398
         CLM   15,3,=H'140'
         BE    @@L2398
         LH    2,0(5)
         CLM   2,3,=H'75'
         BE    @@L2415
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2371
         L     2,=V(CIRTX)
         L     15,256(2)
         B     @@L2371
@@L2415  EQU   *
         ST    4,88(13)
         MVC   92(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2402
         L     15,8(5)
         B     @@L2371
@@L2402  EQU   *
         ST    4,88(13)
         MVC   92(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2371
         L     15,4(5)
         B     @@L2371
@@L2398  EQU   *
         SLR   3,3
         IC    3,2(4)
         SLR   2,2
         IC    2,2(5)
         LTR   2,2
         BNE   @@L2399
         LR    2,3
@@L2399  EQU   *
         MVC   88(4,13),=F'76'
         ST    2,92(13)
         ST    5,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(SGBIN)
         BALR  14,15
         B     @@L2371
@@L2414  EQU   *
         ST    5,88(13)
         L     4,4(4)
         LCR   2,4
         MVC   116(4,13),4(9)
         L     4,112(13)
         L     5,4+112(13)
         MR    4,2
         ST    4,112(13)
         ST    5,4+112(13)
         MVC   92(4,13),116(13)
         LA    1,88(,13)
         L     15,=V(PLUS@CON)
         BALR  14,15
         B     @@L2371
@@L2413  EQU   *
         L     2,4(4)
         L     3,8(4)
         ST    3,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2390
         LR    3,2
@@L2391  EQU   *
         LH    2,0(3)
         SLR   15,15
         CLM   2,3,=H'54'
         BNE   @@L2371
         MVC   88(4,13),=F'0'
         L     3,4(3)
         LCR   2,3
         MVC   108(4,13),4(9)
         L     4,104(13)
         L     5,4+104(13)
         MR    4,2
         ST    4,104(13)
         ST    5,4+104(13)
         MVC   92(4,13),108(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         B     @@L2371
@@L2390  EQU   *
         ST    2,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2371
         B     @@L2391
@@L2412  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'75'
         BNE   @@L2375
@@L2388  EQU   *
         L     8,4(4)
         L     7,8(4)
         LH    2,0(8)
         CLM   2,3,=H'75'
         BE    @@L2416
@@L2378  EQU   *
         L     6,4(5)
         L     3,8(5)
         LH    2,0(6)
         CLM   2,3,=H'75'
         BE    @@L2417
@@L2379  EQU   *
         ST    8,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2380
         LR    4,7
@@L2410  EQU   *
         LR    5,3
@@L2374  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'75'
         BNE   @@L2375
         LH    2,0(5)
         CLM   2,3,=H'75'
         BE    @@L2388
         B     @@L2375
@@L2380  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'75'
         BE    @@L2382
         ST    8,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2382
         LR    4,7
         LR    5,6
         B     @@L2374
@@L2382  EQU   *
         LH    2,0(7)
         CLM   2,3,=H'75'
         BE    @@L2384
         ST    7,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2384
         LR    4,8
         B     @@L2410
@@L2384  EQU   *
         ST    4,88(13)
         ST    3,92(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=A(@@84)
         BALR  14,15
         LTR   15,15
         BE    @@L2409
         MVC   88(4,13),=F'75'
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         ST    6,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L2371
@@L2409  EQU   *
         B     @@L2371
@@L2417  EQU   *
         LR    2,6
         LR    6,3
         LR    3,2
         B     @@L2379
@@L2416  EQU   *
         LR    2,8
         LR    8,7
         LR    7,2
         B     @@L2378
@@L2411  EQU   *
         LR    15,5
@@L2371  EQU   *
* Function express_from_1 epilogue
         PDPEPIL
* Function express_from_1 literal pool
         DS    0F
         LTORG
* Function express_from_1 page table
         DS    0F
@@PGT67  EQU   *
         DC    A(@@PG67)
         DS    0F
* X-func express_from prologue
EXPRESS@ PDPPRLG CINDEX=68,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN68
         LTORG
@@FEN68  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG68   EQU   *
         LR    11,1
         L     10,=A(@@PGT68)
* Function express_from code
         SLR   4,4
         SLR   5,5
         LR    6,4
         LR    7,5
         LR    8,4
         LR    9,5
         L     2,0(11)
         L     15,32(2)
         LH    2,0(15)
         CLM   2,3,=H'54'
         BE    @@L2439
@@L2419  EQU   *
         L     2,0(11)
         MVC   88(4,13),32(2)
         L     2,4(11)
         MVC   92(4,13),32(2)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L2418
         L     2,=V(CIRTX)
         L     6,260(2)
@@L2422  EQU   *
         L     2,0(11)
         MVC   88(4,13),36(2)
         L     2,4(11)
         MVC   92(4,13),36(2)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=A(@@84)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BE    @@L2440
@@L2425  EQU   *
         LR    15,5
         LTR   5,5
         BE    @@L2418
         L     2,=V(CIRTX)
         CL    6,256(2)
         BE    @@L2441
         CL    6,260(2)
         BE    @@L2442
         MVC   88(4,13),=F'78'
         L     2,4(11)
         MVC   92(4,13),24(2)
         L     2,0(11)
         MVC   96(4,13),16(2)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    6,15
@@L2431  EQU   *
         L     2,=V(CIRTX)
         CL    5,256(2)
         BE    @@L2443
         LH    2,0(5)
         CLM   2,3,=H'75'
         BE    @@L2444
@@L2436  EQU   *
         MVC   88(4,13),=F'75'
         L     2,4(11)
         MVC   92(4,13),24(2)
         ST    6,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         B     @@L2418
@@L2444  EQU   *
         L     3,8(5)
         LH    15,0(3)
         LR    2,15
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L2437
         CLM   15,3,=H'54'
         BE    @@L2437
         CLM   15,3,=H'55'
         BE    @@L2437
         CLM   15,3,=H'58'
         BE    @@L2437
         CLM   15,3,=H'134'
         BE    @@L2437
         CLM   15,3,=H'56'
         BE    @@L2437
         CLM   15,3,=H'140'
         BNE   @@L2436
@@L2437  EQU   *
         MVC   88(4,13),=F'75'
         L     2,4(11)
         MVC   92(4,13),24(2)
         ST    6,96(13)
         MVC   100(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    6,15
         LR    5,3
         B     @@L2436
@@L2443  EQU   *
         LR    15,6
         B     @@L2418
@@L2442  EQU   *
         L     2,0(11)
         L     6,16(2)
         B     @@L2431
@@L2441  EQU   *
         LR    15,5
         B     @@L2418
@@L2440  EQU   *
         L     7,4(6)
         LA    2,1(0,0)
         CR    7,2
         BNH   @@L2425
         L     2,0(11)
         L     3,36(2)
         LH    2,0(3)
         CLM   2,3,=H'78'
         BE    @@L2445
@@L2427  EQU   *
         MVC   88(4,13),=F'78'
         SLR   2,2
         IC    2,2(3)
         ST    2,92(13)
         ST    3,96(13)
         ST    6,100(13)
@@L2438  EQU   *
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         L     2,4(11)
         MVC   92(4,13),36(2)
         L     2,=V(CIRTX)
         MVC   96(4,13),260(2)
         LA    1,88(,13)
         L     15,=A(@@84)
         BALR  14,15
         LR    5,15
         B     @@L2425
@@L2445  EQU   *
         L     4,8(3)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BNE   @@L2427
         L     9,4(4)
         MR    8,7
         ST    15,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'78'
         SLR   2,2
         IC    2,2(3)
         ST    2,92(13)
         MVC   96(4,13),4(3)
         ST    15,100(13)
         B     @@L2438
@@L2439  EQU   *
         L     2,4(11)
         L     3,32(2)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L2419
         L     2,=V(CIRTX)
         CL    15,256(2)
         BE    @@L2421
         L     4,4(3)
         SRDA  4,32
         D     4,4(15)
         LTR   4,4
         BE    @@L2420
@@L2421  EQU   *
         SLR   15,15
         B     @@L2418
@@L2420  EQU   *
         ST    4,88(13)
         L     6,4(3)
         SRDA  6,32
         D     6,4(15)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    6,15
         B     @@L2422
@@L2418  EQU   *
* Function express_from epilogue
         PDPEPIL
* Function express_from literal pool
         DS    0F
         LTORG
* Function express_from page table
         DS    0F
@@PGT68  EQU   *
         DC    A(@@PG68)
         DS    0F
* S-func combine_givs_p prologue
@@85     PDPPRLG CINDEX=69,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN69
         LTORG
@@FEN69  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG69   EQU   *
         LR    11,1
         L     10,=A(@@PGT69)
* Function combine_givs_p code
         L     6,0(11)
         L     7,4(11)
         L     4,=V(MODE@SIZ)
         L     2,24(6)
         L     3,24(7)
         IC    2,0(4,2)
         SLR   5,5
         IC    3,0(4,3)
         STC   3,80(,13)
         CLM   2,1,80(13)
         BL    @@L2446
         ST    6,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=A(EXPRESS@)
         BALR  14,15
         LR    3,15
         LR    8,15
         LR    5,15
         LTR   15,15
         BE    @@L2446
         L     2,24(6)
         L     4,24(7)
         CLR   2,4
         BE    @@L2449
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@LOWP)
         BALR  14,15
         LR    3,15
@@L2449  EQU   *
         CL    8,16(6)
         BE    @@L2453
@@L2450  EQU   *
         LTR   3,3
         BE    @@L2452
         L     2,12(7)
         LTR   2,2
         BE    @@L2454
@@L2452  EQU   *
         SLR   5,5
         B     @@L2446
@@L2454  EQU   *
         L     2,28(7)
         SLR   4,4
         IC    4,2(2)
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(MEMADP)
         BALR  14,15
         LR    5,3
         LTR   15,15
         BNE   @@L2446
         B     @@L2452
@@L2453  EQU   *
         L     2,12(6)
         LA    4,1(0,0)
         CLR   2,4
         BE    @@L2451
         L     2,12(7)
         LTR   2,2
         BNE   @@L2450
@@L2451  EQU   *
         LR    5,3
@@L2446  EQU   *
         LR    15,5
* Function combine_givs_p epilogue
         PDPEPIL
* Function combine_givs_p literal pool
         DS    0F
         LTORG
* Function combine_givs_p page table
         DS    0F
@@PGT69  EQU   *
         DC    A(@@PG69)
@@LC54   EQU   *
         DC    C'Verified ext dependent giv at %d of reg %d'
         DC    X'15'
         DC    X'0'
@@LC55   EQU   *
         DC    C'biv iteration values overflowed'
         DC    X'0'
@@LC57   EQU   *
         DC    C'biv iteration info incomplete'
         DC    X'0'
@@LC58   EQU   *
         DC    C'Failed ext dependent giv at %d, %s'
         DC    X'15'
         DC    X'0'
@@LC56   EQU   *
         DC    C'biv iteration info incomplete; incr by 1'
         DC    X'0'
         DS    0F
* S-func check_ext_dependent_givs prologue
@@68     PDPPRLG CINDEX=70,FRAME=128,BASER=12,ENTRY=NO
         B     @@FEN70
         LTORG
@@FEN70  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG70   EQU   *
         LR    11,1
         L     10,=A(@@PGT70)
* Function check_ext_dependent_givs code
         SLR   6,6
         SLR   7,7
         MVC   104(4,13),=F'0'
         MVC   108(4,13),104(13)
         MVC   112(4,13),104(13)
         L     3,0(11)
         L     2,8(3)
         L     2,8(2)
         SLR   8,8
         IC    8,2(2)
         MVC   116(4,13),112(13)
         MVC   120(4,13),112(13)
         L     2,=V(GLBRTL)
         L     9,0(2)
         L     15,4(11)
         L     2,64(15)
         LTR   2,2
         BE    @@L2456
         L     2,24(3)
         LTR   2,2
         BE    @@L2456
         LH    2,0(2)
         CLM   2,3,=H'54'
         BE    @@L2500
@@L2456  EQU   *
         L     2,0(11)
         L     4,16(2)
         LTR   4,4
         BE    @@L2499
@@L2497  EQU   *
         L     2,64(4)
         LTR   2,2
         BE    @@L2476
         L     3,0(2)
         LR    2,3
         SRL   2,16
         SLR   5,5
         LA    6,121(0,0)
         CLR   2,6
         BE    @@L2481
         BH    @@L2487
         LA    15,120(0,0)
         CLR   2,15
         BE    @@L2480
@@L2485  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'7390'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L2479  EQU   *
         LTR   5,5
         BE    @@L2488
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L2501
@@L2476  EQU   *
         L     4,68(4)
         LTR   4,4
         BNE   @@L2497
         B     @@L2499
@@L2501  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC54)
         L     2,0(4)
         MVC   96(4,13),4(2)
         L     15,0(11)
         MVC   100(4,13),0(15)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L2476
@@L2488  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L2491
         L     3,=A(@@LC55)
         L     2,112(13)
         LTR   2,2
         BNE   @@L2493
         L     2,=V(GLBRTL)
         CL    9,0(2)
         BE    @@L2502
@@L2494  EQU   *
         L     2,=V(CIRTX)
         CL    9,260(2)
         BE    @@L2503
         L     3,=A(@@LC57)
@@L2493  EQU   *
         L     2,=A(LOOP@DUM)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC58)
         L     2,0(4)
         MVC   96(4,13),4(2)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L2491  EQU   *
         OC    52(4,4),=F'536870912'
         L     3,0(11)
         NC    48(4,3),=F'-134217729'
         B     @@L2476
@@L2503  EQU   *
         L     3,=A(@@LC56)
         B     @@L2493
@@L2502  EQU   *
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(BIV@TOTA)
         BALR  14,15
         LR    9,15
         B     @@L2494
@@L2480  EQU   *
         L     5,108(13)
         B     @@L2479
@@L2487  EQU   *
         LA    6,122(0,0)
         CLR   2,6
         BNE   @@L2485
         L     15,108(13)
         LTR   15,15
         BE    @@L2479
         L     2,104(13)
         LTR   2,2
         BE    @@L2479
         SRL   3,6
         N     3,=F'1020'
         L     2,=V(MODE@MAS)
         L     2,0(3,2)
         SRL   2,1
         L     3,120(13)
         CLR   3,2
         BH    @@L2479
         L     6,116(13)
         CLR   6,2
         BH    @@L2479
         LA    5,1(0,0)
         B     @@L2479
@@L2481  EQU   *
         L     5,104(13)
         B     @@L2479
@@L2500  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(BIV@TOTA)
         BALR  14,15
         LR    9,15
         LTR   15,15
         BE    @@L2456
         LH    2,0(15)
         CLM   2,3,=H'54'
         BNE   @@L2456
         LR    2,8
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    2,0(2,3)
         CLM   2,3,=H'32'
         BH    @@L2456
         MVC   112(4,13),=F'1'
         L     3,0(11)
         L     2,24(3)
         MVC   120(4,13),4(2)
         MVC   124(4,13),104(13)
         L     3,4(15)
         LTR   3,3
         BL    @@L2504
@@L2457  EQU   *
         L     15,4(11)
         L     2,64(15)
         LR    7,2
         MR    6,3
         LR    15,7
         LR    4,7
         L     5,104(13)
         CLR   2,7
         BH    @@L2461
         LTR   2,2
         BL    @@L2460
         LA    6,1(0,0)
         CLR   2,6
         BE    @@L2459
         SRDL  4,32
         DR    4,2
@@L2461  EQU   *
         CLR   3,5
         BNE   @@L2456
         L     2,120(13)
         SR    2,15
         ST    2,116(13)
         L     3,124(13)
         LTR   3,3
         BNE   @@L2463
         L     5,120(13)
         AR    5,15
         ST    5,116(13)
@@L2463  EQU   *
         MH    8,=H'4'
         L     2,=V(MODE@MAS)
         L     2,0(8,2)
         LR    4,2
         SRL   4,1
         L     6,120(13)
         LTR   6,6
         BL    @@L2464
         L     15,124(13)
         LTR   15,15
         BE    @@L2465
         L     3,116(13)
         CLR   3,6
         BL    @@L2466
@@L2464  EQU   *
         LCR   3,4
         LR    2,3
         BCTR  2,0
         L     5,120(13)
         CR    5,2
         BL    @@L2456
         L     6,124(13)
         LTR   6,6
         BE    @@L2470
         L     15,116(13)
         CR    15,5
         BNL   @@L2456
@@L2471  EQU   *
         L     5,124(13)
         LTR   5,5
         BE    @@L2472
         BCTR  3,0
         L     6,116(13)
         CR    6,3
         BL    @@L2456
@@L2473  EQU   *
         MVC   108(4,13),=F'1'
         B     @@L2456
@@L2472  EQU   *
         L     15,116(13)
         CR    15,4
         BH    @@L2456
         B     @@L2473
@@L2470  EQU   *
         L     2,116(13)
         C     2,120(13)
         BNH   @@L2456
         B     @@L2471
@@L2466  EQU   *
         L     6,124(13)
         LTR   6,6
         BNE   @@L2468
         L     15,116(13)
         CLR   15,2
         BH    @@L2464
@@L2468  EQU   *
         MVC   104(4,13),=F'1'
         B     @@L2464
@@L2465  EQU   *
         L     5,116(13)
         CL    5,120(13)
         BNH   @@L2464
         B     @@L2466
@@L2459  EQU   *
         LR    5,7
         B     @@L2461
@@L2460  EQU   *
         LA    5,1(0,0)
         B     @@L2461
@@L2504  EQU   *
         MVC   124(4,13),112(13)
         LCR   3,3
         B     @@L2457
@@L2499  EQU   *
* Function check_ext_dependent_givs epilogue
         PDPEPIL
* Function check_ext_dependent_givs literal pool
         DS    0F
         LTORG
* Function check_ext_dependent_givs page table
         DS    0F
@@PGT70  EQU   *
         DC    A(@@PG70)
         DS    0F
* X-func extend_value_for_giv prologue
EXTEND@V PDPPRLG CINDEX=71,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN71
         LTORG
@@FEN71  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG71   EQU   *
         LR    11,1
         L     10,=A(@@PGT71)
* Function extend_value_for_giv code
         L     4,4(11)
         L     2,0(11)
         L     3,64(2)
         LR    15,4
         LTR   3,3
         BE    @@L2505
         LH    15,0(4)
         LR    2,15
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L2508
         CLM   15,3,=H'54'
         BE    @@L2508
         CLM   15,3,=H'55'
         BE    @@L2508
         CLM   15,3,=H'58'
         BE    @@L2508
         CLM   15,3,=H'134'
         BE    @@L2508
         CLM   15,3,=H'56'
         BE    @@L2508
         CLM   15,3,=H'140'
         BE    @@L2508
@@L2507  EQU   *
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         SLR   2,2
         IC    2,2(3)
         ST    2,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         B     @@L2505
@@L2508  EQU   *
         IC    2,2(4)
         LR    15,4
         CLM   2,1,=XL1'00'
         BNE   @@L2507
@@L2505  EQU   *
* Function extend_value_for_giv epilogue
         PDPEPIL
* Function extend_value_for_giv literal pool
         DS    0F
         LTORG
* Function extend_value_for_giv page table
         DS    0F
@@PGT71  EQU   *
         DC    A(@@PG71)
         DS    0F
* S-func cmp_combine_givs_stats prologue
@@86     PDPPRLG CINDEX=72,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN72
         LTORG
@@FEN72  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG72   EQU   *
         LR    11,1
         L     10,=A(@@PGT72)
* Function cmp_combine_givs_stats code
         L     3,0(11)
         L     2,4(11)
         L     15,4(2)
         S     15,4(3)
         BNE   @@L2510
         L     15,0(3)
         S     15,0(2)
@@L2510  EQU   *
* Function cmp_combine_givs_stats epilogue
         PDPEPIL
* Function cmp_combine_givs_stats literal pool
         DS    0F
         LTORG
* Function cmp_combine_givs_stats page table
         DS    0F
@@PGT72  EQU   *
         DC    A(@@PG72)
@@LC61   EQU   *
         DC    C'giv at %d combined with giv at %d; new benefit %'
         DC    C'd + %d, lifetime %d'
         DC    X'15'
         DC    X'0'
@@LC59   EQU   *
         DC    C'Sorted combine statistics:'
         DC    X'15'
         DC    X'0'
@@LC60   EQU   *
         DC    C' {%d, %d}'
         DC    X'0'
         DS    0F
* S-func combine_givs prologue
@@69     PDPPRLG CINDEX=73,FRAME=176,BASER=12,ENTRY=NO
         B     @@FEN73
         LTORG
@@FEN73  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG73   EQU   *
         LR    11,1
         L     10,=A(@@PGT73)
* Function combine_givs code
         SLR   2,2
         SLR   3,3
         ST    2,144(13)
         ST    3,4+144(13)
         ST    2,152(13)
         ST    3,4+152(13)
         ST    2,160(13)
         ST    3,4+160(13)
         L     3,4(11)
         MVC   128(4,13),=F'0'
         L     4,16(3)
         LTR   4,4
         BE    @@L2575
@@L2517  EQU   *
         L     2,52(4)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BNE   @@L2514
         L     5,128(13)
         A     5,=F'1'
         ST    5,128(13)
@@L2514  EQU   *
         L     4,68(4)
         LTR   4,4
         BNE   @@L2517
@@L2575  EQU   *
         L     5,128(13)
         MH    5,=H'4'
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,120(13)
         L     4,16(3)
         LTR   4,4
         BE    @@L2577
         LR    3,15
@@L2523  EQU   *
         L     2,52(4)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BNE   @@L2520
         ST    4,0(3)
         A     3,=F'4'
@@L2520  EQU   *
         L     4,68(4)
         LTR   4,4
         BNE   @@L2523
@@L2577  EQU   *
         MVC   88(4,13),128(13)
         MVC   92(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         LR    9,15
         MVC   88(4,13),128(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         ST    15,132(13)
         MVC   124(4,13),=F'0'
         SLR   6,6
         C     6,128(13)
         BNL   @@L2537
         ST    6,168(13)
@@L2536  EQU   *
         L     2,124(13)
         MH    2,=H'4'
         L     7,120(13)
         L     4,0(2,7)
         L     2,124(13)
         MH    2,=H'8'
         ST    2,136(13)
         L     3,124(13)
         ST    3,0(2,9)
         L     2,12(4)
         LA    5,1(0,0)
         CLR   2,5
         BE    @@L2591
@@L2528  EQU   *
         L     7,40(4)
         L     2,52(4)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BE    @@L2529
         A     7,=F'1'
@@L2529  EQU   *
         SLR   8,8
         C     8,128(13)
         BNL   @@L2580
         L     6,120(13)
         L     3,168(13)
         MH    3,=H'4'
         A     3,132(13)
@@L2535  EQU   *
         L     5,0(6)
         CLR   4,5
         BE    @@L2532
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@85)
         BALR  14,15
         LTR   15,15
         BE    @@L2532
         ST    15,0(3)
         L     2,40(5)
         A     2,=F'3'
         AR    7,2
@@L2532  EQU   *
         A     6,=F'4'
         A     3,=F'4'
         A     8,=F'1'
         C     8,128(13)
         BL    @@L2535
@@L2580  EQU   *
         L     2,136(13)
         ST    7,4(2,9)
@@L2526  EQU   *
         L     3,168(13)
         A     3,128(13)
         ST    3,168(13)
         L     4,124(13)
         A     4,=F'1'
         ST    4,124(13)
         C     4,128(13)
         BL    @@L2536
@@L2537  EQU   *
         ST    9,88(13)
         MVC   92(4,13),128(13)
         MVC   96(4,13),=F'8'
         MVC   100(4,13),=A(@@86)
         LA    1,88(,13)
         L     15,=V(QSORT)
         BALR  14,15
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L2592
@@L2538  EQU   *
         SLR   7,7
         C     7,128(13)
         BNL   @@L2584
@@L2573  EQU   *
         MVC   140(4,13),=F'0'
         LR    2,7
         MH    2,=H'8'
         L     2,0(2,9)
         ST    2,124(13)
         MH    2,=H'4'
         L     6,120(13)
         L     4,0(2,6)
         L     2,48(4)
         LTR   2,2
         BNE   @@L2547
         L     2,72(4)
         LTR   2,2
         BNE   @@L2547
         SLR   8,8
         C     8,128(13)
         BNL   @@L2586
@@L2565  EQU   *
         LR    2,8
         MH    2,=H'4'
         L     3,120(13)
         L     5,0(2,3)
         CLR   4,5
         BE    @@L2553
         MVC   148(4,13),128(13)
         L     2,144(13)
         L     3,4+144(13)
         M     2,124(13)
         ST    2,144(13)
         ST    3,4+144(13)
         L     2,148(13)
         AR    2,8
         MH    2,=H'4'
         L     3,132(13)
         L     15,0(2,3)
         LTR   15,15
         BE    @@L2553
         L     2,72(5)
         LTR   2,2
         BNE   @@L2553
         L     2,48(5)
         LTR   2,2
         BNE   @@L2553
         ST    15,4(5)
         ST    4,72(5)
         L     2,12(5)
         LTR   2,2
         BE    @@L2593
@@L2556  EQU   *
         L     2,48(4)
         A     2,=F'1'
         ST    2,48(4)
         L     2,56(4)
         A     2,56(5)
         ST    2,56(4)
         L     2,140(13)
         A     2,40(5)
         ST    2,140(13)
         L     2,52(5)
         SRL   2,31
         LTR   2,2
         BNE   @@L2557
         L     2,16(5)
         L     2,0(2)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BE    @@L2557
         L     2,=A(@@1)
         L     3,140(13)
         S     3,0(2)
         ST    3,140(13)
@@L2557  EQU   *
         SLR   6,6
         C     6,128(13)
         BNL   @@L2588
@@L2563  EQU   *
         LR    15,6
         MH    15,=H'8'
         MVC   156(4,13),128(13)
         L     2,152(13)
         L     3,4+152(13)
         M     2,0(15,9)
         ST    2,152(13)
         ST    3,4+152(13)
         L     2,156(13)
         AR    2,8
         MH    2,=H'4'
         L     3,132(13)
         L     2,0(2,3)
         LTR   2,2
         BE    @@L2560
         L     2,40(5)
         A     2,=F'3'
         L     3,4(15,9)
         SR    3,2
         ST    3,4(15,9)
@@L2560  EQU   *
         A     6,=F'1'
         C     6,128(13)
         BL    @@L2563
@@L2588  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L2594
@@L2553  EQU   *
         A     8,=F'1'
         C     8,128(13)
         BL    @@L2565
@@L2586  EQU   *
         L     2,48(4)
         LTR   2,2
         BNE   @@L2595
@@L2547  EQU   *
         A     7,=F'1'
         C     7,128(13)
         BL    @@L2573
         B     @@L2584
@@L2595  EQU   *
         SLR   8,8
         C     8,128(13)
         BNL   @@L2590
@@L2572  EQU   *
         LR    3,8
         MH    3,=H'8'
         MVC   164(4,13),128(13)
         L     6,160(13)
         L     7,4+160(13)
         M     6,0(3,9)
         ST    6,160(13)
         ST    7,4+160(13)
         L     2,124(13)
         AR    2,7
         MH    2,=H'4'
         L     7,132(13)
         L     2,0(2,7)
         LTR   2,2
         BE    @@L2569
         L     2,40(4)
         A     2,=F'3'
         L     5,4(3,9)
         SR    5,2
         ST    5,4(3,9)
@@L2569  EQU   *
         A     8,=F'1'
         C     8,128(13)
         BL    @@L2572
@@L2590  EQU   *
         L     6,140(13)
         A     6,40(4)
         ST    6,140(13)
         ST    6,40(4)
         B     @@L2537
@@L2594  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC61)
         L     2,0(5)
         MVC   96(4,13),4(2)
         L     2,0(4)
         MVC   100(4,13),4(2)
         MVC   104(4,13),40(4)
         MVC   108(4,13),140(13)
         MVC   112(4,13),56(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L2553
@@L2593  EQU   *
         L     2,=A(@@0)
         L     3,40(5)
         A     3,0(2)
         ST    15,88(13)
         L     2,28(5)
         SLR   6,6
         IC    6,2(2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(ADRCOST)
         BALR  14,15
         SR    3,15
         ST    3,40(5)
         B     @@L2556
@@L2592  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC59)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         SLR   7,7
         C     7,128(13)
         BNL   @@L2582
@@L2544  EQU   *
         LR    3,7
         MH    3,=H'8'
         L     2,0(3,9)
         SLL   2,2
         L     5,120(13)
         L     4,0(2,5)
         L     2,48(4)
         LTR   2,2
         BNE   @@L2541
         L     2,72(4)
         LTR   2,2
         BE    @@L2596
@@L2541  EQU   *
         A     7,=F'1'
         C     7,128(13)
         BL    @@L2544
@@L2582  EQU   *
         MVC   88(4,13),=F'21'
         L     2,=A(LOOP@DUM)
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L2538
@@L2596  EQU   *
         L     2,=A(LOOP@DUM)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=A(@@LC60)
         L     2,0(3,9)
         SLL   2,2
         L     2,0(2,5)
         L     2,0(2)
         MVC   96(4,13),4(2)
         L     3,4(3,9)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L2541
@@L2591  EQU   *
         L     2,16(4)
         L     6,0(11)
         L     3,8(6)
         L     2,4(2)
         SLL   2,4
         L     3,8(2,3)
         LTR   3,3
         BE    @@L2528
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L2526
         B     @@L2528
@@L2584  EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function combine_givs epilogue
         PDPEPIL
* Function combine_givs literal pool
         DS    0F
         LTORG
* Function combine_givs page table
         DS    0F
@@PGT73  EQU   *
         DC    A(@@PG73)
         DS    0F
* S-func gen_add_mult prologue
@@87     PDPPRLG CINDEX=74,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN74
         LTORG
@@FEN74  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG74   EQU   *
         LR    11,1
         L     10,=A(@@PGT74)
* Function gen_add_mult code
         L     3,12(11)
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    3,92(13)
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         SLR   2,2
         IC    2,2(3)
         ST    2,104(13)
         MVC   108(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(EXPMADD)
         BALR  14,15
         CLR   3,15
         BE    @@L2598
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
@@L2598  EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,2
* Function gen_add_mult epilogue
         PDPEPIL
* Function gen_add_mult literal pool
         DS    0F
         LTORG
* Function gen_add_mult page table
         DS    0F
@@PGT74  EQU   *
         DC    A(@@PG74)
         DS    0F
* S-func loop_regs_update prologue
@@88     PDPPRLG CINDEX=75,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN75
         LTORG
@@FEN75  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG75   EQU   *
         LR    11,1
         L     10,=A(@@PGT75)
* Function loop_regs_update code
         L     8,4(11)
         LH    2,0(8)
         CLM   2,3,=H'24'
         BE    @@L2614
         CLM   2,3,=H'47'
         BNE   @@L2599
         L     3,4(8)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L2599
         MVC   88(4,13),4(3)
         MVC   92(4,13),8(8)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(RBVALUE)
         BALR  14,15
         B     @@L2599
@@L2614  EQU   *
         SLR   7,7
         L     2,4(8)
         C     7,0(2)
         BNL   @@L2599
@@L2610  EQU   *
         L     6,4(8)
         LR    5,7
         MH    5,=H'4'
         L     4,4(5,6)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L2615
         SLR   15,15
@@L2606  EQU   *
         LTR   15,15
         BE    @@L2603
         L     3,4(15)
         LH    2,0(3)
         CH    2,=H'61'
         BE    @@L2616
@@L2603  EQU   *
         A     7,=F'1'
         L     2,4(8)
         C     7,0(2)
         BL    @@L2610
         B     @@L2599
@@L2616  EQU   *
         MVC   88(4,13),4(3)
         MVC   92(4,13),8(15)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(RBVALUE)
         BALR  14,15
         B     @@L2603
@@L2615  EQU   *
         L     2,16(4)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'47'
         BE    @@L2606
         ST    4,88(13)
         L     2,4(5,6)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         B     @@L2606
@@L2599  EQU   *
* Function loop_regs_update epilogue
         PDPEPIL
* Function loop_regs_update literal pool
         DS    0F
         LTORG
* Function loop_regs_update page table
         DS    0F
@@PGT75  EQU   *
         DC    A(@@PG75)
         DS    0F
* X-func li_ameb prologue
LI@AMEB  PDPPRLG CINDEX=76,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN76
         LTORG
@@FEN76  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG76   EQU   *
         LR    11,1
         L     10,=A(@@PGT76)
* Function li_ameb code
         L     8,0(11)
         L     6,4(11)
         L     7,8(11)
         L     5,12(11)
         L     9,16(11)
         L     4,24(11)
         LTR   4,4
         BE    @@L2619
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         LR    3,15
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    3,88(13)
         ST    2,92(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=A(@@87)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@89)
         BALR  14,15
         ST    6,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@89)
         BALR  14,15
         ST    7,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@89)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),20(11)
         ST    4,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(LI@EMBEF)
         BALR  14,15
         ST    8,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@88)
         BALR  14,15
         B     @@L2617
@@L2619  EQU   *
         ST    8,88(13)
         ST    6,92(13)
         ST    7,96(13)
         ST    5,100(13)
         ST    9,104(13)
         LA    1,88(,13)
         L     15,=V(LI@AMH)
         BALR  14,15
@@L2617  EQU   *
* Function li_ameb epilogue
         PDPEPIL
* Function li_ameb literal pool
         DS    0F
         LTORG
* Function li_ameb page table
         DS    0F
@@PGT76  EQU   *
         DC    A(@@PG76)
         DS    0F
* X-func li_ams prologue
LI@AMS   PDPPRLG CINDEX=77,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN77
         LTORG
@@FEN77  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG77   EQU   *
         LR    11,1
         L     10,=A(@@PGT77)
* Function li_ams code
         L     3,0(11)
         L     6,4(11)
         L     7,8(11)
         L     5,12(11)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         LR    4,15
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    4,88(13)
         ST    2,92(13)
         ST    15,96(13)
         MVC   100(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@87)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         MVC   92(4,13),120(3)
         LA    1,88(,13)
         L     15,=A(@@89)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),120(3)
         LA    1,88(,13)
         L     15,=A(@@89)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),120(3)
         LA    1,88(,13)
         L     15,=A(@@89)
         BALR  14,15
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(LI@SINK)
         BALR  14,15
         ST    3,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@88)
         BALR  14,15
* Function li_ams epilogue
         PDPEPIL
* Function li_ams literal pool
         DS    0F
         LTORG
* Function li_ams page table
         DS    0F
@@PGT77  EQU   *
         DC    A(@@PG77)
         DS    0F
* X-func li_amh prologue
LI@AMH   PDPPRLG CINDEX=78,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN78
         LTORG
@@FEN78  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG78   EQU   *
         LR    11,1
         L     10,=A(@@PGT78)
* Function li_amh code
         L     4,0(11)
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    3,88(13)
         ST    2,92(13)
         ST    15,96(13)
         MVC   100(4,13),16(11)
         LA    1,88(,13)
         L     15,=A(@@87)
         BALR  14,15
         LR    2,15
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@88)
         BALR  14,15
* Function li_amh epilogue
         PDPEPIL
* Function li_amh literal pool
         DS    0F
         LTORG
* Function li_amh page table
         DS    0F
@@PGT78  EQU   *
         DC    A(@@PG78)
         DS    0F
* S-func iv_add_mult_cost prologue
@@64     PDPPRLG CINDEX=79,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN79
         LTORG
@@FEN79  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG79   EQU   *
         LR    11,1
         L     10,=A(@@PGT79)
* Function iv_add_mult_cost code
         L     3,12(11)
         SLR   5,5
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    3,92(13)
         MVC   96(4,13),4(11)
         MVC   100(4,13),8(11)
         SLR   2,2
         IC    2,2(3)
         ST    2,104(13)
         MVC   108(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(EXPMADD)
         BALR  14,15
         CLR   3,15
         BE    @@L2623
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
@@L2623  EQU   *
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L2634
@@L2632  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L2635
         SLR   2,2
@@L2628  EQU   *
         LTR   2,2
         BE    @@L2631
         MVC   88(4,13),8(2)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         AR    5,15
@@L2631  EQU   *
         L     4,8(4)
         LTR   4,4
         BNE   @@L2632
         B     @@L2634
@@L2635  EQU   *
         L     2,16(4)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L2628
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
         B     @@L2628
@@L2634  EQU   *
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LR    15,5
* Function iv_add_mult_cost epilogue
         PDPEPIL
* Function iv_add_mult_cost literal pool
         DS    0F
         LTORG
* Function iv_add_mult_cost page table
         DS    0F
@@PGT79  EQU   *
         DC    A(@@PG79)
         DS    0F
* S-func product_cheap_p prologue
@@70     PDPPRLG CINDEX=80,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN80
         LTORG
@@FEN80  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG80   EQU   *
         LR    11,1
         L     10,=A(@@PGT80)
* Function product_cheap_p code
         L     3,0(11)
         L     5,4(11)
         LA    6,1(0,0)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L2659
@@L2637  EQU   *
         LH    2,0(3)
         LR    15,6
         CLM   2,3,=H'54'
         BE    @@L2636
         LH    2,0(5)
         SLR   15,15
         CLM   2,3,=H'54'
         BNE   @@L2636
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         SLR   2,2
         IC    2,2(3)
         ST    2,88(13)
         ST    3,92(13)
         ST    5,96(13)
         MVC   100(4,13),=F'0'
         ST    6,104(13)
         LA    1,88(,13)
         L     15,=V(EXPMULT)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    4,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LH    15,0(4)
         CLM   15,3,=H'24'
         BE    @@L2660
         CLM   15,3,=H'47'
         BE    @@L2661
@@L2654  EQU   *
         CLM   15,3,=H'39'
         BE    @@L2662
@@L2653  EQU   *
         LR    15,6
         B     @@L2636
@@L2662  EQU   *
         L     2,4(4)
         L     15,4(2)
         LH    2,0(15)
         CLM   2,3,=H'47'
         BNE   @@L2653
         L     2,8(15)
         LH    2,0(2)
         CLM   2,3,=H'78'
         BNE   @@L2653
@@L2658  EQU   *
         SLR   6,6
         B     @@L2653
@@L2661  EQU   *
         L     2,8(4)
         LH    2,0(2)
         CLM   2,3,=H'78'
         BNE   @@L2654
         B     @@L2658
@@L2660  EQU   *
         L     2,4(4)
         LTR   2,2
         BE    @@L2653
         L     2,0(2)
         LA    3,3(0,0)
         CR    2,3
         BH    @@L2658
         SLR   5,5
         CR    5,2
         BNL   @@L2653
@@L2652  EQU   *
         L     7,4(4)
         LR    2,5
         MH    2,=H'4'
         L     3,4(2,7)
         LH    2,0(3)
         CLM   2,3,=H'32'
         BNE   @@L2658
         L     15,16(3)
         LH    3,0(15)
         CLM   3,3,=H'47'
         BE    @@L2663
@@L2651  EQU   *
         CH    3,=H'39'
         BE    @@L2664
@@L2647  EQU   *
         A     5,=F'1'
         C     5,0(7)
         BL    @@L2652
         B     @@L2653
@@L2664  EQU   *
         L     2,4(15)
         L     3,4(2)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BNE   @@L2647
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'78'
         BNE   @@L2647
         B     @@L2658
@@L2663  EQU   *
         L     2,8(15)
         LH    2,0(2)
         CLM   2,3,=H'78'
         BNE   @@L2651
         B     @@L2658
@@L2659  EQU   *
         LR    4,3
         LR    3,5
         LR    5,4
         B     @@L2637
@@L2636  EQU   *
* Function product_cheap_p epilogue
         PDPEPIL
* Function product_cheap_p literal pool
         DS    0F
         LTORG
* Function product_cheap_p page table
         DS    0F
@@PGT80  EQU   *
         DC    A(@@PG80)
@@LC63   EQU   *
         DC    C'Reversed loop'
         DC    X'0'
@@LC64   EQU   *
         DC    C' and added reg_nonneg'
         DC    X'15'
         DC    X'0'
@@LC62   EQU   *
         DC    C'Can reverse loop'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func check_dbra_loop prologue
@@67     PDPPRLG CINDEX=81,FRAME=208,BASER=12,ENTRY=NO
         B     @@FEN81
         LTORG
@@FEN81  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG81   EQU   *
         LR    11,1
         L     10,=A(@@PGT81)
* Function check_dbra_loop code
         SLR   8,8
         SLR   9,9
         ST    8,176(13)
         ST    9,4+176(13)
         ST    8,184(13)
         ST    9,4+184(13)
         L     2,0(11)
         MVC   124(4,13),88(2)
         L     3,124(13)
         A     3,=F'120'
         ST    3,128(13)
         L     5,124(13)
         A     5,=F'136'
         ST    5,132(13)
         MVC   156(4,13),104(2)
         MVC   160(4,13),108(2)
         L     2,160(13)
         L     7,8(2)
         MVC   88(4,13),0(11)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(GCONDFL)
         BALR  14,15
         ST    15,148(13)
         LTR   15,15
         L     14,=A(@@L2665)
         BER   14
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(ONLYJUMP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2665)
         BER   14
         ST    7,88(13)
         LA    2,120(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GCOND)
         BALR  14,15
         MVC   152(4,13),=F'1'
         L     2,120(13)
         CLR   2,7
         BE    @@L2669
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         MVC   152(4,13),=F'2'
         L     2,120(13)
         CLR   2,15
         BE    @@L2669
@@L2695  EQU   *
         L     12,0(,10)
         SLR   15,15
         L     14,=A(@@L2665)
         BR    14
@@L2669  EQU   *
         MVC   88(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         L     3,0(11)
         CL    15,96(3)
         BE    @@L2672
         LH    2,0(15)
         SLR   15,15
         CLM   2,3,=H'33'
         L     14,=A(@@L2665)
         BER   14
@@L2672  EQU   *
         L     5,132(13)
         L     6,8(5)
         LTR   6,6
         BE    @@L2675
@@L2679  EQU   *
         L     2,4(6)
         LA    3,1(0,0)
         CLR   2,3
         L     14,=A(@@L2831)
         BER   14
@@L2676  EQU   *
         L     12,0(,10)
         L     6,36(6)
         LTR   6,6
         BNE   @@L2679
@@L2675  EQU   *
         L     12,0(,10)
         LR    15,6
         LTR   6,6
         L     14,=A(@@L2665)
         BER   14
         L     2,148(13)
         LH    4,0(2)
         CLM   4,3,=H'105'
         L     14,=A(@@L2832)
         BER   14
@@L2683  EQU   *
         L     12,0(,10)
         CLM   4,3,=H'102'
         L     14,=A(@@L2833)
         BER   14
@@L2681  EQU   *
         L     12,0(,10)
         L     2,8(6)
         L     3,36(2)
         LH    2,0(3)
         CH    2,=H'54'
         BNE   @@L2695
         L     2,4(3)
         LTR   2,2
         BNH   @@L2695
         MVC   164(4,13),=F'0'
         SLR   7,7
         LA    8,1(0,0)
         L     2,12(6)
         LTR   2,2
         BNE   @@L2697
         L     5,0(11)
         L     2,128(5)
         LTR   2,2
         BNE   @@L2697
         L     3,124(13)
         L     2,20(3)
         LTR   2,2
         BNE   @@L2697
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,48(2)
         L     2,0(6)
         SLL   2,2
         L     5,0(2,3)
         ST    8,164(13)
         L     4,156(13)
         CL    4,160(13)
         BE    @@L2699
@@L2714  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L2834)
         BER   14
@@L2700  EQU   *
         L     12,0(,10)
         L     4,12(4)
         CL    4,160(13)
         BNE   @@L2714
@@L2699  EQU   *
         L     12,0(,10)
         L     2,132(13)
         L     3,8(2)
         LTR   3,3
         BE    @@L2697
@@L2720  EQU   *
         L     2,44(3)
         LTR   2,2
         L     14,=A(@@L2835)
         BNER  14
@@L2717  EQU   *
         L     12,0(,10)
         L     3,36(3)
         LTR   3,3
         BNE   @@L2720
@@L2697  EQU   *
         L     12,0(,10)
         L     3,164(13)
         LTR   3,3
         BNE   @@L2722
         L     5,124(13)
         L     2,104(5)
         LA    3,1(0,0)
         CR    2,3
         BH    @@L2695
         L     4,156(13)
         CL    4,160(13)
         BE    @@L2817
@@L2729  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L2836)
         BER   14
@@L2726  EQU   *
         L     12,0(,10)
         L     4,12(4)
         CL    4,160(13)
         BNE   @@L2729
@@L2817  EQU   *
         L     5,124(13)
         L     2,104(5)
         LA    3,1(0,0)
         CR    2,3
         L     14,=A(@@L2837)
         BER   14
@@L2722  EQU   *
         L     12,0(,10)
         LA    5,1(0,0)
         CR    7,5
         L     14,=A(@@L2838)
         BNHR  14
@@L2741  EQU   *
         L     12,0(,10)
         L     3,164(13)
         LTR   3,3
         BE    @@L2695
@@L2740  EQU   *
         L     12,0(,10)
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         L     14,=A(@@L2839)
         BNER  14
@@L2742  EQU   *
         L     12,0(,10)
         L     5,148(13)
         LH    2,0(5)
         CLM   2,3,=H'107'
         BE    @@L2744
         CLM   2,3,=H'106'
         BNE   @@L2695
         L     7,164(13)
         LTR   7,7
         BE    @@L2695
@@L2744  EQU   *
         MVC   168(4,13),=F'0'
         SLR   8,8
         L     2,8(6)
         L     2,36(2)
         L     4,4(2)
         L     2,148(13)
         L     5,8(2)
         IC    2,2(5)
         CLM   2,1,=XL1'00'
         L     14,=A(@@L2745)
         BNER  14
         L     3,148(13)
         L     2,4(3)
         SLR   3,3
         IC    3,2(2)
@@L2826  EQU   *
         L     12,0(,10)
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    2,0(3,2)
         N     2,=XL4'0000FFFF'
         LA    7,32(0,0)
         CR    2,7
         BNH   @@L2747
         LR    2,7
@@L2747  EQU   *
         BCTR  2,0
         LA    7,1(0,0)
         SLL   7,0(2)
         MVC   88(4,13),0(11)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2665)
         BER   14
         LH    15,0(5)
         CLM   15,3,=H'54'
         L     14,=A(@@L2840)
         BER   14
@@L2749  EQU   *
         L     12,0(,10)
         MVC   200(4,13),24(6)
         L     2,164(13)
         LTR   2,2
         BE    @@L2750
         CLM   15,3,=H'54'
         L     14,=A(@@L2841)
         BER   14
@@L2750  EQU   *
         L     12,0(,10)
         L     2,=V(CIRTX)
         L     3,200(13)
         CL    3,256(2)
         L     14,=A(@@L2842)
         BER   14
@@L2754  EQU   *
         L     12,0(,10)
         LA    7,1(0,0)
         CLR   4,7
         BNE   @@L2695
         L     3,0(11)
         L     2,92(3)
         LTR   2,2
         BE    @@L2695
         L     2,4(6)
         LTR   2,2
         BE    @@L2757
         L     7,164(13)
         LTR   7,7
         BE    @@L2695
@@L2757  EQU   *
         SLR   9,9
         MVC   172(4,13),=F'102'
@@L2755  EQU   *
         L     12,0(,10)
         L     3,148(13)
         LH    2,0(3)
         CLM   2,3,=H'106'
         L     14,=A(@@L2843)
         BER   14
@@L2759  EQU   *
         L     12,0(,10)
         L     2,=V(CIRTX)
         L     7,200(13)
         CL    7,256(2)
         L     14,=A(@@L2844)
         BER   14
@@L2760  EQU   *
         L     12,0(,10)
         L     2,164(13)
         LTR   2,2
         BE    @@L2695
         LA    3,1(0,0)
         CLR   4,3
         BNE   @@L2695
@@L2765  EQU   *
         L     12,0(,10)
         ST    5,140(13)
         LH    2,0(5)
         CLM   2,3,=H'54'
         L     14,=A(@@L2845)
         BER   14
@@L2768  EQU   *
         L     12,0(,10)
         MVC   24(4,6),200(13)
         L     2,8(6)
         L     7,16(2)
         L     2,160(13)
         MVC   88(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(CJLABEL)
         BALR  14,15
         ST    15,136(13)
         MVC   88(4,13),=F'0'
         L     2,8(6)
         L     2,36(2)
         L     2,4(2)
         LCR   2,2
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,144(13)
         L     2,=V(CIRTX)
         L     3,200(13)
         CL    3,256(2)
         L     14,=A(@@L2846)
         BER   14
@@L2769  EQU   *
         L     12,0(,10)
         L     3,200(13)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L2847)
         BER   14
         LTR   9,9
         BNE   @@L2695
         SLR   4,4
         IC    4,2(7)
         ST    7,88(13)
         ST    5,92(13)
         MVC   96(4,13),200(13)
         LA    1,88(,13)
         L     15,=V(GEN@SUB3)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(@@L2665)
         BER   14
         MVC   88(4,13),=F'76'
         ST    4,92(13)
         ST    5,96(13)
         MVC   100(4,13),200(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    8,15
         MVC   88(4,13),0(11)
         ST    2,92(13)
@@L2827  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
@@L2770  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),144(13)
         LA    1,88(,13)
         L     15,=V(X@INC)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         L     2,8(6)
         MVC   96(4,13),0(2)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(LI@EMBEF)
         BALR  14,15
         LR    4,15
         L     2,8(6)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         L     2,8(6)
         ST    4,0(2)
         ST    8,24(6)
         MVC   36(4,2),144(13)
         L     5,124(13)
         ST    7,32(5)
         ST    7,44(5)
         L     2,=V(CIRTX)
         MVC   40(4,5),256(2)
         MVC   48(4,5),256(2)
         MVC   36(4,5),256(2)
         MVC   60(4,5),172(13)
         MVC   56(4,5),144(13)
         L     2,136(13)
         L     3,4(2)
         L     2,16(3)
         A     2,=F'1'
         ST    2,16(3)
         L     3,0(6)
         SLL   3,2
         L     2,=V(REG@N@IN)
         A     3,0(2)
         L     4,16(3)
         L     3,4(4)
         L     2,120(13)
         CL    3,4(2)
         L     14,=A(@@L2848)
         BER   14
@@L2779  EQU   *
         L     12,0(,10)
         ST    7,88(13)
         MVC   92(4,13),140(13)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(LI@SINK)
         BALR  14,15
@@L2778  EQU   *
         L     12,0(,10)
         L     3,160(13)
         MVC   88(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         L     2,152(13)
         LA    5,2(0,0)
         CLR   2,5
         L     14,=A(@@L2849)
         BER   14
@@L2780  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    7,88(13)
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         MVC   96(4,13),172(13)
         MVC   100(4,13),=F'0'
         SLR   2,2
         IC    2,2(7)
         ST    2,104(13)
         MVC   108(4,13),=F'0'
         L     3,136(13)
         MVC   112(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GEN@SEQU)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),160(13)
         LA    1,88(,13)
         L     15,=V(EMJIB)
         BALR  14,15
         L     5,160(13)
         L     3,8(5)
         LTR   3,3
         BE    @@L2782
         LH    2,0(3)
         CLM   2,3,=H'33'
         BE    @@L2782
@@L2786  EQU   *
         L     3,8(3)
         LTR   3,3
         BE    @@L2782
         LH    2,0(3)
         CLM   2,3,=H'33'
         BNE   @@L2786
@@L2782  EQU   *
         LTR   3,3
         BE    @@L2787
         L     2,136(13)
         MVC   32(4,3),4(2)
@@L2787  EQU   *
         L     5,168(13)
         LTR   5,5
         BE    @@L2788
         LTR   3,3
         BE    @@L2789
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'8'
         ST    7,96(13)
         MVC   100(4,13),28(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,28(3)
@@L2789  EQU   *
         OC    48(4,6),=F'536870912'
@@L2788  EQU   *
         L     4,156(13)
         CL    4,160(13)
         BE    @@L2821
@@L2808  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L2850
@@L2792  EQU   *
         L     4,12(4)
         CL    4,160(13)
         BNE   @@L2808
@@L2821  EQU   *
         OC    48(4,6),=F'268435456'
         L     3,=A(LOOP@DUM)
         L     2,0(3)
         LTR   2,2
         BNE   @@L2851
@@L2809  EQU   *
         L     12,0(,10)
         LA    15,1(0,0)
         L     14,=A(@@L2665)
         BR    14
@@L2851  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC63)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,48(6)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         BE    @@L2810
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC64)
@@L2828  EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L2809
@@L2810  EQU   *
         MVC   88(4,13),0(3)
         MVC   92(4,13),=A(@@LC19)
         B     @@L2828
@@L2850  EQU   *
         L     2,16(4)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L2796
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
@@L2796  EQU   *
         LTR   2,2
         BE    @@L2800
         L     15,4(2)
         LH    2,0(15)
         CLM   2,3,=H'61'
         BE    @@L2852
@@L2800  EQU   *
         LR    5,4
         A     5,=F'28'
         L     2,0(5)
         LTR   2,2
         BE    @@L2792
@@L2807  EQU   *
         L     2,0(5)
         CLI   2(2),4
         BE    @@L2853
@@L2805  EQU   *
         L     5,0(5)
         A     5,=F'8'
@@L2801  EQU   *
         L     2,0(5)
         LTR   2,2
         BNE   @@L2807
         B     @@L2792
@@L2853  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,48(2)
         L     2,0(6)
         SLL   2,2
         L     3,0(2,3)
         ST    3,88(13)
         L     2,0(5)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L2805
         L     2,0(5)
         MVC   0(4,5),8(2)
         B     @@L2801
@@L2852  EQU   *
         L     2,4(15)
         L     7,132(13)
         CL    2,4(7)
         BNL   @@L2800
         L     3,0(7)
         LR    15,2
         MH    15,=H'8'
         L     2,0(15,3)
         LA    5,3(0,0)
         CLR   2,5
         BNE   @@L2800
         L     2,4(15,3)
         L     3,8(6)
         L     2,8(2)
         CL    2,8(3)
         BNE   @@L2800
         B     @@L2792
@@L2849  EQU   *
         MVC   88(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(DELETE@R)
         BALR  14,15
         B     @@L2780
@@L2848  EQU   *
         L     3,40(6)
         LTR   3,3
         BE    @@L2779
         L     2,0(4)
         CL    2,4(3)
         BNE   @@L2779
         B     @@L2778
@@L2847  EQU   *
         SLR   2,2
         IC    2,2(7)
         ST    2,192(13)
         MVC   88(4,13),=F'0'
         L     3,4(3)
         LCR   2,3
         SR    2,9
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    3,15
         ST    7,88(13)
         ST    5,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GEN@ADD3)
         BALR  14,15
         LR    2,15
         LTR   15,15
         L     14,=A(@@L2665)
         BER   14
         MVC   88(4,13),=F'75'
         MVC   92(4,13),192(13)
         ST    5,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    8,15
         MVC   88(4,13),0(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
         L     3,148(13)
         LH    2,0(3)
         CLM   2,3,=H'106'
         BNE   @@L2770
         MVC   88(4,13),=F'0'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),=F'75'
         MVC   92(4,13),192(13)
         ST    5,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,140(13)
         B     @@L2770
@@L2846  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'54'
         BNE   @@L2769
         MVC   88(4,13),=F'0'
         SR    8,9
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    8,15
         ST    7,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         B     @@L2827
@@L2845  EQU   *
         L     7,200(13)
         LH    2,0(7)
         CLM   2,3,=H'54'
         BNE   @@L2768
         MVC   88(4,13),=F'0'
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),=F'0'
         L     2,24(6)
         LR    3,8
         A     3,4(2)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         ST    15,140(13)
         B     @@L2768
@@L2844  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'54'
         BNE   @@L2760
         ST    8,184(13)
         CLR   4,8
         BH    @@L2764
         LTR   4,4
         BL    @@L2763
         LA    2,1(0,0)
         CLR   4,2
         BE    @@L2762
         L     2,184(13)
         L     3,4+184(13)
         SRDL  2,32
         DR    2,4
         ST    2,184(13)
         ST    3,4+184(13)
@@L2764  EQU   *
         SLR   15,15
         L     7,184(13)
         LTR   7,7
         L     14,=A(@@L2665)
         BNER  14
         B     @@L2765
@@L2762  EQU   *
         MVC   184(4,13),=F'0'
         B     @@L2764
@@L2763  EQU   *
         L     3,184(13)
         SR    3,4
         ST    3,184(13)
         B     @@L2764
@@L2843  EQU   *
         SR    9,4
         B     @@L2759
@@L2842  EQU   *
         CLM   15,3,=H'54'
         BNE   @@L2754
         LR    2,8
         SR    2,4
         X     2,4(5)
         NR    2,7
         LTR   2,2
         BNE   @@L2754
         LR    9,4
         MVC   168(4,13),=F'1'
         MVC   172(4,13),=F'104'
         B     @@L2755
@@L2841  EQU   *
         L     3,200(13)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L2750
         S     8,4(3)
         AR    8,4
         BCTR  8,0
         ST    8,176(13)
         CLR   4,8
         BH    @@L2753
         LTR   4,4
         BL    @@L2752
         LA    2,1(0,0)
         CLR   4,2
         BE    @@L2751
         L     2,176(13)
         L     3,4+176(13)
         SRDL  2,32
         DR    2,4
         ST    2,176(13)
         ST    3,4+176(13)
@@L2753  EQU   *
         S     8,176(13)
         L     2,=V(CIRTX)
         MVC   200(4,13),256(2)
         B     @@L2750
@@L2751  EQU   *
         MVC   176(4,13),=F'0'
         B     @@L2753
@@L2752  EQU   *
         L     3,176(13)
         SR    3,4
         ST    3,176(13)
         B     @@L2753
@@L2840  EQU   *
         L     8,4(5)
         B     @@L2749
@@L2745  EQU   *
         SLR   3,3
         IC    3,2(5)
         B     @@L2826
@@L2839  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC62)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L2742
@@L2838  EQU   *
         L     7,124(13)
         L     2,8(7)
         LTR   2,2
         BNE   @@L2741
         L     2,12(7)
         LTR   2,2
         BNE   @@L2741
         LTR   8,8
         BE    @@L2741
         L     2,12(6)
         A     2,4(6)
         A     2,104(7)
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@28)
         BALR  14,15
         AR    2,15
         A     2,152(13)
         CL    2,4(11)
         BNE   @@L2741
         L     2,132(13)
         CL    6,8(2)
         BNE   @@L2741
         L     2,36(6)
         LTR   2,2
         BE    @@L2740
         B     @@L2741
@@L2837  EQU   *
         SLR   8,8
         B     @@L2722
@@L2836  EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=A(@@34)
         BALR  14,15
         AR    7,15
         B     @@L2726
@@L2835  EQU   *
         ST    5,88(13)
         L     2,44(3)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L2717
         MVC   164(4,13),=F'0'
         B     @@L2697
@@L2834  EQU   *
         L     2,16(4)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L2704
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
@@L2704  EQU   *
         LTR   2,2
         BE    @@L2707
         L     15,4(2)
         LH    2,0(15)
         CLM   2,3,=H'61'
         L     14,=A(@@L2854)
         BER   14
@@L2707  EQU   *
         L     12,0(,10)
         MVC   88(4,13),160(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         CLR   4,15
         B     @@PGE81
         DS    0F
         LTORG
         DS    0F
@@PGE81  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG82   EQU   *
         BE    @@L2710
         MVC   88(4,13),160(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         CLR   4,15
         BE    @@L2710
@@L2709  EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2700)
         BER   14
@@L2825  EQU   *
         L     12,4(,10)
         MVC   164(4,13),=F'0'
         L     14,=A(@@L2699)
         BR    14
@@L2710  EQU   *
         L     12,4(,10)
         ST    5,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L2709
         MVC   88(4,13),16(4)
         MVC   92(4,13),=A(@@39)
         MVC   96(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(NOTE@STO)
         BALR  14,15
         L     3,128(13)
         L     2,12(3)
         LTR   2,2
         L     14,=A(@@L2700)
         BER   14
         B     @@L2825
@@L2854  EQU   *
         L     12,4(,10)
         L     2,4(15)
         CL    2,0(6)
         L     14,=A(@@L2707)
         BNER  14
         L     14,=A(@@L2700)
         BR    14
@@L2833  EQU   *
         L     12,4(,10)
         L     5,148(13)
         L     3,8(5)
         L     2,=V(CIRTX)
         CL    3,256(2)
         L     14,=A(@@L2681)
         BNER  14
@@L2682  EQU   *
         L     12,4(,10)
         L     2,8(6)
         L     3,36(2)
         LH    2,0(3)
         CH    2,=H'54'
         L     14,=A(@@L2681)
         BNER  14
         L     4,4(3)
         LTR   4,4
         L     14,=A(@@L2681)
         BNLR  14
         L     3,24(6)
         LH    2,0(3)
         CLM   2,3,=H'54'
         BE    @@L2855
@@L2684  EQU   *
         L     12,4(,10)
         L     4,156(13)
         LTR   4,4
         L     14,=A(@@L2695)
         BER   14
@@L2694  EQU   *
         L     12,4(,10)
         LH    2,0(4)
         CLM   2,3,=H'36'
         L     14,=A(@@L2695)
         BER   14
         CLM   2,3,=H'33'
         BE    @@L2856
@@L2688  EQU   *
         L     12,4(,10)
         L     4,8(4)
         LTR   4,4
         BNE   @@L2694
         L     14,=A(@@L2695)
         BR    14
@@L2856  EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(11)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GCONDFL)
         BALR  14,15
         LTR   15,15
         BE    @@L2688
         L     2,8(6)
         L     5,4(15)
         CL    5,16(2)
         BNE   @@L2688
         LH    2,0(15)
         CLM   2,3,=H'107'
         BNE   @@L2688
         L     3,8(15)
         L     2,=V(CIRTX)
         CL    3,256(2)
         BNE   @@L2688
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),156(13)
         LA    1,88(,13)
         L     15,=V(REGSTBP)
         BALR  14,15
         LTR   15,15
         BNE   @@L2688
         L     2,8(6)
         L     2,36(2)
         L     2,4(2)
         L     3,=F'-1'
         CLR   2,3
         BNE   @@L2688
         ST    7,88(13)
         MVC   92(4,13),=F'8'
         ST    15,96(13)
@@L2830  EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L2857
@@L2693  EQU   *
         L     12,4(,10)
         OC    48(4,6),=F'536870912'
         L     14,=A(@@L2809)
         BR    14
@@L2857  EQU   *
         L     12,4(,10)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'8'
         L     2,8(6)
         MVC   96(4,13),16(2)
         MVC   100(4,13),28(7)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,28(7)
         B     @@L2693
@@L2855  EQU   *
         L     12,4(,10)
         L     3,4(3)
         LTR   3,3
         BNH   @@L2684
         LCR   2,4
         LR    8,3
         SRDA  8,32
         DR    8,2
         LTR   8,8
         BNE   @@L2684
         ST    7,88(13)
         MVC   92(4,13),=F'8'
         ST    8,96(13)
         B     @@L2830
@@L2832  EQU   *
         L     12,4(,10)
         L     3,8(2)
         LH    2,0(3)
         CLM   2,3,=H'54'
         L     14,=A(@@L2683)
         BNER  14
         L     2,4(3)
         L     3,=F'-1'
         CLR   2,3
         L     14,=A(@@L2683)
         BNER  14
         B     @@L2682
@@L2831  EQU   *
         L     12,4(,10)
         L     3,8(6)
         L     2,52(3)
         SRL   2,26
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L2676)
         BNER  14
         L     2,16(3)
         L     5,148(13)
         CL    2,4(5)
         L     14,=A(@@L2676)
         BNER  14
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,48(2)
         L     2,0(6)
         SLL   2,2
         L     3,0(2,3)
         ST    3,88(13)
         L     2,8(6)
         MVC   92(4,13),0(2)
         MVC   96(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(REG@USED)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2676)
         BNER  14
         L     14,=A(@@L2675)
         BR    14
@@L2665  EQU   *
         L     12,4(,10)
* Function check_dbra_loop epilogue
         PDPEPIL
* Function check_dbra_loop literal pool
         DS    0F
         LTORG
* Function check_dbra_loop page table
         DS    0F
@@PGT81  EQU   *
         DC    A(@@PG81)
         DC    A(@@PG82)
@@LC66   EQU   *
         DC    C'biv %d %s eliminated.'
         DC    X'15'
         DC    X'0'
@@LC67   EQU   *
         DC    C'was'
         DC    X'0'
@@LC68   EQU   *
         DC    C'can be'
         DC    X'0'
@@LC65   EQU   *
         DC    C'Cannot eliminate biv %d: biv used in insn %d.'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func maybe_eliminate_biv prologue
@@58     PDPPRLG CINDEX=83,FRAME=144,BASER=12,ENTRY=NO
         B     @@FEN83
         LTORG
@@FEN83  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG83   EQU   *
         LR    11,1
         L     10,=A(@@PGT83)
* Function maybe_eliminate_biv code
         L     7,0(11)
         L     8,4(11)
         L     2,88(7)
         A     2,=F'136'
         ST    2,120(13)
         L     2,8(8)
         MVC   124(4,13),16(2)
         L     4,104(7)
         C     4,108(7)
         BE    @@L2860
@@L2876  EQU   *
         LH    6,0(4)
         N     6,=XL4'0000FFFF'
         LR    9,4
         L     3,12(11)
         C     3,16(11)
         BL    @@L2864
         SLR   9,9
@@L2864  EQU   *
         L     3,=V(RTX@CLAS)
         IC    2,0(3,6)
         CLM   2,1,=XL1'89'
         BE    @@L2882
@@L2865  EQU   *
         A     6,=F'-32'
         LA    15,2(0,0)
         CLR   6,15
         BNH   @@L2883
@@L2873  EQU   *
         L     2,8(11)
         LTR   2,2
         BNE   @@L2884
@@L2861  EQU   *
         L     4,12(4)
         CL    4,108(7)
         BNE   @@L2876
@@L2860  EQU   *
         CL    4,108(7)
         BE    @@L2885
         SLR   15,15
         B     @@L2858
@@L2885  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L2878
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC66)
         MVC   96(4,13),0(8)
         L     2,=A(@@LC67)
         L     3,8(11)
         LTR   3,3
         BNE   @@L2880
         L     2,=A(@@LC68)
@@L2880  EQU   *
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L2878  EQU   *
         LA    15,1(0,0)
         B     @@L2858
@@L2884  EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'4'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L2861
         MVC   88(4,13),124(13)
         MVC   92(4,13),4(15)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L2861
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(REMNOTE)
         BALR  14,15
         B     @@L2861
@@L2883  EQU   *
         MVC   88(4,13),124(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L2873
         ST    7,88(13)
         MVC   92(4,13),16(4)
         ST    4,96(13)
         ST    8,100(13)
         MVC   104(4,13),8(11)
         MVC   108(4,13),=F'0'
         ST    9,112(13)
         LA    1,88(,13)
         L     15,=A(@@90)
         BALR  14,15
         LTR   15,15
         BNE   @@L2873
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L2860
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC65)
         MVC   96(4,13),0(8)
         MVC   100(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L2860
@@L2882  EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'7'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L2865
         L     5,4(15)
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L2886
         SLR   2,2
@@L2868  EQU   *
         LTR   2,2
         BE    @@L2865
         L     15,4(2)
         LH    2,0(15)
         CLM   2,3,=H'61'
         BNE   @@L2865
         L     2,4(15)
         L     15,120(13)
         CL    2,4(15)
         BNL   @@L2865
         MVC   128(4,13),0(15)
         LR    15,2
         MH    15,=H'8'
         L     2,128(13)
         L     2,0(15,2)
         LA    3,3(0,0)
         CLR   2,3
         BNE   @@L2865
         L     3,128(13)
         L     2,4(15,3)
         L     3,8(8)
         L     2,8(2)
         CL    2,8(3)
         BNE   @@L2865
         LR    4,5
         B     @@L2865
@@L2886  EQU   *
         L     2,16(5)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L2868
         ST    5,88(13)
         MVC   92(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
         B     @@L2868
@@L2858  EQU   *
* Function maybe_eliminate_biv epilogue
         PDPEPIL
* Function maybe_eliminate_biv literal pool
         DS    0F
         LTORG
* Function maybe_eliminate_biv page table
         DS    0F
@@PGT83  EQU   *
         DC    A(@@PG83)
         DS    0F
* X-func li_firstp prologue
LI@FIRST PDPPRLG CINDEX=84,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN84
         LTORG
@@FEN84  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG84   EQU   *
         LR    11,1
         L     10,=A(@@PGT84)
* Function li_firstp code
         L     8,0(11)
         L     7,4(11)
         LR    15,8
         LR    6,7
@@L2888  EQU   *
         CLR   6,8
         BE    @@L2892
         LTR   15,15
         BE    @@L2892
         CLR   15,7
         BE    @@L2905
         LTR   6,6
         BE    @@L2905
         L     4,4(15)
         L     2,=A(MAX@UID@)
         L     2,0(2)
         CR    4,2
         BNL   @@L2895
         L     5,4(6)
         CR    5,2
         BNL   @@L2895
         LH    2,0(15)
         CH    2,=H'37'
         BNE   @@L2906
@@L2895  EQU   *
         L     2,=A(MAX@UID@)
         C     4,0(2)
         BNL   @@L2903
         LH    2,0(15)
         CH    2,=H'37'
         BE    @@L2903
@@L2902  EQU   *
         L     3,4(6)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BL    @@L2888
         L     6,12(6)
         B     @@L2888
@@L2903  EQU   *
         L     15,12(15)
         B     @@L2902
@@L2906  EQU   *
         L     2,=A(UID@LUID)
         L     3,0(2)
         MH    4,=H'4'
         L     2,0(4,3)
         SLR   15,15
         MH    5,=H'4'
         C     2,0(5,3)
         BH    @@L2887
@@L2905  EQU   *
         LA    15,1(0,0)
         B     @@L2887
@@L2892  EQU   *
         SLR   15,15
@@L2887  EQU   *
* Function li_firstp epilogue
         PDPEPIL
* Function li_firstp literal pool
         DS    0F
         LTORG
* Function li_firstp page table
         DS    0F
@@PGT84  EQU   *
         DC    A(@@PG84)
         DS    0F
* S-func biv_elimination_giv_has_0_offset prologue
@@91     PDPPRLG CINDEX=85,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN85
         LTORG
@@FEN85  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG85   EQU   *
         LR    11,1
         L     10,=A(@@PGT85)
* Function biv_elimination_giv_has_0_offset code
         L     5,0(11)
         L     4,4(11)
         L     3,8(11)
         L     2,52(4)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         BNE   @@L2911
@@L2908  EQU   *
         LA    15,1(0,0)
         B     @@L2907
@@L2911  EQU   *
         MVC   88(4,13),0(4)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(LI@FIRST)
         BALR  14,15
         LTR   15,15
         BE    @@L2910
         ST    3,88(13)
         MVC   92(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(LI@FIRST)
         BALR  14,15
         LTR   15,15
         BNE   @@L2909
@@L2910  EQU   *
         MVC   88(4,13),0(5)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(LI@FIRST)
         BALR  14,15
         LTR   15,15
         BE    @@L2908
         ST    3,88(13)
         MVC   92(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(LI@FIRST)
         BALR  14,15
         LTR   15,15
         BE    @@L2908
@@L2909  EQU   *
         SLR   15,15
@@L2907  EQU   *
* Function biv_elimination_giv_has_0_offset epilogue
         PDPEPIL
* Function biv_elimination_giv_has_0_offset literal pool
         DS    0F
         LTORG
* Function biv_elimination_giv_has_0_offset page table
         DS    0F
@@PGT85  EQU   *
         DC    A(@@PG85)
         DS    0F
* S-func maybe_eliminate_biv_1 prologue
@@90     PDPPRLG CINDEX=86,FRAME=128,BASER=12,ENTRY=NO
         B     @@FEN86
         LTORG
@@FEN86  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG86   EQU   *
         LR    11,1
         L     10,=A(@@PGT86)
* Function maybe_eliminate_biv_1 code
         SLR   8,8
         SLR   9,9
         L     2,4(11)
         LH    7,0(2)
         N     7,=XL4'0000FFFF'
         L     3,12(11)
         L     2,8(3)
         L     4,16(2)
         SLR   5,5
         IC    5,2(4)
         ST    5,120(13)
         LA    6,66(0,0)
         CLR   7,6
         L     14,=A(@@L3002)
         BER   14
         BH    @@L3011
         LA    2,47(0,0)
         CLR   7,2
         BE    @@L2916
         X     4,4(11)
         LPR   2,4
         LCR   15,2
         SRL   15,31
         LA    3,61(0,0)
         CR    7,3
         L     14,=A(@@L2912)
         BER   14
@@L2913  EQU   *
         L     12,0(,10)
         LR    2,7
         MH    2,=H'4'
         L     3,=V(RTX@FORM)
         L     9,0(2,3)
         L     2,=V(RTX@LENG)
         SLR   5,5
         IC    5,0(2,7)
         BCTR  5,0
         LTR   5,5
         BL    @@L3041
         LR    7,5
         MH    7,=H'4'
         L     6,4(11)
         AR    6,7
         A     6,=F'4'
@@L3029  EQU   *
         SLR   2,2
         IC    2,0(5,9)
         LA    3,133(0,0)
         CLR   2,3
         BE    @@L3017
         LA    4,197(0,0)
         CR    2,4
         BE    @@L3020
@@L3014  EQU   *
         A     6,=F'-4'
         A     7,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L3029
@@L3041  EQU   *
         L     12,0(,10)
         LA    15,1(0,0)
         L     14,=A(@@L2912)
         BR    14
@@L3020  EQU   *
         LR    8,7
         L     2,0(6)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    @@L3014
@@L3026  EQU   *
         MVC   88(4,13),0(11)
         L     2,4(11)
         L     3,4(2,8)
         LR    2,4
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         MVC   104(4,13),16(11)
         MVC   108(4,13),20(11)
         MVC   112(4,13),24(11)
         LA    1,88(,13)
         L     15,=A(@@90)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2912)
         BER   14
         BCTR  4,0
         LTR   4,4
         BNL   @@L3026
         B     @@L3014
@@L3017  EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(6)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         MVC   104(4,13),16(11)
         MVC   108(4,13),20(11)
         MVC   112(4,13),24(11)
         LA    1,88(,13)
         L     15,=A(@@90)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2912)
         BER   14
         B     @@L3014
@@L2916  EQU   *
         L     3,4(11)
         L     2,4(3)
         LA    15,1(0,0)
         CLR   2,4
         L     14,=A(@@L2912)
         BER   14
         L     5,12(11)
         L     3,16(5)
         LR    5,3
         LTR   3,3
         BE    @@L3031
@@L2923  EQU   *
         L     15,12(3)
         LA    6,1(0,0)
         CLR   15,6
         BE    @@L3053
@@L2920  EQU   *
         L     3,68(3)
         LTR   3,3
         BNE   @@L2923
@@L3031  EQU   *
         L     2,4(11)
         L     3,4(2)
         L     2,=V(GLBRTL)
         CL    3,4(2)
         BNE   @@L2913
         L     3,4(11)
         L     2,8(3)
         CLR   2,4
         BNE   @@L2913
         LR    3,5
         LTR   5,5
         BE    @@L3033
@@L2935  EQU   *
         L     3,68(3)
         LTR   3,3
         BNE   @@L2935
@@L3033  EQU   *
         LR    3,5
         LTR   5,5
         BE    @@L2913
@@L2950  EQU   *
         L     4,32(3)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L3054
@@L2938  EQU   *
         L     3,68(3)
         LTR   3,3
         BNE   @@L2950
         B     @@L2913
@@L3054  EQU   *
         L     2,=V(CIRTX)
         CL    4,256(2)
         BE    @@L2938
         L     2,52(3)
         N     2,=F'822083584'
         L     4,=F'268435456'
         CLR   2,4
         BNE   @@L2938
         L     2,24(3)
         CL    2,120(13)
         BNE   @@L2938
         L     5,36(3)
         LH    4,0(5)
         LR    2,4
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L2941
         CLM   4,3,=H'58'
         BE    @@L2941
         L     2,0(5)
         N     2,=F'-65535'
         L     5,=F'3997697'
         CLR   2,5
         BNE   @@L2938
@@L2941  EQU   *
         L     6,12(11)
         MVC   88(4,13),8(6)
         ST    3,92(13)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@91)
         BALR  14,15
         LTR   15,15
         BE    @@L2938
         L     2,16(11)
         LTR   2,2
         BE    @@L3041
         L     2,32(3)
         L     2,4(2)
         LTR   2,2
         BL    @@L3055
         MVC   88(4,13),36(3)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         MVC   88(4,13),=F'74'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),4(3)
         ST    15,100(13)
@@L3051  EQU   *
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    6,15
         MVC   88(4,13),36(3)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@89)
         BALR  14,15
         MVC   88(4,13),8(11)
         L     4,8(11)
         L     2,16(4)
         A     2,=F'8'
         ST    2,92(13)
         ST    6,96(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         LR    5,15
         LTR   15,15
         BNE   @@L3041
         L     2,4(3)
         SLR   4,4
         IC    4,2(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),36(3)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    5,92(13)
         MVC   96(4,13),24(11)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(LI@EMBEF)
         BALR  14,15
         L     2,32(3)
         L     2,4(2)
         X     2,=F'-1'
         SRL   2,31
         SLL   2,2
         ST    4,4(6,2)
         MVC   88(4,13),8(11)
         L     4,8(11)
         L     2,16(4)
         A     2,=F'8'
         ST    2,92(13)
         ST    6,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         LTR   15,15
         BE    @@L2938
         B     @@L3041
@@L3055  EQU   *
         MVC   88(4,13),36(3)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         MVC   88(4,13),=F'74'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         MVC   100(4,13),4(3)
         B     @@L3051
@@L3053  EQU   *
         CL    2,16(3)
         BNE   @@L2920
         B     @@L2912
@@L3011  EQU   *
         LA    5,74(0,0)
         CLR   7,5
         BE    @@L2961
         BL    @@L2913
         LR    2,7
         A     2,=F'-102'
         LA    6,9(0,0)
         CLR   2,6
         BH    @@L2913
@@L2961  EQU   *
         L     5,4(11)
         L     3,4(5)
         CLR   3,4
         BE    @@L3056
         L     6,4(11)
         L     2,8(6)
         CLR   2,4
         BNE   @@L2913
         LR    6,3
         SLR   7,7
@@L2963  EQU   *
         LH    3,0(6)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L2967
         CLM   3,3,=H'54'
         BE    @@L2967
         CLM   3,3,=H'55'
         BE    @@L2967
         CLM   3,3,=H'58'
         BE    @@L2967
         CLM   3,3,=H'134'
         BE    @@L2967
         CLM   3,3,=H'56'
         BE    @@L2967
         CLM   3,3,=H'140'
         BE    @@L2967
         CLM   3,3,=H'61'
         BE    @@L2991
         CLM   3,3,=H'66'
         BE    @@L2991
@@L2989  EQU   *
         SLR   15,15
         B     @@L2912
@@L2991  EQU   *
         MVC   88(4,13),0(11)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LA    6,1(0,0)
         CLR   15,6
         BNE   @@L2989
         L     2,12(11)
         L     3,16(2)
         LTR   3,3
         BE    @@L2989
@@L3001  EQU   *
         L     3,68(3)
         LTR   3,3
         BNE   @@L3001
         B     @@L2989
@@L2967  EQU   *
         L     2,12(11)
         L     3,16(2)
         LTR   3,3
         BE    @@L3036
@@L2979  EQU   *
         L     4,32(3)
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L3057
@@L2970  EQU   *
         L     3,68(3)
         LTR   3,3
         BNE   @@L2979
@@L3036  EQU   *
         L     5,12(11)
         L     3,16(5)
         LTR   3,3
         BE    @@L2989
@@L2988  EQU   *
         L     3,68(3)
         LTR   3,3
         BNE   @@L2988
         B     @@L2989
@@L3057  EQU   *
         L     2,4(4)
         LTR   2,2
         BNH   @@L2970
         L     5,36(3)
         LH    4,0(5)
         LR    2,4
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L2973
         CLM   4,3,=H'58'
         BE    @@L2973
         L     2,0(5)
         N     2,=F'-65535'
         L     4,=F'3997697'
         CLR   2,4
         BNE   @@L2970
@@L2973  EQU   *
         L     2,52(3)
         N     2,=F'822083584'
         L     5,=F'268435456'
         CLR   2,5
         BNE   @@L2970
         L     2,24(3)
         CL    2,120(13)
         BNE   @@L2970
         L     2,12(11)
         MVC   88(4,13),8(2)
         ST    3,92(13)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@91)
         BALR  14,15
         LTR   15,15
         BE    @@L2970
         L     4,16(11)
         LTR   4,4
         BE    @@L3041
         MVC   88(4,13),8(11)
         LA    2,1(0,0)
         SR    2,7
         MH    2,=H'4'
         A     2,4(11)
         A     2,=F'4'
         ST    2,92(13)
         MVC   96(4,13),4(3)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         LH    2,0(6)
         CLM   2,3,=H'54'
         BE    @@L3058
@@L2976  EQU   *
         MVC   88(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),0(11)
         ST    6,92(13)
         MVC   96(4,13),32(3)
         MVC   100(4,13),36(3)
         ST    15,104(13)
         MVC   108(4,13),20(11)
         MVC   112(4,13),24(11)
         LA    1,88(,13)
         L     15,=V(LI@AMEB)
         BALR  14,15
         MVC   88(4,13),8(11)
         LR    2,7
         MH    2,=H'4'
         A     2,4(11)
         A     2,=F'4'
         ST    2,92(13)
         ST    4,96(13)
@@L3052  EQU   *
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(APPLY@CH)
         BALR  14,15
         LTR   15,15
         BE    @@L2970
         B     @@L3041
@@L3058  EQU   *
         L     2,32(3)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L2976
         L     2,36(3)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L2976
         MVC   88(4,13),=F'0'
         L     2,32(3)
         L     9,4(2)
         M     8,4(6)
         L     2,36(3)
         L     2,4(2)
         AR    2,9
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GRCINT)
         BALR  14,15
         MVC   88(4,13),8(11)
         LR    2,7
         MH    2,=H'4'
         A     2,4(11)
         A     2,=F'4'
         ST    2,92(13)
         ST    15,96(13)
         B     @@L3052
@@L3056  EQU   *
         L     6,8(5)
         LA    7,1(0,0)
         B     @@L2963
@@L3002  EQU   *
         L     4,12(11)
         L     3,16(4)
         LTR   3,3
         BE    @@L2913
@@L3008  EQU   *
         L     2,12(3)
         LTR   2,2
         BNE   @@L3005
         L     2,4(11)
         A     2,=F'4'
         CL    2,20(3)
         BE    @@L3041
@@L3005  EQU   *
         L     3,68(3)
         LTR   3,3
         BNE   @@L3008
         B     @@L2913
@@L2912  EQU   *
* Function maybe_eliminate_biv_1 epilogue
         PDPEPIL
* Function maybe_eliminate_biv_1 literal pool
         DS    0F
         LTORG
* Function maybe_eliminate_biv_1 page table
         DS    0F
@@PGT86  EQU   *
         DC    A(@@PG86)
         DS    0F
* S-func last_use_this_basic_block prologue
@@79     PDPPRLG CINDEX=87,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN87
         LTORG
@@FEN87  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG87   EQU   *
         LR    11,1
         L     10,=A(@@PGT87)
* Function last_use_this_basic_block code
         L     4,0(11)
         L     15,4(11)
         LTR   15,15
         BE    @@L3061
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L3061
         CLM   2,3,=H'33'
         BE    @@L3061
@@L3066  EQU   *
         L     2,4(4)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     2,16(2)
         L     2,4(2)
         CL    2,4(15)
         BE    @@L3068
         L     15,12(15)
         LTR   15,15
         BE    @@L3061
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L3061
         CLM   2,3,=H'33'
         BNE   @@L3066
@@L3061  EQU   *
         SLR   15,15
         B     @@L3059
@@L3068  EQU   *
         LA    15,1(0,0)
@@L3059  EQU   *
* Function last_use_this_basic_block epilogue
         PDPEPIL
* Function last_use_this_basic_block literal pool
         DS    0F
         LTORG
* Function last_use_this_basic_block page table
         DS    0F
@@PGT87  EQU   *
         DC    A(@@PG87)
         DS    0F
* S-func record_initial prologue
@@51     PDPPRLG CINDEX=88,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN88
         LTORG
@@FEN88  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG88   EQU   *
         LR    11,1
         L     10,=A(@@PGT88)
* Function record_initial code
         L     3,0(11)
         L     15,8(11)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L3069
         L     2,4(3)
         CL    2,4(15)
         BNL   @@L3069
         L     3,0(15)
         LR    15,2
         MH    15,=H'8'
         L     2,0(15,3)
         LA    4,1(0,0)
         CLR   2,4
         BNE   @@L3069
         L     15,4(15,3)
         L     2,40(15)
         LTR   2,2
         BNE   @@L3069
         L     2,=A(@@50)
         MVC   40(4,15),0(2)
         MVC   44(4,15),4(11)
@@L3069  EQU   *
* Function record_initial epilogue
         PDPEPIL
* Function record_initial literal pool
         DS    0F
         LTORG
* Function record_initial page table
         DS    0F
@@PGT88  EQU   *
         DC    A(@@PG88)
         DS    0F
* S-func update_reg_last_use prologue
@@89     PDPPRLG CINDEX=89,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN89
         LTORG
@@FEN89  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG89   EQU   *
         LR    11,1
         L     10,=A(@@PGT89)
* Function update_reg_last_use code
         L     9,0(11)
         LH    2,0(9)
         CH    2,=H'61'
         BE    @@L3094
@@L3074  EQU   *
         LH    4,0(9)
         N     4,=XL4'0000FFFF'
         LR    3,4
         MH    3,=H'4'
         L     2,=V(RTX@FORM)
         L     2,0(3,2)
         ST    2,104(13)
         L     2,=V(RTX@LENG)
         SLR   5,5
         IC    5,0(2,4)
         BCTR  5,0
         LTR   5,5
         BL    @@L3073
         LR    7,5
         MH    7,=H'4'
         LR    6,7
         AR    6,9
         A     6,=F'4'
@@L3091  EQU   *
         L     3,104(13)
         IC    2,0(5,3)
         CLM   2,1,=XL1'85'
         BE    @@L3095
         SLL   2,24
         SRA   2,24
         C     2,=F'-59'
         BE    @@L3096
@@L3080  EQU   *
         A     6,=F'-4'
         A     7,=F'-4'
         BCTR  5,0
         LTR   5,5
         BNL   @@L3091
         B     @@L3073
@@L3096  EQU   *
         LR    8,7
         L     2,0(6)
         L     4,0(2)
         BCTR  4,0
         LTR   4,4
         BL    @@L3080
@@L3090  EQU   *
         L     3,4(9,8)
         LR    2,4
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,88(13)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@89)
         BALR  14,15
         BCTR  4,0
         LTR   4,4
         BNL   @@L3090
         B     @@L3080
@@L3095  EQU   *
         MVC   88(4,13),0(6)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@89)
         BALR  14,15
         B     @@L3080
@@L3094  EQU   *
         L     3,4(9)
         L     2,=A(MXRGBL)
         CL    3,0(2)
         BNL   @@L3074
         L     2,4(11)
         L     5,4(2)
         L     2,=A(MAX@UID@)
         C     5,0(2)
         BNL   @@L3074
         MH    3,=H'4'
         L     2,=V(REG@N@IN)
         A     3,0(2)
         L     6,16(3)
         L     2,=A(UID@LUID)
         L     4,0(2)
         L     2,4(6)
         SLL   2,2
         L     3,0(2,4)
         LR    2,5
         MH    2,=H'4'
         C     3,0(2,4)
         BNL   @@L3074
         ST    5,4(6)
@@L3073  EQU   *
* Function update_reg_last_use epilogue
         PDPEPIL
* Function update_reg_last_use literal pool
         DS    0F
         LTORG
* Function update_reg_last_use page table
         DS    0F
@@PGT89  EQU   *
         DC    A(@@PG89)
         DS    0F
* X-func canonicalize_condition prologue
CANONICA PDPPRLG CINDEX=90,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN90
         LTORG
@@FEN90  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG90   EQU   *
         LR    11,1
         L     10,=A(@@PGT90)
* Function canonicalize_condition code
         L     3,4(11)
         L     6,0(11)
         MVC   104(4,13),=F'0'
         L     2,0(3)
         LR    8,2
         SRL   8,16
         SRL   2,8
         ST    2,108(13)
         NC    108(4,13),=F'255'
         L     5,4(3)
         L     9,8(3)
         L     2,8(11)
         LTR   2,2
         L     14,=A(@@L3166)
         BNER  14
@@L3098  EQU   *
         L     12,0(,10)
         LR    15,8
         LTR   8,8
         L     14,=A(@@L3097)
         BER   14
         L     2,12(11)
         LTR   2,2
         BE    @@L3100
         ST    6,0(2)
@@L3100  EQU   *
         L     2,=V(RTX@CLAS)
         IC    2,0(2,8)
         CLM   2,1,=XL1'4C'
         BE    @@L3167
@@L3102  EQU   *
         L     12,0(,10)
         LH    3,0(5)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L3143
         CLM   3,3,=H'54'
         BE    @@L3143
         CLM   3,3,=H'55'
         BE    @@L3143
         CLM   3,3,=H'58'
         BE    @@L3143
         CLM   3,3,=H'134'
         BE    @@L3143
         CLM   3,3,=H'56'
         BE    @@L3143
         CLM   3,3,=H'140'
         BE    @@L3143
@@L3142  EQU   *
         SLR   3,3
         IC    3,2(5)
         LR    6,3
         MH    6,=H'4'
         L     2,=V(MODE@CLA)
         L     2,0(6,2)
         SLR   15,15
         LA    4,4(0,0)
         CLR   2,4
         L     14,=A(@@L3097)
         BER   14
         LH    2,0(9)
         CLM   2,3,=H'54'
         BE    @@L3168
@@L3145  EQU   *
         L     2,=V(GLBRTL)
         CL    5,4(2)
         BE    @@L3165
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         ST    5,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         L     14,=A(@@L3097)
         BR    14
@@L3165  EQU   *
         L     12,0(,10)
         SLR   15,15
         L     14,=A(@@L3097)
         BR    14
@@L3168  EQU   *
         IC    2,2(5)
         CLM   2,1,=XL1'00'
         BE    @@L3145
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         CLM   3,3,=H'32'
         BH    @@L3145
         L     4,4(9)
         L     2,=V(MODE@MAS)
         L     15,0(6,2)
         LA    2,106(0,0)
         CLR   8,2
         BE    @@L3147
         BH    @@L3157
         LA    2,104(0,0)
         CLR   8,2
         BNE   @@L3145
         NR    15,4
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LA    2,1(0,0)
         SLL   2,0(3)
         CLR   15,2
         BE    @@L3145
         LA    8,105(0,0)
@@L3164  EQU   *
         BCTR  4,0
@@L3162  EQU   *
         ST    4,88(13)
         SLR   2,2
         IC    2,2(5)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@INT@)
         BALR  14,15
         LR    9,15
         B     @@L3145
@@L3157  EQU   *
         LA    3,108(0,0)
         CLR   8,3
         BE    @@L3153
         LA    2,110(0,0)
         CLR   8,2
         BNE   @@L3145
         CLR   4,15
         BNL   @@L3145
         LA    8,111(0,0)
@@L3163  EQU   *
         A     4,=F'1'
         B     @@L3162
@@L3153  EQU   *
         LTR   4,4
         BE    @@L3145
         LA    8,109(0,0)
         B     @@L3164
@@L3147  EQU   *
         SRL   15,1
         CLR   4,15
         BE    @@L3145
         LA    8,107(0,0)
         B     @@L3163
@@L3143  EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         LR    8,15
         LR    2,5
         LR    5,9
         LR    9,2
         B     @@L3142
@@L3167  EQU   *
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'4'
         L     3,=V(CONST@TI)
         CL    9,0(2,3)
         BNE   @@L3102
         CL    5,16(11)
         BE    @@L3102
@@L3141  EQU   *
         SLR   7,7
         L     2,=V(GLBRTL)
         CL    5,4(2)
         BE    @@L3169
@@L3105  EQU   *
         LH    2,0(5)
         CLM   2,3,=H'74'
         BE    @@L3170
         CLM   2,3,=H'61'
         BNE   @@L3102
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BE    @@L3102
         LH    2,0(15)
         CLM   2,3,=H'32'
         BNE   @@L3102
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(SET@OF)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L3118
         LH    2,0(15)
         CLM   2,3,=H'47'
         BNE   @@L3102
         MVC   88(4,13),4(15)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L3102
@@L3118  EQU   *
         LTR   4,4
         BE    @@L3120
         L     2,4(4)
         SLR   7,7
         IC    7,2(2)
         L     15,8(4)
         LH    2,0(15)
         CLM   2,3,=H'74'
         BE    @@L3122
         LA    4,102(0,0)
         CLR   8,4
         BE    @@L3123
         LA    2,107(0,0)
         CLR   8,2
         BE    @@L3171
@@L3121  EQU   *
         LA    4,103(0,0)
         CLR   8,4
         BE    @@L3129
         LA    2,104(0,0)
         CLR   8,2
         BNE   @@L3102
         LR    3,7
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    4,0(3,2)
         CLM   4,3,=H'32'
         BH    @@L3102
         LR    2,7
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L3102
         LR    3,4
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LA    2,1(0,0)
         SRA   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    @@L3102
@@L3129  EQU   *
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L3102
         MVC   116(4,13),=F'0'
         L     4,=V(MODE@CLA)
         L     2,108(13)
         MH    2,=H'4'
         L     2,0(2,4)
         LA    3,4(0,0)
         CLR   2,3
         BE    @@L3131
         MVC   116(4,13),=F'1'
@@L3131  EQU   *
         SLR   3,3
         LR    2,7
         MH    2,=H'4'
         L     2,0(2,4)
         LA    4,4(0,0)
         CLR   2,4
         BE    @@L3172
@@L3132  EQU   *
         L     2,116(13)
         CLR   2,3
         BNE   @@L3130
         L     3,108(13)
         LTR   3,3
         BE    @@L3130
         LTR   7,7
         BNE   @@L3102
@@L3130  EQU   *
         MVC   104(4,13),=F'1'
@@L3161  EQU   *
         LR    7,15
@@L3134  EQU   *
         LTR   7,7
         BE    @@L3101
         LH    3,0(7)
         N     3,=XL4'0000FFFF'
         L     2,=V(RTX@CLAS)
         IC    2,0(2,3)
         CLM   2,1,=XL1'4C'
         BE    @@L3173
@@L3137  EQU   *
         L     4,104(13)
         LTR   4,4
         BNE   @@L3174
@@L3138  EQU   *
         L     5,4(7)
         L     9,8(7)
         L     2,12(11)
         LTR   2,2
         BE    @@L3101
         ST    6,0(2)
@@L3101  EQU   *
         L     2,=V(RTX@CLAS)
         IC    2,0(2,8)
         CLM   2,1,=XL1'4C'
         BNE   @@L3102
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'4'
         L     3,=V(CONST@TI)
         CL    9,0(2,3)
         BNE   @@L3102
         CL    5,16(11)
         BNE   @@L3141
         B     @@L3102
@@L3174  EQU   *
         ST    7,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         LR    8,15
         LTR   15,15
         BE    @@L3097
         MVC   104(4,13),=F'0'
         B     @@L3138
@@L3173  EQU   *
         LR    8,3
         B     @@L3137
@@L3172  EQU   *
         LA    3,1(0,0)
         B     @@L3132
@@L3171  EQU   *
         LR    2,7
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L3121
         LR    3,7
         MH    3,=H'2'
         L     2,=V(MODE@BIT)
         LH    3,0(3,2)
         CLM   3,3,=H'32'
         BH    @@L3121
         N     3,=XL4'0000FFFF'
         BCTR  3,0
         LA    2,1(0,0)
         SRA   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    @@L3121
@@L3123  EQU   *
         LH    2,0(15)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'4C'
         BNE   @@L3121
@@L3122  EQU   *
         MVC   112(4,13),=F'0'
         L     4,=V(MODE@CLA)
         L     2,108(13)
         MH    2,=H'4'
         L     2,0(2,4)
         LA    3,4(0,0)
         CLR   2,3
         BE    @@L3125
         MVC   112(4,13),=F'1'
@@L3125  EQU   *
         SLR   3,3
         LR    2,7
         MH    2,=H'4'
         L     2,0(2,4)
         LA    4,4(0,0)
         CLR   2,4
         BE    @@L3175
@@L3126  EQU   *
         L     2,112(13)
         CLR   2,3
         BNE   @@L3161
         L     3,108(13)
         LTR   3,3
         BE    @@L3161
         LTR   7,7
         BE    @@L3161
         B     @@L3121
@@L3175  EQU   *
         LA    3,1(0,0)
         B     @@L3126
@@L3120  EQU   *
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(RSETP)
         BALR  14,15
         LTR   15,15
         BE    @@L3134
         B     @@L3102
@@L3170  EQU   *
         L     9,8(5)
         L     5,4(5)
         B     @@L3101
@@L3169  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BE    @@L3165
         LH    2,0(15)
         CLM   2,3,=H'32'
         BNE   @@L3165
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3176
         LR    4,7
@@L3109  EQU   *
         LTR   4,4
         BE    @@L3165
         L     3,4(4)
         L     2,=V(GLBRTL)
         CL    3,4(2)
         BNE   @@L3165
         L     5,8(4)
         SLR   2,2
         IC    2,2(5)
         MH    2,=H'4'
         L     3,=V(CONST@TI)
         L     9,0(2,3)
         L     3,12(11)
         LTR   3,3
         BE    @@L3105
         ST    6,0(3)
         B     @@L3105
@@L3176  EQU   *
         L     2,16(15)
         LH    3,0(2)
         LR    4,2
         CLM   3,3,=H'47'
         BE    @@L3109
         ST    15,88(13)
         MVC   92(4,13),16(15)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    4,15
         B     @@L3109
@@L3166  EQU   *
         ST    3,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(REVCOCOD)
         BALR  14,15
         LR    8,15
         B     @@L3098
@@L3097  EQU   *
* Function canonicalize_condition epilogue
         PDPEPIL
* Function canonicalize_condition literal pool
         DS    0F
         LTORG
* Function canonicalize_condition page table
         DS    0F
@@PGT90  EQU   *
         DC    A(@@PG90)
         DS    0F
* X-func gcond prologue
GCOND    PDPPRLG CINDEX=91,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN91
         LTORG
@@FEN91  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG91   EQU   *
         LR    11,1
         L     10,=A(@@PGT91)
* Function gcond code
         L     3,0(11)
         LH    2,0(3)
         CLM   2,3,=H'33'
         BE    @@L3181
@@L3179  EQU   *
         SLR   15,15
         B     @@L3177
@@L3181  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LTR   15,15
         BE    @@L3179
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(PC@SET)
         BALR  14,15
         L     2,8(15)
         L     4,4(2)
         SLR   5,5
         L     15,12(2)
         LH    2,0(15)
         CLM   2,3,=H'67'
         BE    @@L3182
@@L3180  EQU   *
         ST    3,88(13)
         ST    4,92(13)
         ST    5,96(13)
         MVC   100(4,13),4(11)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(CANONICA)
         BALR  14,15
         B     @@L3177
@@L3182  EQU   *
         L     2,4(15)
         CL    2,32(3)
         BNE   @@L3180
         LA    5,1(0,0)
         B     @@L3180
@@L3177  EQU   *
* Function gcond epilogue
         PDPEPIL
* Function gcond literal pool
         DS    0F
         LTORG
* Function gcond page table
         DS    0F
@@PGT91  EQU   *
         DC    A(@@PG91)
         DS    0F
* X-func gcondfl prologue
GCONDFL  PDPPRLG CINDEX=92,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN92
         LTORG
@@FEN92  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG92   EQU   *
         LR    11,1
         L     10,=A(@@PGT92)
* Function gcondfl code
         L     2,0(11)
         MVC   88(4,13),4(11)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GCOND)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L3185
         ST    2,88(13)
         MVC   92(4,13),4(15)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LTR   15,15
         BNE   @@L3186
@@L3185  EQU   *
         LR    15,3
         B     @@L3183
@@L3186  EQU   *
         ST    2,88(13)
         MVC   92(4,13),8(3)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L3185
         LH    2,0(3)
         N     2,=XL4'0000FFFF'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(SWAP@CON)
         BALR  14,15
         ST    15,88(13)
         ST    4,92(13)
         MVC   96(4,13),8(3)
         MVC   100(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
@@L3183  EQU   *
* Function gcondfl epilogue
         PDPEPIL
* Function gcondfl literal pool
         DS    0F
         LTORG
* Function gcondfl page table
         DS    0F
@@PGT92  EQU   *
         DC    A(@@PG92)
         DS    0F
* S-func indirect_jump_in_function_p prologue
@@8      PDPPRLG CINDEX=93,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN93
         LTORG
@@FEN93  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG93   EQU   *
         LR    11,1
         L     10,=A(@@PGT93)
* Function indirect_jump_in_function_p code
         L     2,0(11)
         LTR   2,2
         BE    @@L3195
@@L3193  EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(COMPUTED)
         BALR  14,15
         LA    3,1(0,0)
         LTR   15,15
         BNE   @@L3187
         L     2,12(2)
         LTR   2,2
         BNE   @@L3193
@@L3195  EQU   *
         SLR   3,3
@@L3187  EQU   *
         LR    15,3
* Function indirect_jump_in_function_p epilogue
         PDPEPIL
* Function indirect_jump_in_function_p literal pool
         DS    0F
         LTORG
* Function indirect_jump_in_function_p page table
         DS    0F
@@PGT93  EQU   *
         DC    A(@@PG93)
         DS    0F
* S-func insert_loop_mem prologue
@@36     PDPPRLG CINDEX=94,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN94
         LTORG
@@FEN94  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG94   EQU   *
         LR    11,1
         L     10,=A(@@PGT94)
* Function insert_loop_mem code
         L     4,4(11)
         L     2,0(11)
         L     5,0(2)
         LR    15,5
         LTR   5,5
         BE    @@L3196
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     15,=F'-1'
         LA    3,49(0,0)
         CLR   2,3
         BE    @@L3196
         BH    @@L3205
         LA    5,3(0,0)
         CLR   2,5
         BE    @@L3196
@@L3219  EQU   *
         SLR   15,15
         B     @@L3196
@@L3205  EQU   *
         L     15,=F'-1'
         LA    3,55(0,0)
         CLR   2,3
         BE    @@L3196
         LA    3,66(0,0)
         CR    2,3
         BNE   @@L3219
         SLR   3,3
         C     3,88(4)
         BNL   @@L3218
         LR    6,3
@@L3212  EQU   *
         ST    5,88(13)
         L     2,84(4)
         L     2,0(6,2)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BNE   @@L3220
         A     6,=F'12'
         A     3,=F'1'
         C     3,88(4)
         BL    @@L3212
@@L3218  EQU   *
         L     2,88(4)
         CL    2,92(4)
         BE    @@L3221
@@L3213  EQU   *
         L     15,84(4)
         L     2,88(4)
         SLL   2,1
         A     2,88(4)
         SLL   2,2
         ST    5,0(2,15)
         SLR   3,3
         CLI   2(5),51
         BE    @@L3216
         LA    3,1(0,0)
@@L3216  EQU   *
         ST    3,8(2,15)
         L     3,88(4)
         LR    2,3
         SLL   2,1
         AR    2,3
         SLL   2,2
         SLR   5,5
         ST    5,4(2,15)
         A     3,=F'1'
         ST    3,88(4)
         B     @@L3219
@@L3221  EQU   *
         LTR   2,2
         BE    @@L3214
         MH    2,=H'2'
         ST    2,92(4)
@@L3215  EQU   *
         MVC   88(4,13),84(4)
         L     2,92(4)
         SLL   2,1
         A     2,92(4)
         SLL   2,2
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
         ST    15,84(4)
         B     @@L3213
@@L3214  EQU   *
         MVC   92(4,4),=F'32'
         B     @@L3215
@@L3220  EQU   *
         L     3,84(4)
         L     2,0(6,3)
         CLC   2(1,5),2(2)
         BE    @@L3219
         SLR   5,5
         ST    5,8(6,3)
         B     @@L3219
@@L3196  EQU   *
* Function insert_loop_mem epilogue
         PDPEPIL
* Function insert_loop_mem literal pool
         DS    0F
         LTORG
* Function insert_loop_mem page table
         DS    0F
@@PGT94  EQU   *
         DC    A(@@PG94)
         DS    0F
* S-func loop_regs_scan prologue
@@12     PDPPRLG CINDEX=95,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN95
         LTORG
@@FEN95  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG95   EQU   *
         LR    11,1
         L     10,=A(@@PGT95)
* Function loop_regs_scan code
         L     2,4(11)
         L     3,0(11)
         L     6,88(3)
         A     6,=F'120'
         L     9,0(6)
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         ST    15,0(6)
         C     15,4(6)
         BNL   @@L3276
@@L3223  EQU   *
         SLR   4,4
         CR    4,9
         BNL   @@L3268
@@L3228  EQU   *
         L     2,8(6)
         LR    3,4
         MH    3,=H'16'
         SLR   5,5
         ST    5,0(3,2)
         STC   5,12(3,2)
         L     2,8(6)
         SLR   5,5
         ST    5,8(3,2)
         A     4,=F'1'
         CR    4,9
         BL    @@L3228
@@L3268  EQU   *
         MVC   88(4,13),0(6)
         MVC   92(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(XCALLOC)
         BALR  14,15
         LR    8,15
         L     2,0(11)
         L     4,112(2)
         LTR   4,4
         BE    @@L3277
@@L3229  EQU   *
         L     3,0(11)
         CL    4,108(3)
         BE    @@L3270
@@L3254  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3278
@@L3234  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'36'
         BE    @@L3246
         CLM   2,3,=H'33'
         BE    @@L3246
@@L3245  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'34'
         BE    @@L3279
@@L3232  EQU   *
         L     4,12(4)
         L     2,0(11)
         CL    4,108(2)
         BNE   @@L3254
@@L3270  EQU   *
         L     3,0(11)
         L     2,88(3)
         L     2,0(2)
         LTR   2,2
         BE    @@L3255
         SLR   4,4
@@L3261  EQU   *
         LA    2,1(0,0)
         SLL   2,0(4)
         L     3,=V(REGS@INV)
         N     2,0(3)
         LTR   2,2
         BNE   @@L3280
@@L3258  EQU   *
         A     4,=F'1'
         LA    2,19(0,0)
         CR    4,2
         BNH   @@L3261
@@L3255  EQU   *
         LR    4,9
         C     9,0(6)
         BNL   @@L3275
         LR    2,9
         MH    2,=H'16'
         A     2,8(6)
@@L3266  EQU   *
         MVC   4(4,2),0(2)
         A     2,=F'16'
         A     4,=F'1'
         C     4,0(6)
         BL    @@L3266
         B     @@L3275
@@L3280  EQU   *
         MVC   88(4,13),=F'4'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(RTX@VARI)
         BALR  14,15
         LTR   15,15
         BE    @@L3258
         L     2,8(6)
         LR    3,4
         MH    3,=H'16'
         LA    5,1(0,0)
         STC   5,12(3,2)
         L     2,8(6)
         LA    5,1(0,0)
         ST    5,0(3,2)
         B     @@L3258
@@L3279  EQU   *
         L     7,32(4)
         LTR   7,7
         BE    @@L3232
@@L3253  EQU   *
         L     3,4(7)
         LH    2,0(3)
         CLM   2,3,=H'48'
         BE    @@L3281
@@L3250  EQU   *
         L     7,8(7)
         LTR   7,7
         BNE   @@L3253
         B     @@L3232
@@L3281  EQU   *
         L     5,4(3)
         LH    2,0(5)
         CLM   2,3,=H'61'
         BNE   @@L3250
         ST    5,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(RTX@VARI)
         BALR  14,15
         LTR   15,15
         BE    @@L3250
         L     3,8(6)
         L     2,4(5)
         SLL   2,4
         LA    5,1(0,0)
         STC   5,12(2,3)
         B     @@L3250
@@L3246  EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         L     2,0(6)
         SLL   2,2
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         B     @@L3245
@@L3278  EQU   *
         ST    6,88(13)
         ST    4,92(13)
         MVC   96(4,13),16(4)
         LA    1,88(,13)
         L     15,=A(@@40)
         BALR  14,15
         L     2,28(4)
         LTR   2,2
         BNE   @@L3282
@@L3235  EQU   *
         L     3,16(4)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BE    @@L3237
         CLM   2,3,=H'49'
         BE    @@L3237
         CH    2,=H'39'
         BNE   @@L3234
         L     2,4(3)
         L     5,0(2)
         BCTR  5,0
         LTR   5,5
         BL    @@L3234
@@L3244  EQU   *
         ST    6,88(13)
         ST    4,92(13)
         L     2,16(4)
         L     3,4(2)
         LR    2,5
         MH    2,=H'4'
         L     3,4(2,3)
         ST    3,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=A(@@41)
         BALR  14,15
         BCTR  5,0
         LTR   5,5
         BNL   @@L3244
         B     @@L3234
@@L3237  EQU   *
         ST    6,88(13)
         ST    4,92(13)
         MVC   96(4,13),16(4)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=A(@@41)
         BALR  14,15
         B     @@L3234
@@L3282  EQU   *
         ST    6,88(13)
         ST    4,92(13)
         MVC   96(4,13),28(4)
         LA    1,88(,13)
         L     15,=A(@@40)
         BALR  14,15
         B     @@L3235
@@L3277  EQU   *
         L     4,104(2)
         B     @@L3229
@@L3276  EQU   *
         AR    2,15
         ST    2,4(6)
         MVC   88(4,13),8(6)
         L     2,4(6)
         SLL   2,4
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(XREALLOC)
         BALR  14,15
         ST    15,8(6)
         LR    2,9
         MH    2,=H'16'
         AR    2,15
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         L     2,4(6)
         SR    2,9
         MH    2,=H'16'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         B     @@L3223
@@L3275  EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
* Function loop_regs_scan epilogue
         PDPEPIL
* Function loop_regs_scan literal pool
         DS    0F
         LTORG
* Function loop_regs_scan page table
         DS    0F
@@PGT95  EQU   *
         DC    A(@@PG95)
         DS    0F
* S-func count_insns_in_loop prologue
@@13     PDPPRLG CINDEX=96,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN96
         LTORG
@@FEN96  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG96   EQU   *
         LR    11,1
         L     10,=A(@@PGT96)
* Function count_insns_in_loop code
         L     2,0(11)
         SLR   15,15
         L     4,112(2)
         LTR   4,4
         BE    @@L3293
@@L3284  EQU   *
         L     5,108(2)
         CLR   4,5
         BE    @@L3292
@@L3290  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3294
@@L3287  EQU   *
         L     4,12(4)
         CLR   4,5
         BNE   @@L3290
         B     @@L3292
@@L3294  EQU   *
         A     15,=F'1'
         B     @@L3287
@@L3293  EQU   *
         L     4,104(2)
         B     @@L3284
@@L3292  EQU   *
* Function count_insns_in_loop epilogue
         PDPEPIL
* Function count_insns_in_loop literal pool
         DS    0F
         LTORG
* Function count_insns_in_loop page table
         DS    0F
@@PGT96  EQU   *
         DC    A(@@PG96)
@@LC69   EQU   *
         DC    C'Hoisted regno %d %s from '
         DC    X'0'
@@LC70   EQU   *
         DC    C'r/w'
         DC    X'0'
@@LC71   EQU   *
         DC    C'r/o'
         DC    X'0'
         DS    0F
* S-func load_mems prologue
@@25     PDPPRLG CINDEX=97,FRAME=192,BASER=12,ENTRY=NO
         B     @@FEN97
         LTORG
@@FEN97  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG97   EQU   *
         LR    11,1
         L     10,=A(@@PGT97)
* Function load_mems code
         L     2,0(11)
         L     9,88(2)
         LR    3,9
         A     3,=F'120'
         ST    3,148(13)
         MVC   164(4,13),=F'0'
         MVC   152(4,13),164(13)
         SLR   6,6
         LA    1,88(,13)
         L     15,=V(MXRGNM)
         BALR  14,15
         ST    15,172(13)
         L     2,88(9)
         LTR   2,2
         L     14,=A(@@L3295)
         BER   14
         L     4,0(11)
         MVC   88(4,13),108(4)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         ST    15,168(13)
         LTR   15,15
         BE    @@L3297
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L3297
         MVC   168(4,13),164(13)
@@L3297  EQU   *
         MVC   88(4,13),0(11)
         L     7,0(11)
         MVC   92(4,13),116(7)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         ST    15,144(13)
         LTR   15,15
         BE    @@L3459
@@L3320  EQU   *
         L     3,144(13)
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L3489
         CLM   2,3,=H'33'
         L     14,=A(@@L3490)
         BER   14
@@L3304  EQU   *
         L     12,0(,10)
         LTR   6,6
         BE    @@L3300
@@L3489  EQU   *
         L     12,0(,10)
         MVC   152(4,13),=F'1'
@@L3300  EQU   *
         L     12,0(,10)
         MVC   88(4,13),0(11)
         MVC   92(4,13),144(13)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         ST    15,144(13)
         LTR   15,15
         BNE   @@L3320
@@L3459  EQU   *
         L     2,0(11)
         L     3,104(2)
         ST    3,144(13)
         L     2,8(3)
         LTR   2,2
         BE    @@L3322
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L3322
@@L3326  EQU   *
         L     3,8(3)
         L     2,8(3)
         LTR   2,2
         BE    @@L3488
         LH    2,0(3)
         CLM   2,3,=H'36'
         BNE   @@L3326
@@L3488  EQU   *
         ST    3,144(13)
@@L3322  EQU   *
         MVC   160(4,13),144(13)
         LA    1,88(,13)
         L     15,=V(CSELIB@I)
         BALR  14,15
         L     2,144(13)
         L     3,0(11)
         CL    2,104(3)
         BE    @@L3462
@@L3331  EQU   *
         MVC   88(4,13),144(13)
         LA    1,88(,13)
         L     15,=V(CSELIB@P)
         BALR  14,15
         L     2,144(13)
         L     2,12(2)
         ST    2,144(13)
         L     4,0(11)
         C     2,104(4)
         BNE   @@L3331
@@L3462  EQU   *
         MVC   156(4,13),=F'0'
         SLR   7,7
         C     7,88(9)
         BNL   @@L3464
         ST    7,188(13)
@@L3450  EQU   *
         MVC   176(4,13),=F'0'
         L     2,84(9)
         L     3,188(13)
         L     8,0(3,2)
         L     2,0(8)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L3491)
         BER   14
@@L3337  EQU   *
         L     12,0(,10)
         L     2,84(9)
         L     3,176(13)
         L     7,188(13)
         ST    3,8(7,2)
@@L3336  EQU   *
         L     12,0(,10)
         L     2,80(9)
         LTR   2,2
         BE    @@L3339
@@L3344  EQU   *
         ST    8,88(13)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LR    3,15
         LTR   15,15
         L     14,=A(@@L3341)
         BER   14
         MVC   176(4,13),=F'1'
@@L3342  EQU   *
         L     12,0(,10)
         L     2,8(2)
         LTR   2,2
         BNE   @@L3344
@@L3339  EQU   *
         L     12,0(,10)
         L     2,=V(FLAG@FLO)
         L     2,0(2)
         LTR   2,2
         BE    @@L3345
         L     4,176(13)
         LTR   4,4
         BE    @@L3345
         SLR   2,2
         IC    2,2(8)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    7,2(0,0)
         CLR   2,7
         L     14,=A(@@L3492)
         BER   14
@@L3345  EQU   *
         L     12,0(,10)
         L     2,84(9)
         L     7,188(13)
         L     2,8(7,2)
         LTR   2,2
         BE    @@L3346
         L     2,176(13)
         LTR   2,2
         BE    @@L3346
         SLR   3,3
         C     3,88(9)
         BNL   @@L3346
         LR    4,3
@@L3354  EQU   *
         CL    3,156(13)
         BE    @@L3349
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         L     2,84(9)
         L     2,0(4,2)
         ST    2,96(13)
         MVC   100(4,13),=V(RTX@VARI)
         LA    1,88(,13)
         L     15,=V(TRUE@DEP)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3486)
         BNER  14
@@L3349  EQU   *
         A     4,=F'12'
         A     3,=F'1'
         C     3,88(9)
         BL    @@L3354
@@L3346  EQU   *
         L     12,0(,10)
         L     3,152(13)
         LTR   3,3
         L     14,=A(@@L3493)
         BNER  14
@@L3355  EQU   *
         L     12,0(,10)
         L     2,84(9)
         L     3,188(13)
         L     2,8(3,2)
         LTR   2,2
         BNE   @@L3494
@@L3334  EQU   *
         L     12,0(,10)
         L     4,188(13)
         A     4,=F'12'
         ST    4,188(13)
         L     7,156(13)
         A     7,=F'1'
         ST    7,156(13)
         C     7,88(9)
         BL    @@L3450
@@L3464  EQU   *
         L     2,164(13)
         LTR   2,2
         BE    @@L3451
         L     3,168(13)
         LTR   3,3
         BE    @@L3451
         ST    3,136(13)
         LA    4,136(,13)
         ST    2,4(4)
         L     7,0(11)
         L     2,104(7)
         ST    2,144(13)
         CL    2,108(7)
         BE    @@L3451
@@L3457  EQU   *
         LA    2,144(,13)
         ST    2,88(13)
         MVC   92(4,13),=A(@@95)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(F@E@RTX)
         BALR  14,15
         L     3,144(13)
         LH    2,0(3)
         CLM   2,3,=H'33'
         BE    @@L3495
@@L3454  EQU   *
         L     2,144(13)
         MVC   144(4,13),12(2)
         L     2,144(13)
         L     3,0(11)
         CL    2,108(3)
         BNE   @@L3457
@@L3451  EQU   *
         LA    1,88(,13)
         L     15,=V(CSELIB@F)
         BALR  14,15
         L     14,=A(@@L3295)
         BR    14
@@L3495  EQU   *
         L     2,32(3)
         CL    2,168(13)
         BNE   @@L3454
         MVC   32(4,3),164(13)
         B     @@L3454
@@L3494  EQU   *
         LA    7,104(,13)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(BM@INIT)
         BALR  14,15
         LA    6,120(,13)
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(BM@INIT)
         BALR  14,15
         SLR   2,2
         IC    2,2(8)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         ST    15,180(13)
         OC    0(4,15),=F'16'
         L     2,84(9)
         L     4,180(13)
         ST    4,4(3,2)
         MVC   152(4,13),=F'0'
         MVC   88(4,13),0(11)
         L     2,0(11)
         MVC   92(4,13),116(2)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         ST    15,144(13)
         LTR   15,15
         BE    @@L3468
@@L3370  EQU   *
         L     4,144(13)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L3496)
         BER   14
@@L3361  EQU   *
         L     12,0(,10)
         L     3,144(13)
         LH    2,0(3)
         CLM   2,3,=H'36'
         L     14,=A(@@L3369)
         BER   14
         CLM   2,3,=H'33'
         L     14,=A(@@L3369)
         BER   14
@@L3359  EQU   *
         L     12,0(,10)
         MVC   88(4,13),0(11)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         ST    15,144(13)
         LTR   15,15
         BNE   @@L3370
@@L3468  EQU   *
         LA    1,88(,13)
         L     15,=V(APPLY@CH)
         BALR  14,15
         LTR   15,15
         BNE   @@L3371
         L     2,84(9)
         L     7,188(13)
         ST    15,8(7,2)
         B     @@L3334
@@L3371  EQU   *
         ST    8,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(CSELIB@L)
         BALR  14,15
         ST    8,184(13)
         SLR   7,7
         LTR   15,15
         BE    @@L3373
         LR    4,7
         L     15,8(15)
         LTR   15,15
         BE    @@L3470
@@L3382  EQU   *
         L     5,4(15)
         LH    3,0(5)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         L     14,=A(@@L3379)
         BNHR  14
         CLM   3,3,=H'54'
         L     14,=A(@@L3379)
         BER   14
         CLM   3,3,=H'55'
         L     14,=A(@@L3379)
         BER   14
         CLM   3,3,=H'58'
         L     14,=A(@@L3379)
         BER   14
         CLM   3,3,=H'134'
         L     14,=A(@@L3379)
         BER   14
         CLM   3,3,=H'56'
         L     14,=A(@@L3379)
         BER   14
         CLM   3,3,=H'140'
         L     14,=A(@@L3379)
         BER   14
         CLM   3,3,=H'61'
         L     14,=A(@@L3497)
         BER   14
@@L3376  EQU   *
         L     12,0(,10)
         L     15,0(15)
         LTR   15,15
         BNE   @@L3382
@@L3470  EQU   *
         LTR   4,4
         L     14,=A(@@L3498)
         BER   14
         LTR   7,7
         BE    @@L3384
         MVC   88(4,13),4(7)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(4)
         MVC   92(4,13),=F'47'
         LA    1,88(,13)
         L     15,=V(RTX@COST)
         BALR  14,15
         CR    2,15
         BH    @@L3384
         LR    4,7
         SLR   7,7
@@L3384  EQU   *
         L     12,0(,10)
         LTR   4,4
         BE    @@L3373
         MVC   88(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,184(13)
@@L3373  EQU   *
         MVC   88(4,13),180(13)
         MVC   92(4,13),184(13)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
         LR    5,15
         L     4,184(13)
         LH    2,0(4)
         CLM   2,3,=H'61'
         L     14,=A(@@L3499)
         BER   14
@@L3387  EQU   *
         L     12,0(,10)
         LTR   7,7
         BE    @@L3394
         MVC   88(4,13),4(7)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(SET@UNIQ)
         BALR  14,15
@@L3394  EQU   *
         L     7,176(13)
         LTR   7,7
         BE    @@L3395
         L     2,164(13)
         LTR   2,2
         L     14,=A(@@L3500)
         BER   14
@@L3396  EQU   *
         L     12,0(,10)
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),180(13)
         LA    1,88(,13)
         L     15,=V(GEN@MOVE)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),164(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=A(@@32)
         BALR  14,15
@@L3395  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L3397
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC69)
         L     4,180(13)
         MVC   96(4,13),4(4)
         L     2,=A(@@LC70)
         L     7,176(13)
         LTR   7,7
         BNE   @@L3399
         L     2,=A(@@LC71)
@@L3399  EQU   *
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,=A(LOOP@DUM)
         MVC   88(4,13),0(2)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(PRRTL)
         BALR  14,15
         MVC   88(4,13),=F'21'
         MVC   92(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
@@L3397  EQU   *
         L     4,104(13)
         LA    7,20(0,0)
         SLR   8,8
         LTR   4,4
         BE    @@L3406
         L     2,8(4)
         LTR   2,2
         BE    @@L3406
         LR    7,8
@@L3406  EQU   *
         LTR   4,4
         BE    @@L3474
@@L3424  EQU   *
         LR    5,8
         MH    5,=H'4'
         AR    5,4
         A     5,=F'12'
@@L3423  EQU   *
         L     6,0(5)
         LTR   6,6
         BE    @@L3415
         LA    2,31(0,0)
         CLR   7,2
         BH    @@L3415
@@L3422  EQU   *
         LA    3,1(0,0)
         SLL   3,0(7)
         LR    2,6
         NR    2,3
         LTR   2,2
         BNE   @@L3501
@@L3418  EQU   *
         A     7,=F'1'
         LA    3,31(0,0)
         CLR   7,3
         BNH   @@L3422
@@L3415  EQU   *
         SLR   7,7
         A     5,=F'4'
         A     8,=F'1'
         LA    2,1(0,0)
         CLR   8,2
         BNH   @@L3423
         LR    8,7
         L     4,0(4)
         LTR   4,4
         BNE   @@L3424
@@L3474  EQU   *
         LA    2,104(,13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@C)
         BALR  14,15
         L     4,120(13)
         LA    7,20(0,0)
         SLR   8,8
         LTR   4,4
         BE    @@L3431
         L     2,8(4)
         LTR   2,2
         BE    @@L3431
         LR    7,8
@@L3431  EQU   *
         LTR   4,4
         BE    @@L3480
@@L3449  EQU   *
         LR    5,8
         MH    5,=H'4'
         AR    5,4
         A     5,=F'12'
@@L3448  EQU   *
         L     6,0(5)
         LTR   6,6
         BE    @@L3440
         LA    3,31(0,0)
         CLR   7,3
         BH    @@L3440
@@L3447  EQU   *
         LA    3,1(0,0)
         SLL   3,0(7)
         LR    2,6
         NR    2,3
         LTR   2,2
         BNE   @@L3502
@@L3443  EQU   *
         A     7,=F'1'
         LA    2,31(0,0)
         CLR   7,2
         BNH   @@L3447
@@L3440  EQU   *
         SLR   7,7
         A     5,=F'4'
         A     8,=F'1'
         LA    3,1(0,0)
         CLR   8,3
         BNH   @@L3448
         LR    8,7
         L     4,0(4)
         LTR   4,4
         BNE   @@L3449
@@L3480  EQU   *
         LA    2,120(,13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(BITMAP@C)
         BALR  14,15
         B     @@L3334
@@L3502  EQU   *
         X     3,=F'-1'
         NR    6,3
         L     2,8(4)
         SLL   2,1
         AR    2,8
         MH    2,=H'32'
         AR    2,7
         MVC   88(4,13),0(11)
         MVC   92(4,13),180(13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@94)
         BALR  14,15
         LTR   6,6
         BNE   @@L3443
         B     @@L3440
@@L3501  EQU   *
         X     3,=F'-1'
         NR    6,3
         L     2,8(4)
         SLL   2,1
         AR    2,8
         MH    2,=H'32'
         AR    2,7
         MVC   88(4,13),0(11)
         MVC   92(4,13),180(13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@93)
         BALR  14,15
         LTR   6,6
         BNE   @@L3418
         B     @@L3415
@@L3500  EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,164(13)
         ST    15,88(13)
         L     3,0(11)
         MVC   92(4,13),108(3)
         LA    1,88(,13)
         L     15,=V(EMLABA)
         BALR  14,15
         B     @@L3396
@@L3499  EQU   *
         MVC   144(4,13),160(13)
         L     2,0(11)
         L     6,104(2)
         L     3,160(13)
         CLR   3,6
         BE    @@L3387
@@L3393  EQU   *
         L     4,184(13)
         L     2,4(4)
         SLL   2,2
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     4,16(2)
         L     3,144(13)
         L     2,4(4)
         CL    2,4(3)
         BE    @@L3487
         L     2,12(3)
         ST    2,144(13)
         CLR   2,6
         BNE   @@L3393
         B     @@L3387
@@L3487  EQU   *
         MVC   4(4,4),4(5)
         B     @@L3387
@@L3498  EQU   *
         LR    4,7
         B     @@L3384
@@L3497  EQU   *
         L     2,4(5)
         LA    3,19(0,0)
         CLR   2,3
         BNH   @@L3376
         LR    4,15
         B     @@L3376
@@L3379  EQU   *
         LR    7,15
         B     @@L3376
@@L3369  EQU   *
         MVC   152(4,13),=F'1'
         B     @@L3359
@@L3496  EQU   *
         L     2,16(4)
         LH    3,0(2)
         LR    5,2
         CLM   3,3,=H'47'
         BE    @@L3363
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    5,15
@@L3363  EQU   *
         LTR   5,5
         BE    @@L3366
         L     3,152(13)
         LTR   3,3
         BNE   @@L3366
         L     3,4(5)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L3503
@@L3366  EQU   *
         LTR   5,5
         BE    @@L3367
         L     4,152(13)
         LTR   4,4
         BNE   @@L3367
         L     3,8(5)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BE    @@L3504
@@L3367  EQU   *
         MVC   88(4,13),144(13)
         L     2,84(9)
         L     4,188(13)
         L     2,0(4,2)
         ST    2,92(13)
         L     2,84(9)
         L     2,4(4,2)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=A(@@92)
         BALR  14,15
         B     @@L3361
@@L3504  EQU   *
         L     3,4(3)
         LA    2,19(0,0)
         CLR   3,2
         BNH   @@L3367
         CL    3,172(13)
         BNL   @@L3367
         L     4,148(13)
         L     2,8(4)
         MH    3,=H'16'
         L     2,4(3,2)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L3367
         MVC   88(4,13),4(5)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L3367
         ST    6,88(13)
         L     2,8(5)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         B     @@L3367
@@L3503  EQU   *
         L     3,4(3)
         LA    4,19(0,0)
         CLR   3,4
         BNH   @@L3366
         CL    3,172(13)
         BNL   @@L3366
         L     4,148(13)
         L     2,8(4)
         MH    3,=H'16'
         L     2,4(3,2)
         LA    3,1(0,0)
         CLR   2,3
         BNE   @@L3366
         MVC   88(4,13),8(5)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L3366
         ST    7,88(13)
         L     2,4(5)
         MVC   92(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(BITMAP@S)
         BALR  14,15
         B     @@L3366
@@L3493  EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(MAY@TRAP)
         BALR  14,15
         LTR   15,15
         BE    @@L3355
         L     2,84(9)
         SLR   7,7
         L     4,188(13)
         ST    7,8(4,2)
         B     @@L3355
@@L3486  EQU   *
         L     2,84(9)
         SLR   4,4
         L     3,188(13)
         ST    4,8(3,2)
         B     @@L3346
@@L3492  EQU   *
         L     2,84(9)
         SLR   4,4
         L     3,188(13)
         ST    4,8(3,2)
         B     @@L3345
@@L3341  EQU   *
         MVC   88(4,13),4(2)
         ST    15,92(13)
         ST    8,96(13)
         MVC   100(4,13),=V(RTX@VARI)
         LA    1,88(,13)
         L     15,=V(TRUE@DEP)
         BALR  14,15
         LTR   15,15
         BE    @@L3342
         L     2,84(9)
         L     7,188(13)
         ST    3,8(7,2)
         B     @@L3339
@@L3491  EQU   *
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(8)
         LA    1,88(,13)
         L     15,=V(LOOP@INV)
         BALR  14,15
         LA    4,1(0,0)
         CLR   15,4
         BNE   @@L3337
         B     @@L3336
@@L3490  EQU   *
         L     2,32(3)
         L     4,0(11)
         CL    2,112(4)
         L     14,=A(@@L3505)
         BER   14
@@L3305  EQU   *
         L     12,0(,10)
         L     2,144(13)
         L     2,32(2)
         LTR   2,2
         L     14,=A(@@L3295)
         BER   14
         C     2,168(13)
         L     14,=A(@@L3306)
         BER   14
         L     3,4(2)
         L     2,=A(MAX@UID@)
         L     5,0(2)
         CR    3,5
         L     14,=A(@@L3295)
         BNLR  14
         L     2,=A(UID@LUID)
         L     4,0(2)
         MH    3,=H'4'
         L     3,0(3,4)
         L     7,0(11)
         L     2,104(7)
         L     2,4(2)
         CR    2,5
         L     14,=A(@@L3310)
         BNLR  14
         MH    2,=H'4'
         C     3,0(2,4)
         L     14,=A(@@L3295)
         BLR   14
@@L3311  EQU   *
         L     12,0(,10)
         L     2,144(13)
         L     2,32(2)
         L     3,4(2)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         L     14,=A(@@L3312)
         BNLR  14
         L     2,=A(UID@LUID)
         L     2,0(2)
         MH    3,=H'4'
         L     4,0(3,2)
@@L3313  EQU   *
         L     12,0(,10)
         L     3,0(11)
         L     2,108(3)
         L     3,4(2)
         L     2,=A(MAX@UID@)
         C     3,0(2)
         BNL   @@L3314
         L     2,=A(UID@LUID)
         L     2,0(2)
         MH    3,=H'4'
         C     4,0(3,2)
         L     14,=A(@@L3295)
         BHR   14
@@L3306  EQU   *
         L     12,0(,10)
         MVC   88(4,13),144(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LTR   15,15
         BE    @@L3489
         LA    6,1(0,0)
         B     @@L3300
@@L3314  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'9693'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     7,=F'-1'
         CR    4,7
         BNH   @@L3306
         L     14,=A(@@L3295)
         BR    14
@@L3312  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'9693'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     4,=F'-1'
         B     @@L3313
@@L3310  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'9692'
         MVC   96(4,13),=A(@@LC1)
         B     @@PGE97
         DS    0F
         LTORG
         DS    0F
@@PGE97  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG98   EQU   *
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     2,=F'-1'
         CR    3,2
         L     14,=A(@@L3311)
         BNLR  14
         B     @@L3295
@@L3505  EQU   *
         L     12,4(,10)
         L     2,12(3)
         L     2,12(2)
         CL    2,108(4)
         L     14,=A(@@L3305)
         BNER  14
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@UNCO)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L3304)
         BNER  14
         L     14,=A(@@L3305)
         BR    14
@@L3295  EQU   *
         L     12,4(,10)
* Function load_mems epilogue
         PDPEPIL
* Function load_mems literal pool
         DS    0F
         LTORG
* Function load_mems page table
         DS    0F
@@PGT97  EQU   *
         DC    A(@@PG97)
         DC    A(@@PG98)
         DS    0F
* S-func note_reg_stored prologue
@@96     PDPPRLG CINDEX=99,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN99
         LTORG
@@FEN99  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG99   EQU   *
         LR    11,1
         L     10,=A(@@PGT99)
* Function note_reg_stored code
         L     15,8(11)
         L     2,4(15)
         CL    2,0(11)
         BNE   @@L3506
         MVC   0(4,15),=F'1'
@@L3506  EQU   *
* Function note_reg_stored epilogue
         PDPEPIL
* Function note_reg_stored literal pool
         DS    0F
         LTORG
* Function note_reg_stored page table
         DS    0F
@@PGT99  EQU   *
         DC    A(@@PG99)
@@LC73   EQU   *
         DC    C'.'
         DC    X'15'
         DC    X'0'
@@LC72   EQU   *
         DC    C'  Replaced reg %d'
         DC    X'0'
         DS    0F
* S-func try_copy_prop prologue
@@93     PDPPRLG CINDEX=100,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN100
         LTORG
@@FEN100 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG100  EQU   *
         LR    11,1
         L     10,=A(@@PGT100)
* Function try_copy_prop code
         L     7,0(11)
         L     8,4(11)
         L     6,8(11)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     3,48(2)
         LR    2,6
         MH    2,=H'4'
         L     9,0(2,3)
         SLR   5,5
         ST    5,112(13)
         ST    5,116(13)
         ST    7,88(13)
         MVC   92(4,13),116(7)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L3510
@@L3526  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'36'
         BE    @@L3534
@@L3513  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3535
@@L3511  EQU   *
         ST    7,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L3526
@@L3510  EQU   *
         LTR   5,5
         BE    @@L3536
@@L3527  EQU   *
         LA    1,88(,13)
         L     15,=V(APPLY@CH)
         BALR  14,15
         LTR   15,15
         BE    @@L3508
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L3537
@@L3529  EQU   *
         L     2,116(13)
         LTR   2,2
         BE    @@L3530
         L     2,112(13)
         LTR   2,2
         BNE   @@L3538
@@L3530  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BE    @@L3508
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC73)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L3508
@@L3538  EQU   *
         LR    2,5
         ST    5,88(13)
         MVC   92(4,13),=F'6'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LTR   15,15
         BE    @@L3531
         L     2,4(15)
@@L3531  EQU   *
         ST    2,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=A(@@98)
         BALR  14,15
         B     @@L3530
@@L3537  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC72)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L3529
@@L3536  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'10077'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L3527
@@L3535  EQU   *
         L     2,16(4)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L3516
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
@@L3516  EQU   *
         LTR   2,2
         BE    @@L3519
         L     15,4(2)
         LH    2,0(15)
         CLM   2,3,=H'61'
         BE    @@L3539
@@L3519  EQU   *
         LTR   5,5
         BE    @@L3511
         CLR   4,5
         BE    @@L3511
         ST    4,88(13)
         ST    9,92(13)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=A(@@97)
         BALR  14,15
         LR    2,6
         MH    2,=H'4'
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     2,16(2)
         L     2,4(2)
         CL    2,4(4)
         BE    @@L3540
@@L3523  EQU   *
         LA    3,4(0,0)
         LA    2,104(,13)
         ST    8,0(3,2)
         MVC   104(4,13),=F'0'
         MVC   88(4,13),16(4)
         MVC   92(4,13),=A(@@96)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(NOTE@STO)
         BALR  14,15
         L     2,104(13)
         LTR   2,2
         BE    @@L3511
         ST    4,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(FREGNOTE)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L3510
         ST    8,88(13)
         MVC   92(4,13),4(15)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BE    @@L3510
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(REMNOTE)
         BALR  14,15
         B     @@L3510
@@L3540  EQU   *
         MVC   112(4,13),=F'1'
         B     @@L3523
@@L3539  EQU   *
         L     2,4(15)
         CLR   2,6
         BNE   @@L3519
         LTR   5,5
         BE    @@L3520
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'10043'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L3520  EQU   *
         LR    5,4
         LR    2,6
         MH    2,=H'4'
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     2,16(2)
         L     2,0(2)
         CL    2,4(4)
         BNE   @@L3519
         MVC   116(4,13),=F'1'
         B     @@L3519
@@L3534  EQU   *
         LTR   5,5
         BE    @@L3513
         B     @@L3510
@@L3508  EQU   *
* Function try_copy_prop epilogue
         PDPEPIL
* Function try_copy_prop literal pool
         DS    0F
         LTORG
* Function try_copy_prop page table
         DS    0F
@@PGT100 EQU   *
         DC    A(@@PG100)
@@LC74   EQU   *
         DC    C', deleting init_insn (%d)'
         DC    X'0'
         DS    0F
* S-func loop_delete_insns prologue
@@98     PDPPRLG CINDEX=101,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN101
         LTORG
@@FEN101 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG101  EQU   *
         LR    11,1
         L     10,=A(@@PGT101)
* Function loop_delete_insns code
         L     3,0(11)
         L     4,4(11)
@@L3547  EQU   *
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L3548
@@L3545  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(DELINS)
         BALR  14,15
         CLR   3,4
         BE    @@L3541
         L     3,12(3)
         B     @@L3547
@@L3548  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC74)
         MVC   96(4,13),4(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L3545
@@L3541  EQU   *
* Function loop_delete_insns epilogue
         PDPEPIL
* Function loop_delete_insns literal pool
         DS    0F
         LTORG
* Function loop_delete_insns page table
         DS    0F
@@PGT101 EQU   *
         DC    A(@@PG101)
@@LC75   EQU   *
         DC    C'  Swapped set of reg %d at %d with reg %d at %d.'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func try_swap_copy_prop prologue
@@94     PDPPRLG CINDEX=102,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN102
         LTORG
@@FEN102 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG102  EQU   *
         LR    11,1
         L     10,=A(@@PGT102)
* Function try_swap_copy_prop code
         L     8,0(11)
         L     9,4(11)
         L     7,8(11)
         SLR   6,6
         MVC   112(4,13),4(9)
         ST    8,88(13)
         MVC   92(4,13),116(8)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L3551
@@L3559  EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3570
@@L3552  EQU   *
         ST    8,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L3559
@@L3551  EQU   *
         LTR   4,4
         BE    @@L3549
         L     5,8(4)
         L     3,=V(RTX@CLAS)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BNE   @@L3549
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3571
         SLR   15,15
@@L3563  EQU   *
         LTR   15,15
         BE    @@L3549
         L     3,4(15)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L3549
         L     2,4(3)
         CLR   2,7
         BNE   @@L3549
         ST    5,88(13)
         A     15,=F'4'
         ST    15,92(13)
         ST    9,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         ST    4,88(13)
         A     6,=F'4'
         ST    6,92(13)
         A     6,=F'-4'
         MVC   96(4,13),8(6)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         ST    4,88(13)
         A     6,=F'8'
         ST    6,92(13)
         ST    9,96(13)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(APPLY@CH)
         BALR  14,15
         LTR   15,15
         BE    @@L3549
         L     2,=A(LOOP@DUM)
         L     2,0(2)
         LTR   2,2
         BNE   @@L3572
@@L3567  EQU   *
         LR    2,7
         MH    2,=H'4'
         L     3,=V(REG@N@IN)
         A     2,0(3)
         L     3,16(2)
         L     2,0(3)
         CL    2,4(5)
         BE    @@L3573
@@L3568  EQU   *
         ST    8,88(13)
         ST    9,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@93)
         BALR  14,15
         B     @@L3549
@@L3573  EQU   *
         MVC   0(4,3),4(4)
         B     @@L3568
@@L3572  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC75)
         ST    7,96(13)
         MVC   100(4,13),4(4)
         MVC   104(4,13),112(13)
         MVC   108(4,13),4(5)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L3567
@@L3571  EQU   *
         L     2,16(5)
         LH    3,0(2)
         LR    15,2
         CLM   3,3,=H'47'
         BE    @@L3563
         ST    5,88(13)
         MVC   92(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         B     @@L3563
@@L3570  EQU   *
         L     2,16(4)
         LH    3,0(2)
         LR    6,2
         CLM   3,3,=H'47'
         BE    @@L3556
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    6,15
@@L3556  EQU   *
         LTR   6,6
         BE    @@L3552
         L     3,4(6)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L3552
         L     2,4(3)
         CL    2,112(13)
         BNE   @@L3552
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'61'
         BNE   @@L3552
         L     2,4(3)
         CLR   2,7
         BNE   @@L3552
         B     @@L3551
@@L3549  EQU   *
* Function try_swap_copy_prop epilogue
         PDPEPIL
* Function try_swap_copy_prop literal pool
         DS    0F
         LTORG
* Function try_swap_copy_prop page table
         DS    0F
@@PGT102 EQU   *
         DC    A(@@PG102)
         DS    0F
* S-func replace_loop_mem prologue
@@99     PDPPRLG CINDEX=103,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN103
         LTORG
@@FEN103 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG103  EQU   *
         LR    11,1
         L     10,=A(@@PGT103)
* Function replace_loop_mem code
         L     5,0(11)
         L     4,4(11)
         L     2,0(5)
         LR    15,2
         LTR   2,2
         BE    @@L3574
         LH    3,0(2)
         N     3,=XL4'0000FFFF'
         L     15,=F'-1'
         LA    6,55(0,0)
         CLR   3,6
         BE    @@L3574
         LA    6,66(0,0)
         CLR   3,6
         BE    @@L3583
@@L3582  EQU   *
         SLR   15,15
         B     @@L3574
@@L3583  EQU   *
         MVC   88(4,13),0(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L3574
         MVC   88(4,13),8(4)
         ST    5,92(13)
         MVC   96(4,13),4(4)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
         B     @@L3582
@@L3574  EQU   *
* Function replace_loop_mem epilogue
         PDPEPIL
* Function replace_loop_mem literal pool
         DS    0F
         LTORG
* Function replace_loop_mem page table
         DS    0F
@@PGT103 EQU   *
         DC    A(@@PG103)
         DS    0F
* S-func replace_loop_mems prologue
@@92     PDPPRLG CINDEX=104,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN104
         LTORG
@@FEN104 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG104  EQU   *
         LR    11,1
         L     10,=A(@@PGT104)
* Function replace_loop_mems code
         MVC   112(4,13),0(11)
         MVC   104(4,13),4(11)
         MVC   108(4,13),8(11)
         ST    11,88(13)
         MVC   92(4,13),=A(@@99)
         LA    2,104(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(F@E@RTX)
         BALR  14,15
* Function replace_loop_mems epilogue
         PDPEPIL
* Function replace_loop_mems literal pool
         DS    0F
         LTORG
* Function replace_loop_mems page table
         DS    0F
@@PGT104 EQU   *
         DC    A(@@PG104)
         DS    0F
* S-func replace_loop_reg prologue
@@100    PDPPRLG CINDEX=105,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN105
         LTORG
@@FEN105 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG105  EQU   *
         LR    11,1
         L     10,=A(@@PGT105)
* Function replace_loop_reg code
         L     3,0(11)
         L     2,4(11)
         L     15,0(3)
         LTR   15,15
         BE    @@L3585
         CL    15,0(2)
         BNE   @@L3585
         MVC   88(4,13),8(2)
         ST    3,92(13)
         MVC   96(4,13),4(2)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(VALCHANG)
         BALR  14,15
@@L3585  EQU   *
         SLR   15,15
* Function replace_loop_reg epilogue
         PDPEPIL
* Function replace_loop_reg literal pool
         DS    0F
         LTORG
* Function replace_loop_reg page table
         DS    0F
@@PGT105 EQU   *
         DC    A(@@PG105)
         DS    0F
* S-func replace_loop_regs prologue
@@97     PDPPRLG CINDEX=106,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN106
         LTORG
@@FEN106 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG106  EQU   *
         LR    11,1
         L     10,=A(@@PGT106)
* Function replace_loop_regs code
         MVC   112(4,13),0(11)
         MVC   104(4,13),4(11)
         MVC   108(4,13),8(11)
         ST    11,88(13)
         MVC   92(4,13),=A(@@100)
         LA    2,104(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(F@E@RTX)
         BALR  14,15
* Function replace_loop_regs epilogue
         PDPEPIL
* Function replace_loop_regs literal pool
         DS    0F
         LTORG
* Function replace_loop_regs page table
         DS    0F
@@PGT106 EQU   *
         DC    A(@@PG106)
         DS    0F
* S-func replace_label prologue
@@95     PDPPRLG CINDEX=107,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN107
         LTORG
@@FEN107 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG107  EQU   *
         LR    11,1
         L     10,=A(@@PGT107)
* Function replace_label code
         L     3,4(11)
         L     2,0(11)
         L     15,0(2)
         L     5,0(3)
         L     4,4(3)
         LTR   15,15
         BE    @@L3589
         LH    2,0(15)
         CLM   2,3,=H'67'
         BNE   @@L3589
         L     3,4(15)
         CLR   3,5
         BNE   @@L3589
         ST    4,4(15)
         L     2,16(4)
         A     2,=F'1'
         ST    2,16(4)
         L     2,16(3)
         BCTR  2,0
         ST    2,16(3)
@@L3589  EQU   *
         SLR   15,15
* Function replace_label epilogue
         PDPEPIL
* Function replace_label literal pool
         DS    0F
         LTORG
* Function replace_label page table
         DS    0F
@@PGT107 EQU   *
         DC    A(@@PG107)
         DS    0F
* S-func loop_insn_emit_after prologue
@@32     PDPPRLG CINDEX=108,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN108
         LTORG
@@FEN108 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG108  EQU   *
         LR    11,1
         L     10,=A(@@PGT108)
* Function loop_insn_emit_after code
         MVC   88(4,13),12(11)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(EMIAFT)
         BALR  14,15
* Function loop_insn_emit_after epilogue
         PDPEPIL
* Function loop_insn_emit_after literal pool
         DS    0F
         LTORG
* Function loop_insn_emit_after page table
         DS    0F
@@PGT108 EQU   *
         DC    A(@@PG108)
         DS    0F
* X-func li_embef prologue
LI@EMBEF PDPPRLG CINDEX=109,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN109
         LTORG
@@FEN109 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG109  EQU   *
         LR    11,1
         L     10,=A(@@PGT109)
* Function li_embef code
         L     15,8(11)
         L     2,12(11)
         LTR   15,15
         BE    @@L3596
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMIBEF)
         BALR  14,15
         B     @@L3594
@@L3596  EQU   *
         MVC   88(4,13),0(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
@@L3594  EQU   *
* Function li_embef epilogue
         PDPEPIL
* Function li_embef literal pool
         DS    0F
         LTORG
* Function li_embef page table
         DS    0F
@@PGT109 EQU   *
         DC    A(@@PG109)
         DS    0F
* S-func loop_call_insn_emit_before prologue
@@101    PDPPRLG CINDEX=110,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN110
         LTORG
@@FEN110 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG110  EQU   *
         LR    11,1
         L     10,=A(@@PGT110)
* Function loop_call_insn_emit_before code
         MVC   88(4,13),12(11)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(EMCIBEF)
         BALR  14,15
* Function loop_call_insn_emit_before epilogue
         PDPEPIL
* Function loop_call_insn_emit_before literal pool
         DS    0F
         LTORG
* Function loop_call_insn_emit_before page table
         DS    0F
@@PGT110 EQU   *
         DC    A(@@PG110)
         DS    0F
* X-func li_hoist prologue
LI@HOIST PDPPRLG CINDEX=111,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN111
         LTORG
@@FEN111 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG111  EQU   *
         LR    11,1
         L     10,=A(@@PGT111)
* Function li_hoist code
         L     2,0(11)
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),104(2)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(LI@EMBEF)
         BALR  14,15
* Function li_hoist epilogue
         PDPEPIL
* Function li_hoist literal pool
         DS    0F
         LTORG
* Function li_hoist page table
         DS    0F
@@PGT111 EQU   *
         DC    A(@@PG111)
         DS    0F
* S-func loop_call_insn_hoist prologue
@@33     PDPPRLG CINDEX=112,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN112
         LTORG
@@FEN112 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG112  EQU   *
         LR    11,1
         L     10,=A(@@PGT112)
* Function loop_call_insn_hoist code
         L     2,0(11)
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),104(2)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@101)
         BALR  14,15
* Function loop_call_insn_hoist epilogue
         PDPEPIL
* Function loop_call_insn_hoist literal pool
         DS    0F
         LTORG
* Function loop_call_insn_hoist page table
         DS    0F
@@PGT112 EQU   *
         DC    A(@@PG112)
         DS    0F
* X-func li_sink prologue
LI@SINK  PDPPRLG CINDEX=113,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN113
         LTORG
@@FEN113 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG113  EQU   *
         LR    11,1
         L     10,=A(@@PGT113)
* Function li_sink code
         L     2,0(11)
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),120(2)
         MVC   100(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(LI@EMBEF)
         BALR  14,15
* Function li_sink epilogue
         PDPEPIL
* Function li_sink literal pool
         DS    0F
         LTORG
* Function li_sink page table
         DS    0F
@@PGT113 EQU   *
         DC    A(@@PG113)
         DS    0F
* S-func loop_insn_sink_or_swim prologue
@@62     PDPPRLG CINDEX=114,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN114
         LTORG
@@FEN114 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG114  EQU   *
         LR    11,1
         L     10,=A(@@PGT114)
* Function loop_insn_sink_or_swim code
         L     15,0(11)
         L     3,4(11)
         L     2,128(15)
         LTR   2,2
         BE    @@L3602
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(LI@HOIST)
         BALR  14,15
         B     @@L3601
@@L3602  EQU   *
         ST    15,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(LI@SINK)
         BALR  14,15
@@L3601  EQU   *
* Function loop_insn_sink_or_swim epilogue
         PDPEPIL
* Function loop_insn_sink_or_swim literal pool
         DS    0F
         LTORG
* Function loop_insn_sink_or_swim page table
         DS    0F
@@PGT114 EQU   *
         DC    A(@@PG114)
@@LC76   EQU   *
         DC    C'Loop %d: %d IV classes'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func loop_ivs_dump prologue
@@102    PDPPRLG CINDEX=115,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN115
         LTORG
@@FEN115 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG115  EQU   *
         LR    11,1
         L     10,=A(@@PGT115)
* Function loop_ivs_dump code
         L     3,0(11)
         L     4,4(11)
         L     5,8(11)
         SLR   15,15
         LTR   3,3
         BE    @@L3604
         LTR   4,4
         BE    @@L3604
         L     2,88(3)
         L     2,144(2)
         LTR   2,2
         BE    @@L3618
@@L3611  EQU   *
         A     15,=F'1'
         L     2,36(2)
         LTR   2,2
         BNE   @@L3611
@@L3618  EQU   *
         ST    4,88(13)
         MVC   92(4,13),=A(@@LC76)
         MVC   96(4,13),0(3)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,88(3)
         L     2,144(2)
         LTR   2,2
         BE    @@L3604
@@L3616  EQU   *
         ST    2,88(13)
         ST    4,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=A(@@103)
         BALR  14,15
         MVC   88(4,13),=F'21'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         L     2,36(2)
         LTR   2,2
         BNE   @@L3616
@@L3604  EQU   *
* Function loop_ivs_dump epilogue
         PDPEPIL
* Function loop_ivs_dump literal pool
         DS    0F
         LTORG
* Function loop_ivs_dump page table
         DS    0F
@@PGT115 EQU   *
         DC    A(@@PG115)
@@LC77   EQU   *
         DC    C'IV class for reg %d, benefit %d'
         DC    X'15'
         DC    X'0'
@@LC78   EQU   *
         DC    C' Init insn %d'
         DC    X'0'
@@LC82   EQU   *
         DC    C' Total increment: '
         DC    X'0'
@@LC83   EQU   *
         DC    C' Inc%d: insn %d, incr: '
         DC    X'0'
@@LC84   EQU   *
         DC    C' Giv%d: insn %d, benefit %d, '
         DC    X'0'
@@LC81   EQU   *
         DC    C' Final val: '
         DC    X'0'
@@LC80   EQU   *
         DC    C', init test: '
         DC    X'0'
@@LC79   EQU   *
         DC    C', init val: '
         DC    X'0'
         DS    0F
* S-func loop_iv_class_dump prologue
@@103    PDPPRLG CINDEX=116,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN116
         LTORG
@@FEN116 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG116  EQU   *
         LR    11,1
         L     10,=A(@@PGT116)
* Function loop_iv_class_dump code
         L     3,0(11)
         L     6,4(11)
         LTR   3,3
         BE    @@L3620
         LTR   6,6
         BE    @@L3620
         ST    6,88(13)
         MVC   92(4,13),=A(@@LC77)
         MVC   96(4,13),0(3)
         MVC   100(4,13),20(3)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),=A(@@LC78)
         L     2,40(3)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,24(3)
         LTR   2,2
         BNE   @@L3647
@@L3623  EQU   *
         L     2,28(3)
         LTR   2,2
         BNE   @@L3648
@@L3624  EQU   *
         MVC   88(4,13),=F'21'
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         L     2,32(3)
         LTR   2,2
         BNE   @@L3649
@@L3625  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(BIV@TOTA)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BE    @@L3626
         ST    6,88(13)
         MVC   92(4,13),=A(@@LC82)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    6,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         MVC   88(4,13),=F'21'
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
@@L3626  EQU   *
         SLR   7,7
         L     4,8(3)
         LTR   4,4
         BE    @@L3644
@@L3631  EQU   *
         ST    6,88(13)
         MVC   92(4,13),=A(@@LC83)
         ST    7,96(13)
         L     2,0(4)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),36(4)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         MVC   88(4,13),=F'21'
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         L     4,68(4)
         A     7,=F'1'
         LTR   4,4
         BNE   @@L3631
@@L3644  EQU   *
         SLR   7,7
         L     4,16(3)
         LTR   4,4
         BE    @@L3620
@@L3642  EQU   *
         ST    6,88(13)
         MVC   92(4,13),=A(@@LC84)
         ST    7,96(13)
         L     2,0(4)
         MVC   100(4,13),4(2)
         MVC   104(4,13),40(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,12(4)
         LTR   2,2
         BE    @@L3650
         L     5,0(4)
         LH    2,0(5)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L3651
         SLR   2,2
@@L3639  EQU   *
         ST    6,88(13)
         ST    2,92(13)
@@L3646  EQU   *
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         MVC   88(4,13),=F'21'
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         L     4,68(4)
         A     7,=F'1'
         LTR   4,4
         BNE   @@L3642
         B     @@L3620
@@L3651  EQU   *
         L     2,16(5)
         LH    3,0(2)
         CLM   3,3,=H'47'
         BE    @@L3639
         ST    5,88(13)
         L     2,0(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    2,15
         B     @@L3639
@@L3650  EQU   *
         ST    6,88(13)
         MVC   92(4,13),28(4)
         B     @@L3646
@@L3649  EQU   *
         ST    6,88(13)
         MVC   92(4,13),=A(@@LC81)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),32(3)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         MVC   88(4,13),=F'21'
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L3625
@@L3648  EQU   *
         ST    6,88(13)
         MVC   92(4,13),=A(@@LC80)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),28(3)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         B     @@L3624
@@L3647  EQU   *
         ST    6,88(13)
         MVC   92(4,13),=A(@@LC79)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    6,88(13)
         MVC   92(4,13),24(3)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         B     @@L3623
@@L3620  EQU   *
* Function loop_iv_class_dump epilogue
         PDPEPIL
* Function loop_iv_class_dump literal pool
         DS    0F
         LTORG
* Function loop_iv_class_dump page table
         DS    0F
@@PGT116 EQU   *
         DC    A(@@PG116)
@@LC85   EQU   *
         DC    C'Biv %d: insn %d'
         DC    X'0'
@@LC86   EQU   *
         DC    C' const '
         DC    X'0'
@@LC87   EQU   *
         DC    C' final '
         DC    X'0'
         DS    0F
* S-func loop_biv_dump prologue
@@78     PDPPRLG CINDEX=117,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN117
         LTORG
@@FEN117 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG117  EQU   *
         LR    11,1
         L     10,=A(@@PGT117)
* Function loop_biv_dump code
         L     4,0(11)
         L     3,4(11)
         LTR   4,4
         BE    @@L3652
         LTR   3,3
         BE    @@L3652
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC85)
         L     2,16(4)
         MVC   96(4,13),4(2)
         L     2,0(4)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC86)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),36(4)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         L     2,8(11)
         LTR   2,2
         BE    @@L3655
         L     2,44(4)
         LTR   2,2
         BNE   @@L3656
@@L3655  EQU   *
         MVC   88(4,13),=F'21'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L3652
@@L3656  EQU   *
         MVC   88(4,13),=F'21'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC87)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),44(4)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         B     @@L3655
@@L3652  EQU   *
* Function loop_biv_dump epilogue
         PDPEPIL
* Function loop_biv_dump literal pool
         DS    0F
         LTORG
* Function loop_biv_dump page table
         DS    0F
@@PGT117 EQU   *
         DC    A(@@PG117)
@@LC89   EQU   *
         DC    C'Dest address: insn %d'
         DC    X'0'
@@LC90   EQU   *
         DC    C' src reg %d benefit %d'
         DC    X'0'
@@LC91   EQU   *
         DC    C' lifetime %d'
         DC    X'0'
@@LC97   EQU   *
         DC    C' mult '
         DC    X'0'
@@LC98   EQU   *
         DC    C' add  '
         DC    X'0'
@@LC94   EQU   *
         DC    C' ext se'
         DC    X'0'
@@LC96   EQU   *
         DC    C' ext tr'
         DC    X'0'
@@LC95   EQU   *
         DC    C' ext ze'
         DC    X'0'
@@LC93   EQU   *
         DC    C' ncav'
         DC    X'0'
@@LC92   EQU   *
         DC    C' replaceable'
         DC    X'0'
@@LC88   EQU   *
         DC    C'Giv %d: insn %d'
         DC    X'0'
         DS    0F
* S-func loop_giv_dump prologue
@@80     PDPPRLG CINDEX=118,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN118
         LTORG
@@FEN118 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG118  EQU   *
         LR    11,1
         L     10,=A(@@PGT118)
* Function loop_giv_dump code
         L     4,0(11)
         L     3,4(11)
         LTR   4,4
         BE    @@L3657
         LTR   3,3
         BE    @@L3657
         L     2,12(4)
         LA    5,1(0,0)
         CLR   2,5
         BE    @@L3675
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC89)
         L     2,0(4)
         MVC   96(4,13),4(2)
@@L3673  EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC90)
         L     2,8(4)
         MVC   96(4,13),4(2)
         MVC   100(4,13),40(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC91)
         MVC   96(4,13),56(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,52(4)
         SRL   2,31
         LTR   2,2
         BNE   @@L3676
@@L3662  EQU   *
         L     2,52(4)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BNE   @@L3677
@@L3663  EQU   *
         L     2,64(4)
         LTR   2,2
         BE    @@L3664
         LH    2,0(2)
         N     2,=XL4'0000FFFF'
         LA    5,121(0,0)
         CLR   2,5
         BE    @@L3667
         BH    @@L3671
         LA    5,120(0,0)
         CLR   2,5
         BE    @@L3666
@@L3669  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'10588'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L3664  EQU   *
         MVC   88(4,13),=F'21'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC97)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),32(4)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         MVC   88(4,13),=F'21'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC98)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),36(4)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         L     2,8(11)
         LTR   2,2
         BE    @@L3672
         L     2,44(4)
         LTR   2,2
         BNE   @@L3678
@@L3672  EQU   *
         MVC   88(4,13),=F'21'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         B     @@L3657
@@L3678  EQU   *
         MVC   88(4,13),=F'21'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTC)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC87)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),44(4)
         LA    1,88(,13)
         L     15,=V(PRINT@SI)
         BALR  14,15
         B     @@L3672
@@L3666  EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC94)
@@L3674  EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L3664
@@L3671  EQU   *
         LA    5,122(0,0)
         CLR   2,5
         BNE   @@L3669
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC96)
         B     @@L3674
@@L3667  EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC95)
         B     @@L3674
@@L3677  EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC93)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L3663
@@L3676  EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC92)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L3662
@@L3675  EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC88)
         L     2,16(4)
         MVC   96(4,13),4(2)
         L     2,0(4)
         MVC   100(4,13),4(2)
         B     @@L3673
@@L3657  EQU   *
* Function loop_giv_dump epilogue
         PDPEPIL
* Function loop_giv_dump literal pool
         DS    0F
         LTORG
* Function loop_giv_dump page table
         DS    0F
@@PGT118 EQU   *
         DC    A(@@PG118)
         DS    0F
* X-func divs prologue
DIVS     PDPPRLG CINDEX=119,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN119
         LTORG
@@FEN119 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG119  EQU   *
         LR    11,1
         L     10,=A(@@PGT119)
* Function divs code
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(15)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@102)
         BALR  14,15
* Function divs epilogue
         PDPEPIL
* Function divs literal pool
         DS    0F
         LTORG
* Function divs page table
         DS    0F
@@PGT119 EQU   *
         DC    A(@@PG119)
         DS    0F
* X-func divclas prologue
DIVCLAS  PDPPRLG CINDEX=120,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN120
         LTORG
@@FEN120 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG120  EQU   *
         LR    11,1
         L     10,=A(@@PGT120)
* Function divclas code
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(15)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@103)
         BALR  14,15
* Function divclas epilogue
         PDPEPIL
* Function divclas literal pool
         DS    0F
         LTORG
* Function divclas page table
         DS    0F
@@PGT120 EQU   *
         DC    A(@@PG120)
         DS    0F
* X-func dbgbiv prologue
DBGBIV   PDPPRLG CINDEX=121,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN121
         LTORG
@@FEN121 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG121  EQU   *
         LR    11,1
         L     10,=A(@@PGT121)
* Function dbgbiv code
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(15)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@78)
         BALR  14,15
* Function dbgbiv epilogue
         PDPEPIL
* Function dbgbiv literal pool
         DS    0F
         LTORG
* Function dbgbiv page table
         DS    0F
@@PGT121 EQU   *
         DC    A(@@PG121)
         DS    0F
* X-func debug_giv prologue
DEBUG@GI PDPPRLG CINDEX=122,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN122
         LTORG
@@FEN122 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG122  EQU   *
         LR    11,1
         L     10,=A(@@PGT122)
* Function debug_giv code
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(15)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@80)
         BALR  14,15
* Function debug_giv epilogue
         PDPEPIL
* Function debug_giv literal pool
         DS    0F
         LTORG
* Function debug_giv page table
         DS    0F
@@PGT122 EQU   *
         DC    A(@@PG122)
@@LC99   EQU   *
         DC    C';;  No NOTE_INSN_LOOP_BEG at %d'
         DC    X'15'
         DC    X'0'
@@LC100  EQU   *
         DC    C';;  No NOTE_INSN_LOOP_END at %d'
         DC    X'15'
         DC    X'0'
@@LC101  EQU   *
         DC    C';;  start %d (%d), cont dom %d (%d), cont %d (%d'
         DC    C'), vtop %d (%d), end %d (%d)'
         DC    X'15'
         DC    X'0'
@@LC102  EQU   *
         DC    C';;  top %d (%d), scan start %d (%d)'
         DC    X'15'
         DC    X'0'
@@LC103  EQU   *
         DC    C';;  exit_count %d'
         DC    X'0'
@@LC106  EQU   *
         DC    C';;  NOTE_INSN_LOOP_CONT not in loop latch'
         DC    X'15'
         DC    X'0'
@@LC104  EQU   *
         DC    C', labels:'
         DC    X'0'
@@LC105  EQU   *
         DC    C' %d '
         DC    X'0'
         DS    0F
* S-func loop_dump_aux prologue
@@104    PDPPRLG CINDEX=123,FRAME=136,BASER=12,ENTRY=NO
         B     @@FEN123
         LTORG
@@FEN123 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG123  EQU   *
         LR    11,1
         L     10,=A(@@PGT123)
* Function loop_dump_aux code
         L     5,0(11)
         LTR   5,5
         L     14,=A(@@L3683)
         BER   14
         L     2,4(11)
         LTR   2,2
         L     14,=A(@@L3683)
         BER   14
         L     4,24(5)
         L     2,0(4)
         L     3,8(2)
         LTR   3,3
         BE    @@L3687
         LH    2,0(3)
         CLM   2,3,=H'37'
         L     14,=A(@@L3818)
         BER   14
@@L3687  EQU   *
         L     12,0(,10)
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(@@LC99)
         L     2,0(4)
         L     2,8(2)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L3686  EQU   *
         L     12,0(,10)
         L     4,28(5)
         L     2,4(4)
         L     3,12(2)
         LTR   3,3
         BE    @@L3689
         LH    2,0(3)
         CLM   2,3,=H'37'
         L     14,=A(@@L3819)
         BER   14
@@L3689  EQU   *
         L     12,0(,10)
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(@@LC100)
         L     2,4(4)
         L     2,12(2)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L3688  EQU   *
         L     12,0(,10)
         L     3,104(5)
         LTR   3,3
         L     14,=A(@@L3683)
         BER   14
         LH    2,0(3)
         CLM   2,3,=H'37'
         L     14,=A(@@L3820)
         BER   14
         L     2,4(3)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         L     2,16(2)
         L     9,=F'-1'
         LTR   2,2
         BE    @@L3692
@@L3811  EQU   *
         L     12,0(,10)
         L     9,44(2)
@@L3692  EQU   *
         L     12,0(,10)
         L     3,96(5)
         LTR   3,3
         L     14,=A(@@L3703)
         BER   14
         LH    2,0(3)
         CLM   2,3,=H'37'
         L     14,=A(@@L3821)
         BER   14
         L     2,4(3)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         L     2,16(2)
         L     8,=F'-1'
         LTR   2,2
         BE    @@L3704
@@L3812  EQU   *
         L     12,0(,10)
         L     8,44(2)
@@L3704  EQU   *
         L     12,0(,10)
         L     3,96(5)
         LTR   3,3
         L     14,=A(@@L3715)
         BER   14
         LH    2,0(3)
         CLM   2,3,=H'37'
         L     14,=A(@@L3822)
         BER   14
         L     2,4(3)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         L     2,16(2)
         L     7,=F'-1'
         LTR   2,2
         BE    @@L3716
@@L3813  EQU   *
         L     12,0(,10)
         L     7,44(2)
@@L3716  EQU   *
         L     12,0(,10)
         L     3,92(5)
         LTR   3,3
         L     14,=A(@@L3727)
         BER   14
         LH    2,0(3)
         CLM   2,3,=H'37'
         L     14,=A(@@L3823)
         BER   14
         L     2,4(3)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         L     2,16(2)
         L     6,=F'-1'
         LTR   2,2
         BE    @@L3728
@@L3814  EQU   *
         L     12,0(,10)
         L     6,44(2)
@@L3728  EQU   *
         L     12,0(,10)
         L     3,108(5)
         LTR   3,3
         L     14,=A(@@L3739)
         BER   14
         LH    2,0(3)
         CLM   2,3,=H'37'
         L     14,=A(@@L3824)
         BER   14
         L     2,4(3)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         L     2,16(2)
         L     3,=F'-1'
         LTR   2,2
         BE    @@L3740
@@L3815  EQU   *
         L     12,0(,10)
         L     3,44(2)
@@L3740  EQU   *
         L     12,0(,10)
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(@@LC101)
         ST    9,96(13)
         L     2,104(5)
         L     4,=F'-1'
         LTR   2,2
         BE    @@L3752
         L     4,4(2)
@@L3752  EQU   *
         ST    4,100(13)
         ST    8,104(13)
         L     2,96(5)
         L     4,=F'-1'
         LTR   2,2
         BE    @@L3754
         L     4,4(2)
@@L3754  EQU   *
         ST    4,108(13)
         ST    7,112(13)
         L     4,=F'-1'
         LTR   2,2
         BE    @@L3756
         L     4,4(2)
@@L3756  EQU   *
         ST    4,116(13)
         ST    6,120(13)
         L     2,92(5)
         L     4,=F'-1'
         LTR   2,2
         BE    @@L3758
         L     4,4(2)
@@L3758  EQU   *
         ST    4,124(13)
         ST    3,128(13)
         L     2,108(5)
         L     3,=F'-1'
         LTR   2,2
         BE    @@L3760
         L     3,4(2)
@@L3760  EQU   *
         ST    3,132(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     3,112(5)
         LTR   3,3
         BE    @@L3761
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L3825
         L     2,4(3)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         L     2,16(2)
         L     4,=F'-1'
         LTR   2,2
         BE    @@L3762
@@L3816  EQU   *
         L     4,44(2)
@@L3762  EQU   *
         L     3,116(5)
         LTR   3,3
         BE    @@L3773
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L3826
         L     2,4(3)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         L     2,16(2)
         L     3,=F'-1'
         LTR   2,2
         BE    @@L3774
@@L3817  EQU   *
         L     3,44(2)
@@L3774  EQU   *
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(@@LC102)
         ST    4,96(13)
         L     2,112(5)
         L     4,=F'-1'
         LTR   2,2
         BE    @@L3786
         L     4,4(2)
@@L3786  EQU   *
         ST    4,100(13)
         ST    3,104(13)
         L     2,116(5)
         L     3,=F'-1'
         LTR   2,2
         BE    @@L3788
         L     3,4(2)
@@L3788  EQU   *
         ST    3,108(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(@@LC103)
         MVC   96(4,13),128(5)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,128(5)
         LTR   2,2
         BNE   @@L3827
@@L3789  EQU   *
         MVC   88(4,13),=A(@@LC19)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     2,8(5)
         L     4,44(2)
         L     3,96(5)
         LTR   3,3
         BE    @@L3798
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L3828
         L     2,4(3)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         L     2,16(2)
         LTR   2,2
         BE    @@L3808
         L     2,44(2)
         CLR   2,4
         L     14,=A(@@L3683)
         BER   14
@@L3799  EQU   *
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(@@LC106)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L3683)
         BR    14
@@L3808  EQU   *
         L     2,=F'-1'
         CLR   4,2
         BNE   @@L3799
         L     14,=A(@@L3683)
         BR    14
@@L3828  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BNE   @@L3830
         L     3,=F'-1'
         CLR   4,3
         BNE   @@L3799
         L     14,=A(@@L3683)
         BR    14
@@L3830  EQU   *
         L     6,=V(BBFORIN)
         L     3,0(6)
         MVC   88(4,13),96(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         LTR   2,2
         BNE   @@L3831
         L     2,=F'-1'
         CLR   4,2
         BNE   @@L3799
         L     14,=A(@@L3683)
         BR    14
@@L3831  EQU   *
         L     3,0(6)
         MVC   88(4,13),96(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         L     2,44(2)
         CLR   2,4
         BNE   @@L3799
         L     14,=A(@@L3683)
         BR    14
@@L3798  EQU   *
         L     3,=F'-1'
         CLR   4,3
         BNE   @@L3799
         L     14,=A(@@L3683)
         BR    14
@@L3827  EQU   *
         MVC   88(4,13),=A(@@LC104)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     2,124(5)
         LTR   2,2
         BE    @@L3789
@@L3796  EQU   *
         MVC   88(4,13),4(11)
         MVC   92(4,13),=A(@@LC105)
         L     3,4(2)
         L     4,=F'-1'
         LTR   3,3
         BE    @@L3795
         L     4,4(3)
@@L3795  EQU   *
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,8(2)
         LTR   2,2
         BNE   @@L3796
         B     @@L3789
@@L3826  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BNE   @@L3832
@@L3773  EQU   *
         L     3,=F'-1'
         B     @@L3774
@@L3832  EQU   *
         L     6,=V(BBFORIN)
         L     3,0(6)
         MVC   88(4,13),116(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         LTR   2,2
         BE    @@L3773
         L     3,0(6)
         MVC   88(4,13),116(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         B     @@L3817
@@L3825  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BNE   @@L3833
@@L3761  EQU   *
         L     4,=F'-1'
         B     @@L3762
@@L3833  EQU   *
         L     4,=V(BBFORIN)
         L     3,0(4)
         MVC   88(4,13),112(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         LTR   2,2
         BE    @@L3761
         L     3,0(4)
         MVC   88(4,13),112(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         B     @@L3816
@@L3824  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BNE   @@L3834
@@L3739  EQU   *
         L     3,=F'-1'
         B     @@L3740
@@L3834  EQU   *
         L     4,=V(BBFORIN)
         L     3,0(4)
         MVC   88(4,13),108(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         LTR   2,2
         BE    @@L3739
         L     3,0(4)
         MVC   88(4,13),108(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         B     @@L3815
@@L3823  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BNE   @@L3835
@@L3727  EQU   *
         L     6,=F'-1'
         B     @@L3728
@@L3835  EQU   *
         L     4,=V(BBFORIN)
         L     3,0(4)
         MVC   88(4,13),92(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         LTR   2,2
         BE    @@L3727
         L     3,0(4)
         MVC   88(4,13),92(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         B     @@L3814
@@L3822  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BNE   @@L3836
@@L3715  EQU   *
         L     7,=F'-1'
         B     @@L3716
@@L3836  EQU   *
         L     4,=V(BBFORIN)
         L     3,0(4)
         MVC   88(4,13),96(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         LTR   2,2
         BE    @@L3715
         L     3,0(4)
         MVC   88(4,13),96(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         B     @@L3813
@@L3821  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BNE   @@L3837
@@L3703  EQU   *
         L     8,=F'-1'
         B     @@L3704
@@L3837  EQU   *
         L     4,=V(BBFORIN)
         L     3,0(4)
         MVC   88(4,13),96(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         LTR   2,2
         BE    @@L3703
         L     3,0(4)
         MVC   88(4,13),96(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         B     @@L3812
@@L3820  EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         LTR   15,15
         BNE   @@L3838
@@L3695  EQU   *
         L     9,=F'-1'
         B     @@L3692
@@L3838  EQU   *
         L     4,=V(BBFORIN)
         L     3,0(4)
         MVC   88(4,13),104(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         LTR   2,2
         BE    @@L3695
         L     3,0(4)
         MVC   88(4,13),104(5)
         LA    1,88(,13)
         L     15,=V(NXTNON)
         BALR  14,15
         L     2,4(15)
         SLL   2,2
         L     2,16(3,2)
         B     @@L3811
@@L3819  EQU   *
         L     2,20(3)
         L     3,=F'-95'
         CLR   2,3
         BNE   @@L3689
         B     @@L3688
@@L3818  EQU   *
         L     2,20(3)
         L     3,=F'-96'
         CLR   2,3
         BNE   @@L3687
         B     @@L3686
@@L3683  EQU   *
* Function loop_dump_aux epilogue
         PDPEPIL
* Function loop_dump_aux literal pool
         DS    0F
         LTORG
* Function loop_dump_aux page table
         DS    0F
@@PGT123 EQU   *
         DC    A(@@PG123)
         DS    0F
* X-func dloop prologue
DLOOP    PDPPRLG CINDEX=124,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN124
         LTORG
@@FEN124 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG124  EQU   *
         LR    11,1
         L     10,=A(@@PGT124)
* Function dloop code
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(15)
         MVC   96(4,13),=A(@@104)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(FLDUMP)
         BALR  14,15
* Function dloop epilogue
         PDPEPIL
* Function dloop literal pool
         DS    0F
         LTORG
* Function dloop page table
         DS    0F
@@PGT124 EQU   *
         DC    A(@@PG124)
         DS    0F
* X-func dloops prologue
DLOOPS   PDPPRLG CINDEX=125,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN125
         LTORG
@@FEN125 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG125  EQU   *
         LR    11,1
         L     10,=A(@@PGT125)
* Function dloops code
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(11)
         MVC   92(4,13),0(15)
         MVC   96(4,13),=A(@@104)
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(FLSDUMP)
         BALR  14,15
* Function dloops epilogue
         PDPEPIL
* Function dloops literal pool
         DS    0F
         LTORG
* Function dloops page table
         DS    0F
@@PGT125 EQU   *
         DC    A(@@PG125)
* X-var uid_luid
         ENTRY UID@LUID
         DS    0F
UID@LUID EQU   *
         DC    4X'00'
* X-var max_uid_for_loop
         ENTRY MAX@UID@
         DS    0F
MAX@UID@ EQU   *
         DC    4X'00'
* X-var mxrgbl
         ENTRY MXRGBL
         DS    0F
MXRGBL   EQU   *
         DC    4X'00'
* X-var uid_loop
         ENTRY UID@LOOP
         DS    0F
UID@LOOP EQU   *
         DC    4X'00'
* X-var loop_dump_stream
         ENTRY LOOP@DUM
         DS    0F
LOOP@DUM EQU   *
         DC    4X'00'
         DS    0F
@@6      EQU   *
         DC    4X'00'
         DS    0F
@@4      EQU   *
         DC    4X'00'
         DS    0F
@@3      EQU   *
         DC    4X'00'
         DS    0F
@@7      EQU   *
         DC    4X'00'
         DS    0F
@@1      EQU   *
         DC    4X'00'
         DS    0F
@@0      EQU   *
         DC    4X'00'
         DS    0F
@@50     EQU   *
         DC    4X'00'
         DS    0F
@@66     EQU   *
         DC    4X'00'
         END
