         COPY  PDPTOP
         CSECT
* Program text area
@@LC0    EQU   *
         DC    X'0'
@@LC1    EQU   *
         DC    X'15'
         DC    X'0'
         DS    0F
* X-func debug_tree prologue
DEBUG@TR PDPPRLG CINDEX=0,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function debug_tree code
         L     2,=A(@@0)
         MVC   88(4,13),=F'148'
         LA    1,88(,13)
         L     15,=V(PERMALLO)
         BALR  14,15
         ST    15,0(2)
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'148'
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(@@LC0)
         MVC   96(4,13),0(11)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         MVC   0(4,2),=F'0'
         LA    1,88(,13)
         L     15,=V(@@GTERR)
         BALR  14,15
         MVC   88(4,13),0(15)
         MVC   92(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
* Function debug_tree epilogue
         PDPEPIL
* Function debug_tree literal pool
         DS    0F
         LTORG
* Function debug_tree page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
@@LC2    EQU   *
         DC    C' '
         DC    X'0'
@@LC3    EQU   *
         DC    C'%s <%s '
         DC    X'0'
@@LC4    EQU   *
         DC    C'%p'
         DC    X'0'
@@LC12   EQU   *
         DC    C'>'
         DC    X'0'
@@LC10   EQU   *
         DC    C' Inf'
         DC    X'0'
@@LC11   EQU   *
         DC    C' Nan'
         DC    X'0'
@@LC5    EQU   *
         DC    C' %s'
         DC    X'0'
@@LC6    EQU   *
         DC    C' overflow'
         DC    X'0'
@@LC9    EQU   *
         DC    C'0x%x%08x'
         DC    X'0'
@@LC8    EQU   *
         DC    C'-'
         DC    X'0'
@@LC7    EQU   *
         DC    C'%u'
         DC    X'0'
         DS    0F
* X-func prnodbrief prologue
PRNODBRI PDPPRLG CINDEX=1,FRAME=208,BASER=12,ENTRY=YES
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function prnodbrief code
         L     5,0(11)
         L     4,8(11)
         LTR   4,4
         BE    @@L2
         SLR   2,2
         IC    2,8(4)
         L     3,=V(TCODTYPE)
         IC    6,0(3,2)
         L     2,12(11)
         LTR   2,2
         BNH   @@L4
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L4     EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC3)
         MVC   96(4,13),4(11)
         SLR   2,2
         IC    2,8(4)
         MH    2,=H'4'
         L     3,=V(TCODNAME)
         L     2,0(2,3)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC4)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         CLM   6,1,=XL1'84'
         BE    @@L30
         CLM   6,1,=XL1'A3'
         BE    @@L31
@@L7     EQU   *
         CLI   8(4),1
         BE    @@L32
@@L13    EQU   *
         CLI   8(4),25
         BE    @@L33
@@L14    EQU   *
         CLI   8(4),26
         BE    @@L34
@@L20    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC12)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L2
@@L34    EQU   *
         L     2,8(4)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         BNE   @@L35
@@L21    EQU   *
         LM    2,3,16(4)
         ST    2,88(13)
         ST    3,4+88(13)
         LA    1,88(,13)
         L     15,=V(TGTISINF)
         BALR  14,15
         LTR   15,15
         BE    @@L22
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC10)
@@L29    EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L20
@@L22    EQU   *
         ST    2,88(13)
         ST    3,4+88(13)
         LA    1,88(,13)
         L     15,=V(TGTISNAN)
         BALR  14,15
         LTR   15,15
         BE    @@L24
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC11)
         B     @@L29
@@L24    EQU   *
         ST    2,88(13)
         ST    3,4+88(13)
         LA    2,104(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ERTODEC)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC5)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L20
@@L35    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L21
@@L33    EQU   *
         L     2,8(4)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BNE   @@L36
@@L15    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,20(4)
         LTR   2,2
         BE    @@L37
         L     3,=F'-1'
         CLR   2,3
         BE    @@L38
@@L18    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC9)
         MVC   96(4,13),20(4)
         MVC   100(4,13),16(4)
@@L28    EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L14
@@L38    EQU   *
         L     2,16(4)
         LTR   2,2
         BE    @@L18
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC8)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC7)
         L     3,16(4)
         LCR   2,3
         ST    2,96(13)
         B     @@L28
@@L37    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC7)
         MVC   96(4,13),16(4)
         B     @@L28
@@L36    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L15
@@L32    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC5)
         MVC   96(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L13
@@L31    EQU   *
         L     3,52(4)
         LTR   3,3
         BE    @@L7
         IC    2,8(3)
         CLM   2,1,=XL1'01'
         BE    @@L39
         CLM   2,1,=XL1'21'
         BNE   @@L7
         L     2,44(3)
         LTR   2,2
         BE    @@L7
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC5)
         L     2,44(3)
@@L27    EQU   *
         MVC   96(4,13),16(2)
@@L26    EQU   *
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L7
@@L39    EQU   *
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC5)
         MVC   96(4,13),16(3)
         B     @@L26
@@L30    EQU   *
         L     2,44(4)
         LTR   2,2
         BE    @@L7
         ST    5,88(13)
         MVC   92(4,13),=A(@@LC5)
         B     @@L27
@@L2     EQU   *
* Function prnodbrief epilogue
         PDPEPIL
* Function prnodbrief literal pool
         DS    0F
         LTORG
* Function prnodbrief page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
         DS    0F
* X-func indent_to prologue
INDENT@T PDPPRLG CINDEX=2,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function indent_to code
         L     3,0(11)
         L     2,4(11)
         LTR   2,2
         BNH   @@L41
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L41    EQU   *
         LTR   2,2
         BNH   @@L48
@@L46    EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         BCTR  2,0
         LTR   2,2
         BNE   @@L46
@@L48    EQU   *
* Function indent_to epilogue
         PDPEPIL
* Function indent_to literal pool
         DS    0F
         LTORG
* Function indent_to page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
@@LC13   EQU   *
         DC    C'type'
         DC    X'0'
@@LC114  EQU   *
         DC    C'vars'
         DC    X'0'
@@LC115  EQU   *
         DC    C'supercontext'
         DC    X'0'
@@LC116  EQU   *
         DC    C'subblocks'
         DC    X'0'
@@LC87   EQU   *
         DC    C'chain'
         DC    X'0'
@@LC79   EQU   *
         DC    C'abstract_origin'
         DC    X'0'
@@LC119  EQU   *
         DC    C'rtl %d '
         DC    X'0'
@@LC122  EQU   *
         DC    C'%s:%d:%d'
         DC    X'0'
@@LC123  EQU   *
         DC    C'(no file info)'
         DC    X'0'
@@LC120  EQU   *
         DC    C'(nil)'
         DC    X'0'
@@LC121  EQU   *
         DC    C'arg %d'
         DC    X'0'
@@LC117  EQU   *
         DC    C'body'
         DC    X'0'
@@LC118  EQU   *
         DC    C'block'
         DC    X'0'
@@LC41   EQU   *
         DC    C' regdecl'
         DC    X'0'
@@LC65   EQU   *
         DC    C' file %s line %d'
         DC    X'0'
@@LC66   EQU   *
         DC    C'size'
         DC    X'0'
@@LC67   EQU   *
         DC    C'unit size'
         DC    X'0'
@@LC69   EQU   *
         DC    C' align %d'
         DC    X'0'
@@LC73   EQU   *
         DC    C' alias set '
         DC    X'0'
@@LC74   EQU   *
         DC    C'%d'
         DC    X'0'
@@LC77   EQU   *
         DC    C'context'
         DC    X'0'
@@LC78   EQU   *
         DC    C'attributes'
         DC    X'0'
@@LC80   EQU   *
         DC    C'arguments'
         DC    X'0'
@@LC81   EQU   *
         DC    C'result'
         DC    X'0'
@@LC82   EQU   *
         DC    C'initial'
         DC    X'0'
@@LC86   EQU   *
         DC    C'saved-insns '
         DC    X'0'
@@LC83   EQU   *
         DC    C'arg-type'
         DC    X'0'
@@LC84   EQU   *
         DC    C'arg-type-as-written'
         DC    X'0'
@@LC85   EQU   *
         DC    C'incoming-rtl '
         DC    X'0'
@@LC75   EQU   *
         DC    C'offset'
         DC    X'0'
@@LC76   EQU   *
         DC    C'bit offset'
         DC    X'0'
@@LC70   EQU   *
         DC    C' offset_align '
         DC    X'0'
@@LC68   EQU   *
         DC    C' user'
         DC    X'0'
@@LC72   EQU   *
         DC    C' built-in %s:%s'
         DC    X'0'
@@LC71   EQU   *
         DC    C' built-in BUILT_IN_MD %d'
         DC    X'0'
@@LC64   EQU   *
         DC    C' decl_7'
         DC    X'0'
@@LC63   EQU   *
         DC    C' decl_6'
         DC    X'0'
@@LC62   EQU   *
         DC    C' decl_5'
         DC    X'0'
@@LC61   EQU   *
         DC    C' decl_4'
         DC    X'0'
@@LC60   EQU   *
         DC    C' decl_3'
         DC    X'0'
@@LC59   EQU   *
         DC    C' decl_2'
         DC    X'0'
@@LC58   EQU   *
         DC    C' decl_1'
         DC    X'0'
@@LC57   EQU   *
         DC    C' decl_0'
         DC    X'0'
@@LC56   EQU   *
         DC    C' defer-output'
         DC    X'0'
@@LC55   EQU   *
         DC    C' virtual'
         DC    X'0'
@@LC54   EQU   *
         DC    C' transparent-union'
         DC    X'0'
@@LC53   EQU   *
         DC    C' in-text-section'
         DC    X'0'
@@LC52   EQU   *
         DC    C' error-issued'
         DC    X'0'
@@LC51   EQU   *
         DC    C' too-late'
         DC    X'0'
@@LC50   EQU   *
         DC    C' nonaddressable'
         DC    X'0'
@@LC49   EQU   *
         DC    C' bit-field'
         DC    X'0'
@@LC48   EQU   *
         DC    C' packed'
         DC    X'0'
@@LC47   EQU   *
         DC    C' no-static-chain'
         DC    X'0'
@@LC46   EQU   *
         DC    C' built-in-nonansi'
         DC    X'0'
@@LC45   EQU   *
         DC    C' built-in'
         DC    X'0'
@@LC44   EQU   *
         DC    C' inline'
         DC    X'0'
@@LC43   EQU   *
         DC    C' suppress-debug'
         DC    X'0'
@@LC42   EQU   *
         DC    C' nonlocal'
         DC    X'0'
@@LC40   EQU   *
         DC    C' weak'
         DC    X'0'
@@LC39   EQU   *
         DC    C' external'
         DC    X'0'
@@LC38   EQU   *
         DC    C' common'
         DC    X'0'
@@LC37   EQU   *
         DC    C' in_system_header'
         DC    X'0'
@@LC36   EQU   *
         DC    C' abstract'
         DC    X'0'
@@LC35   EQU   *
         DC    C' ignored'
         DC    X'0'
@@LC128  EQU   *
         DC    C'purpose'
         DC    X'0'
@@LC129  EQU   *
         DC    C'value'
         DC    X'0'
@@LC130  EQU   *
         DC    C'elt %d'
         DC    X'0'
@@LC125  EQU   *
         DC    C'real'
         DC    X'0'
@@LC126  EQU   *
         DC    C'imag'
         DC    X'0'
@@LC124  EQU   *
         DC    C'elt%d: '
         DC    X'0'
@@LC127  EQU   *
         DC    C' "%s"'
         DC    X'0'
@@LC102  EQU   *
         DC    C' symtab %d'
         DC    X'0'
@@LC112  EQU   *
         DC    C'pointer_to_this'
         DC    X'0'
@@LC113  EQU   *
         DC    C'reference_to_this'
         DC    X'0'
@@LC111  EQU   *
         DC    C'basetype'
         DC    X'0'
@@LC110  EQU   *
         DC    C'arg-types'
         DC    X'0'
@@LC109  EQU   *
         DC    C'method basetype'
         DC    X'0'
@@LC108  EQU   *
         DC    C'fields'
         DC    X'0'
@@LC107  EQU   *
         DC    C'domain'
         DC    X'0'
@@LC106  EQU   *
         DC    C'values'
         DC    X'0'
@@LC103  EQU   *
         DC    C' precision %d'
         DC    X'0'
@@LC104  EQU   *
         DC    C'min'
         DC    X'0'
@@LC105  EQU   *
         DC    C'max'
         DC    X'0'
@@LC101  EQU   *
         DC    C' type_6'
         DC    X'0'
@@LC100  EQU   *
         DC    C' type_5'
         DC    X'0'
@@LC99   EQU   *
         DC    C' type_4'
         DC    X'0'
@@LC98   EQU   *
         DC    C' type_3'
         DC    X'0'
@@LC97   EQU   *
         DC    C' type_2'
         DC    X'0'
@@LC96   EQU   *
         DC    C' type_1'
         DC    X'0'
@@LC95   EQU   *
         DC    C' type_0'
         DC    X'0'
@@LC94   EQU   *
         DC    C' ambient-boundedness'
         DC    X'0'
@@LC93   EQU   *
         DC    C' nonaliased-component'
         DC    X'0'
@@LC92   EQU   *
         DC    C' needs-constructing'
         DC    X'0'
@@LC91   EQU   *
         DC    C' string-flag'
         DC    X'0'
@@LC90   EQU   *
         DC    C' returns-stack-depressed'
         DC    X'0'
@@LC89   EQU   *
         DC    C' sizetype'
         DC    X'0'
@@LC88   EQU   *
         DC    C' no-force-blk'
         DC    X'0'
@@LC34   EQU   *
         DC    C' tree_6'
         DC    X'0'
@@LC33   EQU   *
         DC    C' tree_5'
         DC    X'0'
@@LC32   EQU   *
         DC    C' tree_4'
         DC    X'0'
@@LC31   EQU   *
         DC    C' tree_3'
         DC    X'0'
@@LC30   EQU   *
         DC    C' tree_2'
         DC    X'0'
@@LC29   EQU   *
         DC    C' tree_1'
         DC    X'0'
@@LC28   EQU   *
         DC    C' tree_0'
         DC    X'0'
@@LC27   EQU   *
         DC    C' deprecated'
         DC    X'0'
@@LC26   EQU   *
         DC    C' static'
         DC    X'0'
@@LC25   EQU   *
         DC    C' protected'
         DC    X'0'
@@LC24   EQU   *
         DC    C' private'
         DC    X'0'
@@LC23   EQU   *
         DC    C' public'
         DC    X'0'
@@LC22   EQU   *
         DC    C' nothrow'
         DC    X'0'
@@LC21   EQU   *
         DC    C' used'
         DC    X'0'
@@LC20   EQU   *
         DC    C' asm_written'
         DC    X'0'
@@LC19   EQU   *
         DC    C' unsigned'
         DC    X'0'
@@LC18   EQU   *
         DC    C' volatile'
         DC    X'0'
@@LC17   EQU   *
         DC    C' addressable'
         DC    X'0'
@@LC16   EQU   *
         DC    C' constant'
         DC    X'0'
@@LC15   EQU   *
         DC    C' readonly'
         DC    X'0'
@@LC14   EQU   *
         DC    C' side-effects'
         DC    X'0'
         DS    0F
* X-func prnode prologue
PRNODE   PDPPRLG CINDEX=3,FRAME=232,BASER=12,ENTRY=YES
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function prnode code
         SLR   4,4
         SLR   5,5
         L     7,0(11)
         L     6,8(11)
         L     8,12(11)
         LTR   6,6
         L     14,=A(@@L49)
         BER   14
         SLR   3,3
         IC    3,8(6)
         L     2,=V(TCODTYPE)
         IC    9,0(2,3)
         LA    2,24(0,0)
         CR    8,2
         L     14,=A(@@L253)
         BHR   14
         LA    3,8(0,0)
         CR    8,3
         BNH   @@L52
         CLM   9,1,=XL1'A3'
         L     14,=A(@@L253)
         BER   14
         CLM   9,1,=XL1'84'
         L     14,=A(@@L253)
         BER   14
@@L52    EQU   *
         IC    2,8(6)
         CLM   2,1,=XL1'00'
         L     14,=A(@@L253)
         BER   14
         LR    4,6
         SRDL  4,32
         LA    2,37(0,0)
         DR    4,2
         L     2,=A(@@0)
         L     2,0(2)
         LR    3,4
         SLL   3,2
         L     15,0(3,2)
         LTR   15,15
         BE    @@L248
@@L60    EQU   *
         L     2,0(15)
         CLR   2,6
         L     14,=A(@@L253)
         BER   14
         L     15,4(15)
         LTR   15,15
         BNE   @@L60
@@L248   EQU   *
         MVC   88(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(PERMALLO)
         BALR  14,15
         ST    6,0(15)
         L     2,=A(@@0)
         L     2,0(2)
         L     4,0(3,2)
         ST    4,4(15)
         ST    15,0(3,2)
         ST    7,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC3)
         MVC   96(4,13),4(11)
         SLR   3,3
         IC    3,8(6)
         MH    3,=H'4'
         L     2,=V(TCODNAME)
         L     3,0(3,2)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC4)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         CLM   9,1,=XL1'84'
         L     14,=A(@@L270)
         BER   14
         CLM   9,1,=XL1'A3'
         L     14,=A(@@L271)
         BER   14
@@L63    EQU   *
         L     12,0(,10)
         CLI   8(6),1
         L     14,=A(@@L272)
         BER   14
@@L69    EQU   *
         L     12,0(,10)
         IC    2,8(6)
         CLM   2,1,=XL1'19'
         L     14,=A(@@L273)
         BER   14
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC13)
         MVC   96(4,13),4(6)
         A     8,=F'4'
         ST    8,100(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         L     2,4(6)
         LTR   2,2
         L     14,=A(@@L274)
         BNER  14
@@L72    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L275)
         BNER  14
@@L75    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L276)
         BNER  14
@@L76    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L277)
         BNER  14
@@L77    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L278)
         BNER  14
@@L78    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L279)
         BNER  14
@@L79    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L280)
         BNER  14
@@L80    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,17
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L281)
         BNER  14
@@L81    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,15
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L282)
         BNER  14
@@L82    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L283)
         BNER  14
@@L83    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L284)
         BNER  14
@@L84    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,11
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L285)
         BNER  14
@@L85    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,10
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L286)
         BNER  14
@@L86    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L287)
         BNER  14
@@L87    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,8
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L288)
         BNER  14
@@L88    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,7
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L289)
         BNER  14
@@L89    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,6
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L290)
         BNER  14
@@L90    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,5
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L291)
         BNER  14
@@L91    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L292)
         BNER  14
@@L92    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,3
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L293)
         BNER  14
@@L93    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,2
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L294)
         BNER  14
@@L94    EQU   *
         L     12,0(,10)
         L     2,8(6)
         SRL   2,1
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L295)
         BNER  14
@@L95    EQU   *
         L     12,0(,10)
         L     4,8(6)
         LR    3,4
         SRL   3,24
         L     2,=V(TCODTYPE)
         SLR   5,5
         IC    5,0(2,3)
         LR    2,5
         LA    3,153(0,0)
         CR    5,3
         BE    @@L191
         L     14,=A(@@L244)
         BHR   14
         LA    5,131(0,0)
         CR    2,5
         L     14,=A(@@L206)
         BER   14
         BH    @@L245
         LA    3,76(0,0)
         CLR   2,3
         BE    @@L191
         LA    4,130(0,0)
         CLR   2,4
         BE    @@L185
@@L96    EQU   *
         L     12,0(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC12)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L49)
         BR    14
@@L185   EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC114)
         MVC   96(4,13),16(6)
         LR    2,8
         A     2,=F'4'
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC115)
         MVC   96(4,13),24(6)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC116)
         MVC   96(4,13),20(6)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC87)
         MVC   96(4,13),0(6)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC79)
         MVC   96(4,13),28(6)
@@L267   EQU   *
         L     12,0(,10)
         ST    2,100(13)
@@L261   EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         B     @@L96
@@L191   EQU   *
         L     12,0(,10)
         CLI   8(6),52
         BE    @@L296
         SRL   4,24
         LR    3,4
         MH    3,=H'4'
         L     2,=V(TCODLEN)
         L     5,0(3,2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FIRST@RT)
         BALR  14,15
         LR    9,15
         SLR   4,4
         CR    4,5
         BNL   @@L250
         LR    3,6
         A     3,=F'16'
@@L201   EQU   *
         CR    4,9
         BL    @@L197
         ST    7,88(13)
         A     8,=F'4'
         ST    8,92(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC119)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,0(3)
         LTR   2,2
         BE    @@L198
         ST    7,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(PRRTL)
         BALR  14,15
@@L199   EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L195   EQU   *
         A     3,=F'4'
         A     4,=F'1'
         CR    4,5
         BL    @@L201
@@L250   EQU   *
         CLI   8(6),144
         BE    @@L297
@@L202   EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC87)
         MVC   96(4,13),0(6)
         A     8,=F'4'
         ST    8,100(13)
         B     @@L261
@@L297   EQU   *
         ST    7,88(13)
         A     8,=F'4'
         ST    8,92(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC122)
         L     2,20(6)
         L     3,=A(@@LC123)
         LTR   2,2
         BE    @@L204
         L     3,16(2)
@@L204   EQU   *
         ST    3,96(13)
         L     3,12(6)
         LR    2,3
         SRA   2,12
         ST    2,100(13)
         N     3,=F'4095'
         ST    3,104(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L202
@@L198   EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC120)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L199
@@L197   EQU   *
         LA    2,112(,13)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC121)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    7,88(13)
         ST    2,92(13)
         MVC   96(4,13),0(3)
         A     8,=F'4'
         ST    8,100(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         B     @@L195
@@L296   EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC114)
         MVC   96(4,13),16(6)
         LR    2,8
         A     2,=F'4'
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC117)
         MVC   96(4,13),20(6)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC118)
         MVC   96(4,13),24(6)
         B     @@L267
@@L245   EQU   *
         LA    5,132(0,0)
         CLR   2,5
         BE    @@L97
         LA    3,133(0,0)
         CLR   2,3
         BE    @@L191
         B     @@L96
@@L97    EQU   *
         L     2,28(6)
         LR    3,2
         SRL   3,24
         SRL   2,17
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L298)
         BNER  14
@@L98    EQU   *
         L     12,0(,10)
         LH    2,28(6)
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L299)
         BNER  14
@@L99    EQU   *
         L     12,0(,10)
         L     2,28(6)
         SRL   2,15
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L300)
         BNER  14
@@L100   EQU   *
         L     12,0(,10)
         L     2,28(6)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L301)
         BNER  14
@@L101   EQU   *
         L     12,0(,10)
         L     2,28(6)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L302)
         BNER  14
@@L102   EQU   *
         L     12,0(,10)
         L     2,28(6)
         SRL   2,8
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L303)
         BNER  14
@@L103   EQU   *
         L     12,0(,10)
         L     2,28(6)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    @@L104
         IC    2,8(6)
         CLM   2,1,=XL1'25'
         BE    @@L104
         CLM   2,1,=XL1'1E'
         BE    @@L104
         CLM   2,1,=XL1'1F'
         BE    @@L104
         MVC   88(4,13),=A(@@LC41)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
@@L104   EQU   *
         L     2,28(6)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L304)
         BNER  14
@@L105   EQU   *
         L     12,0(,10)
         CLI   8(6),33
         L     14,=A(@@L305)
         BER   14
@@L106   EQU   *
         L     12,0(,10)
         CLI   8(6),30
         L     14,=A(@@L306)
         BER   14
@@L107   EQU   *
         L     12,0(,10)
         CLI   8(6),30
         L     14,=A(@@L307)
         BER   14
@@L108   EQU   *
         L     12,0(,10)
         L     2,8(6)
         N     2,=F'-16515072'
         L     4,=F'503578624'
         CLR   2,4
         L     14,=A(@@L308)
         BER   14
@@L109   EQU   *
         L     12,0(,10)
         CLI   8(6),30
         L     14,=A(@@L309)
         BER   14
@@L110   EQU   *
         L     12,0(,10)
         CLI   8(6),37
         L     14,=A(@@L310)
         BER   14
@@L111   EQU   *
         L     12,0(,10)
         CLI   8(6),37
         L     14,=A(@@L311)
         BER   14
@@L112   EQU   *
         L     12,0(,10)
         CLI   8(6),37
         L     14,=A(@@L312)
         BER   14
@@L113   EQU   *
         L     12,0(,10)
         CLI   8(6),31
         L     14,=A(@@L313)
         BER   14
@@L114   EQU   *
         L     12,0(,10)
         CLI   8(6),31
         L     14,=A(@@L314)
         BER   14
@@L115   EQU   *
         L     12,0(,10)
         CLI   8(6),34
         L     14,=A(@@L315)
         BER   14
@@L116   EQU   *
         L     12,0(,10)
         CLI   8(6),35
         L     14,=A(@@L316)
         BER   14
@@L117   EQU   *
         L     12,0(,10)
         L     2,28(6)
         SRL   2,18
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L317)
         BNER  14
@@L118   EQU   *
         L     12,0(,10)
         L     2,28(6)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L318)
         BNER  14
@@L119   EQU   *
         L     12,0(,10)
         L     2,32(6)
         SRL   2,26
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L319)
         BNER  14
@@L120   EQU   *
         L     12,0(,10)
         L     2,32(6)
         SRL   2,25
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L320)
         BNER  14
@@L121   EQU   *
         L     12,0(,10)
         IC    2,32(6)
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L321)
         BNER  14
@@L122   EQU   *
         L     12,0(,10)
         L     2,32(6)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L322)
         BNER  14
@@L123   EQU   *
         L     12,0(,10)
         L     2,32(6)
         SRL   2,22
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L323)
         BNER  14
@@L124   EQU   *
         L     12,0(,10)
         L     2,32(6)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L324)
         BNER  14
@@L125   EQU   *
         L     12,0(,10)
         L     2,32(6)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L325)
         BNER  14
@@L126   EQU   *
         L     12,0(,10)
         L     2,32(6)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L326)
         BNER  14
@@L127   EQU   *
         L     12,0(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC5)
         MH    3,=H'4'
         L     2,=V(MODE@NAM)
         L     3,0(3,2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC65)
         MVC   96(4,13),12(6)
         MVC   100(4,13),16(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC66)
         MVC   96(4,13),24(6)
         LR    4,8
         A     4,=F'4'
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC67)
         MVC   96(4,13),40(6)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         CLI   8(6),30
         L     14,=A(@@L327)
         BER   14
@@L129   EQU   *
         L     12,0(,10)
         ST    7,88(13)
         A     8,=F'3'
         ST    8,92(13)
         A     8,=F'-3'
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
@@L128   EQU   *
         L     12,0(,10)
         CLI   8(6),30
         L     14,=A(@@L130)
         BER   14
         L     2,32(6)
         SRL   2,28
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L328)
         BNER  14
@@L131   EQU   *
         L     12,0(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC69)
         L     2,36(6)
         SRL   2,8
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         CLI   8(6),37
         L     14,=A(@@L329)
         BER   14
@@L133   EQU   *
         L     12,0(,10)
         L     2,104(6)
         L     3,=F'-1'
         CLR   2,3
         BE    @@L137
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC73)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC74)
         MVC   96(4,13),104(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
@@L137   EQU   *
         CLI   8(6),37
         L     14,=A(@@L330)
         BER   14
@@L138   EQU   *
         L     12,0(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC77)
         MVC   96(4,13),48(6)
         LR    3,8
         A     3,=F'4'
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC78)
         MVC   96(4,13),76(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC79)
         MVC   96(4,13),64(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC80)
         MVC   96(4,13),52(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC81)
         MVC   96(4,13),56(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC82)
         MVC   96(4,13),60(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         ST    7,88(13)
         ST    6,92(13)
         ST    8,96(13)
         L     2,=V(LANG@HOO)
         L     2,60(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     2,80(6)
         LTR   2,2
         L     14,=A(@@L331)
         BNER  14
@@L139   EQU   *
         L     12,0(,10)
         IC    2,8(6)
         CLM   2,1,=XL1'23'
         L     14,=A(@@L332)
         BER   14
         CLM   2,1,=XL1'1E'
         L     14,=A(@@L333)
         BER   14
@@L268   EQU   *
         L     12,0(,10)
         LA    4,4(0,0)
         CLR   8,4
         L     14,=A(@@L334)
         BER   14
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC87)
         MVC   96(4,13),0(6)
         A     8,=F'4'
         ST    8,100(13)
@@L264   EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         B     @@L96
@@L334   EQU   *
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC87)
         MVC   96(4,13),0(6)
         MVC   100(4,13),=F'8'
         B     @@PGE3
         DS    0F
         LTORG
         DS    0F
@@PGE3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         L     14,=A(@@L261)
         BR    14
@@L333   EQU   *
         L     12,4(,10)
         L     2,88(6)
         LTR   2,2
         L     14,=A(@@L268)
         BER   14
         ST    7,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC86)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC4)
         MVC   96(4,13),88(6)
@@L269   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L268)
         BR    14
@@L332   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC83)
         MVC   96(4,13),60(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC84)
         MVC   96(4,13),56(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         L     2,88(6)
         LTR   2,2
         L     14,=A(@@L268)
         BER   14
         ST    7,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC85)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),88(6)
         LA    1,88(,13)
         L     15,=V(PRRTL)
         BALR  14,15
         L     14,=A(@@L268)
         BR    14
@@L331   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
         L     2,80(6)
         LTR   2,2
         BE    @@L335
@@L140   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(PRRTL)
         BALR  14,15
         L     14,=A(@@L139)
         BR    14
@@L335   EQU   *
         L     12,4(,10)
         ST    6,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(6)
         B     @@L140
@@L330   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC75)
         MVC   96(4,13),52(6)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC76)
         MVC   96(4,13),88(6)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         L     14,=A(@@L138)
         BR    14
@@L329   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC70)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC7)
         SLR   3,3
         IC    3,39(6)
         LA    2,1(0,0)
         SLL   2,0(3)
         ST    2,96(13)
@@L256   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L133)
         BR    14
@@L328   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC68)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L131)
         BR    14
@@L130   EQU   *
         L     12,4(,10)
         L     3,28(6)
         SRL   3,1
         N     3,=F'3'
         LTR   3,3
         L     14,=A(@@L133)
         BER   14
         LA    5,2(0,0)
         CLR   3,5
         BE    @@L336
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC72)
         MH    3,=H'4'
         L     2,=V(BI@CLASS)
         L     3,0(3,2)
         ST    3,96(13)
         L     3,36(6)
         SLL   3,2
         L     2,=V(BI@NAMES)
         L     2,0(3,2)
         ST    2,100(13)
         B     @@L256
@@L336   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC71)
         MVC   96(4,13),36(6)
         B     @@L256
@@L327   EQU   *
         L     12,4(,10)
         L     2,28(6)
         N     2,=F'1048582'
         LTR   2,2
         L     14,=A(@@L128)
         BER   14
         L     14,=A(@@L129)
         BR    14
@@L326   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC64)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L127)
         BR    14
@@L325   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC63)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L126)
         BR    14
@@L324   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC62)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L125)
         BR    14
@@L323   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC61)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L124)
         BR    14
@@L322   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC60)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L123)
         BR    14
@@L321   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC59)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L122)
         BR    14
@@L320   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC58)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L121)
         BR    14
@@L319   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC57)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L120)
         BR    14
@@L318   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC56)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L119)
         BR    14
@@L317   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC55)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L118)
         BR    14
@@L316   EQU   *
         L     12,4(,10)
         L     2,28(6)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L117)
         BER   14
         MVC   88(4,13),=A(@@LC54)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L117)
         BR    14
@@L315   EQU   *
         L     12,4(,10)
         L     2,28(6)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L116)
         BER   14
         MVC   88(4,13),=A(@@LC53)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L116)
         BR    14
@@L314   EQU   *
         L     12,4(,10)
         L     2,28(6)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L115)
         BER   14
         MVC   88(4,13),=A(@@LC52)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L115)
         BR    14
@@L313   EQU   *
         L     12,4(,10)
         L     2,28(6)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L114)
         BER   14
         MVC   88(4,13),=A(@@LC51)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L114)
         BR    14
@@L312   EQU   *
         L     12,4(,10)
         L     2,32(6)
         SRL   2,29
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L113)
         BER   14
         MVC   88(4,13),=A(@@LC50)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L113)
         BR    14
@@L311   EQU   *
         L     12,4(,10)
         L     2,28(6)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L112)
         BER   14
         MVC   88(4,13),=A(@@LC49)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L112)
         BR    14
@@L310   EQU   *
         L     12,4(,10)
         L     2,28(6)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L111)
         BER   14
         MVC   88(4,13),=A(@@LC48)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L111)
         BR    14
@@L309   EQU   *
         L     12,4(,10)
         L     2,28(6)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L110)
         BER   14
         MVC   88(4,13),=A(@@LC47)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L110)
         BR    14
@@L308   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC46)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L109)
         BR    14
@@L307   EQU   *
         L     12,4(,10)
         L     2,28(6)
         SRL   2,1
         N     2,=F'3'
         LTR   2,2
         L     14,=A(@@L108)
         BER   14
         MVC   88(4,13),=A(@@LC45)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L108)
         BR    14
@@L306   EQU   *
         L     12,4(,10)
         L     2,28(6)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L107)
         BER   14
         MVC   88(4,13),=A(@@LC44)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L107)
         BR    14
@@L305   EQU   *
         L     12,4(,10)
         L     2,28(6)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L106)
         BER   14
         MVC   88(4,13),=A(@@LC43)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L106)
         BR    14
@@L304   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC42)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L105)
         BR    14
@@L303   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC40)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L103)
         BR    14
@@L302   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC39)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L102)
         BR    14
@@L301   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC38)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L101)
         BR    14
@@L300   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC37)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L100)
         BR    14
@@L299   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC36)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L99)
         BR    14
@@L298   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC35)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L98)
         BR    14
@@L206   EQU   *
         L     12,4(,10)
         LR    3,4
         SRL   3,24
         BCTR  3,0
         LA    5,28(0,0)
         CLR   3,5
         L     14,=A(@@L239)
         BHR   14
         MH    3,=H'4'
         L     2,=A(@@L241)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L241   EQU   *
         DC    A(@@L230)
         DC    A(@@L231)
         DC    A(@@L232)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L239)
         DC    A(@@L208)
         DC    A(@@L214)
         DC    A(@@L226)
         DC    A(@@L220)
         DC    A(@@L227)
@@L208   EQU   *
         L     12,4(,10)
         SRL   4,13
         N     4,=F'1'
         LTR   4,4
         BNE   @@L337
@@L209   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     2,20(6)
         LTR   2,2
         BE    @@L338
         L     3,=F'-1'
         CLR   2,3
         BE    @@L339
@@L212   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC9)
         MVC   96(4,13),20(6)
         MVC   100(4,13),16(6)
@@L263   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L96)
         BR    14
@@L339   EQU   *
         L     12,4(,10)
         L     2,16(6)
         LTR   2,2
         BE    @@L212
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC8)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC7)
         L     6,16(6)
         LCR   2,6
@@L265   EQU   *
         L     12,4(,10)
         ST    2,96(13)
         B     @@L263
@@L338   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC7)
         MVC   96(4,13),16(6)
         B     @@L263
@@L337   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L209
@@L230   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         ST    6,92(13)
         ST    8,96(13)
         L     2,=V(LANG@HOO)
         L     2,68(2)
@@L260   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     14,=A(@@L96)
         BR    14
@@L231   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC128)
         MVC   96(4,13),12(6)
         LR    2,8
         A     2,=F'4'
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC129)
         MVC   96(4,13),16(6)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC87)
         MVC   96(4,13),0(6)
         L     14,=A(@@L267)
         BR    14
@@L232   EQU   *
         L     12,4(,10)
         L     5,12(6)
         SLR   4,4
         CR    4,5
         L     14,=A(@@L96)
         BNLR  14
         LR    3,6
         A     3,=F'16'
@@L238   EQU   *
         L     12,4(,10)
         L     2,0(3)
         LTR   2,2
         BNE   @@L340
@@L235   EQU   *
         L     12,4(,10)
         A     3,=F'4'
         A     4,=F'1'
         CR    4,5
         BL    @@L238
         L     14,=A(@@L96)
         BR    14
@@L340   EQU   *
         L     12,4(,10)
         LA    2,128(,13)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC130)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    7,88(13)
         A     8,=F'4'
         ST    8,92(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
         ST    7,88(13)
         ST    2,92(13)
         MVC   96(4,13),0(3)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         B     @@L235
@@L239   EQU   *
         L     12,4(,10)
         SRL   4,24
         L     2,=V(TCODTYPE)
         IC    2,0(2,4)
         CLM   2,1,=XL1'A7'
         L     14,=A(@@L96)
         BNER  14
         ST    7,88(13)
         ST    6,92(13)
         ST    8,96(13)
         L     2,=V(LANG@HOO)
         L     2,56(2)
         B     @@L260
@@L214   EQU   *
         L     12,4(,10)
         SRL   4,12
         N     4,=F'1'
         LTR   4,4
         BNE   @@L341
@@L215   EQU   *
         L     12,4(,10)
         LM    2,3,16(6)
         ST    2,88(13)
         ST    3,4+88(13)
         LA    1,88(,13)
         L     15,=V(TGTISINF)
         BALR  14,15
         LTR   15,15
         BE    @@L216
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC10)
@@L262   EQU   *
         L     12,4(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L96)
         BR    14
@@L216   EQU   *
         L     12,4(,10)
         ST    2,88(13)
         ST    3,4+88(13)
         LA    1,88(,13)
         L     15,=V(TGTISNAN)
         BALR  14,15
         LTR   15,15
         BE    @@L218
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC11)
         B     @@L262
@@L218   EQU   *
         L     12,4(,10)
         ST    2,88(13)
         ST    3,4+88(13)
         LA    2,128(,13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(ERTODEC)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC5)
         B     @@L265
@@L341   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L215
@@L226   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC125)
         MVC   96(4,13),16(6)
         LR    2,8
         A     2,=F'4'
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC126)
         MVC   96(4,13),20(6)
         L     14,=A(@@L267)
         BR    14
@@L220   EQU   *
         L     12,4(,10)
         SLR   4,4
         L     3,16(6)
         LTR   3,3
         L     14,=A(@@L96)
         BER   14
@@L225   EQU   *
         L     12,4(,10)
         LA    2,112(,13)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC124)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    7,88(13)
         ST    2,92(13)
         MVC   96(4,13),16(3)
         A     8,=F'4'
         ST    8,100(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         L     3,0(3)
         A     4,=F'1'
         LTR   3,3
         BNE   @@L225
         L     14,=A(@@L96)
         BR    14
@@L227   EQU   *
         L     12,4(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC127)
         MVC   96(4,13),20(6)
         B     @@L269
@@L244   EQU   *
         L     12,4(,10)
         LA    5,167(0,0)
         CR    2,5
         BE    @@L206
         L     14,=A(@@L246)
         BHR   14
         LA    3,162(0,0)
         CLR   2,3
         L     14,=A(@@L191)
         BER   14
         LA    4,163(0,0)
         CLR   2,4
         L     14,=A(@@L96)
         BNER  14
         IC    3,8(6)
         LA    2,236(,3)
         CLM   2,1,=XL1'02'
         L     14,=A(@@L148)
         BHR   14
         L     2,32(6)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L342)
         BNER  14
@@L148   EQU   *
         L     12,4(,10)
         CLM   3,1,=XL1'06'
         B     @@PGE4
         DS    0F
         LTORG
         DS    0F
@@PGE4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         L     14,=A(@@L343)
         BER   14
@@L150   EQU   *
         L     12,8(,10)
         CLM   3,1,=XL1'17'
         L     14,=A(@@L344)
         BER   14
@@L149   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,15
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L345)
         BNER  14
@@L153   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L346)
         BNER  14
@@L154   EQU   *
         L     12,8(,10)
         IC    3,8(6)
         CLM   3,1,=XL1'15'
         L     14,=A(@@L347)
         BER   14
@@L155   EQU   *
         L     12,8(,10)
         CLM   3,1,=XL1'12'
         L     14,=A(@@L348)
         BER   14
@@L157   EQU   *
         L     12,8(,10)
         CLM   3,1,=XL1'17'
         L     14,=A(@@L349)
         BER   14
@@L156   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,11
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L350)
         BNER  14
@@L160   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,7
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L351)
         BNER  14
@@L161   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,6
         N     2,=F'1'
         LTR   2,2
         BNE   @@L352
@@L162   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,5
         N     2,=F'1'
         LTR   2,2
         BNE   @@L353
@@L163   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   @@L354
@@L164   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,3
         N     2,=F'1'
         LTR   2,2
         BNE   @@L355
@@L165   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,2
         N     2,=F'1'
         LTR   2,2
         BNE   @@L356
@@L166   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,1
         N     2,=F'1'
         LTR   2,2
         BNE   @@L357
@@L167   EQU   *
         L     12,8(,10)
         LH    3,32(6)
         N     3,=F'127'
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC5)
         MH    3,=H'4'
         L     2,=V(MODE@NAM)
         L     3,0(3,2)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC66)
         MVC   96(4,13),16(6)
         LR    3,8
         A     3,=F'4'
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC67)
         MVC   96(4,13),20(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         ST    7,88(13)
         LR    4,8
         A     4,=F'3'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
         L     2,32(6)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L358
@@L168   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC69)
         MVC   96(4,13),36(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC102)
         MVC   96(4,13),48(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC73)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC74)
         MVC   96(4,13),80(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC78)
         MVC   96(4,13),24(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         IC    2,8(6)
         CLM   2,1,=XL1'06'
         BE    @@L170
         CLM   2,1,=XL1'0A'
         BE    @@L170
         CLM   2,1,=XL1'0B'
         BE    @@L170
         CLM   2,1,=XL1'0C'
         BE    @@L170
         CLM   2,1,=XL1'07'
         BE    @@L170
@@L169   EQU   *
         L     12,8(,10)
         IC    3,8(6)
         CLM   3,1,=XL1'0A'
         BE    @@L359
         LA    2,238(,3)
         CLM   2,1,=XL1'01'
         BNH   @@L360
         LA    2,236(,3)
         CLM   2,1,=XL1'02'
         BNH   @@L361
         CLM   3,1,=XL1'17'
         BE    @@L178
         CLM   3,1,=XL1'10'
         BE    @@L178
         CLM   3,1,=XL1'0E'
         BE    @@L362
@@L172   EQU   *
         L     12,8(,10)
         L     2,76(6)
         LTR   2,2
         BNE   @@L363
@@L182   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         ST    6,92(13)
         ST    8,96(13)
         L     2,=V(LANG@HOO)
         L     2,64(2)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         L     2,40(6)
         LTR   2,2
         BNE   @@L184
         L     2,0(6)
         LTR   2,2
         BE    @@L183
@@L184   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
@@L183   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC112)
         MVC   96(4,13),40(6)
         LR    2,8
         A     2,=F'4'
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC113)
         MVC   96(4,13),44(6)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC87)
         MVC   96(4,13),0(6)
         ST    2,100(13)
         L     14,=A(@@L264)
         BR    14
@@L363   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC77)
         ST    2,96(13)
         A     8,=F'4'
         ST    8,100(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         B     @@L182
@@L362   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC111)
         MVC   96(4,13),60(6)
         A     8,=F'4'
         ST    8,100(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         B     @@L172
@@L178   EQU   *
         L     12,8(,10)
         L     2,60(6)
         LTR   2,2
         BNE   @@L364
@@L179   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC110)
@@L259   EQU   *
         L     12,8(,10)
         MVC   96(4,13),12(6)
         A     8,=F'4'
         ST    8,100(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=V(PRNODE)
         BALR  14,15
         B     @@L172
@@L364   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC109)
         ST    2,96(13)
         A     8,=F'4'
         ST    8,100(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         B     @@L179
@@L361   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC108)
         B     @@L259
@@L360   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC107)
         B     @@L259
@@L359   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC106)
         B     @@L259
@@L170   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC103)
         L     2,32(6)
         SRL   2,23
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC104)
         MVC   96(4,13),56(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC105)
         MVC   96(4,13),60(6)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         B     @@L169
@@L358   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC68)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L168
@@L357   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC101)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L167
@@L356   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC100)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L166
@@L355   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC99)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L165
@@L354   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC98)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L164
@@L353   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC97)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L163
@@L352   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC96)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L162
@@L351   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC95)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L161
@@L350   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC48)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L160
@@L349   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         BE    @@L156
         MVC   88(4,13),=A(@@LC94)
@@L258   EQU   *
         L     12,8(,10)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L156
@@L348   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         BE    @@L157
         MVC   88(4,13),=A(@@LC93)
         B     @@L258
@@L347   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,12
         N     2,=F'1'
         LTR   2,2
         BE    @@L155
         MVC   88(4,13),=A(@@LC54)
         B     @@L258
@@L346   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC92)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L154
@@L345   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC91)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L153
@@L344   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         BE    @@L149
         MVC   88(4,13),=A(@@LC90)
@@L257   EQU   *
         L     12,8(,10)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         B     @@L149
@@L343   EQU   *
         L     12,8(,10)
         L     2,32(6)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         BE    @@L150
         MVC   88(4,13),=A(@@LC89)
         B     @@L257
@@L342   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC88)
         B     @@L257
@@L246   EQU   *
         L     12,8(,10)
         A     2,=F'-241'
         LA    5,1(0,0)
         CLR   2,5
         L     14,=A(@@L96)
         BHR   14
         L     14,=A(@@L191)
         BR    14
@@L295   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC34)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L95)
         BR    14
@@L294   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC33)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L94)
         BR    14
@@L293   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC32)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L93)
         BR    14
@@L292   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC31)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L92)
         BR    14
@@L291   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC30)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L91)
         BR    14
@@L290   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC29)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L90)
         BR    14
@@L289   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC28)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L89)
         BR    14
@@L288   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC27)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L88)
         BR    14
@@L287   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC26)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L87)
         BR    14
@@L286   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC25)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L86)
         BR    14
@@L285   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC24)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L85)
         BR    14
@@L284   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC23)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L84)
         BR    14
@@L283   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC22)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L83)
         BR    14
@@L282   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC21)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L82)
         BR    14
@@L281   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC20)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L81)
         BR    14
@@L280   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC19)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L80)
         BR    14
@@L279   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC18)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L79)
         BR    14
@@L278   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC17)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L78)
         BR    14
@@L277   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC16)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L77)
         BR    14
@@L276   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC15)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L76)
         BR    14
@@L275   EQU   *
         L     12,8(,10)
         MVC   88(4,13),=A(@@LC14)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(T@FPUTS)
         BALR  14,15
         L     14,=A(@@L75)
         BR    14
@@L274   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         A     8,=F'3'
         ST    8,92(13)
         A     8,=F'-3'
         LA    1,88(,13)
         L     15,=A(INDENT@T)
         BALR  14,15
         L     14,=A(@@L72)
         BR    14
@@L273   EQU   *
         L     12,8(,10)
         LA    5,4(0,0)
         CR    8,5
         L     14,=A(@@L72)
         BHR   14
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC13)
         MVC   96(4,13),4(6)
         AR    8,5
         ST    8,100(13)
         A     8,=F'-4'
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
         L     14,=A(@@L72)
         BR    14
@@L272   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC5)
         MVC   96(4,13),16(6)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L69)
         BR    14
@@L271   EQU   *
         L     12,8(,10)
         L     3,52(6)
         LTR   3,3
         L     14,=A(@@L63)
         BER   14
         IC    2,8(3)
         CLM   2,1,=XL1'01'
         BE    @@L365
         CLM   2,1,=XL1'21'
         L     14,=A(@@L63)
         BNER  14
         L     2,44(3)
         LTR   2,2
         L     14,=A(@@L63)
         BER   14
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC5)
         L     2,44(3)
@@L255   EQU   *
         L     12,8(,10)
         MVC   96(4,13),16(2)
@@L254   EQU   *
         L     12,8(,10)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         L     14,=A(@@L63)
         BR    14
@@L365   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC5)
         MVC   96(4,13),16(3)
         B     @@L254
@@L270   EQU   *
         L     12,8(,10)
         L     2,44(6)
         LTR   2,2
         L     14,=A(@@L63)
         BER   14
         ST    7,88(13)
         MVC   92(4,13),=A(@@LC5)
         B     @@L255
@@L253   EQU   *
         L     12,8(,10)
         ST    7,88(13)
         MVC   92(4,13),4(11)
         ST    6,96(13)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=A(PRNODBRI)
         BALR  14,15
@@L49    EQU   *
         L     12,8(,10)
* Function prnode epilogue
         PDPEPIL
* Function prnode literal pool
         DS    0F
         LTORG
* Function prnode page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
         DC    A(@@PG4)
         DC    A(@@PG5)
         DS    0F
@@0      EQU   *
         DC    4X'00'
         END
