         COPY  PDPTOP
         CSECT
* Program text area
         DS    0F
* S-func visit_phi_node prologue
@@0      PDPPRLG CINDEX=0,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function visit_phi_node code
         MVC   108(4,13),=F'0'
         L     2,0(11)
         L     3,16(2)
         L     2,4(3)
         L     9,4(2)
         SLR   8,8
         L     2,8(3)
         L     3,4(2)
         MVC   112(4,13),0(3)
         ST    8,104(13)
         CL    8,112(13)
         BNL   @@L3
         LR    7,3
         A     7,=F'4'
@@L10    EQU   *
         L     2,=A(@@1)
         L     3,0(2)
         L     4,=A(@@2)
         MVC   88(4,13),0(4)
         L     6,=V(BBINFO)
         L     2,4(7)
         LA    5,16(0,0)
         L     2,4(2)
         SLL   2,2
         A     2,0(6)
         L     2,0(5,2)
         ST    2,92(13)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         SRL   15,5
         MH    15,=H'4'
         AR    3,15
         A     3,=F'12'
         MVC   88(4,13),0(4)
         L     2,4(7)
         L     2,4(2)
         SLL   2,2
         A     2,0(6)
         L     2,0(5,2)
         ST    2,92(13)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         N     15,=F'31'
         L     2,0(3)
         SRL   2,0(15)
         N     2,=F'1'
         LTR   2,2
         BE    @@L4
         L     3,0(7)
         L     2,=A(@@3)
         L     2,0(2)
         L     4,4(3)
         SLL   4,3
         L     3,0(4,2)
         LA    5,2(0,0)
         CLR   3,5
         BE    @@L13
         LA    5,1(0,0)
         CLR   3,5
         BE    @@L14
@@L8     EQU   *
         LTR   8,8
         BNE   @@L4
         L     2,108(13)
         LTR   2,2
         BE    @@L15
@@L4     EQU   *
         A     7,=F'8'
         L     2,104(13)
         A     2,=F'2'
         ST    2,104(13)
         CL    2,112(13)
         BL    @@L10
@@L3     EQU   *
         L     2,=A(@@3)
         L     2,0(2)
         LR    3,9
         MH    3,=H'8'
         CL    8,0(3,2)
         BE    @@L1
         ST    8,0(3,2)
         L     4,108(13)
         ST    4,4(3,2)
         LR    3,9
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@4)
         A     3,0(2)
         N     9,=F'31'
         LA    2,1(0,0)
         SLL   2,0(9)
         O     2,12(3)
         ST    2,12(3)
         B     @@L1
@@L15    EQU   *
         LA    5,1(0,0)
         CLR   3,5
         BNE   @@L4
         L     2,=A(@@3)
         L     2,0(2)
         L     2,4(4,2)
         ST    2,108(13)
         LR    8,3
         B     @@L4
@@L14    EQU   *
         CLR   8,5
         BNE   @@L8
         L     2,4(4,2)
         CL    2,108(13)
         BE    @@L8
@@L13    EQU   *
         LA    8,2(0,0)
         MVC   108(4,13),=F'0'
         B     @@L3
@@L1     EQU   *
* Function visit_phi_node epilogue
         PDPEPIL
* Function visit_phi_node literal pool
         DS    0F
         LTORG
* Function visit_phi_node page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
         DS    0F
* S-func defs_to_undefined prologue
@@5      PDPPRLG CINDEX=1,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function defs_to_undefined code
         L     3,0(11)
         L     2,=A(@@6)
         L     2,0(2)
         L     4,28(2)
         L     2,4(3)
         SLL   2,1
         A     2,4(3)
         SLL   2,2
         L     7,0(2,4)
         LTR   7,7
         BE    @@L32
@@L30    EQU   *
         L     6,4(7)
         L     3,0(6)
         LH    2,0(3)
         LR    4,3
         CLM   2,3,=H'63'
         BE    @@L33
@@L23    EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(4)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BE    @@L21
         L     2,=A(@@4)
         L     5,0(2)
         L     3,0(6)
         LH    2,0(3)
         LR    4,3
         CLM   2,3,=H'63'
         BE    @@L34
@@L25    EQU   *
         L     3,4(4)
         SRL   3,5
         LA    4,12(0,0)
         MH    3,=H'4'
         AR    5,3
         AR    5,4
         L     2,=A(@@4)
         LR    15,3
         A     15,0(2)
         AR    15,4
         L     3,0(6)
         LH    2,0(3)
         LR    4,3
         CLM   2,3,=H'63'
         BE    @@L35
@@L27    EQU   *
         L     3,4(4)
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         O     2,0(15)
         ST    2,0(5)
@@L21    EQU   *
         L     2,4(7)
         L     3,0(2)
         LH    2,0(3)
         LR    4,3
         CLM   2,3,=H'63'
         BE    @@L36
@@L29    EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(4)
         SLL   2,3
         SLR   4,4
         ST    4,0(2,3)
         L     7,0(7)
         LTR   7,7
         BNE   @@L30
         B     @@L32
@@L36    EQU   *
         L     4,4(3)
         B     @@L29
@@L35    EQU   *
         L     4,4(3)
         B     @@L27
@@L34    EQU   *
         L     4,4(3)
         B     @@L25
@@L33    EQU   *
         L     4,4(3)
         B     @@L23
@@L32    EQU   *
* Function defs_to_undefined epilogue
         PDPEPIL
* Function defs_to_undefined literal pool
         DS    0F
         LTORG
* Function defs_to_undefined page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
         DS    0F
* S-func defs_to_varying prologue
@@7      PDPPRLG CINDEX=2,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function defs_to_varying code
         L     3,0(11)
         L     2,=A(@@6)
         L     2,0(2)
         L     4,28(2)
         L     2,4(3)
         SLL   2,1
         A     2,4(3)
         SLL   2,2
         L     7,0(2,4)
         LTR   7,7
         BE    @@L53
@@L51    EQU   *
         L     6,4(7)
         L     3,0(6)
         LH    2,0(3)
         LR    4,3
         CLM   2,3,=H'63'
         BE    @@L54
@@L44    EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(4)
         SLL   2,3
         L     2,0(2,3)
         LA    3,2(0,0)
         CLR   2,3
         BE    @@L42
         L     2,=A(@@4)
         L     5,0(2)
         L     3,0(6)
         LH    2,0(3)
         LR    4,3
         CLM   2,3,=H'63'
         BE    @@L55
@@L46    EQU   *
         L     3,4(4)
         SRL   3,5
         LA    4,12(0,0)
         MH    3,=H'4'
         AR    5,3
         AR    5,4
         L     2,=A(@@4)
         LR    15,3
         A     15,0(2)
         AR    15,4
         L     3,0(6)
         LH    2,0(3)
         LR    4,3
         CLM   2,3,=H'63'
         BE    @@L56
@@L48    EQU   *
         L     3,4(4)
         N     3,=F'31'
         LA    2,1(0,0)
         SLL   2,0(3)
         O     2,0(15)
         ST    2,0(5)
@@L42    EQU   *
         L     2,4(7)
         L     3,0(2)
         LH    2,0(3)
         LR    4,3
         CLM   2,3,=H'63'
         BE    @@L57
@@L50    EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(4)
         SLL   2,3
         LA    4,2(0,0)
         ST    4,0(2,3)
         L     7,0(7)
         LTR   7,7
         BNE   @@L51
         B     @@L53
@@L57    EQU   *
         L     4,4(3)
         B     @@L50
@@L56    EQU   *
         L     4,4(3)
         B     @@L48
@@L55    EQU   *
         L     4,4(3)
         B     @@L46
@@L54    EQU   *
         L     4,4(3)
         B     @@L44
@@L53    EQU   *
* Function defs_to_varying epilogue
         PDPEPIL
* Function defs_to_varying literal pool
         DS    0F
         LTORG
* Function defs_to_varying page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
         DS    0F
* S-func visit_expression prologue
@@8      PDPPRLG CINDEX=3,FRAME=160,BASER=12,ENTRY=NO
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function visit_expression code
         L     9,0(11)
         L     8,4(11)
         LH    2,0(9)
         CLM   2,3,=H'34'
         L     14,=A(@@L154)
         BER   14
@@L59    EQU   *
         L     12,0(,10)
         LH    2,0(9)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         L     14,=A(@@L155)
         BER   14
         SLR   15,15
@@L67    EQU   *
         L     12,0(,10)
         LTR   15,15
         BE    @@L145
         L     6,8(15)
         MVC   112(4,13),4(15)
         L     7,112(13)
         LH    4,0(7)
         CLM   4,3,=H'61'
         BE    @@L71
         L     2,=V(GLBRTL)
         CL    7,0(2)
         BE    @@L71
@@L145   EQU   *
         L     12,0(,10)
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
         L     14,=A(@@L58)
         BR    14
@@L71    EQU   *
         CLM   4,3,=H'61'
         L     14,=A(@@L156)
         BER   14
@@L72    EQU   *
         L     12,0(,10)
         LH    3,0(6)
         CLM   3,3,=H'54'
         L     14,=A(@@L157)
         BER   14
@@L73    EQU   *
         L     12,0(,10)
         CLM   3,3,=H'61'
         L     14,=A(@@L158)
         BER   14
@@L75    EQU   *
         L     12,0(,10)
         LH    2,0(9)
         CLM   2,3,=H'33'
         L     14,=A(@@L159)
         BER   14
         CLM   2,3,=H'32'
         L     14,=A(@@L160)
         BER   14
@@L113   EQU   *
         L     12,0(,10)
         MVC   116(4,13),=F'0'
         L     8,0(6)
         LR    3,8
         SRL   3,16
         L     2,=V(RTX@CLAS)
         SLR   7,7
         IC    7,0(2,3)
         LR    2,7
         LA    15,131(0,0)
         CR    7,15
         BE    @@L126
         BH    @@L143
         LA    3,76(0,0)
         CLR   7,3
         BE    @@L115
         LA    4,130(0,0)
         CLR   7,4
         BE    @@L133
@@L141   EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
@@L114   EQU   *
         L     4,116(13)
         LTR   4,4
         BE    @@L145
         LH    2,0(4)
         CLM   2,3,=H'54'
         BNE   @@L145
         L     5,112(13)
         L     4,4(5)
         L     2,=A(@@3)
         L     5,0(2)
         LR    3,4
         MH    3,=H'8'
         L     2,0(3,5)
         LA    6,1(0,0)
         CLR   2,6
         BE    @@L161
@@L147   EQU   *
         LR    3,4
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@4)
         A     3,0(2)
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
@@L146   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     7,112(13)
         L     2,4(7)
         SLL   2,3
         LA    9,1(0,0)
         ST    9,0(2,3)
         L     2,4(7)
         SLL   2,3
         L     15,116(13)
         ST    15,4(2,3)
         L     14,=A(@@L58)
         BR    14
@@L161   EQU   *
         L     2,4(3,5)
         CL    2,116(13)
         BNE   @@L147
         B     @@L146
@@L133   EQU   *
         L     5,4(6)
         L     7,8(6)
         L     15,12(6)
         LH    4,0(5)
         CLM   4,3,=H'61'
         BE    @@L162
@@L136   EQU   *
         MVC   120(2,13),0(7)
         LH    2,120(13)
         CLM   2,3,=H'61'
         BE    @@L163
@@L137   EQU   *
         MVC   122(2,13),0(15)
         LH    3,122(13)
         CLM   3,3,=H'61'
         BE    @@L164
@@L134   EQU   *
         CLM   4,3,=H'61'
         BE    @@L165
@@L138   EQU   *
         LH    4,120(13)
         CLM   4,3,=H'61'
         BE    @@L166
@@L139   EQU   *
         LH    4,122(13)
         CLM   4,3,=H'61'
         BE    @@L167
@@L140   EQU   *
         SRL   8,16
         ST    8,88(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,96(13)
         ST    5,100(13)
         ST    7,104(13)
         ST    15,108(13)
         LA    1,88(,13)
         L     15,=V(STERNOP)
         BALR  14,15
@@L153   EQU   *
         ST    15,116(13)
         B     @@L114
@@L167   EQU   *
         L     2,=A(@@3)
         L     4,0(2)
         L     2,4(15)
         SLL   2,3
         ST    2,132(13)
         L     3,0(2,4)
         LA    2,1(0,0)
         CLR   3,2
         BNE   @@L140
         L     3,132(13)
         L     15,4(3,4)
         B     @@L140
@@L166   EQU   *
         L     2,=A(@@3)
         L     4,0(2)
         L     2,4(7)
         SLL   2,3
         ST    2,132(13)
         L     3,0(2,4)
         LA    2,1(0,0)
         CLR   3,2
         BNE   @@L139
         L     3,132(13)
         L     7,4(3,4)
         B     @@L139
@@L165   EQU   *
         L     2,=A(@@3)
         L     4,0(2)
         L     2,4(5)
         SLL   2,3
         ST    2,132(13)
         L     3,0(2,4)
         LA    2,1(0,0)
         CLR   3,2
         BNE   @@L138
         L     3,132(13)
         L     5,4(3,4)
         B     @@L138
@@L164   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(15)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BNE   @@L134
@@L135   EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=A(@@5)
         BALR  14,15
         B     @@L114
@@L163   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(7)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BE    @@L135
         B     @@L137
@@L162   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(5)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BE    @@L135
         B     @@L136
@@L115   EQU   *
         L     15,4(6)
         L     6,8(6)
         LH    4,0(15)
         CLM   4,3,=H'61'
         BE    @@L168
@@L118   EQU   *
         LH    7,0(6)
         CLM   7,3,=H'61'
         BE    @@L169
@@L116   EQU   *
         SLR   5,5
         IC    5,2(15)
         LTR   5,5
         BNE   @@L119
         SLR   5,5
         IC    5,2(6)
@@L119   EQU   *
         CLM   4,3,=H'61'
         BE    @@L170
@@L120   EQU   *
         CLM   7,3,=H'61'
         BE    @@L171
@@L121   EQU   *
         SRL   8,16
         ST    8,88(13)
         ST    5,92(13)
         ST    15,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(SRELOPER)
         BALR  14,15
         B     @@L153
@@L171   EQU   *
         L     2,=A(@@3)
         L     4,0(2)
         L     3,4(6)
         SLL   3,3
         L     2,0(3,4)
         LA    7,1(0,0)
         CLR   2,7
         BNE   @@L121
         L     6,4(3,4)
         B     @@L121
@@L170   EQU   *
         L     2,=A(@@3)
         L     4,0(2)
         L     2,4(15)
         SLL   2,3
         ST    2,132(13)
         L     3,0(2,4)
         LA    2,1(0,0)
         CLR   3,2
         BNE   @@L120
         L     3,132(13)
         L     15,4(3,4)
         B     @@L120
@@L169   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(6)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BE    @@L135
         B     @@L116
@@L168   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(15)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BE    @@L135
         B     @@L118
@@L143   EQU   *
         LA    5,242(0,0)
         CR    7,5
         BE    @@L126
         BH    @@L144
         LA    7,241(0,0)
         CLR   2,7
         BNE   @@L141
         L     4,4(6)
         SLR   7,7
         IC    7,2(4)
         LH    5,0(4)
         CLM   5,3,=H'61'
         BE    @@L172
@@L123   EQU   *
         CLM   5,3,=H'61'
         BE    @@L173
@@L124   EQU   *
         SRL   8,16
         ST    8,88(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         ST    4,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(SUNARYOP)
         BALR  14,15
         B     @@L153
@@L173   EQU   *
         L     2,=A(@@3)
         L     5,0(2)
         L     3,4(4)
         SLL   3,3
         L     2,0(3,5)
         LA    15,1(0,0)
         CLR   2,15
         BNE   @@L124
         L     4,4(3,5)
         B     @@L124
@@L172   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(4)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BNE   @@L123
         B     @@L135
@@L144   EQU   *
         LA    15,243(0,0)
         CLR   7,15
         BE    @@L133
         B     @@L141
@@L126   EQU   *
         L     5,4(6)
         L     15,8(6)
         LH    4,0(5)
         CLM   4,3,=H'61'
         BE    @@L174
@@L129   EQU   *
         LH    7,0(15)
         CLM   7,3,=H'61'
         BE    @@L175
@@L127   EQU   *
         CLM   4,3,=H'61'
         BE    @@L176
@@L130   EQU   *
         CLM   7,3,=H'61'
         BE    @@L177
@@L131   EQU   *
         SRL   8,16
         ST    8,88(13)
         SLR   2,2
         IC    2,2(6)
         ST    2,92(13)
         ST    5,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(SBINOPT)
         BALR  14,15
         B     @@L153
@@L177   EQU   *
         L     2,=A(@@3)
         L     4,0(2)
         L     3,4(15)
         SLL   3,3
         L     2,0(3,4)
         LA    7,1(0,0)
         CLR   2,7
         BNE   @@L131
         L     15,4(3,4)
         B     @@L131
@@L176   EQU   *
         L     2,=A(@@3)
         L     4,0(2)
         L     2,4(5)
         SLL   2,3
         ST    2,132(13)
         L     3,0(2,4)
         LA    2,1(0,0)
         CLR   3,2
         BNE   @@L130
         L     3,132(13)
         L     5,4(3,4)
         B     @@L130
@@L175   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(15)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BE    @@L135
         B     @@L127
@@L174   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(5)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BE    @@L135
         B     @@L129
@@L160   EQU   *
         L     3,16(9)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BNE   @@L113
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'152'
         BNE   @@L113
         L     14,=A(@@L58)
         BR    14
@@L159   EQU   *
         ST    9,88(13)
         LA    1,88(,13)
         L     15,=V(PC@SET)
         BALR  14,15
         LH    2,0(6)
         CLM   2,3,=H'72'
         BE    @@L80
         L     4,20(8)
         LTR   4,4
         L     14,=A(@@L58)
         BER   14
@@L86    EQU   *
         L     2,=A(@@2)
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(4)
         MVC   96(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         LR    3,15
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@1)
         A     3,0(2)
         A     3,=F'12'
         LR    5,15
         N     5,=F'31'
         L     6,0(3)
         LR    2,6
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L83
         LA    2,1(0,0)
         SLL   2,0(5)
         OR    6,2
         ST    6,0(3)
         L     2,=A(@@9)
         L     3,0(2)
         MH    15,=H'4'
         L     2,=A(@@10)
         L     9,0(2)
         ST    9,0(15,3)
         ST    4,0(2)
@@L83    EQU   *
         L     4,4(4)
         LTR   4,4
         BNE   @@L86
         L     14,=A(@@L58)
         BR    14
@@L80    EQU   *
         L     2,4(6)
         LH    15,0(2)
         N     15,=XL4'0000FFFF'
         ST    15,128(13)
         L     5,4(2)
         L     15,8(2)
         LH    4,0(5)
         CLM   4,3,=H'61'
         L     14,=A(@@L178)
         BER   14
@@L90    EQU   *
         L     12,0(,10)
         LH    7,0(15)
         CLM   7,3,=H'61'
         L     14,=A(@@L179)
         BER   14
@@L88    EQU   *
         L     12,0(,10)
         CLM   4,3,=H'61'
         L     14,=A(@@L180)
         BER   14
@@L93    EQU   *
         L     12,0(,10)
         CLM   7,3,=H'61'
         BE    @@L181
@@L91    EQU   *
         CLM   4,3,=H'61'
         BE    @@L182
@@L100   EQU   *
         CLM   7,3,=H'61'
         BE    @@L183
@@L101   EQU   *
         MVC   88(4,13),128(13)
         L     2,4(6)
         SLR   9,9
         IC    9,2(2)
         ST    9,92(13)
         ST    5,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GEN@RTX)
         BALR  14,15
         MVC   88(4,13),=F'72'
         MVC   92(4,13),=F'0'
         L     2,4(6)
         SLR   3,3
         IC    3,2(2)
         ST    3,96(13)
         ST    15,100(13)
         MVC   104(4,13),8(6)
         MVC   108(4,13),12(6)
         LA    1,88(,13)
         L     15,=V(STERNOP)
         BALR  14,15
         LR    5,15
         L     4,20(8)
         LTR   4,4
         L     14,=A(@@L58)
         BER   14
@@L110   EQU   *
         L     2,=A(@@2)
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(4)
         MVC   96(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         LR    6,15
         SRL   6,5
         LR    3,6
         MH    3,=H'4'
         L     2,=A(@@1)
         A     3,0(2)
         LR    7,15
         N     7,=F'31'
         L     2,12(3)
         SRL   2,0(7)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L104
         LTR   5,5
         BE    @@L108
         L     2,=V(GLBRTL)
         CL    5,0(2)
         BE    @@L184
@@L109   EQU   *
         LH    2,0(5)
         CLM   2,3,=H'67'
         BE    @@L185
@@L104   EQU   *
         L     4,4(4)
         LTR   4,4
         BNE   @@L110
         L     14,=A(@@L58)
         BR    14
@@L185   EQU   *
         L     2,24(4)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L104
@@L108   EQU   *
         LR    3,6
         MH    3,=H'4'
         L     2,=A(@@1)
         A     3,0(2)
         LA    2,1(0,0)
         SLL   2,0(7)
         O     2,12(3)
         ST    2,12(3)
         L     2,=A(@@9)
         L     3,0(2)
         MH    15,=H'4'
         L     2,=A(@@10)
         L     6,0(2)
         ST    6,0(15,3)
         ST    4,0(2)
         B     @@L104
@@L184   EQU   *
         L     2,24(4)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L108
         B     @@L109
@@L183   EQU   *
         L     2,=A(@@3)
         L     4,0(2)
         L     3,4(15)
         SLL   3,3
         L     2,0(3,4)
         LA    7,1(0,0)
         CLR   2,7
         BNE   @@L101
         L     15,4(3,4)
         B     @@L101
@@L182   EQU   *
         L     2,=A(@@3)
         L     4,0(2)
         L     3,4(5)
         SLL   3,3
         L     2,0(3,4)
         LA    9,1(0,0)
         CLR   2,9
         BNE   @@L100
         L     5,4(3,4)
         B     @@L100
@@L181   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(15)
         SLL   2,3
         L     2,0(2,3)
         LA    9,2(0,0)
         CLR   2,9
         BNE   @@L91
@@L92    EQU   *
         L     4,20(8)
         LTR   4,4
         L     14,=A(@@L58)
         BER   14
@@L99    EQU   *
         L     2,=A(@@2)
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(4)
         MVC   96(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         LR    3,15
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@1)
         A     3,0(2)
         A     3,=F'12'
         LR    5,15
         N     5,=F'31'
         L     6,0(3)
         LR    2,6
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L96
         LA    2,1(0,0)
         SLL   2,0(5)
         OR    6,2
         ST    6,0(3)
         L     2,=A(@@9)
         L     3,0(2)
         MH    15,=H'4'
         L     2,=A(@@10)
         L     5,0(2)
         ST    5,0(15,3)
         ST    4,0(2)
@@L96    EQU   *
         L     4,4(4)
         LTR   4,4
         BNE   @@L99
         L     14,=A(@@L58)
         BR    14
@@L180   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(5)
         SLL   2,3
         L     2,0(2,3)
         LA    3,2(0,0)
         CLR   2,3
         BNE   @@L93
         B     @@L92
@@L179   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(15)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BNE   @@L88
         L     14,=A(@@L58)
         BR    14
@@L178   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         L     2,4(5)
         SLL   2,3
         L     2,0(2,3)
         LTR   2,2
         BNE   @@L90
         L     14,=A(@@L58)
         BR    14
@@L158   EQU   *
         CLM   4,3,=H'61'
         BNE   @@L75
         L     2,=A(@@3)
         L     3,0(2)
         L     5,4(6)
         SLL   5,3
         L     6,0(5,3)
         L     7,112(13)
         L     15,4(7)
         LR    4,15
         MH    4,=H'8'
         L     2,0(4,3)
         CLR   2,6
         BE    @@L186
@@L77    EQU   *
         LR    3,15
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@4)
         A     3,0(2)
         N     15,=F'31'
         LA    2,1(0,0)
         SLL   2,0(15)
         O     2,12(3)
         ST    2,12(3)
@@L76    EQU   *
         L     2,=A(@@3)
         L     2,0(2)
         ST    6,0(4,2)
         L     5,4(5,2)
         ST    5,4(4,2)
         L     14,=A(@@L58)
         BR    14
@@L186   EQU   *
         L     2,4(4,3)
         CL    2,4(5,3)
         BNE   @@L77
         B     @@L76
@@L157   EQU   *
         LH    2,0(9)
         CLM   2,3,=H'32'
         BNE   @@L73
         L     5,112(13)
         L     4,4(5)
         L     2,=A(@@3)
         L     5,0(2)
         LR    3,4
         MH    3,=H'8'
         LA    6,1(0,0)
         ST    6,0(3,5)
         L     2,16(9)
         L     2,8(2)
         ST    2,4(3,5)
         LR    3,4
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@4)
         A     3,0(2)
         N     4,=F'31'
         LR    2,6
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
         L     14,=A(@@L58)
         BR    14
@@L156   EQU   *
         L     15,112(13)
         L     2,4(15)
         LA    3,19(0,0)
         CLR   2,3
         BH    @@L72
         B     @@L145
@@L155   EQU   *
         L     3,16(9)
         LH    2,0(3)
         LR    15,3
         CLM   2,3,=H'47'
         BE    @@L67
         ST    9,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         B     @@L67
@@L154   EQU   *
         L     2,4(8)
         CLR   2,9
         BNE   @@L59
         L     4,20(8)
         LTR   4,4
         BE    @@L59
@@L65    EQU   *
         L     2,=A(@@2)
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(4)
         MVC   96(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         LR    3,15
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@1)
         A     3,0(2)
         A     3,=F'12'
         LR    5,15
         N     5,=F'31'
         L     6,0(3)
         LR    2,6
         SRL   2,0(5)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L62
         LA    2,1(0,0)
         SLL   2,0(5)
         OR    6,2
         ST    6,0(3)
         L     2,=A(@@9)
         L     3,0(2)
         MH    15,=H'4'
         L     2,=A(@@10)
         L     5,0(2)
         ST    5,0(15,3)
         ST    4,0(2)
@@L62    EQU   *
         L     4,4(4)
         LTR   4,4
         BNE   @@L65
         B     @@L59
@@L58    EQU   *
* Function visit_expression epilogue
         PDPEPIL
* Function visit_expression literal pool
         DS    0F
         LTORG
* Function visit_expression page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
         DS    0F
* S-func examine_flow_edges prologue
@@11     PDPPRLG CINDEX=4,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN4
         LTORG
@@FEN4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         LR    11,1
         L     10,=A(@@PGT4)
* Function examine_flow_edges code
         L     4,=A(@@10)
         L     2,0(4)
         LTR   2,2
         BE    @@L208
@@L206   EQU   *
         L     3,0(4)
         L     6,12(3)
         L     2,=A(@@2)
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(3)
         MVC   96(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         L     2,=A(@@9)
         L     2,0(2)
         MH    15,=H'4'
         L     15,0(15,2)
         ST    15,0(4)
         L     2,=V(ENTRY@EX)
         LA    2,64(0,2)
         CLR   6,2
         BE    @@L188
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(FIRST@IN)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L193
         LH    2,0(15)
         CLM   2,3,=H'32'
         BE    @@L212
@@L193   EQU   *
         L     3,44(6)
         LR    4,3
         SRL   4,5
         MH    4,=H'4'
         L     2,=A(@@12)
         A     4,0(2)
         A     4,=F'12'
         N     3,=F'31'
         L     15,0(4)
         LR    2,15
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L188
         L     5,20(6)
         LA    2,1(0,0)
         SLL   2,0(3)
         OR    15,2
         ST    15,0(4)
         L     4,0(6)
         CL    4,4(6)
         BE    @@L211
@@L203   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L213
@@L202   EQU   *
         L     4,12(4)
         CL    4,4(6)
         BNE   @@L203
@@L211   EQU   *
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L214
@@L204   EQU   *
         LTR   5,5
         BE    @@L188
         L     2,4(5)
         LTR   2,2
         BE    @@L215
@@L188   EQU   *
         L     4,=A(@@10)
         L     2,0(4)
         LTR   2,2
         BNE   @@L206
         B     @@L208
@@L215   EQU   *
         L     7,=A(@@1)
         L     2,0(7)
         L     6,=A(@@2)
         MVC   88(4,13),0(6)
         MVC   92(4,13),8(5)
         MVC   96(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         SRL   15,5
         MH    15,=H'4'
         AR    2,15
         A     2,=F'12'
         MVC   88(4,13),0(6)
         MVC   92(4,13),8(5)
         MVC   96(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         N     15,=F'31'
         L     2,0(2)
         SRL   2,0(15)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L188
         L     4,0(7)
         MVC   88(4,13),0(6)
         MVC   92(4,13),8(5)
         MVC   96(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         LR    3,15
         SRL   3,5
         MH    3,=H'4'
         AR    4,3
         A     4,=F'12'
         A     3,0(7)
         A     3,=F'12'
         MVC   88(4,13),0(6)
         MVC   92(4,13),8(5)
         MVC   96(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         N     15,=F'31'
         LA    2,1(0,0)
         SLL   2,0(15)
         O     2,0(3)
         ST    2,0(4)
         MVC   88(4,13),0(6)
         MVC   92(4,13),8(5)
         MVC   96(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         L     2,=A(@@9)
         L     3,0(2)
         MH    15,=H'4'
         L     2,=A(@@10)
         L     4,0(2)
         ST    4,0(15,3)
         ST    5,0(2)
         B     @@L188
@@L214   EQU   *
         ST    4,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         B     @@L204
@@L213   EQU   *
         ST    4,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         B     @@L202
@@L212   EQU   *
         L     4,16(15)
         LH    2,0(4)
         CLM   2,3,=H'47'
         BNE   @@L193
         L     2,8(4)
         LH    2,0(2)
         CLM   2,3,=H'152'
         BNE   @@L193
@@L197   EQU   *
         ST    3,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         L     3,12(3)
         LTR   3,3
         BE    @@L193
         LH    2,0(3)
         CLM   2,3,=H'32'
         BNE   @@L193
         L     4,16(3)
         LH    2,0(4)
         CLM   2,3,=H'47'
         BNE   @@L193
         L     2,8(4)
         LH    2,0(2)
         CLM   2,3,=H'152'
         BE    @@L197
         B     @@L193
@@L208   EQU   *
* Function examine_flow_edges epilogue
         PDPEPIL
* Function examine_flow_edges literal pool
         DS    0F
         LTORG
* Function examine_flow_edges page table
         DS    0F
@@PGT4   EQU   *
         DC    A(@@PG4)
         DS    0F
* S-func follow_def_use_chains prologue
@@13     PDPPRLG CINDEX=5,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN5
         LTORG
@@FEN5   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         LR    11,1
         L     10,=A(@@PGT5)
* Function follow_def_use_chains code
         B     @@L217
@@L229   EQU   *
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(SBFSETBI)
         BALR  14,15
         LR    3,15
         SRL   3,5
         MH    3,=H'4'
         A     3,0(2)
         LR    4,15
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         X     2,=F'-1'
         N     2,12(3)
         ST    2,12(3)
         L     2,=A(@@6)
         L     2,0(2)
         L     3,20(2)
         LR    2,15
         SLL   2,2
         AR    2,15
         SLL   2,2
         L     5,4(2,3)
@@L231   EQU   *
         LTR   5,5
         BE    @@L217
         L     2,4(5)
         L     15,4(2)
         LTR   15,15
         BE    @@L224
         LH    2,0(15)
         CLM   2,3,=H'32'
         BE    @@L232
@@L224   EQU   *
         L     2,=V(BBFORIN)
         L     6,0(2)
         L     2,4(15)
         SLL   2,2
         L     2,16(6,2)
         L     4,44(2)
         LR    3,4
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@12)
         A     3,0(2)
         N     4,=F'31'
         L     2,12(3)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L233
@@L222   EQU   *
         L     5,0(5)
         B     @@L231
@@L233   EQU   *
         ST    15,88(13)
         L     2,4(15)
         SLL   2,2
         L     6,16(6,2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         B     @@L222
@@L232   EQU   *
         L     3,16(15)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BNE   @@L224
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'152'
         BNE   @@L224
         L     2,=V(BBFORIN)
         L     6,0(2)
         L     2,4(15)
         SLL   2,2
         L     2,16(6,2)
         L     4,44(2)
         LR    3,4
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@12)
         A     3,0(2)
         N     4,=F'31'
         L     2,12(3)
         SRL   2,0(4)
         N     2,=F'1'
         LTR   2,2
         BE    @@L222
         ST    15,88(13)
         L     2,4(15)
         SLL   2,2
         L     6,16(6,2)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=A(@@0)
         BALR  14,15
         B     @@L222
@@L217   EQU   *
         L     2,=A(@@4)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(SBFSETBI)
         BALR  14,15
         LTR   15,15
         BNL   @@L229
* Function follow_def_use_chains epilogue
         PDPEPIL
* Function follow_def_use_chains literal pool
         DS    0F
         LTORG
* Function follow_def_use_chains page table
         DS    0F
@@PGT5   EQU   *
         DC    A(@@PG5)
@@LC1    EQU   *
         DC    C'Removing unexecutable edge from %d to %d'
         DC    X'15'
         DC    X'0'
@@LC0    EQU   *
         DC    C'Removing alternative for bb %d of phi %d'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func optimize_unexecutable_edges prologue
@@14     PDPPRLG CINDEX=6,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN6
         LTORG
@@FEN6   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG6    EQU   *
         LR    11,1
         L     10,=A(@@PGT6)
* Function optimize_unexecutable_edges code
         L     7,0(11)
         L     8,4(11)
         SLR   6,6
         C     6,4(7)
         BNL   @@L261
@@L249   EQU   *
         LR    2,6
         SRL   2,5
         MH    2,=H'4'
         LR    3,6
         N     3,=F'31'
         L     2,12(8,2)
         SRL   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L237
         L     2,8(7)
         LR    3,6
         MH    3,=H'4'
         L     5,0(3,2)
         L     2,24(5)
         N     2,=F'2'
         LTR   2,2
         BNE   @@L237
         L     2,12(5)
         L     3,=V(ENTRY@EX)
         LA    3,64(0,3)
         CLR   2,3
         BE    @@L241
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FIRST@IN)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BE    @@L241
         LH    2,0(15)
         CLM   2,3,=H'32'
         BE    @@L265
@@L241   EQU   *
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L266
@@L248   EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(REMOVE@E)
         BALR  14,15
@@L237   EQU   *
         A     6,=F'1'
         C     6,4(7)
         BL    @@L249
@@L261   EQU   *
         SLR   6,6
         L     2,=V(N@BASIC@)
         C     6,0(2)
         BNL   @@L264
@@L259   EQU   *
         LR    2,6
         MH    2,=H'4'
         L     3,=V(BBINFO)
         A     2,0(3)
         L     3,16(2)
         L     4,4(3)
         L     5,20(3)
         L     2,16(3)
         LTR   2,2
         BE    @@L252
         LH    2,0(4)
         CH    2,=H'33'
         BE    @@L267
@@L252   EQU   *
         A     6,=F'1'
         L     2,=V(N@BASIC@)
         C     6,0(2)
         BL    @@L259
         B     @@L264
@@L267   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(CJUMPP)
         BALR  14,15
         LTR   15,15
         BE    @@L252
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(SIMPLEJU)
         BALR  14,15
         LTR   15,15
         BNE   @@L252
         L     2,20(3)
         LTR   2,2
         BE    @@L252
         L     2,4(2)
         LTR   2,2
         BNE   @@L252
         L     2,24(5)
         N     2,=F'1'
         LTR   2,2
         BE    @@L257
         MVC   0(2,4),=H'37'
         MVC   20(4,4),=F'-99'
@@L258   EQU   *
         L     2,=A(@@6)
         MVC   88(4,13),0(2)
         L     2,4(4)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         MVC   92(4,13),16(2)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(DFIMOD)
         BALR  14,15
         B     @@L252
@@L257   EQU   *
         L     2,16(4)
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),32(4)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         ST    15,8(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(EMBAF)
         BALR  14,15
         MVC   20(4,4),=F'-1'
         B     @@L258
@@L266   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC1)
         L     2,8(5)
         MVC   96(4,13),44(2)
         L     2,12(5)
         MVC   100(4,13),44(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L248
@@L265   EQU   *
         L     3,16(15)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BNE   @@L241
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'152'
         BNE   @@L241
@@L247   EQU   *
         ST    3,88(13)
         MVC   92(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(REMOVE@P)
         BALR  14,15
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L268
@@L246   EQU   *
         L     4,12(4)
         LTR   4,4
         BE    @@L241
         LH    2,0(4)
         CLM   2,3,=H'32'
         BNE   @@L241
         L     3,16(4)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BNE   @@L241
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'152'
         BE    @@L247
         B     @@L241
@@L268   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC0)
         L     2,8(5)
         MVC   96(4,13),44(2)
         L     2,16(4)
         L     2,4(2)
         MVC   100(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L246
@@L264   EQU   *
* Function optimize_unexecutable_edges epilogue
         PDPEPIL
* Function optimize_unexecutable_edges literal pool
         DS    0F
         LTORG
* Function optimize_unexecutable_edges page table
         DS    0F
@@PGT6   EQU   *
         DC    A(@@PG6)
@@LC3    EQU   *
         DC    C'Register %d in insn %d replaced with constant'
         DC    X'15'
         DC    X'0'
@@LC2    EQU   *
         DC    C'Register %d is now set to a constant'
         DC    X'15'
         DC    X'0'
         DS    0F
* S-func ssa_ccp_substitute_constants prologue
@@15     PDPPRLG CINDEX=7,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN7
         LTORG
@@FEN7   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG7    EQU   *
         LR    11,1
         L     10,=A(@@PGT7)
* Function ssa_ccp_substitute_constants code
         LA    7,20(0,0)
         L     2,=V(SSA@DEFI)
         L     3,0(2)
         CL    7,0(3)
         BNL   @@L295
         LA    9,400(0,0)
         LA    8,80(0,0)
         LA    6,160(0,0)
@@L293   EQU   *
         L     2,=A(@@3)
         L     2,0(2)
         L     2,0(6,2)
         LA    4,1(0,0)
         CLR   2,4
         BE    @@L297
@@L272   EQU   *
         A     9,=F'20'
         A     8,=F'4'
         A     6,=F'8'
         A     7,=F'1'
         L     2,=V(SSA@DEFI)
         L     3,0(2)
         CL    7,0(3)
         BL    @@L293
         B     @@L295
@@L297   EQU   *
         ST    8,104(13)
         L     4,16(3,8)
         LH    2,0(4)
         N     2,=XL4'0000FFFF'
         L     3,=V(RTX@CLAS)
         IC    2,0(3,2)
         CLM   2,1,=XL1'89'
         BE    @@L298
         SLR   5,5
@@L276   EQU   *
         LTR   5,5
         BE    @@L272
         LH    15,0(4)
         CLM   15,3,=H'32'
         BE    @@L299
@@L281   EQU   *
         CLM   15,3,=H'32'
         BE    @@L300
@@L282   EQU   *
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L301
@@L283   EQU   *
         L     2,=A(@@3)
         L     2,0(2)
         L     2,4(6,2)
         ST    2,8(5)
         MVC   20(4,4),=F'-1'
         L     2,=A(@@6)
         MVC   88(4,13),0(2)
         L     2,4(4)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         MVC   92(4,13),16(2)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(DFIMOD)
         BALR  14,15
@@L280   EQU   *
         L     2,=A(@@6)
         L     2,0(2)
         L     2,20(2)
         L     5,4(9,2)
         LTR   5,5
         BE    @@L272
@@L292   EQU   *
         L     2,4(5)
         L     4,4(2)
         L     2,0(4)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   @@L286
         LH    3,0(4)
         CLM   3,3,=H'37'
         BE    @@L302
@@L289   EQU   *
         AH    3,=H'-32'
         CLM   3,3,=H'1'
         BNH   @@L303
@@L286   EQU   *
         L     5,0(5)
         LTR   5,5
         BNE   @@L292
         B     @@L272
@@L303   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,12(2)
         L     2,48(2)
         L     3,104(13)
         L     2,0(3,2)
         ST    2,88(13)
         L     2,=A(@@3)
         L     2,0(2)
         L     2,4(6,2)
         ST    2,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(VALRSC)
         BALR  14,15
         LTR   15,15
         BE    @@L286
         L     2,=V(RTDFILE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L304
@@L291   EQU   *
         MVC   20(4,4),=F'-1'
         L     2,=A(@@6)
         MVC   88(4,13),0(2)
         L     2,4(4)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         MVC   92(4,13),16(2)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(DFIMOD)
         BALR  14,15
         B     @@L286
@@L304   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC3)
         ST    7,96(13)
         MVC   100(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L291
@@L302   EQU   *
         L     2,20(4)
         L     15,=F'-99'
         CLR   2,15
         BNE   @@L289
         B     @@L286
@@L301   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC2)
         L     2,16(4)
         L     2,4(2)
         MVC   96(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(T@FPRINT)
         BALR  14,15
         B     @@L283
@@L300   EQU   *
         L     2,8(5)
         LH    2,0(2)
         CLM   2,3,=H'54'
         BNE   @@L282
         B     @@L280
@@L299   EQU   *
         L     3,16(4)
         LH    2,0(3)
         CLM   2,3,=H'47'
         BNE   @@L281
         L     2,8(3)
         LH    2,0(2)
         CLM   2,3,=H'152'
         BNE   @@L281
         B     @@L280
@@L298   EQU   *
         L     2,16(4)
         LH    3,0(2)
         LR    5,2
         CLM   3,3,=H'47'
         BE    @@L276
         ST    4,88(13)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(SINGLE@S)
         BALR  14,15
         LR    5,15
         B     @@L276
@@L295   EQU   *
* Function ssa_ccp_substitute_constants epilogue
         PDPEPIL
* Function ssa_ccp_substitute_constants literal pool
         DS    0F
         LTORG
* Function ssa_ccp_substitute_constants page table
         DS    0F
@@PGT7   EQU   *
         DC    A(@@PG7)
         DS    0F
* S-func ssa_ccp_df_delete_unreachable_insns prologue
@@16     PDPPRLG CINDEX=8,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN8
         LTORG
@@FEN8   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG8    EQU   *
         LR    11,1
         L     10,=A(@@PGT8)
* Function ssa_ccp_df_delete_unreachable_insns code
         LA    1,88(,13)
         L     15,=V(FIND@UNR)
         BALR  14,15
         L     2,=V(N@BASIC@)
         L     6,0(2)
         BCTR  6,0
         LTR   6,6
         BL    @@L321
@@L319   EQU   *
         LR    2,6
         MH    2,=H'4'
         L     3,=V(BBINFO)
         A     2,0(3)
         L     3,16(2)
         L     2,60(3)
         N     2,=F'1'
         LTR   2,2
         BNE   @@L308
         L     4,0(3)
         L     5,4(3)
         LH    2,0(5)
         CLM   2,3,=H'33'
         BE    @@L322
@@L318   EQU   *
         L     7,12(4)
         LH    2,0(4)
         CLM   2,3,=H'32'
         BE    @@L316
         CLM   2,3,=H'34'
         BE    @@L316
         CLM   2,3,=H'33'
         BE    @@L316
@@L315   EQU   *
         CLR   4,5
         BE    @@L308
         LR    4,7
         B     @@L318
@@L308   EQU   *
         BCTR  6,0
         LTR   6,6
         BNL   @@L319
         B     @@L321
@@L316   EQU   *
         L     2,=A(@@6)
         MVC   88(4,13),0(2)
         L     2,4(4)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         MVC   92(4,13),16(2)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(DFIDEL)
         BALR  14,15
         B     @@L315
@@L322   EQU   *
         L     3,32(5)
         LTR   3,3
         BE    @@L318
         L     3,12(3)
         LTR   3,3
         BE    @@L318
         LH    2,0(3)
         CLM   2,3,=H'33'
         BNE   @@L318
         L     2,16(3)
         LH    2,0(2)
         AH    2,=H'-44'
         CLM   2,3,=H'1'
         BH    @@L318
         LR    5,3
         B     @@L318
@@L321   EQU   *
* Function ssa_ccp_df_delete_unreachable_insns epilogue
         PDPEPIL
* Function ssa_ccp_df_delete_unreachable_insns literal pool
         DS    0F
         LTORG
* Function ssa_ccp_df_delete_unreachable_insns page table
         DS    0F
@@PGT8   EQU   *
         DC    A(@@PG8)
         DS    0F
* X-func ssa_const_prop prologue
SSA@CONS PDPPRLG CINDEX=9,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN9
         LTORG
@@FEN9   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG9    EQU   *
         LR    11,1
         L     10,=A(@@PGT9)
* Function ssa_const_prop code
         LA    1,88(,13)
         L     15,=V(IA@ANAL)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DF@INIT)
         BALR  14,15
         L     2,=A(@@6)
         ST    15,0(2)
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'1248'
         LA    1,88(,13)
         L     15,=V(DF@ANALY)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GET@MAX@)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(CEBFORIN)
         BALR  14,15
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=A(@@17)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(CREATE@E)
         BALR  14,15
         L     2,=A(@@2)
         ST    15,0(2)
         L     3,=V(SSA@DEFI)
         L     2,0(3)
         L     2,0(2)
         SLL   2,3
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@3)
         ST    15,0(2)
         SLR   4,4
         L     2,0(3)
         CL    4,0(2)
         BNL   @@L341
@@L330   EQU   *
         LA    2,19(0,0)
         CLR   4,2
         BH    @@L328
         L     2,=A(@@3)
         L     3,0(2)
         LR    2,4
         MH    2,=H'8'
         LA    5,2(0,0)
@@L343   EQU   *
         ST    5,0(2,3)
         L     2,=A(@@3)
         L     3,0(2)
         LR    2,4
         MH    2,=H'8'
         SLR   5,5
         ST    5,4(2,3)
         A     4,=F'1'
         L     2,=V(SSA@DEFI)
         L     2,0(2)
         CL    4,0(2)
         BL    @@L330
@@L341   EQU   *
         L     2,=V(SSA@DEFI)
         L     2,0(2)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(SBALLOC)
         BALR  14,15
         L     2,=A(@@4)
         ST    15,0(2)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(SBZERO)
         BALR  14,15
         L     2,=V(N@BASIC@)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(SBALLOC)
         BALR  14,15
         L     2,=A(@@12)
         ST    15,0(2)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(SBZERO)
         BALR  14,15
         L     3,=A(@@2)
         L     2,0(3)
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=V(SBALLOC)
         BALR  14,15
         L     2,=A(@@1)
         ST    15,0(2)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(SBZERO)
         BALR  14,15
         L     2,0(3)
         L     2,4(2)
         SLL   2,2
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         L     2,=A(@@9)
         ST    15,0(2)
         L     3,=A(@@10)
         L     2,=V(ENTRY@EX)
         MVC   0(4,3),20(2)
         L     5,0(3)
         LTR   5,5
         BE    @@L336
@@L335   EQU   *
         L     2,=A(@@2)
         MVC   88(4,13),0(2)
         MVC   92(4,13),8(5)
         MVC   96(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(FIND@EDG)
         BALR  14,15
         LR    3,15
         SRL   3,5
         MH    3,=H'4'
         L     2,=A(@@1)
         A     3,0(2)
         LR    4,15
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
         L     2,=A(@@9)
         L     2,0(2)
         MH    15,=H'4'
         L     3,4(5)
         ST    3,0(15,2)
         L     5,4(5)
         LTR   5,5
         BNE   @@L335
@@L336   EQU   *
         LA    1,88(,13)
         L     15,=A(@@11)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@13)
         BALR  14,15
         L     2,=A(@@10)
         L     6,0(2)
         LTR   6,6
         BNE   @@L336
         B     @@L344
@@L328   EQU   *
         L     2,=A(@@3)
         L     3,0(2)
         LR    2,4
         MH    2,=H'8'
         SLR   5,5
         B     @@L343
@@L344   EQU   *
         LA    1,88(,13)
         L     15,=A(@@15)
         BALR  14,15
         L     3,=A(@@2)
         MVC   88(4,13),0(3)
         L     4,=A(@@1)
         MVC   92(4,13),0(4)
         LA    1,88(,13)
         L     15,=A(@@14)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@16)
         BALR  14,15
         L     5,=A(@@6)
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=A(@@17)
         BALR  14,15
         L     2,=A(@@3)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    6,0(2)
         L     2,=A(@@9)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    6,0(2)
         L     2,=A(@@12)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    6,0(2)
         L     2,=A(@@4)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    6,0(2)
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(FREE@EDG)
         BALR  14,15
         ST    6,0(3)
         MVC   88(4,13),0(4)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         ST    6,0(4)
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(DF@FINIS)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(END@ALIA)
         BALR  14,15
* Function ssa_const_prop epilogue
         PDPEPIL
* Function ssa_const_prop literal pool
         DS    0F
         LTORG
* Function ssa_const_prop page table
         DS    0F
@@PGT9   EQU   *
         DC    A(@@PG9)
         DS    0F
* S-func mark_references prologue
@@18     PDPPRLG CINDEX=10,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN10
         LTORG
@@FEN10  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG10   EQU   *
         LR    11,1
         L     10,=A(@@PGT10)
* Function mark_references code
         L     6,4(11)
         L     2,0(11)
         L     5,0(2)
         LR    15,5
         LTR   5,5
         BE    @@L345
         LH    2,0(5)
         CLM   2,3,=H'47'
         BE    @@L364
         CLM   2,3,=H'61'
         BE    @@L365
         X     2,=F'49'
         SLL   2,16
         SRA   2,16
         LPR   2,2
         SLL   2,16
         SRA   2,16
         LCR   2,2
         N     2,=XL4'0000FFFF'
         SRL   2,15
         LR    15,2
         SLL   15,16
         SRA   15,16
         BCTR  15,0
         B     @@L345
@@L365   EQU   *
         L     4,4(5)
         LR    3,4
         SRL   3,5
         MH    3,=H'4'
         AR    3,6
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
@@L363   EQU   *
         L     15,=F'-1'
         B     @@L345
@@L364   EQU   *
         L     15,4(5)
         LH    3,0(15)
         LR    2,3
         AH    2,=H'-63'
         CLM   2,3,=H'1'
         BNH   @@L349
         CLM   3,3,=H'132'
         BE    @@L349
         CLM   3,3,=H'133'
         BE    @@L349
@@L348   EQU   *
         LH    2,0(15)
         CLM   2,3,=H'61'
         BE    @@L366
         SLR   15,15
         B     @@L345
@@L366   EQU   *
         A     5,=F'8'
         ST    5,88(13)
         MVC   92(4,13),=A(@@18)
         ST    6,96(13)
         LA    1,88(,13)
         L     15,=V(F@E@RTX)
         BALR  14,15
         B     @@L363
@@L349   EQU   *
         LR    4,15
         LR    2,3
         AH    2,=H'-63'
         CLM   2,3,=H'1'
         BH    @@L367
@@L353   EQU   *
         L     4,4(4)
         LH    3,0(4)
         LR    2,3
         AH    2,=H'-63'
         CLM   2,3,=H'1'
         BNH   @@L353
         CLM   3,3,=H'132'
         BE    @@L353
         CLM   3,3,=H'133'
         BE    @@L353
@@L362   EQU   *
         LH    2,0(4)
         CLM   2,3,=H'61'
         BNE   @@L348
         L     4,4(4)
         LR    3,4
         SRL   3,5
         MH    3,=H'4'
         AR    3,6
         N     4,=F'31'
         LA    2,1(0,0)
         SLL   2,0(4)
         O     2,12(3)
         ST    2,12(3)
         B     @@L348
@@L367   EQU   *
         CLM   3,3,=H'132'
         BE    @@L353
         CLM   3,3,=H'133'
         BNE   @@L362
         B     @@L353
@@L345   EQU   *
* Function mark_references epilogue
         PDPEPIL
* Function mark_references literal pool
         DS    0F
         LTORG
* Function mark_references page table
         DS    0F
@@PGT10  EQU   *
         DC    A(@@PG10)
         DS    0F
* S-func ssa_fast_dce prologue
@@17     PDPPRLG CINDEX=11,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN11
         LTORG
@@FEN11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG11   EQU   *
         LR    11,1
         L     10,=A(@@PGT11)
* Function ssa_fast_dce code
         L     2,=V(SSA@DEFI)
         L     2,0(2)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(SBALLOC)
         BALR  14,15
         LR    8,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(SBONES)
         BALR  14,15
@@L369   EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(SBFSETBI)
         BALR  14,15
         LTR   15,15
         BL    @@L386
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(SBFSETBI)
         BALR  14,15
         LR    5,15
         LR    2,15
         SRL   2,5
         MH    2,=H'4'
         AR    2,8
         LR    4,15
         N     4,=F'31'
         LA    3,1(0,0)
         SLL   3,0(4)
         X     3,=F'-1'
         N     3,12(2)
         ST    3,12(2)
         LA    2,19(0,0)
         CR    15,2
         BNH   @@L369
         LR    6,15
         MH    6,=H'4'
         L     2,=V(SSA@DEFI)
         LR    3,6
         A     3,0(2)
         L     3,16(3)
         LTR   3,3
         BE    @@L369
         L     2,0(3)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   @@L369
         LH    2,0(3)
         CLM   2,3,=H'37'
         BNE   @@L374
         L     2,20(3)
         L     4,=F'-99'
         CLR   2,4
         BE    @@L369
@@L374   EQU   *
         MVC   88(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(SIDE@EFF)
         BALR  14,15
         LTR   15,15
         BNE   @@L369
         LR    9,15
         L     7,0(11)
         L     3,20(7)
         LR    2,5
         SLL   2,2
         AR    2,5
         SLL   2,2
         L     4,4(2,3)
         LTR   4,4
         BE    @@L376
@@L381   EQU   *
         L     2,4(4)
         LTR   2,2
         BE    @@L377
         L     3,4(2)
         LTR   3,3
         BE    @@L377
         L     2,0(3)
         SRL   2,4
         N     2,=F'1'
         LTR   2,2
         BNE   @@L377
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L387
@@L380   EQU   *
         L     2,=V(SSA@DEFI)
         LR    7,6
         A     7,0(2)
         CL    3,16(7)
         BNE   @@L385
@@L377   EQU   *
         L     4,0(4)
         LTR   4,4
         BNE   @@L381
@@L376   EQU   *
         LTR   9,9
         BNE   @@L369
         L     7,=V(SSA@DEFI)
         LA    6,16(0,0)
         MH    5,=H'4'
         LR    2,5
         A     2,0(7)
         L     4,0(6,2)
         AR    4,6
         ST    4,88(13)
         A     4,=F'-16'
         MVC   92(4,13),=A(@@18)
         ST    8,96(13)
         LA    1,88(,13)
         L     15,=V(F@E@RTX)
         BALR  14,15
         MVC   88(4,13),0(11)
         L     2,4(4)
         SLL   2,2
         L     3,=V(BBFORIN)
         A     2,0(3)
         L     2,0(6,2)
         ST    2,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(DFIDEL)
         BALR  14,15
         A     5,0(7)
         ST    9,0(6,5)
         B     @@L369
@@L385   EQU   *
         LA    9,1(0,0)
         B     @@L376
@@L387   EQU   *
         L     2,20(3)
         L     7,=F'-99'
         CLR   2,7
         BNE   @@L380
         B     @@L377
@@L386   EQU   *
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         L     2,=A(@@6)
         MVC   88(4,13),0(2)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'1248'
         LA    1,88(,13)
         L     15,=V(DF@ANALY)
         BALR  14,15
* Function ssa_fast_dce epilogue
         PDPEPIL
* Function ssa_fast_dce literal pool
         DS    0F
         LTORG
* Function ssa_fast_dce page table
         DS    0F
@@PGT11  EQU   *
         DC    A(@@PG11)
         DS    0F
@@3      EQU   *
         DC    4X'00'
         DS    0F
@@12     EQU   *
         DC    4X'00'
         DS    0F
@@1      EQU   *
         DC    4X'00'
         DS    0F
@@9      EQU   *
         DC    4X'00'
         DS    0F
@@2      EQU   *
         DC    4X'00'
         DS    0F
@@6      EQU   *
         DC    4X'00'
         DS    0F
@@10     EQU   *
         DC    4X'00'
         DS    0F
@@4      EQU   *
         DC    4X'00'
         END
