         COPY  PDPTOP
         CSECT
* Program data area
         DS    0F
@@0      EQU   *
         DC    F'0'
* Program text area
         DS    0F
* X-func using_eh_for_cleanups prologue
USING@EH PDPPRLG CINDEX=0,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN0
         LTORG
@@FEN0   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG0    EQU   *
         LR    11,1
         L     10,=A(@@PGT0)
* Function using_eh_for_cleanups code
         L     2,=A(@@0)
         MVC   0(4,2),=F'1'
* Function using_eh_for_cleanups epilogue
         PDPEPIL
* Function using_eh_for_cleanups literal pool
         DS    0F
         LTORG
* Function using_eh_for_cleanups page table
         DS    0F
@@PGT0   EQU   *
         DC    A(@@PG0)
         DS    0F
* S-func mark_cond_nesting prologue
@@1      PDPPRLG CINDEX=1,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN1
         LTORG
@@FEN1   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG1    EQU   *
         LR    11,1
         L     10,=A(@@PGT1)
* Function mark_cond_nesting code
         L     3,0(11)
         LTR   3,3
         BE    @@L14
@@L12    EQU   *
         L     2,12(3)
         LTR   2,2
         BE    @@L6
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L15
@@L6     EQU   *
         L     2,16(3)
         LTR   2,2
         BE    @@L8
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L16
@@L8     EQU   *
         L     2,20(3)
         LTR   2,2
         BE    @@L10
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L17
@@L10    EQU   *
         L     3,4(3)
         LTR   3,3
         BNE   @@L12
         B     @@L14
@@L17    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L10
@@L16    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L8
@@L15    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L6
@@L14    EQU   *
* Function mark_cond_nesting epilogue
         PDPEPIL
* Function mark_cond_nesting literal pool
         DS    0F
         LTORG
* Function mark_cond_nesting page table
         DS    0F
@@PGT1   EQU   *
         DC    A(@@PG1)
         DS    0F
* S-func mark_loop_nesting prologue
@@2      PDPPRLG CINDEX=2,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN2
         LTORG
@@FEN2   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG2    EQU   *
         LR    11,1
         L     10,=A(@@PGT2)
* Function mark_loop_nesting code
         L     3,0(11)
         LTR   3,3
         BE    @@L34
@@L32    EQU   *
         L     2,12(3)
         LTR   2,2
         BE    @@L22
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L35
@@L22    EQU   *
         L     2,16(3)
         LTR   2,2
         BE    @@L24
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L36
@@L24    EQU   *
         L     2,20(3)
         LTR   2,2
         BE    @@L26
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L37
@@L26    EQU   *
         L     2,24(3)
         LTR   2,2
         BE    @@L28
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L38
@@L28    EQU   *
         L     2,28(3)
         LTR   2,2
         BE    @@L30
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L39
@@L30    EQU   *
         L     3,4(3)
         LTR   3,3
         BNE   @@L32
         B     @@L34
@@L39    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L30
@@L38    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L28
@@L37    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L26
@@L36    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L24
@@L35    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L22
@@L34    EQU   *
* Function mark_loop_nesting epilogue
         PDPEPIL
* Function mark_loop_nesting literal pool
         DS    0F
         LTORG
* Function mark_loop_nesting page table
         DS    0F
@@PGT2   EQU   *
         DC    A(@@PG2)
         DS    0F
* S-func mark_block_nesting prologue
@@3      PDPPRLG CINDEX=3,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN3
         LTORG
@@FEN3   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG3    EQU   *
         LR    11,1
         L     10,=A(@@PGT3)
* Function mark_block_nesting code
         L     8,0(11)
         LTR   8,8
         BE    @@L73
@@L71    EQU   *
         L     2,12(8)
         LTR   2,2
         BE    @@L44
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L76
@@L44    EQU   *
         L     2,20(8)
         LTR   2,2
         BE    @@L46
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L77
@@L46    EQU   *
         L     2,24(8)
         LTR   2,2
         BE    @@L48
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L78
@@L48    EQU   *
         L     6,32(8)
         LTR   6,6
         BE    @@L50
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L50
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L79
@@L53    EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L50    EQU   *
         L     6,36(8)
         LTR   6,6
         BE    @@L54
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L54
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L80
@@L57    EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L54    EQU   *
         L     6,40(8)
         LTR   6,6
         BE    @@L75
@@L68    EQU   *
         LTR   6,6
         BE    @@L62
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
@@L62    EQU   *
         L     7,4(6)
         LTR   7,7
         BE    @@L60
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L60
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L81
@@L67    EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    7,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L60    EQU   *
         L     6,0(6)
         LTR   6,6
         BNE   @@L68
@@L75    EQU   *
         L     2,60(8)
         LTR   2,2
         BE    @@L69
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L82
@@L69    EQU   *
         L     8,4(8)
         LTR   8,8
         BNE   @@L71
         B     @@L73
@@L82    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L69
@@L81    EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L67
@@L80    EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L57
@@L79    EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L53
@@L78    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L48
@@L77    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L46
@@L76    EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L44
@@L73    EQU   *
* Function mark_block_nesting epilogue
         PDPEPIL
* Function mark_block_nesting literal pool
         DS    0F
         LTORG
* Function mark_block_nesting page table
         DS    0F
@@PGT3   EQU   *
         DC    A(@@PG3)
         DS    0F
* S-func mark_case_nesting prologue
@@4      PDPPRLG CINDEX=4,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN4
         LTORG
@@FEN4   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG4    EQU   *
         LR    11,1
         L     10,=A(@@PGT4)
* Function mark_case_nesting code
         L     7,0(11)
         LTR   7,7
         BE    @@L105
@@L103   EQU   *
         L     2,12(7)
         LTR   2,2
         BE    @@L87
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L106
@@L87    EQU   *
         L     2,16(7)
         LTR   2,2
         BE    @@L89
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L107
@@L89    EQU   *
         L     6,24(7)
         LTR   6,6
         BE    @@L91
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L91
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L108
@@L94    EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L91    EQU   *
         L     6,28(7)
         LTR   6,6
         BE    @@L95
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L95
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L109
@@L98    EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L95    EQU   *
         L     6,32(7)
         LTR   6,6
         BE    @@L99
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L99
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L110
@@L102   EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L99    EQU   *
         MVC   88(4,13),20(7)
         LA    1,88(,13)
         L     15,=A(@@5)
         BALR  14,15
         L     7,4(7)
         LTR   7,7
         BNE   @@L103
         B     @@L105
@@L110   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L102
@@L109   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L98
@@L108   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L94
@@L107   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L89
@@L106   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L87
@@L105   EQU   *
* Function mark_case_nesting epilogue
         PDPEPIL
* Function mark_case_nesting literal pool
         DS    0F
         LTORG
* Function mark_case_nesting page table
         DS    0F
@@PGT4   EQU   *
         DC    A(@@PG4)
         DS    0F
* S-func mark_case_node prologue
@@5      PDPPRLG CINDEX=5,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN5
         LTORG
@@FEN5   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG5    EQU   *
         LR    11,1
         L     10,=A(@@PGT5)
* Function mark_case_node code
         L     7,0(11)
@@L125   EQU   *
         LTR   7,7
         BE    @@L111
         L     6,12(7)
         LTR   6,6
         BE    @@L113
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L113
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L126
@@L116   EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L113   EQU   *
         L     6,16(7)
         LTR   6,6
         BE    @@L117
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L117
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L127
@@L120   EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L117   EQU   *
         L     6,20(7)
         LTR   6,6
         BE    @@L121
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L121
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L128
@@L124   EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L121   EQU   *
         MVC   88(4,13),4(7)
         LA    1,88(,13)
         L     15,=A(@@5)
         BALR  14,15
         L     7,0(7)
         B     @@L125
@@L128   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L124
@@L127   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L120
@@L126   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L116
@@L111   EQU   *
* Function mark_case_node epilogue
         PDPEPIL
* Function mark_case_node literal pool
         DS    0F
         LTORG
* Function mark_case_node page table
         DS    0F
@@PGT5   EQU   *
         DC    A(@@PG5)
         DS    0F
* S-func mark_goto_fixup prologue
@@6      PDPPRLG CINDEX=6,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN6
         LTORG
@@FEN6   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG6    EQU   *
         LR    11,1
         L     10,=A(@@PGT6)
* Function mark_goto_fixup code
         L     7,0(11)
         LTR   7,7
         BE    @@L155
@@L153   EQU   *
         LTR   7,7
         BE    @@L133
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
@@L133   EQU   *
         L     2,4(7)
         LTR   2,2
         BE    @@L135
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L156
@@L135   EQU   *
         L     6,8(7)
         LTR   6,6
         BE    @@L137
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L137
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L157
@@L140   EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L137   EQU   *
         L     6,12(7)
         LTR   6,6
         BE    @@L141
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L141
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L158
@@L144   EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L141   EQU   *
         L     2,16(7)
         LTR   2,2
         BE    @@L145
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L159
@@L145   EQU   *
         L     2,24(7)
         LTR   2,2
         BE    @@L147
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L160
@@L147   EQU   *
         L     6,28(7)
         LTR   6,6
         BE    @@L149
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L149
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L161
@@L152   EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L149   EQU   *
         L     7,0(7)
         LTR   7,7
         BNE   @@L153
         B     @@L155
@@L161   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L152
@@L160   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L147
@@L159   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L145
@@L158   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L144
@@L157   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L140
@@L156   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L135
@@L155   EQU   *
* Function mark_goto_fixup epilogue
         PDPEPIL
* Function mark_goto_fixup literal pool
         DS    0F
         LTORG
* Function mark_goto_fixup page table
         DS    0F
@@PGT6   EQU   *
         DC    A(@@PG6)
         DS    0F
* X-func free_stmt_status prologue
FREE@STM PDPPRLG CINDEX=7,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN7
         LTORG
@@FEN7   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG7    EQU   *
         LR    11,1
         L     10,=A(@@PGT7)
* Function free_stmt_status code
         L     2,0(11)
         L     15,4(2)
         LTR   15,15
         BE    @@L163
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
@@L163   EQU   *
         MVC   4(4,2),=F'0'
* Function free_stmt_status epilogue
         PDPEPIL
* Function free_stmt_status literal pool
         DS    0F
         LTORG
* Function free_stmt_status page table
         DS    0F
@@PGT7   EQU   *
         DC    A(@@PG7)
         DS    0F
* X-func msstat prologue
MSSTAT   PDPPRLG CINDEX=8,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN8
         LTORG
@@FEN8   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG8    EQU   *
         LR    11,1
         L     10,=A(@@PGT8)
* Function msstat code
         L     7,0(11)
         LTR   7,7
         BE    @@L164
         MVC   88(4,13),0(7)
         LA    1,88(,13)
         L     15,=A(@@3)
         BALR  14,15
         MVC   88(4,13),8(7)
         LA    1,88(,13)
         L     15,=A(@@1)
         BALR  14,15
         MVC   88(4,13),12(7)
         LA    1,88(,13)
         L     15,=A(@@2)
         BALR  14,15
         MVC   88(4,13),16(7)
         LA    1,88(,13)
         L     15,=A(@@4)
         BALR  14,15
         L     6,32(7)
         LTR   6,6
         BE    @@L166
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BNE   @@L166
         L     4,=V(GGC@PEND)
         L     3,0(4)
         L     2,4(3)
         CL    2,0(3)
         BNL   @@L173
@@L169   EQU   *
         L     4,0(4)
         LR    5,4
         A     5,=F'4'
         L     2,0(5)
         LR    3,2
         MH    3,=H'4'
         ST    6,16(4,3)
         A     2,=F'1'
         ST    2,0(5)
@@L166   EQU   *
         L     2,32(7)
         LTR   2,2
         BE    @@L170
         L     2,36(7)
         LTR   2,2
         BE    @@L170
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GGC@SET@)
         BALR  14,15
         LTR   15,15
         BE    @@L174
@@L170   EQU   *
         MVC   88(4,13),52(7)
         LA    1,88(,13)
         L     15,=A(@@6)
         BALR  14,15
         B     @@L164
@@L174   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GM@RCHIL)
         BALR  14,15
         B     @@L170
@@L173   EQU   *
         ST    3,88(13)
         L     2,0(3)
         SLL   2,1
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(VARRAY@G)
         BALR  14,15
         ST    15,0(4)
         B     @@L169
@@L164   EQU   *
* Function msstat epilogue
         PDPEPIL
* Function msstat literal pool
         DS    0F
         LTORG
* Function msstat page table
         DS    0F
@@PGT8   EQU   *
         DC    A(@@PG8)
         DS    0F
* X-func istmt prologue
ISTMT    PDPPRLG CINDEX=9,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN9
         LTORG
@@FEN9   EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG9    EQU   *
         LR    11,1
         L     10,=A(@@PGT9)
* Function istmt code
         MVC   88(4,13),=A(STMT@OBS)
         LA    1,88(,13)
         L     15,=V(GCC@OBST)
         BALR  14,15
* Function istmt epilogue
         PDPEPIL
* Function istmt literal pool
         DS    0F
         LTORG
* Function istmt page table
         DS    0F
@@PGT9   EQU   *
         DC    A(@@PG9)
         DS    0F
* X-func istforf prologue
ISTFORF  PDPPRLG CINDEX=10,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN10
         LTORG
@@FEN10  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG10   EQU   *
         LR    11,1
         L     10,=A(@@PGT10)
* Function istforf code
         L     2,=V(CFUN)
         L     3,0(2)
         MVC   88(4,13),=F'56'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         ST    15,4(3)
         L     2,0(2)
         L     2,4(2)
         MVC   0(4,2),=F'0'
         MVC   4(4,2),=F'0'
         MVC   12(4,2),=F'0'
         MVC   16(4,2),=F'0'
         MVC   8(4,2),=F'0'
         MVC   20(4,2),=F'0'
         MVC   24(4,2),=F'0'
         MVC   28(4,2),=F'0'
         MVC   52(4,2),=F'0'
         MVC   40(4,2),=F'0'
         MVC   32(4,2),=F'0'
         MVC   36(4,2),=F'0'
* Function istforf epilogue
         PDPEPIL
* Function istforf literal pool
         DS    0F
         LTORG
* Function istforf page table
         DS    0F
@@PGT10  EQU   *
         DC    A(@@PG10)
         DS    0F
* X-func in_control_zone_p prologue
IN@CONTR PDPPRLG CINDEX=11,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN11
         LTORG
@@FEN11  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG11   EQU   *
         LR    11,1
         L     10,=A(@@PGT11)
* Function in_control_zone_p code
         SLR   15,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     3,4(2)
         L     2,8(3)
         LTR   2,2
         BNE   @@L179
         L     2,12(3)
         LTR   2,2
         BNE   @@L179
         L     2,16(3)
         LTR   2,2
         BE    @@L178
@@L179   EQU   *
         LA    15,1(0,0)
@@L178   EQU   *
* Function in_control_zone_p epilogue
         PDPEPIL
* Function in_control_zone_p literal pool
         DS    0F
         LTORG
* Function in_control_zone_p page table
         DS    0F
@@PGT11  EQU   *
         DC    A(@@PG11)
         DS    0F
* X-func set_file_and_line_for_stmt prologue
SET@FILE PDPPRLG CINDEX=12,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN12
         LTORG
@@FEN12  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG12   EQU   *
         LR    11,1
         L     10,=A(@@PGT12)
* Function set_file_and_line_for_stmt code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         LTR   2,2
         BE    @@L180
         MVC   44(4,2),0(11)
         MVC   48(4,2),4(11)
@@L180   EQU   *
* Function set_file_and_line_for_stmt epilogue
         PDPEPIL
* Function set_file_and_line_for_stmt literal pool
         DS    0F
         LTORG
* Function set_file_and_line_for_stmt page table
         DS    0F
@@PGT12  EQU   *
         DC    A(@@PG12)
         DS    0F
* X-func emit_nop prologue
EMIT@NOP PDPPRLG CINDEX=13,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN13
         LTORG
@@FEN13  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG13   EQU   *
         LR    11,1
         L     10,=A(@@PGT13)
* Function emit_nop code
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         L     2,=V(OPTZE)
         L     2,0(2)
         LTR   2,2
         BNE   @@L182
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L184
         CLM   2,3,=H'37'
         BNE   @@L182
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@REA)
         BALR  14,15
         LTR   15,15
         BNE   @@L182
@@L184   EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@NOP)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
@@L182   EQU   *
* Function emit_nop epilogue
         PDPEPIL
* Function emit_nop literal pool
         DS    0F
         LTORG
* Function emit_nop page table
         DS    0F
@@PGT13  EQU   *
         DC    A(@@PG13)
@@LC0    EQU   *
         DC    C'<stdin>'
         DC    X'0'
@@LC1    EQU   *
         DC    C'?'
         DC    X'0'
         DS    0F
* X-func label_rtx prologue
LABEL@RT PDPPRLG CINDEX=14,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN14
         LTORG
@@FEN14  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG14   EQU   *
         LR    11,1
         L     10,=A(@@PGT14)
* Function label_rtx code
         L     3,0(11)
         CLI   8(3),31
         BE    @@L186
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'683'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L186   EQU   *
         L     2,80(3)
         LTR   2,2
         BE    @@L189
@@L187   EQU   *
         L     15,80(3)
         LTR   15,15
         BNE   @@L188
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     15,80(3)
         B     @@L188
@@L189   EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,80(3)
         B     @@L187
@@L188   EQU   *
* Function label_rtx epilogue
         PDPEPIL
* Function label_rtx literal pool
         DS    0F
         LTORG
* Function label_rtx page table
         DS    0F
@@PGT14  EQU   *
         DC    A(@@PG14)
         DS    0F
* X-func emjmp prologue
EMJMP    PDPPRLG CINDEX=15,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN15
         LTORG
@@FEN15  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG15   EQU   *
         LR    11,1
         L     10,=A(@@PGT15)
* Function emjmp code
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=V(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMBAR)
         BALR  14,15
* Function emjmp epilogue
         PDPEPIL
* Function emjmp literal pool
         DS    0F
         LTORG
* Function emjmp page table
         DS    0F
@@PGT15  EQU   *
         DC    A(@@PG15)
         DS    0F
* X-func expcgoto prologue
EXPCGOTO PDPPRLG CINDEX=16,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN16
         LTORG
@@FEN16  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG16   EQU   *
         LR    11,1
         L     10,=A(@@PGT16)
* Function expcgoto code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EMIT@IND)
         BALR  14,15
         L     2,=V(CFUN)
         L     2,0(2)
         OC    224(4,2),=F'1048576'
* Function expcgoto epilogue
         PDPEPIL
* Function expcgoto literal pool
         DS    0F
         LTORG
* Function expcgoto page table
         DS    0F
@@PGT16  EQU   *
         DC    A(@@PG16)
         DS    0F
* X-func explab prologue
EXPLAB   PDPPRLG CINDEX=17,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN17
         LTORG
@@FEN17  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG17   EQU   *
         LR    11,1
         L     10,=A(@@PGT17)
* Function explab code
         L     3,0(11)
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         L     2,44(3)
         LTR   2,2
         BE    @@L193
         L     15,80(3)
         LTR   15,15
         BE    @@L196
@@L194   EQU   *
         L     2,44(3)
         MVC   28(4,15),16(2)
@@L193   EQU   *
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     2,4(2)
         LTR   2,2
         BE    @@L192
         MVC   88(4,13),=F'8'
         LA    1,88(,13)
         L     15,=V(GGCALL)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         L     2,4(2)
         MVC   0(4,15),40(2)
         ST    15,40(2)
         ST    3,4(15)
         B     @@L192
@@L196   EQU   *
         ST    3,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     15,80(3)
         B     @@L194
@@L192   EQU   *
* Function explab epilogue
         PDPEPIL
* Function explab literal pool
         DS    0F
         LTORG
* Function explab page table
         DS    0F
@@PGT17  EQU   *
         DC    A(@@PG17)
         DS    0F
* X-func dcnonll prologue
DCNONLL  PDPPRLG CINDEX=18,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN18
         LTORG
@@FEN18  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG18   EQU   *
         LR    11,1
         L     10,=A(@@PGT18)
* Function dcnonll code
         L     3,0(11)
         MVC   88(4,13),=F'4'
         L     2,=V(MODE@SIZ)
         SLR   4,4
         IC    4,4(2)
         ST    4,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(ASSTKLOC)
         BALR  14,15
         LR    5,15
         L     4,=V(CFUN)
         L     2,0(4)
         MVC   88(4,13),=F'0'
         ST    3,92(13)
         MVC   96(4,13),76(2)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,76(2)
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         OC    0(4,15),=F'8'
         L     3,0(4)
         L     2,80(3)
         LTR   2,2
         BNE   @@L198
         MVC   88(4,13),=F'2'
         A     3,=F'88'
         ST    3,92(13)
         A     3,=F'-88'
         L     2,116(3)
         MVC   96(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(EMSSAVE)
         BALR  14,15
@@L198   EQU   *
         L     2,0(4)
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'0'
         ST    5,96(13)
         MVC   100(4,13),80(2)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,80(2)
* Function dcnonll epilogue
         PDPEPIL
* Function dcnonll literal pool
         DS    0F
         LTORG
* Function dcnonll page table
         DS    0F
@@PGT18  EQU   *
         DC    A(@@PG18)
         DS    0F
* X-func expand_goto prologue
EXPAND@G PDPPRLG CINDEX=19,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN19
         LTORG
@@FEN19  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG19   EQU   *
         LR    11,1
         L     10,=A(@@PGT19)
* Function expand_goto code
         L     5,0(11)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(DECL@FUN)
         BALR  14,15
         LTR   15,15
         BE    @@L200
         L     2,=V(CF@DECL)
         CL    15,0(2)
         BE    @@L200
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FIND@FUN)
         BALR  14,15
         LR    6,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         L     4,80(6)
         L     3,76(6)
         L     2,16(3)
         CLR   2,5
         BE    @@L217
@@L205   EQU   *
         L     4,8(4)
         L     3,0(3)
         L     2,16(3)
         CLR   2,5
         BNE   @@L205
@@L217   EQU   *
         L     4,4(4)
         OC    224(4,6),=F'8388608'
         L     2,=V(CFUN)
         L     2,0(2)
         OC    224(4,2),=F'4194304'
         OC    0(4,15),=F'16'
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(LOOKUP@S)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(COPYTREG)
         BALR  14,15
         LR    3,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,88(13)
         L     5,=V(GLBRTL)
         MVC   92(4,13),24(5)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(RPLRTX)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(COPYTREG)
         BALR  14,15
         LR    4,15
         L     2,88(6)
         LTR   2,2
         BE    @@L206
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(CPYRTX)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),24(5)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(RPLRTX)
         BALR  14,15
         LR    2,15
@@L206   EQU   *
         MVC   88(4,13),12(5)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),=F'2'
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EMSREST)
         BALR  14,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),12(5)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         MVC   88(4,13),=F'48'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),8(5)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(EMIT@IND)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L199
@@L214   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'33'
         BE    @@L219
         CLM   2,3,=H'34'
         BE    @@L199
         L     3,8(3)
         LTR   3,3
         BNE   @@L214
         B     @@L199
@@L219   EQU   *
         MVC   88(4,13),=F'27'
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         MVC   96(4,13),28(3)
         LA    1,88(,13)
         L     15,=V(ALLOC@EX)
         BALR  14,15
         ST    15,28(3)
         B     @@L199
@@L200   EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    5,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
@@L199   EQU   *
* Function expand_goto epilogue
         PDPEPIL
* Function expand_goto literal pool
         DS    0F
         LTORG
* Function expand_goto page table
         DS    0F
@@PGT19  EQU   *
         DC    A(@@PG19)
@@LC2    EQU   *
         DC    C'jump to `%s'' invalidly jumps into binding conto'
         DC    C'ur'
         DC    X'0'
         DS    0F
* S-func expand_goto_internal prologue
@@7      PDPPRLG CINDEX=20,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN20
         LTORG
@@FEN20  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG20   EQU   *
         LR    11,1
         L     10,=A(@@PGT20)
* Function expand_goto_internal code
         L     4,0(11)
         L     5,4(11)
         SLR   6,6
         LH    2,0(5)
         CLM   2,3,=H'36'
         BE    @@L221
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'881'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L221   EQU   *
         L     2,8(5)
         LTR   2,2
         BE    @@L222
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     3,0(2)
         LTR   3,3
         BE    @@L224
@@L230   EQU   *
         L     2,24(3)
         L     2,4(2)
         C     2,4(5)
         BL    @@L224
         L     2,20(3)
         LTR   2,2
         BE    @@L228
         LR    6,2
@@L228   EQU   *
         L     2,32(3)
         LTR   2,2
         BNE   @@L239
@@L225   EQU   *
         L     3,4(3)
         LTR   3,3
         BNE   @@L230
@@L224   EQU   *
         LTR   6,6
         BE    @@L231
         LA    1,88(,13)
         L     15,=V(CLEAR@PE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         L     2,=V(CFUN)
         L     2,0(2)
         CL    5,96(2)
         BE    @@L240
@@L232   EQU   *
         MVC   88(4,13),=F'0'
         ST    6,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EMSREST)
         BALR  14,15
@@L231   EQU   *
         LTR   4,4
         BE    @@L235
         L     2,28(4)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    @@L235
         MVC   88(4,13),=A(@@LC2)
         L     2,44(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     @@L235
@@L240   EQU   *
         L     2,=V(CF@DECL)
         L     2,0(2)
         L     2,4(2)
         CLI   8(2),23
         BNE   @@L232
         L     2,32(2)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         BNE   @@L231
         B     @@L232
@@L239   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         B     @@L225
@@L222   EQU   *
         ST    4,88(13)
         ST    5,92(13)
         MVC   96(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@9)
         BALR  14,15
         LTR   15,15
         BNE   @@L235
         LTR   4,4
         BE    @@L235
         OC    8(4,4),=F'2097152'
@@L235   EQU   *
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(EMJMP)
         BALR  14,15
* Function expand_goto_internal epilogue
         PDPEPIL
* Function expand_goto_internal literal pool
         DS    0F
         LTORG
* Function expand_goto_internal page table
         DS    0F
@@PGT20  EQU   *
         DC    A(@@PG20)
         DS    0F
* S-func expand_fixup prologue
@@9      PDPPRLG CINDEX=21,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN21
         LTORG
@@FEN21  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG21   EQU   *
         LR    11,1
         L     10,=A(@@PGT21)
* Function expand_fixup code
         L     7,4(11)
         L     8,8(11)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,8(2)
         LTR   2,2
         BE    @@L242
         CL    7,16(2)
         BE    @@L243
         CL    7,20(2)
         BE    @@L243
@@L242   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,12(2)
         LTR   2,2
         BE    @@L245
         CL    7,16(2)
         BE    @@L246
         CL    7,20(2)
         BE    @@L246
         CL    7,28(2)
         BE    @@L246
@@L245   EQU   *
         SLR   5,5
@@L244   EQU   *
         LTR   5,5
         BE    @@L248
         L     3,0(5)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     4,0(2)
         LTR   3,3
         BE    @@L250
         CLR   3,4
         BE    @@L250
@@L253   EQU   *
         L     3,0(3)
         LTR   3,3
         BE    @@L250
         CLR   3,4
         BNE   @@L253
@@L250   EQU   *
         SLR   2,2
         LTR   3,3
         BNE   @@L241
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         L     3,4(2)
         LR    4,2
         CLR   2,5
         BE    @@L281
@@L260   EQU   *
         CLR   4,3
         BE    @@L283
@@L257   EQU   *
         L     4,0(4)
         CLR   4,5
         BNE   @@L260
@@L281   EQU   *
         LR    5,3
@@L248   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     4,0(2)
         CLR   4,5
         BE    @@L262
@@L267   EQU   *
         L     2,20(4)
         LTR   2,2
         BNE   @@L262
         L     2,32(4)
         LTR   2,2
         BNE   @@L262
         L     4,4(4)
         CLR   4,5
         BNE   @@L267
@@L262   EQU   *
         CLR   4,5
         BE    @@L268
         MVC   88(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(GGCALL)
         BALR  14,15
         LR    6,15
         LTR   8,8
         BE    @@L284
@@L269   EQU   *
         MVC   8(4,6),0(11)
         ST    7,16(6)
         LR    7,8
         LTR   8,8
         BE    @@L285
@@L270   EQU   *
         MVC   88(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(MAKE@NOD)
         BALR  14,15
         LR    5,15
         OC    8(4,15),=F'32768'
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,224(2)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BE    @@L286
         L     2,=V(CF@DECL)
         L     3,0(2)
         L     2,60(3)
         MVC   0(4,15),0(2)
         L     2,60(3)
         ST    15,0(2)
@@L272   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-98'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         LR    8,15
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,224(2)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BE    @@L273
         ST    5,16(15)
@@L273   EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         ST    15,4(6)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-97'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         L     2,0(3)
         L     2,224(2)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BE    @@L274
         ST    5,16(15)
@@L274   EQU   *
         ST    5,12(6)
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    8,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(EMISAF)
         BALR  14,15
         L     2,0(3)
         L     2,4(2)
         MVC   20(4,6),28(2)
         MVC   24(4,6),=F'0'
         L     2,36(4)
         LTR   2,2
         BNE   @@L277
         L     15,32(4)
         LTR   15,15
         BE    @@L276
@@L277   EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),32(4)
         MVC   96(4,13),36(4)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
@@L276   EQU   *
         ST    15,28(6)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   0(4,6),52(2)
         ST    6,52(2)
@@L268   EQU   *
         LR    2,4
         LTR   4,4
         BE    @@L241
         LA    2,1(0,0)
         B     @@L241
@@L286   EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(INSERT@B)
         BALR  14,15
         B     @@L272
@@L285   EQU   *
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LR    7,15
         B     @@L270
@@L284   EQU   *
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         B     @@L269
@@L283   EQU   *
         L     3,4(4)
         B     @@L257
@@L246   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     5,12(2)
         B     @@L244
@@L243   EQU   *
         LR    5,2
         B     @@L244
@@L241   EQU   *
         LR    15,2
* Function expand_fixup epilogue
         PDPEPIL
* Function expand_fixup literal pool
         DS    0F
         LTORG
* Function expand_fixup page table
         DS    0F
@@PGT21  EQU   *
         DC    A(@@PG21)
         DS    0F
* X-func expfxps prologue
EXPFXPS  PDPPRLG CINDEX=22,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN22
         LTORG
@@FEN22  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG22   EQU   *
         LR    11,1
         L     10,=A(@@PGT22)
* Function expfxps code
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),0(11)
         MVC   104(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
* Function expfxps epilogue
         PDPEPIL
* Function expfxps literal pool
         DS    0F
         LTORG
* Function expfxps page table
         DS    0F
@@PGT22  EQU   *
         DC    A(@@PG22)
@@LC3    EQU   *
         DC    C'label `%s'' used before containing binding conto'
         DC    C'ur'
         DC    X'0'
         DS    0F
* S-func fixup_gotos prologue
@@10     PDPPRLG CINDEX=23,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN23
         LTORG
@@FEN23  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG23   EQU   *
         LR    11,1
         L     10,=A(@@PGT23)
* Function fixup_gotos code
         L     7,0(11)
         L     6,4(11)
         L     9,12(11)
         L     8,16(11)
         SLR   3,3
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     4,52(2)
         LTR   4,4
         BE    @@L324
@@L308   EQU   *
         L     5,4(4)
         LTR   5,5
         BNE   @@L293
         LTR   3,3
         BE    @@L291
         MVC   0(4,3),0(4)
@@L291   EQU   *
         LR    3,4
         L     4,0(4)
         LTR   4,4
         BNE   @@L308
@@L324   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     4,52(2)
         LTR   4,4
         BE    @@L327
@@L322   EQU   *
         L     2,4(4)
         LTR   2,2
         BE    @@L311
         L     2,16(4)
         L     2,8(2)
         LTR   2,2
         BNE   @@L311
         LTR   7,7
         BE    @@L311
         L     2,16(7)
         C     2,20(4)
         BH    @@L311
         L     3,28(4)
         LTR   3,3
         BE    @@L329
@@L320   EQU   *
         L     2,0(3)
         CL    2,36(7)
         BE    @@L330
@@L316   EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   @@L320
@@L329   EQU   *
         LTR   6,6
         BE    @@L311
         ST    6,24(4)
@@L311   EQU   *
         L     4,0(4)
         LTR   4,4
         BNE   @@L322
         B     @@L327
@@L330   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PUSHLEVE)
         BALR  14,15
         MVC   88(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(SBLOCK)
         BALR  14,15
         MVC   88(4,13),16(3)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(POPLEVEL)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LTR   2,2
         BE    @@L319
         ST    2,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(EMISAF)
         BALR  14,15
         ST    15,4(4)
@@L319   EQU   *
         MVC   28(4,4),0(3)
         B     @@L316
@@L293   EQU   *
         L     15,16(4)
         L     2,8(15)
         LTR   2,2
         BE    @@L291
         L     3,8(4)
         LTR   3,3
         BE    @@L297
         LTR   8,8
         BNE   @@L298
         LTR   6,6
         BE    @@L331
@@L298   EQU   *
         L     2,4(9)
         C     2,4(15)
         BNL   @@L297
         C     2,4(5)
         BNH   @@L297
         L     2,28(3)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    @@L332
@@L297   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PUSHLEVE)
         BALR  14,15
         MVC   88(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(SBLOCK)
         BALR  14,15
         L     2,28(4)
         LTR   2,2
         BE    @@L299
         LR    3,2
@@L305   EQU   *
         L     2,8(3)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BE    @@L302
         L     2,16(3)
         LTR   2,2
         BNE   @@L333
@@L302   EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   @@L305
@@L299   EQU   *
         L     2,24(4)
         LTR   2,2
         BE    @@L306
         L     2,=V(CFUN)
         L     3,0(2)
         L     2,16(4)
         CL    2,96(3)
         BE    @@L334
@@L307   EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),24(4)
         MVC   96(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(EMSREST)
         BALR  14,15
@@L306   EQU   *
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'1'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(POPLEVEL)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(EMISAF)
         BALR  14,15
         MVC   4(4,4),=F'0'
         B     @@L291
@@L334   EQU   *
         L     2,=V(CF@DECL)
         L     2,0(2)
         L     2,4(2)
         CLI   8(2),23
         BNE   @@L307
         L     2,32(2)
         SRL   2,14
         N     2,=F'1'
         LTR   2,2
         BNE   @@L306
         B     @@L307
@@L333   EQU   *
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         B     @@L302
@@L332   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC3)
         LA    1,88(,13)
         L     15,=V(ERRWDECL)
         BALR  14,15
         L     2,8(4)
         OC    28(4,2),=F'2097152'
         B     @@L297
@@L331   EQU   *
         L     2,8(11)
         LTR   2,2
         BNE   @@L298
         B     @@L297
@@L327   EQU   *
* Function fixup_gotos epilogue
         PDPEPIL
* Function fixup_gotos literal pool
         DS    0F
         LTORG
* Function fixup_gotos page table
         DS    0F
@@PGT23  EQU   *
         DC    A(@@PG23)
         DS    0F
* S-func n_occurrences prologue
@@11     PDPPRLG CINDEX=24,FRAME=88,BASER=12,ENTRY=NO
         B     @@FEN24
         LTORG
@@FEN24  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG24   EQU   *
         LR    11,1
         L     10,=A(@@PGT24)
* Function n_occurrences code
         L     4,0(11)
         L     3,4(11)
         SLR   15,15
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BE    @@L343
@@L341   EQU   *
         SLR   2,2
         IC    2,0(3)
         A     3,=F'1'
         CLR   2,4
         BE    @@L344
@@L336   EQU   *
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BNE   @@L341
         B     @@L343
@@L344   EQU   *
         A     15,=F'1'
         B     @@L336
@@L343   EQU   *
* Function n_occurrences epilogue
         PDPEPIL
* Function n_occurrences literal pool
         DS    0F
         LTORG
* Function n_occurrences page table
         DS    0F
@@PGT24  EQU   *
         DC    A(@@PG24)
         DS    0F
* X-func expasm prologue
EXPASM   PDPPRLG CINDEX=25,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN25
         LTORG
@@FEN25  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG25   EQU   *
         LR    11,1
         L     10,=A(@@PGT25)
* Function expasm code
         L     2,0(11)
         L     3,4(11)
         CLI   8(2),121
         BNE   @@L346
         L     2,16(2)
@@L346   EQU   *
         MVC   88(4,13),=F'40'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),20(2)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         N     3,=F'1'
         SLL   3,4
         L     2,0(15)
         N     2,=F'-17'
         OR    2,3
         ST    2,0(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
* Function expasm epilogue
         PDPEPIL
* Function expasm literal pool
         DS    0F
         LTORG
* Function expasm page table
         DS    0F
@@PGT25  EQU   *
         DC    A(@@PG25)
@@LC5    EQU   *
         DC    C'output constraint `%c'' for operand %d is not at'
         DC    C' the beginning'
         DC    X'0'
@@LC6    EQU   *
         DC    C'operand constraint contains incorrectly position'
         DC    C'ed ''+'' or ''='''
         DC    X'0'
@@LC7    EQU   *
         DC    C'`%%'' constraint used with last operand'
         DC    X'0'
@@LC8    EQU   *
         DC    C'matching constraint not valid in output operand'
         DC    X'0'
@@LC4    EQU   *
         DC    C'output operand constraint lacks `='''
         DC    X'0'
         DS    0F
* X-func parse_output_constraint prologue
PARSE@OU PDPPRLG CINDEX=26,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN26
         LTORG
@@FEN26  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG26   EQU   *
         LR    11,1
         L     10,=A(@@PGT26)
* Function parse_output_constraint code
         L     8,0(11)
         L     9,4(11)
         L     7,16(11)
         L     6,20(11)
         L     5,0(8)
         MVI   0(7),0
         MVI   0(6),0
         ST    5,88(13)
         MVC   92(4,13),=F'126'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    4,15
         LTR   15,15
         L     14,=A(@@L418)
         BER   14
@@L348   EQU   *
         L     12,0(,10)
         LTR   4,4
         L     14,=A(@@L419)
         BER   14
         SLR   3,3
         CLI   0(4),78
         L     14,=A(@@L420)
         BER   14
@@L350   EQU   *
         L     12,0(,10)
         L     2,24(11)
         STC   3,0(2)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    3,15
         CLR   4,5
         BE    @@L353
         MVC   88(4,13),=A(@@LC5)
         SLR   2,2
         IC    2,0(4)
         ST    2,92(13)
         ST    9,96(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
@@L353   EQU   *
         A     3,=F'1'
         ST    3,88(13)
         BCTR  3,0
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(STRCPY)
         BALR  14,15
         SR    4,5
         IC    5,0(2)
         STC   5,0(4,2)
         MVI   0(2),126
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(G@ALLSTR)
         BALR  14,15
         ST    15,0(8)
         LR    4,15
         A     4,=F'1'
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BE    @@L415
@@L413   EQU   *
         IC    15,0(4)
         LR    3,15
         N     3,=XL4'000000FF'
         A     3,=F'-76'
         LA    2,173(0,0)
         CLR   3,2
         BH    @@L404
         MH    3,=H'4'
         L     2,=A(@@L412)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L412   EQU   *
         DC    A(@@L416)
         DC    A(@@L404)
         DC    A(@@L360)
         DC    A(@@L404)
         DC    A(@@L356)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L356)
         DC    A(@@L404)
         DC    A(@@L356)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L356)
         DC    A(@@L361)
         DC    A(@@L404)
         DC    A(@@L416)
         DC    A(@@L356)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L356)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L360)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L406)
         DC    A(@@L404)
         DC    A(@@L356)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L416)
         DC    A(@@L356)
         DC    A(@@L416)
         DC    A(@@L408)
         DC    A(@@L404)
         DC    A(@@L408)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L356)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L397)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L356)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L416)
         DC    A(@@L404)
         DC    A(@@L406)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L404)
         DC    A(@@L397)
         DC    A(@@L397)
         DC    A(@@L397)
         DC    A(@@L397)
         DC    A(@@L397)
         DC    A(@@L397)
         DC    A(@@L397)
         DC    A(@@L397)
         DC    A(@@L397)
         DC    A(@@L397)
@@L360   EQU   *
         MVC   88(4,13),=A(@@LC6)
@@L417   EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   15,15
         B     @@L347
@@L361   EQU   *
         LR    3,9
         A     3,=F'1'
         L     2,8(11)
         A     2,12(11)
         CLR   3,2
         BE    @@L421
@@L356   EQU   *
         A     4,=F'1'
         IC    2,0(4)
         CLM   2,1,=XL1'00'
         BNE   @@L413
@@L415   EQU   *
         LA    15,1(0,0)
         B     @@L347
@@L421   EQU   *
         MVC   88(4,13),=A(@@LC7)
         B     @@L417
@@L416   EQU   *
         MVI   0(7),1
         B     @@L356
@@L408   EQU   *
         MVI   0(6),1
         B     @@L356
@@L406   EQU   *
         MVI   0(6),1
         B     @@L416
@@L404   EQU   *
         LR    2,15
         N     2,=XL4'000000FF'
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    2,0(2,3)
         N     2,=F'136'
         CH    2,=H'0'
         BE    @@L356
         CLM   15,1,=XL1'81'
         BE    @@L408
         CLM   15,1,=XL1'84'
         BE    @@L408
         CLM   15,1,=XL1'86'
         BNE   @@L406
         B     @@L408
@@L397   EQU   *
         MVC   88(4,13),=A(@@LC8)
         B     @@L417
@@L420   EQU   *
         LA    3,1(0,0)
         B     @@L350
@@L419   EQU   *
         MVC   88(4,13),=A(@@LC4)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         LR    15,4
         B     @@L347
@@L418   EQU   *
         ST    5,88(13)
         MVC   92(4,13),=F'78'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    4,15
         B     @@L348
@@L347   EQU   *
* Function parse_output_constraint epilogue
         PDPEPIL
* Function parse_output_constraint literal pool
         DS    0F
         LTORG
* Function parse_output_constraint page table
         DS    0F
@@PGT26  EQU   *
         DC    A(@@PG26)
@@LC9    EQU   *
         DC    C'input operand constraint contains `%c'''
         DC    X'0'
@@LC11   EQU   *
         DC    C'invalid punctuation `%c'' in constraint'
         DC    X'0'
@@LC10   EQU   *
         DC    C'matching constraint references invalid operand n'
         DC    C'umber'
         DC    X'0'
         DS    0F
* S-func parse_input_constraint prologue
@@12     PDPPRLG CINDEX=27,FRAME=112,BASER=12,ENTRY=NO
         B     @@FEN27
         LTORG
@@FEN27  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG27   EQU   *
         LR    11,1
         L     10,=A(@@PGT27)
* Function parse_input_constraint code
         L     8,24(11)
         L     7,28(11)
         L     2,0(11)
         L     4,0(2)
         LR    9,4
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    6,15
         MVI   0(8),0
         MVI   0(7),0
         SLR   5,5
         CLR   5,15
         BNL   @@L488
@@L486   EQU   *
         IC    15,0(5,4)
         LR    3,15
         N     3,=XL4'000000FF'
         A     3,=F'-76'
         LA    2,173(0,0)
         CLR   3,2
         BH    @@L477
         MH    3,=H'4'
         L     2,=A(@@L485)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L485   EQU   *
         DC    A(@@L425)
         DC    A(@@L477)
         DC    A(@@L430)
         DC    A(@@L477)
         DC    A(@@L430)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L425)
         DC    A(@@L477)
         DC    A(@@L425)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L425)
         DC    A(@@L432)
         DC    A(@@L477)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L425)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L430)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L479)
         DC    A(@@L477)
         DC    A(@@L425)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L489)
         DC    A(@@L425)
         DC    A(@@L489)
         DC    A(@@L481)
         DC    A(@@L477)
         DC    A(@@L481)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L425)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L425)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L489)
         DC    A(@@L477)
         DC    A(@@L479)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L477)
         DC    A(@@L468)
         DC    A(@@L468)
         DC    A(@@L468)
         DC    A(@@L468)
         DC    A(@@L468)
         DC    A(@@L468)
         DC    A(@@L468)
         DC    A(@@L468)
         DC    A(@@L468)
         DC    A(@@L468)
@@L430   EQU   *
         CLR   4,9
         BE    @@L492
@@L425   EQU   *
         A     5,=F'1'
         CLR   5,6
         BL    @@L486
@@L488   EQU   *
         LA    15,1(0,0)
         B     @@L422
@@L492   EQU   *
         MVC   88(4,13),=A(@@LC9)
@@L491   EQU   *
         SLR   2,2
         IC    2,0(5,4)
         ST    2,92(13)
@@L490   EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   15,15
         B     @@L422
@@L432   EQU   *
         CLR   4,9
         BNE   @@L425
         L     3,4(11)
         A     3,=F'1'
         L     2,8(11)
         S     2,16(11)
         CLR   3,2
         BNE   @@L425
         MVC   88(4,13),=A(@@LC7)
         B     @@L490
@@L481   EQU   *
         MVI   0(7),1
         B     @@L425
@@L489   EQU   *
         MVI   0(8),1
         B     @@L425
@@L479   EQU   *
         MVI   0(7),1
         B     @@L489
@@L477   EQU   *
         LR    2,15
         N     2,=XL4'000000FF'
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    2,0(2,3)
         N     2,=F'136'
         CH    2,=H'0'
         BE    @@L493
         CLM   15,1,=XL1'81'
         BE    @@L481
         CLM   15,1,=XL1'84'
         BE    @@L481
         CLM   15,1,=XL1'86'
         BNE   @@L479
         B     @@L481
@@L493   EQU   *
         MVC   88(4,13),=A(@@LC11)
         B     @@L491
@@L468   EQU   *
         LR    2,4
         AR    2,5
         ST    2,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         MVC   96(4,13),=F'10'
         LA    1,88(,13)
         L     15,=V(STRTOUL)
         BALR  14,15
         CL    15,12(11)
         BNL   @@L494
         L     3,104(13)
         IC    2,0(3)
         CLM   2,1,=XL1'00'
         BNE   @@L470
         LTR   5,5
         BE    @@L471
         LA    2,1(0,0)
         CLR   5,2
         BE    @@L495
@@L470   EQU   *
         LR    5,3
         SR    5,4
         B     @@L481
@@L495   EQU   *
         CLI   0(4),108
         BNE   @@L470
@@L471   EQU   *
         MH    15,=H'4'
         L     2,20(11)
         L     4,0(15,2)
         L     2,0(11)
         ST    4,0(2)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         LR    6,15
         SLR   5,5
         B     @@L425
@@L494   EQU   *
         MVC   88(4,13),=A(@@LC10)
         B     @@L490
@@L422   EQU   *
* Function parse_input_constraint epilogue
         PDPEPIL
* Function parse_input_constraint literal pool
         DS    0F
         LTORG
* Function parse_input_constraint page table
         DS    0F
@@PGT27  EQU   *
         DC    A(@@PG27)
@@LC14   EQU   *
         DC    C'output number %d not directly addressable'
         DC    X'0'
@@LC16   EQU   *
         DC    C'%d'
         DC    X'0'
@@LC15   EQU   *
         DC    C'asm operand %d probably doesn''t match constrain'
         DC    C'ts'
         DC    X'0'
@@LC13   EQU   *
         DC    C'more than %d operands in `asm'''
         DC    X'0'
@@LC12   EQU   *
         DC    C'unknown register name `%s'' in `asm'''
         DC    X'0'
         DS    0F
* X-func expasop prologue
EXPASOP  PDPPRLG CINDEX=28,FRAME=232,BASER=12,ENTRY=YES
         B     @@FEN28
         LTORG
@@FEN28  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG28   EQU   *
         LR    11,1
         L     10,=A(@@PGT28)
* Function expasop code
         MVC   88(4,13),8(11)
         LA    1,88(,13)
         L     15,=V(LIST@LEN)
         BALR  14,15
         ST    15,180(13)
         MVC   88(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(LIST@LEN)
         BALR  14,15
         ST    15,184(13)
         LR    2,15
         MH    2,=H'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,196(13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,200(13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,204(13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,208(13)
         L     2,184(13)
         A     2,180(13)
         MH    2,=H'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,212(13)
         L     2,=V(GENERATI)
         MVC   216(4,13),0(2)
         L     2,184(13)
         LTR   2,2
         BNE   @@L497
         MVC   16(4,11),=F'1'
@@L497   EQU   *
         MVC   88(4,13),4(11)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@13)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(@@L496)
         BER   14
         MVC   88(4,13),4(11)
         MVC   92(4,13),8(11)
         LA    1,88(,13)
         L     15,=A(@@14)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(@@L496)
         BER   14
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         MVC   96(4,13),8(11)
         MVC   100(4,13),212(13)
         LA    1,88(,13)
         L     15,=A(@@15)
         BALR  14,15
         ST    15,0(11)
         MVC   192(4,13),=F'0'
         L     6,12(11)
         LTR   6,6
         BE    @@L617
@@L508   EQU   *
         L     2,16(6)
         L     2,20(2)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(DECODE@R)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L642)
         BLR   14
@@L505   EQU   *
         L     12,0(,10)
         L     4,192(13)
         A     4,=F'1'
         ST    4,192(13)
@@L502   EQU   *
         L     12,0(,10)
         L     6,0(6)
         LTR   6,6
         BNE   @@L508
@@L617   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
         SLR   7,7
         ST    7,188(13)
         L     6,4(11)
         LTR   6,6
         BE    @@L619
@@L520   EQU   *
         L     5,16(6)
         L     8,4(5)
         L     2,=V(GLOBAL@T)
         CL    8,0(2)
         L     14,=A(@@L496)
         BER   14
         LR    2,7
         MH    2,=H'4'
         L     9,212(13)
         L     2,0(2,9)
         ST    2,144(13)
         LA    2,144(,13)
         ST    2,88(13)
         ST    7,92(13)
         MVC   96(4,13),180(13)
         MVC   100(4,13),184(13)
         LA    2,148(,13)
         ST    2,104(13)
         LA    2,149(,13)
         ST    2,108(13)
         LA    2,150(,13)
         ST    2,112(13)
         LA    1,88(,13)
         L     15,=A(PARSE@OU)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(@@L496)
         BER   14
         CLI   149(13),0
         BNE   @@L515
         CLI   148(13),0
         L     14,=A(@@L516)
         BNER  14
         CLI   150(13),0
         L     14,=A(@@L516)
         BNER  14
         SLR   2,2
         IC    2,8(5)
         L     3,=V(TCODTYPE)
         IC    2,0(3,2)
         CLM   2,1,=XL1'84'
         L     14,=A(@@L643)
         BER   14
@@L515   EQU   *
         L     12,0(,10)
         CLI   150(13),0
         BE    @@L511
         L     2,188(13)
         A     2,=F'1'
         ST    2,188(13)
@@L511   EQU   *
         L     6,0(6)
         A     7,=F'1'
         LTR   6,6
         BNE   @@L520
@@L619   EQU   *
         L     3,180(13)
         A     3,188(13)
         ST    3,180(13)
         LR    2,3
         A     2,184(13)
         LA    4,30(0,0)
         CR    2,4
         L     14,=A(@@L644)
         BHR   14
         SLR   7,7
         L     6,8(11)
         LTR   6,6
         BE    @@L621
         L     5,184(13)
         MH    5,=H'4'
         A     5,212(13)
@@L529   EQU   *
         L     2,16(6)
         L     3,4(2)
         L     2,=V(GLOBAL@T)
         CL    3,0(2)
         L     14,=A(@@L496)
         BER   14
         MVC   152(4,13),0(5)
         LA    2,152(,13)
         ST    2,88(13)
         ST    7,92(13)
         MVC   96(4,13),180(13)
         MVC   100(4,13),184(13)
         MVC   104(4,13),188(13)
         MVC   108(4,13),212(13)
         LA    2,156(,13)
         ST    2,112(13)
         LA    2,157(,13)
         ST    2,116(13)
         LA    1,88(,13)
         L     15,=A(@@12)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(@@L496)
         BER   14
         CLI   157(13),0
         BNE   @@L524
         CLI   156(13),0
         L     14,=A(@@L645)
         BNER  14
@@L524   EQU   *
         L     12,0(,10)
         A     5,=F'4'
         A     7,=F'1'
         L     6,0(6)
         LTR   6,6
         BNE   @@L529
@@L621   EQU   *
         SLR   7,7
         ST    7,188(13)
         L     6,4(11)
         LTR   6,6
         BE    @@L623
         ST    7,228(13)
         L     8,196(13)
         L     9,204(13)
@@L550   EQU   *
         L     5,16(6)
         L     4,4(5)
         L     2,212(13)
         A     2,228(13)
         ST    2,88(13)
         ST    7,92(13)
         MVC   96(4,13),180(13)
         MVC   100(4,13),184(13)
         LA    2,158(,13)
         ST    2,104(13)
         LA    2,159(,13)
         ST    2,108(13)
         LA    2,160(,13)
         ST    2,112(13)
         LA    1,88(,13)
         L     15,=A(PARSE@OU)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(@@L646)
         BER   14
@@L534   EQU   *
         L     12,0(,10)
         L     2,=V(GENERATI)
         MVC   0(4,2),=F'0'
         MVC   0(4,9),=F'0'
         CLI   8(5),41
         L     14,=A(@@L647)
         BER   14
@@L537   EQU   *
         L     12,0(,10)
         SLR   2,2
         IC    2,8(5)
         L     3,=V(TCODTYPE)
         IC    2,0(3,2)
         CLM   2,1,=XL1'84'
         L     14,=A(@@L648)
         BER   14
@@L538   EQU   *
         L     12,0(,10)
         CLI   159(13),0
         BE    @@L536
         CLI   160(13),0
         L     14,=A(@@L535)
         BER   14
@@L536   EQU   *
         L     12,0(,10)
         ST    5,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    15,0(8)
         CLI   159(13),0
         BNE   @@L543
         LH    2,0(15)
         CLM   2,3,=H'66'
         BE    @@L543
         MVC   88(4,13),=A(@@LC14)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
@@L543   EQU   *
         CLI   158(13),0
         BNE   @@L546
         L     2,0(8)
         LH    2,0(2)
         CLM   2,3,=H'66'
         L     14,=A(@@L545)
         BER   14
@@L546   EQU   *
         L     2,0(8)
         LH    2,0(2)
         CLM   2,3,=H'65'
         L     14,=A(@@L545)
         BER   14
@@L548   EQU   *
         L     12,0(,10)
         L     2,=V(GENERATI)
         MVC   0(4,2),216(13)
         CLI   160(13),0
         BE    @@L532
         L     3,188(13)
         MH    3,=H'4'
         LH    2,32(4)
         N     2,=F'127'
         L     4,208(13)
         ST    2,0(3,4)
         L     5,200(13)
         ST    7,0(3,5)
         L     2,188(13)
         A     2,=F'1'
         ST    2,188(13)
@@L532   EQU   *
         L     6,0(6)
         A     8,=F'4'
         A     9,=F'4'
         L     3,228(13)
         A     3,=F'4'
         ST    3,228(13)
         A     7,=F'1'
         LTR   6,6
         BNE   @@L550
@@L623   EQU   *
         MVC   88(4,13),180(13)
         LA    1,88(,13)
         L     15,=V(RTVEC@AL)
         BALR  14,15
         ST    15,172(13)
         MVC   88(4,13),180(13)
         LA    1,88(,13)
         L     15,=V(RTVEC@AL)
         BALR  14,15
         ST    15,176(13)
         MVC   88(4,13),=F'41'
         L     4,184(13)
         LTR   4,4
         L     14,=A(@@L551)
         BER   14
         L     5,196(13)
         L     2,0(5)
         SLR   9,9
         IC    9,2(2)
         LR    2,9
@@L552   EQU   *
         L     12,0(,10)
         ST    2,92(13)
         L     2,0(11)
         MVC   96(4,13),20(2)
         MVC   100(4,13),=V(EMPTY@ST)
         MVC   104(4,13),=F'0'
         MVC   108(4,13),172(13)
         MVC   112(4,13),176(13)
         MVC   116(4,13),20(11)
         MVC   120(4,13),24(11)
         LA    1,88(,13)
         L     15,=V(GRFSSI)
         BALR  14,15
         LR    8,15
         L     3,16(11)
         N     3,=F'1'
         ST    3,220(13)
         SLL   3,4
         L     2,0(15)
         N     2,=F'-17'
         OR    2,3
         ST    2,0(15)
         SLR   7,7
         L     6,8(11)
         LTR   6,6
         BE    @@L625
         L     4,184(13)
         MH    4,=H'4'
         A     4,212(13)
         ST    4,224(13)
@@L575   EQU   *
         L     4,184(13)
         AR    4,7
         L     5,224(13)
         MVC   164(4,13),0(5)
         LA    2,164(,13)
         ST    2,88(13)
         ST    7,92(13)
         MVC   96(4,13),180(13)
         MVC   100(4,13),184(13)
         MVC   104(4,13),188(13)
         MVC   108(4,13),212(13)
         LA    2,168(,13)
         ST    2,112(13)
         LA    2,169(,13)
         ST    2,116(13)
         LA    1,88(,13)
         L     15,=A(@@12)
         BALR  14,15
         CLM   15,1,=XL1'00'
         L     14,=A(@@L649)
         BER   14
@@L557   EQU   *
         L     12,0(,10)
         L     2,=V(GENERATI)
         MVC   0(4,2),=F'0'
         L     2,16(6)
         L     9,4(2)
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         LR    5,15
         LH    2,0(15)
         CLM   2,3,=H'65'
         L     14,=A(@@L650)
         BER   14
@@L558   EQU   *
         L     12,0(,10)
         ST    5,88(13)
         MVC   92(4,13),164(13)
         LA    1,88(,13)
         L     15,=V(ASM@OPER)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L651)
         BNHR  14
@@L559   EQU   *
         L     12,0(,10)
         L     2,=V(GENERATI)
         MVC   0(4,2),216(13)
         L     2,16(8)
         LR    3,7
         MH    3,=H'4'
         ST    5,4(3,2)
         L     4,20(8)
         MVC   88(4,13),=F'40'
         LH    2,32(9)
         N     2,=F'127'
         ST    2,92(13)
         L     5,224(13)
         MVC   96(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         ST    15,4(3,4)
         L     6,0(6)
         A     5,=F'4'
         ST    5,224(13)
         A     7,=F'1'
         LTR   6,6
         BNE   @@L575
@@L625   EQU   *
         L     2,=V(GENERATI)
         MVC   0(4,2),=F'0'
         SLR   7,7
         L     4,180(13)
         S     4,188(13)
         CR    7,4
         L     14,=A(@@L580)
         BLR   14
@@L627   EQU   *
         L     12,0(,10)
         SLR   7,7
         C     7,184(13)
         L     14,=A(@@L585)
         BLR   14
@@L629   EQU   *
         L     12,0(,10)
         SLR   7,7
         C     7,188(13)
         L     14,=A(@@L590)
         BLR   14
@@L631   EQU   *
         L     12,0(,10)
         L     2,=V(GENERATI)
         MVC   0(4,2),216(13)
         L     4,184(13)
         LA    3,1(0,0)
         CLR   4,3
         L     14,=A(@@L652)
         BER   14
@@L591   EQU   *
         L     12,0(,10)
         L     3,184(13)
         LTR   3,3
         BNE   @@L593
         L     4,192(13)
         LTR   4,4
         BE    @@L635
@@L593   EQU   *
         LR    5,8
         L     2,184(13)
         LTR   2,2
         BNE   @@L595
         LA    2,1(0,0)
@@L595   EQU   *
         A     2,192(13)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(RTVEC@AL)
         BALR  14,15
         MVC   88(4,13),=F'39'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
         LR    8,15
         SLR   7,7
         L     6,4(11)
         LTR   6,6
         BE    @@L633
@@L600   EQU   *
         L     4,4(8)
         LR    3,7
         MH    3,=H'4'
         MVC   88(4,13),=F'41'
         L     9,196(13)
         L     2,0(3,9)
         SLR   9,9
         IC    9,2(2)
         ST    9,92(13)
         L     2,0(11)
         MVC   96(4,13),20(2)
         L     9,212(13)
         L     9,0(3,9)
         ST    9,100(13)
         ST    7,104(13)
         MVC   108(4,13),172(13)
         MVC   112(4,13),176(13)
         MVC   116(4,13),20(11)
         MVC   120(4,13),24(11)
         LA    1,88(,13)
         L     15,=V(GRFSSI)
         BALR  14,15
         MVC   88(4,13),=F'47'
         MVC   92(4,13),=F'0'
         L     2,196(13)
         L     2,0(3,2)
         ST    2,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,4(3,4)
         L     2,4(8)
         L     2,4(3,2)
         L     3,8(2)
         L     4,220(13)
         SLL   4,4
         L     2,0(3)
         N     2,=F'-17'
         OR    2,4
         ST    2,0(3)
         L     6,0(6)
         A     7,=F'1'
         LTR   6,6
         BNE   @@L600
@@L633   EQU   *
         LTR   7,7
         BNE   @@L601
         L     2,4(8)
         ST    5,4(2)
         LA    7,1(0,0)
@@L601   EQU   *
         L     6,12(11)
         LTR   6,6
         BE    @@L635
@@L609   EQU   *
         L     2,16(6)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=V(DECODE@R)
         BALR  14,15
         LTR   15,15
         BL    @@L653
         L     3,4(8)
         LR    2,7
         MH    2,=H'4'
         MVC   88(4,13),=F'2'
         A     7,=F'1'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRREG)
         BALR  14,15
@@L640   EQU   *
         MVC   88(4,13),=F'49'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFE)
         BALR  14,15
         ST    15,4(2,3)
@@L604   EQU   *
         L     6,0(6)
         LTR   6,6
         BNE   @@L609
@@L635   EQU   *
         ST    8,88(13)
@@L641   EQU   *
         LA    1,88(,13)
         L     15,=V(EMINS)
         BALR  14,15
         SLR   7,7
         C     7,184(13)
         BNL   @@L637
@@L615   EQU   *
         LR    3,7
         MH    3,=H'4'
         L     5,204(13)
         L     2,0(3,5)
         LTR   2,2
         BNE   @@L654
@@L612   EQU   *
         A     7,=F'1'
         C     7,184(13)
         BL    @@L615
@@L637   EQU   *
         LA    1,88(,13)
         L     15,=V(FTEMPSL)
         BALR  14,15
         L     14,=A(@@L496)
         BR    14
@@L654   EQU   *
         ST    2,88(13)
         L     9,196(13)
         L     3,0(3,9)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         B     @@L612
@@L653   EQU   *
         L     3,=F'-3'
         CLR   15,3
         BE    @@L604
         L     4,=F'-4'
         CLR   15,4
         BNE   @@L604
         L     3,4(8)
         LR    2,7
         MH    2,=H'4'
         MVC   88(4,13),=F'62'
         A     7,=F'1'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(GRF@0)
         BALR  14,15
         MVC   88(4,13),=F'51'
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         B     @@L640
@@L652   EQU   *
         L     5,192(13)
         LTR   5,5
         BNE   @@L591
         L     9,212(13)
         MVC   8(4,8),0(9)
         MVC   88(4,13),=F'47'
         MVC   92(4,13),192(13)
         L     2,196(13)
         MVC   96(4,13),0(2)
         ST    8,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         ST    15,88(13)
         B     @@L641
@@L590   EQU   *
         LR    6,7
         MH    6,=H'4'
         L     9,200(13)
         L     5,0(6,9)
         L     4,16(8)
         L     3,180(13)
         S     3,188(13)
         AR    3,7
         MH    3,=H'4'
         LR    2,5
         MH    2,=H'4'
         L     9,196(13)
         L     2,0(2,9)
         ST    2,4(3,4)
         LA    2,128(,13)
         ST    2,88(13)
         MVC   92(4,13),=A(@@LC16)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         L     4,20(8)
         ST    2,88(13)
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(G@ALLSTR)
         BALR  14,15
         MVC   88(4,13),=F'40'
         L     2,208(13)
         L     6,0(6,2)
         ST    6,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRF@S)
         BALR  14,15
         ST    15,4(3,4)
         A     7,=F'1'
         C     7,188(13)
         BL    @@L590
         B     @@L631
@@L585   EQU   *
         LR    2,7
         MH    2,=H'4'
         L     3,196(13)
         L     3,0(2,3)
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         L     4,196(13)
         ST    15,0(2,4)
         A     7,=F'1'
         C     7,184(13)
         BL    @@L585
         B     @@L629
@@L580   EQU   *
         L     3,16(8)
         LR    2,7
         MH    2,=H'4'
         L     9,4(2,3)
         ST    9,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         ST    15,4(2,3)
         A     7,=F'1'
         CR    7,4
         BL    @@L580
         B     @@L627
@@L651   EQU   *
         CLI   169(13),0
         L     14,=A(@@L655)
         BNER  14
         CLI   168(13),0
         BE    @@L638
         LH    3,0(5)
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         L     14,=A(@@L565)
         BNHR  14
         CLM   3,3,=H'54'
         L     14,=A(@@L565)
         BER   14
         CLM   3,3,=H'55'
         L     14,=A(@@L565)
         BER   14
         CLM   3,3,=H'58'
         L     14,=A(@@L565)
         BER   14
         CLM   3,3,=H'134'
         L     14,=A(@@L565)
         BER   14
         CLM   3,3,=H'56'
         L     14,=A(@@L565)
         BER   14
         CLM   3,3,=H'140'
         L     14,=A(@@L565)
         BER   14
         CLM   3,3,=H'61'
         BE    @@L568
         CLM   3,3,=H'63'
         BE    @@L568
         CLM   3,3,=H'70'
         BE    @@L568
         CLM   3,3,=H'65'
         BE    @@L568
         L     2,0(5)
         N     2,=F'-65520'
         L     3,=F'4325392'
         CLR   2,3
         BE    @@L559
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(QUEUED@S)
         BALR  14,15
         LTR   15,15
         BNE   @@L559
@@L638   EQU   *
         MVC   88(4,13),=A(@@LC15)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     @@L559
@@L568   EQU   *
         ST    9,88(13)
         L     2,8(9)
         SRL   2,19
         LR    3,2
         SRL   3,0
         N     3,=F'2'
         LR    4,2
         N     4,=F'1'
         OR    4,3
         L     2,32(9)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         SLR   3,3
         CLI   8(9),20
         L     14,=A(@@L656)
         BER   14
@@L569   EQU   *
         L     12,0(,10)
         MH    3,=H'8'
         OR    4,3
         O     4,=F'1'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BUILD@QU)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSIGN@T)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         LR    5,2
         B     @@L559
@@L656   EQU   *
         L     2,4(9)
         LTR   2,2
         BE    @@L569
         LA    3,1(0,0)
         B     @@L569
@@L565   EQU   *
         LH    2,32(9)
         N     2,=F'127'
         ST    2,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@CO)
         BALR  14,15
@@L639   EQU   *
         L     12,0(,10)
         LR    5,15
         B     @@L559
@@L655   EQU   *
         LH    2,32(9)
         N     2,=F'127'
         ST    2,88(13)
         B     @@PGE28
         DS    0F
         LTORG
         DS    0F
@@PGE28  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG29   EQU   *
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@RE)
         BALR  14,15
         L     14,=A(@@L639)
         BR    14
@@L650   EQU   *
         L     12,4(,10)
         SLR   2,2
         IC    2,2(15)
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@RE)
         BALR  14,15
         LR    5,15
         L     14,=A(@@L558)
         BR    14
@@L649   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1807'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     14,=A(@@L557)
         BR    14
@@L551   EQU   *
         L     12,4(,10)
         L     2,184(13)
         L     14,=A(@@L552)
         BR    14
@@L545   EQU   *
         L     12,4(,10)
         MVC   88(4,13),0(8)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         ST    15,0(9)
         L     2,0(8)
         SLR   5,5
         IC    5,2(2)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         ST    15,0(8)
         CLI   160(13),0
         L     14,=A(@@L548)
         BER   14
         ST    15,88(13)
         MVC   92(4,13),0(9)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         L     14,=A(@@L548)
         BR    14
@@L535   EQU   *
         L     12,4(,10)
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSIGN@T)
         BALR  14,15
         ST    15,0(8)
         ST    4,88(13)
         MVC   92(4,13),0(8)
         LA    1,88(,13)
         L     15,=V(MKTRE)
         BALR  14,15
         ST    15,16(6)
         L     14,=A(@@L548)
         BR    14
@@L648   EQU   *
         L     12,4(,10)
         CLI   158(13),0
         BNE   @@L539
         L     2,80(5)
         LTR   2,2
         BE    @@L657
@@L540   EQU   *
         L     12,4(,10)
         LH    2,0(2)
         CLM   2,3,=H'61'
         L     14,=A(@@L538)
         BNER  14
@@L539   EQU   *
         L     12,4(,10)
         L     2,80(5)
         LTR   2,2
         BE    @@L658
@@L541   EQU   *
         L     12,4(,10)
         LH    2,0(2)
         CLM   2,3,=H'61'
         L     14,=A(@@L536)
         BNER  14
         L     2,80(5)
         LTR   2,2
         BE    @@L659
@@L542   EQU   *
         L     12,4(,10)
         SLR   3,3
         IC    3,2(2)
         LH    2,32(4)
         N     2,=F'127'
         CLR   3,2
         L     14,=A(@@L538)
         BNER  14
         L     14,=A(@@L536)
         BR    14
@@L659   EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(5)
         B     @@L542
@@L658   EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(5)
         B     @@L541
@@L657   EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(5)
         B     @@L540
@@L647   EQU   *
         L     12,4(,10)
         CLI   158(13),0
         L     14,=A(@@L536)
         BNER  14
         L     14,=A(@@L537)
         BR    14
@@L646   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'1733'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         L     14,=A(@@L534)
         BR    14
@@L645   EQU   *
         L     12,4(,10)
         MVC   88(4,13),16(6)
         LA    1,88(,13)
         L     15,=V(MARK@ADD)
         BALR  14,15
         L     14,=A(@@L524)
         BR    14
@@L644   EQU   *
         L     12,4(,10)
         MVC   88(4,13),=A(@@LC13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         B     @@L496
@@L643   EQU   *
         L     12,4(,10)
         L     2,80(5)
         LTR   2,2
         BE    @@L660
@@L517   EQU   *
         L     12,4(,10)
         LH    2,0(2)
         CLM   2,3,=H'61'
         L     14,=A(@@L515)
         BNER  14
         L     2,80(5)
         LTR   2,2
         BE    @@L661
@@L518   EQU   *
         L     12,4(,10)
         SLR   3,3
         IC    3,2(2)
         LH    2,32(8)
         N     2,=F'127'
         CLR   3,2
         L     14,=A(@@L515)
         BER   14
@@L516   EQU   *
         L     12,4(,10)
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(MARK@ADD)
         BALR  14,15
         L     14,=A(@@L515)
         BR    14
@@L661   EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(5)
         B     @@L518
@@L660   EQU   *
         L     12,4(,10)
         ST    5,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(5)
         B     @@L517
@@L642   EQU   *
         L     12,4(,10)
         L     3,=F'-4'
         CLR   15,3
         L     14,=A(@@L505)
         BER   14
         L     5,=F'-2'
         CLR   15,5
         L     14,=A(@@L502)
         BNER  14
         MVC   88(4,13),=A(@@LC12)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         L     14,=A(@@L502)
         BR    14
@@L496   EQU   *
         L     12,4(,10)
* Function expasop epilogue
         PDPEPIL
* Function expasop literal pool
         DS    0F
         LTORG
* Function expasop page table
         DS    0F
@@PGT28  EQU   *
         DC    A(@@PG28)
         DC    A(@@PG29)
@@LC18   EQU   *
         DC    C'operand constraints for `asm'' differ in number '
         DC    C'of alternatives'
         DC    X'0'
@@LC17   EQU   *
         DC    C'too many alternatives in `asm'''
         DC    X'0'
         DS    0F
* S-func check_operand_nalternatives prologue
@@13     PDPPRLG CINDEX=30,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN30
         LTORG
@@FEN30  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG30   EQU   *
         LR    11,1
         L     10,=A(@@PGT30)
* Function check_operand_nalternatives code
         L     5,0(11)
         L     4,4(11)
         LTR   5,5
         BE    @@L677
@@L664   EQU   *
         LR    2,5
         LTR   5,5
         BE    @@L678
@@L665   EQU   *
         L     3,12(2)
         MVC   88(4,13),=F'107'
         L     2,16(3)
         MVC   92(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(@@11)
         BALR  14,15
         LR    6,15
         LR    2,15
         A     2,=F'1'
         LA    3,30(0,0)
         CR    2,3
         BH    @@L679
         LR    3,5
         LTR   5,5
         BE    @@L663
@@L673   EQU   *
         L     2,12(3)
         L     2,16(2)
         L     2,20(2)
         MVC   88(4,13),=F'107'
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@11)
         BALR  14,15
         CLR   15,6
         BNE   @@L675
         L     2,0(3)
         LR    3,2
         LTR   2,2
         BNE   @@L667
         LR    3,4
         LR    4,2
@@L667   EQU   *
         LTR   3,3
         BNE   @@L673
@@L663   EQU   *
         LA    15,1(0,0)
         B     @@L662
@@L675   EQU   *
         MVC   88(4,13),=A(@@LC18)
@@L676   EQU   *
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   15,15
         B     @@L662
@@L679   EQU   *
         MVC   88(4,13),=A(@@LC17)
         B     @@L676
@@L678   EQU   *
         LR    2,4
         B     @@L665
@@L677   EQU   *
         LTR   4,4
         BNE   @@L664
         B     @@L663
@@L662   EQU   *
* Function check_operand_nalternatives epilogue
         PDPEPIL
* Function check_operand_nalternatives literal pool
         DS    0F
         LTORG
* Function check_operand_nalternatives page table
         DS    0F
@@PGT30  EQU   *
         DC    A(@@PG30)
@@LC19   EQU   *
         DC    C'duplicate asm operand name ''%s'''
         DC    X'0'
         DS    0F
* S-func check_unique_operand_names prologue
@@14     PDPPRLG CINDEX=31,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN31
         LTORG
@@FEN31  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG31   EQU   *
         LR    11,1
         L     10,=A(@@PGT31)
* Function check_unique_operand_names code
         L     5,0(11)
         LR    3,5
         LTR   5,5
         BE    @@L713
@@L693   EQU   *
         L     2,12(3)
         L     4,12(2)
         LTR   4,4
         BE    @@L683
         L     15,0(3)
         LTR   15,15
         BE    @@L683
@@L692   EQU   *
         L     2,12(15)
         CL    4,12(2)
         BE    @@L691
         L     15,0(15)
         LTR   15,15
         BNE   @@L692
@@L683   EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   @@L693
@@L713   EQU   *
         L     3,4(11)
         LTR   3,3
         BE    @@L716
@@L711   EQU   *
         L     2,12(3)
         L     4,12(2)
         LTR   4,4
         BE    @@L696
         L     15,0(3)
         LTR   15,15
         BE    @@L718
@@L704   EQU   *
         L     2,12(15)
         CL    4,12(2)
         BE    @@L691
         L     15,0(15)
         LTR   15,15
         BNE   @@L704
@@L718   EQU   *
         LR    15,5
         LTR   5,5
         BE    @@L696
@@L710   EQU   *
         L     2,12(15)
         CL    4,12(2)
         BE    @@L691
         L     15,0(15)
         LTR   15,15
         BNE   @@L710
@@L696   EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   @@L711
@@L716   EQU   *
         LA    15,1(0,0)
         B     @@L680
@@L691   EQU   *
         MVC   88(4,13),=A(@@LC19)
         L     2,12(3)
         L     2,12(2)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   15,15
@@L680   EQU   *
* Function check_unique_operand_names epilogue
         PDPEPIL
* Function check_unique_operand_names literal pool
         DS    0F
         LTORG
* Function check_unique_operand_names page table
         DS    0F
@@PGT31  EQU   *
         DC    A(@@PG31)
         DS    0F
* S-func resolve_operand_names prologue
@@15     PDPPRLG CINDEX=32,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN32
         LTORG
@@FEN32  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG32   EQU   *
         LR    11,1
         L     10,=A(@@PGT32)
* Function resolve_operand_names code
         L     6,0(11)
         L     8,4(11)
         L     7,8(11)
         L     5,12(11)
         MVC   88(4,13),20(6)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         LR    4,15
@@L721   EQU   *
         ST    15,88(13)
         MVC   92(4,13),=F'108'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    @@L749
         IC    2,1(15)
         CLM   2,1,=XL1'AD'
         BE    @@L750
         N     2,=XL4'000000FF'
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    2,0(2,3)
         N     2,=F'136'
         CH    2,=H'0'
         BE    @@L726
         CLI   2(15),173
         BE    @@L751
@@L726   EQU   *
         A     15,=F'1'
         B     @@L721
@@L751   EQU   *
         A     15,=F'2'
@@L725   EQU   *
         ST    15,88(13)
         ST    8,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@16)
         BALR  14,15
         B     @@L721
@@L750   EQU   *
         A     15,=F'1'
         B     @@L725
@@L749   EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         ST    15,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BLDSTRIN)
         BALR  14,15
         LR    6,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         LR    3,8
         LTR   8,8
         BE    @@L746
@@L733   EQU   *
         L     2,12(3)
         L     2,16(2)
         MVC   0(4,5),20(2)
         L     3,0(3)
         A     5,=F'4'
         LTR   3,3
         BNE   @@L733
@@L746   EQU   *
         LR    3,7
         LTR   7,7
         BE    @@L748
@@L744   EQU   *
         L     2,12(3)
         L     2,16(2)
         L     2,20(2)
         ST    2,88(13)
         MVC   92(4,13),=F'173'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BNE   @@L738
         ST    2,0(5)
@@L736   EQU   *
         L     3,0(3)
         A     5,=F'4'
         LTR   3,3
         BNE   @@L744
         B     @@L748
@@L738   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(XSTRDUP)
         BALR  14,15
         LR    4,15
@@L740   EQU   *
         ST    15,88(13)
         MVC   92(4,13),=F'173'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LTR   15,15
         BE    @@L752
         ST    15,88(13)
         ST    8,92(13)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=A(@@16)
         BALR  14,15
         B     @@L740
@@L752   EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'-1'
         LA    1,88(,13)
         L     15,=V(G@ALLSTR)
         BALR  14,15
         ST    15,0(5)
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     @@L736
@@L748   EQU   *
         LR    15,6
* Function resolve_operand_names epilogue
         PDPEPIL
* Function resolve_operand_names literal pool
         DS    0F
         LTORG
* Function resolve_operand_names page table
         DS    0F
@@PGT32  EQU   *
         DC    A(@@PG32)
@@LC21   EQU   *
         DC    C'undefined named operand ''%s'''
         DC    X'0'
@@LC20   EQU   *
         DC    C'missing close brace for named operand'
         DC    X'0'
         DS    0F
* S-func resolve_operand_name_1 prologue
@@16     PDPPRLG CINDEX=33,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN33
         LTORG
@@FEN33  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG33   EQU   *
         LR    11,1
         L     10,=A(@@PGT33)
* Function resolve_operand_name_1 code
         L     3,0(11)
         ST    3,88(13)
         MVC   92(4,13),=F'189'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BE    @@L775
         LR    5,15
         SR    5,3
         BCTR  5,0
         SLR   7,7
         L     4,4(11)
         LTR   4,4
         BE    @@L772
@@L762   EQU   *
         L     2,12(4)
         L     2,12(2)
         LTR   2,2
         BE    @@L757
         L     2,16(2)
         ST    2,88(13)
         A     3,=F'1'
         ST    3,92(13)
         BCTR  3,0
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L757
         IC    2,0(5,2)
         CLM   2,1,=XL1'00'
         BE    @@L761
@@L757   EQU   *
         L     4,0(4)
         A     7,=F'1'
         LTR   4,4
         BNE   @@L762
@@L772   EQU   *
         L     4,8(11)
         LTR   4,4
         BE    @@L774
@@L769   EQU   *
         L     2,12(4)
         L     2,12(2)
         LTR   2,2
         BE    @@L765
         L     2,16(2)
         ST    2,88(13)
         A     3,=F'1'
         ST    3,92(13)
         BCTR  3,0
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(STRNCMP)
         BALR  14,15
         LTR   15,15
         BNE   @@L765
         IC    2,0(5,2)
         CLM   2,1,=XL1'00'
         BE    @@L761
@@L765   EQU   *
         L     4,0(4)
         A     7,=F'1'
         LTR   4,4
         BNE   @@L769
@@L774   EQU   *
         MVI   0(6),0
         MVC   88(4,13),=A(@@LC21)
         A     3,=F'1'
         ST    3,92(13)
         BCTR  3,0
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         SLR   7,7
@@L761   EQU   *
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC16)
         ST    7,96(13)
         LA    1,88(,13)
         L     15,=V(SPRINTF)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
         LR    3,15
         CLR   15,6
         BH    @@L776
@@L770   EQU   *
         LR    2,6
         A     2,=F'1'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(STRLEN)
         BALR  14,15
         A     15,=F'1'
         ST    3,88(13)
         ST    2,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(MEMMOVE)
         BALR  14,15
         LR    15,3
         B     @@L753
@@L776   EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2191'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L770
@@L775   EQU   *
         MVC   88(4,13),=A(@@LC20)
         LA    1,88(,13)
         L     15,=V(ERROR)
         BALR  14,15
         ST    3,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(STRCHR)
         BALR  14,15
@@L753   EQU   *
* Function resolve_operand_name_1 epilogue
         PDPEPIL
* Function resolve_operand_name_1 literal pool
         DS    0F
         LTORG
* Function resolve_operand_name_1 page table
         DS    0F
@@PGT33  EQU   *
         DC    A(@@PG33)
         DS    0F
* X-func eestmt prologue
EESTMT   PDPPRLG CINDEX=34,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN34
         LTORG
@@FEN34  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG34   EQU   *
         LR    11,1
         L     10,=A(@@PGT34)
* Function eestmt code
         MVC   88(4,13),0(11)
         MVC   92(4,13),=F'-1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(EESVAL)
         BALR  14,15
* Function eestmt epilogue
         PDPEPIL
* Function eestmt literal pool
         DS    0F
         LTORG
* Function eestmt page table
         DS    0F
@@PGT34  EQU   *
         DC    A(@@PG34)
@@LC22   EQU   *
         DC    C'statement with no effect'
         DC    X'0'
         DS    0F
* X-func eesval prologue
EESVAL   PDPPRLG CINDEX=35,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN35
         LTORG
@@FEN35  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG35   EQU   *
         LR    11,1
         L     10,=A(@@PGT35)
* Function eesval code
         L     4,0(11)
         L     6,4(11)
         L     2,=F'-1'
         CLR   6,2
         BE    @@L798
@@L779   EQU   *
         LTR   6,6
         BNE   @@L781
         L     2,=V(CFUN)
         L     5,0(2)
         L     3,4(5)
         L     2,40(3)
         LTR   2,2
         BE    @@L782
         L     2,8(11)
         LTR   2,2
         BNE   @@L781
@@L782   EQU   *
         L     2,=V(GLOBAL@T)
         CL    4,0(2)
         BE    @@L781
         L     2,8(4)
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         BNE   @@L783
         L     2,=V(EXTRA@WA)
         L     2,0(2)
         LTR   2,2
         BNE   @@L785
         L     2,=V(WU@VAL)
         L     2,0(2)
         LTR   2,2
         BE    @@L781
@@L785   EQU   *
         CLI   8(4),114
         BE    @@L799
@@L786   EQU   *
         MVC   88(4,13),44(3)
         L     2,4(5)
         MVC   92(4,13),48(2)
         MVC   96(4,13),=A(@@LC22)
         LA    1,88(,13)
         L     15,=V(WARNWFL)
         BALR  14,15
@@L781   EQU   *
         LTR   6,6
         BE    @@L789
         L     2,4(4)
         CLI   8(2),23
         BE    @@L800
@@L789   EQU   *
         ST    4,88(13)
         LTR   6,6
         BNE   @@L790
         L     2,=V(CIRTX)
         L     2,256(2)
@@L791   EQU   *
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         LR    3,15
         L     5,4(4)
         LTR   15,15
         BE    @@L792
         LH    2,0(15)
         CLM   2,3,=H'66'
         BE    @@L801
@@L792   EQU   *
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(PRSTSLOT)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(FTEMPSL)
         BALR  14,15
         LTR   6,6
         BE    @@L797
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         ST    3,36(2)
         ST    5,32(2)
         B     @@L797
@@L801   EQU   *
         L     2,8(4)
         SRL   2,20
         N     2,=F'1'
         LTR   2,2
         BE    @@L792
         LH    4,32(5)
         N     4,=F'127'
         LTR   4,4
         BE    @@L792
         LA    2,51(0,0)
         CLR   4,2
         BE    @@L795
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(COPYTREG)
         BALR  14,15
         LR    3,15
         B     @@L792
@@L795   EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),16(5)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    3,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'103'
         ST    15,100(13)
         ST    4,104(13)
         MVC   108(4,13),=F'0'
         ST    2,112(13)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         B     @@L792
@@L790   EQU   *
         SLR   2,2
         B     @@L791
@@L800   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(BUILD@PO)
         BALR  14,15
         MVC   88(4,13),=F'121'
         ST    15,92(13)
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    4,15
         B     @@L789
@@L799   EQU   *
         L     2,4(4)
         CLI   8(2),5
         BNE   @@L786
         B     @@L781
@@L783   EQU   *
         L     2,=V(WU@VAL)
         L     2,0(2)
         LTR   2,2
         BE    @@L781
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(WARN@IF@)
         BALR  14,15
         B     @@L781
@@L798   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,40(2)
         LTR   2,2
         BE    @@L780
         LA    2,1(0,0)
@@L780   EQU   *
         LR    6,2
         B     @@L779
@@L797   EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
* Function eesval epilogue
         PDPEPIL
* Function eesval literal pool
         DS    0F
         LTORG
* Function eesval page table
         DS    0F
@@PGT35  EQU   *
         DC    A(@@PG35)
@@LC23   EQU   *
         DC    C'value computed is not used'
         DC    X'0'
         DS    0F
* X-func warn_if_unused_value prologue
WARN@IF@ PDPPRLG CINDEX=36,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN36
         LTORG
@@FEN36  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG36   EQU   *
         LR    11,1
         L     10,=A(@@PGT36)
* Function warn_if_unused_value code
         L     5,0(11)
@@L820   EQU   *
         L     4,8(5)
         LR    3,4
         SRL   3,15
         N     3,=F'1'
         SLR   6,6
         LTR   3,3
         BNE   @@L802
         L     2,4(5)
         CLI   8(2),5
         BE    @@L849
         LR    3,4
         SRL   3,24
         A     3,=F'-41'
         LA    2,99(0,0)
         CLR   3,2
         BH    @@L841
         MH    3,=H'4'
         L     2,=A(@@L846)
         L     14,0(3,2)
         BR    14
         DS    0F
         DS    0F
         DS    0F
         LTORG
         DS    0F
@@L846   EQU   *
         DC    A(@@L839)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L824)
         DC    A(@@L837)
         DC    A(@@L837)
         DC    A(@@L837)
         DC    A(@@L841)
         DC    A(@@L823)
         DC    A(@@L837)
         DC    A(@@L837)
         DC    A(@@L837)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L823)
         DC    A(@@L823)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L830)
         DC    A(@@L830)
         DC    A(@@L830)
         DC    A(@@L841)
         DC    A(@@L823)
         DC    A(@@L841)
         DC    A(@@L837)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L837)
         DC    A(@@L837)
         DC    A(@@L837)
         DC    A(@@L837)
         DC    A(@@L841)
         DC    A(@@L837)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L841)
         DC    A(@@L837)
@@L823   EQU   *
         L     5,20(5)
         B     @@L820
@@L839   EQU   *
         L     3,16(5)
         L     2,4(3)
         CLI   8(2),15
         BNE   @@L841
         LR    5,3
         B     @@L820
@@L841   EQU   *
         LR    3,4
         SRL   3,24
         L     2,=V(TCODTYPE)
         IC    2,0(2,3)
         CLM   2,1,=XL1'84'
         BE    @@L843
         CLM   2,1,=XL1'99'
         BE    @@L843
@@L842   EQU   *
         LR    3,4
         SRL   3,24
         L     2,=V(TCODTYPE)
         IC    2,0(2,3)
         CLM   2,1,=XL1'85'
         BE    @@L850
@@L838   EQU   *
         L     2,8(5)
         SRL   2,23
         N     2,=F'1'
         SLR   6,6
         LTR   2,2
         BNE   @@L802
         L     2,=V(CFUN)
         L     3,0(2)
         L     2,4(3)
         MVC   88(4,13),44(2)
         L     2,4(3)
         MVC   92(4,13),48(2)
         MVC   96(4,13),=A(@@LC23)
         LA    1,88(,13)
         L     15,=V(WARNWFL)
         BALR  14,15
         LA    6,1(0,0)
         B     @@L802
@@L850   EQU   *
         MH    3,=H'4'
         L     2,=V(TCODLEN)
         L     2,0(3,2)
         LR    6,2
         LTR   2,2
         BE    @@L802
         B     @@L838
@@L843   EQU   *
         LR    2,4
         SRL   2,20
         N     2,=F'1'
         SLR   6,6
         LTR   2,2
         BNE   @@L802
         B     @@L842
@@L824   EQU   *
         SRL   4,13
         N     4,=F'1'
         SLR   6,6
         LTR   4,4
         BNE   @@L802
         MVC   88(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(WARN@IF@)
         BALR  14,15
         LA    6,1(0,0)
         LTR   15,15
         BNE   @@L802
         L     4,20(5)
         L     2,8(4)
         SRL   2,22
         N     2,=F'1'
         LR    6,15
         LR    5,4
         LTR   2,2
         BE    @@L820
         B     @@L802
@@L830   EQU   *
         SRL   4,13
         N     4,=F'1'
         SLR   6,6
         LTR   4,4
         BNE   @@L802
         L     3,16(5)
         IC    4,8(3)
         LA    2,142(,4)
         CLM   2,1,=XL1'01'
         BH    @@L848
@@L835   EQU   *
         L     3,16(3)
         IC    4,8(3)
         LA    2,142(,4)
         CLM   2,1,=XL1'01'
         BNH   @@L835
@@L848   EQU   *
         IC    3,8(3)
         LA    2,208(,3)
         CLM   2,1,=XL1'01'
         BNH   @@L837
         CLM   3,1,=XL1'35'
         BNE   @@L838
@@L837   EQU   *
         SLR   6,6
         B     @@L802
@@L849   EQU   *
         LR    6,3
@@L802   EQU   *
         LR    15,6
* Function warn_if_unused_value epilogue
         PDPEPIL
* Function warn_if_unused_value literal pool
         DS    0F
         LTORG
* Function warn_if_unused_value page table
         DS    0F
@@PGT36  EQU   *
         DC    A(@@PG36)
         DS    0F
* X-func clear_last_expr prologue
CLEAR@LA PDPPRLG CINDEX=37,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN37
         LTORG
@@FEN37  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG37   EQU   *
         LR    11,1
         L     10,=A(@@PGT37)
* Function clear_last_expr code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
* Function clear_last_expr epilogue
         PDPEPIL
* Function clear_last_expr literal pool
         DS    0F
         LTORG
* Function clear_last_expr page table
         DS    0F
@@PGT37  EQU   *
         DC    A(@@PG37)
         DS    0F
* X-func essexpr prologue
ESSEXPR  PDPPRLG CINDEX=38,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN38
         LTORG
@@FEN38  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG38   EQU   *
         LR    11,1
         L     10,=A(@@PGT38)
* Function essexpr code
         MVC   88(4,13),=F'120'
         LA    1,88(,13)
         L     15,=V(MAKE@NOD)
         BALR  14,15
         LR    5,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         L     2,0(11)
         LTR   2,2
         BE    @@L853
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(SSQFRE)
         BALR  14,15
         B     @@L854
@@L853   EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
@@L854   EQU   *
         L     2,=V(CFUN)
         L     4,0(2)
         L     3,8(4)
         L     2,4(3)
         A     2,=F'1'
         ST    2,4(3)
         L     2,4(4)
         L     3,40(2)
         A     3,=F'1'
         ST    3,40(2)
         MVC   36(4,2),=F'0'
         LR    15,5
* Function essexpr epilogue
         PDPEPIL
* Function essexpr literal pool
         DS    0F
         LTORG
* Function essexpr page table
         DS    0F
@@PGT38  EQU   *
         DC    A(@@PG38)
         DS    0F
* X-func eestexpr prologue
EESTEXPR PDPPRLG CINDEX=39,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN39
         LTORG
@@FEN39  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG39   EQU   *
         LR    11,1
         L     10,=A(@@PGT39)
* Function eestexpr code
         L     5,0(11)
         L     2,=V(CFUN)
         L     4,0(2)
         L     3,8(4)
         L     2,4(3)
         BCTR  2,0
         ST    2,4(3)
         L     4,4(4)
         L     15,36(4)
         LTR   15,15
         BE    @@L857
         L     2,32(4)
         LTR   2,2
         BNE   @@L856
@@L857   EQU   *
         L     2,=V(CIRTX)
         MVC   36(4,4),256(2)
         L     2,=V(GLOBAL@T)
         MVC   32(4,4),108(2)
         B     @@L858
@@L856   EQU   *
         LH    3,0(15)
         CLM   3,3,=H'61'
         BE    @@L858
         LR    2,3
         AH    2,=H'-67'
         CLM   2,3,=H'1'
         BNH   @@L858
         CLM   3,3,=H'54'
         BE    @@L858
         CLM   3,3,=H'55'
         BE    @@L858
         CLM   3,3,=H'58'
         BE    @@L858
         CLM   3,3,=H'134'
         BE    @@L858
         CLM   3,3,=H'56'
         BE    @@L858
         CLM   3,3,=H'140'
         BE    @@L858
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         ST    15,36(4)
@@L858   EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         L     4,=V(CFUN)
         L     3,0(4)
         L     2,4(3)
         MVC   4(4,5),32(2)
         L     2,4(3)
         MVC   20(4,5),36(2)
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         ST    15,16(5)
         L     2,0(4)
         MVC   88(4,13),=F'0'
         ST    5,92(13)
         MVC   96(4,13),108(2)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,108(2)
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         OC    8(4,5),=F'8388608'
         L     2,0(4)
         L     2,4(2)
         MVC   88(4,13),36(2)
         LA    1,88(,13)
         L     15,=V(VOLREFP)
         BALR  14,15
         N     15,=F'1'
         SLL   15,20
         L     2,8(5)
         N     2,=F'-1048577'
         OR    2,15
         ST    2,8(5)
         L     2,0(4)
         L     2,4(2)
         MVC   32(4,2),=F'0'
         L     3,40(2)
         BCTR  3,0
         ST    3,40(2)
         LR    15,5
* Function eestexpr epilogue
         PDPEPIL
* Function eestexpr literal pool
         DS    0F
         LTORG
* Function eestexpr page table
         DS    0F
@@PGT39  EQU   *
         DC    A(@@PG39)
         DS    0F
* X-func escond prologue
ESCOND   PDPPRLG CINDEX=40,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN40
         LTORG
@@FEN40  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG40   EQU   *
         LR    11,1
         L     10,=A(@@PGT40)
* Function escond code
         L     6,4(11)
         L     4,=A(STMT@OBS)
         LA    3,68(0,0)
         L     2,16(4)
         S     2,12(4)
         CR    2,3
         BL    @@L866
@@L861   EQU   *
         L     2,12(4)
         A     2,=F'68'
         ST    2,12(4)
         L     5,8(4)
         CR    2,5
         BE    @@L867
@@L862   EQU   *
         L     2,24(4)
         L     3,12(4)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(4)
         L     2,4(4)
         SR    3,2
         L     15,16(4)
         LR    7,15
         SR    7,2
         CR    3,7
         BNH   @@L863
         ST    15,12(4)
@@L863   EQU   *
         MVC   8(4,4),12(4)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   4(4,5),8(2)
         MVC   0(4,5),20(2)
         L     3,24(2)
         A     3,=F'1'
         ST    3,24(2)
         ST    3,8(5)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,20(5)
         LR    15,6
         LTR   6,6
         BE    @@L865
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         B     @@L865
@@L867   EQU   *
         OC    40(4,4),=F'1073741824'
         B     @@L862
@@L866   EQU   *
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(@OSNCHUN)
         BALR  14,15
         B     @@L861
@@L865   EQU   *
         ST    15,12(5)
         ST    15,16(5)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         ST    5,8(2)
         ST    5,20(2)
         MVC   88(4,13),0(11)
         MVC   92(4,13),20(5)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(DO@JUMP)
         BALR  14,15
* Function escond epilogue
         PDPEPIL
* Function escond literal pool
         DS    0F
         LTORG
* Function escond page table
         DS    0F
@@PGT40  EQU   *
         DC    A(@@PG40)
         DS    0F
* X-func eselif prologue
ESELIF   PDPPRLG CINDEX=41,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN41
         LTORG
@@FEN41  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG41   EQU   *
         LR    11,1
         L     10,=A(@@PGT41)
* Function eselif code
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     3,8(2)
         L     2,16(3)
         LTR   2,2
         BNE   @@L869
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,16(3)
@@L869   EQU   *
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),16(2)
         LA    1,88(,13)
         L     15,=A(EMJMP)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,20(2)
         MVC   88(4,13),0(11)
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   92(4,13),20(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(DO@JUMP)
         BALR  14,15
* Function eselif epilogue
         PDPEPIL
* Function eselif literal pool
         DS    0F
         LTORG
* Function eselif page table
         DS    0F
@@PGT41  EQU   *
         DC    A(@@PG41)
         DS    0F
* X-func eselse prologue
ESELSE   PDPPRLG CINDEX=42,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN42
         LTORG
@@FEN42  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG42   EQU   *
         LR    11,1
         L     10,=A(@@PGT42)
* Function eselse code
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     3,8(2)
         L     2,16(3)
         LTR   2,2
         BNE   @@L871
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,16(3)
@@L871   EQU   *
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),16(2)
         LA    1,88(,13)
         L     15,=A(EMJMP)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         L     2,8(2)
         MVC   20(4,2),=F'0'
* Function eselse epilogue
         PDPEPIL
* Function eselse literal pool
         DS    0F
         LTORG
* Function eselse page table
         DS    0F
@@PGT42  EQU   *
         DC    A(@@PG42)
         DS    0F
* X-func eeeeif prologue
EEEEIF   PDPPRLG CINDEX=43,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN43
         LTORG
@@FEN43  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG43   EQU   *
         LR    11,1
         L     10,=A(@@PGT43)
* Function eeeeif code
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,4(2)
         L     2,8(2)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,20(2)
         MVC   88(4,13),0(11)
         L     2,0(3)
         L     2,4(2)
         L     2,8(2)
         MVC   92(4,13),20(2)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(DO@JUMP)
         BALR  14,15
* Function eeeeif epilogue
         PDPEPIL
* Function eeeeif literal pool
         DS    0F
         LTORG
* Function eeeeif page table
         DS    0F
@@PGT43  EQU   *
         DC    A(@@PG43)
         DS    0F
* X-func eecond prologue
EECOND   PDPPRLG CINDEX=44,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN44
         LTORG
@@FEN44  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG44   EQU   *
         LR    11,1
         L     10,=A(@@PGT44)
* Function eecond code
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     3,8(2)
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         L     2,20(3)
         LTR   2,2
         BNE   @@L888
@@L874   EQU   *
         L     2,16(3)
         LTR   2,2
         BNE   @@L889
@@L875   EQU   *
         L     2,0(4)
         L     2,4(2)
         L     5,8(2)
@@L877   EQU   *
         L     2,=V(CFUN)
         L     15,0(2)
         L     3,4(15)
         L     4,20(3)
         L     2,12(3)
         CLR   2,4
         BE    @@L890
@@L880   EQU   *
         L     3,4(15)
         L     2,8(3)
         CLR   2,4
         BE    @@L891
@@L881   EQU   *
         L     3,4(15)
         L     2,0(3)
         CLR   2,4
         BE    @@L892
@@L882   EQU   *
         L     3,4(15)
         L     2,4(3)
         CLR   2,4
         BE    @@L893
@@L883   EQU   *
         L     3,4(15)
         L     2,16(3)
         CLR   2,4
         BE    @@L894
@@L884   EQU   *
         L     2,4(15)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(4)
         L     2,=A(STMT@OBS)
         CL    4,4(2)
         BNH   @@L885
         CL    4,16(2)
         BNL   @@L885
         ST    4,8(2)
         ST    4,12(2)
@@L879   EQU   *
         CLR   4,5
         BNE   @@L877
         B     @@L895
@@L885   EQU   *
         MVC   88(4,13),=A(STMT@OBS)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(OBSTACK@)
         BALR  14,15
         B     @@L879
@@L894   EQU   *
         MVC   16(4,3),4(4)
         B     @@L884
@@L893   EQU   *
         MVC   4(4,3),4(4)
         B     @@L883
@@L892   EQU   *
         MVC   0(4,3),4(4)
         B     @@L882
@@L891   EQU   *
         MVC   8(4,3),4(4)
         B     @@L881
@@L890   EQU   *
         MVC   12(4,3),4(4)
         B     @@L880
@@L889   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         B     @@L875
@@L888   EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         B     @@L874
@@L895   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
* Function eecond epilogue
         PDPEPIL
* Function eecond literal pool
         DS    0F
         LTORG
* Function eecond page table
         DS    0F
@@PGT44  EQU   *
         DC    A(@@PG44)
         DS    0F
* X-func estloop prologue
ESTLOOP  PDPPRLG CINDEX=45,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN45
         LTORG
@@FEN45  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG45   EQU   *
         LR    11,1
         L     10,=A(@@PGT45)
* Function estloop code
         L     6,0(11)
         L     4,=A(STMT@OBS)
         LA    3,68(0,0)
         L     2,16(4)
         S     2,12(4)
         CR    2,3
         BL    @@L902
@@L897   EQU   *
         L     2,12(4)
         A     2,=F'68'
         ST    2,12(4)
         L     5,8(4)
         CR    2,5
         BE    @@L903
@@L898   EQU   *
         L     2,24(4)
         L     3,12(4)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(4)
         L     2,4(4)
         SR    3,2
         L     15,16(4)
         LR    7,15
         SR    7,2
         CR    3,7
         BNH   @@L899
         ST    15,12(4)
@@L899   EQU   *
         MVC   8(4,4),12(4)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   4(4,5),12(2)
         MVC   0(4,5),20(2)
         L     3,24(2)
         A     3,=F'1'
         ST    3,24(2)
         ST    3,8(5)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,16(5)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,20(5)
         MVC   24(4,5),=F'0'
         MVC   28(4,5),16(5)
         LTR   6,6
         BNE   @@L901
         LR    15,6
         B     @@L901
@@L903   EQU   *
         OC    40(4,4),=F'1073741824'
         B     @@L898
@@L902   EQU   *
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(@OSNCHUN)
         BALR  14,15
         B     @@L897
@@L901   EQU   *
         ST    15,12(5)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         ST    5,12(2)
         ST    5,20(2)
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-96'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         MVC   88(4,13),16(5)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         LR    15,5
* Function estloop epilogue
         PDPEPIL
* Function estloop literal pool
         DS    0F
         LTORG
* Function estloop page table
         DS    0F
@@PGT45  EQU   *
         DC    A(@@PG45)
         DS    0F
* X-func esloce prologue
ESLOCE   PDPPRLG CINDEX=46,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN46
         LTORG
@@FEN46  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG46   EQU   *
         LR    11,1
         L     10,=A(@@PGT46)
* Function esloce code
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(ESTLOOP)
         BALR  14,15
         LR    3,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,12(2)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,28(2)
         LR    15,3
* Function esloce epilogue
         PDPEPIL
* Function esloce literal pool
         DS    0F
         LTORG
* Function esloce page table
         DS    0F
@@PGT46  EQU   *
         DC    A(@@PG46)
         DS    0F
* X-func esnuloop prologue
ESNULOOP PDPPRLG CINDEX=47,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN47
         LTORG
@@FEN47  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG47   EQU   *
         LR    11,1
         L     10,=A(@@PGT47)
* Function esnuloop code
         L     4,=A(STMT@OBS)
         LA    3,68(0,0)
         L     2,16(4)
         S     2,12(4)
         CR    2,3
         BL    @@L909
@@L906   EQU   *
         L     2,12(4)
         A     2,=F'68'
         ST    2,12(4)
         L     5,8(4)
         CR    2,5
         BE    @@L910
@@L907   EQU   *
         L     2,24(4)
         L     3,12(4)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(4)
         L     2,4(4)
         SR    3,2
         L     15,16(4)
         LR    6,15
         SR    6,2
         CR    3,6
         BNH   @@L908
         ST    15,12(4)
         B     @@L908
@@L910   EQU   *
         OC    40(4,4),=F'1073741824'
         B     @@L907
@@L909   EQU   *
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(@OSNCHUN)
         BALR  14,15
         B     @@L906
@@L908   EQU   *
         MVC   8(4,4),12(4)
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         MVC   4(4,5),12(2)
         MVC   0(4,5),20(2)
         L     3,24(2)
         A     3,=F'1'
         ST    3,24(2)
         ST    3,8(5)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         ST    15,16(5)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,20(5)
         MVC   24(4,5),=F'0'
         ST    15,28(5)
         ST    15,12(5)
         L     2,0(4)
         L     2,4(2)
         ST    5,12(2)
         ST    5,20(2)
         LR    15,5
* Function esnuloop epilogue
         PDPEPIL
* Function esnuloop literal pool
         DS    0F
         LTORG
* Function esnuloop page table
         DS    0F
@@PGT47  EQU   *
         DC    A(@@PG47)
         DS    0F
* X-func explconth prologue
EXPLCONT PDPPRLG CINDEX=48,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN48
         LTORG
@@FEN48  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG48   EQU   *
         LR    11,1
         L     10,=A(@@PGT48)
* Function explconth code
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-94'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,12(2)
         MVC   88(4,13),28(2)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
* Function explconth epilogue
         PDPEPIL
* Function explconth literal pool
         DS    0F
         LTORG
* Function explconth page table
         DS    0F
@@PGT48  EQU   *
         DC    A(@@PG48)
         DS    0F
* X-func exeloop prologue
EXELOOP  PDPPRLG CINDEX=49,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN49
         LTORG
@@FEN49  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG49   EQU   *
         LR    11,1
         L     10,=A(@@PGT49)
* Function exeloop code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,12(2)
         L     6,16(2)
         CL    6,28(2)
         BE    @@L960
@@L913   EQU   *
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         SLR   8,8
         LR    3,8
         LR    5,6
         LTR   6,6
         BE    @@L915
@@L931   EQU   *
         LH    2,0(5)
         CLM   2,3,=H'37'
         BE    @@L961
@@L916   EQU   *
         L     5,12(5)
         LTR   5,5
         BNE   @@L931
@@L915   EQU   *
         LTR   5,5
         BE    @@L932
         L     2,=V(OPTZE)
         L     2,0(2)
         LTR   2,2
         BE    @@L932
         LTR   3,3
         BNE   @@L932
         LTR   8,8
         BE    @@L933
         LA    3,1(0,0)
         CR    2,3
         BNH   @@L932
@@L933   EQU   *
         L     2,12(5)
         LTR   2,2
         BNE   @@L962
@@L932   EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(EMJMP)
         BALR  14,15
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-95'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,4(2)
         L     2,12(2)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         L     2,0(3)
         L     2,4(2)
         L     5,12(2)
@@L946   EQU   *
         L     2,=V(CFUN)
         L     15,0(2)
         L     3,4(15)
         L     4,20(3)
         L     2,12(3)
         CLR   2,4
         BE    @@L963
@@L949   EQU   *
         L     3,4(15)
         L     2,8(3)
         CLR   2,4
         BE    @@L964
@@L950   EQU   *
         L     3,4(15)
         L     2,0(3)
         CLR   2,4
         BE    @@L965
@@L951   EQU   *
         L     3,4(15)
         L     2,4(3)
         CLR   2,4
         BE    @@L966
@@L952   EQU   *
         L     3,4(15)
         L     2,16(3)
         CLR   2,4
         BE    @@L967
@@L953   EQU   *
         L     2,4(15)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(4)
         L     2,=A(STMT@OBS)
         CL    4,4(2)
         BNH   @@L954
         CL    4,16(2)
         BNL   @@L954
         ST    4,8(2)
         ST    4,12(2)
@@L948   EQU   *
         CLR   4,5
         BNE   @@L946
         B     @@L968
@@L954   EQU   *
         MVC   88(4,13),=A(STMT@OBS)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(OBSTACK@)
         BALR  14,15
         B     @@L948
@@L967   EQU   *
         MVC   16(4,3),4(4)
         B     @@L953
@@L966   EQU   *
         MVC   4(4,3),4(4)
         B     @@L952
@@L965   EQU   *
         MVC   0(4,3),4(4)
         B     @@L951
@@L964   EQU   *
         MVC   8(4,3),4(4)
         B     @@L950
@@L963   EQU   *
         MVC   12(4,3),4(4)
         B     @@L949
@@L962   EQU   *
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(ANY@COND)
         BALR  14,15
         LTR   15,15
         BNE   @@L932
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    7,15
         LR    4,6
         L     3,8(6)
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L969
@@L934   EQU   *
         ST    7,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(EMLABB)
         BALR  14,15
         LTR   8,8
         BE    @@L970
         LR    3,4
         LTR   4,4
         BE    @@L936
@@L944   EQU   *
         SLR   4,4
         CLR   3,5
         BE    @@L942
         L     4,12(3)
@@L942   EQU   *
         LH    2,0(3)
         CLM   2,3,=H'37'
         BE    @@L971
@@L943   EQU   *
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         ST    3,88(13)
         ST    3,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(REOINSNS)
         BALR  14,15
@@L939   EQU   *
         LR    3,4
         LTR   4,4
         BNE   @@L944
@@L936   EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@JUMP)
         BALR  14,15
         ST    15,88(13)
         ST    7,92(13)
         LA    1,88(,13)
         L     15,=V(EMJIB)
         BALR  14,15
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(EMBBEF)
         BALR  14,15
         LR    6,7
         B     @@L932
@@L971   EQU   *
         L     2,20(3)
         A     2,=F'98'
         LA    8,1(0,0)
         CLR   2,8
         BNH   @@L939
         B     @@L943
@@L970   EQU   *
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         ST    4,88(13)
         ST    5,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(REOINSNS)
         BALR  14,15
         B     @@L936
@@L969   EQU   *
         L     2,20(3)
         L     9,=F'-94'
         CLR   2,9
         BNE   @@L934
         LR    4,3
         B     @@L934
@@L961   EQU   *
         L     2,20(5)
         L     4,=F'-92'
         CLR   2,4
         BE    @@L915
         L     9,=F'-96'
         CLR   2,9
         BE    @@L959
         A     4,=F'6'
         CLR   2,4
         BE    @@L972
         L     9,=F'-85'
         CLR   2,9
         BE    @@L973
         L     4,=F'-98'
         CLR   2,4
         BE    @@L974
         L     9,=F'-97'
         CLR   2,9
         BNE   @@L916
         BCTR  8,0
         B     @@L916
@@L974   EQU   *
         A     8,=F'1'
         B     @@L916
@@L973   EQU   *
         BCTR  3,0
         LTR   3,3
         BNL   @@L916
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'2740'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L916
@@L972   EQU   *
         A     3,=F'1'
         B     @@L916
@@L959   EQU   *
         SLR   5,5
         B     @@L915
@@L960   EQU   *
         MVC   88(4,13),=F'-94'
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(EMNOTB)
         BALR  14,15
         B     @@L913
@@L968   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
* Function exeloop epilogue
         PDPEPIL
* Function exeloop literal pool
         DS    0F
         LTORG
* Function exeloop page table
         DS    0F
@@PGT49  EQU   *
         DC    A(@@PG49)
         DS    0F
* X-func eenullloop prologue
EENULLLO PDPPRLG CINDEX=50,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN50
         LTORG
@@FEN50  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG50   EQU   *
         LR    11,1
         L     10,=A(@@PGT50)
* Function eenullloop code
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,4(2)
         L     2,12(2)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         L     2,0(3)
         L     2,4(2)
         L     5,12(2)
@@L977   EQU   *
         L     2,=V(CFUN)
         L     15,0(2)
         L     3,4(15)
         L     4,20(3)
         L     2,12(3)
         CLR   2,4
         BE    @@L988
@@L980   EQU   *
         L     3,4(15)
         L     2,8(3)
         CLR   2,4
         BE    @@L989
@@L981   EQU   *
         L     3,4(15)
         L     2,0(3)
         CLR   2,4
         BE    @@L990
@@L982   EQU   *
         L     3,4(15)
         L     2,4(3)
         CLR   2,4
         BE    @@L991
@@L983   EQU   *
         L     3,4(15)
         L     2,16(3)
         CLR   2,4
         BE    @@L992
@@L984   EQU   *
         L     2,4(15)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(4)
         L     2,=A(STMT@OBS)
         CL    4,4(2)
         BNH   @@L985
         CL    4,16(2)
         BNL   @@L985
         ST    4,8(2)
         ST    4,12(2)
@@L979   EQU   *
         CLR   4,5
         BNE   @@L977
         B     @@L993
@@L985   EQU   *
         MVC   88(4,13),=A(STMT@OBS)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(OBSTACK@)
         BALR  14,15
         B     @@L979
@@L992   EQU   *
         MVC   16(4,3),4(4)
         B     @@L984
@@L991   EQU   *
         MVC   4(4,3),4(4)
         B     @@L983
@@L990   EQU   *
         MVC   0(4,3),4(4)
         B     @@L982
@@L989   EQU   *
         MVC   8(4,3),4(4)
         B     @@L981
@@L988   EQU   *
         MVC   12(4,3),4(4)
         B     @@L980
@@L993   EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
* Function eenullloop epilogue
         PDPEPIL
* Function eenullloop literal pool
         DS    0F
         LTORG
* Function eenullloop page table
         DS    0F
@@PGT50  EQU   *
         DC    A(@@PG50)
         DS    0F
* X-func expcoloop prologue
EXPCOLOO PDPPRLG CINDEX=51,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN51
         LTORG
@@FEN51  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG51   EQU   *
         LR    11,1
         L     10,=A(@@PGT51)
* Function expcoloop code
         L     3,0(11)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
         LTR   3,3
         BE    @@L997
@@L995   EQU   *
         LR    15,3
         LTR   3,3
         BE    @@L994
         MVC   88(4,13),=F'0'
         MVC   92(4,13),28(3)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
         LA    15,1(0,0)
         B     @@L994
@@L997   EQU   *
         L     3,12(2)
         B     @@L995
@@L994   EQU   *
* Function expcoloop epilogue
         PDPEPIL
* Function expcoloop literal pool
         DS    0F
         LTORG
* Function expcoloop page table
         DS    0F
@@PGT51  EQU   *
         DC    A(@@PG51)
         DS    0F
* X-func eeloop prologue
EELOOP   PDPPRLG CINDEX=52,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN52
         LTORG
@@FEN52  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG52   EQU   *
         LR    11,1
         L     10,=A(@@PGT52)
* Function eeloop code
         L     3,0(11)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
         LTR   3,3
         BE    @@L1001
@@L999   EQU   *
         LR    15,3
         LTR   3,3
         BE    @@L998
         MVC   88(4,13),=F'0'
         MVC   92(4,13),20(3)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
         LA    15,1(0,0)
         B     @@L998
@@L1001  EQU   *
         L     3,12(2)
         B     @@L999
@@L998   EQU   *
* Function eeloop epilogue
         PDPEPIL
* Function eeloop literal pool
         DS    0F
         LTORG
* Function eeloop page table
         DS    0F
@@PGT52  EQU   *
         DC    A(@@PG52)
         DS    0F
* X-func eelopif prologue
EELOPIF  PDPPRLG CINDEX=53,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN53
         LTORG
@@FEN53  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG53   EQU   *
         LR    11,1
         L     10,=A(@@PGT53)
* Function eelopif code
         L     3,0(11)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    4,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
         LTR   3,3
         BE    @@L1006
@@L1003  EQU   *
         LR    15,3
         LTR   3,3
         BE    @@L1002
         MVC   88(4,13),4(11)
         MVC   92(4,13),=F'0'
         ST    4,96(13)
         LA    1,88(,13)
         L     15,=V(DO@JUMP)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'36'
         BE    @@L1007
@@L1005  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),20(3)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         LA    15,1(0,0)
         B     @@L1002
@@L1007  EQU   *
         ST    15,24(3)
         B     @@L1005
@@L1006  EQU   *
         L     3,12(2)
         B     @@L1003
@@L1002  EQU   *
* Function eelopif epilogue
         PDPEPIL
* Function eelopif literal pool
         DS    0F
         LTORG
* Function eelopif page table
         DS    0F
@@PGT53  EQU   *
         DC    A(@@PG53)
         DS    0F
* X-func eeloptc prologue
EELOPTC  PDPPRLG CINDEX=54,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN54
         LTORG
@@FEN54  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG54   EQU   *
         LR    11,1
         L     10,=A(@@PGT54)
* Function eeloptc code
         MVC   88(4,13),0(11)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(EELOPIF)
         BALR  14,15
         LTR   15,15
         BE    @@L1008
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-92'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         LA    15,1(0,0)
@@L1008  EQU   *
* Function eeloptc epilogue
         PDPEPIL
* Function eeloptc literal pool
         DS    0F
         LTORG
* Function eeloptc page table
         DS    0F
@@PGT54  EQU   *
         DC    A(@@PG54)
         DS    0F
* X-func stmt_loop_nest_empty prologue
STMT@LOO PDPPRLG CINDEX=55,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN55
         LTORG
@@FEN55  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG55   EQU   *
         LR    11,1
         L     10,=A(@@PGT55)
* Function stmt_loop_nest_empty code
         SLR   15,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         LTR   2,2
         BE    @@L1012
         L     2,12(2)
         LTR   2,2
         BNE   @@L1011
@@L1012  EQU   *
         LA    15,1(0,0)
@@L1011  EQU   *
* Function stmt_loop_nest_empty epilogue
         PDPEPIL
* Function stmt_loop_nest_empty literal pool
         DS    0F
         LTORG
* Function stmt_loop_nest_empty page table
         DS    0F
@@PGT55  EQU   *
         DC    A(@@PG55)
         DS    0F
* X-func preserve_subexpressions_p prologue
PRESERVE PDPPRLG CINDEX=56,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN56
         LTORG
@@FEN56  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG56   EQU   *
         LR    11,1
         L     10,=A(@@PGT56)
* Function preserve_subexpressions_p code
         L     2,=V(FLAG@EXP)
         L     3,0(2)
         LA    15,1(0,0)
         LTR   3,3
         BNE   @@L1013
         L     2,=V(OPTZE)
         L     2,0(2)
         LTR   2,2
         BE    @@L1016
         L     4,=V(CFUN)
         L     2,0(4)
         LTR   2,2
         BE    @@L1016
         L     2,4(2)
         LTR   2,2
         BE    @@L1016
         L     2,12(2)
         LTR   2,2
         BNE   @@L1015
@@L1016  EQU   *
         SLR   15,15
         B     @@L1013
@@L1015  EQU   *
         LA    1,88(,13)
         L     15,=V(GLIANY)
         BALR  14,15
         LR    5,3
         LTR   15,15
         BE    @@L1017
         L     2,0(4)
         L     2,4(2)
         L     2,12(2)
         L     2,16(2)
         L     4,4(15)
         S     4,4(2)
         L     3,=V(N@NON@FI)
         L     2,0(3)
         SLL   2,1
         A     2,0(3)
         CR    4,2
         BNL   @@L1017
         LA    5,1(0,0)
@@L1017  EQU   *
         LR    15,5
@@L1013  EQU   *
* Function preserve_subexpressions_p epilogue
         PDPEPIL
* Function preserve_subexpressions_p literal pool
         DS    0F
         LTORG
* Function preserve_subexpressions_p page table
         DS    0F
@@PGT56  EQU   *
         DC    A(@@PG56)
         DS    0F
* X-func eesome prologue
EESOME   PDPPRLG CINDEX=57,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN57
         LTORG
@@FEN57  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG57   EQU   *
         LR    11,1
         L     10,=A(@@PGT57)
* Function eesome code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   32(4,2),=F'0'
         L     15,20(2)
         LTR   15,15
         BE    @@L1026
@@L1024  EQU   *
         L     2,12(15)
         LTR   2,2
         BNE   @@L1027
         L     15,0(15)
         LTR   15,15
         BNE   @@L1024
@@L1026  EQU   *
         SLR   15,15
         B     @@L1018
@@L1027  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),12(15)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
         LA    15,1(0,0)
@@L1018  EQU   *
* Function eesome epilogue
         PDPEPIL
* Function eesome literal pool
         DS    0F
         LTORG
* Function eesome page table
         DS    0F
@@PGT57  EQU   *
         DC    A(@@PG57)
         DS    0F
* X-func expand_null_return prologue
EXPAND@N PDPPRLG CINDEX=58,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN58
         LTORG
@@FEN58  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG58   EQU   *
         LR    11,1
         L     10,=A(@@PGT58)
* Function expand_null_return code
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(CLOBBER@)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=A(@@17)
         BALR  14,15
* Function expand_null_return epilogue
         PDPEPIL
* Function expand_null_return literal pool
         DS    0F
         LTORG
* Function expand_null_return page table
         DS    0F
@@PGT58  EQU   *
         DC    A(@@PG58)
         DS    0F
* S-func expand_value_return prologue
@@18     PDPPRLG CINDEX=59,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN59
         LTORG
@@FEN59  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG59   EQU   *
         LR    11,1
         L     10,=A(@@PGT59)
* Function expand_value_return code
         L     5,0(11)
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LR    6,15
         L     4,=V(CF@DECL)
         L     2,0(4)
         L     2,56(2)
         L     3,80(2)
         LTR   3,3
         BE    @@L1034
@@L1030  EQU   *
         CLR   3,5
         BE    @@L1031
         L     2,0(4)
         L     2,56(2)
         L     15,4(2)
         LH    2,0(3)
         CLM   2,3,=H'39'
         BE    @@L1035
         ST    3,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         B     @@L1031
@@L1035  EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(INT@SIZE)
         BALR  14,15
         ST    3,88(13)
         ST    5,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(EMGRLD)
         BALR  14,15
         B     @@L1031
@@L1034  EQU   *
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,0(4)
         L     2,56(2)
         L     3,80(2)
         B     @@L1030
@@L1031  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(@@17)
         BALR  14,15
* Function expand_value_return epilogue
         PDPEPIL
* Function expand_value_return literal pool
         DS    0F
         LTORG
* Function expand_value_return page table
         DS    0F
@@PGT59  EQU   *
         DC    A(@@PG59)
         DS    0F
* S-func expand_null_return_1 prologue
@@17     PDPPRLG CINDEX=60,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN60
         LTORG
@@FEN60  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG60   EQU   *
         LR    11,1
         L     10,=A(@@PGT60)
* Function expand_null_return_1 code
         L     4,=V(CFUN)
         L     2,0(4)
         L     3,92(2)
         LTR   3,3
         BE    @@L1039
@@L1037  EQU   *
         LA    1,88(,13)
         L     15,=V(CLEAR@PE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         L     4,0(4)
         L     2,4(4)
         MVC   32(4,2),=F'0'
         LTR   3,3
         BNE   @@L1038
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,96(4)
         LR    3,15
         B     @@L1038
@@L1039  EQU   *
         L     3,96(2)
         B     @@L1037
@@L1038  EQU   *
         MVC   88(4,13),=F'0'
         ST    3,92(13)
         MVC   96(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
* Function expand_null_return_1 epilogue
         PDPEPIL
* Function expand_null_return_1 literal pool
         DS    0F
         LTORG
* Function expand_null_return_1 page table
         DS    0F
@@PGT60  EQU   *
         DC    A(@@PG60)
         DS    0F
* X-func expand_return prologue
EXPAND@R PDPPRLG CINDEX=61,FRAME=152,BASER=12,ENTRY=YES
         B     @@FEN61
         LTORG
@@FEN61  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG61   EQU   *
         LR    11,1
         L     10,=A(@@PGT61)
* Function expand_return code
         L     4,0(11)
         SLR   3,3
         L     2,=V(CF@DECL)
         L     2,0(2)
         L     2,4(2)
         L     2,4(2)
         CLI   8(2),5
         L     14,=A(@@L1093)
         BER   14
         L     2,=V(GLOBAL@T)
         CL    4,0(2)
         L     14,=A(@@L1092)
         BER   14
         IC    2,8(4)
         LR    6,4
         CLM   2,1,=XL1'24'
         BE    @@L1043
         LA    2,208(,2)
         CLM   2,1,=XL1'01'
         BH    @@L1046
         L     2,16(4)
         CLI   8(2),36
         L     14,=A(@@L1094)
         BER   14
@@L1046  EQU   *
         L     2,4(4)
         CLI   8(2),5
         L     14,=A(@@L1095)
         BER   14
         SLR   6,6
@@L1043  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         L     2,=V(OPTZE)
         L     2,0(2)
         LTR   2,2
         BE    @@L1050
         LTR   6,6
         BE    @@L1050
         L     2,=V(CFUN)
         L     2,0(2)
         L     3,128(2)
         LTR   3,3
         BNE   @@L1050
         CLI   8(6),51
         L     14,=A(@@L1096)
         BER   14
@@L1050  EQU   *
         L     12,0(,10)
         L     3,=V(CF@DECL)
         L     2,0(3)
         L     2,56(2)
         L     8,80(2)
         LTR   8,8
         L     14,=A(@@L1097)
         BER   14
@@L1053  EQU   *
         L     12,0(,10)
         LTR   6,6
         BE    @@L1054
         L     3,4(6)
         LH    2,32(3)
         N     2,=F'127'
         LA    5,51(0,0)
         CLR   2,5
         BE    @@L1098
@@L1054  EQU   *
         LTR   6,6
         BE    @@L1082
         L     2,4(6)
         CLI   8(2),5
         BE    @@L1082
         LH    2,0(8)
         CLM   2,3,=H'61'
         BE    @@L1083
         CLM   2,3,=H'39'
         BE    @@L1083
@@L1082  EQU   *
         ST    4,88(13)
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         ST    8,88(13)
@@L1091  EQU   *
         LA    1,88(,13)
         L     15,=A(@@18)
         BALR  14,15
         L     14,=A(@@L1040)
         BR    14
@@L1083  EQU   *
         L     2,=V(CF@DECL)
         L     2,0(2)
         L     2,56(2)
         L     5,4(2)
         ST    5,88(13)
         L     2,8(5)
         SRL   2,19
         LR    3,2
         SRL   3,0
         N     3,=F'2'
         LR    4,2
         N     4,=F'1'
         OR    4,3
         L     2,32(5)
         SRL   2,8
         N     2,=F'4'
         OR    4,2
         SLR   3,3
         CLI   8(5),20
         BE    @@L1099
@@L1084  EQU   *
         MH    3,=H'8'
         OR    4,3
         O     4,=F'1'
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(BUILD@QU)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSIGN@T)
         BALR  14,15
         ST    6,88(13)
         ST    15,92(13)
         SLR   2,2
         IC    2,2(15)
         ST    2,96(13)
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FORCE@NO)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         ST    3,88(13)
         B     @@L1091
@@L1099  EQU   *
         L     2,4(5)
         LTR   2,2
         BE    @@L1084
         LA    3,1(0,0)
         B     @@L1084
@@L1098  EQU   *
         LH    2,0(8)
         CLM   2,3,=H'61'
         BNE   @@L1054
         MVC   120(4,13),=F'0'
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(INT@SIZE)
         BALR  14,15
         LR    4,15
         A     4,=F'3'
         LR    2,4
         SRL   2,2
         ST    2,124(13)
         A     4,=F'-3'
         L     2,4(6)
         L     7,36(2)
         LA    3,32(0,0)
         CLR   7,3
         BNH   @@L1055
         LR    7,3
@@L1055  EQU   *
         L     2,124(13)
         MH    2,=H'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         ST    15,128(13)
         L     5,120(13)
         ST    5,132(13)
         ST    6,88(13)
         ST    5,92(13)
         ST    5,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    15,136(13)
         LTR   4,4
         BE    @@L1092
         LR    2,4
         N     2,=F'3'
         LTR   2,2
         BE    @@L1057
         MH    2,=H'8'
         LA    3,32(0,0)
         SR    3,2
         ST    3,120(13)
@@L1057  EQU   *
         LR    9,5
         L     6,120(13)
         LR    2,4
         MH    2,=H'8'
         ST    2,144(13)
         CLR   5,2
         BNL   @@L1087
@@L1065  EQU   *
         LR    3,6
         N     3,=F'31'
         ST    3,140(13)
         LTR   3,3
         BE    @@L1063
         CL    6,120(13)
         BE    @@L1063
@@L1062  EQU   *
         LR    3,9
         N     3,=F'31'
         LTR   3,3
         BE    @@L1100
@@L1064  EQU   *
         MVC   88(4,13),132(13)
         ST    7,92(13)
         ST    3,96(13)
         MVC   100(4,13),=F'1'
         MVC   104(4,13),=F'0'
         L     2,=V(WORD@MOD)
         MVC   108(4,13),0(2)
         MVC   112(4,13),0(2)
         MVC   116(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(EXTBFIEL)
         BALR  14,15
         ST    5,88(13)
         ST    7,92(13)
         MVC   96(4,13),140(13)
         MVC   100(4,13),0(2)
         ST    15,104(13)
         MVC   108(4,13),=F'32'
         LA    1,88(,13)
         L     15,=V(STORE@BI)
         BALR  14,15
         AR    9,7
         AR    6,7
         CL    9,144(13)
         BL    @@L1065
@@L1087  EQU   *
         L     2,=V(CLASS@NA)
         L     5,4(2)
         LTR   5,5
         BE    @@L1067
@@L1071  EQU   *
         L     2,=V(MODE@SIZ)
         SLR   3,3
         IC    3,0(2,5)
         CLR   3,4
         BNL   @@L1067
         L     2,=V(MODE@WID)
         SLR   3,3
         IC    3,0(2,5)
         LR    5,3
         LTR   3,3
         BNE   @@L1071
@@L1067  EQU   *
         LTR   5,5
         BE    @@L1101
@@L1072  EQU   *
         STC   5,2(8)
         L     4,=V(MODE@SIZ)
         L     2,=V(WORD@MOD)
         L     2,0(2)
         IC    3,0(4,5)
         IC    4,0(4,2)
         STC   4,80(,13)
         CLM   3,1,80(13)
         BL    @@L1074
         LR    2,5
@@L1074  EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    4,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         SLR   6,6
         C     6,124(13)
         BNL   @@L1090
         L     3,128(13)
@@L1079  EQU   *
         ST    4,88(13)
         ST    6,92(13)
         MVC   96(4,13),=F'0'
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(OPSUBW)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         A     3,=F'4'
         A     6,=F'1'
         C     6,124(13)
         BL    @@L1079
@@L1090  EQU   *
         CLR   5,2
         BE    @@L1080
         ST    5,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(GEN@LOWP)
         BALR  14,15
         LR    4,15
@@L1080  EQU   *
         ST    4,88(13)
         B     @@L1091
@@L1101  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3209'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L1072
@@L1100  EQU   *
         MVC   88(4,13),136(13)
         LR    2,9
         SRL   2,5
         ST    2,92(13)
         MVC   96(4,13),=F'51'
         LA    1,88(,13)
         L     15,=V(OPSUBWF)
         BALR  14,15
         ST    15,132(13)
         B     @@L1064
@@L1063  EQU   *
         L     2,=V(WORD@MOD)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    5,15
         LR    2,6
         SRL   2,5
         MH    2,=H'4'
         L     3,128(13)
         ST    15,0(2,3)
         ST    15,88(13)
         SLR   2,2
         IC    2,2(15)
         MH    2,=H'4'
         L     3,=V(CONST@TI)
         L     2,0(2,3)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         B     @@L1062
@@L1092  EQU   *
         LA    1,88(,13)
         L     15,=A(EXPAND@N)
         BALR  14,15
         B     @@L1040
@@L1097  EQU   *
         ST    2,88(13)
         ST    8,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,0(3)
         L     2,56(2)
         L     8,80(2)
         B     @@L1053
@@L1096  EQU   *
         L     2,20(6)
         CLI   8(2),53
         BE    @@L1051
         L     2,24(6)
         CLI   8(2),53
         BNE   @@L1050
@@L1051  EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),16(6)
         ST    15,92(13)
         ST    3,96(13)
         LA    1,88(,13)
         L     15,=V(DO@JUMP)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(START@CL)
         BALR  14,15
         MVC   88(4,13),=F'48'
         L     4,=V(CF@DECL)
         L     3,0(4)
         L     2,4(3)
         MVC   92(4,13),4(2)
         MVC   96(4,13),56(3)
         MVC   100(4,13),20(6)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         OC    8(4,15),=F'8388608'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(EXPAND@R)
         BALR  14,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         MVC   88(4,13),=F'48'
         L     3,0(4)
         L     2,4(3)
         MVC   92(4,13),4(2)
         MVC   96(4,13),56(3)
         MVC   100(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         OC    8(4,15),=F'8388608'
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(EXPAND@R)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(END@CLEA)
         BALR  14,15
         B     @@L1040
@@L1095  EQU   *
         LR    6,4
         B     @@L1043
@@L1094  EQU   *
         L     6,20(4)
         B     @@L1043
@@L1093  EQU   *
         ST    4,88(13)
         ST    3,92(13)
         ST    3,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         B     @@L1092
@@L1040  EQU   *
* Function expand_return epilogue
         PDPEPIL
* Function expand_return literal pool
         DS    0F
         LTORG
* Function expand_return page table
         DS    0F
@@PGT61  EQU   *
         DC    A(@@PG61)
         DS    0F
* X-func drop_through_at_end_p prologue
DROP@THR PDPPRLG CINDEX=62,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN62
         LTORG
@@FEN62  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG62   EQU   *
         LR    11,1
         L     10,=A(@@PGT62)
* Function drop_through_at_end_p code
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LTR   15,15
         BE    @@L1104
         LH    2,0(15)
         CLM   2,3,=H'37'
         BE    @@L1107
@@L1104  EQU   *
         SLR   3,3
         LTR   15,15
         BE    @@L1108
         LH    2,0(15)
         CLM   2,3,=H'35'
         BE    @@L1108
         LA    3,1(0,0)
         B     @@L1108
@@L1107  EQU   *
         L     15,8(15)
         LTR   15,15
         BE    @@L1104
         LH    2,0(15)
         CLM   2,3,=H'37'
         BE    @@L1107
         B     @@L1104
@@L1108  EQU   *
         LR    15,3
* Function drop_through_at_end_p epilogue
         PDPEPIL
* Function drop_through_at_end_p literal pool
         DS    0F
         LTORG
* Function drop_through_at_end_p page table
         DS    0F
@@PGT62  EQU   *
         DC    A(@@PG62)
         DS    0F
* X-func opttrecurs prologue
OPTTRECU PDPPRLG CINDEX=63,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN63
         LTORG
@@FEN63  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG63   EQU   *
         LR    11,1
         L     10,=A(@@PGT63)
* Function opttrecurs code
         MVC   88(4,13),0(11)
         L     2,=V(CF@DECL)
         L     2,0(2)
         MVC   92(4,13),52(2)
         LA    1,88(,13)
         L     15,=A(@@19)
         BALR  14,15
         LTR   15,15
         BE    @@L1110
         L     4,=V(CFUN)
         L     3,0(4)
         L     2,112(3)
         LTR   2,2
         BE    @@L1113
@@L1112  EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         MVC   88(4,13),=F'0'
         L     2,0(4)
         MVC   92(4,13),112(2)
         MVC   96(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(@@7)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMBAR)
         BALR  14,15
         LA    15,1(0,0)
         B     @@L1110
@@L1113  EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,112(3)
         L     2,0(4)
         MVC   88(4,13),112(2)
         MVC   92(4,13),116(2)
         LA    1,88(,13)
         L     15,=V(EMLABA)
         BALR  14,15
         B     @@L1112
@@L1110  EQU   *
* Function opttrecurs epilogue
         PDPEPIL
* Function opttrecurs literal pool
         DS    0F
         LTORG
* Function opttrecurs page table
         DS    0F
@@PGT63  EQU   *
         DC    A(@@PG63)
         DS    0F
* S-func tail_recursion_args prologue
@@19     PDPPRLG CINDEX=64,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN64
         LTORG
@@FEN64  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG64   EQU   *
         LR    11,1
         L     10,=A(@@PGT64)
* Function tail_recursion_args code
         L     5,0(11)
         L     4,4(11)
         SLR   8,8
         LTR   5,5
         BE    @@L1116
         LTR   4,4
         BE    @@L1116
@@L1124  EQU   *
         L     2,16(5)
         L     2,4(2)
         L     3,4(4)
         L     2,68(2)
         CL    2,68(3)
         BNE   @@L1165
         L     2,80(4)
         LTR   2,2
         BE    @@L1166
@@L1123  EQU   *
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L1165
         CLI   28(4),51
         BE    @@L1165
         L     5,0(5)
         L     4,0(4)
         A     8,=F'1'
         LTR   5,5
         BE    @@L1116
         LTR   4,4
         BNE   @@L1124
@@L1116  EQU   *
         LTR   5,5
         BE    @@L1167
@@L1165  EQU   *
         SLR   15,15
         B     @@L1114
@@L1167  EQU   *
         LTR   4,4
         BNE   @@L1165
         MH    8,=H'4'
         ST    8,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    9,15
         L     5,0(11)
         LTR   5,5
         BE    @@L1159
         LR    2,15
@@L1131  EQU   *
         MVC   88(4,13),16(5)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    15,0(2)
         L     5,0(5)
         A     2,=F'4'
         LTR   5,5
         BNE   @@L1131
@@L1159  EQU   *
         L     5,0(11)
         SLR   8,8
         LTR   5,5
         BE    @@L1161
         LR    3,9
@@L1144  EQU   *
         SLR   6,6
         L     4,4(11)
         LR    7,6
         CR    6,8
         BNL   @@L1137
@@L1142  EQU   *
         L     2,80(4)
         LTR   2,2
         BE    @@L1168
@@L1141  EQU   *
         ST    2,88(13)
         MVC   92(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(REG@MENT)
         BALR  14,15
         LTR   15,15
         BNE   @@L1169
         L     4,0(4)
         A     7,=F'1'
         CR    7,8
         BL    @@L1142
@@L1137  EQU   *
         LTR   6,6
         BNE   @@L1170
@@L1134  EQU   *
         L     5,0(5)
         A     3,=F'4'
         A     8,=F'1'
         LTR   5,5
         BNE   @@L1144
@@L1161  EQU   *
         L     4,4(11)
         L     5,0(11)
         SLR   8,8
         LTR   4,4
         BE    @@L1164
@@L1156  EQU   *
         L     2,80(4)
         LTR   2,2
         BE    @@L1171
@@L1150  EQU   *
         LR    6,8
         MH    6,=H'4'
         L     15,0(6,9)
         CLC   2(1,2),2(15)
         BE    @@L1172
         LR    3,15
         SLR   7,7
         IC    7,28(4)
         L     2,80(4)
         LTR   2,2
         BE    @@L1173
@@L1154  EQU   *
         SLR   15,15
         IC    15,2(2)
         CLR   7,15
         BE    @@L1153
         SLR   2,2
         IC    2,28(4)
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         L     6,0(6,9)
         ST    6,92(13)
         L     2,16(5)
         L     2,4(2)
         L     2,8(2)
         SRL   2,18
         N     2,=F'1'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(CNVMOV)
         BALR  14,15
@@L1153  EQU   *
         L     2,80(4)
         LTR   2,2
         BE    @@L1174
@@L1155  EQU   *
         ST    2,88(13)
         ST    3,92(13)
         L     2,16(5)
         L     2,4(2)
         L     2,8(2)
         SRL   2,18
         N     2,=F'1'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(CNVMOV)
         BALR  14,15
@@L1147  EQU   *
         L     4,0(4)
         L     5,0(5)
         A     8,=F'1'
         LTR   4,4
         BNE   @@L1156
@@L1164  EQU   *
         LA    1,88(,13)
         L     15,=V(FTEMPSL)
         BALR  14,15
         LA    15,1(0,0)
         B     @@L1114
@@L1174  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1155
@@L1173  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1154
@@L1172  EQU   *
         L     2,80(4)
         LTR   2,2
         BE    @@L1175
@@L1151  EQU   *
         ST    2,88(13)
         L     6,0(6,9)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         B     @@L1147
@@L1175  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1151
@@L1171  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1150
@@L1170  EQU   *
         MVC   88(4,13),0(3)
         LA    1,88(,13)
         L     15,=V(COPYTREG)
         BALR  14,15
         ST    15,0(3)
         B     @@L1134
@@L1169  EQU   *
         LA    6,1(0,0)
         B     @@L1137
@@L1168  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1141
@@L1166  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1123
@@L1114  EQU   *
* Function tail_recursion_args epilogue
         PDPEPIL
* Function tail_recursion_args literal pool
         DS    0F
         LTORG
* Function tail_recursion_args page table
         DS    0F
@@PGT64  EQU   *
         DC    A(@@PG64)
         DS    0F
* X-func esbandb prologue
ESBANDB  PDPPRLG CINDEX=65,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN65
         LTORG
@@FEN65  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG65   EQU   *
         LR    11,1
         L     10,=A(@@PGT65)
* Function esbandb code
         L     7,0(11)
         L     9,4(11)
         L     4,=A(STMT@OBS)
         LA    3,68(0,0)
         L     2,16(4)
         S     2,12(4)
         CR    2,3
         BL    @@L1188
@@L1177  EQU   *
         L     2,12(4)
         A     2,=F'68'
         ST    2,12(4)
         L     6,8(4)
         CR    2,6
         BE    @@L1189
@@L1178  EQU   *
         L     2,24(4)
         L     3,12(4)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(4)
         L     2,4(4)
         SR    3,2
         L     5,16(4)
         LR    8,5
         SR    8,2
         CR    3,8
         BNH   @@L1179
         ST    5,12(4)
@@L1179  EQU   *
         MVC   8(4,4),12(4)
         LR    8,7
         N     8,=F'1'
         LR    2,7
         SRL   2,1
         X     2,=F'1'
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1180
         LTR   9,9
         BE    @@L1180
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3412'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L1180  EQU   *
         LTR   2,2
         BE    @@L1181
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-98'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         LR    7,15
         ST    9,16(15)
@@L1182  EQU   *
         L     5,=V(CFUN)
         L     4,0(5)
         L     2,4(4)
         MVC   4(4,6),0(2)
         MVC   0(4,6),20(2)
         L     3,24(2)
         A     3,=F'1'
         ST    3,24(2)
         ST    3,8(6)
         MVC   20(4,6),=F'0'
         MVC   32(4,6),=F'0'
         MVC   44(4,6),=F'0'
         MVC   48(4,6),=F'0'
         MVC   52(4,6),168(4)
         MVC   56(4,6),=F'0'
         ST    7,60(6)
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         LR    2,6
         A     2,=F'32'
         ST    2,64(6)
         L     5,0(5)
         L     2,4(5)
         L     3,0(2)
         LTR   3,3
         BE    @@L1183
         L     2,32(3)
         LTR   2,2
         BNE   @@L1184
         L     2,36(3)
         LTR   2,2
         BE    @@L1183
@@L1184  EQU   *
         MVC   88(4,13),=F'0'
         L     2,4(5)
         L     2,0(2)
         MVC   92(4,13),32(2)
         L     2,4(5)
         L     2,0(2)
         MVC   96(4,13),36(2)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,36(6)
@@L1185  EQU   *
         MVC   40(4,6),=F'0'
         L     2,=V(CFUN)
         L     3,0(2)
         L     2,4(3)
         MVC   28(4,6),4(2)
         ST    7,24(6)
         L     2,4(3)
         L     3,28(2)
         A     3,=F'1'
         ST    3,28(2)
         ST    3,16(6)
         LR    15,8
         LTR   8,8
         BE    @@L1187
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         B     @@L1187
@@L1183  EQU   *
         MVC   36(4,6),=F'0'
         B     @@L1185
@@L1181  EQU   *
         ST    2,88(13)
         MVC   92(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         LR    7,15
         B     @@L1182
@@L1189  EQU   *
         OC    40(4,4),=F'1073741824'
         B     @@L1178
@@L1188  EQU   *
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(@OSNCHUN)
         BALR  14,15
         B     @@L1177
@@L1187  EQU   *
         ST    15,12(6)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         ST    6,0(2)
         ST    6,20(2)
         LA    1,88(,13)
         L     15,=V(PUSH@TEM)
         BALR  14,15
* Function esbandb epilogue
         PDPEPIL
* Function esbandb literal pool
         DS    0F
         LTORG
* Function esbandb page table
         DS    0F
@@PGT65  EQU   *
         DC    A(@@PG65)
         DS    0F
* X-func estgtps prologue
ESTGTPS  PDPPRLG CINDEX=66,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN66
         LTORG
@@FEN66  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG66   EQU   *
         LR    11,1
         L     10,=A(@@PGT66)
* Function estgtps code
         LA    1,88(,13)
         L     15,=V(PUSH@TEM)
         BALR  14,15
         MVC   88(4,13),=F'2'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(ESBANDB)
         BALR  14,15
         L     2,=V(CFUN)
         L     2,0(2)
         MVC   168(4,2),160(2)
* Function estgtps epilogue
         PDPEPIL
* Function estgtps literal pool
         DS    0F
         LTORG
* Function estgtps page table
         DS    0F
@@PGT66  EQU   *
         DC    A(@@PG66)
         DS    0F
* X-func eetarg prologue
EETARG   PDPPRLG CINDEX=67,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN67
         LTORG
@@FEN67  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG67   EQU   *
         LR    11,1
         L     10,=A(@@PGT67)
* Function eetarg code
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EEBIND)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(POP@TEMP)
         BALR  14,15
* Function eetarg epilogue
         PDPEPIL
* Function eetarg literal pool
         DS    0F
         LTORG
* Function eetarg page table
         DS    0F
@@PGT67  EQU   *
         DC    A(@@PG67)
         DS    0F
* X-func is_body_block prologue
IS@BODY@ PDPPRLG CINDEX=68,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN68
         LTORG
@@FEN68  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG68   EQU   *
         LR    11,1
         L     10,=A(@@PGT68)
* Function is_body_block code
         L     15,0(11)
         CLI   8(15),4
         BE    @@L1196
@@L1193  EQU   *
         SLR   15,15
         B     @@L1192
@@L1196  EQU   *
         L     15,24(15)
         LTR   15,15
         BE    @@L1193
         CLI   8(15),4
         BNE   @@L1193
         L     15,24(15)
         LTR   15,15
         BE    @@L1193
         CLI   8(15),30
         BNE   @@L1193
         LA    15,1(0,0)
@@L1192  EQU   *
* Function is_body_block epilogue
         PDPEPIL
* Function is_body_block literal pool
         DS    0F
         LTORG
* Function is_body_block page table
         DS    0F
@@PGT68  EQU   *
         DC    A(@@PG68)
         DS    0F
* X-func conditional_context prologue
CONDITIO PDPPRLG CINDEX=69,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN69
         LTORG
@@FEN69  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG69   EQU   *
         LR    11,1
         L     10,=A(@@PGT69)
* Function conditional_context code
         SLR   15,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         LTR   2,2
         BE    @@L1198
         L     2,56(2)
         LTR   2,2
         BE    @@L1198
         LA    15,1(0,0)
@@L1198  EQU   *
* Function conditional_context epilogue
         PDPEPIL
* Function conditional_context literal pool
         DS    0F
         LTORG
* Function conditional_context page table
         DS    0F
@@PGT69  EQU   *
         DC    A(@@PG69)
         DS    0F
* X-func cnestlvl prologue
CNESTLVL PDPPRLG CINDEX=70,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN70
         LTORG
@@FEN70  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG70   EQU   *
         LR    11,1
         L     10,=A(@@PGT70)
* Function cnestlvl code
         L     2,=V(CFUN)
         L     15,0(2)
         LTR   15,15
         BE    @@L1201
         L     2,4(15)
         L     15,0(2)
@@L1201  EQU   *
* Function cnestlvl epilogue
         PDPEPIL
* Function cnestlvl literal pool
         DS    0F
         LTORG
* Function cnestlvl page table
         DS    0F
@@PGT70  EQU   *
         DC    A(@@PG70)
         DS    0F
* S-func expand_nl_handler_label prologue
@@20     PDPPRLG CINDEX=71,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN71
         LTORG
@@FEN71  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG71   EQU   *
         LR    11,1
         L     10,=A(@@PGT71)
* Function expand_nl_handler_label code
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    2,15
         OC    0(4,15),=F'8'
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'4'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    3,88(13)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=V(EMISBF)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         LR    15,2
* Function expand_nl_handler_label epilogue
         PDPEPIL
* Function expand_nl_handler_label literal pool
         DS    0F
         LTORG
* Function expand_nl_handler_label page table
         DS    0F
@@PGT71  EQU   *
         DC    A(@@PG71)
         DS    0F
* S-func expand_nl_goto_receiver prologue
@@21     PDPPRLG CINDEX=72,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN72
         LTORG
@@FEN72  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG72   EQU   *
         LR    11,1
         L     10,=A(@@PGT72)
* Function expand_nl_goto_receiver code
         L     3,=V(GLBRTL)
         MVC   88(4,13),24(3)
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         L     2,=V(FREGS)
         IC    2,11(2)
         CLM   2,1,=XL1'00'
         BE    @@L1203
         L     2,=V(CFUN)
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(GET@ARG@)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(COPYTREG)
         BALR  14,15
         MVC   88(4,13),20(3)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
@@L1203  EQU   *
* Function expand_nl_goto_receiver epilogue
         PDPEPIL
* Function expand_nl_goto_receiver literal pool
         DS    0F
         LTORG
* Function expand_nl_goto_receiver page table
         DS    0F
@@PGT72  EQU   *
         DC    A(@@PG72)
         DS    0F
* S-func expand_nl_goto_receivers prologue
@@22     PDPPRLG CINDEX=73,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN73
         LTORG
@@FEN73  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG73   EQU   *
         LR    11,1
         L     10,=A(@@PGT73)
* Function expand_nl_goto_receivers code
         L     6,0(11)
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         LR    7,15
         L     2,4(6)
         LTR   2,2
         BE    @@L1206
         L     2,=V(CFUN)
         L     2,0(2)
         L     4,80(2)
         LTR   4,4
         BE    @@L1206
@@L1211  EQU   *
         MVC   88(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),4(4)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),4(4)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=V(EMISBF)
         BALR  14,15
         L     4,8(4)
         LTR   4,4
         BNE   @@L1211
@@L1206  EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(EMJMP)
         BALR  14,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     3,76(2)
         L     4,80(2)
         SLR   5,5
         LTR   3,3
         BE    @@L1227
@@L1217  EQU   *
         L     2,16(3)
         L     2,28(2)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BE    @@L1230
@@L1214  EQU   *
         L     3,0(3)
         L     4,8(4)
         LTR   3,3
         BNE   @@L1217
@@L1227  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     3,76(2)
         L     4,80(2)
         SLR   15,15
         LTR   3,3
         BE    @@L1229
@@L1223  EQU   *
         L     2,16(3)
         L     2,28(2)
         SRL   2,19
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1231
@@L1220  EQU   *
         L     3,0(3)
         L     4,8(4)
         LTR   3,3
         BNE   @@L1223
@@L1229  EQU   *
         LTR   15,15
         BE    @@L1224
         LA    1,88(,13)
         L     15,=A(@@21)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EXPTRAP)
         BALR  14,15
         B     @@L1224
@@L1231  EQU   *
         MVC   88(4,13),4(4)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=A(@@20)
         BALR  14,15
         MVC   88(4,13),=F'3'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    5,15
         LA    15,1(0,0)
         B     @@L1220
@@L1230  EQU   *
         MVC   88(4,13),4(4)
         MVC   92(4,13),24(6)
         LA    1,88(,13)
         L     15,=A(@@20)
         BALR  14,15
         MVC   88(4,13),=F'3'
         ST    2,92(13)
         ST    15,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(GRFEE)
         BALR  14,15
         LR    5,15
         LA    1,88(,13)
         L     15,=A(@@21)
         BALR  14,15
         MVC   88(4,13),16(3)
         LA    1,88(,13)
         L     15,=A(EXPAND@G)
         BALR  14,15
         B     @@L1214
@@L1224  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         ST    5,84(2)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
* Function expand_nl_goto_receivers epilogue
         PDPEPIL
* Function expand_nl_goto_receivers literal pool
         DS    0F
         LTORG
* Function expand_nl_goto_receivers page table
         DS    0F
@@PGT73  EQU   *
         DC    A(@@PG73)
@@LC24   EQU   *
         DC    C'unused variable `%s'''
         DC    X'0'
         DS    0F
* X-func warn_about_unused_variables prologue
WARN@ABO PDPPRLG CINDEX=74,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN74
         LTORG
@@FEN74  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG74   EQU   *
         LR    11,1
         L     10,=A(@@PGT74)
* Function warn_about_unused_variables code
         L     2,=V(WU@VAR)
         L     2,0(2)
         LTR   2,2
         BE    @@L1232
         L     3,0(11)
         LTR   3,3
         BE    @@L1232
@@L1239  EQU   *
         L     2,8(3)
         N     2,=F'-16744448'
         L     4,=F'570425344'
         CLR   2,4
         BE    @@L1241
@@L1236  EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   @@L1239
         B     @@L1232
@@L1241  EQU   *
         L     15,28(3)
         LR    2,15
         SRL   2,15
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1236
         L     2,44(3)
         LTR   2,2
         BE    @@L1236
         SRL   15,9
         N     15,=F'1'
         LTR   15,15
         BNE   @@L1236
         ST    3,88(13)
         MVC   92(4,13),=A(@@LC24)
         LA    1,88(,13)
         L     15,=V(WARNWDEC)
         BALR  14,15
         B     @@L1236
@@L1232  EQU   *
* Function warn_about_unused_variables epilogue
         PDPEPIL
* Function warn_about_unused_variables literal pool
         DS    0F
         LTORG
* Function warn_about_unused_variables page table
         DS    0F
@@PGT74  EQU   *
         DC    A(@@PG74)
         DS    0F
* X-func eebind prologue
EEBIND   PDPPRLG CINDEX=75,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN75
         LTORG
@@FEN75  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG75   EQU   *
         LR    11,1
         L     10,=A(@@PGT75)
* Function eebind code
         L     9,8(11)
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,4(2)
         L     4,0(2)
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(WARN@ABO)
         BALR  14,15
         L     2,12(4)
         LTR   2,2
         BNE   @@L1280
@@L1243  EQU   *
         L     3,0(3)
         L     2,72(3)
         CL    2,44(4)
         BE    @@L1244
         L     2,76(3)
         LTR   2,2
         BE    @@L1244
         L     2,4(4)
         LTR   2,2
         BNE   @@L1245
         L     2,224(3)
         SRL   2,23
         N     2,=F'1'
@@L1279  EQU   *
         LTR   2,2
         BE    @@L1244
@@L1246  EQU   *
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(@@22)
         BALR  14,15
@@L1244  EQU   *
         LTR   9,9
         BNE   @@L1248
         L     2,20(4)
         LTR   2,2
         BE    @@L1247
@@L1248  EQU   *
         L     3,40(4)
         LTR   3,3
         BE    @@L1247
@@L1254  EQU   *
         L     2,4(3)
         OC    28(4,2),=F'524288'
         L     15,4(3)
         L     2,8(15)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1281
@@L1251  EQU   *
         L     3,0(3)
         LTR   3,3
         BNE   @@L1254
@@L1247  EQU   *
         L     2,20(4)
         LTR   2,2
         BNE   @@L1256
         L     2,32(4)
         LTR   2,2
         BE    @@L1255
@@L1256  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     6,40(2)
         L     7,36(2)
         L     8,32(2)
         MVC   40(4,2),=F'0'
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'37'
         BE    @@L1282
@@L1257  EQU   *
         SLR   3,3
         LTR   15,15
         BE    @@L1259
         LH    2,0(15)
         CLM   2,3,=H'35'
         BE    @@L1258
@@L1259  EQU   *
         LA    3,1(0,0)
@@L1258  EQU   *
         MVC   88(4,13),32(4)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         LTR   3,3
         BNE   @@L1283
@@L1260  EQU   *
         L     5,=V(CFUN)
         L     2,0(5)
         L     2,4(2)
         ST    6,40(2)
         ST    7,36(2)
         ST    8,32(2)
         LTR   3,3
         BE    @@L1261
         L     2,20(4)
         LTR   2,2
         BE    @@L1261
         SLR   3,3
         L     2,4(4)
         LTR   2,2
         BNE   @@L1262
         LA    3,1(0,0)
@@L1262  EQU   *
         ST    3,88(13)
         MVC   92(4,13),20(4)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EMSREST)
         BALR  14,15
         L     3,0(5)
         L     2,80(3)
         LTR   2,2
         BNE   @@L1284
@@L1261  EQU   *
         ST    4,88(13)
         MVC   92(4,13),20(4)
         MVC   96(4,13),32(4)
         MVC   100(4,13),24(4)
         ST    9,104(13)
         LA    1,88(,13)
         L     15,=A(@@10)
         BALR  14,15
@@L1255  EQU   *
         L     2,4(11)
         LTR   2,2
         BNE   @@L1285
         L     2,24(4)
         MVC   20(4,2),=F'-99'
@@L1265  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         MVC   168(4,2),52(4)
         L     2,4(2)
         MVC   4(4,2),28(4)
         L     5,0(2)
@@L1267  EQU   *
         L     2,=V(CFUN)
         L     15,0(2)
         L     3,4(15)
         L     4,20(3)
         L     2,12(3)
         CLR   2,4
         BE    @@L1286
@@L1270  EQU   *
         L     3,4(15)
         L     2,8(3)
         CLR   2,4
         BE    @@L1287
@@L1271  EQU   *
         L     3,4(15)
         L     2,0(3)
         CLR   2,4
         BE    @@L1288
@@L1272  EQU   *
         L     3,4(15)
         L     2,4(3)
         CLR   2,4
         BE    @@L1289
@@L1273  EQU   *
         L     3,4(15)
         L     2,16(3)
         CLR   2,4
         BE    @@L1290
@@L1274  EQU   *
         L     2,4(15)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(4)
         L     2,=A(STMT@OBS)
         CL    4,4(2)
         BNH   @@L1275
         CL    4,16(2)
         BNL   @@L1275
         ST    4,8(2)
         ST    4,12(2)
@@L1269  EQU   *
         CLR   4,5
         BNE   @@L1267
         B     @@L1291
@@L1275  EQU   *
         MVC   88(4,13),=A(STMT@OBS)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(OBSTACK@)
         BALR  14,15
         B     @@L1269
@@L1290  EQU   *
         MVC   16(4,3),4(4)
         B     @@L1274
@@L1289  EQU   *
         MVC   4(4,3),4(4)
         B     @@L1273
@@L1288  EQU   *
         MVC   0(4,3),4(4)
         B     @@L1272
@@L1287  EQU   *
         MVC   8(4,3),4(4)
         B     @@L1271
@@L1286  EQU   *
         MVC   12(4,3),4(4)
         B     @@L1270
@@L1285  EQU   *
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-97'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         L     2,24(4)
         MVC   16(4,15),16(2)
         B     @@L1265
@@L1284  EQU   *
         MVC   88(4,13),=F'2'
         LR    2,3
         A     2,=F'88'
         ST    2,92(13)
         MVC   96(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EMSSAVE)
         BALR  14,15
         B     @@L1261
@@L1283  EQU   *
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         B     @@L1260
@@L1282  EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(PREV@NON)
         BALR  14,15
         B     @@L1257
@@L1281  EQU   *
         ST    15,88(13)
         MVC   92(4,13),=A(@@LC3)
         LA    1,88(,13)
         L     15,=V(ERRWDECL)
         BALR  14,15
         B     @@L1251
@@L1245  EQU   *
         L     2,32(4)
         LTR   2,2
         BNE   @@L1246
         L     2,20(4)
         B     @@L1279
@@L1280  EQU   *
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         MVC   88(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         B     @@L1243
@@L1291  EQU   *
         LA    1,88(,13)
         L     15,=V(POP@TEMP)
         BALR  14,15
* Function eebind epilogue
         PDPEPIL
* Function eebind literal pool
         DS    0F
         LTORG
* Function eebind page table
         DS    0F
@@PGT75  EQU   *
         DC    A(@@PG75)
         DS    0F
* X-func save_stack_pointer prologue
SAVE@STA PDPPRLG CINDEX=76,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN76
         LTORG
@@FEN76  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG76   EQU   *
         LR    11,1
         L     10,=A(@@PGT76)
* Function save_stack_pointer code
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         L     3,0(2)
         L     2,20(3)
         LTR   2,2
         BNE   @@L1292
         LR    15,2
         L     2,4(3)
         LTR   2,2
         BNE   @@L1294
         LA    15,1(0,0)
@@L1294  EQU   *
         ST    15,88(13)
         A     3,=F'20'
         ST    3,92(13)
         A     3,=F'-20'
         MVC   96(4,13),24(3)
         LA    1,88(,13)
         L     15,=V(EMSSAVE)
         BALR  14,15
         L     2,0(4)
         L     2,4(2)
         ST    3,4(2)
@@L1292  EQU   *
* Function save_stack_pointer epilogue
         PDPEPIL
* Function save_stack_pointer literal pool
         DS    0F
         LTORG
* Function save_stack_pointer page table
         DS    0F
@@PGT76  EQU   *
         DC    A(@@PG76)
         DS    0F
* X-func expdcl prologue
EXPDCL   PDPPRLG CINDEX=77,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN77
         LTORG
@@FEN77  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG77   EQU   *
         LR    11,1
         L     10,=A(@@PGT77)
* Function expdcl code
         L     4,0(11)
         L     5,4(4)
         IC    2,8(4)
         CLM   2,1,=XL1'20'
         L     14,=A(@@L1341)
         BER   14
         CLM   2,1,=XL1'22'
         L     14,=A(@@L1295)
         BNER  14
         L     3,8(4)
         LR    2,3
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L1295)
         BNER  14
         L     15,28(4)
         LR    2,15
         SRL   2,23
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L1295)
         BNER  14
         L     6,=V(CFUN)
         L     2,=V(GLOBAL@T)
         CL    5,0(2)
         L     14,=A(@@L1342)
         BER   14
         L     2,24(4)
         LTR   2,2
         BNE   @@L1302
         L     2,60(4)
         LTR   2,2
         BNE   @@L1303
         MVC   88(4,13),=F'51'
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
@@L1339  EQU   *
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(SMATT)
         BALR  14,15
         ST    2,80(4)
         L     14,=A(@@L1295)
         BR    14
@@L1303  EQU   *
         MVC   88(4,13),=F'4'
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         MVC   88(4,13),=F'51'
         ST    15,92(13)
         B     @@L1339
@@L1302  EQU   *
         CLI   28(4),51
         BE    @@L1306
         L     2,=V(FLAG@FLO)
         L     2,0(2)
         LTR   2,2
         BE    @@L1307
         CLI   8(5),7
         BE    @@L1306
@@L1307  EQU   *
         SRL   3,20
         N     3,=F'1'
         LTR   3,3
         BNE   @@L1306
         LR    2,15
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1308
         L     2,=V(OPTZE)
         L     2,0(2)
         LTR   2,2
         BE    @@L1306
@@L1308  EQU   *
         L     2,8(5)
         SRL   2,18
         N     2,=F'1'
         ST    2,104(13)
         ST    5,88(13)
         SRL   15,24
         ST    15,92(13)
         LA    2,104(,13)
         ST    2,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(PROMOTE@)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         ST    15,80(4)
         LTR   15,15
         BE    @@L1343
@@L1310  EQU   *
         LH    2,0(15)
         CLM   2,3,=H'61'
         BE    @@L1344
         L     2,80(4)
         LTR   2,2
         BE    @@L1345
@@L1314  EQU   *
         LH    2,0(2)
         CLM   2,3,=H'65'
         BE    @@L1346
@@L1312  EQU   *
         L     2,80(4)
         LTR   2,2
         BE    @@L1347
@@L1317  EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(MARK@USE)
         BALR  14,15
         IC    2,8(5)
         CLM   2,1,=XL1'0D'
         BE    @@L1319
         CLM   2,1,=XL1'0F'
         BE    @@L1319
@@L1318  EQU   *
         L     2,80(4)
         LTR   2,2
         BE    @@L1348
@@L1321  EQU   *
         ST    2,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(MAYBE@SE)
         BALR  14,15
         L     2,8(4)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         L     14,=A(@@L1295)
         BER   14
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=V(PUT@VAR@)
         BALR  14,15
         L     14,=A(@@L1295)
         BR    14
@@L1348  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1321
@@L1319  EQU   *
         L     2,80(4)
         LTR   2,2
         BE    @@L1349
@@L1320  EQU   *
         ST    2,88(13)
         L     2,4(4)
         L     2,4(2)
         MVC   92(4,13),36(2)
         LA    1,88(,13)
         L     15,=V(MARK@REG)
         BALR  14,15
         B     @@L1318
@@L1349  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1320
@@L1347  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1317
@@L1346  EQU   *
         L     2,0(6)
         L     3,12(2)
         L     2,80(4)
         LTR   2,2
         BE    @@L1350
@@L1315  EQU   *
         L     2,4(2)
         L     3,44(3)
         L     2,4(2)
         SLL   2,2
         ST    4,0(2,3)
         L     2,0(6)
         L     3,12(2)
         L     2,80(4)
         LTR   2,2
         BE    @@L1351
@@L1316  EQU   *
         L     2,8(2)
         L     3,44(3)
         L     2,4(2)
@@L1340  EQU   *
         SLL   2,2
         ST    4,0(2,3)
         B     @@L1312
@@L1351  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1316
@@L1350  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1315
@@L1345  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1314
@@L1344  EQU   *
         L     2,0(6)
         L     2,12(2)
         L     15,80(4)
         LTR   15,15
         BE    @@L1352
@@L1311  EQU   *
         L     3,44(2)
         L     2,4(15)
         B     @@L1340
@@L1352  EQU   *
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     15,80(4)
         B     @@L1311
@@L1343  EQU   *
         ST    4,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     15,80(4)
         B     @@L1310
@@L1306  EQU   *
         L     3,40(4)
         CLI   8(3),25
         BE    @@L1353
@@L1324  EQU   *
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(SAVE@STA)
         BALR  14,15
         CLI   8(5),18
         BE    @@L1354
@@L1338  EQU   *
         MVC   88(4,13),40(4)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(FTEMPSL)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         L     2,4(4)
         MVC   96(4,13),36(2)
         LA    1,88(,13)
         L     15,=V(ALDYNSTK)
         BALR  14,15
         SLR   2,2
         IC    2,28(4)
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(SMATT)
         BALR  14,15
         ST    2,80(4)
         SLR   2,2
         IC    2,39(4)
         O     2,=F'16384'
         ST    2,36(4)
         NC    32(4,4),=F'-268435457'
         B     @@L1295
@@L1354  EQU   *
         L     2,12(5)
         LTR   2,2
         BE    @@L1338
         MVC   88(4,13),60(2)
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         B     @@L1338
@@L1353  EQU   *
         L     2,=V(FLAG@STA)
         L     2,0(2)
         LTR   2,2
         BNE   @@L1355
@@L1325  EQU   *
         SLR   5,5
         L     3,80(4)
         LTR   3,3
         BE    @@L1326
         LH    2,0(3)
         CLM   2,3,=H'66'
         BE    @@L1356
@@L1328  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'3986'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L1327  EQU   *
         L     2,80(4)
         LTR   2,2
         BE    @@L1357
@@L1331  EQU   *
         L     5,4(2)
@@L1326  EQU   *
         CLI   28(4),51
         BE    @@L1332
         SLR   2,2
         IC    2,28(4)
         MH    2,=H'2'
         L     3,=V(MODE@BIT)
         LH    3,0(2,3)
         N     3,=XL4'0000FFFF'
@@L1333  EQU   *
         SLL   3,8
         SLR   2,2
         IC    2,39(4)
         OR    2,3
         ST    2,36(4)
         NC    32(4,4),=F'-268435457'
         ST    4,88(13)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ASSIGN@T)
         BALR  14,15
         LR    2,15
         ST    15,88(13)
         ST    4,92(13)
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(SMATT)
         BALR  14,15
         ST    2,80(4)
         LTR   5,5
         BE    @@L1295
         LR    15,2
         LTR   2,2
         BE    @@L1358
@@L1335  EQU   *
         MVC   88(4,13),4(15)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(FORCE@OP)
         BALR  14,15
         CLR   15,5
         BE    @@L1295
         ST    5,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         B     @@L1295
@@L1358  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     15,80(4)
         B     @@L1335
@@L1332  EQU   *
         LA    3,64(0,0)
         B     @@L1333
@@L1357  EQU   *
         ST    4,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     2,80(4)
         B     @@L1331
@@L1356  EQU   *
         L     2,4(3)
         LH    2,0(2)
         CLM   2,3,=H'61'
         BNE   @@L1328
         B     @@L1327
@@L1355  EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'40'
         LA    1,88(,13)
         L     15,=V(CTREENT)
         BALR  14,15
         LTR   15,15
         BH    @@L1324
         B     @@L1325
@@L1342  EQU   *
         MVC   88(4,13),=F'51'
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         LA    1,88(,13)
         L     15,=V(GRMEM)
         BALR  14,15
         ST    15,80(4)
         B     @@L1295
@@L1341  EQU   *
         IC    2,33(5)
         N     2,=F'127'
         STC   2,28(4)
         L     3,36(5)
         SLL   3,8
         SLR   2,2
         IC    2,39(4)
         OR    2,3
         ST    2,36(4)
         MVC   24(4,4),16(5)
         MVC   40(4,4),20(5)
@@L1295  EQU   *
* Function expdcl epilogue
         PDPEPIL
* Function expdcl literal pool
         DS    0F
         LTORG
* Function expdcl page table
         DS    0F
@@PGT77  EQU   *
         DC    A(@@PG77)
         DS    0F
* X-func expdinit prologue
EXPDINIT PDPPRLG CINDEX=78,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN78
         LTORG
@@FEN78  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG78   EQU   *
         LR    11,1
         L     10,=A(@@PGT78)
* Function expdinit code
         L     4,0(11)
         L     2,8(4)
         LR    5,2
         SRL   5,15
         N     5,=F'1'
         CLI   8(4),32
         BE    @@L1359
         LR    3,2
         SRL   3,13
         N     3,=F'1'
         LTR   3,3
         BNE   @@L1359
         LA    1,88(,13)
         L     15,=V(PUSH@TEM)
         BALR  14,15
         L     15,60(4)
         L     2,=V(GLOBAL@T)
         CL    15,0(2)
         BE    @@L1369
         LTR   15,15
         BE    @@L1365
         CLI   8(15),2
         BE    @@L1365
         MVC   88(4,13),12(4)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(EMLNOT)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),60(4)
         ST    3,96(13)
         ST    3,100(13)
@@L1368  EQU   *
         LA    1,88(,13)
         L     15,=V(EXPASSIG)
         BALR  14,15
@@L1367  EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
@@L1365  EQU   *
         N     5,=F'1'
         SLL   5,15
         L     2,8(4)
         N     2,=F'-32769'
         OR    2,5
         ST    2,8(4)
         MVC   88(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PRSTSLOT)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(FTEMPSL)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(POP@TEMP)
         BALR  14,15
         B     @@L1359
@@L1369  EQU   *
         L     2,4(4)
         SLR   15,15
         IC    15,8(2)
         LR    2,15
         A     2,=F'-6'
         LA    3,1(0,0)
         CLR   2,3
         BNH   @@L1364
         LA    2,10(0,0)
         CLR   15,2
         BE    @@L1364
         LA    3,13(0,0)
         CLR   15,3
         BE    @@L1364
         LA    2,15(0,0)
         CLR   15,2
         BNE   @@L1367
@@L1364  EQU   *
         MVC   88(4,13),4(4)
         L     2,=V(GLOBAL@T)
         MVC   92(4,13),44(2)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    4,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         B     @@L1368
@@L1359  EQU   *
* Function expdinit epilogue
         PDPEPIL
* Function expdinit literal pool
         DS    0F
         LTORG
* Function expdinit page table
         DS    0F
@@PGT78  EQU   *
         DC    A(@@PG78)
         DS    0F
* X-func xpdcleanup prologue
XPDCLEAN PDPPRLG CINDEX=79,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN79
         LTORG
@@FEN79  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG79   EQU   *
         LR    11,1
         L     10,=A(@@PGT79)
* Function xpdcleanup code
         L     6,4(11)
         L     3,=V(CFUN)
         L     2,0(3)
         LTR   2,2
         BE    @@L1372
         L     2,4(2)
         L     7,0(2)
         LTR   7,7
         BNE   @@L1371
@@L1372  EQU   *
         SLR   15,15
         B     @@L1370
@@L1371  EQU   *
         LTR   6,6
         BE    @@L1373
         LR    9,7
         A     9,=F'32'
         LR    2,9
         LA    1,88(,13)
         L     15,=A(CONDITIO)
         BALR  14,15
         LR    8,15
         LTR   15,15
         BNE   @@L1382
@@L1374  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(UNSEXP)
         BALR  14,15
         MVC   88(4,13),0(11)
         ST    15,92(13)
         MVC   96(4,13),0(2)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         LR    3,15
         ST    15,0(2)
         LTR   8,8
         BNE   @@L1375
         L     4,=V(CFUN)
         L     2,0(4)
         L     2,4(2)
         ST    7,4(2)
@@L1375  EQU   *
         LTR   8,8
         BNE   @@L1383
@@L1376  EQU   *
         L     2,=A(@@0)
         L     2,0(2)
         LTR   2,2
         BNE   @@L1377
         OC    8(4,3),=F'2097152'
@@L1378  EQU   *
         LTR   8,8
         BE    @@L1379
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         LTR   2,2
         BE    @@L1373
         ST    2,88(13)
         MVC   92(4,13),60(7)
         LA    1,88(,13)
         L     15,=V(EMISAF)
         BALR  14,15
         ST    15,60(7)
@@L1373  EQU   *
         LA    15,1(0,0)
         B     @@L1370
@@L1379  EQU   *
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         ST    15,60(7)
         ST    8,88(13)
         MVC   92(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         ST    9,64(7)
         B     @@L1373
@@L1377  EQU   *
         LA    1,88(,13)
         L     15,=V(EERSTART)
         BALR  14,15
         B     @@L1378
@@L1383  EQU   *
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         B     @@L1376
@@L1382  EQU   *
         L     5,=V(WORD@MOD)
         MVC   88(4,13),0(5)
         LA    1,88(,13)
         L     15,=V(GEN@REG@)
         BALR  14,15
         LR    3,15
         LA    1,88(,13)
         L     15,=V(SSEQUE)
         BALR  14,15
         ST    3,88(13)
         L     4,=V(CIRTX)
         MVC   92(4,13),256(4)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(G@INS)
         BALR  14,15
         LR    2,15
         LA    1,88(,13)
         L     15,=V(END@SEQU)
         BALR  14,15
         ST    2,88(13)
         MVC   92(4,13),60(7)
         LA    1,88(,13)
         L     15,=V(EMISAF)
         BALR  14,15
         ST    15,60(7)
         ST    3,88(13)
         MVC   92(4,13),260(4)
         LA    1,88(,13)
         L     15,=V(EMMOV)
         BALR  14,15
         MVC   88(4,13),0(5)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TYPFMOD)
         BALR  14,15
         MVC   88(4,13),=F'34'
         MVC   92(4,13),=F'0'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(BDECL)
         BALR  14,15
         ST    3,80(15)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(TRUTHVAL)
         BALR  14,15
         MVC   88(4,13),=F'51'
         L     2,=V(GLOBAL@T)
         MVC   92(4,13),108(2)
         ST    15,96(13)
         ST    6,100(13)
         MVC   104(4,13),44(2)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    6,15
         L     2,64(7)
         B     @@L1374
@@L1370  EQU   *
* Function xpdcleanup epilogue
         PDPEPIL
* Function xpdcleanup literal pool
         DS    0F
         LTORG
* Function xpdcleanup page table
         DS    0F
@@PGT79  EQU   *
         DC    A(@@PG79)
         DS    0F
* X-func expdcleh prologue
EXPDCLEH PDPPRLG CINDEX=80,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN80
         LTORG
@@FEN80  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG80   EQU   *
         LR    11,1
         L     10,=A(@@PGT80)
* Function expdcleh code
         L     2,4(11)
         L     4,8(11)
         MVC   88(4,13),0(11)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(XPDCLEAN)
         BALR  14,15
         LTR   2,2
         BE    @@L1385
         LTR   15,15
         BE    @@L1385
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         L     3,32(2)
         N     4,=F'1'
         SLL   4,13
         L     2,8(3)
         N     2,=F'-8193'
         OR    2,4
         ST    2,8(3)
@@L1385  EQU   *
* Function expdcleh epilogue
         PDPEPIL
* Function expdcleh literal pool
         DS    0F
         LTORG
* Function expdcleh page table
         DS    0F
@@PGT80  EQU   *
         DC    A(@@PG80)
         DS    0F
* X-func eanonunion prologue
EANONUNI PDPPRLG CINDEX=81,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN81
         LTORG
@@FEN81  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG81   EQU   *
         LR    11,1
         L     10,=A(@@PGT81)
* Function eanonunion code
         L     7,0(11)
         L     3,8(11)
         L     2,=V(CFUN)
         L     2,0(2)
         LTR   2,2
         BE    @@L1387
         L     2,4(2)
         L     8,0(2)
@@L1388  EQU   *
         LR    5,3
         LTR   3,3
         BE    @@L1390
@@L1394  EQU   *
         L     2,16(5)
         L     2,8(2)
         SRL   2,21
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1415
         L     5,0(5)
         LTR   5,5
         BNE   @@L1394
@@L1390  EQU   *
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(EXPDCL)
         BALR  14,15
         ST    7,88(13)
         MVC   92(4,13),4(11)
         LA    1,88(,13)
         L     15,=A(XPDCLEAN)
         BALR  14,15
         L     6,80(7)
         LTR   6,6
         BE    @@L1418
@@L1395  EQU   *
         LR    5,3
         LTR   3,3
         BE    @@L1414
@@L1411  EQU   *
         L     4,16(5)
         L     9,12(5)
         L     2,4(4)
         LH    15,32(2)
         N     15,=F'127'
         L     2,8(4)
         SRL   2,15
         N     2,=F'1'
         LTR   2,2
         BE    @@L1400
         OC    8(4,7),=F'32768'
@@L1400  EQU   *
         L     3,36(7)
         N     3,=F'-256'
         SLR   2,2
         IC    2,39(4)
         OR    2,3
         ST    2,36(4)
         L     3,32(7)
         N     3,=F'268435456'
         L     2,32(4)
         N     2,=F'-268435457'
         OR    2,3
         ST    2,32(4)
         LA    2,51(0,0)
         CLR   15,2
         BE    @@L1419
@@L1401  EQU   *
         LH    2,0(6)
         CLM   2,3,=H'66'
         BE    @@L1420
         CLM   2,3,=H'61'
         BE    @@L1421
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'4279'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L1405  EQU   *
         L     2,4(11)
         LTR   2,2
         BE    @@L1398
         ST    4,88(13)
         ST    9,92(13)
         MVC   96(4,13),32(8)
         LA    1,88(,13)
         L     15,=V(TREE@CON)
         BALR  14,15
         ST    15,32(8)
@@L1398  EQU   *
         L     5,0(5)
         LTR   5,5
         BNE   @@L1411
         B     @@L1414
@@L1421  EQU   *
         SLR   2,2
         IC    2,2(6)
         CLR   15,2
         BE    @@L1417
         ST    15,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(GENLPS)
         BALR  14,15
@@L1416  EQU   *
         ST    15,80(4)
         B     @@L1405
@@L1417  EQU   *
         ST    6,80(4)
         B     @@L1405
@@L1420  EQU   *
         SLR   2,2
         IC    2,2(6)
         CLR   15,2
         BE    @@L1417
         ST    6,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         MVC   104(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(ADJADD)
         BALR  14,15
         B     @@L1416
@@L1419  EQU   *
         CLI   28(7),51
         BE    @@L1401
         MVC   88(4,13),24(4)
         MVC   92(4,13),=F'1'
         MVC   96(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(MODFRTRE)
         BALR  14,15
         STC   15,28(4)
         B     @@L1401
@@L1418  EQU   *
         ST    7,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(MDDCLRTL)
         BALR  14,15
         L     6,80(7)
         B     @@L1395
@@L1415  EQU   *
         OC    8(4,7),=F'2097152'
         B     @@L1390
@@L1387  EQU   *
         LR    8,2
         B     @@L1388
@@L1414  EQU   *
* Function eanonunion epilogue
         PDPEPIL
* Function eanonunion literal pool
         DS    0F
         LTORG
* Function eanonunion page table
         DS    0F
@@PGT81  EQU   *
         DC    A(@@PG81)
         DS    0F
* S-func expand_cleanups prologue
@@8      PDPPRLG CINDEX=82,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN82
         LTORG
@@FEN82  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG82   EQU   *
         LR    11,1
         L     10,=A(@@PGT82)
* Function expand_cleanups code
         L     6,4(11)
         L     5,8(11)
         L     7,12(11)
         L     4,0(11)
         LTR   4,4
         BE    @@L1438
@@L1436  EQU   *
         LTR   6,6
         BE    @@L1428
         L     2,12(4)
         CLR   2,6
         BE    @@L1425
@@L1428  EQU   *
         L     15,16(4)
         CLI   8(15),2
         BE    @@L1439
         LTR   5,5
         BNE   @@L1432
         L     2,=A(@@0)
         L     2,0(2)
         LTR   2,2
         BNE   @@L1440
@@L1432  EQU   *
         LTR   7,7
         BE    @@L1425
         L     3,8(4)
         SRL   3,13
         N     3,=F'1'
         LTR   3,3
         BNE   @@L1425
         LTR   5,5
         BE    @@L1434
         L     2,=A(@@0)
         L     2,0(2)
         LTR   2,2
         BNE   @@L1441
@@L1434  EQU   *
         MVC   88(4,13),16(4)
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
@@L1435  EQU   *
         LA    1,88(,13)
         L     15,=V(FTEMPSL)
         BALR  14,15
@@L1425  EQU   *
         L     4,0(4)
         LTR   4,4
         BNE   @@L1436
         B     @@L1438
@@L1441  EQU   *
         LA    1,88(,13)
         L     15,=V(EERSTART)
         BALR  14,15
         MVC   88(4,13),16(4)
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         ST    3,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         MVC   88(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(EEREFIX)
         BALR  14,15
         B     @@L1435
@@L1440  EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EERECLEA)
         BALR  14,15
         B     @@L1432
@@L1439  EQU   *
         ST    15,88(13)
         ST    6,92(13)
         ST    5,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=A(@@8)
         BALR  14,15
         B     @@L1425
@@L1438  EQU   *
* Function expand_cleanups epilogue
         PDPEPIL
* Function expand_cleanups literal pool
         DS    0F
         LTORG
* Function expand_cleanups page table
         DS    0F
@@PGT82  EQU   *
         DC    A(@@PG82)
         DS    0F
* X-func start_cleanup_deferral prologue
START@CL PDPPRLG CINDEX=83,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN83
         LTORG
@@FEN83  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG83   EQU   *
         LR    11,1
         L     10,=A(@@PGT83)
* Function start_cleanup_deferral code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     15,0(2)
         LTR   15,15
         BE    @@L1442
         L     2,56(15)
         A     2,=F'1'
         ST    2,56(15)
@@L1442  EQU   *
* Function start_cleanup_deferral epilogue
         PDPEPIL
* Function start_cleanup_deferral literal pool
         DS    0F
         LTORG
* Function start_cleanup_deferral page table
         DS    0F
@@PGT83  EQU   *
         DC    A(@@PG83)
         DS    0F
* X-func end_cleanup_deferral prologue
END@CLEA PDPPRLG CINDEX=84,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN84
         LTORG
@@FEN84  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG84   EQU   *
         LR    11,1
         L     10,=A(@@PGT84)
* Function end_cleanup_deferral code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     15,0(2)
         LTR   15,15
         BE    @@L1444
         L     2,56(15)
         BCTR  2,0
         ST    2,56(15)
@@L1444  EQU   *
* Function end_cleanup_deferral epilogue
         PDPEPIL
* Function end_cleanup_deferral literal pool
         DS    0F
         LTORG
* Function end_cleanup_deferral page table
         DS    0F
@@PGT84  EQU   *
         DC    A(@@PG84)
         DS    0F
* X-func move_cleanups_up prologue
MOVE@CLE PDPPRLG CINDEX=85,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN85
         LTORG
@@FEN85  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG85   EQU   *
         LR    11,1
         L     10,=A(@@PGT85)
* Function move_cleanups_up code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         L     3,4(2)
         MVC   88(4,13),32(2)
         MVC   92(4,13),32(3)
         LA    1,88(,13)
         L     15,=V(CHAINON)
         BALR  14,15
         ST    15,32(3)
         MVC   32(4,2),=F'0'
* Function move_cleanups_up epilogue
         PDPEPIL
* Function move_cleanups_up literal pool
         DS    0F
         LTORG
* Function move_cleanups_up page table
         DS    0F
@@PGT85  EQU   *
         DC    A(@@PG85)
         DS    0F
* X-func last_cleanup_this_contour prologue
LAST@CLE PDPPRLG CINDEX=86,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN86
         LTORG
@@FEN86  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG86   EQU   *
         LR    11,1
         L     10,=A(@@PGT86)
* Function last_cleanup_this_contour code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         LR    15,2
         LTR   2,2
         BE    @@L1447
         L     15,32(2)
@@L1447  EQU   *
* Function last_cleanup_this_contour epilogue
         PDPEPIL
* Function last_cleanup_this_contour literal pool
         DS    0F
         LTORG
* Function last_cleanup_this_contour page table
         DS    0F
@@PGT86  EQU   *
         DC    A(@@PG86)
         DS    0F
* X-func any_pending_cleanups prologue
ANY@PEND PDPPRLG CINDEX=87,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN87
         LTORG
@@FEN87  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG87   EQU   *
         LR    11,1
         L     10,=A(@@PGT87)
* Function any_pending_cleanups code
         L     2,=V(CFUN)
         L     2,0(2)
         LTR   2,2
         BE    @@L1461
         L     2,4(2)
         LTR   2,2
         BE    @@L1461
         L     15,0(2)
         LTR   15,15
         BE    @@L1461
         L     2,0(11)
         LTR   2,2
         BE    @@L1452
         L     2,32(15)
         LA    15,1(0,0)
         LTR   2,2
         BNE   @@L1449
@@L1452  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     15,0(2)
         L     2,32(15)
         LTR   2,2
         BNE   @@L1453
         L     2,36(15)
         LR    15,2
         LTR   2,2
         BE    @@L1449
@@L1453  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,0(2)
         L     15,4(2)
         LTR   15,15
         BE    @@L1461
@@L1459  EQU   *
         L     2,32(15)
         LTR   2,2
         BNE   @@L1462
         L     15,4(15)
         LTR   15,15
         BNE   @@L1459
@@L1461  EQU   *
         SLR   15,15
         B     @@L1449
@@L1462  EQU   *
         LA    15,1(0,0)
@@L1449  EQU   *
* Function any_pending_cleanups epilogue
         PDPEPIL
* Function any_pending_cleanups literal pool
         DS    0F
         LTORG
* Function any_pending_cleanups page table
         DS    0F
@@PGT87  EQU   *
         DC    A(@@PG87)
         DS    0F
* X-func escase prologue
ESCASE   PDPPRLG CINDEX=88,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN88
         LTORG
@@FEN88  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG88   EQU   *
         LR    11,1
         L     10,=A(@@PGT88)
* Function escase code
         L     6,0(11)
         L     4,=A(STMT@OBS)
         LA    3,68(0,0)
         L     2,16(4)
         S     2,12(4)
         CR    2,3
         BL    @@L1470
@@L1464  EQU   *
         L     2,12(4)
         A     2,=F'68'
         ST    2,12(4)
         L     5,8(4)
         CR    2,5
         BE    @@L1471
@@L1465  EQU   *
         L     2,24(4)
         L     3,12(4)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(4)
         L     2,4(4)
         SR    3,2
         L     15,16(4)
         LR    7,15
         SR    7,2
         CR    3,7
         BNH   @@L1466
         ST    15,12(4)
@@L1466  EQU   *
         MVC   8(4,4),12(4)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         MVC   4(4,5),16(2)
         MVC   0(4,5),20(2)
         L     3,24(2)
         A     3,=F'1'
         ST    3,24(2)
         ST    3,8(5)
         LR    15,6
         LTR   6,6
         BNE   @@L1472
@@L1468  EQU   *
         ST    15,12(5)
         MVC   20(4,5),=F'0'
         MVC   28(4,5),4(11)
         MVC   32(4,5),8(11)
         MVC   24(4,5),=F'0'
         MVC   36(4,5),12(11)
         LA    1,88(,13)
         L     15,=V(FORCE@LI)
         BALR  14,15
         ST    15,40(5)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         ST    5,16(2)
         ST    5,20(2)
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'37'
         BE    @@L1469
         MVC   88(4,13),=F'0'
         MVC   92(4,13),=F'-99'
         LA    1,88(,13)
         L     15,=V(EMNOTE)
         BALR  14,15
         B     @@L1469
@@L1472  EQU   *
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         B     @@L1468
@@L1471  EQU   *
         OC    40(4,4),=F'1073741824'
         B     @@L1465
@@L1470  EQU   *
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(@OSNCHUN)
         BALR  14,15
         B     @@L1464
@@L1469  EQU   *
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         ST    15,16(5)
         LA    1,88(,13)
         L     15,=V(START@CL)
         BALR  14,15
* Function escase epilogue
         PDPEPIL
* Function escase literal pool
         DS    0F
         LTORG
* Function escase page table
         DS    0F
@@PGT88  EQU   *
         DC    A(@@PG88)
         DS    0F
* X-func escsdum prologue
ESCSDUM  PDPPRLG CINDEX=89,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN89
         LTORG
@@FEN89  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG89   EQU   *
         LR    11,1
         L     10,=A(@@PGT89)
* Function escsdum code
         L     4,=A(STMT@OBS)
         LA    3,68(0,0)
         L     2,16(4)
         S     2,12(4)
         CR    2,3
         BL    @@L1477
@@L1474  EQU   *
         L     2,12(4)
         A     2,=F'68'
         ST    2,12(4)
         L     15,8(4)
         CR    2,15
         BE    @@L1478
@@L1475  EQU   *
         L     2,24(4)
         L     3,12(4)
         AR    3,2
         X     2,=F'-1'
         NR    3,2
         ST    3,12(4)
         L     2,4(4)
         SR    3,2
         L     5,16(4)
         LR    6,5
         SR    6,2
         CR    3,6
         BNH   @@L1476
         ST    5,12(4)
         B     @@L1476
@@L1478  EQU   *
         OC    40(4,4),=F'1073741824'
         B     @@L1475
@@L1477  EQU   *
         ST    4,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(@OSNCHUN)
         BALR  14,15
         B     @@L1474
@@L1476  EQU   *
         MVC   8(4,4),12(4)
         L     2,=V(CFUN)
         L     4,0(2)
         L     2,4(4)
         MVC   4(4,15),16(2)
         MVC   0(4,15),20(2)
         L     3,24(2)
         A     3,=F'1'
         ST    3,24(2)
         ST    3,8(15)
         MVC   12(4,15),=F'0'
         MVC   20(4,15),=F'0'
         MVC   16(4,15),=F'0'
         MVC   32(4,15),=F'0'
         MVC   24(4,15),=F'0'
         L     2,4(4)
         ST    15,16(2)
         ST    15,20(2)
         LA    1,88(,13)
         L     15,=V(START@CL)
         BALR  14,15
* Function escsdum epilogue
         PDPEPIL
* Function escsdum literal pool
         DS    0F
         LTORG
* Function escsdum page table
         DS    0F
@@PGT89  EQU   *
         DC    A(@@PG89)
         DS    0F
* X-func eecasdum prologue
EECASDUM PDPPRLG CINDEX=90,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN90
         LTORG
@@FEN90  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG90   EQU   *
         LR    11,1
         L     10,=A(@@PGT90)
* Function eecasdum code
         LA    1,88(,13)
         L     15,=V(END@CLEA)
         BALR  14,15
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     5,16(2)
@@L1481  EQU   *
         L     2,=V(CFUN)
         L     15,0(2)
         L     3,4(15)
         L     4,20(3)
         L     2,12(3)
         CLR   2,4
         BE    @@L1492
@@L1484  EQU   *
         L     3,4(15)
         L     2,8(3)
         CLR   2,4
         BE    @@L1493
@@L1485  EQU   *
         L     3,4(15)
         L     2,0(3)
         CLR   2,4
         BE    @@L1494
@@L1486  EQU   *
         L     3,4(15)
         L     2,4(3)
         CLR   2,4
         BE    @@L1495
@@L1487  EQU   *
         L     3,4(15)
         L     2,16(3)
         CLR   2,4
         BE    @@L1496
@@L1488  EQU   *
         L     2,4(15)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(4)
         L     2,=A(STMT@OBS)
         CL    4,4(2)
         BNH   @@L1489
         CL    4,16(2)
         BNL   @@L1489
         ST    4,8(2)
         ST    4,12(2)
         B     @@L1483
@@L1489  EQU   *
         MVC   88(4,13),=A(STMT@OBS)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(OBSTACK@)
         BALR  14,15
         B     @@L1483
@@L1496  EQU   *
         MVC   16(4,3),4(4)
         B     @@L1488
@@L1495  EQU   *
         MVC   4(4,3),4(4)
         B     @@L1487
@@L1494  EQU   *
         MVC   0(4,3),4(4)
         B     @@L1486
@@L1493  EQU   *
         MVC   8(4,3),4(4)
         B     @@L1485
@@L1492  EQU   *
         MVC   12(4,3),4(4)
         B     @@L1484
@@L1483  EQU   *
         CLR   4,5
         BNE   @@L1481
* Function eecasdum epilogue
         PDPEPIL
* Function eecasdum literal pool
         DS    0F
         LTORG
* Function eecasdum page table
         DS    0F
@@PGT90  EQU   *
         DC    A(@@PG90)
         DS    0F
* X-func case_index_expr_type prologue
CASE@IND PDPPRLG CINDEX=91,FRAME=88,BASER=12,ENTRY=YES
         B     @@FEN91
         LTORG
@@FEN91  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG91   EQU   *
         LR    11,1
         L     10,=A(@@PGT91)
* Function case_index_expr_type code
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     15,16(2)
         LTR   15,15
         BE    @@L1497
         L     2,28(15)
         L     15,4(2)
@@L1497  EQU   *
* Function case_index_expr_type epilogue
         PDPEPIL
* Function case_index_expr_type literal pool
         DS    0F
         LTORG
* Function case_index_expr_type page table
         DS    0F
@@PGT91  EQU   *
         DC    A(@@PG91)
@@LC25   EQU   *
         DC    C'unreachable code at beginning of %s'
         DC    X'0'
         DS    0F
* S-func check_seenlabel prologue
@@23     PDPPRLG CINDEX=92,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN92
         LTORG
@@FEN92  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG92   EQU   *
         LR    11,1
         L     10,=A(@@PGT92)
* Function check_seenlabel code
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,4(2)
         L     2,16(2)
         L     2,40(2)
         LTR   2,2
         BL    @@L1499
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(RESLNS)
         BALR  14,15
         L     3,0(3)
         L     2,4(3)
         L     2,16(2)
         MVC   40(4,2),=F'-1'
         L     2,4(3)
         L     2,16(2)
         L     3,16(2)
         LTR   3,3
         BE    @@L1499
@@L1514  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'36'
         BE    @@L1499
         CLM   2,3,=H'37'
         BE    @@L1503
         CLM   2,3,=H'32'
         BNE   @@L1508
         L     2,16(3)
         LH    2,0(2)
         CLM   2,3,=H'48'
         BNE   @@L1508
@@L1503  EQU   *
         L     3,12(3)
         LTR   3,3
         BNE   @@L1514
         B     @@L1499
@@L1508  EQU   *
         L     3,8(3)
         LTR   3,3
         BE    @@L1509
         LH    2,0(3)
         CH    2,=H'37'
         BNE   @@L1508
         L     2,20(3)
         LTR   2,2
         BL    @@L1508
@@L1509  EQU   *
         LTR   3,3
         BE    @@L1499
         MVC   88(4,13),16(3)
         MVC   92(4,13),20(3)
         MVC   96(4,13),=A(@@LC25)
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,16(2)
         MVC   100(4,13),36(2)
         LA    1,88(,13)
         L     15,=V(WARNWFL)
         BALR  14,15
@@L1499  EQU   *
* Function check_seenlabel epilogue
         PDPEPIL
* Function check_seenlabel literal pool
         DS    0F
         LTORG
* Function check_seenlabel page table
         DS    0F
@@PGT92  EQU   *
         DC    A(@@PG92)
         DS    0F
* X-func pcase prologue
PCASE    PDPPRLG CINDEX=93,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN93
         LTORG
@@FEN93  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG93   EQU   *
         LR    11,1
         L     10,=A(@@PGT93)
* Function pcase code
         L     4,0(11)
         L     2,=V(CFUN)
         L     2,0(2)
         L     15,4(2)
         L     3,16(15)
         LTR   3,3
         BE    @@L1518
         L     2,16(3)
         LTR   2,2
         BNE   @@L1517
@@L1518  EQU   *
         LA    15,1(0,0)
         B     @@L1516
@@L1517  EQU   *
         L     2,4(15)
         LTR   2,2
         BE    @@L1519
         L     2,8(2)
         C     2,8(3)
         BNH   @@L1519
         LA    15,5(0,0)
         B     @@L1516
@@L1519  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     3,16(2)
         L     2,28(3)
         L     5,4(2)
         L     3,32(3)
         L     2,=V(GLOBAL@T)
         CL    5,0(2)
         BE    @@L1524
         LTR   4,4
         BE    @@L1521
         ST    3,88(13)
         ST    4,92(13)
         L     2,4(11)
         LA    1,88(,13)
         LA    15,0(2)
         BALR  14,15
         LR    4,15
@@L1521  EQU   *
         LA    1,88(,13)
         L     15,=A(@@23)
         BALR  14,15
         LTR   4,4
         BE    @@L1522
         L     2,8(4)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BE    @@L1525
@@L1523  EQU   *
         LA    15,3(0,0)
         B     @@L1516
@@L1525  EQU   *
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BE    @@L1523
@@L1522  EQU   *
         ST    4,88(13)
         ST    4,92(13)
         MVC   96(4,13),8(11)
         MVC   100(4,13),12(11)
         LA    1,88(,13)
         L     15,=V(ADD@CASE)
         BALR  14,15
         B     @@L1516
@@L1524  EQU   *
         SLR   15,15
@@L1516  EQU   *
* Function pcase epilogue
         PDPEPIL
* Function pcase literal pool
         DS    0F
         LTORG
* Function pcase page table
         DS    0F
@@PGT93  EQU   *
         DC    A(@@PG93)
         DS    0F
* X-func pcasrang prologue
PCASRANG PDPPRLG CINDEX=94,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN94
         LTORG
@@FEN94  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG94   EQU   *
         LR    11,1
         L     10,=A(@@PGT94)
* Function pcasrang code
         L     5,0(11)
         L     4,4(11)
         L     7,8(11)
         L     2,=V(CFUN)
         L     2,0(2)
         L     15,4(2)
         L     3,16(15)
         LTR   3,3
         BE    @@L1528
         L     2,16(3)
         LTR   2,2
         BNE   @@L1527
@@L1528  EQU   *
         LA    2,1(0,0)
         B     @@L1526
@@L1527  EQU   *
         L     2,4(15)
         LTR   2,2
         BE    @@L1529
         L     2,8(2)
         C     2,8(3)
         BNH   @@L1529
         LA    2,5(0,0)
         B     @@L1526
@@L1529  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     3,16(2)
         L     2,28(3)
         L     6,4(2)
         L     3,32(3)
         L     2,=V(GLOBAL@T)
         CL    6,0(2)
         BE    @@L1539
         LA    1,88(,13)
         L     15,=A(@@23)
         BALR  14,15
         LTR   5,5
         BE    @@L1540
@@L1531  EQU   *
         LTR   4,4
         BE    @@L1541
@@L1532  EQU   *
         LTR   4,4
         BE    @@L1533
         ST    4,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LA    2,4(0,0)
         LTR   15,15
         BNE   @@L1526
@@L1533  EQU   *
         LTR   4,4
         BE    @@L1542
@@L1534  EQU   *
         ST    3,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         LA    15,0(7)
         BALR  14,15
         LR    5,15
         ST    3,88(13)
         ST    4,92(13)
         LA    1,88(,13)
         LA    15,0(7)
         BALR  14,15
         LR    4,15
         L     2,8(5)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BE    @@L1543
@@L1538  EQU   *
         LA    2,3(0,0)
         B     @@L1526
@@L1543  EQU   *
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BE    @@L1538
         L     2,8(4)
         SRL   2,13
         N     2,=F'1'
         LTR   2,2
         BNE   @@L1538
         ST    4,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(INT@FITS)
         BALR  14,15
         LTR   15,15
         BE    @@L1538
         ST    5,88(13)
         ST    4,92(13)
         MVC   96(4,13),12(11)
         MVC   100(4,13),16(11)
         LA    1,88(,13)
         L     15,=V(ADD@CASE)
         BALR  14,15
         LR    2,15
         B     @@L1526
@@L1542  EQU   *
         L     4,60(3)
         B     @@L1534
@@L1541  EQU   *
         L     4,60(6)
         B     @@L1532
@@L1540  EQU   *
         L     5,56(6)
         B     @@L1531
@@L1539  EQU   *
         SLR   2,2
@@L1526  EQU   *
         LR    15,2
* Function pcasrang epilogue
         PDPEPIL
* Function pcasrang literal pool
         DS    0F
         LTORG
* Function pcasrang page table
         DS    0F
@@PGT94  EQU   *
         DC    A(@@PG94)
         DS    0F
* X-func add_case_node prologue
ADD@CASE PDPPRLG CINDEX=95,FRAME=96,BASER=12,ENTRY=YES
         B     @@FEN95
         LTORG
@@FEN95  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG95   EQU   *
         LR    11,1
         L     10,=A(@@PGT95)
* Function add_case_node code
         L     6,0(11)
         L     5,4(11)
         L     7,8(11)
         L     8,12(11)
         LTR   5,5
         BE    @@L1614
@@L1545  EQU   *
         LTR   5,5
         BE    @@L1615
@@L1546  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,16(2)
         A     2,=F'20'
         L     4,0(2)
         LR    3,4
         LTR   4,4
         BE    @@L1601
@@L1555  EQU   *
         LR    4,3
         ST    5,88(13)
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LR    2,3
         LTR   15,15
         BE    @@L1616
@@L1548  EQU   *
         L     3,0(2)
         LTR   3,3
         BNE   @@L1555
@@L1601  EQU   *
         MVC   88(4,13),=F'28'
         LA    1,88(,13)
         L     15,=V(XMALLOC)
         BALR  14,15
         LR    3,15
         ST    6,12(15)
         ST    6,88(13)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BE    @@L1556
         MVC   16(4,3),12(3)
@@L1557  EQU   *
         ST    7,20(3)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(EXPLAB)
         BALR  14,15
         ST    3,0(2)
         ST    4,8(3)
         MVC   0(4,3),=F'0'
         MVC   4(4,3),=F'0'
         MVC   24(4,3),=F'0'
         LTR   4,4
         BE    @@L1559
@@L1599  EQU   *
         CL    3,0(4)
         BE    @@L1617
         L     15,24(4)
         LTR   15,15
         BNE   @@L1581
         MVC   24(4,4),=F'1'
@@L1580  EQU   *
         LR    3,4
         L     4,8(4)
         LTR   4,4
         BNE   @@L1599
@@L1559  EQU   *
         SLR   15,15
         B     @@L1544
@@L1581  EQU   *
         LTR   15,15
         BNH   @@L1583
         L     2,24(3)
         LTR   2,2
         BNH   @@L1584
         L     15,0(3)
         ST    15,4(4)
         LTR   15,15
         BE    @@L1585
         ST    4,8(15)
@@L1585  EQU   *
         ST    4,0(3)
@@L1612  EQU   *
         MVC   24(4,4),=F'0'
         MVC   24(4,3),=F'0'
         L     15,8(4)
         ST    3,8(4)
         ST    15,8(3)
         LTR   15,15
         BE    @@L1586
         L     2,0(15)
         CLR   2,4
         BE    @@L1605
         ST    3,4(15)
         B     @@L1559
@@L1605  EQU   *
         ST    3,0(15)
         B     @@L1559
@@L1586  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,16(2)
         ST    3,20(2)
         B     @@L1559
@@L1584  EQU   *
         L     5,0(3)
         L     15,0(5)
         ST    15,4(4)
         LTR   15,15
         BE    @@L1591
         ST    4,8(15)
@@L1591  EQU   *
         ST    4,0(5)
         L     15,4(5)
         ST    15,0(3)
         LTR   15,15
         BE    @@L1592
         ST    3,8(15)
@@L1592  EQU   *
         ST    3,4(5)
         L     15,24(5)
         LR    2,15
         SRL   2,31
         ST    2,24(3)
         LCR   2,2
         SR    2,15
         ST    2,24(4)
@@L1613  EQU   *
         MVC   24(4,5),=F'0'
         L     15,8(4)
         ST    5,8(4)
         ST    5,8(3)
         ST    15,8(5)
         LTR   15,15
         BE    @@L1594
         L     2,0(15)
         CLR   2,4
         BE    @@L1606
         ST    5,4(15)
         B     @@L1559
@@L1606  EQU   *
         ST    5,0(15)
         B     @@L1559
@@L1594  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,16(2)
         ST    5,20(2)
         B     @@L1559
@@L1583  EQU   *
         MVC   24(4,4),=F'0'
         B     @@L1559
@@L1617  EQU   *
         L     15,24(4)
         LTR   15,15
         BNE   @@L1562
         MVC   24(4,4),=F'-1'
         B     @@L1580
@@L1562  EQU   *
         LTR   15,15
         BNL   @@L1583
         L     2,24(3)
         LTR   2,2
         BL    @@L1618
         L     5,4(3)
         L     15,4(5)
         ST    15,0(4)
         LTR   15,15
         BE    @@L1572
         ST    4,8(15)
@@L1572  EQU   *
         ST    4,4(5)
         L     15,0(5)
         ST    15,4(3)
         LTR   15,15
         BE    @@L1573
         ST    3,8(15)
@@L1573  EQU   *
         ST    3,0(5)
         L     15,24(5)
         LR    2,15
         SRL   2,31
         ST    2,24(4)
         LCR   2,2
         SR    2,15
         ST    2,24(3)
         B     @@L1613
@@L1618  EQU   *
         L     15,4(3)
         ST    15,0(4)
         LTR   15,15
         BE    @@L1566
         ST    4,8(15)
@@L1566  EQU   *
         ST    4,4(3)
         B     @@L1612
@@L1556  EQU   *
         ST    5,16(3)
         B     @@L1557
@@L1616  EQU   *
         MVC   88(4,13),16(3)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LR    2,3
         A     2,=F'4'
         LTR   15,15
         BNE   @@L1548
         MVC   0(4,8),20(3)
@@L1609  EQU   *
         LA    15,2(0,0)
         B     @@L1544
@@L1615  EQU   *
         LTR   6,6
         BNE   @@L1546
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     3,16(2)
         L     2,24(3)
         LTR   2,2
         BE    @@L1547
         ST    2,0(8)
         B     @@L1609
@@L1547  EQU   *
         ST    7,24(3)
         ST    7,88(13)
         LA    1,88(,13)
         L     15,=A(EXPLAB)
         BALR  14,15
         B     @@L1559
@@L1614  EQU   *
         LR    5,6
         B     @@L1545
@@L1544  EQU   *
* Function add_case_node epilogue
         PDPEPIL
* Function add_case_node literal pool
         DS    0F
         LTORG
* Function add_case_node page table
         DS    0F
@@PGT95  EQU   *
         DC    A(@@PG95)
         DS    0F
* X-func all_cases_count prologue
ALL@CASE PDPPRLG CINDEX=96,FRAME=104,BASER=12,ENTRY=YES
         B     @@FEN96
         LTORG
@@FEN96  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG96   EQU   *
         LR    11,1
         L     10,=A(@@PGT96)
* Function all_cases_count code
         L     6,0(11)
         L     7,4(11)
         MVC   0(4,7),=F'0'
         SLR   2,2
         IC    2,8(6)
         LA    3,10(0,0)
         CLR   2,3
         BE    @@L1627
         BNH   @@L1624
         LA    3,11(0,0)
         CLR   2,3
         BE    @@L1621
         LA    3,12(0,0)
         CLR   2,3
         BE    @@L1622
@@L1624  EQU   *
         L     2,60(6)
         LTR   2,2
         BNE   @@L1642
@@L1629  EQU   *
         L     15,=F'-1'
         B     @@L1619
@@L1642  EQU   *
         MVC   88(4,13),=F'60'
         ST    6,92(13)
         ST    2,96(13)
         MVC   100(4,13),56(6)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L1629
         ST    6,88(13)
         L     2,=V(GLOBAL@T)
         MVC   92(4,13),44(2)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         MVC   88(4,13),=F'59'
         ST    6,92(13)
         ST    3,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L1629
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    @@L1629
         ST    3,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    5,15
@@L1620  EQU   *
         LR    15,5
         B     @@L1619
@@L1622  EQU   *
         LA    5,256(0,0)
         B     @@L1620
@@L1621  EQU   *
         LA    5,2(0,0)
         B     @@L1620
@@L1627  EQU   *
         MVC   88(4,13),56(6)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    @@L1629
         L     2,60(6)
         LTR   2,2
         BE    @@L1629
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(HOST@INT)
         BALR  14,15
         LTR   15,15
         BE    @@L1629
         MVC   88(4,13),56(6)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    4,15
         LR    8,15
         SLR   5,5
         L     3,12(6)
         LTR   3,3
         BE    @@L1620
@@L1638  EQU   *
         MVC   88(4,13),16(3)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         L     2,0(7)
         LA    6,2(0,0)
         CR    2,6
         BE    @@L1635
         CR    15,4
         BH    @@L1634
@@L1635  EQU   *
         MVC   0(4,7),=F'2'
@@L1636  EQU   *
         LR    4,15
         A     5,=F'1'
         L     3,0(3)
         LTR   3,3
         BNE   @@L1638
         B     @@L1620
@@L1634  EQU   *
         LR    2,8
         AR    2,5
         CLR   15,2
         BE    @@L1636
         MVC   0(4,7),=F'1'
         B     @@L1636
@@L1619  EQU   *
* Function all_cases_count epilogue
         PDPEPIL
* Function all_cases_count literal pool
         DS    0F
         LTORG
* Function all_cases_count page table
         DS    0F
@@PGT96  EQU   *
         DC    A(@@PG96)
         DS    0F
* X-func mark_seen_cases prologue
MARK@SEE PDPPRLG CINDEX=97,FRAME=120,BASER=12,ENTRY=YES
         B     @@FEN97
         LTORG
@@FEN97  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG97   EQU   *
         LR    11,1
         L     10,=A(@@PGT97)
* Function mark_seen_cases code
         L     7,0(11)
         SLR   8,8
         LR    9,8
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,16(2)
         L     6,20(2)
         MVC   88(4,13),=F'25'
         LA    1,88(,13)
         L     15,=V(MAKE@NOD)
         BALR  14,15
         LR    5,15
         ST    7,4(15)
         LTR   6,6
         BE    @@L1643
         L     3,12(11)
         LA    2,2(0,0)
         CLR   3,2
         BE    @@L1685
         L     2,0(6)
         LTR   2,2
         BNE   @@L1686
@@L1661  EQU   *
         LR    4,6
         LTR   6,6
         BE    @@L1643
@@L1681  EQU   *
         L     2,12(4)
         MVC   16(4,5),16(2)
         L     2,12(4)
         MVC   20(4,5),20(2)
@@L1666  EQU   *
         MVC   88(4,13),16(4)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LTR   15,15
         BNE   @@L1687
         L     6,12(11)
         LTR   6,6
         BE    @@L1669
         L     2,12(7)
         LTR   2,2
         BE    @@L1669
         LR    3,9
         ST    8,112(13)
         ST    15,116(13)
@@L1670  EQU   *
         LTR   3,3
         BE    @@L1688
@@L1673  EQU   *
         ST    5,88(13)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1684
         L     2,112(13)
         A     2,=F'1'
         ST    2,112(13)
         L     3,0(3)
         CLR   3,9
         BNE   @@L1670
         MVC   112(4,13),=F'-1'
@@L1676  EQU   *
         L     2,116(13)
         LTR   2,2
         BNE   @@L1679
         L     15,112(13)
         CL    15,8(11)
         BNL   @@L1679
         LR    2,15
         SRL   2,3
         N     15,=F'7'
         LA    3,1(0,0)
         SLL   3,0(15)
         L     6,4(11)
         IC    6,0(2,6)
         OR    3,6
         L     6,4(11)
         STC   3,0(2,6)
@@L1679  EQU   *
         MVC   88(4,13),16(5)
         MVC   92(4,13),20(5)
         MVC   96(4,13),=F'1'
         MVC   100(4,13),=F'0'
         A     5,=F'16'
         ST    5,104(13)
         A     5,=F'4'
         ST    5,108(13)
         A     5,=F'-20'
         LA    1,88(,13)
         L     15,=V(ADD@DOUB)
         BALR  14,15
         B     @@L1666
@@L1684  EQU   *
         L     9,0(3)
         L     8,112(13)
         A     8,=F'1'
         B     @@L1676
@@L1688  EQU   *
         L     3,12(7)
         MVC   112(4,13),=F'0'
         B     @@L1673
@@L1669  EQU   *
         L     3,56(7)
         LTR   3,3
         BE    @@L1677
         MVC   88(4,13),16(3)
         MVC   92(4,13),20(3)
         LA    2,112(,13)
         ST    2,96(13)
         LA    2,116(,13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(NEG@DOUB)
         BALR  14,15
@@L1678  EQU   *
         MVC   88(4,13),112(13)
         MVC   92(4,13),116(13)
         MVC   96(4,13),16(5)
         MVC   100(4,13),20(5)
         LA    2,112(,13)
         ST    2,104(13)
         LA    2,116(,13)
         ST    2,108(13)
         LA    1,88(,13)
         L     15,=V(ADD@DOUB)
         BALR  14,15
         B     @@L1676
@@L1677  EQU   *
         ST    3,116(13)
         ST    3,112(13)
         B     @@L1678
@@L1687  EQU   *
         L     4,4(4)
         LTR   4,4
         BNE   @@L1681
         B     @@L1643
@@L1686  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,16(2)
         ST    6,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@24)
         BALR  14,15
         LR    6,15
         ST    15,20(2)
         B     @@L1661
@@L1685  EQU   *
         L     2,12(6)
         MVC   4(4,15),4(2)
         L     7,12(7)
         LTR   7,7
         BE    @@L1643
@@L1659  EQU   *
         L     2,16(7)
         MVC   16(4,5),16(2)
         L     2,16(7)
         MVC   20(4,5),20(2)
         LR    4,6
@@L1651  EQU   *
         ST    5,88(13)
         MVC   92(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LTR   15,15
         BE    @@L1654
         L     4,0(4)
@@L1653  EQU   *
         LTR   4,4
         BNE   @@L1651
@@L1649  EQU   *
         L     7,0(7)
         A     8,=F'1'
         LTR   7,7
         BNE   @@L1659
         B     @@L1643
@@L1654  EQU   *
         MVC   88(4,13),16(4)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LTR   15,15
         BE    @@L1656
         L     4,4(4)
         B     @@L1653
@@L1656  EQU   *
         LR    4,8
         SRL   4,3
         LR    3,8
         N     3,=F'7'
         LA    2,1(0,0)
         SLL   2,0(3)
         L     3,4(11)
         IC    3,0(4,3)
         OR    2,3
         L     3,4(11)
         STC   2,0(4,3)
         B     @@L1649
@@L1643  EQU   *
* Function mark_seen_cases epilogue
         PDPEPIL
* Function mark_seen_cases literal pool
         DS    0F
         LTORG
* Function mark_seen_cases page table
         DS    0F
@@PGT97  EQU   *
         DC    A(@@PG97)
@@LC28   EQU   *
         DC    C'case value `%ld'' not in enumerated type `%s'''
         DC    X'0'
@@LC27   EQU   *
         DC    C'case value `%ld'' not in enumerated type'
         DC    X'0'
@@LC26   EQU   *
         DC    C'enumeration value `%s'' not handled in switch'
         DC    X'0'
         DS    0F
* X-func chkffeh prologue
CHKFFEH  PDPPRLG CINDEX=98,FRAME=112,BASER=12,ENTRY=YES
         B     @@FEN98
         LTORG
@@FEN98  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG98   EQU   *
         LR    11,1
         L     10,=A(@@PGT98)
* Function chkffeh code
         L     8,0(11)
         SLR   3,3
         ST    3,104(13)
         L     2,=V(WARN@SWI)
         L     2,0(2)
         LTR   2,2
         BE    @@L1689
         ST    8,88(13)
         LA    2,104(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(ALL@CASE)
         BALR  14,15
         LR    5,15
         LR    2,15
         A     2,=F'8'
         BL    @@L1732
@@L1691  EQU   *
         LR    4,2
         SRA   4,3
         LR    2,5
         BCTR  2,0
         L     6,=F'599998'
         CLR   2,6
         BNH   @@L1733
@@L1692  EQU   *
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     4,16(2)
         L     3,20(4)
         LTR   3,3
         BE    @@L1700
         L     2,0(3)
         LTR   2,2
         BNE   @@L1734
@@L1700  EQU   *
         L     2,=V(WARN@SWI)
         L     2,0(2)
         LTR   2,2
         BE    @@L1689
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     2,16(2)
         L     4,20(2)
         LTR   4,4
         BE    @@L1689
@@L1729  EQU   *
         L     2,12(8)
@@L1706  EQU   *
         LTR   2,2
         BE    @@L1707
         MVC   88(4,13),12(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1707
         L     2,0(2)
         B     @@L1706
@@L1707  EQU   *
         LTR   2,2
         BE    @@L1735
@@L1712  EQU   *
         MVC   88(4,13),12(4)
         MVC   92(4,13),16(4)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1704
         L     2,12(8)
@@L1718  EQU   *
         LTR   2,2
         BE    @@L1719
         MVC   88(4,13),16(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1719
         L     2,0(2)
         B     @@L1718
@@L1719  EQU   *
         LTR   2,2
         BE    @@L1736
@@L1704  EQU   *
         L     4,4(4)
         LTR   4,4
         BNE   @@L1729
         B     @@L1689
@@L1736  EQU   *
         L     3,52(8)
         LTR   3,3
         BE    @@L1737
         MVC   88(4,13),=A(@@LC28)
         L     2,16(4)
         MVC   92(4,13),16(2)
         CLI   8(3),1
         BE    @@L1738
         L     2,44(3)
@@L1728  EQU   *
         MVC   96(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     @@L1704
@@L1738  EQU   *
         LR    2,3
         B     @@L1728
@@L1737  EQU   *
         MVC   88(4,13),=A(@@LC27)
         L     2,16(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     @@L1704
@@L1735  EQU   *
         L     3,52(8)
         LTR   3,3
         BE    @@L1739
         MVC   88(4,13),=A(@@LC28)
         L     2,12(4)
         MVC   92(4,13),16(2)
         CLI   8(3),1
         BE    @@L1740
         L     2,44(3)
@@L1716  EQU   *
         MVC   96(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     @@L1712
@@L1740  EQU   *
         LR    2,3
         B     @@L1716
@@L1739  EQU   *
         MVC   88(4,13),=A(@@LC27)
         L     2,12(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     @@L1712
@@L1734  EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@24)
         BALR  14,15
         ST    15,20(4)
         B     @@L1700
@@L1733  EQU   *
         ST    4,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(CALLOC)
         BALR  14,15
         LR    6,15
         LTR   15,15
         BE    @@L1692
         L     4,12(8)
         ST    8,88(13)
         ST    15,92(13)
         ST    5,96(13)
         MVC   100(4,13),104(13)
         LA    1,88(,13)
         L     15,=A(MARK@SEE)
         BALR  14,15
         LR    7,3
         LTR   4,4
         BE    @@L1694
         CR    3,5
         BNL   @@L1694
@@L1699  EQU   *
         LR    2,7
         SRL   2,3
         SLR   3,3
         IC    3,0(2,6)
         LR    2,3
         LR    3,7
         N     3,=F'7'
         SRA   2,0(3)
         N     2,=F'1'
         LTR   2,2
         BE    @@L1741
@@L1695  EQU   *
         A     7,=F'1'
         L     4,0(4)
         LTR   4,4
         BE    @@L1694
         CR    7,5
         BL    @@L1699
@@L1694  EQU   *
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
         B     @@L1692
@@L1741  EQU   *
         MVC   88(4,13),=A(@@LC26)
         L     2,12(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(WARNING)
         BALR  14,15
         B     @@L1695
@@L1732  EQU   *
         A     2,=F'7'
         B     @@L1691
@@L1689  EQU   *
* Function chkffeh epilogue
         PDPEPIL
* Function chkffeh literal pool
         DS    0F
         LTORG
* Function chkffeh page table
         DS    0F
@@PGT98  EQU   *
         DC    A(@@PG98)
         DS    0F
* S-func free_case_nodes prologue
@@25     PDPPRLG CINDEX=99,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN99
         LTORG
@@FEN99  EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG99   EQU   *
         LR    11,1
         L     10,=A(@@PGT99)
* Function free_case_nodes code
         L     2,0(11)
         LTR   2,2
         BE    @@L1742
         MVC   88(4,13),0(2)
         LA    1,88(,13)
         L     15,=A(@@25)
         BALR  14,15
         MVC   88(4,13),4(2)
         LA    1,88(,13)
         L     15,=A(@@25)
         BALR  14,15
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(FREE)
         BALR  14,15
@@L1742  EQU   *
* Function free_case_nodes epilogue
         PDPEPIL
* Function free_case_nodes literal pool
         DS    0F
         LTORG
* Function free_case_nodes page table
         DS    0F
@@PGT99  EQU   *
         DC    A(@@PG99)
         DS    0F
* X-func eecastype prologue
EECASTYP PDPPRLG CINDEX=100,FRAME=152,BASER=12,ENTRY=YES
         B     @@FEN100
         LTORG
@@FEN100 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG100  EQU   *
         LR    11,1
         L     10,=A(@@PGT100)
* Function eecastype code
         MVC   120(4,13),=F'0'
         MVC   124(4,13),120(13)
         SLR   7,7
         L     2,=V(CFUN)
         L     2,0(2)
         L     2,4(2)
         L     8,16(2)
         LTR   8,8
         L     14,=A(@@L1745)
         BER   14
         LA    1,88(,13)
         L     15,=V(GEN@LABE)
         BALR  14,15
         ST    15,132(13)
         L     5,28(8)
         L     9,4(5)
         L     2,8(9)
         SRL   2,18
         ST    2,136(13)
         NC    136(4,13),=F'1'
         L     3,4(11)
         LTR   3,3
         L     14,=A(@@L1844)
         BER   14
@@L1747  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=A(@@23)
         BALR  14,15
         L     2,=V(GLOBAL@T)
         CL    9,0(2)
         L     14,=A(@@L1748)
         BER   14
         L     2,24(8)
         LTR   2,2
         BNE   @@L1749
         L     6,4(11)
         CLI   8(6),10
         L     14,=A(@@L1845)
         BER   14
@@L1749  EQU   *
         L     12,0(,10)
         L     2,24(8)
         LTR   2,2
         L     14,=A(@@L1846)
         BER   14
@@L1750  EQU   *
         L     12,0(,10)
         MVC   88(4,13),24(8)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,128(13)
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         ST    15,112(13)
         L     3,20(8)
         LTR   3,3
         BE    @@L1751
         L     2,0(3)
         LTR   2,2
         L     14,=A(@@L1847)
         BNER  14
@@L1751  EQU   *
         L     12,0(,10)
         MVC   88(4,13),20(8)
         LA    1,88(,13)
         L     15,=A(@@26)
         BALR  14,15
         SLR   6,6
         L     3,20(8)
         LTR   3,3
         BE    @@L1832
@@L1765  EQU   *
         L     2,12(3)
         CLI   8(2),25
         BE    @@L1756
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'5357'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L1756  EQU   *
         L     2,16(3)
         CLI   8(2),25
         BE    @@L1757
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'5359'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
@@L1757  EQU   *
         ST    9,88(13)
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    15,12(3)
         ST    9,88(13)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         ST    15,16(3)
         A     6,=F'1'
         LA    2,1(0,0)
         CR    6,2
         L     14,=A(@@L1848)
         BER   14
         L     4,12(3)
         L     15,20(4)
         L     2,120(13)
         MVC   144(4,13),20(2)
         C     15,144(13)
         L     14,=A(@@L1761)
         BLR   14
         L     14,=A(@@L1849)
         BER   14
@@L1760  EQU   *
         L     12,0(,10)
         L     4,16(3)
         L     2,124(13)
         L     15,20(2)
         L     2,20(4)
         CR    15,2
         L     14,=A(@@L1763)
         BLR   14
         L     14,=A(@@L1850)
         BER   14
@@L1759  EQU   *
         L     12,0(,10)
         MVC   88(4,13),12(3)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1754
         A     6,=F'1'
@@L1754  EQU   *
         L     3,4(3)
         LTR   3,3
         BNE   @@L1765
@@L1832  EQU   *
         LTR   6,6
         L     14,=A(@@L1851)
         BNER  14
@@L1766  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(END@CLEA)
         BALR  14,15
         LTR   6,6
         BNE   @@L1767
         ST    5,88(13)
         L     2,=V(CIRTX)
         MVC   92(4,13),256(2)
         ST    6,96(13)
         ST    6,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
@@L1790  EQU   *
         MVC   88(4,13),128(13)
@@L1843  EQU   *
         LA    1,88(,13)
         L     15,=A(EMJMP)
         BALR  14,15
@@L1768  EQU   *
         L     12,0(,10)
         L     2,112(13)
         MVC   112(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         ST    15,116(13)
         LA    2,112(,13)
         ST    2,88(13)
         LA    2,116(,13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(SQUEEZE@)
         BALR  14,15
         CLM   15,1,=XL1'00'
         BNE   @@L1852
@@L1816  EQU   *
         MVC   88(4,13),112(13)
         MVC   92(4,13),116(13)
         MVC   96(4,13),16(8)
         LA    1,88(,13)
         L     15,=V(REOINSNS)
         BALR  14,15
@@L1817  EQU   *
         L     12,0(,10)
         L     2,12(8)
         LTR   2,2
         BNE   @@L1853
@@L1818  EQU   *
         L     3,=V(CFUN)
         L     2,0(3)
         L     2,4(2)
         L     2,16(2)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(@@25)
         BALR  14,15
         L     2,0(3)
         L     2,4(2)
         L     5,16(2)
@@L1820  EQU   *
         L     2,=V(CFUN)
         L     15,0(2)
         L     3,4(15)
         L     4,20(3)
         L     2,12(3)
         CLR   2,4
         BE    @@L1854
@@L1823  EQU   *
         L     3,4(15)
         L     2,8(3)
         CLR   2,4
         BE    @@L1855
@@L1824  EQU   *
         L     3,4(15)
         L     2,0(3)
         CLR   2,4
         BE    @@L1856
@@L1825  EQU   *
         L     3,4(15)
         L     2,4(3)
         CLR   2,4
         BE    @@L1857
@@L1826  EQU   *
         L     3,4(15)
         L     2,16(3)
         CLR   2,4
         BE    @@L1858
@@L1827  EQU   *
         L     2,4(15)
         L     3,20(2)
         L     3,8(3)
         BCTR  3,0
         ST    3,24(2)
         MVC   20(4,2),0(4)
         L     2,=A(STMT@OBS)
         CL    4,4(2)
         BNH   @@L1828
         CL    4,16(2)
         BNL   @@L1828
         ST    4,8(2)
         ST    4,12(2)
@@L1822  EQU   *
         CLR   4,5
         BNE   @@L1820
         LA    1,88(,13)
         L     15,=V(FTEMPSL)
         BALR  14,15
         L     14,=A(@@L1745)
         BR    14
@@L1828  EQU   *
         MVC   88(4,13),=A(STMT@OBS)
         ST    4,92(13)
         LA    1,88(,13)
         L     15,=V(OBSTACK@)
         BALR  14,15
         B     @@L1822
@@L1858  EQU   *
         MVC   16(4,3),4(4)
         B     @@L1827
@@L1857  EQU   *
         MVC   4(4,3),4(4)
         B     @@L1826
@@L1856  EQU   *
         MVC   0(4,3),4(4)
         B     @@L1825
@@L1855  EQU   *
         MVC   8(4,3),4(4)
         B     @@L1824
@@L1854  EQU   *
         MVC   12(4,3),4(4)
         B     @@L1823
@@L1853  EQU   *
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         B     @@L1818
@@L1852  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'5568'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L1816
@@L1767  EQU   *
         LA    1,88(,13)
         L     15,=V(CASE@VAL)
         BALR  14,15
         CLR   6,15
         BL    @@L1770
         ST    7,88(13)
         LR    2,6
         SLL   2,3
         AR    2,6
         AR    2,6
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(CTREENT)
         BALR  14,15
         LTR   15,15
         BNH   @@L1859
@@L1770  EQU   *
         L     12,0(,10)
         ST    5,88(13)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         LR    4,15
         SLR   2,2
         IC    2,2(15)
         MH    2,=H'4'
         L     3,=V(MODE@CLA)
         L     2,0(2,3)
         LA    3,1(0,0)
         CLR   2,3
         BE    @@L1860
@@L1771  EQU   *
         LA    1,88(,13)
         L     15,=V(EMIT@QUE)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(DO@PENDI)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(PROTECT@)
         BALR  14,15
         LR    4,15
         LH    2,0(15)
         CLM   2,3,=H'66'
         BE    @@L1861
@@L1778  EQU   *
         LH    2,0(4)
         CLM   2,3,=H'54'
         BE    @@L1780
         CLI   8(5),25
         BE    @@L1780
         SLR   3,3
         L     2,4(11)
         CLI   8(2),10
         BE    @@L1793
         MVC   88(4,13),20(8)
         LA    1,88(,13)
         L     15,=A(@@28)
         BALR  14,15
         LTR   15,15
         BE    @@L1793
         LA    3,1(0,0)
@@L1793  EQU   *
         L     2,=A(@@27)
         ST    3,0(2)
         LR    2,8
         A     2,=F'20'
         ST    2,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@29)
         BALR  14,15
         ST    4,88(13)
         MVC   92(4,13),0(2)
         MVC   96(4,13),128(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=A(@@30)
         BALR  14,15
         MVC   88(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         B     @@L1768
@@L1780  EQU   *
         CLI   8(5),25
         BE    @@L1781
         MVC   88(4,13),4(4)
         L     15,136(13)
         LTR   15,15
         BNE   @@L1782
         L     2,4(4)
         L     3,=F'-1'
         LTR   2,2
         BL    @@L1783
@@L1782  EQU   *
         SLR   3,3
@@L1783  EQU   *
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(BINT2WID)
         BALR  14,15
         ST    9,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    5,15
@@L1781  EQU   *
         L     3,20(8)
         LTR   3,3
         BE    @@L1785
@@L1789  EQU   *
         ST    5,88(13)
         MVC   92(4,13),12(3)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LTR   15,15
         BE    @@L1862
@@L1786  EQU   *
         L     3,4(3)
         LTR   3,3
         BNE   @@L1789
@@L1785  EQU   *
         LTR   3,3
         BE    @@L1790
         MVC   88(4,13),20(3)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         B     @@L1843
@@L1862  EQU   *
         MVC   88(4,13),16(3)
         ST    5,92(13)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LTR   15,15
         BNE   @@L1786
         B     @@L1785
@@L1861  EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(COPYTREG)
         BALR  14,15
         LR    4,15
         B     @@L1778
@@L1860  EQU   *
         MVC   88(4,13),=F'74'
         SLR   2,2
         IC    2,2(15)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         BNE   @@L1771
         SLR   3,3
         IC    3,2(4)
         LTR   3,3
         BE    @@L1771
@@L1777  EQU   *
         MVC   88(4,13),=F'74'
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=V(HAVE@INS)
         BALR  14,15
         LTR   15,15
         BNE   @@L1841
         L     2,=V(MODE@WID)
         SLR   6,6
         IC    6,0(2,3)
         LR    3,6
         LTR   6,6
         BNE   @@L1777
         B     @@L1771
@@L1841  EQU   *
         ST    3,88(13)
         ST    4,92(13)
         MVC   96(4,13),136(13)
         LA    1,88(,13)
         L     15,=V(CTTOMODE)
         BALR  14,15
         LR    4,15
         B     @@L1771
@@L1859  EQU   *
         ST    7,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(CTREENT)
         BALR  14,15
         LTR   15,15
         BL    @@L1770
         IC    2,8(5)
         CLM   2,1,=XL1'19'
         BE    @@L1770
         CLM   2,1,=XL1'2F'
         L     14,=A(@@L1863)
         BER   14
@@L1769  EQU   *
         L     12,0(,10)
         ST    9,88(13)
         ST    5,92(13)
         MVC   96(4,13),120(13)
         ST    7,100(13)
         MVC   104(4,13),132(13)
         MVC   108(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(TRY@CASE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1795
         L     9,32(8)
         L     2,=V(OPTZSZ)
         L     2,0(2)
         LTR   2,2
         L     14,=A(@@L1864)
         BER   14
@@L1796  EQU   *
         L     12,0(,10)
         ST    9,88(13)
         ST    5,92(13)
         MVC   96(4,13),120(13)
         ST    7,100(13)
         MVC   104(4,13),132(13)
         MVC   108(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(TRY@TABL)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L1865)
         BER   14
@@L1795  EQU   *
         L     12,0(,10)
         ST    7,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    5,15
         A     5,=F'1'
         LR    2,5
         MH    2,=H'4'
         ST    2,88(13)
         LA    1,88(,13)
         L     15,=V(C@ALLOCA)
         BALR  14,15
         LR    6,15
         ST    15,88(13)
         MVC   92(4,13),=F'0'
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(MEMSET)
         BALR  14,15
         L     3,20(8)
         LTR   3,3
         BE    @@L1836
@@L1807  EQU   *
         MVC   88(4,13),=F'60'
         ST    9,92(13)
         MVC   96(4,13),12(3)
         MVC   100(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'60'
         ST    9,92(13)
         MVC   96(4,13),16(3)
         MVC   100(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,88(13)
         MVC   92(4,13),=F'1'
         LA    1,88(,13)
         L     15,=V(TREE@LOW)
         BALR  14,15
         LR    7,15
         CR    2,15
         BH    @@L1838
         LR    4,2
         MH    4,=H'4'
         AR    4,6
@@L1806  EQU   *
         MVC   88(4,13),20(3)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         ST    15,0(4)
         A     4,=F'4'
         A     2,=F'1'
         CR    2,7
         BNH   @@L1806
@@L1838  EQU   *
         L     3,4(3)
         LTR   3,3
         BNE   @@L1807
@@L1836  EQU   *
         SLR   3,3
         CR    3,5
         BNL   @@L1840
@@L1813  EQU   *
         LR    4,3
         MH    4,=H'4'
         L     2,0(4,6)
         LTR   2,2
         BE    @@L1866
@@L1810  EQU   *
         A     3,=F'1'
         CR    3,5
         BL    @@L1813
@@L1840  EQU   *
         MVC   88(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(EMLAB)
         BALR  14,15
         L     2,=V(FLAG@PIC)
         L     2,0(2)
         LTR   2,2
         BE    @@L1814
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),132(13)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(GENRTV)
         BALR  14,15
         MVC   88(4,13),=F'45'
         MVC   92(4,13),=F'4'
         ST    2,96(13)
         ST    15,100(13)
         L     2,=V(CIRTX)
         MVC   104(4,13),256(2)
         MVC   108(4,13),104(13)
         LA    1,88(,13)
         L     15,=V(GREE0)
         BALR  14,15
@@L1842  EQU   *
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(EMJI)
         BALR  14,15
         LA    1,88(,13)
         L     15,=V(EMBAR)
         BALR  14,15
         B     @@L1768
@@L1814  EQU   *
         ST    5,88(13)
         ST    6,92(13)
         LA    1,88(,13)
         L     15,=V(GENRTV)
         BALR  14,15
         MVC   88(4,13),=F'44'
         MVC   92(4,13),=F'4'
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(GRFME)
         BALR  14,15
         B     @@L1842
@@L1866  EQU   *
         MVC   88(4,13),=F'67'
         MVC   92(4,13),=F'4'
         MVC   96(4,13),128(13)
         LA    1,88(,13)
         L     15,=V(GRFU00)
         BALR  14,15
         ST    15,0(4,6)
         B     @@L1810
@@L1865  EQU   *
         MVC   88(4,13),=A(@@LC0)
         MVC   92(4,13),=F'5511'
         MVC   96(4,13),=A(@@LC1)
         LA    1,88(,13)
         L     15,=V(FANCY@AB)
         BALR  14,15
         B     @@L1795
@@L1864  EQU   *
         MVC   88(4,13),120(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(CTREENT)
         BALR  14,15
         LTR   15,15
         BNH   @@L1796
         MVC   88(4,13),120(13)
         MVC   92(4,13),=F'3'
         LA    1,88(,13)
         L     15,=V(CTREENT)
         BALR  14,15
         LTR   15,15
         BNL   @@L1796
         L     2,=V(GLOBAL@T)
         MVC   120(4,13),44(2)
         L     7,124(13)
         B     @@L1796
@@L1863  EQU   *
         L     2,20(5)
         CLI   8(2),25
         BNE   @@L1769
         B     @@L1770
@@L1851  EQU   *
         MVC   88(4,13),=F'60'
         ST    9,92(13)
         MVC   96(4,13),124(13)
         MVC   100(4,13),120(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    7,15
         B     @@L1766
@@L1850  EQU   *
         L     15,124(13)
         L     2,16(15)
         CL    2,16(4)
         BNL   @@L1759
@@L1763  EQU   *
         ST    4,124(13)
         B     @@L1759
@@L1849  EQU   *
         L     2,16(4)
         L     15,120(13)
         CL    2,16(15)
         BNL   @@L1760
@@L1761  EQU   *
         ST    4,120(13)
         B     @@L1760
@@L1848  EQU   *
         MVC   120(4,13),12(3)
         ST    15,124(13)
         B     @@L1759
@@L1847  EQU   *
         ST    3,88(13)
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=A(@@24)
         BALR  14,15
         ST    15,20(8)
         B     @@L1751
@@L1846  EQU   *
         MVC   88(4,13),=F'31'
         ST    2,92(13)
         ST    2,96(13)
         LA    1,88(,13)
         L     15,=V(BDECL)
         BALR  14,15
         ST    15,24(8)
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(EXPLAB)
         BALR  14,15
         B     @@L1750
@@L1845  EQU   *
         CLI   8(5),25
         BE    @@L1749
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=A(CHKFFEH)
         BALR  14,15
         B     @@L1749
@@L1748  EQU   *
         LA    1,88(,13)
         L     15,=V(END@CLEA)
         BALR  14,15
         B     @@L1817
@@L1844  EQU   *
         L     2,0(11)
         MVC   4(4,11),4(2)
         B     @@L1747
@@L1745  EQU   *
* Function eecastype epilogue
         PDPEPIL
* Function eecastype literal pool
         DS    0F
         LTORG
* Function eecastype page table
         DS    0F
@@PGT100 EQU   *
         DC    A(@@PG100)
         DS    0F
* S-func case_tree2list prologue
@@24     PDPPRLG CINDEX=101,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN101
         LTORG
@@FEN101 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG101  EQU   *
         LR    11,1
         L     10,=A(@@PGT101)
* Function case_tree2list code
         L     3,0(11)
         L     15,4(11)
         L     2,4(3)
         LTR   2,2
         BNE   @@L1870
@@L1868  EQU   *
         ST    15,4(3)
         L     2,0(3)
         LTR   2,2
         BE    @@L1869
         MVC   0(4,3),=F'0'
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@24)
         BALR  14,15
         B     @@L1867
@@L1869  EQU   *
         LR    15,3
         B     @@L1867
@@L1870  EQU   *
         ST    2,88(13)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=A(@@24)
         BALR  14,15
         B     @@L1868
@@L1867  EQU   *
* Function case_tree2list epilogue
         PDPEPIL
* Function case_tree2list literal pool
         DS    0F
         LTORG
* Function case_tree2list page table
         DS    0F
@@PGT101 EQU   *
         DC    A(@@PG101)
         DS    0F
* S-func do_jump_if_equal prologue
@@32     PDPPRLG CINDEX=102,FRAME=120,BASER=12,ENTRY=NO
         B     @@FEN102
         LTORG
@@FEN102 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG102  EQU   *
         LR    11,1
         L     10,=A(@@PGT102)
* Function do_jump_if_equal code
         L     15,0(11)
         L     3,4(11)
         L     4,8(11)
         LH    2,0(15)
         CLM   2,3,=H'54'
         BE    @@L1877
@@L1872  EQU   *
         ST    15,88(13)
         ST    3,92(13)
         MVC   96(4,13),=F'103'
         MVC   100(4,13),=F'0'
         IC    2,2(15)
         CLM   2,1,=XL1'00'
         BNE   @@L1875
         SLR   2,2
         IC    2,2(3)
@@L1876  EQU   *
         ST    2,104(13)
         MVC   108(4,13),12(11)
         ST    4,112(13)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
         B     @@L1871
@@L1875  EQU   *
         SLR   2,2
         IC    2,2(15)
         B     @@L1876
@@L1877  EQU   *
         LH    2,0(3)
         CLM   2,3,=H'54'
         BNE   @@L1872
         L     2,4(15)
         CL    2,4(3)
         BNE   @@L1871
         ST    4,88(13)
         LA    1,88(,13)
         L     15,=A(EMJMP)
         BALR  14,15
@@L1871  EQU   *
* Function do_jump_if_equal epilogue
         PDPEPIL
* Function do_jump_if_equal literal pool
         DS    0F
         LTORG
* Function do_jump_if_equal page table
         DS    0F
@@PGT102 EQU   *
         DC    A(@@PG102)
         DS    0F
* S-func estimate_case_costs prologue
@@28     PDPPRLG CINDEX=103,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN103
         LTORG
@@FEN103 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG103  EQU   *
         LR    11,1
         L     10,=A(@@PGT103)
* Function estimate_case_costs code
         L     5,0(11)
         L     2,=V(GLOBAL@T)
         L     8,52(2)
         MVC   88(4,13),=F'127'
         MVC   92(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(BINT2WID)
         BALR  14,15
         L     2,16(5)
         MVC   88(4,13),4(2)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(CONVERT)
         BALR  14,15
         LR    7,15
         L     3,=A(@@33)
         L     2,0(3)
         LTR   2,2
         BNE   @@L1879
         MVC   0(4,3),=F'1'
         LR    4,2
@@L1889  EQU   *
         LR    2,4
         N     2,=F'255'
         MH    2,=H'2'
         L     3,=V(@SCH@IST)
         LH    3,0(2,3)
         LR    2,3
         N     2,=F'140'
         CH    2,=H'0'
         BE    @@L1884
         LR    2,4
         MH    2,=H'2'
         A     2,=A(@@34+2)
         MVC   0(2,2),=H'16'
@@L1882  EQU   *
         A     4,=F'1'
         LA    2,127(0,0)
         CR    4,2
         BNH   @@L1889
         L     2,=A(@@34)
         MVC   130(2,2),=H'8'
         MVC   12(2,2),=H'4'
         MVC   2(2,2),=H'4'
         MVC   44(2,2),=H'2'
         MVC   26(2,2),=H'1'
         MVC   24(2,2),=H'1'
         MVC   46(2,2),=H'1'
@@L1879  EQU   *
         LR    6,5
         LTR   5,5
         BE    @@L1907
@@L1903  EQU   *
         L     4,12(6)
         L     3,20(4)
         L     2,20(8)
         CR    3,2
         BL    @@L1895
         BE    @@L1910
@@L1896  EQU   *
         L     5,16(6)
         L     3,20(7)
         L     2,20(5)
         CR    3,2
         BL    @@L1895
         BE    @@L1911
@@L1894  EQU   *
         L     4,16(4)
         C     4,16(5)
         BH    @@L1909
@@L1902  EQU   *
         LR    2,4
         MH    2,=H'2'
         A     2,=A(@@34+2)
         LH    2,0(2)
         SLR   15,15
         CH    2,=H'0'
         BL    @@L1878
         A     4,=F'1'
         C     4,16(5)
         BNH   @@L1902
@@L1909  EQU   *
         L     6,4(6)
         LTR   6,6
         BNE   @@L1903
@@L1907  EQU   *
         LA    15,1(0,0)
         B     @@L1878
@@L1911  EQU   *
         L     2,16(7)
         CL    2,16(5)
         BNL   @@L1894
@@L1895  EQU   *
         SLR   15,15
         B     @@L1878
@@L1910  EQU   *
         L     2,16(4)
         CL    2,16(8)
         BNL   @@L1896
         B     @@L1895
@@L1884  EQU   *
         LR    2,3
         N     2,=F'32'
         CH    2,=H'0'
         BE    @@L1886
         LR    2,4
         MH    2,=H'2'
         A     2,=A(@@34+2)
         MVC   0(2,2),=H'8'
         B     @@L1882
@@L1886  EQU   *
         N     3,=F'2'
         CH    3,=H'0'
         BE    @@L1882
         LR    2,4
         MH    2,=H'2'
         A     2,=A(@@34+2)
         MVC   0(2,2),=H'-1'
         B     @@L1882
@@L1878  EQU   *
* Function estimate_case_costs epilogue
         PDPEPIL
* Function estimate_case_costs literal pool
         DS    0F
         LTORG
* Function estimate_case_costs page table
         DS    0F
@@PGT103 EQU   *
         DC    A(@@PG103)
         DS    0F
* S-func group_case_nodes prologue
@@26     PDPPRLG CINDEX=104,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN104
         LTORG
@@FEN104 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG104  EQU   *
         LR    11,1
         L     10,=A(@@PGT104)
* Function group_case_nodes code
         L     4,0(11)
         LTR   4,4
         BE    @@L1924
@@L1922  EQU   *
         MVC   88(4,13),20(4)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         LR    6,15
         LR    5,4
@@L1916  EQU   *
         L     5,4(5)
         LTR   5,5
         BE    @@L1917
         MVC   88(4,13),20(5)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(NEXT@REA)
         BALR  14,15
         LR    3,15
         CLR   15,6
         BE    @@L1920
         LTR   6,6
         BE    @@L1917
         LTR   15,15
         BE    @@L1917
         ST    6,88(13)
         LA    1,88(,13)
         L     15,=V(SIMPLEJU)
         BALR  14,15
         LTR   15,15
         BE    @@L1917
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=V(SIMPLEJU)
         BALR  14,15
         LTR   15,15
         BE    @@L1917
         L     2,16(6)
         MVC   88(4,13),8(2)
         L     2,16(3)
         MVC   92(4,13),8(2)
         LA    1,88(,13)
         L     15,=V(RTEQP)
         BALR  14,15
         LTR   15,15
         BE    @@L1917
@@L1920  EQU   *
         MVC   88(4,13),=F'59'
         L     2,16(4)
         MVC   92(4,13),4(2)
         MVC   96(4,13),16(4)
         L     3,=V(GLOBAL@T)
         MVC   100(4,13),48(3)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         MVC   88(4,13),12(5)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BE    @@L1917
         MVC   88(4,13),=F'59'
         L     2,16(4)
         MVC   92(4,13),4(2)
         MVC   96(4,13),16(4)
         MVC   100(4,13),48(3)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         MVC   88(4,13),16(4)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LTR   15,15
         BE    @@L1917
         MVC   16(4,4),16(5)
         B     @@L1916
@@L1917  EQU   *
         ST    5,4(4)
         LR    4,5
         LTR   5,5
         BNE   @@L1922
@@L1924  EQU   *
* Function group_case_nodes epilogue
         PDPEPIL
* Function group_case_nodes literal pool
         DS    0F
         LTORG
* Function group_case_nodes page table
         DS    0F
@@PGT104 EQU   *
         DC    A(@@PG104)
         DS    0F
* S-func balance_case_nodes prologue
@@29     PDPPRLG CINDEX=105,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN105
         LTORG
@@FEN105 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG105  EQU   *
         LR    11,1
         L     10,=A(@@PGT105)
* Function balance_case_nodes code
         L     6,0(11)
         L     9,4(11)
@@L1943  EQU   *
         L     3,0(6)
         LTR   3,3
         BE    @@L1925
         SLR   5,5
         LR    7,5
         LR    8,5
@@L1933  EQU   *
         MVC   88(4,13),12(3)
         MVC   92(4,13),16(3)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1930
         A     8,=F'1'
         L     2,=A(@@27)
         L     2,0(2)
         LTR   2,2
         BE    @@L1930
         L     2,16(3)
         L     2,16(2)
         SLL   2,1
         A     2,=A(@@34+2)
         LH    2,0(2)
         AR    7,2
@@L1930  EQU   *
         L     2,=A(@@27)
         L     15,0(2)
         LTR   15,15
         BE    @@L1932
         L     2,12(3)
         L     2,16(2)
         SLL   2,1
         A     2,=A(@@34+2)
         LH    2,0(2)
         AR    7,2
@@L1932  EQU   *
         A     5,=F'1'
         L     3,4(3)
         LTR   3,3
         BNE   @@L1933
         LA    2,2(0,0)
         CR    5,2
         BNH   @@L1934
         LR    4,6
         MVC   96(4,13),0(6)
         LTR   15,15
         BE    @@L1935
         LR    8,3
         LR    2,7
         A     2,=F'1'
         LR    5,2
         SRL   5,31
         AR    5,2
         SRA   5,1
@@L1941  EQU   *
         L     2,0(4)
         MVC   88(4,13),12(2)
         L     2,0(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1939
         L     2,0(4)
         L     2,16(2)
         L     2,16(2)
         SLL   2,1
         A     2,=A(@@34+2)
         LH    2,0(2)
         SR    5,2
@@L1939  EQU   *
         L     3,0(4)
         L     2,12(3)
         L     2,16(2)
         SLL   2,1
         A     2,=A(@@34+2)
         LH    2,0(2)
         SR    5,2
         BNH   @@L1937
         LR    4,3
         A     4,=F'4'
         A     8,=F'1'
         B     @@L1941
@@L1937  EQU   *
         LTR   8,8
         BE    @@L1968
@@L1949  EQU   *
         L     3,0(4)
         ST    3,0(6)
         MVC   0(4,4),=F'0'
         ST    9,8(3)
         MVC   0(4,3),96(13)
         ST    3,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@29)
         BALR  14,15
         LR    6,3
         A     6,=F'4'
         LR    9,3
         B     @@L1943
@@L1968  EQU   *
         L     3,0(6)
         ST    9,8(3)
         ST    3,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@29)
         BALR  14,15
         L     2,4(3)
         LTR   2,2
         BE    @@L1925
@@L1948  EQU   *
         L     2,4(3)
         ST    3,8(2)
         LR    3,2
         L     2,4(2)
         LTR   2,2
         BNE   @@L1948
         B     @@L1925
@@L1935  EQU   *
         LA    2,3(0,0)
         CLR   5,2
         BE    @@L1969
         LR    2,5
         AR    2,8
         A     2,=F'1'
         LR    5,2
         SRL   5,31
         AR    5,2
         SRA   5,1
@@L1957  EQU   *
         L     2,0(4)
         MVC   88(4,13),12(2)
         L     2,0(4)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1955
         BCTR  5,0
@@L1955  EQU   *
         BCTR  5,0
         LTR   5,5
         BNH   @@L1949
         L     4,0(4)
         A     4,=F'4'
         B     @@L1957
@@L1969  EQU   *
         L     4,96(13)
         A     4,=F'4'
         B     @@L1949
@@L1934  EQU   *
         L     3,0(6)
         ST    9,8(3)
         L     2,4(3)
         LTR   2,2
         BE    @@L1925
@@L1963  EQU   *
         L     2,4(3)
         ST    3,8(2)
         LR    3,2
         L     2,4(2)
         LTR   2,2
         BNE   @@L1963
@@L1925  EQU   *
* Function balance_case_nodes epilogue
         PDPEPIL
* Function balance_case_nodes literal pool
         DS    0F
         LTORG
* Function balance_case_nodes page table
         DS    0F
@@PGT105 EQU   *
         DC    A(@@PG105)
         DS    0F
* S-func node_has_low_bound prologue
@@35     PDPPRLG CINDEX=106,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN106
         LTORG
@@FEN106 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG106  EQU   *
         LR    11,1
         L     10,=A(@@PGT106)
* Function node_has_low_bound code
         L     4,0(11)
         MVC   88(4,13),12(4)
         L     2,4(11)
         MVC   92(4,13),56(2)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LR    3,15
         LA    15,1(0,0)
         LTR   3,3
         BNE   @@L1970
         L     2,0(4)
         LR    15,3
         LTR   2,2
         BNE   @@L1970
         MVC   88(4,13),=F'60'
         L     2,12(4)
         MVC   92(4,13),4(2)
         ST    2,96(13)
         L     2,=V(GLOBAL@T)
         MVC   100(4,13),48(2)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    3,15
         ST    15,88(13)
         MVC   92(4,13),12(4)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LTR   15,15
         BE    @@L1970
         L     2,8(4)
         LTR   2,2
         BE    @@L1981
@@L1979  EQU   *
         ST    3,88(13)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1982
         L     2,8(2)
         LTR   2,2
         BNE   @@L1979
@@L1981  EQU   *
         SLR   15,15
         B     @@L1970
@@L1982  EQU   *
         LA    15,1(0,0)
@@L1970  EQU   *
* Function node_has_low_bound epilogue
         PDPEPIL
* Function node_has_low_bound literal pool
         DS    0F
         LTORG
* Function node_has_low_bound page table
         DS    0F
@@PGT106 EQU   *
         DC    A(@@PG106)
         DS    0F
* S-func node_has_high_bound prologue
@@36     PDPPRLG CINDEX=107,FRAME=104,BASER=12,ENTRY=NO
         B     @@FEN107
         LTORG
@@FEN107 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG107  EQU   *
         LR    11,1
         L     10,=A(@@PGT107)
* Function node_has_high_bound code
         L     4,0(11)
         L     2,4(11)
         L     2,60(2)
         LA    3,1(0,0)
         LTR   2,2
         BE    @@L1983
         MVC   88(4,13),16(4)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LA    3,1(0,0)
         LTR   15,15
         BNE   @@L1983
         L     2,4(4)
         LR    3,15
         LTR   2,2
         BNE   @@L1983
         MVC   88(4,13),=F'59'
         L     2,16(4)
         MVC   92(4,13),4(2)
         ST    2,96(13)
         L     2,=V(GLOBAL@T)
         MVC   100(4,13),48(2)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),16(4)
         ST    15,92(13)
         LA    1,88(,13)
         L     15,=V(TICSTLT)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L1983
         L     2,8(4)
         LTR   2,2
         BE    @@L1995
@@L1993  EQU   *
         ST    5,88(13)
         MVC   92(4,13),12(2)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BNE   @@L1996
         L     2,8(2)
         LTR   2,2
         BNE   @@L1993
@@L1995  EQU   *
         SLR   3,3
         B     @@L1983
@@L1996  EQU   *
         LA    3,1(0,0)
@@L1983  EQU   *
         LR    15,3
* Function node_has_high_bound epilogue
         PDPEPIL
* Function node_has_high_bound literal pool
         DS    0F
         LTORG
* Function node_has_high_bound page table
         DS    0F
@@PGT107 EQU   *
         DC    A(@@PG107)
         DS    0F
* S-func node_is_bounded prologue
@@37     PDPPRLG CINDEX=108,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN108
         LTORG
@@FEN108 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG108  EQU   *
         LR    11,1
         L     10,=A(@@PGT108)
* Function node_is_bounded code
         L     2,0(11)
         L     3,4(11)
         SLR   4,4
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@35)
         BALR  14,15
         LTR   15,15
         BE    @@L1998
         ST    2,88(13)
         ST    3,92(13)
         LA    1,88(,13)
         L     15,=A(@@36)
         BALR  14,15
         LTR   15,15
         BE    @@L1998
         LA    4,1(0,0)
@@L1998  EQU   *
         LR    15,4
* Function node_is_bounded epilogue
         PDPEPIL
* Function node_is_bounded literal pool
         DS    0F
         LTORG
* Function node_is_bounded page table
         DS    0F
@@PGT108 EQU   *
         DC    A(@@PG108)
         DS    0F
* S-func emit_jump_if_reachable prologue
@@31     PDPPRLG CINDEX=109,FRAME=96,BASER=12,ENTRY=NO
         B     @@FEN109
         LTORG
@@FEN109 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG109  EQU   *
         LR    11,1
         L     10,=A(@@PGT109)
* Function emit_jump_if_reachable code
         LA    1,88(,13)
         L     15,=V(GLINSN)
         BALR  14,15
         LH    2,0(15)
         CLM   2,3,=H'35'
         BE    @@L1999
         MVC   88(4,13),0(11)
         LA    1,88(,13)
         L     15,=A(EMJMP)
         BALR  14,15
@@L1999  EQU   *
* Function emit_jump_if_reachable epilogue
         PDPEPIL
* Function emit_jump_if_reachable literal pool
         DS    0F
         LTORG
* Function emit_jump_if_reachable page table
         DS    0F
@@PGT109 EQU   *
         DC    A(@@PG109)
         DS    0F
* S-func emit_case_nodes prologue
@@30     PDPPRLG CINDEX=110,FRAME=136,BASER=12,ENTRY=NO
         B     @@FEN110
         LTORG
@@FEN110 EQU   *
         DROP  12
         BALR  12,0
         USING *,12
@@PG110  EQU   *
         LR    11,1
         L     10,=A(@@PGT110)
* Function emit_case_nodes code
         MVC   120(4,13),0(11)
         L     6,4(11)
         MVC   124(4,13),8(11)
         MVC   128(4,13),12(11)
@@L2007  EQU   *
         L     12,0(,10)
         L     2,128(13)
         L     9,8(2)
         SRL   9,18
         N     9,=F'1'
         L     3,120(13)
         SLR   8,8
         IC    8,2(3)
         LH    3,32(2)
         N     3,=F'127'
         ST    3,132(13)
         ST    6,88(13)
         ST    2,92(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L2036
         MVC   88(4,13),12(6)
         MVC   92(4,13),16(6)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         L     14,=A(@@L2051)
         BNER  14
         L     4,4(6)
         LTR   4,4
         BE    @@L2024
         L     2,0(6)
         LTR   2,2
         L     14,=A(@@L2052)
         BNER  14
@@L2024  EQU   *
         LTR   4,4
         BE    @@L2029
         L     3,0(6)
         LTR   3,3
         BE    @@L2053
@@L2029  EQU   *
         LTR   4,4
         BNE   @@L2032
         L     2,0(6)
         LTR   2,2
         BE    @@L2032
         ST    6,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@36)
         BALR  14,15
         LTR   15,15
         BE    @@L2054
@@L2033  EQU   *
         MVC   88(4,13),12(6)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),20(6)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         MVC   96(4,13),=F'104'
@@L2046  EQU   *
         L     12,0(,10)
         ST    4,100(13)
         ST    8,104(13)
         ST    9,108(13)
         ST    15,112(13)
@@L2047  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
@@L2041  EQU   *
         L     12,0(,10)
         L     6,0(6)
         B     @@L2007
@@L2054  EQU   *
         MVC   88(4,13),16(6)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'105'
         ST    4,100(13)
         ST    8,104(13)
         ST    9,108(13)
         MVC   112(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
         B     @@L2033
@@L2032  EQU   *
         ST    6,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@36)
         BALR  14,15
         LR    7,15
         ST    6,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@35)
         BALR  14,15
         LR    2,15
         LTR   7,7
         BNE   @@L2035
         LTR   15,15
         BNE   @@L2055
@@L2035  EQU   *
         LTR   2,2
         BNE   @@L2037
         LTR   7,7
         BNE   @@L2056
@@L2037  EQU   *
         LTR   2,2
         BNE   @@L2036
         LTR   7,7
         BE    @@L2057
@@L2036  EQU   *
         MVC   88(4,13),20(6)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=A(EMJMP)
         BALR  14,15
         L     14,=A(@@L2001)
         BR    14
@@L2057  EQU   *
         ST    8,88(13)
         ST    9,92(13)
         LA    1,88(,13)
         L     15,=V(TYPFMOD)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),=F'114'
         ST    15,92(13)
         MVC   96(4,13),12(6)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),=F'114'
         ST    2,92(13)
         MVC   96(4,13),16(6)
         LA    1,88(,13)
         L     15,=V(BUILD1)
         BALR  14,15
         LR    5,15
         ST    3,88(13)
         ST    7,92(13)
         ST    8,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),=F'76'
         MVC   96(4,13),120(13)
         ST    15,100(13)
         ST    7,104(13)
         ST    9,108(13)
         MVC   112(4,13),=F'2'
         LA    1,88(,13)
         L     15,=V(EXPSBIN)
         BALR  14,15
         LR    4,15
         MVC   88(4,13),=F'60'
         ST    2,92(13)
         ST    5,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(BUILD)
         BALR  14,15
         ST    15,88(13)
         LA    1,88(,13)
         L     15,=V(FOLD)
         BALR  14,15
         ST    15,88(13)
         ST    7,92(13)
         ST    8,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    4,88(13)
         ST    15,92(13)
         MVC   96(4,13),=F'105'
         ST    7,100(13)
         ST    8,104(13)
         MVC   108(4,13),=F'1'
@@L2048  EQU   *
         MVC   112(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
         B     @@L2036
@@L2056  EQU   *
         MVC   88(4,13),12(6)
         ST    2,92(13)
         ST    2,96(13)
         ST    2,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'107'
         ST    2,100(13)
@@L2049  EQU   *
         ST    8,104(13)
         ST    9,108(13)
         B     @@L2048
@@L2055  EQU   *
         MVC   88(4,13),16(6)
         ST    7,92(13)
         ST    7,96(13)
         ST    7,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'105'
         ST    7,100(13)
         B     @@L2049
@@L2053  EQU   *
         ST    6,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@35)
         BALR  14,15
         LTR   15,15
         BE    @@L2058
@@L2030  EQU   *
         MVC   88(4,13),16(6)
         ST    3,92(13)
         ST    3,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),20(6)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         MVC   96(4,13),=F'106'
         ST    3,100(13)
@@L2043  EQU   *
         L     12,0(,10)
         ST    8,104(13)
         ST    9,108(13)
         ST    15,112(13)
@@L2045  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
@@L2040  EQU   *
         L     12,0(,10)
         L     6,4(6)
         B     @@L2007
@@L2058  EQU   *
         MVC   88(4,13),12(6)
         ST    3,92(13)
         ST    3,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'107'
         ST    3,100(13)
         ST    8,104(13)
         ST    9,108(13)
         MVC   112(4,13),124(13)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
         B     @@L2030
@@L2052  EQU   *
         LR    5,15
         ST    4,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    3,15
         LTR   15,15
         BE    @@L2025
         MVC   88(4,13),16(6)
         ST    5,92(13)
         ST    5,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    3,15
         L     2,4(6)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    3,92(13)
         MVC   96(4,13),=F'105'
         ST    5,100(13)
@@L2042  EQU   *
         ST    8,104(13)
         ST    9,108(13)
         ST    15,112(13)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
         MVC   88(4,13),12(6)
         MVC   92(4,13),=F'0'
         MVC   96(4,13),=F'0'
         MVC   100(4,13),=F'0'
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),20(6)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         MVC   96(4,13),=F'104'
         MVC   100(4,13),=F'0'
         ST    8,104(13)
         ST    9,108(13)
         ST    15,112(13)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
         MVC   88(4,13),120(13)
         MVC   92(4,13),0(6)
         MVC   96(4,13),124(13)
         MVC   100(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@30)
         BALR  14,15
         LTR   5,5
         L     14,=A(@@L2001)
         BER   14
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         ST    5,88(13)
@@L2044  EQU   *
         L     12,0(,10)
         LA    1,88(,13)
         L     15,=A(EXPLAB)
         BALR  14,15
         B     @@L2040
@@L2025  EQU   *
         MVC   88(4,13),=F'31'
         ST    5,92(13)
         ST    5,96(13)
         LA    1,88(,13)
         L     15,=V(BDECL)
         BALR  14,15
         LR    5,15
         MVC   88(4,13),16(6)
         ST    3,92(13)
         ST    3,96(13)
         ST    3,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    2,15
         ST    5,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         MVC   96(4,13),=F'105'
         ST    3,100(13)
         B     @@L2042
@@L2051  EQU   *
         MVC   88(4,13),12(6)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    2,15
         MVC   88(4,13),20(6)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=A(@@32)
         BALR  14,15
         L     3,4(6)
         LTR   3,3
         BE    @@L2005
         L     2,0(6)
         LTR   2,2
         L     14,=A(@@L2059)
         BNER  14
@@L2005  EQU   *
         LTR   3,3
         BE    @@L2012
         L     2,0(6)
         LTR   2,2
         BE    @@L2060
@@L2012  EQU   *
         LTR   3,3
         L     14,=A(@@L2001)
         BNER  14
         L     3,0(6)
         LTR   3,3
         L     14,=A(@@L2001)
         BER   14
         L     2,0(3)
         LTR   2,2
         BNE   @@L2020
         L     4,4(3)
         LTR   4,4
         BE    @@L2061
@@L2020  EQU   *
         ST    6,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@36)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   @@L2041
         MVC   88(4,13),16(6)
         ST    15,92(13)
         ST    15,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'105'
         ST    2,100(13)
         ST    8,104(13)
         ST    9,108(13)
         MVC   112(4,13),124(13)
         B     @@L2047
@@L2061  EQU   *
         MVC   88(4,13),12(3)
         L     2,0(6)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BE    @@L2020
         L     2,0(6)
         MVC   88(4,13),12(2)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    3,15
         L     2,0(6)
@@L2050  EQU   *
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    3,92(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=A(@@32)
         BALR  14,15
         L     14,=A(@@L2001)
         BR    14
@@L2060  EQU   *
         L     2,4(3)
         LTR   2,2
         BNE   @@L2014
         L     4,0(3)
         LTR   4,4
         BE    @@L2062
@@L2014  EQU   *
         ST    6,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@35)
         BALR  14,15
         LR    2,15
         LTR   15,15
         BNE   @@L2040
         MVC   88(4,13),16(6)
         ST    15,92(13)
         ST    15,96(13)
         ST    15,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    15,92(13)
         MVC   96(4,13),=F'107'
         ST    2,100(13)
         ST    8,104(13)
         ST    9,108(13)
         MVC   112(4,13),124(13)
         B     @@L2045
@@L2062  EQU   *
         MVC   88(4,13),12(3)
         L     2,4(6)
         MVC   92(4,13),16(2)
         LA    1,88(,13)
         L     15,=V(TICSTE)
         BALR  14,15
         LTR   15,15
         BE    @@L2014
         L     2,4(6)
         MVC   88(4,13),12(2)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    3,15
         L     2,4(6)
         B     @@L2050
@@L2059  EQU   *
         ST    3,88(13)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    5,15
         LTR   15,15
         L     14,=A(@@L2063)
         BNER  14
         MVC   88(4,13),0(6)
         MVC   92(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@37)
         BALR  14,15
         LR    4,15
         LTR   15,15
         BNE   @@L2064
         MVC   88(4,13),=F'31'
         ST    15,92(13)
         ST    15,96(13)
         LA    1,88(,13)
         L     15,=V(BDECL)
         BALR  14,15
         LR    3,15
         MVC   88(4,13),16(6)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    2,15
         ST    3,88(13)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    2,92(13)
         MVC   96(4,13),=F'105'
         ST    4,100(13)
         ST    8,104(13)
         ST    9,108(13)
         ST    15,112(13)
         LA    1,88(,13)
         L     15,=V(ECAJI)
         BALR  14,15
         MVC   88(4,13),120(13)
         MVC   92(4,13),0(6)
         MVC   96(4,13),124(13)
         MVC   100(4,13),128(13)
         LA    1,88(,13)
         L     15,=A(@@30)
         BALR  14,15
         MVC   88(4,13),124(13)
         LA    1,88(,13)
         L     15,=A(@@31)
         BALR  14,15
         ST    3,88(13)
         B     @@L2044
@@L2064  EQU   *
         MVC   88(4,13),16(6)
         ST    5,92(13)
         ST    5,96(13)
         ST    5,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    3,15
         L     2,0(6)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    3,92(13)
         MVC   96(4,13),=F'107'
         ST    5,100(13)
         B     @@L2043
@@L2063  EQU   *
         MVC   88(4,13),16(6)
         ST    4,92(13)
         ST    4,96(13)
         ST    4,100(13)
         LA    1,88(,13)
         L     15,=V(EXPEXPR)
         BALR  14,15
         ST    8,88(13)
         MVC   92(4,13),132(13)
         ST    15,96(13)
         ST    9,100(13)
         LA    1,88(,13)
         L     15,=V(CNVMOD)
         BALR  14,15
         LR    3,15
         L     2,4(6)
         MVC   88(4,13),20(2)
         LA    1,88(,13)
         L     15,=A(LABEL@RT)
         BALR  14,15
         MVC   88(4,13),120(13)
         ST    3,92(13)
         MVC   96(4,13),=F'105'
         B     @@L2046
@@L2001  EQU   *
* Function emit_case_nodes epilogue
         PDPEPIL
* Function emit_case_nodes literal pool
         DS    0F
         LTORG
* Function emit_case_nodes page table
         DS    0F
@@PGT110 EQU   *
         DC    A(@@PG110)
* X-var stmt_obstack
         ENTRY STMT@OBS
         DS    0F
STMT@OBS EQU   *
         DC    44X'00'
         DS    0F
@@34     EQU   *
         DC    258X'00'
         DS    0F
@@27     EQU   *
         DC    4X'00'
         DS    0F
@@33     EQU   *
         DC    4X'00'
         END
