)ATTR
 \ AREA(DYNAMIC)
 { TYPE(CHAR)  CAPS(OFF)  HILITE(REVERSE) COLOR(RED)
 ~ TYPE(CHAR)  CAPS(OFF)  HILITE(REVERSE) COLOR(BLUE)
 # TYPE(CHAR)  CAPS(OFF)  HILITE(REVERSE) COLOR(GREEN)
 _ TYPE(CHAR)  CAPS(OFF)  HILITE(REVERSE) COLOR(YELLOW)
 } TYPE(CHAR)  CAPS(OFF)                  COLOR(YELLOW)
 % TYPE(TEXT)  CAPS(OFF)
 + TYPE(TEXT)  INTENS(LOW)   CAPS(OFF)  COLOR(WHITE)
 ¦ TYPE(TEXT)  CAPS(OFF)  COLOR(GREEN)
 ! TYPE(TEXT)  CAPS(OFF)  COLOR(YELLOW)
 @ TYPE(OUTPUT) INTENS(LOW) CAPS(OFF)  COLOR(TURQ) JUST(RIGHT)
 ¬ TYPE(OUTPUT) INTENS(LOW) CAPS(OFF)  COLOR(GREEN) JUST(RIGHT)
 " TYPE(OUTPUT) JUST(ASIS) HILITE(REVERSE) COLOR(GREEN)
)BODY WINDOW(16,1)
¦\PROCPCT,MASKS\
)END
