//NMVV1C    JOB  (6948,TECH),'VINH.VU',MSGCLASS=X,
//          CLASS=Z,NOTIFY=&SYSUID
//*
//OUTDFLT OUTPUT BUILDING='NM/LAS COLINAS',DEFAULT=YES,DEPT=ITS,
//          ADDRESS=('TECHNICAL SUPPORT','1ST FLOOR'),
//          NAME='VINH VU',ROOM='FLOOR1',JESDS=ALL,
//          TITLE='CONSULTING TECHNOLOGIST' ,
//*
//*
//*
//BUILDCTL  EXEC PGM=IRXJCL,REGION=6M,
//          PARM='$PARM INPUTPARM1 INPUTPARM2 INPUTPARM3'
//SYSEXEC   DD   DSN=SYS3.TECH.SYSEXEC,DISP=SHR
//SYSTSPRT  DD   SYSOUT=*
//SYSTSIN   DD   DUMMY
//INPUT     DD   *

{CENTER('/*'||COPIES(' ',40)||'*/',72)}
{CENTER('/* RUNS ON ~WEEKDAY~, ~GDATE~ AT ~TIME~ */',72)}
{CENTER('/* BY ~JOBNAME~-~JOBID~ ON ~SYSID~ IN CLASS ~XEQCLASS~ */',72)}
{CENTER('/* JOB   RACFUSER = ~RACUSER~ */',72)}

PARM1 IS &1&
PARM2 IS &2&
PARM3 IS &3&

FOLLOWING IS A LIST OF RESERVED SYMBOLS:

'GDATE      '=  ~GDATE    ~
'JDATE      '=  ~JDATE    ~
'JOBID      '=  ~JOBID    ~
'JOBNAME    '=  ~JOBNAME  ~
'MSGCLASS   '=  ~MSGCLASS ~
'RACGROUP   '=  ~RACGROUP ~
'RACINST    '=  ~RACINST  ~
'RACNAME    '=  ~RACNAME  ~
'RACUSER    '=  ~RACUSER  ~
'STEPNAME   '=  ~STEPNAME ~
'SYSID      '=  ~SYSID    ~
'TIME       '=  ~TIME     ~
'USERID     '=  ~USERID   ~
'WEEKDAY    '=  ~WEEKDAY  ~
'XEQCLASS   '=  ~XEQCLASS ~

{CENTER('/*'||COPIES(' ',40)||'*/',72)}
{'/*   '||COPIES(' ',60)||'  */'}
{'/*   '||COPIES(' ',60)||'  */'}
{'/*   '||LEFT('JOB ~JOBNAME~(~JOBID~) ON ~SYSID~',60)||'  */'}
{'/*   '||LEFT('RUNS ON ~WEEKDAY~, ~GDATE~ AT ~TIME~',60)||'  */'}
{'/*   '||LEFT('IN CLASS ~XEQCLASS~ USING RACFID ~RACUSER~',60)||'  */'}
{'/*   '||COPIES(' ',60)||'  */'}
{'/*   '||COPIES(' ',60)||'  */'}

//OUTPUT    DD   SYSOUT=*    --- OUTPUT ---
