)PANEL KEYLIST (ISRHELP ISR)
)ATTR
   % TYPE(ET)
   _ TYPE(NEF) PAD(USER) CAPS(ON)
   + TYPE(NT)
)BODY
%------------------------------ RECOVERY HELP ----------------------------------
%Command ===>_ZCMD                                                             +
+
                            %D/R Job Status List

+  This screen is used to display status of jobs waiting to execute,
+    executing or on the output queue to be checked.  You can only view
+    those jobs which have finished and have a status of SUBMIT or CHECKED.
+    When a finished submitted job has been viewed its status becomes
+    checked. You will not be able to view checked jobs through this dialog
+    again until the job has been rebuilt, submitted or ended.  If there are
+    duplicate instances, only the highest job number will show.
+
+  The S field requies an S to view job output from finished jobs.
+
+  The REFRESH command on the command field will update the status of jobs.
+    Also the <PF3> key after viewing a browsed job output will update the
+    screen statues.
+
+
+
+
+
+
)PROC
 &ZCONT = RCVJ0001
)END
