)PANEL KEYLIST (ISRHELP ISR)
)ATTR
   % TYPE(ET)
   _ TYPE(NEF) PAD(USER) CAPS(ON)
   + TYPE(NT)
)BODY
%------------------------------ RECOVERY HELP ----------------------------------
%Command ===>_ZCMD                                                             +
+
                            %D/R Table and Datasets

+  TABLE NAME field is the name of the table that you will be editting
+    for this recovery session.  You can create multiple tables but are
+    able to only use one at a time.
+
+  SUBMIT JCL LIBRARY field is the name of the library where the generated
+    JCL resides.  This field is setup by the RCVRSTRT exec and usually not
+    changed.
+
+  SKELETON JCL LIBRARY field is the name of library where the skeleton for
+    JCL generation resides. This field is setup by the RCVRSTRT exec and
+    not usually changed.
+
+  SKELETON MEMBER field is the name of the JCL generation skeleton. This
+    field is not usually changed. It is created by a systems programmer
+    for the company and named in the RCVRSTRT exec.
+
+
+
+
)PROC
 &ZCONT = RCVS0001
)END
