//ZSYSCCP1 JOB SYS,(ASSEMBLE),MSGCLASS=X,                               JOB01413
//             MSGLEVEL=(1,1),REGION=8192K,CLASS=A,
//             NOTIFY=&SYSUID
//*         JCLLIB ORDER=(ZSYSCCP.JCL.CNTL)
//*
//S1  EXEC HLASMCL,
// PARM.C='OBJECT,NODECK,BATCH,MACHINE(ZSERIES-6)',
// PARM.L='XREF,LET,LIST,NCAL'
//C.SYSLIB   DD DISP=SHR,DSN=ZSYSCCP.DISASM.MACLIB
//           DD DISP=SHR,DSN=SYS1.MACLIB
//           DD DISP=SHR,DSN=SYS1.MODGEN
//           DD DISP=SHR,DSN=ZSYSCCP.FILE885.PDS
//C.SYSIN    DD DISP=SHR,DSN=ZSYSCCP.FILE885.PDS(HDISASM)
//           DD DISP=SHR,DSN=ZSYSCCP.FILE885.PDS(HDISASM1)
//           DD DISP=SHR,DSN=ZSYSCCP.FILE885.PDS(HDISASM2)
//           DD DISP=SHR,DSN=ZSYSCCP.FILE885.PDS(READLMOD)
//           DD DISP=SHR,DSN=ZSYSCCP.FILE885.PDS(SRCHDSCT)
//           DD DISP=SHR,DSN=ZSYSCCP.FILE885.PDS(BITMAP)
//           DD DISP=SHR,DSN=ZSYSCCP.FILE885.PDS(WRITEOUT)
//L.SYSLMOD  DD DISP=SHR,DSN=ZSYSCCP.XXX.LOADLIB
//L.SYSIN    DD *
 NAME HDISASMX(R)
