          HDISEQU
SGLOPV CSECT
SGLOP  DS    0CL11                   SINGLE BYTE OP-CODE TABLE
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'02'          00
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'04'         01
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'02'          02
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'02'          03
       DC    CL6'SPM',AL1(RR),AL1(PRIV),AL1(0),AL1(0),X'02'     04
       DC    CL6'BALR',AL1(RR),AL1(0),AL1(0),AL1(0),X'02'       05
       DC    CL6'BCTR',AL1(RR),AL1(0),AL1(0),AL1(0),X'02'       06
*      DC    CL6'BCR',AL1(RR),AL1(RB),AL1(0),AL1(0),X'02'       07
       DC    CL6'BCR',AL1(CONDBR),AL1(RB),AL1(0),AL1(0),X'02'   07
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'02'          08
       DC    CL6'ISK',AL1(RR),AL1(PRIV),AL1(0),AL1(0),X'02'     09
       DC    CL6'SVC',AL1(SVC),AL1(0),AL1(0),AL1(0),X'02'       0A
       DC    CL6'BSM',AL1(RR),AL1(0),AL1(0),AL1(0),X'02'        0B
       DC    CL6'BASSM',AL1(RR),AL1(0),AL1(0),AL1(0),X'02'      0C
       DC    CL6'BASR',AL1(RR),AL1(0),AL1(0),AL1(0),X'02'       0D
       DC    CL6'MVCL',AL1(RR),AL1(0),AL1(EPR),AL1(0),X'02'     0E
       DC    CL6'CLCL',AL1(RR),AL1(0),AL1(EPR),AL1(CMP),X'02'   0F
       DC    CL6'LPR',AL1(RR),AL1(0),AL1(0),AL1(CLP),X'02'      10
       DC    CL6'LNR',AL1(RR),AL1(0),AL1(0),AL1(CLN),X'02'      11
       DC    CL6'LTR',AL1(RR),AL1(LROP),AL1(T8),AL1(CLT),X'02'  12
       DC    CL6'LCR',AL1(RR),AL1(0),AL1(0),AL1(CLCM),X'02'     13
       DC    CL6'NR',AL1(RR),AL1(0),AL1(0),AL1(CZRO),X'02'      14
       DC    CL6'CLR',AL1(RR),AL1(0),AL1(0),AL1(CMP),X'02'      15
       DC    CL6'OR',AL1(RR),AL1(0),AL1(0),AL1(CZRO),X'02'      16
       DC    CL6'XR',AL1(RR),AL1(CDOR),AL1(0),AL1(CZRO),X'02'   17
       DC    CL6'LR',AL1(RR),AL1(LROP),AL1(0),AL1(0),X'02'      18
       DC    CL6'CR',AL1(RR),AL1(0),AL1(0),AL1(CMP),X'02'       19
       DC    CL6'AR',AL1(RR),AL1(CDOP),AL1(0),AL1(CA1),X'02'    1A
       DC    CL6'SR',AL1(RR),AL1(CDOR),AL1(0),AL1(CA3),X'02'    1B
       DC    CL6'MR',AL1(RR),AL1(0),AL1(EPR),AL1(0),X'02'       1C
       DC    CL6'DR',AL1(RR),AL1(0),AL1(EPR),AL1(0),X'02'       1D
       DC    CL6'ALR',AL1(RR),AL1(CDOP),AL1(0),AL1(CA2),X'02'   1E
       DC    CL6'SLR',AL1(RR),AL1(CDOR),AL1(0),AL1(CA2),X'02'     1F
       DC    CL6'LPDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'   20
       DC    CL6'LNDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'   21
       DC    CL6'LTDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'   22
       DC    CL6'LCDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'   23
       DC    CL6'HDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'      24
       DC    CL6'LRDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'     25
       DC    CL6'MXR',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'      26
       DC    CL6'MXDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'     27
       DC    CL6'LDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'      28
       DC    CL6'CDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CMP),X'02'    29
       DC    CL6'ADR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'    2A
       DC    CL6'SDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'    2B
       DC    CL6'MDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'      2C
       DC    CL6'DDR',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'      2D
       DC    CL6'AWR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'    2E
       DC    CL6'SWR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'    2F
       DC    CL6'LPER',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'   30
       DC    CL6'LNER',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'   31
       DC    CL6'LTER',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'   32
       DC    CL6'LCER',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'   33
       DC    CL6'HER',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'      34
       DC    CL6'LRER',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'     35
       DC    CL6'AXR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'    36
       DC    CL6'SXR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'    37
       DC    CL6'LER',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'      38
       DC    CL6'CER',AL1(RR),AL1(FLTPT),AL1(0),AL1(CMP),X'02'    39
       DC    CL6'AER',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02 '   3A
       DC    CL6'SER',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'    3B
       DC    CL6'MER',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'      3C
       DC    CL6'DER',AL1(RR),AL1(FLTPT),AL1(0),AL1(0),X'02'      3D
       DC    CL6'AUR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'    3E
*                  ADD UNNORAMLISE
       DC    CL6'SUR',AL1(RR),AL1(FLTPT),AL1(0),AL1(CA1),X'02'    3F
*                  SUBTRACT UNNORAMLISE
       DC    CL6'STH',AL1(RX),AL1(0),AL1(E2+S2),AL1(0),X'24'      40
       DC    CL6'LA',AL1(RX),AL1(LIOP+NPSA),AL1(0),AL1(0),X'14'   41
       DC    CL6'STC',AL1(RX),AL1(0),AL1(S2),AL1(0),X'14'         42
       DC    CL6'IC',AL1(RX),AL1(LIOP),AL1(0),AL1(0),X'14'        43
       DC    CL6'EX',AL1(RX),AL1(0),AL1(E2+S2),AL1(0),X'44'       44
       DC    CL6'BAL',AL1(RX),AL1(RB),AL1(E2),AL1(0),X'44'        45
       DC    CL6'BCT',AL1(RX),AL1(RB),AL1(E2+S2),AL1(0),X'04'     46
       DC    CL6'BC',AL1(CONDBR),AL1(RB),AL1(E2),AL1(0),X'04'     47
       DC    CL6'LH',AL1(RX),AL1(CDOP),AL1(E2),AL1(0),X'24'       48
       DC    CL6'CH',AL1(RX),AL1(LL2),AL1(E2),AL1(CMP),X'24'      49
       DC    CL6'AH',AL1(RX),AL1(CDOPA),AL1(E2),AL1(CA1),X'24'    4A
       DC    CL6'SH',AL1(RX),AL1(CDOP),AL1(E2),AL1(CA3),X'24'     4B
       DC    CL6'MH',AL1(RX),AL1(LL2),AL1(E2),AL1(0),X'24'        4C
       DC    CL6'BAS',AL1(RX),AL1(0),AL1(E2),AL1(0),X'44'         4D
       DC    CL6'CVD',AL1(RX),AL1(LL8),AL1(E8+S2),AL1(0),X'04'    4E
       DC    CL6'CVB',AL1(RX),AL1(0),AL1(E8),AL1(0),X'04'         4F
       DC    CL6'ST',AL1(RX),AL1(LL4),AL1(E4+S2),AL1(0),X'44'     50
       DC    CL6'LAE',AL1(RX),AL1(LIOP+NPSA),AL1(0),AL1(0),X'04'  51
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'     NOT INSTR
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'     NOT INSTR
       DC    CL6'N',AL1(RX),AL1(LL4),AL1(E4),AL1(CZRO),X'44'      54
       DC    CL6'CL',AL1(RX),AL1(LL4),AL1(E4),AL1(CMP),X'44'      55
       DC    CL6'O',AL1(RX),AL1(LL4),AL1(E4),AL1(CZRO),X'44'      56
       DC    CL6'X',AL1(RX),AL1(LL4),AL1(E4),AL1(CZRO),X'44'      57
       DC    CL6'L',AL1(RX),AL1(LIOP),AL1(E4),AL1(0),X'44'        58
       DC    CL6'C',AL1(RX),AL1(LL4),AL1(E4),AL1(CMP),X'44'       59
       DC    CL6'A',AL1(RX),AL1(CDOPA),AL1(E4),AL1(CA1),X'44'     5A
       DC    CL6'S',AL1(RX),AL1(CDOP),AL1(E4),AL1(CA3),X'44'      5B
       DC    CL6'M',AL1(RX),AL1(CDOP),AL1(E4+EPR),AL1(0),X'44'    5C
       DC    CL6'D',AL1(RX),AL1(LL4),AL1(E4+EPR),AL1(0),X'44'     5D
       DC    CL6'AL',AL1(RX),AL1(CDOPA),AL1(E4),AL1(CA2),X'44'    5E
       DC    CL6'SL',AL1(RX),AL1(CDOP),AL1(E4),AL1(CA4),X'44'     5F
       DC    CL6'STD',AL1(RX),AL1(FLTPT),AL1(0),AL1(0),X'04'      60
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 61
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 62
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 63
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 64
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 65
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 66
       DC    CL6'MXD',AL1(RX),AL1(FLTPT),AL1(0),AL1(0),X'04'      67
       DC    CL6'LD',AL1(RX),AL1(FLTPT),AL1(0),AL1(0),X'04'       68
       DC    CL6'CD',AL1(RX),AL1(FLTPT),AL1(0),AL1(CMP),X'04'     69
       DC    CL6'AD',AL1(RX),AL1(FLTPT),AL1(0),AL1(CA1),X'04'     6A
       DC    CL6'SD',AL1(RX),AL1(FLTPT),AL1(0),AL1(CA1),X'04'     6B
       DC    CL6'MD',AL1(RX),AL1(FLTPT),AL1(0),AL1(0),X'04'       6C
       DC    CL6'DD',AL1(RX),AL1(FLTPT),AL1(0),AL1(0),X'04'       6D
       DC    CL6'AW',AL1(RX),AL1(FLTPT),AL1(0),AL1(CA1),X'04'     6E
*                  ADD UNNORAMLISE
       DC    CL6'SW',AL1(RX),AL1(FLTPT),AL1(0),AL1(CA1),X'04'     6F
*                  SUBTRACT UNNORAMLISE
       DC    CL6'STE',AL1(RX),AL1(FLSHT),AL1(0),AL1(0),X'04'      70
       DC    CL6'MS',AL1(RX),AL1(0),AL1(E2),AL1(0),X'04'          71
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 72
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 73
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 74
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 75
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 76
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR 77
       DC    CL6'LE',AL1(RX),AL1(FLSHT),AL1(0),AL1(0),X'04'       78
       DC    CL6'CE',AL1(RX),AL1(FLSHT),AL1(0),AL1(CMP),X'04'     79
       DC    CL6'AE',AL1(RX),AL1(FLSHT),AL1(0),AL1(CA1),X'04'     7A
       DC    CL6'SE',AL1(RX),AL1(FLSHT),AL1(0),AL1(CA1),X'04'     7B
       DC    CL6'ME',AL1(RX),AL1(FLSHT),AL1(0),AL1(0),X'04'       7C
       DC    CL6'DE',AL1(RX),AL1(FLSHT),AL1(0),AL1(0),X'04'       7D
       DC    CL6'AU',AL1(RX),AL1(FLSHT),AL1(0),AL1(CA1),X'04'     7E
       DC    CL6'SU',AL1(RX),AL1(FLSHT),AL1(0),AL1(CA1),X'04'     7F
       DC    CL6'SSM',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'        80
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'      NOT INSTR
       DC    CL6'LPSW',AL1(S),AL1(PRIV),AL1(E8),AL1(0),X'04'    82
       DC    CL6'DIAG',AL1(RS),AL1(PRIVP),AL1(0),AL1(0),X'04'   83
       DC    CL6'BRXH',AL1(RSI),AL1(PRIV),AL1(0),AL1(0),X'04'   84
       DC    CL6'BRXLE',AL1(RSI),AL1(PRIV),AL1(0),AL1(0),X'04'  85
       DC    CL6'BXH',AL1(RS),AL1(RB),AL1(E2+S2),AL1(0),X'04'   86
       DC    CL6'BXLE',AL1(RS),AL1(RB),AL1(E2+S2),AL1(0),X'04'  87
       DC    CL6'SRL',AL1(RS),AL1(NPSA),AL1(0),AL1(0),X'04'     88
       DC    CL6'SLL',AL1(RS),AL1(NPSA),AL1(0),AL1(0),X'04'     89
       DC    CL6'SRA',AL1(RS),AL1(NPSA),AL1(0),AL1(CLT),X'04'   8A
       DC    CL6'SLA',AL1(RS),AL1(NPSA),AL1(0),AL1(0),X'04'     8B
       DC    CL6'SRDL',AL1(RS),AL1(NPSA),AL1(EPR),AL1(0),X'04'  8C
       DC    CL6'SLDL',AL1(RS),AL1(NPSA),AL1(EPR),AL1(0),X'04'  8D
       DC    CL6'SRDA',AL1(RS),AL1(NPSA),AL1(EPR),AL1(CLT),X'04'  8E
       DC    CL6'SLDA',AL1(RS),AL1(NPSA),AL1(EPR),AL1(CLCM),X'04' 8F
       DC    CL6'STM',AL1(RS),AL1(0),AL1(E4+S2),AL1(0),X'04'      90
       DC    CL6'TM',AL1(SI),AL1(BMP),AL1(T8),AL1(CTM),X'04'      91
       DC    CL6'MVI',AL1(SI),AL1(BMP),AL1(S2),AL1(0),X'04'       92
       DC    CL6'TS',AL1(S),AL1(LL4),AL1(0),AL1(0),X'04'          93
       DC    CL6'NI',AL1(SI),AL1(BMP),AL1(0),AL1(CZRO),X'04'      94
       DC    CL6'CLI',AL1(SI),AL1(BMP),AL1(0),AL1(CMP),X'04'      95
       DC    CL6'OI',AL1(SI),AL1(BMP),AL1(0),AL1(CZRO),X'04'      96
       DC    CL6'XI',AL1(SI),AL1(BMP),AL1(0),AL1(CZRO),X'04'      97 p
       DC    CL6'LM',AL1(RS),AL1(0),AL1(E4),AL1(0),X'04'          98 q
       DC    CL6'TRACE',AL1(RS),AL1(PRIV),AL1(0),AL1(0),X'04'     99 r
       DC    CL6'LAM',AL1(RS),AL1(AR2),AL1(E4),AL1(0),X'04'       9A
       DC    CL6'STAM',AL1(RS),AL1(AR2),AL1(E4),AL1(0),X'04'      9B
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'04'           9C
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'04'          9D
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'04'          9E
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'04'          9F
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04' NOT INSTR A0
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04' NOT INSTR A1
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04' NOT INSTR A2
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04' NOT INSTR A3
       DC    CL6' ',AL1(L3),AL1(0),AL1(0),AL1(0),X'04'           A4
       DC    CL6' ',AL1(L3),AL1(0),AL1(0),AL1(0),X'04'           A5
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'04'          A6
       DC    CL6' ',AL1(L3),AL1(0),AL1(0),AL1(0),X'04'           A7
       DC    CL6'MVCLE',AL1(RSA),AL1(NPSA),AL1(0),AL1(0),X'04'   A8
       DC    CL6'CMPE',AL1(RSA),AL1(NPSA),AL1(0),AL1(CMP),X'04' A9
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'04'          AA
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04' NOT INSTR AB
       DC    CL6'STNSM',AL1(SI),AL1(PRIV),AL1(0),AL1(0),X'04'    AC
       DC    CL6'STOSM',AL1(SI),AL1(PRIV),AL1(0),AL1(0),X'04'    AD
       DC    CL6'SIGP',AL1(RS),AL1(PRIV),AL1(0),AL1(0),X'04'     AE
       DC    CL6'MC',AL1(SI),AL1(PRIVP),AL1(0),AL1(0),X'04'      AF
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04' NOT INSTR B0
       DC    CL6'LRA',AL1(RX),AL1(PRIV),AL1(0),AL1(CLRA),X'44'   B1
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'04'          B2
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'04'          B3
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'    NOT INSTR
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'    NOT INSTR
       DC    CL6'STCTL',AL1(RS),AL1(PRIV+CR),AL1(0),AL1(0),X'44' B6
       DC    CL6'LCTL',AL1(RS),AL1(PRIV+CR),AL1(E4),AL1(0),X'44' B7
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'    NOT INSTR
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'04'          B9
       DC    CL6'CS',AL1(RS),AL1(LL4),AL1(E4),AL1(CCS),X'44'   BA
       DC    CL6'CDS',AL1(RS),AL1(LL8),AL1(E4+EPR),AL1(CCS),X'84' BB
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'04'  NOT INSTR
       DC    CL6'CLM',AL1(RS),AL1(0),AL1(T8),AL1(CMP),X'44'    BD
       DC    CL6'STCM',AL1(RS),AL1(0),AL1(T8+S2),AL1(0),X'44'  BE
       DC    CL6'ICM',AL1(RS),AL1(LIOP),AL1(T8+S2),AL1(CICM),X'44' BF
       DC    CL6' ',AL1(L3),AL1(0),AL1(0),AL1(0),X'06'         C0
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'  NOT INSTR C1
       DC    CL6' ',AL1(L3),AL1(0),AL1(0),AL1(0),X'06'         C2
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'         C3
       DC    CL6'  ',AL1(L3),AL1(0),AL1(0),AL1(0),X'06'        C4
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'         C5
*      DC    CL6'BPRP',AL1(MII),AL1(0),AL1(0),AL1(0),X'06'     C5
       DC    CL6'  ',AL1(L3),AL1(0),AL1(0),AL1(0),X'06'        C6
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'         C7
*      DC    CL6'BPP',AL1(SMI),AL1(0),AL1(0),AL1(0),X'06'      C7
       DC    CL6'  ',AL1(L3),AL1(0),AL1(0),AL1(0),X'06'        C8
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'         C9
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'         CA
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'         CB
       DC    CL6' ',AL1(L3),AL1(0),AL1(0),AL1(0),X'06'         CC
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'         CD
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'         CE
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'         CF
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'         D0
       DC    CL6'MVN',AL1(SS1),AL1(0),AL1(S1),AL1(0),X'06'      D1
       DC    CL6'MVC',AL1(SS1),AL1(0),AL1(S1),AL1(0),X'06'      D2
       DC    CL6'MVZ',AL1(SS1),AL1(0),AL1(S1),AL1(0),X'06'      D3
       DC    CL6'NC',AL1(SS1),AL1(0),AL1(S1),AL1(CZRO),X'06'    D4
       DC    CL6'CLC',AL1(SS1),AL1(0),AL1(0),AL1(CMP),X'06'     D5
       DC    CL6'OC',AL1(SS1),AL1(0),AL1(S1),AL1(CZRO),X'06'    D6
       DC    CL6'XC',AL1(SS1),AL1(0),AL1(S1),AL1(CZRO),X'06'    D7
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'          D8
       DC    CL6'MVCK',AL1(SS3),AL1(0),AL1(0),AL1(0),X'06'      D9
       DC    CL6'MVCP',AL1(SS3),AL1(0),AL1(0),AL1(0),X'06'      DA
       DC    CL6'MVCS',AL1(SS3),AL1(0),AL1(0),AL1(0),X'06'      DB
       DC    CL6'TR',AL1(SS1),AL1(0),AL1(S1),AL1(0),X'06'       DC
       DC    CL6'TRT',AL1(SS1),AL1(0),AL1(0),AL1(CTRT),X'06'    DD
       DC    CL6'ED',AL1(SS1),AL1(0),AL1(S1),AL1(CED),X'06'     DE
       DC    CL6'EDMK',AL1(SS1),AL1(0),AL1(S1),AL1(CED),X'06'   DF
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06' NOT INSTR
       DC    CL6'PKU',AL1(SS4),AL1(0),AL1(0),AL1(0),X'06'      E1
       DC    CL6'UNPKU',AL1(SS4),AL1(0),AL1(0),AL1(0),X'06'    E2
       DC    CL6' ',AL1(L4),AL1(0),AL1(0),AL1(0),X'06'         E3
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06' NOT INSTR
       DC    CL6' ',AL1(TWO),AL1(0),AL1(0),AL1(0),X'06'        E5
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06' NOT INST6
*      DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06' NOT INST7
       DC    CL6' ',AL1(L4),AL1(0),AL1(0),AL1(0),X'06'         E7
       DC    CL6'MVCIN',AL1(SS1),AL1(0),AL1(S1),AL1(0),X'06'   E8
       DC    CL6'PKA',AL1(SS4),AL1(0),AL1(0),AL1(0),X'06'      E9
       DC    CL6'UNPKA',AL1(SS4),AL1(0),AL1(0),AL1(0),X'06'    EA
       DC    CL6' ',AL1(L4),AL1(0),AL1(0),AL1(0),X'06'         EB
       DC    CL6' ',AL1(L4),AL1(0),AL1(0),AL1(0),X'06'         EC
       DC    CL6' ',AL1(L4),AL1(0),AL1(0),AL1(0),X'06'         ED
       DC    CL6'PLO',AL1(SSE),AL1(PRIV),AL1(0),AL1(0),X'06'   EE
       DC    CL6'LMD',AL1(SSE2),AL1(0),AL1(0),AL1(0),X'06'     EF
       DC    CL6'SRP',AL1(SS2),AL1(0),AL1(S1),AL1(CA1),X'06'   F0
       DC    CL6'MVO',AL1(SS2),AL1(0),AL1(S1),AL1(0),X'06'     F1
       DC    CL6'PACK',AL1(SS2),AL1(0),AL1(S1),AL1(0),X'06'    F2
       DC    CL6'UNPK',AL1(SS2),AL1(0),AL1(S1),AL1(0),X'06'    F3
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06' NOT INSTR
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06' NOT INSTR
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06' NOT INSTR
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06' NOT INSTR
       DC    CL6'ZAP',AL1(SS2),AL1(0),AL1(S1),AL1(CA1),X'06'   F8
       DC    CL6'CP',AL1(SS2),AL1(0),AL1(0),AL1(CMP),X'06'     F9
       DC    CL6'AP',AL1(SS2),AL1(0),AL1(S1),AL1(CA1),X'06'    FA
       DC    CL6'SP',AL1(SS2),AL1(0),AL1(S1),AL1(CA1),X'06'    FB
       DC    CL6'MP',AL1(SS2),AL1(0),AL1(S1),AL1(0),X'06'      FC
       DC    CL6'DP',AL1(SS2),AL1(0),AL1(S1),AL1(0),X'06'      FD
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'  NOT INSTR
       DC    XL6'00',AL1(0),AL1(0),AL1(0),AL1(0),X'06'  NOT INSTR
       DC    X'FFFF'                 TABLE END
*
*
*
DBLOPV CSECT
DBLOP  DS  0CL13                DOUBLE-BYTE OP-CODE TABLE
      DC  X'0101',CL6'PR ',AL1(E),AL1(0),AL1(0),AL1(0),X'02'
      DC  X'0102',CL6'UPT',AL1(E),AL1(0),AL1(0),AL1(0),X'02'
      DC  X'0103',CL6'?0103',AL1(E),AL1(PRIV),AL1(0),AL1(0),X'02'
      DC  X'0104',CL6'PTFF',AL1(E),AL1(0),AL1(0),AL1(0),X'02'
      DC  X'0105',CL6'CMSG ',AL1(E),AL1(PRIV),AL1(0),AL1(0),X'02'
*     CLEAR MESSAGE
      DC  X'0106',CL6'TMSG ',AL1(E),AL1(PRIV),AL1(0),AL1(0),X'02'
*     TEST MESSAGE
      DC  X'0107',CL6'SCKPF',AL1(E),AL1(PRIV),AL1(0),AL1(0),X'02'
*     Set TOD Programmable Field
      DC  X'0108',CL6'TMPS',AL1(E),AL1(PRIV),AL1(0),AL1(CZRO),X'02'
*                     Test Message Path State
      DC  X'0109',CL6'CMPS',AL1(E),AL1(PRIV),AL1(0),AL1(0),X'02'
*  Clear Message Path State (This instruction is a Coupling Facility)
      DC  X'010A',CL6'PFPO',AL1(E),AL1(0),AL1(0),AL1(0),X'02'
      DC  X'010B',CL6'TAM',AL1(E),AL1(0),AL1(0),AL1(C40),X'02'
      DC  X'010C',CL6'SAM24',AL1(E),AL1(0),AL1(0),AL1(0),X'02'
      DC  X'010D',CL6'SAM31',AL1(E),AL1(0),AL1(0),AL1(0),X'02'
      DC  X'010E',CL6'SAM64',AL1(E),AL1(0),AL1(0),AL1(0),X'02'
      DC  X'01FF',CL6'TRAP2',AL1(E),AL1(0),AL1(0),AL1(0),X'02'
* THE FOLLOWING INSTRUCTIONS ARE OBSOLETE
      DC  X'9C00',CL6'SIO',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'9C01',CL6'SIOF',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'9D00',CL6'TIO',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'9D01',CL6'CLRIO',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'9E00',CL6'HIO',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'9E01',CL6'HDV',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'9F00',CL6'TCH',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*
      DC  X'A400',CL6'VAE',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'A500',CL6'VAER',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'A600',CL6'VMXSE',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'A602',CL6'VMXAE',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'A608',CL6'VLELE',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'A609',CL6'VXELE',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'A610',CL6'VMXSD',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'A611',CL6'VMNSD',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'A612',CL6'VMXAD',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'A618',CL6'VMELD',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'AA02',CL6'?AA02',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'AA03',CL6'?AA03',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*
      DC  X'B200',CL6'CONCS',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B201',CL6'DISCS',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B202',CL6'STIDP',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B203',CL6'STIDC',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B204',CL6'SCK',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B205',CL6'STCK',AL1(S),AL1(0),AL1(E8+S2),AL1(C51),X'04'
      DC  X'B206',CL6'SCKC',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B207',CL6'STCKC',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B208',CL6'SPT',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B209',CL6'STPT',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B20A',CL6'SPKA',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B20B',CL6'IPK',AL1(S),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B20D',CL6'PTLB',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B210',CL6'SPX',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B211',CL6'STPX',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B212',CL6'STAP',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B213',CL6'RRB ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B214',CL6'SIE',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B216',CL6'SETR ',AL1(S),AL1(0),AL1(0),AL1(0),X'04'
*     Set ETR Attachment Controls
      DC  X'B217',CL6'STETR',AL1(S),AL1(0),AL1(0),AL1(0),X'04'
*     Store ETR Attachment Controls
      DC  X'B218',CL6'PC',AL1(S),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B219',CL6'SAC',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B21A',CL6'CFC',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B21F',CL6'???',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B220',CL6'SERVC',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*     Service Processor Command
      DC  X'B221',CL6'IPTE',AL1(RRFA),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B222',CL6'IPM',AL1(RRE1),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B223',CL6'IVSK',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B224',CL6'IAC',AL1(RRE1),AL1(0),AL1(0),AL1(C41),X'04'
      DC  X'B225',CL6'SSAR',AL1(RRE1),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B226',CL6'EPAR',AL1(RRE1),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B227',CL6'ESAR',AL1(RRE1),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B228',CL6'PT',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B229',CL6'ISKE',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B22A',CL6'RRBE',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B22B',CL6'SSKE',AL1(RRFC),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B22C',CL6'TB',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B22D',CL6'DXR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B22E',CL6'PGIN',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B22F',CL6'PGOUT',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B230',CL6'CSCH',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B231',CL6'HSCH',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B232',CL6'MSCH',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B233',CL6'SSCH',AL1(S),AL1(PRIV),AL1(0),AL1(C52),X'04'
      DC  X'B234',CL6'STSCH',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B235',CL6'TSCH',AL1(S),AL1(PRIV),AL1(0),AL1(C64),X'04'
      DC  X'B236',CL6'TPI',AL1(S),AL1(PRIV),AL1(0),AL1(C62),X'04'
      DC  X'B237',CL6'SAL',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B238',CL6'RSCH',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B239',CL6'STCRW',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B23A',CL6'STCPS',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B23B',CL6'RCHP',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B23C',CL6'SCHM',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B23D',CL6'STZP',AL1(?),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B23E',CL6'SZP ',AL1(?),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B23F',CL6'TPZI',AL1(?),AL1(PRIV),AL1(0),AL1(0),X'04'
*
      DC  X'B240',CL6'BAKR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B241',CL6'CKSM',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B243',CL6'MADS',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*     Multiply and Add
      DC  X'B244',CL6'SQDR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B245',CL6'SQER',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B246',CL6'STURA',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B247',CL6'MSTA',AL1(RRE1),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B248',CL6'PALB',AL1(RRE0),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B249',CL6'EREG',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B24A',CL6'ESTA',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B24B',CL6'LURA',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B24C',CL6'TAR ',AL1(RRE2),AL1(AR1),AL1(0),AL1(0),X'04'
      DC  X'B24D',CL6'CPYA',AL1(RRE2),AL1(AR2),AL1(0),AL1(0),X'04'
      DC  X'B24E',CL6'SAR ',AL1(RRE2),AL1(AR1),AL1(0),AL1(0),X'04'
      DC  X'B24F',CL6'EAR ',AL1(RRE2),AL1(AR3),AL1(0),AL1(0),X'04'
      DC  X'B250',CL6'CSP ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B252',CL6'MSR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B254',CL6'MVPG',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B255',CL6'MVST',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B257',CL6'CUSE ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B258',CL6'BSG  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B259',CL6'IESBE',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*     Invalidate Expanded Storage Block Entry
      DC  X'B25A',CL6'BSA',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
* Asynchronous Page Facility instruction
*     DC  X'B25B',CL6'B25B ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B25C',CL6'B25C ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B25D',CL6'CLST',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B25E',CL6'SRST',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
* Channel Subsystem call
      DC  X'B25F',CL6'CHSC ',AL1(RRE1),AL1(PRIV),AL1(0),AL1(0),X'04'
*     Coupling facility instruction
*     DC  X'B260',CL6'CF60 ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B261',CL6'CF61 ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B262',CL6'LKPG ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*                     Lock PaGe
      DC  X'B263',CL6'CMPSC',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*                     CoMPreSsion Call
* Coupling facility instruction
      DC  X'B264',CL6'CF64',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B265',CL6'SVS',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*                     Set Vector Summary
      DC  X'B266',CL6'CF66',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B267',CL6'CF67',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*     Define Vector
      DC  X'B268',CL6'DV   ',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*     A cryptographic facility instruction
*     DC  X'B269',CL6'CR69',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B26A',CL6'CR6A',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B26B',CL6'CR6B',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B26C',CL6'CR6C',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B26D',CL6'CR6D',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B26E',CL6'CR6E',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B26F',CL6'CR6F',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
*     Set Primary Clock Selection
*     DC  X'B270',CL6'SPCS  ',AL1(?),AL1(PRIV),AL1(0),AL1(0),X'04'
*     Set Primary Clock Selection
*     DC  X'B271',CL6'STPCS ',AL1(?),AL1(PRIV),AL1(0),AL1(0),X'04'
*     Store Primary Clock Selection
* Coupling facility instruction
      DC  X'B272',CL6'CF72',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     A coupling facility instruction
*     DC  X'B274',CL6'SIGA ',AL1(?),AL1(?),AL1(0),AL1(0),X'04'
*         Signal Adapter
      DC  X'B276',CL6'XSCH ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B277',CL6'RP   ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B278',CL6'STCKE',AL1(S),AL1(PRIV),AL1(0),AL1(C51),X'04'
      DC  X'B279',CL6'SACF ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B27C',CL6'STCKF',AL1(S),AL1(PRIV),AL1(0),AL1(C51),X'04'
      DC  X'B27D',CL6'STSI ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
* LOAD PROGRAM PARAMETER  LOAD DATA INTO PROGRAM PARAMETER REGISTER
      DC  X'B280',CL6'LPP  ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B284',CL6'LCCTL',AL1(S),AL1(PRIV),AL1(0),AL1(C33),X'04'
      DC  X'B285',CL6'LPCTL',AL1(S),AL1(PRIV),AL1(0),AL1(C33),X'04'
      DC  X'B286',CL6'QSI  ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B287',CL6'LSCTL',AL1(S),AL1(PRIV),AL1(0),AL1(C33),X'04'
      DC  X'B28E',CL6'QCTRI',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B299',CL6'SRNM ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B29C',CL6'STFPC',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B29D',CL6'LFPC ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
*     DC  X'B2A4',CL6'MCBDM',AL1(????),AL1(0),AL1(0),AL1(0),X'04'
*                 Move Channel Buffer Data Multiple
      DC  X'B2A5',CL6'TRE  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B2A6',CL6'CU21',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
*                 Convert UTF-16 to UTF-8
      DC  X'B2A6',CL6'CUUTF',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
*                 Convert Unicode to UTF-8
      DC  X'B2A7',CL6'CUTFU',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B2B0',CL6'STFLE',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B2B1',CL6'STFL ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B2B2',CL6'LPSWE',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B2B8',CL6'SRNMB',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B2B9',CL6'SRNMT',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B2BD',CL6'LFAS ',AL1(S),AL1(PRIV),AL1(0),AL1(0),X'04'
* LPP INSTRUCTION CODE
      DC  X'B2E0',CL6'SCCTR',AL1(RRE2),AL1(PRIV),AL1(0),AL1(C32),X'04'
      DC  X'B2E1',CL6'SPCTR',AL1(RRE2),AL1(PRIV),AL1(0),AL1(C32),X'04'
      DC  X'B2E4',CL6'ECCTR',AL1(RRE2),AL1(PRIV),AL1(0),AL1(C32),X'04'
      DC  X'B2E5',CL6'EPCTR',AL1(RRE2),AL1(PRIV),AL1(0),AL1(C32),X'04'
      DC  X'B2E8',CL6'PPA  ',AL1(RRFC),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B2EC',CL6'ETND ',AL1(RRE1),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B2ED',CL6'ECPGA',AL1(RRE2),AL1(PRIV),AL1(0),AL1(C31),X'04'
      DC  X'B2F8',CL6'TEND',AL1(S),AL1(0),AL1(0),AL1(C61),X'04'
*     DC  X'B2FA',CL6'NIAI',AL1(IE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B2FC',CL6'TABORT',AL1(S),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B2FF',CL6'TRAP4',AL1(S),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B300',CL6'LPEBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B301',CL6'LNEBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B302',CL6'LTEBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B303',CL6'LCEBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B304',CL6'LDEBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B305',CL6'LXDBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B306',CL6'LXEBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B307',CL6'MXDBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B308',CL6'KEBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B309',CL6'CEBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B30A',CL6'AEBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B30B',CL6'SEBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B30C',CL6'MDEBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B30D',CL6'DEBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B30E',CL6'MAEBR',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B30F',CL6'MSEBR',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B310',CL6'LPDBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B311',CL6'LNDBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B312',CL6'LTDBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B313',CL6'LCDBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B314',CL6'SQEBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B315',CL6'SQDBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B316',CL6'SQXBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B317',CL6'MEEBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B318',CL6'KDBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B319',CL6'CDBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B31A',CL6'ADBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B31B',CL6'SDBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B31C',CL6'MDBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B31D',CL6'DDBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B31E',CL6'MADBR',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B31F',CL6'MSDBR',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B324',CL6'LDER ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B325',CL6'LXDR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B326',CL6'LXER ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B32E',CL6'MAER ',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B32F',CL6'MSER ',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B336',CL6'SQXR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B337',CL6'MEER ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B338',CL6'MAER ',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B339',CL6'MAYR ',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B33A',CL6'MYLR ',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B33B',CL6'MYR  ',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B33C',CL6'MAYHR',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B33D',CL6'MYHR ',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B33E',CL6'MADR ',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B33F',CL6'MSDR ',AL1(RRD),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B340',CL6'LPXBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B341',CL6'LNXBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B342',CL6'LTXBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B343',CL6'LCXBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B344',CL6'LEDBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B345',CL6'LDXBR',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B346',CL6'LEXBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B347',CL6'FIXBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B348',CL6'KXBR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B349',CL6'CXBR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B34A',CL6'AXBR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B34B',CL6'SXBR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B34C',CL6'MXBR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B34D',CL6'DXBR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B350',CL6'TBEDR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B351',CL6'TBDR  ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B353',CL6'DIEBR ',AL1(RRFB),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B357',CL6'FIEBR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B358',CL6'THDER ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B359',CL6'THDR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B35B',CL6'DIDBR ',AL1(RRFB),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B35F',CL6'FIDBR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B360',CL6'LPXR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CA1),X'04'
      DC  X'B361',CL6'LNXR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CA1),X'04'
      DC  X'B362',CL6'LTXR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CA1),X'04'
      DC  X'B363',CL6'LCXR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CA1),X'04'
      DC  X'B365',CL6'LXR   ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B366',CL6'LEXR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B367',CL6'FIXR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B369',CL6'CXR   ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B370',CL6'LPDFR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B371',CL6'LNDFR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B372',CL6'CPSDR ',AL1(RRFB),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B373',CL6'LCDFR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B374',CL6'LZER  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B375',CL6'LZDR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B376',CL6'LZXR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B377',CL6'FIER  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B37F',CL6'FIDR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B384',CL6'SFPC  ',AL1(RRE1),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B38C',CL6'EFPC  ',AL1(RRE1),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B390',CL6'CELFBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B391',CL6'CDLFBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B392',CL6'CXLFBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B394',CL6'CEFBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B395',CL6'CDFBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B396',CL6'CXFBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B398',CL6'CFEBR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B399',CL6'CFDBR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B39A',CL6'CFXBR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B39C',CL6'CLFEBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B39D',CL6'CLFDBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B39E',CL6'CLFXBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3A0',CL6'CELGBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3A1',CL6'CDLGBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3A2',CL6'CXLGBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3A4',CL6'CEGBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3A5',CL6'CDGBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3A6',CL6'CXGBR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3A8',CL6'CGEBR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3A9',CL6'CGDBR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3AA',CL6'CGXBR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3AC',CL6'CLGEBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3AD',CL6'CLGDBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3AE',CL6'CLGXBR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3B4',CL6'CEFR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3B5',CL6'CDFR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3B6',CL6'CXFR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3B8',CL6'CFER  ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3B9',CL6'CFDR  ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3BA',CL6'CFXR  ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3C1',CL6'LDGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3C4',CL6'CEGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3C5',CL6'CDGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3C6',CL6'CXGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3C8',CL6'CGER  ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3C9',CL6'CGDR  ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3CA',CL6'CGXR  ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3CD',CL6'LGDR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3D0',CL6'MDTR  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3D1',CL6'DDTR  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3D2',CL6'ADTR  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3D3',CL6'SDTR  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3D4',CL6'LDETR ',AL1(RRFD),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3D5',CL6'LEDTR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3D6',CL6'LTDTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3D7',CL6'FIDTR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3D8',CL6'MXTR  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3D9',CL6'DXTR  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B3D9',CL6'DXTRA ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3DA',CL6'AXTR  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
*     DC  X'B3DA',CL6'AXTRA ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3DB',CL6'SXTR  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3DC',CL6'LXDTR ',AL1(RRFD),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3DD',CL6'LDXTR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3DE',CL6'LTXTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3DF',CL6'FIXTR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3E0',CL6'KDTR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3E1',CL6'CGDTR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3E2',CL6'CUDTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3E3',CL6'CSDTR ',AL1(RRFD),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3E4',CL6'CDTR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3E5',CL6'EEDTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3E7',CL6'ESDTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3E8',CL6'KXTR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3E9',CL6'CGXTR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3EA',CL6'CUXTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3EB',CL6'CSXTR ',AL1(RRFD),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3EC',CL6'CXTR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3ED',CL6'EEXTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3EF',CL6'ESXTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3F1',CL6'CDGTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3F2',CL6'CDUTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3F3',CL6'CDSTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3F4',CL6'CEDTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3F5',CL6'QADTR ',AL1(RRFB),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3F6',CL6'IEDTR ',AL1(RRFB),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3F7',CL6'RRDTR ',AL1(RRFB),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3F9',CL6'CXGTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3FA',CL6'CXUTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3FB',CL6'CXSTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3FC',CL6'CEXTR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3FD',CL6'QAXTR ',AL1(RRFB),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3FE',CL6'IEXTR ',AL1(RRFB),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B3FF',CL6'RRXTR ',AL1(RRFB),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B900',CL6'LPGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CLP),X'04'
      DC  X'B901',CL6'LNGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CLN),X'04'
      DC  X'B902',CL6'LTGR ',AL1(RRE2),AL1(LROP),AL1(T8),AL1(CLT),X'04'
      DC  X'B903',CL6'LCGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CLCM),X'04'
      DC  X'B904',CL6'LGR   ',AL1(RRE2),AL1(LROP),AL1(0),AL1(0),X'04'
      DC  X'B905',CL6'LURAG ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B906',CL6'LGBR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B907',CL6'LGHR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B908',CL6'AGR  ',AL1(RRE2),AL1(CDOP),AL1(0),AL1(CA1),X'04'
      DC  X'B909',CL6'SGR  ',AL1(RRE2),AL1(CDOR),AL1(0),AL1(CA3),X'04'
      DC  X'B90A',CL6'ALGR ',AL1(RRE2),AL1(CDOP),AL1(0),AL1(CA2),X'04'
      DC  X'B90B',CL6'SLGR ',AL1(RRE2),AL1(CDOR),AL1(0),AL1(CA4),X'04'
      DC  X'B90C',CL6'MSGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B90D',CL6'DSGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B90E',CL6'EREGG ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B90F',CL6'LRVGR ',AL1(RRE2),AL1(0),AL1(0),AL1(CLP),X'04'
      DC  X'B910',CL6'LPGFR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B911',CL6'LNGFR ',AL1(RRE2),AL1(0),AL1(0),AL1(CLN),X'04'
      DC  X'B912',CL6'LTGFR ',AL1(RRE2),AL1(0),AL1(0),AL1(CLT),X'04'
      DC  X'B913',CL6'LCGFR ',AL1(RRE2),AL1(0),AL1(0),AL1(CLCM),X'04'
      DC  X'B914',CL6'LGFR  ',AL1(RRE2),AL1(LROP),AL1(0),AL1(0),X'04'
      DC  X'B916',CL6'LLGFR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B917',CL6'LLGTR ',AL1(RRE2),AL1(LROP),AL1(0),AL1(0),X'04'
      DC  X'B918',CL6'AGFR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B91A',CL6'ALGFR ',AL1(RRE2),AL1(0),AL1(0),AL1(CA2),X'04'
      DC  X'B91B',CL6'SLGFR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B91C',CL6'MSGFR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B91D',CL6'DSGFR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B91E',CL6'KMAC  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B91F',CL6'LRVR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B920',CL6'CGR   ',AL1(RRE2),AL1(0),AL1(0),AL1(CMP),X'04'
      DC  X'B921',CL6'CLGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CMP),X'04'
      DC  X'B925',CL6'STURG ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B926',CL6'LBR   ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B927',CL6'LHR   ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B928',CL6'PCKMO ',AL1(RRE0),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B92A',CL6'KMF   ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B92B',CL6'KMO   ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B92C',CL6'PCC   ',AL1(RRE0),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B92D',CL6'KMCTR ',AL1(RRFB),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B92E',CL6'KM    ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B92F',CL6'KMC   ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B930',CL6'CGFR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CMP),X'04'
      DC  X'B931',CL6'CLGFR ',AL1(RRE2),AL1(0),AL1(0),AL1(CMP),X'04'
      DC  X'B93E',CL6'KIMD  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B93F',CL6'KLMD  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B941',CL6'CFDTR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B942',CL6'CLGDTR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B943',CL6'CLFDTR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B946',CL6'BCTGR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B949',CL6'CFXTR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B94A',CL6'CLGXTR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B94B',CL6'CLFXTR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B951',CL6'CDFTR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B952',CL6'CDLGTR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B953',CL6'CDLFTR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B959',CL6'CXFTR ',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B95A',CL6'CXLGTR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B95B',CL6'CXLFTR',AL1(RRFE),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B960',CL6'CGRT  ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B961',CL6'CLGRT ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B972',CL6'CRT   ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B973',CL6'CLRT  ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B980',CL6'NGR',AL1(RRE2),AL1(0),AL1(0),AL1(CZRO),X'04'
      DC  X'B981',CL6'OGR',AL1(RRE2),AL1(0),AL1(0),AL1(CZRO),X'04'
      DC  X'B982',CL6'XGR',AL1(RRE2),AL1(CDOR),AL1(0),AL1(CZRO),X'04'
      DC  X'B983',CL6'FLOGR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B984',CL6'LLGCR ',AL1(RRE2),AL1(0),AL1(0),AL1(CZRO),X'04'
      DC  X'B985',CL6'LLGHR ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B986',CL6'MLGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B987',CL6'DLGR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B988',CL6'ALCGR ',AL1(RRE2),AL1(0),AL1(0),AL1(CA2),X'04'
      DC  X'B989',CL6'SLBGR ',AL1(RRE2),AL1(0),AL1(0),AL1(CA4),X'04'
      DC  X'B98A',CL6'CSPG  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B98D',CL6'EPSW  ',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B98E',CL6'IDTE  ',AL1(RRFB),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B98F',CL6'CRDTE ',AL1(RRFB),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B990',CL6'TRTT  ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B991',CL6'TRTO  ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B992',CL6'TROT  ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B993',CL6'TROO  ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B994',CL6'LLCR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B995',CL6'LLHR  ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B996',CL6'MLR   ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B997',CL6'DLR   ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B998',CL6'ALCR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CA2),X'04'
      DC  X'B999',CL6'SLBR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CA4),X'04'
      DC  X'B99A',CL6'EPAIR ',AL1(RRE1),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B99B',CL6'ESAIR ',AL1(RRE1),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B99D',CL6'ESEA  ',AL1(RRE1),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B99E',CL6'PTI   ',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B99F',CL6'SSAIR ',AL1(RRE1),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B9A2',CL6'PTF   ',AL1(RRE1),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B9AA',CL6'LPTEA ',AL1(RRFB),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B9AE',CL6'RRBM  ',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B9AF',CL6'PFMF  ',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B9B0',CL6'CU14  ',AL1(RRFC),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B9B1',CL6'CU24  ',AL1(RRFC),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B9B2',CL6'CU41  ',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B9B3',CL6'CU42  ',AL1(RRE2),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B9BD',CL6'TRTRE ',AL1(RRFC),AL1(PRIV),AL1(0),AL1(0),X'04'
      DC  X'B9BE',CL6'SRSTU ',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9BF',CL6'TRTE  ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9C8',CL6'AHHHR ',AL1(RRFA),AL1(0),AL1(0),AL1(CA1),X'04'
      DC  X'B9C9',CL6'SHHRR ',AL1(RRFA),AL1(0),AL1(0),AL1(CA1),X'04'
      DC  X'B9CA',CL6'ALHHHR',AL1(RRFA),AL1(0),AL1(0),AL1(CA2),X'04'
      DC  X'B9CB',CL6'SLHHRR',AL1(RRFA),AL1(0),AL1(0),AL1(CA4),X'04'
      DC  X'B9CD',CL6'CHHR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CMP),X'04'
      DC  X'B9CF',CL6'CLHHR ',AL1(RRE2),AL1(0),AL1(0),AL1(CMP),X'04'
      DC  X'B9D8',CL6'AHHLR ',AL1(RRFA),AL1(0),AL1(0),AL1(CA1),X'04'
      DC  X'B9D9',CL6'SHHLR ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9DA',CL6'ALHHLR',AL1(RRFA),AL1(0),AL1(0),AL1(CA2),X'04'
      DC  X'B9DB',CL6'SLHHLR',AL1(RRFA),AL1(0),AL1(0),AL1(CA4),X'04'
      DC  X'B9DD',CL6'CHLR  ',AL1(RRE2),AL1(0),AL1(0),AL1(CMP),X'04'
      DC  X'B9DF',CL6'CLHLR ',AL1(RRE2),AL1(0),AL1(0),AL1(CMP),X'04'
      DC  X'B9E1',CL6'POPCNT',AL1(RRE2),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9E2',CL6'LOCGR ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9E4',CL6'NGRK  ',AL1(RRFA),AL1(0),AL1(0),AL1(CZRO),X'04'
      DC  X'B9E6',CL6'OGRK  ',AL1(RRFA),AL1(0),AL1(0),AL1(CZRO),X'04'
      DC  X'B9E7',CL6'XGRK  ',AL1(RRFA),AL1(0),AL1(0),AL1(CZRO),X'04'
      DC  X'B9E8',CL6'AGRK  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9E9',CL6'SGRK  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9EA',CL6'ALGRK ',AL1(RRFA),AL1(0),AL1(0),AL1(CA2),X'04'
      DC  X'B9EB',CL6'SLGRK ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9F2',CL6'LOCR  ',AL1(RRFC),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9F4',CL6'NRK   ',AL1(RRFA),AL1(0),AL1(0),AL1(CZRO),X'04'
      DC  X'B9F6',CL6'ORK   ',AL1(RRFA),AL1(0),AL1(0),AL1(CZRO),X'04'
      DC  X'B9F7',CL6'XRK   ',AL1(RRFA),AL1(0),AL1(0),AL1(CZRO),X'04'
      DC  X'B9F8',CL6'ARK   ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9F9',CL6'SRK   ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
      DC  X'B9FA',CL6'ALRK  ',AL1(RRFA),AL1(0),AL1(0),AL1(CA2),X'04'
      DC  X'B9FB',CL6'SLRK  ',AL1(RRFA),AL1(0),AL1(0),AL1(0),X'04'
*
      DC  X'E500',CL6'LASP',AL1(SSE),AL1(PRIVP),AL1(0),AL1(C42),X'06'
      DC  X'E501',CL6'TPROT ',AL1(SSE),AL1(PRIV),AL1(0),AL1(C63),X'06'
      DC  X'E502',CL6'STRAG ',AL1(SSE),AL1(PRIV),AL1(0),AL1(0),X'06'
      DC  X'E50E',CL6'MVCSK ',AL1(SSE),AL1(PRIV),AL1(0),AL1(0),X'06'
      DC  X'E50F',CL6'MVCDK ',AL1(SSE),AL1(PRIV),AL1(0),AL1(0),X'06'
      DC  X'E544',CL6'MVHHI ',AL1(SIL),AL1(0),AL1(0),AL1(0),X'06'
      DC  X'E548',CL6'MVGHI ',AL1(SIL),AL1(0),AL1(0),AL1(0),X'06'
      DC  X'E54C',CL6'MVHI  ',AL1(SIL),AL1(0),AL1(0),AL1(0),X'06'
      DC  X'E554',CL6'CHHSI ',AL1(SIL),AL1(0),AL1(0),AL1(CMP),X'06'
      DC  X'E555',CL6'CLHHSI',AL1(SIL),AL1(0),AL1(0),AL1(CMP),X'06'
      DC  X'E558',CL6'CGHSI ',AL1(SIL),AL1(0),AL1(0),AL1(CMP),X'06'
      DC  X'E559',CL6'CLGHSI',AL1(SIL),AL1(0),AL1(0),AL1(CMP),X'06'
      DC  X'E55C',CL6'CHSI  ',AL1(SIL),AL1(0),AL1(0),AL1(CMP),X'06'
      DC  X'E55D',CL6'CLFHSI',AL1(SIL),AL1(0),AL1(0),AL1(CMP),X'06'
      DC  X'E560',CL6'TBEGIN',AL1(SIL),AL1(NPSA),AL1(0),AL1(0),X'06'
      DC  X'E561',CL6'TBEGIN',AL1(SIL),AL1(NPSA),AL1(0),AL1(0),X'06'
*     DC  X'E561',CL7'TBEGINC',AL1(SIL),AL1(NPSA),AL1(0),AL1(0),X'06'
      DC  X'FFFF'                 TABLE END
L3LOPV CSECT
L3LOP  DS  0CL13                   12O-BYTE OP-CODE TABLE
    DC  X'A500',CL6'IIHH  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A501',CL6'IIHL  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A502',CL6'IILH  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A503',CL6'IILL  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A504',CL6'NIHH  ',AL1(RI2),AL1(0),AL1(IM2),AL1(CZRO),X'04'
    DC  X'A505',CL6'NIHL  ',AL1(RI2),AL1(0),AL1(IM2),AL1(CZRO),X'04'
    DC  X'A506',CL6'NILH  ',AL1(RI2),AL1(0),AL1(IM2),AL1(CZRO),X'04'
    DC  X'A507',CL6'NILL  ',AL1(RI2),AL1(0),AL1(IM2),AL1(CZRO),X'04'
    DC  X'A508',CL6'OIHH  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A509',CL6'OIHL  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A50A',CL6'OILH  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A50B',CL6'OILL  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A50C',CL6'LLIHH ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A50D',CL6'LLIHL ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A50E',CL6'LLILH ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A50F',CL6'LLILL ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A510',CL6'VADR  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A511',CL6'VSDR  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A512',CL6'VMDR  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A513',CL6'VDDR  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A516',CL6'VMCDR ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A517',CL6'VACDR ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A518',CL6'VCDR  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A519',CL6'VLDR  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A51A',CL6'VLMDR ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A51B',CL6'VLZDR ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A520',CL6'VAR   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A521',CL6'VSR   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A522',CL6'VMR   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A524',CL6'VNR   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A525',CL6'VOR   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A526',CL6'VXR   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A528',CL6'VCR   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A540',CL6'VLPER ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A541',CL6'VLNER ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A542',CL6'VLCER ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A543',CL6'VSQER ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A550',CL6'VLPDR ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A551',CL6'VLNDR ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A552',CL6'VLCDR ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A553',CL6'VSQDR ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A560',CL6'VLPR  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A561',CL6'VLNR  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A562',CL6'VLCR  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A580',CL6'VAEQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A581',CL6'VSEQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A582',CL6'VMEQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A583',CL6'VDEQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A584',CL6'VMAEQ ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A588',CL6'VCEQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A589',CL6'VLEQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A58A',CL6'VLMEQ ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A590',CL6'VADQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A591',CL6'VSDQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A592',CL6'VMDQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A593',CL6'VDDQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A594',CL6'VMADQ ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A595',CL6'VMSDQ ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A598',CL6'VCDQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A599',CL6'VLDQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A59A',CL6'VLMDQ ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A5A0',CL6'VAQ   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A5A1',CL6'VSQ   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A5A2',CL6'VMQ   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A5A4',CL6'VNQ   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A5A5',CL6'VOQ   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A5A6',CL6'VXQ   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A5A8',CL6'VCQ   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A5A9',CL6'VLQ   ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A5AA',CL6'VLMQ  ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A600',CL6'VMXSE ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A601',CL6'VMNSE ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A602',CL6'VMXAE ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A608',CL6'VLELE ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A609',CL6'VXELE ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A610',CL6'VMXSD ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A611',CL6'VMNSD ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A612',CL6'VMXAD ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A618',CL6'VLELD ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
*   DC  X'A619',CL6'VXELD ',AL1(RI2),AL1(0),AL1(IM2),AL1(0),X'04'
    DC  X'A700',CL6'TMLH  ',AL1(RI2),AL1(0),AL1(IM2+T8),AL1(CTMX),X'04'
    DC  X'A701',CL6'TMLL  ',AL1(RI2),AL1(0),AL1(IM2+T8),AL1(CTMX),X'04'
    DC  X'A702',CL6'TMHH  ',AL1(RI2),AL1(0),AL1(IM2+T8),AL1(CTMX),X'04'
    DC  X'A703',CL6'TMHL  ',AL1(RI2),AL1(0),AL1(IM2+T8),AL1(CTMX),X'04'
    DC  X'A704',CL6'JNOP  ',AL1(RI1),AL1(RB),AL1(0),AL1(0),X'04'
*   DC  X'A705',CL6'BRAS  ',AL1(RI1),AL1(RB),AL1(0),AL1(0),X'04'
    DC  X'A705',CL6'JAS   ',AL1(RI1),AL1(RB),AL1(0),AL1(0),X'04'
*   DC  X'A706',CL6'BRCT  ',AL1(RI1),AL1(RB),AL1(0),AL1(0),X'04'
    DC  X'A706',CL6'JCT   ',AL1(RI1),AL1(RB),AL1(0),AL1(0),X'04'
*   DC  X'A707',CL6'BRCTG ',AL1(RI1),AL1(RB),AL1(0),AL1(0),X'04'
    DC  X'A707',CL6'JCTG  ',AL1(RI1),AL1(RB),AL1(0),AL1(0),X'04'
    DC  X'A708',CL6'LHI   ',AL1(RI2),AL1(CDOP),AL1(0),AL1(0),X'04'
    DC  X'A709',CL6'LGHI  ',AL1(RI2),AL1(CDOP),AL1(0),AL1(0),X'04'
    DC  X'A70A',CL6'AHI   ',AL1(RI2),AL1(CDOP),AL1(0),AL1(CA1),X'04'
    DC  X'A70B',CL6'AGHI  ',AL1(RI2),AL1(CDOP),AL1(0),AL1(CA1),X'04'
    DC  X'A70C',CL6'MHI   ',AL1(RI2),AL1(CDOP),AL1(0),AL1(0),X'04'
    DC  X'A70D',CL6'MGHI  ',AL1(RI2),AL1(CDOP),AL1(0),AL1(0),X'04'
    DC  X'A70E',CL6'CHI   ',AL1(RI2),AL1(0),AL1(0),AL1(CMP),X'04'
    DC  X'A70F',CL6'CGHI  ',AL1(RI2),AL1(0),AL1(0),AL1(CMP),X'04'
*  C00 LARL    LOAD ADDRESS RELATIVE LONG
    DC  X'C000',CL6'LARL  ',AL1(RIL1),AL1(LIOP),AL1(0),AL1(0),X'06'
*  C01 LOAD IMMEDIATE              LGFI R6,200000  C06100030D40
    DC  X'C001',CL6'LGFI  ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
*   DC  X'C004',CL6'BRCL  ',AL1(RIL1),AL1(RB),AL1(0),AL1(0),X'06'
    DC  X'C004',CL6'JCL   ',AL1(RIL1),AL1(RB),AL1(0),AL1(0),X'06'
*  C04 JCL    BRANCH RELATIVE LONG
    DC  X'C005',CL6'BRASL ',AL1(RIL1),AL1(RB),AL1(0),AL1(0),X'06'
*  C05 JASL    BRANCH RELATIVE AND SAVE LONG  BRASL R1,I2L
    DC  X'C006',CL6'XIHF  ',AL1(RIL2),AL1(0),AL1(0),AL1(CZRO),X'06'
    DC  X'C007',CL6'XILF  ',AL1(RIL2),AL1(0),AL1(0),AL1(CZRO),X'06'
    DC  X'C008',CL6'IIHF  ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C009',CL6'IILF  ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C00A',CL6'NIHF  ',AL1(RIL2),AL1(0),AL1(0),AL1(CZRO),X'06'
    DC  X'C00B',CL6'NILF  ',AL1(RIL2),AL1(0),AL1(0),AL1(CZRO),X'06'
    DC  X'C00C',CL6'OIHF  ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C00D',CL6'OILF  ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C00E',CL6'LLIHF ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C00F',CL6'LLILF ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C201',CL6'MSFI  ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C204',CL6'SLGFI ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C205',CL6'SLFI  ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
*  C29 ADD IMMEDIATE             AFI R5,200000   C25900030D40
    DC  X'C209',CL6'AFI   ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C20A',CL6'ALGFI ',AL1(RIL2),AL1(0),AL1(0),AL1(CA2),X'06'
    DC  X'C20B',CL6'ALFI  ',AL1(RIL2),AL1(0),AL1(0),AL1(CA2),X'06'
    DC  X'C20C',CL6'CGFI  ',AL1(RIL2),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C20D',CL6'CFI   ',AL1(RIL2),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C20E',CL6'CLGFI ',AL1(RIL2),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C20F',CL6'CLFI  ',AL1(RIL2),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C402',CL6'LLHRL ',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
*   DC  X'C404',CL6'LGHRL ',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C405',CL6'LHRL  ',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C406',CL6'LLGHRL',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C407',CL6'STHRL ',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C408',CL6'LGRL  ',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C40B',CL6'STGRL ',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C40C',CL6'LGRFL ',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C40D',CL6'LRL   ',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C40E',CL6'LLGFRL',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C40F',CL6'STRL  ',AL1(RIL1),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C600',CL6'EXRL  ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C604',CL6'CGHRL ',AL1(RIL1),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C605',CL6'CHRL  ',AL1(RIL1),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C606',CL6'CLGHRL',AL1(RIL1),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C607',CL6'CLHRL ',AL1(RIL1),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C608',CL6'CGRL  ',AL1(RIL1),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C60A',CL6'CLGRL ',AL1(RIL1),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C60C',CL6'CGFRL ',AL1(RIL1),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C60D',CL6'CRL   ',AL1(RIL1),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C60E',CL6'CLGFRL',AL1(RIL1),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C60F',CL6'CLRL  ',AL1(RIL1),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'C800',CL6'MVCOS ',AL1(SSF),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C801',CL6'ECTG  ',AL1(SSF),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C802',CL6'CSST  ',AL1(SSF),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C804',CL6'LPD   ',AL1(SSF),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'C805',CL6'LPDG  ',AL1(SSF),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'CC06',CL6'BRCTH ',AL1(RIL2),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'CC08',CL6'AIH   ',AL1(RIL2),AL1(0),AL1(0),AL1(CA1),X'06'
    DC  X'CC0A',CL6'ALSIH ',AL1(RIL2),AL1(0),AL1(0),AL1(CA2),X'06'
    DC  X'CC0B',CL6'ALSIHN',AL1(RIL2),AL1(0),AL1(0),AL1(CA2),X'06'
    DC  X'CC0D',CL6'CIH   ',AL1(RIL2),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'CC0F',CL6'CLIH  ',AL1(RIL2),AL1(0),AL1(0),AL1(CMP),X'06'
    DC  X'FFFF'                 TABLE END
*   6 BYTES INSTRUCTION      IIRXBDDD00II    R1,D2(X2,B2)
L4LOPV CSECT
L4LOP  DS  0CL13
    DC  X'E302',CL6'LTG  ',AL1(RXY),AL1(0),AL1(0),AL1(CLT),X'86'
    DC  X'E303',CL6'LRAG ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E304',CL6'LG   ',AL1(RXY),AL1(LIOP),AL1(0),AL1(0),X'86'
    DC  X'E306',CL6'LVBY ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E308',CL6'AG  ',AL1(RXY),AL1(CDOPA),AL1(0),AL1(0),X'86'
    DC  X'E309',CL6'SG  ',AL1(RXY),AL1(CDOPA),AL1(0),AL1(0),X'86'
    DC  X'E30A',CL6'ALG ',AL1(RXY),AL1(CDOPA),AL1(0),AL1(CA2),X'86'
    DC  X'E30B',CL6'SLG ',AL1(RXY),AL1(CDOPA),AL1(0),AL1(CA4),X'86'
    DC  X'E30C',CL6'MSG ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E30D',CL6'DSG ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E30E',CL6'CVBG',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E30F',CL6'LRVG',AL1(RXY),AL1(0),AL1(0),AL1(CLP),X'86'
    DC  X'E312',CL6'LT  ',AL1(RXY),AL1(LIOP),AL1(0),AL1(CLT),X'46'
    DC  X'E313',CL6'LRAY',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E314',CL6'LGF ',AL1(RXY),AL1(LIOP),AL1(0),AL1(0),X'46'
    DC  X'E315',CL6'LGH ',AL1(RXY),AL1(CDOP),AL1(0),AL1(0),X'26'
    DC  X'E316',CL6'LLGF',AL1(RXY),AL1(LIOP),AL1(0),AL1(0),X'46'
    DC  X'E317',CL6'LLGT',AL1(RXY),AL1(LIOP),AL1(0),AL1(0),X'46'
    DC  X'E318',CL6'AGF ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E319',CL6'SGF ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E31A',CL6'ALGF',AL1(RXY),AL1(CDOPA),AL1(0),AL1(CA2),X'86'
    DC  X'E31B',CL6'SLGF',AL1(RXY),AL1(CDOPA),AL1(0),AL1(CA4),X'86'
    DC  X'E31C',CL6'MSGF',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E31D',CL6'DSGF ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E31E',CL6'LRV  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E31F',CL6'LRVH ',AL1(RXY),AL1(0),AL1(0),AL1(CLP),X'86'
    DC  X'E320',CL6'CG   ',AL1(RXY),AL1(0),AL1(0),AL1(CMP),X'86'
    DC  X'E321',CL6'CLG  ',AL1(RXY),AL1(0),AL1(0),AL1(CMP),X'86'
    DC  X'E324',CL6'STG  ',AL1(RXY),AL1(LIOP),AL1(0),AL1(0),X'86'
    DC  X'E325',CL6'NTSTG',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E326',CL6'CVDY ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
*   DC  X'E32A',CL6'LZRG ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'E32E',CL6'CVDG ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E32F',CL6'STRVG',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E330',CL6'CGF  ',AL1(RXY),AL1(0),AL1(0),AL1(CMP),X'86'
    DC  X'E331',CL6'CLGF ',AL1(RXY),AL1(0),AL1(0),AL1(CMP),X'86'
    DC  X'E332',CL6'LTGF ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E334',CL6'CGH  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E336',CL6'PFD  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
*   DC  X'E33A',CL6'LLZRGF',AL1(RXY),AL1(0),AL1(0),AL1(0),X'06'
*   DC  X'E33B',CL6'LZRF  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'E33E',CL6'STRV ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E33F',CL6'STRVH',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
*   DC  X'E345',CL6'LDXBR',AL1(RRE),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'E346',CL6'BCTG ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E350',CL6'STY  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E351',CL6'MSY  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E354',CL6'NY   ',AL1(RXY),AL1(0),AL1(0),AL1(CZRO),X'46'
    DC  X'E355',CL6'CLY  ',AL1(RXY),AL1(0),AL1(0),AL1(CZRO),X'46'
    DC  X'E356',CL6'OY   ',AL1(RXY),AL1(0),AL1(0),AL1(CZRO),X'46'
    DC  X'E357',CL6'XY   ',AL1(RXY),AL1(0),AL1(0),AL1(CZRO),X'46'
    DC  X'E358',CL6'LY   ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E359',CL6'CY   ',AL1(RXY),AL1(0),AL1(0),AL1(CMP),X'46'
    DC  X'E35A',CL6'AY   ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E35B',CL6'SY   ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E35C',CL6'MFY  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E35E',CL6'ALY  ',AL1(RXY),AL1(0),AL1(0),AL1(CA2),X'46'
    DC  X'E35F',CL6'SLY  ',AL1(RXY),AL1(0),AL1(0),AL1(CA4),X'46'
    DC  X'E370',CL6'STHY ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E371',CL6'LAY  ',AL1(RXY),AL1(LIOP),AL1(0),AL1(0),X'16'
    DC  X'E372',CL6'STCY ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E373',CL6'ICY  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'16'
    DC  X'E375',CL6'LAEY ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'E376',CL6'LB   ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'E377',CL6'LGB  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'06'
    DC  X'E378',CL6'LHY ',AL1(RXY),AL1(0),AL1(E4+S2),AL1(0),X'46'
    DC  X'E379',CL6'CHY ',AL1(RXY),AL1(0),AL1(E4+S2),AL1(0),X'46'
    DC  X'E37A',CL6'AHY ',AL1(RXY),AL1(0),AL1(E4+S2),AL1(CA1),X'46'
    DC  X'E37B',CL6'SHY ',AL1(RXY),AL1(0),AL1(E4+S2),AL1(0),X'46'
    DC  X'E37C',CL6'MHY ',AL1(RXY),AL1(0),AL1(E4+S2),AL1(0),X'46'
    DC  X'E380',CL6'NG  ',AL1(RXY),AL1(0),AL1(E4),AL1(CZRO),X'86'
    DC  X'E381',CL6'OG  ',AL1(RXY),AL1(0),AL1(E4),AL1(CZRO),X'86'
    DC  X'E382',CL6'XG  ',AL1(RXY),AL1(0),AL1(E4),AL1(CZRO),X'86'
    DC  X'E385',CL6'LGAT',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E386',CL6'MLG ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E387',CL6'DLG ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E388',CL6'ALCG',AL1(RXY),AL1(0),AL1(0),AL1(CA2),X'86'
    DC  X'E389',CL6'SLBG',AL1(RXY),AL1(0),AL1(0),AL1(CA4),X'86'
    DC  X'E38E',CL6'STPQ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E38F',CL6'LPQ ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'86'
    DC  X'E390',CL6'LLGC',AL1(RXY),AL1(LIOP),AL1(0),AL1(CZRO),X'16'
    DC  X'E391',CL6'LLGH',AL1(RXY),AL1(LIOP),AL1(0),AL1(0),X'26'
    DC  X'E394',CL6'LLC ',AL1(RXY),AL1(0),AL1(0),AL1(CZRO),X'16'
    DC  X'E395',CL6'LLH',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E396',CL6'ML ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E397',CL6'MDL',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E398',CL6'ALC',AL1(RXY),AL1(0),AL1(0),AL1(CA2),X'06'
    DC  X'E399',CL6'SLB',AL1(RXY),AL1(0),AL1(0),AL1(CA4),X'06'
    DC  X'E39C',CL6'LLGTAT',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E39D',CL6'LLGFAT',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E39F',CL6'LAT   ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'46'
    DC  X'E3C0',CL6'LBH   ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E3C2',CL6'LLCH  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E3C3',CL6'STCH  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E3C4',CL6'LHH   ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E3C6',CL6'LLHH  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E3C7',CL6'STHH  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E3C8',CL6'LFHAT ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E3CA',CL6'LFH   ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E3CB',CL6'STFH  ',AL1(RXY),AL1(0),AL1(0),AL1(0),X'26'
    DC  X'E3CD',CL6'CHF   ',AL1(RXY),AL1(0),AL1(0),AL1(CMP),X'26'
    DC  X'E3CF',CL6'CLHF  ',AL1(RXY),AL1(0),AL1(0),AL1(CMP),X'26'
    DC  X'EC45',CL6'BRXLG ',AL1(RIE),AL1(0),AL1(0),AL1(0),X'06'
