SFTCS    CSECT
SFTTB    DS    0CL18                   SYSTEM FUNCTION TABLE
         DC    AL2(0),CL16'LXRES'
         DC    AL2(4),CL16'LXFRE'
         DC    AL2(8),CL16'ETCRE'
         DC    AL2(12),CL16'ETDES'
         DC    AL2(16),CL16'ETCON'
         DC    AL2(20),CL16'ETDIS'
         DC    AL2(24),CL16'AXRES'
         DC    AL2(28),CL16'ATFRE'
         DC    AL2(32),CL16'ATEXT'
         DC    AL2(36),CL16'AXSET'
         DC    AL2(40),CL16'ATSET'
         DC    AL2(56),CL16'ENQ/DEQ'
         DC    AL2(64),CL16'GQSCAN'
         DC    AL2(76),CL16'CPOOL BUILD'
         DC    AL2(80),CL16'CPOOL EXPAND'
         DC    AL2(84),CL16'CPOOL DELETE'
         DC    AL2(88),CL16'VSMLIST'
         DC    AL2(92),CL16'VSMLOC'
         DC    AL2(96),CL16'CPUTIMER'
         DC    AL2(100),CL16'CNZQUERY'
         DC    AL2(104),CL16'ISQSCAN LOCAL'
         DC    AL2(108),CL16'ISGENQ'
         DC    AL2(112),CL16'ISGQUERY'
         DC    AL2(128),CL16'CSVVFORK'
         DC    AL2(132),CL16'CSVVFSCH'
         DC    AL2(136),CL16'IFAQUERY'
         DC    AL2(140),CL16'LLA LOOKASIDE'
         DC    AL2(144),CL16'DIV'
         DC    AL2(148),CL16'SYMREC'
         DC    AL2(156),CL16'LOCASCB'
         DC    AL2(160),CL16'STORAGE OBTAIN'   SSRV 030B
         DC    AL2(164),CL16'RESMGR'
         DC    AL2(168),CL16'WAIT'
         DC    AL2(172),CL16'POST'
         DC    AL2(176),CL16'PC-ESTAEX'
         DC    AL2(180),CL16'ASCRE/DES/EXT'
         DC    AL2(184),CL16'RESERVED'
         DC    AL2(188),CL16'ALESERV ADDPASN'
         DC    AL2(192),CL16'ALESERV DELETE'
         DC    AL2(196),CL16'ALESERV EXTRACT'
         DC    AL2(200),CL16'ALESERV SEARCH'
         DC    AL2(204),CL16'STORAGE RELEASE'       SSRV 0311
         DC    AL2(208),CL16'DSPSERV'               900
         DC    AL2(212),CL16'TCBTOKEN'
         DC    AL2(220),CL16'IXC SERVICE'
         DC    AL2(224),CL16'TESTART'
         DC    AL2(232),CL16'CSVQUERY'
         DC    AL2(244),CL16'TIMEUSED'
         DC    AL2(252),CL16'SUSPEND'
         DC    AL2(256),CL16'RESUME'
         DC    AL2(260),CL16'PURGE SRB'
         DC    AL2(264),CL16'LLACOPY'
         DC    AL2(284),CL16'SDOM SERVICE'
         DC    AL2(288),CL16'SDOM CONNECT'
         DC    AL2(292),CL16'SDOM DISCON'
         DC    AL2(296),CL16'CTRACEWR'
         DC    AL2(304),CL16'STCKCONV/TIME'
         DC    AL2(308),CL16'UCBPIN/UCBLOOK'
         DC    AL2(312),CL16'UCBINFO/UCBSCAN'
         DC    AL2(320),CL16'EDTINFO'
         DC    AL2(336),CL16'ENQ/RESERVE'
         DC    AL2(340),CL16'DEQ'
         DC    AL2(352),CL16'CONVTOD'
         DC    AL2(356),CL16'CSVAPF'
         DC    AL2(368),CL16'CSVDYNEX'
         DC    AL2(376),CL16'SCHEDIRB'
         DC    AL2(380),CL16'IWM4 SERVICE'
         DC    AL2(392),CL16'IOSADMF'
         DC    AL2(400),CL16'TESTART'
         DC    AL2(408),CL16'IEAMSCHD'
         DC    AL2(420),CL16'IOSCAPU'
         DC    AL2(424),CL16'IEFDDSRV'
         DC    AL2(428),CL16'IEAMETR'
         DC    AL2(436),CL16'IEALSQRY'
         DC    AL2(444),CL16'IOSCDR'
         DC    AL2(448),CL16'CSVDYNL'
         DC    AL2(456),CL16'IEFPRMLB'
         DC    AL2(468),CL16'CSVDYLPA'
         DC    AL2(472),CL16'ALESERV DUALPOOL'
         DC    AL2(480),CL16'IEAMPDQ'
         DC    AL2(496),CL16'IEAAPF'
         DC    AL2(500),CL16'IEAARR'
         DC    AL2(504),CL16'IEAARR'
         DC    AL2(512),CL16'IOSSPOF/IOSWITCH'
         DC    AL2(576),CL16'ITTWRITE'
         DC    AL2(580),CL16'IEAARR'
         DC    AL2(588),CL16'IEAARR'
         DC    AL2(772),CL16'GQSCAN'
         DC    X'FF'                 END OF TABLE
