         MACRO
&NAME    DCMSFMT  &BEEP=NO,&RESTORE=YES,&RESET=YES
.*.
.*$MACRO=DCMSFMT    DATE=09/00/79       SOURCE=SDC
.*
.*  THIS MACRO IS PART OF DCMS.  IT IS STARTS A SCREEN DEFINITION.
.*  (RENAMED FROM SFMT)
.*.
         GBLA  &SFCOL,&SFROW,&SFLEN,&SFCNT
         GBLA  &SFLTBL(200),&SFSTRT(20),&SFEND(20),&SFFCT,&SFNCT
         GBLB  &SFNUM(200),&SFFLAG,&SFCUR
         GBLC  &SFFNAM(200),&SFNAM(20)
         GBLC  &SFENAM
         LCLB  &BP,&RR,&RS
         AIF   (&SFFLAG).E1
         AIF   (T'&NAME EQ 'O').E2
&SFFLAG  SETB  1
&SFNCT   SETA  &SFNCT+1
         AIF   (&SFNCT GT 20).ERR
&SFNAM(&SFNCT) SETC '&NAME'
&SFSTRT(&SFNCT) SETA &SFFCT+1
         AIF   ('&BEEP' EQ 'NO' OR '&BEEP' EQ 'YES').BEEPOK
         MNOTE 4,' BEEP=&BEEP ASSUMED TO MEAN BEEP=YES'
.BEEPOK  ANOP
&BP      SETB  ('&BEEP' NE 'NO')
         AIF   ('&RESTORE' EQ 'NO' OR '&RESTORE' EQ 'YES').RSTROK
         MNOTE 4,' RESTORE=&RESTORE ASSUMED TO MEAN RESTORE=NO'
.RSTROK  ANOP
&RR      SETB  ('&RESTORE' EQ 'YES')
         AIF   ('&RESET' EQ 'NO' OR '&RESET' EQ 'YES').RSTOK
         MNOTE 4,' RESET=&RESET ASSUMED TO MEAN RESET=NO'
.RSTOK   ANOP
&RS      SETB  ('&RESET' EQ 'YES')
&SFENAM  SETC  'SF&SYSNDX'
&NAME    DC    Y(L&SFENAM,&SFENAM)          LENGTHS
         DC    BL2'00000&BP&RR&RS.00000000' FLAGS
&SFCUR   SETB  0
&SFCNT   SETA  0
&SFLEN   SETA  0
&SFROW   SETA  1                  TOP OF SCREEN
&SFCOL   SETA  2                  POSITION 1 IS AN ATTRIBUTE BYTE
         MEXIT
.E1      MNOTE 8,'OUT OF SEQUENCE'
         MEXIT
.E2      MNOTE 8,'FORMAT NAME REQUIRED'
         MEXIT
.ERR     MNOTE 12,'*** TOO MANY DIFFERENT FORMATS ***'
         MEND
