         MACRO
         OACPRTPM &DUMMY,&PRINT=
.*
.*       SETS  VALUES OF &OACPRT AND &OACPRTS DEPENDING ON
.*       VALUES OF &OACPRTG, &OACPRTF, AND &PRINT
.*
.*       DOES  A PUSH PRINT AND A PRINT ON,GEN OR A
.*       PRINT OFF,NOGEN DEPENDING ON THE CALCULATED VALUE
.*       OF &OACPRT
.*
         COPY  OACGBLS
&OACPRT  SETC  '&OACPRTG'
         AIF   (&OACPRTF).L4
         AIF   ('&PRINT' EQ '').L1DEF
         AIF   ('&PRINT' NE 'ALL' ).L1
&OACPRT  SETC  'ALL'
         AGO   .L4
.L1      AIF   ('&PRINT' NE 'SHORT').L2
.L1DEF   ANOP                     DEFAULT PRINT VALUE
&OACPRT  SETC  'SHORT'
         AGO   .L4
.L2      AIF   ('&PRINT' EQ 'NONE').L3
         MNOTE 4,'UNRECOGNIZABLE PRINT VALUE ''NONE'' USED'
.L3      ANOP
&OACPRT  SETC  'NONE'
.L4      ANOP
         PUSH  PRINT
         AIF   ('&OACPRT' NE 'ALL').L5
&OACPRTS SETA  99
         AGO   .L8
.L5      AIF   ('&OACPRT' NE 'SHORT').L6
&OACPRTS SETA  1
         AGO   .L8
.L6      AIF   ('&OACPRT' EQ 'NONE').L7
         MNOTE 4,'UNRECOGNIZABLE VALUE OF &OACPRTG ''NONE'' SET'
&OACPRTG SETC  'NONE'
&OACPRT  SETC  '&OACPRTG'
.L7      ANOP
         PRINT OFF,GEN
&OACPRTS SETA  1
.L8      MEND
