         MACRO
         PDE   ,
PDE      DSECT ,                        PARSE DESCRIPTOR ELEMENT
PDEPTR   DS    A                        TEXT PTR
PDELEN   DS    H                        LEN
PDEFLAG  DS    X                        FLAGS
PDEFPRES EQU   X'80'                    PARM PRESENT
         DS    X                        RESERVED
PDEPTR2  DS    A
PDELEN2  DS    H
PDEFLAG2 DS    X
         DS    X
PDEPTR3  DS    A
PDELEN3  DS    H
PDEFLAG3 DS    X
         DS    X
PDEL     EQU   *-PDE
         MEND
