         MACRO
         RLCT
*.
*        SYSTEMS RESOURCE MANAGERS LOGICAL CHANNEL TABLE
*
*        POINTED TO BY RMCT IN RMCTRLCT
*
*        ONE FOR EACH LOGICAL CHANNEL IN THE SYSTEM
*.
RLCT     DSECT
RLCTBIT  DS    F                   ENTRY ID BIT
RLCTUSR1 DS    A                   POINTER TO HEAVY CHANNEL USER
RLCTUSR2 DS    A                   POINTER TO HEAVY CHANNEL USER
RLCTUMWA DS    F                   WORK AREA USED BY SRM
RLCTURT1 DS    H                   LCH EXCP RATE FOR USER 1
RLCTURT2 DS    H                   LCH EXCP RATE FOR USER2
RLCTRQCT DS    H                   BASE LCH REQUEST COUNT
RLCTPDCT DS    H                   BASE LCH PATH DELAY COUNT
RLCTDDCT DS    H                   BASE LOGICAL DEVICE DELAY COUNT
RLCTUTIL DS    H                   RECENT LCH UTILIZATION FOR IOL
RLCTUTDA DS    H                   RECENT LCH UTILIZATION FOR
*                                  DEVICE ALLOCATION
RLCTRQRT DS    H                   LCH REQUEST RATE
RLCTRVUF DS    H                   LCH UTILIZATION FACTOR FOR
*                                  COMPUTING RECCOMENDATION VALUSE
RLCTFLGS DS    H                   RLCT FLAGS
RLCTOVER EQU   X'80'               LCH IS OVERUTILIZED
RLCTUNDR EQU   X'40'               LCH IS UNDERUTILIZED
RLCTDAIM EQU   X'20'               LCH UTILIZATION OVER DEVICE
*                                  ALLOCATION THRESHOLD
RLCTPAGE EQU   X'10'               PAGING DATA SPACE ON LCH
RLCTEND  EQU   *                   END OF RLCT
RLCTSIZE EQU   RLCTEND-RLCT
         MEND
