      *---------------------------------------------------------------
      *
      *  Created by XML2COB on 28 Feb 2005 at 12:46:08
      *
      *  More info on : http://sourceforge.net/projects/txt2xml-rexx/
      *
      *  Total COBOL record length : 48
      *
      *---------------------------------------------------------------

          02 XML-COBOL-ITEM-01.
             04 XML-COBOL-ITEM-02                 PICTURE X(5).
             04 XML-COBOL-ITEM-03                    OCCURS 4 TIMES.
                06 XML-COBOL-ITEM-05              PICTURE X(1).
                06 XML-COBOL-ITEM-06              PICTURE 9(1).
                06 XML-COBOL-ITEM-04              PICTURE X(3).
             04 XML-COBOL-ITEM-08                 PICTURE 9(2).
             04 XML-COBOL-ITEM-09                 PICTURE X(6).
             04 XML-COBOL-ITEM-12.
                06 XML-COBOL-ITEM-14              PICTURE X(15).

