//*   - - - - - - - - - - - - - - - - - - - - - - - - -
//*   THIS IS AN OLD VERSION OF THE CFMON FIX INCLUDED
//*   FOR ARCHIVAL PURPOSES ONLY......
//*   - - - - - - - - - - - - - - - - - - - - - - - - -
//*
//*   CORRECT ABEND S0C9 AT CFXCFTCF+F24/+F2A
//AMBL    EXEC PGM=AMASPZAP,PARM=IGNIDRFULL
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DSN=????.CFMON.LOAD
//SYSIN    DD  *
NAME CFXCFTCF CFXCFTCF
VER 000F20 1B66,1D6A              SR R6,R6  DR R6,R10
REP 000F20 47F0,37E0              B PATCH
VER 0017D8 0000,0000
VER 0017DC 0000,0000
VER 0017E0 0000,0000
VER 0017E4 0000,0000
VER 0017E8 0000,0000
VER 0017EC 0000,0000
VER 0017F0 0000,0000
VER 0017F4 0000,0000
REP 0017D8 5570,37F4              CL R7,=XL4'7FFFFFFF'
REP 0017DC 4740,37E4              BL NEXTCHECK
REP 0017E0 47F0,2F50              B  BACK NO DIVIDE
REP 0017E4 5570,3828              CL R7,=F'64'
REP 0017E8 4740,2F50              BL BACK NO DIVIDE
REP 0017EC 1B66,1D6A              ORIG INSTRS
REP 0017F0 47F0,2F26              B BACK+4
