//XKZS026U  JOB (SD,A,SPM000,DZK),'LC00026',
//         CLASS=M,MSGCLASS=T,
//         NOTIFY=XKZS
/*JOBPARM R=1318,K=60
//*
//* DOC  THIS JOB MAY BE USED TO INSTALL THE ISPTCM TABLE EXIT
//*       ROUTINE  'ISPTCM' . THE JOB CONSISTS OF TWO STEPS:
//*       * STEP 1 - ASSEMBLES 'ISPTCM'
//*       * STEP 2 - USES SMP TO INSTALL THE EXIT ROUTINE WITH PTF
//*         NUMBER LC00026.
//*
//*
//STEP01 EXEC PGM=PAN#1
//SYSPRINT DD SYSOUT=*
//PANDD1 DD DSN=WB.A.ASPPAN,DISP=SHR
//PANDD2 DD DISP=(,PASS),DSN=&&SRC(ISPTCM),UNIT=D,
//          SPACE=(CYL,(2,1,3)),DCB=(LRECL=80,RECFM=FB,BLKSIZE=9040)
//SYSIN DD *
++WRITE WORK,ISPTCMV1
//STEPA1   EXEC ASMHC,PARM.ASM='RENT'
//ASM.SYSLIB DD  DISP=SHR,DSN=SYS1.SMPMTS,UNIT=D,VOL=SER=NEWRES
//         DD  DISP=SHR,DSN=ISP.V2R3M0.ISPMACS,UNIT=D,VOL=SER=NEWRES
//         DD  DISP=SHR,DSN=SYS1.MACLIB,UNIT=D,VOL=SER=NEWRES
//         DD  DISP=SHR,DSN=SYS1.AMODGEN,UNIT=D,VOL=SER=SMPE80
//SYSPUNCH DD DISP=SHR,DSN=SYS1.OBJPDS01(ISPTCM),
//         UNIT=D,VOL=SER=NEWRES
//SYSIN    DD DISP=(OLD,PASS),DSN=&&SRC(ISPTCM)
//SMPE    EXEC PGM=GIMSMP,REGION=4096K,
//             COND=(0,NE)
//SMPCSI   DD  DISP=SHR,DSN=SMPE.WBIPO.GLOBAL.CSI
//SMPLOG   DD  DUMMY
//SMPLOGA  DD  DUMMY
//SYSPRINT DD  SYSOUT=*
//SMPCNTL  DD *
 SET BDY(GLOBAL) .
   REJECT  S(LC00026) BYPASS(APPCHK) .
   RESETRC .
   RECEIVE S(LC00026) SYSMODS .
 SET BDY(MVSTEST) .
   APPLY S(LC00026) REDO  BYPASS(HOLDUSER).
//SMPPTFIN DD  DATA,DLM=@@
++ USERMOD (LC00026)  /* ISPTCM COMMAND CHARACTERISTICS */ .
++ VER (Z038) FMID(HIF2302) .
++ MOD (ISPTCM) TXLIB(OBJPDS01) .
@@
