//AWCPAWA  JOB (AWC),PW,CLASS=M,MSGCLASS=X,REGION=7M,
//         NOTIFY=&SYSUID
//*
//* AWCPAW.CBT.FILE600.ASM.PDS(ASMOBJ)
//* JCL TO ASSEMBLE AND SAVE OBJECT FOR ASSEMBLER PROGRAMS
//*
//* CUSTOMISATION
//*   1) CHANGE ALL AWCPAW TO YOUR HLQ
//*   2) CHANGE SYS1 PREFIX OF IBM TARGET LIBRARIES TO YOUR OWN
//*   3) COMMENT IN/OUT MODULES WHICH YOU WISH TO ASSEMBLE
//*
//*
//ASMOBJ   PROC SRC='AWCPAW.CBT.FILE600.ASM.PDS',M=,
//          OBJ='AWCPAW.CBT.FILE600.OBJ.PDS'
//C        EXEC PGM=ASMA90,PARM='OBJECT,RENT,NODECK,LIST'
//SYSLIB   DD  DISP=SHR,DSN=SYS1.MACLIB
//         DD  DISP=SHR,DSN=SYS1.MODGEN
//         DD  DISP=SHR,DSN=SYS1.CEE.SCEEMAC
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(TRK,(15,15))
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DISP=SHR,DSN=&OBJ(&M)
//SYSPUNCH DD  DUMMY
//SYSIN    DD  DISP=SHR,DSN=&SRC(&M)
//         PEND
//*
//* ASM1 - ASSEMBLE EDCXFGS (C STORAGE FUNCTIONS)
//ASM1    EXEC ASMOBJ,M=EDCXFGS
//* ASM2 - ASSEMBLE MLWTO PROGRAM
//ASM2    EXEC ASMOBJ,M=MLWTO
//* ASM3 - ASSEMBLE SPRNTLL PROGRAM
//ASM3    EXEC ASMOBJ,M=SPRNTLL
//*
