//AWCPAWTT JOB (AWC),PW,CLASS=M,MSGCLASS=X,REGION=7M,
//         NOTIFY=&SYSUID
//*
//* AWCPAW.CBT.FILE600.ASM.PDS(FTPCTSTJ)
//* JCL TO RUN FTPCTST (FTP SMF EXIT TEST PROGRAM)
//*
//* CUSTOMISATION
//*   1) CHANGE ALL AWCPAW TO YOUR HLQ
//*   2) AMEND STEPLIB AS REQUIRED
//*   3) AMEND SMFDD AS REQUIRED TO A DATASET CONTAINING SMF TYPE
//*      118 AND/OR 119 RECORDS
//*   4) AMEND PARM TO REFLECT WHICH EXIT IS BEING TESTED
//*      (FTPC118/FTPC119/FTPSMFEX)
//*
//*  NOTE
//*   BE CAREFUL IF YOU HAVE AUTOMATION UTILISING THE WTOS FROM THE
//*   FTP SMF EXITS. THIS JOB WILL DRIVE THE SMF EXITS AND PRODUCE
//*   THE WTOS WHICH MAY CAUSE YOUR AUTOMATION TO BE DRIVEN IN A
//*   WAY NOT INTENDED.
//*
//* FTPCTST
//* - RUN FTPCTST PROGRAM AGAINST SMF 118/119 DATA
//*
//FTPCTST  EXEC PGM=FTPCTST,PARM=FTPC119
//*FTPCTST  EXEC PGM=FTPCTST,PARM=FTPC118
//*FTPCTST  EXEC PGM=FTPCTST,PARM=FTPSMFEX
//STEPLIB  DD  DISP=SHR,DSN=AWCPAW.CBT.FILE600.LOAD
//SMFDD    DD  DISP=SHR,DSN=AWCPAW.CBT.FILE600.SMF119
//*SMFDD    DD  DISP=SHR,DSN=AWCPAW.CBT.FILE600.SMF118
//SYSUDUMP DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
