//* ********************************************************
//* *  INSTALL THE 'LISTCTLG'  PROGRAM                     *
//* *  NOTE: ONLY FOR OLD CVOL CATALOGS                    *
//* ********************************************************
//LISTCTLG EXEC ASMHCL,
//         PARM.ASM='OBJECT,NODECK,TERM,ALIGN,NOLIST',
//         PARM.LKED='LIST,MAP'
//SYSTERM  DD SYSOUT=*
//SYSIN    DD DSN=SHARE.SOURCE(LISTCTLG),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.SHARE.LOAD,UNIT=,DISP=SHR,SPACE=
//LKED.SYSIN DD *
 NAME LISTCTLG(R)
/*
