*          DATA SET ADPSEEKMON AT LEVEL 016 AS OF 03/26/82
SEEKMON TITLE '         U. S. SEC - DASD SEEK ACTIVITY MONITOR'         00001
*---------------------------------------------------------------------- 00002
*   SEEKMON -- U. S. SEC DASD-SEEK ACTIVITY MONITOR                     00003
*---------------------------------------------------------------------- 00004
*                                                                       00005
* STATUS --                                                             00006
*   UPDATED 07JUL76, GENE CZARCINSKI, NASA/GSFC, CODE 531.              00007
*   1.0 ... SEEKMON DEVELOPMENT AT NASA/GSFC ...                        00008
*   2.0 ... SEEKMON CHANGED AT U.S. SEC TO RUN ON OS/VS2 MVS SE2        00009
*       ... 23FEB81, ROBERT V HANSEN, U.S. SEC (202) 272-3144           00010*16
*   2.1 ... 25MAR82, CODE ADDED TO SUPPORT 3375 AND 3380 ALSO TO        00011
*           PRINT CYL ADDRESSES IN HEX INSTEAD OF DECIMAL.              00012
*           OUR DISK MAP PGM PRINTS CYL ADDRESSES IN HEX.               00013
*                                                                       00014*16
*           SEEKMON HAS BEEN TESTED ON THE FOLLOWING CONFIGURATION      00015*16
*           SOFTWARE  MVS SE2 AND SP1                                   00016*16
*           HARDWARE  3330,3330-1,3350                                  00017*16
*                                                                       00018*16
*                                                                       00019*16
*                                                                       00020
* THIS PROGRAM IS BASED ON THE 'SEEKMON' PROGRAM .. SOURCE UNKNOWN.     00021
*                                                                       00022
* THIS CODE IS NOT REENTRANT OR REUSABLE.  IT HAS BEEN                  00023
* DESIGNED TO RUN AS A SYSTEM-JOB OR SYSTEM TASK.   IT PUTS             00024
* NO HOOKS IN THE SYSTEM.  ALL DATA IS GATHERED ON A SAMPLED            00025
* BASIS.  THE REPORT PORTION OF THIS PROGRAM IS BASED ON THE            00026
* PROCTER & GAMBLE 'TSOPAP' PROGRAM.  THIS PROGRAM IS NOT DEPENDANT     00027
* ON ANY SYSTEM MODIFICATION.                                           00028
*                                                                       00029
*                                                                       00030
* THE JCL NECESSARY TO RUN THIS PROGRAM IS ...                          00031
*      //SEEKMON EXEC PGM=SEEKMON,DPRTY=(15,15)                         00032
*      //STEPLIB  DD DISP=SHR,DSN= (LIB CONTAINING THE LOAD MODULE)     00033
*      //SYSPRINT DD SYSOUT=A                                           00034
*      //SYSUDUMP DD SYSOUT=A                                           00035
*                                                                       00036
* IN GENEERAL, SPECIFY A STEP REGION SIZE THAT IS LARGE ENOUGH          00037
* FOR THE MONITOR PROGRAM PLUS ABOUT 3K FOR EACH LIGHT ACTIVITY         00038
* DEVICE AND ABOUT 10K-12K FOR EACH HIGH ACTIVITY DEVICE.  IF           00039
* YOU ALLOW TOO LITTLE CORE, THE MONITOR WILL LOSE SOME DATA            00040
* BUT WILL INFORM YOU OF THE FACT.  THE MINIMUM SIZE FOR THE            00041
* MONITOR IS ABOUT 30K.                                                 00042
*                                                                       00043
* THE RUN PARAMETERS CAN BE DEFAULTED, SPECIFIED BY PARM= ON THE        00044
* EXEC STATEMENT OR BY USING THE STARTED-TASK PARM SPECIFICATION        00045
* (S  SEEKMON,,,$$$$$$$).   ALL PARM VALUES MUST BE NUMERIC.  IF        00046
* AN 'X' IS SPECIFIED THE THE HIGHER-ORDER VALUE IS USED.  THE ORDER    00047
* OF PARM MERGE IS .. DEFAULT/EXEC-PARM/STARTED-TASK-PARM               00048
*                                                                       00049
* FOR MVS THE FOLLOWING CHANGES WERE MADE:                              00050
*     1.  APF AUTHORIZATION IS REQUIRED TO ELIMINATE 0C4S AT TIMES      00051
*     2.  THE LAST SEEK ADDRESS IS OBTAINED FROM THE                    00052
*         IOSB<--IOQ<--UCB                                              00053
*                                                                       00054
*                                                                       00055
* THE PARM FIELD IS DEFINED AS FOLLOWS ...                              00056
*      MMMSSS,LL,FFF,...                                                00057
*         MMM= SAMPLING PERIOD IN MINUTES                               00058
*         SSS= SAMPLING INTERVAL IN 100THS OF SECONDS                   00059
*          LL= SYSPRINT LINE COUNT                                      00060
*         FFF= OPTION SWITCHES (DECIMAL COUNT 0-255)                    00061
*         DDD= DEVICE LIST                                              00062
*              THE DEVICE LIST IS OF THE FORM "230,231" OR              00063
*              "230-9" FOR 230 THRU 239                                 00064
*              NOTE YOU MAY ALSO USE "230-F,330,332" OR                 00065
*                                    "230-F,330-F"                      00066
*---------------------------------------------------------------------- 00067
  EJECT ,                                                               00068
         MACRO                                                          00069
&L       TABDEF &A                                                      00070
&L       DSECT ,                                                        00071
&L.A     DS    F              SUM                                       00072
&L.B     DS    F              TOTAL COUNT OF ENTRIES                    00073
&L.D     DS    F              MINIMUM VALUE                             00074
&L.E     DS    F              MAXIMUM VALUE                             00075
&L.C     DS    &A.F           ENTRY COUNTERS                            00076
&L.L     EQU   *-&L           LENGTH OF TABLE                           00077
         MEND                                                           00078
*                                                                       00079
         MACRO                                                          00080
&L       PRTUPD &A,&B                                                   00081
&L       MVI   SPACE,C&A                                                00082
         LA    R1,&B                                                    00083
         B     PUT                                                      00084
         MEND                                                           00085
*                                                                       00086
         MACRO                                                          00087
&A       TESTVAL &B                                                     00088
&A       L     W1,$TABB-$TAB(,W0)   GET TOTAL COUNTS                    00089
         LTR   W1,W1                WERE THERE ANY?                     00090
         BZ    &B                   NO, SKIP THIS PLOT                  00091
         MEND                                                           00092
*                                                                       00093
         MACRO                                                          00094
&L       DASHES &BR=,&CHAR=-                                            00095
&L       MVI   LINE,C'&CHAR'                                            00096
         MVC   LINE+1(L'LINE-1),LINE                                    00097
         BAL   LINK,&BR                                                 00098
         MEND                                                           00099
*                                                                       00100
         MACRO                                                          00101
&L       PRT2  &A,&B,&C                                                 00102
&L       L     W1,&A                                                    00103
         BAL   LINK,TODCNVTA                                            00104
         MVC   LINE+&B.(14),=CL14&C                                     00105
         MVC   LINE+&B.+15(8),TOD                                       00106
         MEND  ,                                                        00107
*                                                                       00108
         MACRO                                                          00109
&L       INC   &A,&B                                                    00110
&L       L     &A,&B                                                    00111
         LA    &A,1(,&A)                                                00112
         ST    &A,&B                                                    00113
         MEND  ,                                                        00114
*                                                                       00115
         MACRO                                                          00116
&L       PERCENT &A,&B,&C,&D,&E                                         00117
&L       XR    R0,R0                                                    00118
         L     R1,&A                                                    00119
         M     R0,=F'100'    FOR PERCENT                                00120
         D     R0,&B                                                    00121
         CVD   R1,WORK                                                  00122
         ED    &C.(4,R14),WORK+6                                        00123
         MEND  ,                                                        00124
*                                                                       00125
         MACRO                                                          00126
&L       DISTRIB &A,&B,&C                                               00127
&L       L     R1,&A                                                    00128
         L     R15,DEVTBLPT                                             00129
         LTR   R15,R15   TEST IF TABLE DEFINED                          00130
         BZ    A&SYSNDX  NO.                                            00131
         LA    R15,&B.*$TABL(,R15)                                      00132
         BAL   LINK,DISTRIB                                             00133
A&SYSNDX EQU   *                                                        00134
         MEND                                                           00135
*                                                                       00136
         MACRO                                                          00137
&L       COUNT &A,&B,&C,&R1=R1,&BR=*+6                                  00138
&L       TM    &A,&B                                                    00139
         BNO   &BR                                                      00140
         ALR   &C,&R1                                                   00141
         MEND  ,                                                        00142
*                                                                       00143
         MACRO                                                          00144
&L       TESTBL &A,&B,&C,&D,&E                                          00145
&L       CLI   &A,C' '                                                  00146
         BNE   &D                                                       00147
         CLI   &B,C' '                                                  00148
         BNE   &D                                                       00149
         CLI   &C,C' '                                                  00150
         BE    &E                                                       00151
         MEND  ,                                                        00152
*                                                                       00153
         MACRO                                                          00154
&L       REPORTC &A                                                     00155
&L       LA    R14,&A                                                   00156
         BAL   LINK,REPORTC                                             00157
         MEND  ,                                                        00158
*                                                                       00159
         MACRO                                                          00160
&L       REPORTD &A,&B                                                  00161
&L       LM    W3,W7,&A                                                 00162
         LA    R14,&B                                                   00163
         BAL   LINK,REPORTD                                             00164
         STM   W3,W7,&A                                                 00165
         MEND  ,                                                        00166
*                                                                       00167
         MACRO                                                          00168
&L       REPORTF &A,&B                                                  00169
&L       L     W6,&A                                                    00170
         LA    R14,&B                                                   00171
         BAL   LINK,REPORTF                                             00172
         MEND  ,                                                        00173
*                                                                       00174
 EJECT ,                                                                00175
SEEKMON  START 0                                                        00176
R0       EQU   0                                                        00177
R1       EQU   1                                                        00178
R2       EQU   2                                                        00179
R3       EQU   3                                                        00180
R4       EQU   4                                                        00181
R5       EQU   5                                                        00182
R6       EQU   6                                                        00183
R7       EQU   7                                                        00184
R8       EQU   8                                                        00185
R9       EQU   9                                                        00186
R10      EQU   10                                                       00187
R11      EQU   11                                                       00188
R12      EQU   12                                                       00189
R13      EQU   13                                                       00190
R14      EQU   14                                                       00191
R15      EQU   15                                                       00192
BASE1    EQU   R12                                                      00193
BASE2    EQU   R11                                                      00194
LINK     EQU   R10                                                      00195
W0       EQU   R2                                                       00196
W1       EQU   R3                                                       00197
W2       EQU   R4                                                       00198
W3       EQU   R5                                                       00199
W4       EQU   R6                                                       00200
W5       EQU   R7                                                       00201
W6       EQU   R8                                                       00202
W7       EQU   R9                                                       00203
*---------------------------------------------------------------------- 00204
$TAB     TABDEF 40        REFERENCE TABLE DEFINITION                    00205
*                                                                       00206
DEVICE   DSECT ,      *   DEVICE (UCB) TABLE DEFINITION *               00207
DCUU     DC    H'0'    HEX ADDR (RIGHT JUSTIFIED)                       00208
DLASTCC  DC    H'0'    LAST HIT ON THIS DEVICE                          00209
DEVDIST  DC    A(0)    ADDR OF CYL/TRK DISTRIB TABLE                    00210
CYLENTRY DC    F'0'    POINTER TO FIRST DATA ENTRY                      00211
UCBADDR  DC    Y(0)    ADDR OF UCB FOR THIS DEVICE                      00212
DEVLOST  DC    H'0'    COUNT OF LOST ENTRIES FOR THIS DEVICE            00213
DEVTBLPT DC    A(0)    POINTER TO ALLOC. TABLES                         00214
DEVONLN  DC    F'0'    COUNT OF DEVICE-ONLINE HITS                      00215
DEVNOTRD DC    F'0'    DEVICE NOT-READY HITS                            00216
DEVALLOC DC    F'0'    DEVICE ALLOCATED HITS                            00217
DEVRES   DC    F'0'    DEVICE RESERVED HITS                             00218
DEVERR   DC    F'0'    ERROR RECOVERY ACTIVE HITS                       00219
DEVNOTRC DC    F'0'    CONTROL UNIT BUSY HITS                           00220
DEVBUSY  DC    F'0'    DEVICE BUSY HITS                                 00221
DEVXFER  DC    F'0'    DATA TRANSFER ACTIVE                             00222
DEVSASEK DC    F'0'    S-A SEEK ACTIVE                                  00223
DEVALT   DC    F'0'    ALT PATH IN USE                                  00224
DEVICEL  EQU   *-DEVICE    LENGTH OF THE TABLE                          00225
*                                                                       00226
*---------------------------------------------------------------------- 00227
*---------------------------------------------------------------------- 00228
         EJECT                                                          00229
SEEKMON  CSECT ,                                                        00230
         ENTRY VERSION,PARMDFLT                                         00231
         SAVE  (14,12),,*                                               00232
         LR    BASE1,R15                   INIT THE BASE REGS           00233
         LA    BASE2,2048                                               00234
         LA    BASE2,2048(BASE1,BASE2)                                  00235
         USING SEEKMON,BASE1,BASE2                                      00236
         B     START                                                    00237
*                                                                       00238
VERSION  DC    C'U. S. SEC SEEKMON 2.1 - DASD ACTIVITY MONITOR - '      00239
VERSION1 DC    C'DDD',C' '                                              00240
VERSION2 DC    C'DDMMMYY',C' '                                          00241
VERSION3 DC    C'(',X'21204B202020',C')'                                00242
VERSION4 DC    X'4021204B20204B2020'                                    00243
VERSIONL EQU   *-VERSION                                                00244
*                MMMSSS,LL,FFF,...                                      00245
PARMDFLT DC    CL120' '                                                 00246
         ORG   PARMDFLT                                                 00247
PARM1    DC    C'005'             SAMPLING PERIOD IN MINUTES            00248
PARM2    DC    C'005',C','        SAMPLING INTERVAL IN 100THS OF SEC    00249
PARM3    DC    C'65',C','         SYSPRINT LINES/PAGE                   00250
PARM4    DC    C'000'             DECIMAL NUMBER FOR 'OPTIONS'          00251
PARM5    DC    C','               SEPARATOR                             00252
PARM6    EQU   *                  DEVICE ADDRESSES                      00253
         ORG   ,                                                        00254
OPTIONS  DC    X'00'                                                    00255
OPT128   EQU   128   TERMINATE WITH A DUMP (FOR DEBUG)                  00256
OPT64    EQU   64                                                       00257
OPT32    EQU   32                                                       00258
OPT16    EQU   16                                                       00259
OPT8     EQU   8                                                        00260
OPT4     EQU   4                                                        00261
OPT2     EQU   2      DO *NOT* USE SUBTASK FOR TIMING (FOR MFT)         00262
OPT1     EQU   1      PERFORM ARM-MOVEMENT PROCESSING                   00263
*                                                                       00264
SAVESYS  DC    18F'0'                                                   00265
START    LA    R15,SAVESYS                                              00266
         ST    R15,8(R13)                                               00267
         ST    R13,4(R15)      SAVE CHAINS                              00268
         LR    R13,R15         NEW SAVE AREA                            00269
         L     W0,0(,R1)       SAVE/LOAD PARM LIST POINTER              00270
         OPEN  (SYSPRINT,OUTPUT)            INIT THE OUTPUT FILE        00271
         TM    SYSPRINT+DCBOFLGS-IHADCB,X'10' CHECK THE OPEN            00272
         BZ    OPENERR                                                  00273
         TIME  DEC                                                      00274
         ST    R0,WORK                                                  00275
         ED    VERSION4,WORK                                            00276
         XR    R0,R0                                                    00277
         STM   R0,R1,WORK                                               00278
         ED    VERSION3(7),WORK+5                                       00279
         MVC   VERSION2+5(2),VERSION3+1                                 00280
         CVB   R1,WORK                                                  00281
         D     R0,=F'1000'                                              00282
         BCTR  R1,0                                                     00283
         LR    R15,R1                                                   00284
         SRL   R15,2                                                    00285
         N     R1,=F'3'                                                 00286
         MH    R15,=H'5'                                                00287
         AR    R15,R1                                                   00288
         AR    R15,R0                                                   00289
         XR    R14,R14                                                  00290
         D     R14,=F'7'                                                00291
         MH    R14,=H'3'                                                00292
         LA    R14,DAYTAB(R14)                                          00293
         MVC   VERSION1,0(R14)                                          00294
         IC    R1,FEBTAB(R1)                                            00295
         STC   R1,FEB+1                                                 00296
         LA    R1,MONTAB-6                                              00297
DATELOOP LA    R1,6(,R1)                                                00298
         SH    R0,0(,R1)                                                00299
         BH    DATELOOP                                                 00300
         AH    R0,0(,R1)                                                00301
         CVD   R0,WORK                                                  00302
         OI    WORK+7,X'F'                                              00303
         UNPK  VERSION2(2),WORK                                         00304
         MVC   VERSION2+2(3),2(R1)                                      00305
         MVC   TITLE+30(VERSIONL),VERSION                               00306
         DASHES BR=PUTSK1                                               00307
*   MERGE IN THE EXEC PARM                                              00308
         LH    W1,0(,W0)                                                00309
         LA    W2,2(,W0)                                                00310
         LTR   W1,W1                                                    00311
         BZ    INITCIB                                                  00312
INITEXEC BAL   LINK,SCAN                                                00313
*   INIT CIB PROCESSING                                                 00314
INITCIB  EXTRACT ACSCBCIB,FIELDS=COMM                                   00315
         L     R1,ACSCBCIB                                              00316
         MVC   ACSCBECB,0(R1)                                           00317
         L     W5,4(,R1)                                                00318
         LTR   W5,W5                                                    00319
         BZ    TESTPARM            NOT STARTED TASK                     00320
         USING CIB,W5                                                   00321
         LH    W1,CIBDATLN                                              00322
         LA    W2,CIBDATA                                               00323
         DROP  W5                                                       00324
         LTR   W1,W1                                                    00325
         BZ    INITCIBZ                                                 00326
         BAL   LINK,SCAN                                                00327
INITCIBZ L     W5,ACSCBCIB                                              00328
         LA    W5,4(,W5)                                                00329
         QEDIT ORIGIN=(W5)                                              00330
         QEDIT ORIGIN=(W5),CIBCTR=1                                     00331
TESTPARM LA    W1,PARM5-PARM1                                           00332
         LA    W2,PARMDFLT                                              00333
PARMTEST CLI   0(W2),C'0'                                               00334
         BNL   *+12                                                     00335
         CLI   0(W2),C','                                               00336
         BNE   BADPARM                                                  00337
         LA    W2,1(,W2)                                                00338
         BCT   W1,PARMTEST                                              00339
LISTPARM MVC   LINE(10),=CL10'RUN PARM -'                               00340
         BAL   LINK,PUTSP2                                              00341
         MVC   LINE+5(L'PARMDFLT),PARMDFLT                              00342
         BAL   LINK,PUTSP1                                              00343
*   PROCESS THE RUN PARMS                                               00344
         PACK  WORK,PARM1                                               00345
         CVB   R1,WORK                                                  00346
         MH    R1,=H'6000'         CONVERT MIN. TO 100THS OF SEC        00347
         ST    R1,PERIOD                                                00348
         PACK  WORK,PARM2                                               00349
         CVB   R1,WORK                                                  00350
         LTR   R1,R1                                                    00351
         BNZ   *+8                                                      00352
         LA    R1,1            DO NOT PERMIT ZERO                       00353
         ST    R1,SECONDS                                               00354
         PACK  WORK,PARM3                                               00355
         CVB   R1,WORK                                                  00356
         STH   R1,LINEMAX                                               00357
         PACK  WORK,PARM4                                               00358
         CVB   R1,WORK                                                  00359
         STC   R1,OPTIONS                                               00360
         L     R1,CVTPTR                                                00361
         TM    CVTDCB-CVT(R1),CVT2SPS                                   00362
         BZ    *+8                                                      00363
         OI    OPTIONS,OPT2  IF MFT, FORCE NO ATTACH                    00364
*                                                                       00365
*                                                                       00366
         BAL   LINK,PUTSP2                                              00367
*---------------------------------------------------------------------- 00368
*   ALLOCATE THE CORE FOR THE WORKAREAS                                 00369
         GETMAIN VU,LA=$SIZE,A=GOTTENA                                  00370
         L     R1,GOTTENA                                               00371
         L     W0,GOTTENL                                               00372
         SH    W0,=Y(4096)      RETURN SOME CORE TO OS                  00373
         ST    W0,GOTTENL                                               00374
         LA    R1,0(W0,R1)                                              00375
         FREEMAIN R,LV=4096,A=(1)                                       00376
*    CLEAR THE GETMAINED AREA                                           00377
*         L     R1,GOTTENA                                              00378
*         L     W0,GOTTENL                                              00379
*CLEARA   CH    W0,=H'256'                                              00380
*         BNH   CLEARB                                                  00381
*         XC    0(256,R1),0(R1)                                         00382
*         SH    W0,=H'256'                                              00383
*         LA    R1,256(,R1)                                             00384
*         B     CLEARA                                                  00385
*CLEARB   BCTR  W0,0                                                    00386
*         EX    W0,ZEROCORE                                             00387
*---------------------------------------------------------------------- 00388
*   INITIALIZE THE TABLES                                               00389
         L     R1,GOTTENA                                               00390
         ST    R1,NEXTFREE                                              00391
         A     R1,GOTTENL                                               00392
         ST    R1,TOPCORE                                               00393
         USING DEVICE,W1                                                00394
         L     W1,=A(DEVTBL)                                            00395
         LA    W4,PARM6                                                 00396
         LA    W5,L'PARMDFLT-(PARM6-PARM1)                              00397
INITDEV1 BAL   LINK,FNDUNIT                                             00398
         B     INITDEV9                                                 00399
         L     W0,CVTPTR                                                00400
         L     W0,CVTILK2-CVT(,W0)                                      00401
INITDEV2 LH    W6,0(,W0)                                                00402
         LTR   W6,W6                                                    00403
         BM    INITDEV8                                                 00404
         BNZ   INITDEV4                                                 00405
INITDEV3 LA    W0,2(,W0)                                                00406
         B     INITDEV2                                                 00407
         USING UCB,W6                                                   00408
INITDEV4 CLC   UCBNAME,UNITNAME                                         00409
         BNE   INITDEV3                                                 00410
         CLI   UCBTYP+2,X'20'  TEST FOR DASD                            00411
         BNE   INITDEV3                                                 00412
         STH   W6,UCBADDR                                               00413
         MVC   DCUU,UCBCHA                                              00414
         IC    R1,UCBNAME                                               00415
         N     R1,=F'15'                                                00416
         STC   R1,DCUU     PRIME CHAN. ID                               00417
*        MVC   DLASTCC,UCBSKA+3    INIT THE SEEK VALUE                  00418
         XC    DLASTCC,DLASTCC     INIT THE SEEK VALUE                  00419
         L     R1,NEXTFREE                                              00420
         LR    R15,R1                                                   00421
         A     R1,=A(5*$TABL)                                           00422
         C     R1,TOPCORE                                               00423
         BNL   NOCORE                                                   00424
         ST    R1,NEXTFREE                                              00425
         ST    R15,DEVTBLPT                                             00426
         IC    R1,UCBTBYT4                                              00427
         N     R1,=F'15'                                                00428
         BCTR  R1,0                                                     00429
         SLL   R1,2           MPY BY 4                                  00430
         LA    R1,DEVDISTA(R1)                                          00431
         L     R0,0(,R1)                                                00432
         ST    R0,DEVDIST                                               00433
         USING $TAB,R15                                                 00434
         L     R1,=A(HIVALUE)                                           00435
         LA    R0,5                                                     00436
INITDEV5 ST    R1,$TABD                                                 00437
         LA    R15,$TABL(,R15)                                          00438
         BCT   R0,INITDEV5                                              00439
         DROP  R15                                                      00440
INITDEV6 EQU   *                                                        00441
         MVC   LINE+5(3),UCBNAME     LIST THE DEVICE                    00442
         MVC   LINE+10(6),UCBVOLI                                       00443
         BAL   LINK,PUTSP1                                              00444
         LA    W1,DEVICEL(,W1)    UPDATE TABLE POINTER                  00445
         C     W1,LASTDEV         END OF TABLE?                         00446
         BNH   INITDEV1           NO, CONTINUE                          00447
         B     INITDEV9           YES, NOT MORE SPACE                   00448
INITDEV8 MVC   LINE+5(3),UNITNAME                                       00449
         MVC   LINE+10(9),=CL9'NOT FOUND'                               00450
         BAL   LINK,PUTSP1                                              00451
         B     INITDEV1                                                 00452
INITDEV9 C     W1,=A(DEVTBL)    ANY USED .. NO=ERROR                    00453
         BE    BADPARM                                                  00454
         ST     W1,LASTDEV                                              00455
         DROP  W1,W6                                                    00456
*---------------------------------------------------------------------- 00457
         DASHES BR=PUTSP2                                               00458
         MVC   INITWTO+8+34(3),PARM1                                    00459
INITWTO  WTO   'SEEKMON: SAMPLING STARTED, PERIOD=XXX **',             +00460
               ROUTCDE=(1,11)                                           00461
         TIME  BIN                                                      00462
         MODESET KEY=ZERO                                               00463
         ST    R0,SAMPLET                                               00464
         ST    R0,BGNTME                                                00465
         TM    OPTIONS,OPT2    TEST IF ATTACH USED                      00466
         BO    GATHER          NO, SKIP IT                              00467
         L     R1,=A(TIMRTASK)                                          00468
         IDENTIFY EPLOC=TIMRNAME,ENTRY=(1)                              00469
         ATTACH   EPLOC=TIMRNAME,ECB=TIMRECB                            00470
         ST    R1,TIMRTCB                                               00471
  EJECT ,                                                               00472
*---------------------------------------------------------------------- 00473
*   GATHER THE DATA THROUGH SAMPLING                                    00474
GATHER   DC    0H'0'                                                    00475
         L     W1,=A(DEVTBL)   SETUP TO SCAN DEVICES                    00476
         USING DEVICE,W1                                                00477
GATHER1  LH    W0,UCBADDR                                               00478
         USING UCB,W0                                                   00479
         IC    R0,UCBFL1        MOVE DATA TO WORKAREA                   00480
         STC   R0,GATHDATA                                              00481
         IC    R0,UCBSTAT                                               00482
         STC   R0,GATHDATA+1                                            00483
         IC    R0,UCBSQC                                                00484
         STC   R0,GATHDATA+3                                            00485
         TM    GATHDATA,UCBACTV    IS THE UCB ACTIVE            MVS     00486
         BNO   GATHER11            NO - SKIP SEEK INFO          MVS     00487
         LR    R1,W0               GET UCB ADDRESS              MVS     00488
         S     R1,=F'4'            UCB-4                        MVS     00489
         ICM   R1,15,0(R1)         GET IOQ ADDRESS              MVS     00490
         BZ    GATHER11            BR IF NO IOQ                 MVS     00491
         ICM   R1,15,8(R1)         GET IOSB ADDRESS             MVS     00492
         BZ    GATHER11            BR IF NO IOSB                MVS     00493
         MVC   THISCC,103(R1)      PUT IN THE SEEK ADDRESS      MVS     00494
GATHER11 LA    R1,1                                                     00495
         LM    W2,W7,DEVONLN     LOAD THE COUNTERS                      00496
         COUNT GATHDATA+1,UCBONLI,W2,BR=GATHER21                        00497
         COUNT GATHDATA,UCBNOTRD,W3                                     00498
         COUNT GATHDATA+1,UCBALOC,W4                                    00499
         TM    GATHDATA+3,X'FF'                                         00500
         BZ    *+6                                                      00501
         ALR   W5,R1                                                    00502
         COUNT GATHDATA,UCBQISCE,W6                                     00503
         COUNT GATHDATA,UCBNOTRC,W7                                     00504
         STM   W2,W7,DEVONLN                                            00505
         IC    R0,UCBDMCT                                               00506
         N     R0,=A(UCBDMC)                                            00507
         DISTRIB =A(DISTCNT),3                                          00508
         IC    R0,UCBUSER                                               00509
         DISTRIB =A(DISTCNT),4                                          00510
         TM    GATHDATA,UCBNOTRD    SKIP IF UNIT NOT READY              00511
         BO    GATHER21                                                 00512
         TM    GATHDATA,UCBNOTRC+UCBBUSYD  CU OR DEV BUSY?              00513
         BZ    GATHER14                    NO                           00514
         LH    R0,GATHDATA+2               YES, RECORD RESERVES         00515
         DISTRIB =A(DISTCNT),2                                          00516
GATHER14 TM    GATHDATA,UCBNOTRC                                        00517
         BO    GATHER21                                                 00518
         LM    W2,W5,DEVBUSY                                            00519
         LA    R1,1                                                     00520
GATHER16 COUNT GATHDATA,UCBBUSYD,W2,BR=GATHER21                         00521
         COUNT GATHDATA,UCBBSY+UCBPST+UCBACTV,W3                        00522
         IC    R15,UCBCHA      COUNT ALT. CHAN USAGE                    00523
         STC   R15,GATHER17+1                                           00524
         NI    GATHER17+1,X'0F'                                         00525
GATHER17 CLI   DCUU,0                                                   00526
         BE    *+6                                                      00527
         ALR   W5,R1                                                    00528
         TM    GATHDATA,UCBPSNS                                         00529
         BO    GATHER19                                                 00530
         TM    GATHDATA,X'04'                                           00531
         BZ    GATHER19                                                 00532
         TM    GATHDATA,X'02'                                           00533
         BNO   GATHER18    NOT SEEK, MAYBE XFER ON DRUM                 00534
         ALR   W4,R1       SEEK                                         00535
         LH    R0,THISCC    FOR S-A SEEK HISTOGRAM                      00536
         DISTRIB DEVDIST,1                                              00537
         B     GATHER19                                                 00538
GATHER18 ALR   W3,R1    COUNT AS XFER                                   00539
GATHER19 STM   W2,W5,DEVBUSY                                            00540
         LH    R0,THISCC     PLOT POSITION WHEN BUSY                    00541
         DISTRIB DEVDIST,0                                              00542
         CLI   UCBTBYT4,X'06'                                           00543
         BH    GATHER3                                                  00544
         DROP  W0                                                       00545
*                                                                       00546
GATHER21 LA    W1,DEVICEL(,W1)                                          00547
         C     W1,LASTDEV                                               00548
         BNH   GATHER1                                                  00549
         B     MAINT                                                    00550
GATHER3  MVC   LASTCC,DLASTCC   LAST SEEK OF THIS DEVICE                00551
         MVC   DLASTCC,THISCC   UPDATE FOR NEXT PASS                    00552
         TM    OPTIONS,OPT1     SUPPRESS?                               00553
         BZ    GATHER21         YES.                                    00554
         LR    W4,W1     SET FOR START SCAN                             00555
GATHER4  LR    W5,W4     A(PREVIOUS BLOCK)                              00556
         L     W4,8(,W5) A(NEXT BLOCK)                                  00557
         LTR   W4,W4     IS THERE ANY?                                  00558
         BZ    GATHER51  NO, JUST ADD AN ENTRY                          00559
         CLC   LASTCC,0(W4) IS BLOCK SEEK THIS SEEK?                    00560
         BL    GATHER53                                                 00561
         BH    GATHER4                                                  00562
         CLC   THISCC,2(W4) IS THE 'TO' CYL THE SAME TOO?               00563
         BL    GATHER53                                                 00564
         BE    GATHER50                                                 00565
         B     GATHER4                                                  00566
GATHER50 INC   R1,4(,W4)                                                00567
         B     GATHER21                                                 00568
GATHER51 L     R1,NEXTFREE                                              00569
         LR    W0,R1          SAVE THE POINTER                          00570
         LA    R1,12(,R1)                                               00571
         C     R1,TOPCORE                                               00572
         BNL   GATHER60       NO MORE SPACE                             00573
         ST    R1,NEXTFREE                                              00574
         ST    W0,8(,W5)    LINK THE ENTRY BLOCKS                       00575
         MVC   0(2,W0),LASTCC                                           00576
         MVC   2(2,W0),THISCC                                           00577
         LA    R1,1                                                     00578
         ST    R1,4(,W0)                                                00579
         XC    8(4,W0),8(W0)                                            00580
         B     GATHER21                                                 00581
GATHER53 L     R1,NEXTFREE     INSERT A ENTRY BLOCK                     00582
         LR    W0,R1           SAVE THE POINTER                         00583
         LA    R1,12(,R1)                                               00584
         C     R1,TOPCORE                                               00585
         BNL   GATHER60      NO MORE SPACE                              00586
         ST    R1,NEXTFREE                                              00587
         MVC   0(2,W0),LASTCC                                           00588
         MVC   2(2,W0),THISCC                                           00589
         LA    R0,1                                                     00590
         ST    R0,4(,W0)                                                00591
         L     R0,8(,W5)      LINK THE NEW BLOCK IN                     00592
         ST    R0,8(,W0)                                                00593
         ST    W0,8(,W5)                                                00594
         B     GATHER21                                                 00595
*   OUT OF SPACE                                                        00596
GATHER60 OI    FLAGS,GFAIL                                              00597
         INC   R1,LOSTDATA                                              00598
         LH    R1,DEVLOST                                               00599
         LA    R1,1(,R1)                                                00600
         STH   R1,DEVLOST                                               00601
         B     GATHER21                                                 00602
         DROP  W1                                                       00603
*                                                                       00604
MAINT    STIMER WAIT,BINTVL=SECONDS                                     00605
         L     R1,SAMPLES                                               00606
         LA    R1,1(,R1)                                                00607
         ST    R1,SAMPLES                                               00608
MAINU    L     R1,ACSCBECB                                              00609
         TM    0(R1),X'50'                                              00610
         BO    MAINZ          OPER-STOP WAS ISSUED                      00611
         TM    TIMRECB,X'40'                                            00612
         BO    MAINZ                                                    00613
MAINV    L     R1,CURRENT                                               00614
         A     R1,SECONDS                                               00615
         ST    R1,CURRENT                                               00616
         C     R1,PERIOD                                                00617
         BL    GATHER                                                   00618
MAINZ    MODESET KEY=NZERO                                              00619
         WTO   'SEEKMON: SAMPLING TERMINATED **',ROUTCDE=(1,11)         00620
         TIME  BIN                                                      00621
         ST    R0,ENDTME                                                00622
         S     R0,SAMPLET                                               00623
         ST    R0,SAMPLET                                               00624
         TM    OPTIONS,OPT2                                             00625
         BO    REPORT           ATTACH NOT USED                         00626
         TM    TIMRECB,X'40'                                            00627
         BO    MAINZ1           TASK ALREADY TERMINATED                 00628
         POST  TIMRECB2                                                 00629
         WAIT  1,ECB=TIMRECB    WAIT FOR TASK TO TERMINATE              00630
MAINZ1   DETACH TIMRTCB         REMOVE THE TASK                         00631
         B     REPORT                                                   00632
         EJECT                                                          00633
*---------------------------------------------------------------------- 00634
*  SUBROUTINES TO PRINT LINES WITH SELECTED CARRIAGE CONTROL.           00635
*        INPUT - 'LINE' SHOULD CONTAIN DESIRED PRINT DATA.              00636
*---------------------------------------------------------------------- 00637
PUTSP1   PRTUPD ' ',1        SPACE 1 LINE BEFORE PRINTING               00638
PUTSP2   PRTUPD '0',2        SPACE 2 LINES BEFORE PRINTING              00639
PUTSP3   PRTUPD '-',3        SPACE 3 LINES BEFORE PRINTING              00640
PUTSK1   PRTUPD '1',999      PAGE EJECT BEFORE PRINTING                 00641
PUT      AH    R1,LINECNT    UPDATE THE LINE COUNT                      00642
         STH   R1,LINECNT                                               00643
         CH    R1,LINEMAX     END OF A PAGE                             00644
         BL    PUT0           BR IF NOT                                 00645
         LH    R1,PAGECNT                                               00646
         LA    R1,1(,R1)                                                00647
         STH   R1,PAGECNT                                               00648
         CVD   R1,WORK                                                  00649
         OI    WORK+7,X'F'                                              00650
         UNPK  PAGENO,WORK                                              00651
         PUT   SYSPRINT,TITLE                                           00652
         LA    R1,3                                                     00653
         STH   R1,LINECNT                                               00654
         MVI   SPACE,C'0'    DOUBLE SPACE FROM TOP                      00655
PUT0     PUT   SYSPRINT,SPACE                                           00656
         MVI   LINE,C' '                                                00657
         MVC   LINE+1(L'LINE-1),LINE                                    00658
         BR    LINK           RETURN TO CALLER                          00659
*                                                                       00660
TITLE    DC    CL133'1'                                                 00661
         ORG   TITLE+124                                                00662
         DC    C'PAGE '                                                 00663
PAGENO   DC    CL4' '                                                   00664
         ORG   ,                                                        00665
PAGECNT  DC    H'0'                                                     00666
LINECNT  DC    H'0'                                                     00667
LINEMAX  DC    H'78'          MAX LINES PER PAGE                        00668
*---------------------------------------------------------------------- 00669
*  SUBROUTINE TO CONVERT TIMER UNITS TO TOD.                            00670
*        INPUT - W1=TOD IN 52 MICROSEC UNITS.                           00671
*        OUTPUT - TIME OF DAY IN 'TOD'.                                 00672
*                                                                       00673
*   CONVERT HUNDRETHS OF SEC TO HH.MM.SS                                00674
TODCNVTA MVC   TOD,TODZERO                                              00675
         XC    TODSEC(4),TODSEC                                         00676
         LTR   W1,W1     SKIP IF ZERO                                   00677
         BZR   LINK                                                     00678
         XR    W0,W0                                                    00679
         D     W0,=F'100'     CONVERT TO SECONDS                        00680
         B     TODCNVT1       CONTINUE WITH OTHER S/R                   00681
*   CONVERT TIMER UNITS TO HH.MM.SS                                     00682
TODCNVT  MVC   TOD,TODZERO    SET DEFAULT TOD                           00683
         MVC   TODSEC(4),=F'0'                                          00684
         LTR   W1,W1          IS VALUE ZERO                             00685
         BCR   8,LINK         RETURN IF YES                             00686
         SR    W0,W0          ZERO FOR DIVIDE                           00687
         D     W0,=F'300'     GET INTO SECONDS                          00688
TODCNVT1  ST    W1,TODSEC                                               00689
         LTR   W1,W1          ANY SECONDS                               00690
         BCR   8,LINK         RETURN IF NO TIME                         00691
         SR    W0,W0          ZERO FOR DIVIDE                           00692
         D     W0,=F'3600'    GET HOURS IN W1                           00693
         CVD   W1,WORK                                                  00694
         UNPK  TOD(2),WORK                                              00695
         OI TOD+1,X'F0'                                                 00696
         LTR   W0,W0          ANY REMAINING SECONDS                     00697
         BCR   8,LINK         RETURN IF NO                              00698
         LR    W1,W0          GET READY FOR DIVIDE                      00699
         SR    W0,W0                                                    00700
         D     W0,=F'60'      GET MINUTES IN W1                         00701
         CVD   W1,WORK                                                  00702
         UNPK  TOD+3(2),WORK                                            00703
         OI    TOD+4,X'F0'                                              00704
         CVD   W0,WORK        GET REMAINING SECONDS                     00705
         UNPK  TOD+6(2),WORK                                            00706
         OI    TOD+7,X'F0'                                              00707
         BR    LINK           RETURN TO CALLER                          00708
TODZERO  DC    CL8'00.00.00'  DEFAULT TIME VALUE                        00709
TOD      DC    CL8'HH.MM.SS'  CONVERTED TIME OF DAY                     00710
*---------------------------------------------------------------------- 00711
*   SUBROUTINE TO SCAN/MERGE THE PARMS                                  00712
SCAN     LA    W3,PARMDFLT                                              00713
         LA    R15,3       FIRST TWO COMMAS                             00714
         CH    W1,=Y(L'PARMDFLT)                                        00715
         BNH   *+8                                                      00716
         LA    W1,L'PARMDFLT                                            00717
SCAN1    CLI   0(W2),C','                                               00718
         BE    SCAN2                                                    00719
         CLI   0(W3),C','                                               00720
         BE    SCAN3                                                    00721
         CLI   0(W2),C'X'                                               00722
         BE    *+12                                                     00723
         IC    R0,0(,W2)                                                00724
         STC   R0,0(,W3)                                                00725
         LA    W2,1(,W2)                                                00726
         LA    W3,1(,W3)                                                00727
         BCT   W1,SCAN1                                                 00728
         BR    LINK                                                     00729
SCAN2    LA    W2,1(,W2)     BUMP OVER THE COMMA                        00730
SCAN2A   CLI   0(W3),C','    POSITION TO NEXT COMMA                     00731
         BE    SCAN2B                                                   00732
         LA    W3,1(,W3)                                                00733
         B     SCAN2A                                                   00734
SCAN2B   LA    W3,1(,W3)                                                00735
         BCT   W1,SCAN4                                                 00736
         BR    LINK                                                     00737
SCAN3    LA    W3,1(,W3)     BUMP OVER THE COMMA                        00738
SCAN3A   CLI   0(W2),C','    FIND THE OTHER COMMA                       00739
         BE    SCAN3B                                                   00740
         LA    W2,1(,W2)                                                00741
         BCT   W1,SCAN3A                                                00742
         BR    LINK                                                     00743
SCAN3B   LA    W2,1(,W2)                                                00744
         BCT   W1,SCAN4                                                 00745
         BR    LINK                                                     00746
SCAN4    BCT   R15,SCAN1    CONTINUE IF ONE OF FIRST TWO                00747
SCAN5    IC    R0,0(,W2)                                                00748
         STC   R0,0(,W3)                                                00749
         LA    W2,1(,W2)                                                00750
         LA    W3,1(,W3)                                                00751
         BCT   W1,SCAN5                                                 00752
         BR    LINK                                                     00753
*---------------------------------------------------------------------- 00754
*   SUBROUTINE TO PROCESS THE UNITNAME PARM SPACIFICATION               00755
FNDUNIT  CLI   0(W4),C' '                                               00756
         BER   LINK                                                     00757
         CLI   UNITNAME,C' '                                            00758
         BNE   FNDUNIT1                                                 00759
FNDUNITA CLI   0(W4),C' '                                               00760
         BER   LINK                                                     00761
         CLI   3(W4),C'-'                                               00762
         BE    FNDUNIT3                                                 00763
FNDUNIT0 MVC   UNITNAME,0(W4)                                           00764
         B     4(LINK)                                                  00765
FNDUNIT1 CLI   3(W4),C'-'                                               00766
         BE    FNDUNIT2                                                 00767
         CLI   3(W4),C' '                                               00768
         BER   LINK     DONE                                            00769
         CLI   3(W4),C','                                               00770
         BNE   BADPARM                                                  00771
         LA    W4,4(,W4)                                                00772
         SH    W5,=H'4'                                                 00773
         BP    FNDUNIT0                                                 00774
         BR    LINK                                                     00775
FNDUNIT2 CLC   UNITNAME+2(1),4(W4)                                      00776
         BNE   FNDUNIT3                                                 00777
         LA    W4,6(,W4)                                                00778
         SH    W5,=H'6'                                                 00779
         BP    FNDUNITA                                                 00780
         BR    LINK                                                     00781
FNDUNIT3 CLI   0(W4),0                                                  00782
         BE    FNDUNIT4    FIRST TIME                                   00783
         MVC   UNITNAME,0(W4)                                           00784
         MVI   0(W4),0                                                  00785
         IC    R1,2(,W4)                                                00786
         N     R1,=F'15'                                                00787
         TM    2(W4),X'F0'                                              00788
         BO    *+8                                                      00789
         LA    R1,9(,R1)                                                00790
         STH   R1,UNITINCR                                              00791
         B     4(LINK)                                                  00792
FNDUNIT4 LH    R1,UNITINCR                                              00793
         LA    R1,1(,R1)                                                00794
         STH   R1,UNITINCR                                              00795
         IC    R0,HEXTBL(R1)                                            00796
         STC   R0,UNITNAME+2                                            00797
         B     4(LINK)                                                  00798
*---------------------------------------------------------------------- 00799
*       DISTRIBUTION TABLE UPDATE SUBROUTINES                           00800
*---------------------------------------------------------------------- 00801
*                                                                       00802
*   PLACE A VALUE IN A DISTRIBUTION TABLE                               00803
*        R0 = ARGUMENT VALUE                                            00804
*        R1 = A(TABLE OF DISTRIBUTION VALUES)                           00805
*        R15 = A(DISTRIBUTION TABLE TO BE UPDATED)                      00806
*        R14 = WORK REG                                                 00807
         USING $TAB,R15                                                 00808
DISTRIB  LA    R14,$TABC-$TAB(,R15)                                     00809
DIST1    CLC   =A(HIVALUE),0(R1)                                        00810
         BE    DIST2                                                    00811
         C     R0,0(,R1)                                                00812
         BNH   DIST2                                                    00813
         A     R1,=F'4'                                                 00814
         A     R14,=F'4'                                                00815
         B     DIST1                                                    00816
DIST2    L     R1,0(,R14)                                               00817
         LA    R1,1(,R1)       UPDATE COUNTER                           00818
         ST    R1,0(,R14)                                               00819
         L     R1,$TABA-$TAB(,R15)                                      00820
         AR    R1,R0           UPDATE SUM                               00821
         ST    R1,$TABA-$TAB(,R15)                                      00822
         L     R1,$TABB-$TAB(,R15)                                      00823
         LA    R1,1(,R1)       UPDATE TOTAL COUNT                       00824
         ST    R1,$TABB-$TAB(,R15)                                      00825
         C     R0,$TABD                                                 00826
         BNL   *+8                                                      00827
         ST    R0,$TABD                                                 00828
         C     R0,$TABE                                                 00829
         BNH   *+8                                                      00830
         ST    R0,$TABE                                                 00831
         BR    LINK                                                     00832
         DROP  R15                                                      00833
         EJECT                                                          00834
*---------------------------------------------------------------------- 00835
OPENERR  WTO   'SEEKMON: SYSPRINT OPEN ERROR',ROUTCDE=(1,11)            00836
         ABEND 1                                                        00837
*                                                                       00838
NOCORE   WTO   'SEEKMON: REGION TOO SMALL',ROUTCDE=(1,11)               00839
         ABEND 2,DUMP                                                   00840
*                                                                       00841
BADPARM  WTO   'SEEKMON: INVALID PARM SPECIFIED',ROUTCDE=(1,11)         00842
         ABEND 3,DUMP                                                   00843
*                                                                       00844
RETURN   TM    OPTIONS,X'80'                                            00845
         BO    RETURNX                                                  00846
         FREEMAIN V,A=GOTTENA      FREE THE GOTTEN CORE                 00847
RETURNX  DASHES BR=PUTSP2                                               00848
         MVC   LINE(L'MSGEND),MSGEND                                    00849
         BAL   LINK,PUTSP2                                              00850
         L     R1,NEXTFREE                                              00851
         S     R1,GOTTENA                                               00852
         A     R1,=A(PGMSIZE+PGMSIZE0)                                  00853
         LH    R0,SYSPRINT+DCBBLKSI-IHADCB                              00854
         SLL   R0,1                                                     00855
         AR    R1,R0                                                    00856
         LA    R1,2047(,R1)       ROUND-UP THE VALUE                    00857
         SRL   R1,11       CONVERT TO K                                 00858
         SLL   R1,1                                                     00859
         LA    R1,4(,R1)   ADD IN THE 4K FUDGE                          00860
         CVD   R1,WORK     NOW FORMAT AND PRINT                         00861
         OI    WORK+7,X'F'                                              00862
         UNPK  LINE+2(3),WORK                                           00863
         MVC   LINE+5(15),=CL15'K STORAGE USED,'                        00864
         L     R1,TOPCORE                                               00865
         S     R1,NEXTFREE                                              00866
         SRL   R1,11                                                    00867
         SLL   R1,1                                                     00868
         CVD   R1,WORK                                                  00869
         OI    WORK+7,X'F'                                              00870
         UNPK  LINE+22(3),WORK                                          00871
         MVC   LINE+25(12),=CL12'K STILL FREE'                          00872
         BAL   LINK,PUTSP1                                              00873
         L     R1,LOSTDATA                                              00874
         CVD   R1,WORK                                                  00875
         OI    WORK+7,X'F'                                              00876
         UNPK  LINE+2(5),WORK                                           00877
         MVC   LINE+8(17),=CL17'DATA POINTS LOST.'                      00878
         BAL   LINK,PUTSP1                                              00879
         CLOSE SYSPRINT                                                 00880
         TM    OPTIONS,X'80'                                            00881
         BZ    RETURNZ                                                  00882
         ABEND 999,DUMP                                                 00883
RETURNZ  L     R13,4(,R13)                                              00884
         RETURN (14,12),,RC=0                                           00885
         EJECT                                                          00886
*---------------------------------------------------------------------- 00887
*       GENERATE THE ACTIVITY REPORT                                    00888
*---------------------------------------------------------------------- 00889
SEEKMON  CSECT ,                                                        00890
REPORT   PRT2  BGNTME,0,'  START TIME ='                                00891
         PRT2  ENDTME,25,'   STOP TIME ='                               00892
         L     W1,ENDTME                                                00893
         S     W1,BGNTME                                                00894
         ST    W1,WORK                                                  00895
         PRT2  WORK,50,'ELAPSED TIME ='                                 00896
         BAL   LINK,PUTSP2                                              00897
*                                                                       00898
         MVC   LINE(WR200A),WR200                                       00899
         L     W2,SAMPLES                                               00900
         CVD   W2,WORK                                                  00901
         ED    WR200B(L'WR201),WORK+4                                   00902
         XR    W0,W0                                                    00903
         L     W1,SAMPLET                                               00904
         D     W0,SECONDS                                               00905
         CVD   W1,WORK                                                  00906
         ED    WR200C(L'WR202),WORK+4                                   00907
         BAL   LINK,PUTSP2                                              00908
*---------------------------------------------------------------------- 00909
         USING DEVICE,W1                                                00910
         L     W1,=A(DEVTBL)                                            00911
REPORT1  LH    W0,UCBADDR                                               00912
         LTR   W0,W0                                                    00913
         BNZ   REPORT11                                                 00914
REPORT10 LA    W1,DEVICEL(,W1)    UPDATE THE POINTER                    00915
         C     W1,LASTDEV         ARE WE DONE?                          00916
         BNH   REPORT1            NO, CONTINUE                          00917
         B     RETURN                                                   00918
         USING UCB,W0                                                   00919
REPORT11 DASHES BR=PUTSP1                                               00920
         IC    R1,UCBTBYT4     DEVICE TPYE                              00921
         N     R1,=F'15'                                                00922
         BCTR  R1,0                                                     00923
         SLL   R1,3                                                     00924
         LA    R1,M10(R1)                                               00925
         MVC   TITLE+1(8),0(R1)                                         00926
         MVC   TITLE+11(3),UCBNAME                                      00927
         MVI   TITLE+14,C'/'                                            00928
         MVC   TITLE+15(6),UCBVOLI                                      00929
         DASHES BR=PUTSK1,CHAR==                                        00930
         MVC   M01A(3),UCBNAME                                          00931
         MVC   M01B(6),UCBVOLI                                          00932
         MVC   LINE(M01L),M01                                           00933
         L     R1,SAMPLES                                               00934
         LA    R14,LINE+M01F-M01                                        00935
         BAL   LINK,REPORTA                                             00936
         LH    R1,DEVLOST                                               00937
         LA    R14,LINE+M01G-M01                                        00938
         BAL   LINK,REPORTA                                             00939
         BAL   LINK,PUTSP1                                              00940
         DASHES BR=PUTSP1,CHAR==                                        00941
         BAL   LINK,REPORTG                                             00942
         MVC   LINE(L'M08),M08                                          00943
         MVC   LINE+44(L'M08),M08+L'M08                                 00944
         MVC   LINE+88(L'M08),M08+2*L'M08                               00945
         BAL   LINK,REPORTG                                             00946
         DASHES BR=REPORTG                                              00947
         REPORTC LINE+44                                                00948
         REPORTC LINE+88                                                00949
         BAL   LINK,REPORTG                                             00950
         LA    W3,M07                                                   00951
         LA    W4,7                                                     00952
         LA    W5,DEVONLN                                               00953
         L     W6,SAMPLES                                               00954
         LA    W7,M07CNT-7                                              00955
         STM   W3,W7,$SAVE3                                             00956
         L     W7,DEVDIST                                               00957
         L     W3,DEVTBLPT                                              00958
         LR    W6,W3                                                    00959
         USING $TAB,W6                                                  00960
         XR    W5,W5                                                    00961
         XR    W4,W4                                                    00962
         LA    W6,$TABC                                                 00963
         STM   W3,W7,$SAVE4                                             00964
         LA    W3,$TABL(,W3)                                            00965
         LA    W6,$TABC-$TAB(,W3)                                       00966
         STM   W3,W7,$SAVE5                                             00967
*                                                                       00968
*   COUNTS PLUS CYL POSITION HISTOGRAMS                                 00969
*                                                                       00970
REPORT2A LM    W3,W7,$SAVE3                                             00971
         LTR   W4,W4                                                    00972
         BM    REPORT22                                                 00973
REPORT21 MVC   LINE(L'M07),0(W3)                                        00974
         L     R1,0(,W5)                                                00975
         LA    R14,LINE+30                                              00976
         BAL   LINK,REPORTA                                             00977
         LR    R15,W6                                                   00978
         LA    R14,LINE+20                                              00979
         BAL   LINK,REPORTB                                             00980
         LA    W3,L'M07(,W3)                                            00981
         LA    W5,4(,W5)                                                00982
         LTR   W4,W4                                                    00983
         BZ    REPORT2B                                                 00984
         L     W6,DEVONLN                                               00985
         BCT   W4,REPORT22                                              00986
         L     W6,DEVBUSY                                               00987
         B     REPORT22                                                 00988
REPORT2B L     W6,DEVBUSY                                               00989
         BCT   W7,REPORT22                                              00990
         L     W4,=F'-1'                                                00991
REPORT22 STM   W3,W7,$SAVE3                                             00992
         MVI   PRTHEX,C'1'            SET TO PRINT VALUES IN HEX    RVH 00993
         REPORTD $SAVE4,LINE+44                                         00994
         REPORTD $SAVE5,LINE+88                                         00995
         MVI   PRTHEX,C'0'            TURN OFF HEX VALUE PRINT      RVH 00996
         TESTBL LINE,LINE+44+20,LINE+88+20,REPORT23,REPORT24            00997
REPORT23 BAL   LINK,REPORTG                                             00998
         B     REPORT2A                                                 00999
*                                                                       01000
REPORT24 BAL   LINK,REPORTG                                             01001
         MVC   LINE+44(M13L),M13                                        01002
         MVC   LINE+88(M13L),M13                                        01003
         BAL   LINK,REPORTG                                             01004
         REPORTF $SAVE4,LINE+44                                         01005
         REPORTF $SAVE5,LINE+88                                         01006
         BAL   LINK,REPORTG                                             01007
         DASHES BR=REPORTG,CHAR==                                       01008
*                                                                       01009
*   COUNTER HISTOGRAMS                                                  01010
*                                                                       01011
         BAL   LINK,REPORTG                                             01012
         MVC   LINE(L'M09),M09                                          01013
         MVC   LINE+44(L'M09),M09+L'M09                                 01014
         MVC   LINE+88(L'M09),M09+2*L'M09                               01015
         BAL   LINK,REPORTG                                             01016
         DASHES BR=REPORTG                                              01017
         REPORTC LINE                                                   01018
         REPORTC LINE+44                                                01019
         REPORTC LINE+88                                                01020
         BAL   LINK,REPORTG                                             01021
         L     W3,DEVTBLPT                                              01022
         LA    W3,2*$TABL(,W3)                                          01023
         XR    W4,W4                                                    01024
         XR    W5,W5                                                    01025
         LA    W6,$TABC-$TAB(,W3)                                       01026
         L     W7,=A(DISTCNT)                                           01027
         STM   W3,W7,$SAVE3                                             01028
         LA    W3,$TABL(,W3)                                            01029
         LA    W6,$TABC-$TAB(,W3)                                       01030
         STM   W3,W7,$SAVE4                                             01031
         LA    W3,$TABL(,W3)                                            01032
         LA    W6,$TABC-$TAB(,W3)                                       01033
         STM   W3,W7,$SAVE5                                             01034
REPORT25 REPORTD $SAVE3,LINE                                            01035
         REPORTD $SAVE4,LINE+44                                         01036
         REPORTD $SAVE5,LINE+88                                         01037
         TESTBL LINE+20,LINE+44+20,LINE+88+20,REPORT26,REPORT27         01038
REPORT26 BAL   LINK,REPORTG                                             01039
         B     REPORT25                                                 01040
REPORT27 BAL   LINK,REPORTG                                             01041
         MVC   LINE(M13L),M13                                           01042
         MVC   LINE+44(M13L),M13                                        01043
         MVC   LINE+88(M13L),M13                                        01044
         BAL   LINK,REPORTG                                             01045
         REPORTF $SAVE3,LINE                                            01046
         REPORTF $SAVE4,LINE+44                                         01047
         REPORTF $SAVE5,LINE+88                                         01048
         BAL   LINK,REPORTG                                             01049
         DASHES BR=PUTSP1,CHAR==                                        01050
REPORT29 L     W5,DEVBUSY                                               01051
         LTR   W5,W5                                                    01052
         BZ    REPORT10                                                 01053
         TM    OPTIONS,OPT1    SKIP IF SUPPRESSED                       01054
         BZ    REPORT10                                                 01055
*                                                                       01056
*   CYLINDER MOVEMENT REPORTS                                           01057
*                                                                       01058
         MVI   LINE,C'*'                                                01059
         MVC   LINE+1(L'LINE-1),LINE                                    01060
         MVC   LINE+50(M12L),M12                                        01061
         CVD   W5,WORK                                                  01062
         ED    LINE+50+M12A-M12(10),WORK+4                              01063
         LA    R15,PUTSK1    ASSUME PAGE EJECT                          01064
         LH    R1,LINECNT                                               01065
         LA    R1,15(,R1)                                               01066
         CH    R1,LINEMAX                                               01067
         BNL   *+8                                                      01068
         LA    R15,PUTSP1                                               01069
         BALR  LINK,R15                                                 01070
         DASHES BR=PUTSP1                                               01071
         L     W5,CYLENTRY   PRTN TO FIRST BLOCK                        01072
         LTR   W5,W5                                                    01073
         BZ    REPORT10      NOTHING TO REPORT                          01074
         ST    W5,$SAVE1+8                                              01075
         LA    W2,REPORT40                                              01076
         LA    W3,$SAVE1                                                01077
         LA    W4,1                                                     01078
         STM   W2,W7,$SAVE2                                             01079
         LA    W3,$SAVE1+2                                              01080
         BAL   R15,REPORT45                                             01081
         NOP   0                                                        01082
         STM   W2,W7,$SAVE3                                             01083
         LA    W3,$SAVE1+4                                              01084
         BAL   R15,REPORT45                                             01085
         NOP   0                                                        01086
         STM   W2,W7,$SAVE4                                             01087
** MOVEMENT CONTROL LOOP                                                01088
REPORT30 LM    W2,W7,$SAVE2        COL NO. 1                            01089
         LA    R14,LINE                                                 01090
         BALR  LINK,W2                                                  01091
         STM   W2,W7,$SAVE2                                             01092
         LM    W2,W7,$SAVE3        COL NO. 2                            01093
         LA    R14,LINE+44                                              01094
         BALR  LINK,W2                                                  01095
         STM   W2,W7,$SAVE3        COL NO. 3                            01096
         LM    W2,W7,$SAVE4                                             01097
         LA    R14,LINE+88                                              01098
         BALR  LINK,W2                                                  01099
         STM   W2,W7,$SAVE4        TEST IF DONE                         01100
         A     W4,$SAVE2+2*4                                            01101
         A     W4,$SAVE3+2*4                                            01102
         LTR   W4,W4                                                    01103
         BZ    REPORT10                                                 01104
         BAL   LINK,REPORTG                                             01105
         B     REPORT30                                                 01106
** MOVEMENT PROCESSING                                                  01107
REPORT40 XR    W6,W6                                                    01108
         LTR   W5,W5                                                    01109
         BZ    REPORT44                                                 01110
         MVC   0(2,W3),0(W5)                                            01111
         LR    W7,W5                                                    01112
REPORT41 A     W6,4(,W7)           CALC COUNTS FOR THIS CYL             01113
         L     W7,8(,W7)                                                01114
         LTR   W7,W7                                                    01115
         BZ    REPORT42                                                 01116
         CLC   0(2,W3),0(W7)                                            01117
         BE    REPORT41                                                 01118
REPORT42 BALR  W2,LINK                                                  01119
         MVI   0(R14),C'-'                                              01120
         MVC   1(40,R14),0(R14)                                         01121
         MVC   10(M02L,R14),M02                                         01122
         LH    R0,0(,W5)                                                01123
         CVD   R0,WORK                                                  01124
         ED    10+M02A-M02(4,R14),WORK+6                                01125
         BALR  W2,LINK                                                  01126
         MVC   0(M03L,R14),M03                                          01127
         XR    R0,R0                                                    01128
         LR    R1,W6                                                    01129
         M     R0,=F'100'                                               01130
         D     R0,DEVBUSY                                               01131
         CVD   R1,WORK                                                  01132
         ED    0(4,R14),WORK+6                                          01133
         LR    R1,W6                                                    01134
         LA    R14,M03A-M03(,R14)                                       01135
         BAL   W2,REPORTA                                               01136
         MVC   0(L'M04,R14),M04                                         01137
         BALR  W2,LINK                                                  01138
REPORT43 MVC   0(M05L,R14),M05                                          01139
         LH    R0,2(,W5)                                                01140
         CVD   R0,WORK                                                  01141
         ED    M05A-M05(4,R14),WORK+6                                   01142
         ST    W6,WORK                                                  01143
         PERCENT 4(,W5),WORK,M05B-M05                                   01144
         PERCENT 4(,W5),DEVBUSY,M05C-M05                                01145
         L     R1,4(,W5)                                                01146
         LA    R14,M05L(,R14)                                           01147
         BAL   W2,REPORTA                                               01148
         L     W5,8(,W5)                                                01149
         LTR   W5,W5                                                    01150
         BZ    REPORT44                                                 01151
         CLC   0(2,W3),0(W5)                                            01152
         BE    REPORT43                                                 01153
         BAL   R15,REPORT45                                             01154
         B     REPORT44                                                 01155
         B     REPORT40                                                 01156
** THIS COLUMN IS DONE ... IDLE TIL REST ARE DONE                       01157
REPORT44 LA    W4,0                                                     01158
         LA    W2,REPORT44                                              01159
         BR    LINK                                                     01160
** GET NEXT CYL CHAIN STARTING ADDR                                     01161
REPORT45 L     W5,$SAVE1+8                                              01162
         LTR   W5,W5                                                    01163
         BZ    REPORT47                                                 01164
         LR    R1,W5                                                    01165
REPORT46 L     W5,8(,W5)                                                01166
         LTR   W5,W5                                                    01167
         BZ    REPORT47                                                 01168
         CLC   0(2,R1),0(W5)                                            01169
         BE    REPORT46                                                 01170
         ST    W5,$SAVE1+8                                              01171
         B     4(R15)                                                   01172
REPORT47 ST    W5,$SAVE1+8                                              01173
         BR    R15                                                      01174
   EJECT ,                                                              01175
*---------------------------------------------------------------------- 01176
*     REPORT  SUBROUTINES                                               01177
*---------------------------------------------------------------------- 01178
*                                                                       01179
*   FORMAT S/R 7 DIGIT VALUE                                            01180
REPORTA  CVD   R1,WORK                                                  01181
         MVC   0(10,R14),=X'40206B2020206B202120'                       01182
         ED    0(10,R14),WORK+4                                         01183
         BR    LINK                                                     01184
*   FORMAT S/R 2 .. PERCENT                                             01185
REPORTB  XR    R0,R0                                                    01186
         M     R0,=F'100'   TO GET PERCENT                              01187
         LTR   R15,R15                                                  01188
         BZR   LINK                                                     01189
         DR    R0,R15                                                   01190
         CVD   R1,WORK                                                  01191
         MVC   0(5,R14),=X'402021206C'                                  01192
         ED    0(4,R14),WORK+6                                          01193
         BR    LINK                                                     01194
*   FORMAT THE DISTRIBUTION PLOT HEADING                                01195
REPORTC  MVC   0(10,R14),=CL10'RAW-COUNTS'                              01196
         MVC   12(6,R14),=CL6'VALUES'                                   01197
         MVI   20(R14),C'0'                                             01198
         MVC   29(2,R14),=C'50'                                         01199
         MVC   38(3,R14),=C'100'                                        01200
         BR    LINK                                                     01201
*   FORMAT THE BASIC HISTOGRAM LINE                                     01202
REPORTD  L     R0,$TABB-$TAB(,W3)                                       01203
         LTR   R0,R0                                                    01204
         BNZ   REPORTD0                                                 01205
         LTR   W5,W5                                                    01206
         BMR   LINK                                                     01207
         MVC   20(15,R14),=CL15'**NO ACTIVITY**'                        01208
         L     W5,=F'-1'                                                01209
         BR    LINK                                                     01210
REPORTD0 CR    W5,R0                                                    01211
         BNLR  LINK                                                     01212
         LR    R0,W4                                                    01213
         L     R15,0(,W6)                                               01214
         L     R1,0(,W7)                                                01215
         LA    W4,1(,R1)                                                01216
         CVD   R15,WORK                                                 01217
         MVC   0(10,R14),=X'40206B2020206B202120'                       01218
         ED    0(10,R14),WORK+4                                         01219
*                                                                   RVH 01220
*        ROUTINE TO PRINT VALUES (CYL ADDR) IN HEX                  RVH 01221
*                                                                   RVH 01222
         CLI   PRTHEX,C'1'             ARE WE TO PRINT IN HEX       RVH 01223
         BNE   REPORTDB                NO  - SKIP THIS CODE         RVH 01224
         C     R1,=A(HIVALUE)          CHECK FOR MAX VALUE          RVH 01225
         BE    REPORTDA                YES  - SET "MAX" IN LINE     RVH 01226
         ST    R1,WORK                 SAVE VALUE TO BE PRINTED     RVH 01227
         UNPK  HEXAREA(5),WORK+2(3)    GET IN ZONED FORM            RVH 01228
         TR    HEXAREA(4),HEXTBL-240   GET INTO PRINTABLE FORM      RVH 01229
         MVC   15(3,R14),HEXAREA+1     PUT INTO THE PRINT LINE      RVH 01230
         B     *+10                    SKIP NEXT INSTRUCTION        RVH 01231
REPORTDA MVC   15(3,R14),=C'MAX'       SET IN "MAX" FOR VALUE       RVH 01232
         MVI   14(R14),C'-'            PUT IN THE "-"               RVH 01233
         ST    R0,WORK                 SAVE VALUE TO BE PRINTED     RVH 01234
         UNPK  HEXAREA(5),WORK+2(3)    GET IN ZONED FORM            RVH 01235
         TR    HEXAREA(4),HEXTBL-240   GET INTO PRINTABLE FORM      RVH 01236
         MVC   11(3,R14),HEXAREA+1     PUT INTO THE PRINT LINE      RVH 01237
         B     REPORTDC                BRANCH AROUND DATA AREAS     RVH 01238
PRTHEX   DC    C'0'                    VALUE FOR PRT OPTION         RVH 01239
HEXAREA  DC    CL5' '                  WORK AREA                    RVH 01240
REPORTDB DS    0H                      TAG                          RVH 01241
*                                                                   RVH 01242
*        END OF MODIFICATION TO PRINT VALUES IN HEX                 RVH 01243
*                                                                   RVH 01244
         C     R1,=A(HIVALUE)                                           01245
         BE    REPORTD1                                                 01246
         CVD   R1,WORK                                                  01247
         MVC   14(4,R14),=X'40202120'                                   01248
         ED    14(4,R14),WORK+6                                         01249
         B     *+10                                                     01250
REPORTD1 MVC   15(3,R14),=C'MAX'                                        01251
         MVI   14(R14),C'-'                                             01252
         CVD   R0,WORK                                                  01253
         MVC   10(4,R14),=X'40202120'                                   01254
         ED    10(4,R14),WORK+6                                         01255
REPORTDC DS    0H                      TAG TO BRANCH TO             RVH 01256
REPORTD2 MVI   20(R14),C'.'                                             01257
         MVI   30(R14),C'.'                                             01258
         MVI   40(R14),C'.'                                             01259
         L     R1,0(,W6)                                                01260
         LTR   R1,R1                                                    01261
         BZ    REPORTD9                                                 01262
         MVI   20(R14),C'+'   AL LEAST ONE TIC MARK                     01263
         L     R15,$TABB-$TAB(,W3)                                      01264
         XR    R0,R0                                                    01265
         M     R0,=F'100'                                               01266
         LTR   R15,R15                                                  01267
         BZ    REPORTD9                                                 01268
         DR    R0,R15                                                   01269
         CH    R1,=H'100'                                               01270
         BL    *+8                                                      01271
         LA    R1,100                                                   01272
REPORTD3 MVI   20(R14),C'+'                                             01273
         LA    R14,1(,R14)                                              01274
         SH    R1,=H'5'                                                 01275
         BNM   REPORTD3                                                 01276
REPORTD9 A     W5,0(,W6)                                                01277
         LA    W6,4(,W6)                                                01278
         LA    W7,4(,W7)                                                01279
         BR    LINK                                                     01280
*   FORMAT THE OBSERV., AVG, MIN, MAX VALUES                            01281
         USING $TAB,W6                                                  01282
REPORTF  ST    LINK,$SAVE1                                              01283
         L     R1,$TABB                                                 01284
         BAL   LINK,REPORTA                                             01285
         LTR   R1,R1                                                    01286
         BZ    REPORTF1                                                 01287
         MVC   13(M14L,R14),M14                                         01288
         XR    R0,R0                                                    01289
         L     R1,$TABA                                                 01290
         D     R0,$TABB                                                 01291
         CVD   R1,WORK                                                  01292
         ED    13(4,R14),WORK+6                                         01293
         L     R1,$TABD                                                 01294
         CVD   R1,WORK                                                  01295
         ED    18(4,R14),WORK+6                                         01296
         L     R1,$TABE                                                 01297
         CVD   R1,WORK                                                  01298
         ED    23(4,R14),WORK+6                                         01299
REPORTF1 L     LINK,$SAVE1                                              01300
         BR    LINK                                                     01301
         DROP  W6                                                       01302
*   INSERT REPORT DIVIDERS AND PRINT THE LINE                           01303
REPORTG  MVI   LINE+42,C'I'                                             01304
         MVI   LINE+86,C'I'                                             01305
         B     PUTSP1                                                   01306
         EJECT                                                          01307
*---------------------------------------------------------------------- 01308
*   CONSTANTS AND DATA STORAGE AREAS                                    01309
*---------------------------------------------------------------------- 01310
$SAVE1   DC    6F'0'                                                    01311
$SAVE2   DC    6F'0'                                                    01312
$SAVE3   DC    6F'0'                                                    01313
$SAVE4   DC    6F'0'                                                    01314
$SAVE5   DC    6F'0'                                                    01315
DEVDISTA DC    A(DISTXXXX,DISTXXXX,DISTXXXX,DISTXXXX)                   01316
         DC    A(DISTXXXX,DISTXXXX,DISTXXXX,DIST2314)                   01317
         DC    A(DIST3330,DIST3340,DIST3350,DIST3375)                   01318
         DC    A(DIST3331,DIST3380,DISTXXXX,DISTXXXX)                   01319
         DC    0D'0'                                                    01320
         LTORG                                                          01321
SPACE    DC    C' '       CARRIAGE CONTROL FOR PRINTED LINE             01322
LINE     DC    CL132' '   BUFFER FOR PRINTED LINE                       01323
M01      DC    C'DEVICE='                                               01324
M01A     DC    C'CUU',C', VOL='                                         01325
M01B     DC    CL6' ',C'  --  '                                         01326
M01F     DC    CL10' ',C' SAMPLES TAKEN,'                               01327
M01G     DC    CL10' ',C' SAMPLES LOST FOR THIS DEVICE'                 01328
M01L     EQU   *-M01                                                    01329
M02      DC    C'CYLINDER'                                              01330
M02A     DC    X'40202120'                                              01331
M02L     EQU   *-M02                                                    01332
M03      DC    X'40202120',C'% OF ACTIVITY ('                           01333
M03A     DC    CL10' ',C' COUNTS)'                                      01334
M03L     EQU   *-M03                                                    01335
M04      DC    C'TO-CYL   %-CYL    %-DEV    COUNTS'                     01336
M05      DC    CL2' '                                                   01337
M05A     DC    X'40202120',CL4' '                                       01338
M05B     DC    X'40202120',CL5' '                                       01339
M05C     DC    X'40202120'                                              01340
M05L     EQU   *-M05                                                    01341
M07      DC    CL20'DEVICE ONLINE'                                      01342
         DC    CL20'DEVICE NOT-READY'                                   01343
         DC    CL20'DEVICE ALLOCATED'                                   01344
         DC    CL20'DEVICE RESERVED'                                    01345
         DC    CL20'ERR-RECOVERY ACTIVE'                                01346
         DC    CL20'CONTROL-UNIT BUSY'                                  01347
         DC    CL20'DEVICE BUSY'                                        01348
         DC    CL20'BUSY && DATA XFER '                                 01349
         DC    CL20'BUSY && S-A SEEK '                                  01350
         DC    CL20'BUSY && ALT. PATH '                                 01351
M07CNT   EQU   (*-M07)/20                                               01352
M08      DC    CL40' '                                                  01353
         ORG   M08                                                      01354
         DC    CL20'DATA DESCRIPTION',CL10' PERCENT',CL10'    COUNTS'   01355
         ORG   ,                                                        01356
         DC    CL40'CYLINDER POSITIONS IN HEX  (WHEN BUSY)  '       RVH 01357
         DC    CL40'CYLINDER POSITIONS IN HEX FOR A S-A SEEK'       RVH 01358
M09      DC    CL40'SHARED-DASD RESERVE COUNTS (CU/DEV BUSY)'           01359
         DC    CL40'OPEN DCB''S'                                        01360
         DC    CL40'USE (ALLOCATION) COUNTS'                            01361
M10      DC    CL8'UNKNOWN1',CL8'UNKNOWN2',CL8'UNKNOWN3',CL8'UNKNOWN4'  01362
         DC    CL8'UNKNOWN5',CL8'2305-1  ',CL8'2305-2  ',CL8'2314/19 '  01363
         DC    CL8'3330    ',CL8'3340    ',CL8'3350    ',CL8'3375    '  01364
         DC    CL8'3330M11 ',CL8'3380    ',CL8'UNKNOWN ',CL8'UNKNOWN '  01365
M12      DC    C'  ARM MOVEMENTS, OBSERVATIONS ='                       01366
M12A     DC    X'40206B2020206B202120',C'  '                            01367
M12L     EQU   *-M12                                                    01368
M13      DC    CL14'OBSERVATIONS',CL5'AVG',CL5'MIN',CL5'MAX'            01369
M13L     EQU   *-M13                                                    01370
M14      DC    3X'4020212040'                                           01371
M14L     EQU   *-M14                                                    01372
WR200    DC    C'SAMPLING ='                                            01373
WR201    DC    X'40206B2020206B202120',C' ACTUAL SAMPLES OUT OF'        01374
WR202    DC    X'40206B2020206B202120'                                  01375
         DC    C' POSSIBLE SAMPLES FOR TIME PERIOD'                     01376
WR200A   EQU   *-WR200                                                  01377
WR200B   EQU   LINE+WR201-WR200                                         01378
WR200C   EQU   LINE+WR202-WR200                                         01379
WORK     DC    D'0'                                                     01380
TODSEC   DC    F'0'                                                     01381
BGNTME   DC    F'0'                                                     01382
ENDTME   DC    F'0'                                                     01383
$SIZE    DC    A(10*1024,200*1024)  RANGE FOR V-GETMAIN                 01384
GOTTENA  DC    A(0)         ADDR OF GETMAINED MEMORY                    01385
GOTTENL  DC    A(0)         LENGTH OF GETMAINED MEMORY                  01386
LOSTDATA DC    F'0'                                                     01387
NEXTFREE DC    A(0)      POINTER TO NEXT FREE BLOCK                     01388
TOPCORE  DC    A(0)      TOP OF GETMAINED AREA                          01389
LASTDEV  DC    A(DEVTBLND)     END OF DEVICE TABLES                     01390
THISCC   DC    H'0'                                                     01391
LASTCC   DC    H'0'                                                     01392
UNITINCR DC    H'0'                                                     01393
UNITNAME DC    CL3' '                                                   01394
TIMRTCB  DC    A(0)                                                     01395
TIMRECB  DC    F'0'                                                     01396
TIMRECB2 DC    F'0'                                                     01397
TIMRNAME DC    CL8'*TIMER'                                              01398
GATHDATA DC    F'0'                                                     01399
FLAGS    DC    X'00'                                                    01400
GFAIL    EQU   X'80'                                                    01401
HEXTBL   DC    C'0123456789ABCDEF'                                      01402
MSGEND   DC    C'** END OF SEEKMON OUTPUT **'                           01403
FEBTAB   DC    AL1(28,28,28,29)                                         01404
DAYTAB   DC    C'MONTUEWEDTHUFRISATSUN'                                 01405
MONTAB   DC    H'31',CL4'JAN'                                           01406
FEB      DC    H'28',CL4'FEB'                                           01407
         DC    H'31',CL4'MAR'                                           01408
         DC    H'30',CL4'APR',H'31',CL4'MAY',H'30',CL4'JUN'             01409
         DC    H'31',CL4'JUL',H'31',CL4'AUG',H'30',CL4'SEP'             01410
         DC    H'31',CL4'OCT',H'30',CL4'NOV',H'32767',CL4'DEC'          01411
ZEROCORE XC    0(*-*,R1),0(R1)                                          01412
SAMPLES  DC    F'0'                                                     01413
SAMPLET  DC    F'0'                                                     01414
ACSCBCIB DC    A(0)                                                     01415
ACSCBECB DC    A(0)                                                     01416
SECONDS  DC    F'0'                                                     01417
PERIOD   DC    F'0'                                                     01418
CURRENT  DC    F'0'                                                     01419
SAVEREG  DC    F'0'                                                     01420
SYSPRINT DCB   DSORG=PS,MACRF=(PM),DDNAME=SYSPRINT,LRECL=133,          +01421
               RECFM=FBA,EXLST=EXLST,BUFNO=1                            01422
PGMSIZE  EQU   *-SEEKMON                                                01423
         EJECT                                                          01424
*---------------------------------------------------------------------- 01425
*   THE FOLLOWING AREAS DO NOT HAVE TO BE ADDRESSABLE BY BASE1 OR BASE2 01426
*                                                                       01427
SEEKMON0 CSECT ,                                                        01428
*                                                                       01429
DEVTBL   DC    0F'0',64XL(DEVICEL)'0'   DEVICE ENTRY TABLE              01430
DEVTBLND EQU   *                                                        01431
DEVTBLEN EQU   *-DEVTBL                                                 01432
*                                                                       01433
*---------------------------------------------------------------------- 01434
*  FOLLOWING ARE DISTRIBUTION TABLE VALUES.                             01435
*                                                                       01436
HIVALUE  EQU   X'7FFFFF'                                                01437
*                                                                       01438
*  EACH TABLE CAN CONSIST OF UP TO 40 VALUES - THE LAST VALUE           01439
*  MUST BE 'HIVALUE'.                                                   01440
*---------------------------------------------------------------------- 01441
*                                                                       01442
*   FOR COUNT DISTRIBUTIONS                                             01443
DISTCNT  DC    A(00,01,02,03,04,05,06,07,08,09)                         01444
         DC    A(10,11,12,13,14,15,20,25,30,40)                         01445
         DC    A(50,60,70,80,90,125,150,175,HIVALUE)                    01446
*   DEVICE 'CYL/TRK' DISTRIBUTIONS                                      01447
DISTXXXX DC    A(0,HIVALUE)    DUMMY TABLE                              01448
DIST3330 DC    A(010,020,030,040,050,060,070,080,090,100)               01449
         DC    A(110,120,130,140,150,160,170,180,190,200)               01450
         DC    A(210,220,230,240,250,260,270,280,290,300)               01451
         DC    A(310,320,330,340,350,360,370,380,390,HIVALUE)           01452
DIST3331 DC    A(020,040,060,080,100,120,140,160,180,200)               01453
         DC    A(220,240,260,280,300,320,340,360,380,400)               01454
         DC    A(420,440,460,480,500,520,540,560,580,600)               01455
         DC    A(620,640,660,680,700,720,740,760,780,HIVALUE)           01456
DIST2314 DC    A(005,010,015,020,025,030,035,040,045,050)               01457
         DC    A(055,060,065,070,075,080,085,090,095,100)               01458
         DC    A(105,110,115,120,125,130,135,140,145,150)               01459
         DC    A(155,160,165,170,175,180,185,190,195,HIVALUE)           01460
DIST3350 DC    A(014,028,042,056,070,084,098,112,126,140)               01461
         DC    A(154,168,182,196,210,224,238,252,266,280)               01462
         DC    A(294,308,322,336,350,364,378,392,406,420)               01463
         DC    A(434,448,462,476,490,504,518,532,546,HIVALUE)           01464
DIST3340 DC    A(017,034,051,068,085,102,119,136,153,170)               01465
         DC    A(187,204,221,238,255,272,289,306,323,340)               01466
         DC    A(357,374,391,408,425,442,459,476,493,510)               01467
         DC    A(527,544,561,578,595,612,629,646,663,HIVALUE)           01468
DIST3375 DC    A(024,048,072,096,120,144,168,192,216,240)               01469
         DC    A(264,288,312,336,360,384,408,432,456,480)               01470
         DC    A(504,528,552,576,600,624,648,672,696,720)               01471
         DC    A(744,768,792,816,840,864,888,912,936,HIVALUE)           01472
DIST3380 DC    A(022,044,066,088,110,132,154,176,198,220)               01473
         DC    A(242,264,286,308,330,352,374,396,418,440)               01474
         DC    A(462,484,506,528,550,572,594,616,638,660)               01475
         DC    A(682,704,726,748,770,792,814,836,858,HIVALUE)           01476
DIST2311 EQU   DIST2314                                                 01477
*                                                                       01478
*    SYSPRINT DCB EXIT                                                  01479
EXLST    DC    0F'0',X'85',AL3(DCBEXIT)                                 01480
         USING DCBEXIT,R15                                              01481
         USING IHADCB,R1                                                01482
DCBEXIT  LH    R3,DCBBLKSI                                              01483
         LTR   R3,R3                                                    01484
         BNZ   *+8                                                      01485
         LA    R3,1995       DEFAULT                                    01486
         XR    R2,R2                                                    01487
         LH    R4,DCBLRECL                                              01488
         DR    R2,R4                                                    01489
         MH    R3,DCBLRECL                                              01490
         STH   R3,DCBBLKSI                                              01491
         BR    R14                                                      01492
         DROP  R1,R15                                                   01493
*                                                                       01494
*                                                                       01495
*   SUBTASK FOR TIMING SEEKMON EXECUTION PERIOD                         01496
TIMRTASK BALR  R2,0                                                     01497
         USING *,R2                                                     01498
         L     R1,TIMRTVL                                               01499
         STIMER REAL,TIMREXIT,BINTVL=(1)                                01500
         WAIT  1,ECBLIST=TIMRWAIT                                       01501
         TM    TIMRECBX,X'40'                                           01502
         BO    TIMRDONE                                                 01503
         TTIMER CANCEL                                                  01504
TIMRDONE XR    R15,R15                                                  01505
         SVC   3                                                        01506
TIMREXIT SAVE  (14,12)                                                  01507
         BALR  R3,0                                                     01508
         USING *,R3                                                     01509
         POST  TIMRECBX                                                 01510
         RETURN (14,12),,RC=0                                           01511
TIMRECBX DC    F'0'                                                     01512
TIMRWAIT DC    A(TIMRECBX),X'80',AL3(TIMRECB2)                          01513
TIMRTVL  DC    A(PERIOD)                                                01514
*                                                                       01515
PGMSIZE0 EQU   *-SEEKMON0                                               01516
  EJECT ,                                                               01517
CIB      DSECT ,                                                        01518
         IEZCIB                                                         01519
CVT      DSECT ,                                                        01520
         CVT                                                            01521
UCB      DSECT ,                                                        01522
         IEFUCBOB                                                       01523
         PRINT NOGEN                                                    01524
         DCBD  DSORG=(QS),DEVD=(DA)                                     01525
*                                                                       01526
         END   SEEKMON                                                  01527
