//* ********************************************************
//* *  INSTALL THE 'TAPEMAP'  PROGRAM                      *
//* ********************************************************
//TAPEMAP  EXEC ASMHCL,COND=(0,NE),
//         PARM.ASM='OBJECT,NODECK,TERM,ALIGN,NOLIST',
//         PARM.LKED='LIST,MAP'
//SYSTERM  DD SYSOUT=*
//SYSIN    DD DSN=SHARE.SOURCE(TAPEMAP),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.LOAD,UNIT=,DISP=SHR,SPACE=
//LKED.SYSIN DD *
 SETCODE AC(1)
 NAME TAPEMAP(R)
/*
