         PRINT ON,NOGEN
CAPXTRN  DFHMSD TYPE=MAP,LANG=ASM,MODE=INOUT,STORAGE=AUTO,SUFFIX=
         TITLE 'Parameters for CSQCAPX          '
CAPXTRN  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR),   *
               COLUMN=1,LINE=1,DATA=FIELD,TIOAPFX=YES,OBFMT=NO
* LIT1                            LIT1
LIT1     DFHMDF POS=(1,1),LENGTH=4,INITIAL='Date',ATTRB=(PROT,NORM),   *
               COLOR=TURQUOISE
* DATE                            DATE
DATE     DFHMDF POS=(1,6),LENGTH=10,INITIAL='dd/mm/yyyy',ATTRB=(PROT,BR*
               T),COLOR=YELLOW
         DFHMDF POS=(1,17),LENGTH=1,ATTRB=(PROT,NORM)
* LIT2                            LIT2
LIT2     DFHMDF POS=(1,21),LENGTH=32,                                  *
               INITIAL='Specify Transactions for CSQCAPX',ATTRB=(PROT,N*
               ORM),COLOR=TURQUOISE
         DFHMDF POS=(1,54),LENGTH=1,ATTRB=(PROT,NORM)
* LIT3                            LIT3
LIT3     DFHMDF POS=(1,62),LENGTH=4,INITIAL='Time',ATTRB=(PROT,NORM),  *
               COLOR=TURQUOISE
* TIME                            TIME
TIME     DFHMDF POS=(1,67),LENGTH=8,INITIAL='hh:mm:ss',ATTRB=(PROT,BRT)*
               ,COLOR=YELLOW
         DFHMDF POS=(1,76),LENGTH=1,ATTRB=(PROT,NORM)
* LIT4                            LIT4
LIT4     DFHMDF POS=(2,80),LENGTH=44,                                  *
               INITIAL='Enter the transactions you want to trace  :-', *
               ATTRB=(PROT,NORM),COLOR=TURQUOISE
         DFHMDF POS=(3,45),LENGTH=1,ATTRB=(PROT,NORM)
* TRAN1                           TRAN1
TRAN1    DFHMDF POS=(4,80),LENGTH=4,ATTRB=(UNPROT,NORM,IC,FSET),       *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN2                           TRAN2
TRAN2    DFHMDF POS=(5,5),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),           *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN3                           TRAN3
TRAN3    DFHMDF POS=(5,10),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN4                           TRAN4
TRAN4    DFHMDF POS=(5,15),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN5                           TRAN5
TRAN5    DFHMDF POS=(5,20),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN6                           TRAN6
TRAN6    DFHMDF POS=(5,25),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN7                           TRAN7
TRAN7    DFHMDF POS=(5,30),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN8                           TRAN8
TRAN8    DFHMDF POS=(5,35),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN9                           TRAN9
TRAN9    DFHMDF POS=(5,40),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN10                          TRAN10
TRAN10   DFHMDF POS=(5,45),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN11                          TRAN11
TRAN11   DFHMDF POS=(5,50),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN12                          TRAN12
TRAN12   DFHMDF POS=(5,55),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN13                          TRAN13
TRAN13   DFHMDF POS=(5,60),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN14                          TRAN14
TRAN14   DFHMDF POS=(5,65),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN15                          TRAN15
TRAN15   DFHMDF POS=(5,70),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
* TRAN16                          TRAN16
TRAN16   DFHMDF POS=(5,75),LENGTH=4,ATTRB=(UNPROT,NORM,FSET),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
         DFHMDF POS=(5,80),LENGTH=0,ATTRB=(PROT,NORM)
* LIT6                            LIT6
LIT6     DFHMDF POS=(23,80),LENGTH=6,INITIAL='KEYS :',ATTRB=(PROT,NORM)*
               ,COLOR=TURQUOISE
* LIT7                            LIT7
LIT7     DFHMDF POS=(24,7),LENGTH=5,INITIAL='ENTER',ATTRB=(PROT,BRT),  *
               COLOR=YELLOW
* LIT8                            LIT8
LIT8     DFHMDF POS=(24,13),LENGTH=7,INITIAL='PROCESS',ATTRB=(PROT,NORM*
               ),COLOR=TURQUOISE
         DFHMDF POS=(24,21),LENGTH=1,ATTRB=(PROT,NORM)
* LIT9                            LIT9
LIT9     DFHMDF POS=(24,23),LENGTH=6,INITIAL='PF3/15',ATTRB=(PROT,BRT),*
               COLOR=YELLOW
* LIT10                           LIT10
LIT10    DFHMDF POS=(24,30),LENGTH=12,INITIAL='SAVE AND END',          *
               ATTRB=(PROT,NORM),COLOR=TURQUOISE
         DFHMDF POS=(24,43),LENGTH=1,ATTRB=(PROT,NORM)
* LIT11                           LIT11
LIT11    DFHMDF POS=(24,45),LENGTH=7,INITIAL='PF12/24',ATTRB=(PROT,BRT)*
               ,COLOR=YELLOW
* LIT12                           LIT12
LIT12    DFHMDF POS=(24,53),LENGTH=13,INITIAL='PURGE AND END',         *
               ATTRB=(PROT,NORM),COLOR=TURQUOISE
         DFHMDF POS=(24,67),LENGTH=1,ATTRB=(PROT,NORM)
         DFHMSD TYPE=FINAL
         END
