DEFINE PROGRAM(CAPXPRNT) GROUP(MQEXIT)
       DESCRIPTION(MQ API CROSSING EXIT PRINT PROGRAM)
       LANGUAGE(ASSEMBLER) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(CICS) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) JVMPROFILE(DFHJVMPR) HOTPOOL(NO)
DEFINE PROGRAM(CAPXTRAN) GROUP(MQEXIT)
       DESCRIPTION(MQ API CROSSING EXIT TRANSACTION SELECTION)
       LANGUAGE(ASSEMBLER) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(CICS) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) JVMPROFILE(DFHJVMPR) HOTPOOL(NO)
DEFINE TRANSACTION(MQTR) GROUP(MQEXIT)
       DESCRIPTION(MQ API CROSSING EXIT PRINT TRANSACTION)
       PROGRAM(CAPXPRNT) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(ANY) TASKDATAKEY(CICS) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(NO) TPURGE(NO) DUMP(YES) TRACE(YES)
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE TRANSACTION(MQTT) GROUP(MQEXIT)
       DESCRIPTION(MQ API CROSSING EXIT TRANSACTION SELECTION)
       PROGRAM(CAPXTRAN) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(ANY) TASKDATAKEY(CICS) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(NO) TPURGE(NO) DUMP(YES) TRACE(YES)
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE TDQUEUE(MQTR) GROUP(MQEXIT)
       DESCRIPTION(MQ API CROSSING EXIT PRINT QUEUE)
       TYPE(EXTRA) DATABUFFERS(255) DDNAME(MQTRACE) SYSOUTCLASS(0)
       ERROROPTION(IGNORE) OPENTIME(INITIAL) TYPEFILE(OUTPUT)
       RECORDSIZE(132) BLOCKSIZE(136) RECORDFORMAT(VARIABLE)
       BLOCKFORMAT(UNBLOCKED) DISPOSITION(MOD)
DEFINE TDQUEUE(MQTT) GROUP(MQEXIT)
       DESCRIPTION(MQ API CROSSING EXIT TRIGGER QUEUE)
       TYPE(INTRA) ATIFACILITY(FILE) RECOVSTATUS(NO) TRANSID(MQTR)
       TRIGGERLEVEL(1)
