* COPIED FROM FILE 078 OF SHARE MVS GROUP MODS TAPE, V29 (04/84)
*          DATA SET AM010700   AT LEVEL 003 AS OF 05/23/76
         MACRO
         ELSE  &OPT
         GBLA  &ELSE(10),&SEQ(10),&LEVEL,&LAB
         GBLA  &ELSEIF(10)
.* AUTHOR.   DON HIGGINS.
.* DATE.     03/27/74.
.* REMARKS.  MACRO TO ALLOW STRUCTURED PROGRAMMING USING
.*           IF, THEN, ELSE, AND DO UP TO TEN LEVELS DEEP
.*           AND NO BRANCH INSTRUCTIONS. SEE IF MACRO.
.* REV1 05/23/76 DSH - SUPPORT ELSEIF
         AIF   (&LEVEL EQ 0).ERR0
         AIF   (T'&OPT EQ 'O').BEGIN
         AIF   ('&OPT' EQ 'BEGIN').BEGIN
         AIF   ('&OPT' EQ 'END').END
         AIF   ('&OPT' EQ 'CONTINUE').CONT
         MNOTE 8,'ELSE - INVALID OPERAND'
         AGO   .EXIT
.BEGIN   ANOP  ,
         AIF   (&SEQ(&LEVEL) GT 3).ERR1
&LAB     SETA  &LAB+1
         B     IF0&LAB
IF0&ELSE(&LEVEL) EQU *
&ELSE(&LEVEL) SETA &LAB
&SEQ(&LEVEL) SETA 4
         AGO .EXIT
.END     ANOP  ,
         AIF   (&SEQ(&LEVEL) NE 4).ERR2
.DEQUE   ANOP  ,
IF0&ELSE(&LEVEL) EQU *
&LEVEL   SETA &LEVEL-1
         AIF   (&ELSEIF(&LEVEL+1) EQ 1).DEQUE
         AGO   .EXIT
.CONT    ANOP  ,
         AIF   (&SEQ(&LEVEL) GT 3).ERR3
         AGO   .DEQUE
.ERR0    MNOTE 8,'ELSE - MISSING IF'
         AGO   .EXIT
.ERR1    MNOTE 8,'ELSE BEGIN - OUT OF SEQUENCE'
         AGO   .EXIT
.ERR2    MNOTE 8,'ELSE END - OUT OF SEQUENCE'
         AGO   .EXIT
.ERR3    MNOTE 8,'ELSE CONTINUE - OUT OF SEQUENCE'
.EXIT    ANOP  ,
         MEND  ,
