*23456789012345678901234567890123456789012345678901234567890123456789012
CPRDTAPE  CSECT                                                         CP000010
* EXCP-LEVEL MAGNETIC TAPE READ/WRITE/CONTROL ROUTINES                  CP000020
          PRINT ON,GEN                                                  CP000030
* SUBROUTINE ENTRY POINTS AND INPUT/OUTPUT PARAMETERS                   CP000040
*                                                                       CP000050
* CPRDOPEN - TO OPEN THE TAPE DATA SET                                  CP000060
*  CPROPN IS AN ALTERNATE ENTRY POINT NAME FOR THIS OPERATION           CP000070
*   ANSWER (,DDNAME) INPUT TO ROUTINE. DDNAME DEFAULTS TO 'READIN  '    CP000080
*    IF (,DDNAME) IS OMITTED. IF SUPPLIED, IT MUST BE A CHAR STRING     CP000090
*    OF EIGHT BYTES, THE FIRST ALPHABETIC; MUST MATCH THE DDNAME        CP000100
*    FOR THE JCL STATEMENT FOR THE INPUT TAPE.                          CP000110
*                                                                       CP000120
* CPRDCLS -  TO CLOSE THE DATA SET. NO PARMS.                           CP000130
*  CPRCLS IS AN ALTERNATE ENTRY POINT NAME FOR CPRDCLS.                 CP000140
*                                                                       CP000150
* CPRD -     READ ONE PHYSICAL BLOCK. ANSWER, DATA, COUNT.              CP000160
*                                                                       CP000170
* CPRDB -    READ BACKWARDS. ANSWER, DATA, COUNT.                       CP000180
*                                                                       CP000190
* CPSKRD -   READ A BLOCK, SKIPPING SOME BYTES AT FIRST.                CP000200
*             ANSWER,DATA,COUNT.                                        CP000210
*                                                                       CP000220
* CPSKBR -   BACKWARD READ AFTER SKIP FROM END OF RECORD.               CP000230
*             ANSWER, DATA, COUNT.                                      CP000240
*                                                                       CP000250
* CPFSF -    FORWARD SPACE ONE FILE. ANSWER.                            CP000260
*                                                                       CP000270
* CPBSF -    BACKSPACE ONE FILE MARK. ANSWER.                           CP000280
*                                                                       CP000290
* CPFSB -    SKIP FORWARD ONE PHYSICAL BLOCK. ANSWER.                   CP000300
*                                                                       CP000310
* CPBSB -    BACKWARD SPACE ONE PHYSICAL BLOCK. ANSWER.                 CP000320
*                                                                       CP000330
* CPREW -    REWIND THE TAPE TO BOT. ANSWER.                            CP000340
*                                                                       CP000350
* CPWTOPEN - OPEN THE OUTPUT TAPE DATA SET.                             CP000360
*  CPWOPN IS AN ALTERNATE ENTRY POINT NAME.                             CP000370
*           ANSWER (,DDNAME). DDNAME DEFAULTS TO 'SYSTAPE ' IF OMITTED. CP000380
*                                                                       CP000390
* CPWT -    WRITE ONE PHYSICAL BLOCK. ANSWER, DATA, COUNT.              CP000400
*                                                                       CP000410
* CPWTM -   WRITE A TAPE MARK. ANSWER.                                  CP000420
*                                                                       CP000430
* CPWERG -  ERASE GAP (NOMINALLY 3.5 INCHES). ANSWER.                   CP000440
*                                                                       CP000450
* CPERAS -  DATA SECURITY ERASE TO EOT MARKER. ANSWER.                  CP000460
*                                                                       CP000470
* CPWREW -  REWIND OUTPUT MAG TAPE VOLUME. ANSWER.                      CP000480
*                                                                       CP000490
* CPWRED -  READ ONE BLOCK FROM OUTPUT TAPE VOLUME. ANSWER, DATA,COUNT. CP000500
*                                                                       CP000510
* CPWTCLS - CLOSE THE OUTPUT TAPE DATA SET.                             CP000520
*  CPWCLS IS AN ALTERNATE ENTRY POINT NAME. NO PARMS.                   CP000530
*                                                                       CP000540
* THE PARAMETER "ANSWER" IS FIVE WORDS, "COUNT(S)" ONE TO THREE WORDS.  CP000550
* FIRST "COUNT" IS THE NUMBER OF BYTES TO READ, SECOND WORD IS SKIP     CP000560
* VALUE, IF ANY, AND THIRD WORD IS NUMBER TO READ AFTER A SKIP.         CP000570
* "DATA" IS THE ADDRESS OF A CALLER-SUPPLIED AREA FOR THE DATA TO BE    CP000580
* READ OR WRITTEN. SINCE THE BACKWARDS READS PLACE THE DATA IN STORAGE  CP000590
* IN DESCENDING ADDRESS ORDER, THE DATA ADDRESS FOR THOSE CALLS SHOULD  CP000600
* BE THE END, NOT THE BEGINNING, OF THE BUFFER IN MEMORY.               CP000610
* THE LIMIT FOR "COUNT" FOR DATA TRANSFERS IS 9 CCW'S OF 65K EACH,      CP000620
* OR A TOTAL OF 589815 BYTES FOR ANY COMBINATION OF READS AND SKIPS.    CP000630
* (BYTES SKIPPED PLUS READ CAN'T BE MORE THAN 9*65K.)                   CP000640
*                                                                       CP000650
* THE FIRST WORD IN THE ANSWER ARRAY IS A PARTIAL COMPLETION INDICATOR  CP000660
* WITH THE FOLLOWING MEANINGS:                                          CP000670
*     0 = REQUEST WAS APPARENTLY SUCCESSFUL                             CP000680
*    -1 = EOF ENCOUNTERED ON READ, EOT ENCOUNTERED ON WRITE.            CP000690
*    -2 = DATA CHECK.                                                   CP000700
*    -3 = HARDWARE FAILURE.                                             CP000710
* THE THIRD WORD IS A COUNT OF BYTES ACTUALLY READ FROM TAPE.           CP000720
* THE FOURTH AND FIFTH WORDS CONTAIN THE UNIT STATUS BYTES AND SENSE    CP000730
* BYTES RETURNED BY THE CHANNEL AND IOS IN CASE OF ERRORS.              CP000740
* A PLUS ONE IN THE FIRST WORD MEANS THE DCB COULD NOT BE OPENED        CP000750
* FOR WHATEVER DDNAME FOR THE TAPE WAS REQUESTED.                       CP000760
* THE ROUTINES WILL ABEND IF THINGS LOOK REALLY BAD WITH CODES:         CP000770
*   44 = UNDECIPHERABLE ERROR STATUS ON READ.                           CP000780
*   46 = MORE THAN 9 CCW'S REQUIRED FOR READ.                           CP000790
*   56 = MORE THAN 9 CCW'S REQUIRED FOR READ BACKWARD.                  CP000800
*   66 = MORE THAN 9 CCW'S REQUIRED FOR SKIP/READ COMBINATION.          CP000810
*  144 = UNDECIPHERABLE ERROR STATUS ON WRITE.                          CP000820
*  146 = MORE THAN 9 CCW'S REQUIRED FOR WRITE.                          CP000830
*                                                                       CP000840
* NOTA BENE:                                                            CP000850
*  THIS ROUTINE CONSTRUCTS FORMAT 0 CCW'S ONLY, AND USES AN OS IOB;     CP000860
*  IT WILL NOT WORK UNDER ESA AS DEFINED BY THE PRINCIPLES OF OPERATION CP000870
*  MANUAL FOR MACHINES RUNNING IN THAT MODE. IF IT IS TO BE USED UNDER  CP000880
*  ESA, THE APPROPRIATE CONTROL BLOCKS MUST BE USED AND FORMAT 1 CCW'S  CP000890
*  MUST BE CONSTRUCTED FOR ANY I/O TO DATA AREAS ABOVE THE 16M MARK.    CP000900
*                                                                       CP000910
         ENTRY CPRDOPEN,CPRDCLS,CPFSF,CPBSF,CPRD,CPRDB,CPREW            CP000920
         ENTRY CPROPN,CPRCLS                                            CP000930
         ENTRY CPFSB,CPBSB,CPSKRD,CPSKBR                                CP000940
*                                                                       CP000950
         ENTRY CPWTOPN,CPWOPN,CPWTCLS,CPWCLS                            CP000960
         ENTRY CPWT,CPWTM,CPWERG,CPERAS,CPWREW,CPWRED                   CP000970
*                                                                       CP000980
CPRD     STM   14,12,12(13)   READ ONE PHYSICAL BLK, FORWARD DIRECTION  CP000990
         LR    12,15         DO CHAIN OF SA'S, SET GPR12 AS BASE ALWAYS CP001000
         USING CPRD,12                                                  CP001010
         USING ANSWER,11                                                CP001020
         USING IHADCB,9                                                 CP001030
         BAL   15,COMENTRY  PERFORM ALL COMMON SETUP/ENTRY FUNCTIONS    CP001040
         LM    2,3,4(1)         2=@DATA, 3=@COUNT                       CP001050
         LA    2,(,2)  ZERO HIGH ORDER BYTE FOR FORMAT 0 CCW ADDR FIELD CP001060
         L     4,ACCWD                                                  CP001070
         ST    4,ACCW2                                                  CP001080
         LA    4,1(,0)      SET TO INCR. BLOCK COUNT IN IOB FOR O/S     CP001090
         STH   4,IOBRDBCI                                               CP001100
         LA    4,9(,0)      COUNTER FOR CCW'S TO BE BUILT               CP001110
         MVI   IOBRD,X'02'  NOT CD OR CC - NO RELATED CP'S ASSUMED      CP001120
         L     3,0(,3)      3=VAL(COUNT) - BYTES TO BE READ FROM TAPE   CP001130
CPRDLOOP CR    3,5          MORE THAN 65K TO READ FROM TAPE?            CP001140
         BC    12,CPRDLAST      LAST CCW TO BE CONSTRUCTED              CP001150
         OI    IOBRD,X'80'      TURN ON DATA CHAINING IN IOB            CP001160
         L     8,RDN            1ST HALF OF A CCW TO READ 65K           CP001170
         OR    8,2              CHAIN ADDRESS PORTION OF CCW            CP001180
         ST    8,0(,6)          INTO CCW ARRAY                          CP001190
         L     8,RDN+4          BUILD 2ND HALF OF CCW                   CP001200
         ST    8,4(,6)          AND IT TOO TO THE CCW ARRAY             CP001210
         SR    3,5              DECREMENT REQUESTED BYTE COUNT          CP001220
         LA    6,8(,6)          INCREMENT CP ARRAY POINTER              CP001230
         AR    2,5              INCREMENT DATA POINTER                  CP001240
         BCT   4,CPRDLOOP       BUILD ANOTHER IF POSSIBLE               CP001250
         ABEND 46,DUMP,STEP     TRIED TO BUILD TOO MANY CCW'S           CP001260
*                                                                       CP001270
CPRDLAST L     8,RDF            LAST CCW TO BUILD FOR READ              CP001280
         OR    8,2                                                      CP001290
         ST    8,0(,6)          @DATA TO THAT CCW                       CP001300
         L     8,RDF+4          SET TO BUILD 2ND HALF OF CCW            CP001310
         OR    8,3              VAL(COUNT) INTO LAST CCW                CP001320
         ST    8,4(,6)                                                  CP001330
         LA    8,10(,0)         CALC HOW MANY CCW'S                     CP001340
         SR    8,4                                                      CP001350
         ST    8,NUMCCW                                                 CP001360
         BAL   10,EXCPR         GO EXECUTE THE CP(S) BUILT              CP001370
*                                                                       CP001380
CPRDLST1 C     1,FM2       IF HW FAILURE, CLEAR TRANSFERRED COUNT VALUE CP001390
         BC    4,CLEAR                                                  CP001400
         L     2,IOBRDCSW       PICK UP PART OF CHANNEL STATUS WORD     CP001410
         LA    2,0(,2)          ZERO HIGH-ORDER BYTE                    CP001420
         S     2,F8             POINT TO LAST CCW USED                  CP001430
CPRDLST  LR    3,2                                                      CP001440
         L     1,IOBRDCSW+4     GET CSW FROM LAST CCW USED              CP001450
         N     1,MASK           ZERO ALL BUT BYTE COUNT BITS            CP001460
         LA    6,CP             POINT TO BEGINNING OF CCW CHAIN         CP001470
         SR    3,6                                                      CP001480
         SRA   3,3(0)           EXECUTED CCW'S - 1                      CP001490
         MR    4,3              R5 = BYTES EXCEPT LAST CCW USED         CP001500
         L     4,4(,2)          BYTE COUNT FROM PARTIALLY USED CSW      CP001510
         N     4,MASK           BYTES POSSIBLE IN LAST CCW              CP001520
         SR    4,1                                                      CP001530
         AR    4,5                                                      CP001540
         ST    4,APARTIAL       FINAL COUNT OF BYTES READ               CP001550
         LA    4,1(,0)                                                  CP001560
         ST    4,APART                                                  CP001570
*                                                                       CP001580
RETURN   L     13,SAVERD+4                                              CP001590
         LM    14,12,12(13)     STANDARD EXIT TO CALLER                 CP001600
         MVI   12(13),X'FF'                                             CP001610
         BCR   15,14                                                    CP001620
         SPACE 3                                                        CP001630
CPSKRD   STM   14,12,12(13)     FORWARD READ AFTER SKIP ROUTINE         CP001640
         USING CPSKRD,15                                                CP001650
         L     12,ACPRD         GET STANDARD BASE SET                   CP001660
         DROP  15                                                       CP001670
         BAL   15,COMENTRY      PERFORM STANDARD SA CHAIN, ETC.         CP001680
         LM    2,3,4(1)         @DATA, @3-WORD COUNT ARRAY FROM CALLER  CP001690
         LA    2,0(,2)          MAKE 24-BIT ADDR. VALUE                 CP001700
         LA    4,1                                                      CP001710
         STH   4,IOBRDBCI       BLOCK COUNT INCREMENT                   CP001720
         LA    4,10             MAX # CCW'S (9 IF NOT SKIPPING)         CP001730
         MVI   IOBRD,X'82'      ALWAYS HAVE DATA CHAINING IF SKIPPING   CP001740
         L     7,4(,3)          VAL(SKIP COUNT)                         CP001750
CPSKLP1  CR    7,5              MORE THAN 65K?                          CP001760
         BC    12,CPSKLAST      NO, BUILD LAST CCW                      CP001770
         L     8,RDN            START WITH SKELETON ORDINARY READ       CP001780
         OR    8,2              R8:=@DATA SAME CELL                     CP001790
         ST    8,0(,6)                                                  CP001800
         L     8,RDN+4          MAKE R8:=FLAGS, 65K COUNT               CP001810
         ST    8,4(,6)                                                  CP001820
         MVI   4(6),X'B0'       SET CD, SLI AND SKIP FLAGS IN CCW       CP001830
         SR    7,5              SKIP COUNT := SKIP COUNT - 65K          CP001840
         LA    6,8(,6)          CP PTR := CP PTR + 8                    CP001850
         BCT   4,CPSKLP1        TRY TO BUILD ANOTHER CCW IN CHAIN       CP001860
CPSKBABE ABEND 66,DUMP,STEP     TOO MANY CCW'S NEEDED                   CP001870
CPSKLAST L     8,RDF            LAST FRAGMENT TO SKIP                   CP001880
         OR    8,2              R8 := @DATA (SAME CELL)                 CP001890
         ST    8,0(,6)                                                  CP001900
         L     8,RDF+4                                                  CP001910
         OR    8,7              R8 := FLAGS, FRAG COUNT                 CP001920
         ST    8,4(,6)                                                  CP001930
         MVI   4(6),X'BO'       SET ALL THOSE FLAGS ALSO                CP001940
         L     3,8(,3)          VALUE OF COUNT TO READ AFTER SKIP       CP001950
         LA    6,8(,6)          NEXT PLACE IN CCW LIST                  CP001970
         B     CPRDLOOP        & GO TREAT AS STRAIGHT READ FROM HERE ON CP001980
*                                                                       CP001990
         SPACE 3                                                        CP002000
*                                                                       CP002010
CPRDB   STM    14,12,12(13)     READ BACKWARDS FUNCTION                 CP002020
        USING  CPRDB,15                                                 CP002030
        L      12,ACPRD         GET STANDARD BASE                       CP002040
        DROP   15                                                       CP002050
        BAL    15,COMENTRY      PERFORM STANDARD SA CHAIN, ETC.         CP002060
        LM     2,3,4(1)         @DATA, @COUNT                           CP002070
        LA     2,0(,2)          FORM 24-BIT ADDRESS VALUE               CP002080
        L      4,ACCWD                                                  CP002090
        ST     4,ACCW2                                                  CP002100
        LA     4,1(,0)                                                  CP002110
        STH    4,IOBRDBCI       SET TO INCREMENT BLOCK COUNT            CP002120
        LA     4,9(,0)          MAX # CCW'S TO BUILD                    CP002130
        MVI    IOBRD,X'02'      NOT CD OR CC - NO RELATED CHAN PROGS    CP002140
        L      3,0(,3)          VALUE(COUNT) BYTES TO READ              CP002150
BRDLOOP CR     3,5              ARE WE FIXED TO READ ENOUGH?            CP002160
        BC     12,BRDLAST       BIF CAN GO CONSTRUCT LAST CCW           CP002170
        OI     IOBRD,X'80'      TURN ON CHAINING BIT IN IOB             CP002180
        L      8,RDB            GET BACKWARD, CHAINING READ CCW         CP002190
        OR     8,2              MAKE DATA ADDRESS                       CP002200
        ST     8,0(,6)          INTO CCW CHAIN                          CP002210
        L      8,RDB+4                                                  CP002220
        ST     8,4(,6)                                                  CP002230
        SR     3,5              DECREMENT AMOUNT TO READ BY 65K         CP002240
        LA     6,8(,6)          INCR. PTR TO CCW CHAIN AREA             CP002250
        SR     2,5              ADJUST ADDR. OF WHERE TO READ INTO      CP002260
        BCT    4,BRDLOOP         & GO BUILD SOME MORE CCW'S             CP002270
        ABEND  56,DUMP,STEP     TOO MANY CCW'S REQUIRED                 CP002280
*                                                                       CP002290
BRDLAST  L     8,RDBF      LAST OR ONLY CCW TO BUILD INTO CHAIN OF THEM CP002300
         OR    8,2              FIX UP FINAL CCW DATA ADDRESS           CP002310
         ST    8,0(,6)                                                  CP002320
         L     8,RDBF+4         FIX FINAL BYTE COUNT IN THAT CCW        CP002330
         OR    8,3              R8 := FLAGS, FRAG. COUNT                CP002340
         ST    8,4(,6)          PUT INTO CP ARRAY                       CP002350
         LA    8,10(,0)         MAX + 1 #CCW'S                          CP002360
         SR    8,4              CALC MAX USED                           CP002370
         ST    8,NUMCCW                                                 CP002380
         LA    10,CPRDLST1      POINT TO STANDARD RETURN PROCESSOR      CP002390
         B     EXCPR             & GO EXECUTE THE CP(S)                 CP002400
         SPACE 3                                                        CP002410
SPSKBR   STM   14,12,12(13)     BACKWARD SKIP AND READ FUNCTION         CP002420
         USING CPSKBR,15                                                CP002430
         L     12,ACPRD                                                 CP002440
         DROP  15                                                       CP002450
         BAL   15,COMENTRY      PERFORM STANDARD CHAIN SA'S, ETC.       CP002460
         LM    2,3,4(1)         @DATA, @3-WORD COUNT ARRAY              CP002470
         LA    2,0(,2)          24-BIT ADDRESS FOR CCW ADDRESS FIELD    CP002480
         LA    4,1                                                      CP002490
         STH   4,IOBRDBCI       BLOCK COUNT INCREMENT                   CP002500
         LA    4,10             MAX # CCW'S IF SKIPPING                 CP002510
         MVI   IOBRD,X'82'      ALWAYS CHAIN IF SKIPPING                CP002520
         L     7,4(,3)          VALUE OF SKIP COUNT                     CP002530
CPSKBL1  CR    7,5              MORE THAN 65K?                          CP002540
         BC    12,CPSKBLST      NO, JUST GO BUILD LAST IN SKIP CHAIN    CP002550
         L     8,RDB                                                    CP002560
         OR    8,2                                                      CP002570
         ST    8,0(,6)          FIRST HALF OF A CCW BUILT               CP002580
         L     8,RDB+4                                                  CP002590
         ST    8,4(,6)          SKIP 65K WITH EACH CCW                  CP002600
         MVI   4(6),X'B0'       CD, SLI, SKIP FLAGS GET TURNED ON       CP002610
         SR    7,5              DECREMENT SKIP VALUE COUNT              CP002620
         LA    6,8(,6)          NEXT IN ARRAY OF CCW'S TO BUILD         CP002630
         BCT   4,CPSKBL1        IF WE CAN                               CP002640
CPSKBRAB ABEND 66,DUMP,STEP     TOO MANY CCW'S REQUIRED                 CP002650
CPSKBLST L     8,RDBF           LAST FRAGMENT OF 65K TO SKIP            CP002660
         OR    8,2                                                      CP002670
         ST    8,0(,6)                                                  CP002680
         L     8,RDBF+4                                                 CP002690
         OR    8,7                                                      CP002700
         ST    8,4(,6)                                                  CP002710
         MVI   4(6),X'B0'       SET CD, SLI, SKIP FLAGS FOR IT TOO      CP002720
         L     3,8(,3)          VALUE OF READ DATA AFTER SKIP COUNT     CP002730
         LA    6,8(,6)          NEXT SPOT IN CP ARRAY                   CP002740
         B     BRDLOOP    AND PROCESS AS ORDINARY BACKWARD READ REQUEST CP002750
*                                                                       CP002760
***** END OF READ FUNCTIONS PORTION OF ROUTINE *****                    CP002770
*                                                                       CP002780
         EJECT                                                          CP002790
CPFSF    STM   14,12,12(13)     FORWARD SPACE FILE FUNCTION             CP002800
         USING CPFSF,15                                                 CP002810
         L     12,ACPRD                                                 CP002820
         DROP  15                                                       CP002830
         BAL   15,COMENTRY      PERFORM STANDARD CHAIN SA'S ETC.        CP002840
         LD    0,FSF            MOVE PROPER FSF CCW VIA FPREGS          CP002850
         STD   0,CP                                                     CP002860
         LA    9,DCBRD          @IHADCB                                 CP002870
         SR    4,4                                                      CP002880
         ST    4,DCBBLKCT       CLEAR BLOCK COUNT IN DCB                CP002890
         STH   4,IOBRDBCI       SAY NO INCREMENT TO BLOCK COUNT IN IOB  CP002900
         MVI   IOBRD,X'02'                                              CP002910
         BAL   10,EXCPR         GO OFF AND ISSUE REAL EXCP-LEVEL STUFF  CP002920
         SPACE 3                                                        CP002930
CLEAR    SR    2,2             COMMON EXIT FOR FILE SPACING, H/W ERRORS CP002940
         ST    2,APARTIAL       SAY NOTHING TRANSFERED                  CP002950
         LA    2,1(,2)                                                  CP002960
         ST    2,APART      SET PARTIAL COMPLETION INDICATOR FOR CALLER CP002970
         B     RETURN                                                   CP002980
         SPACE 3                                                        CP002990
COMENTRY LR    2,13             COMMON ENTRY PROCESOR - CHAIN SA'S      CP003000
         LA    13,SAVERD                                                CP003010
         ST    13,8(,2)                                                 CP003020
         ST    2,SAVERD+4                                               CP003030
         L     11,0(,1)         SET BASE FOR USER'S ANSWER ARRAY        CP003040
         L     5,MAX            COMPARAND REG FOR LIMIT ON CCW COUNTS   CP003050
         LA    6,CP             BASE ALWAYS USED FOR CP ARRAY           CP003060
         BR    15               BACK TO MAINLINE CODE                   CP003070
         SPACE 3                                                        CP003080
CPBSF    STM   14,12,12(13)     BACKSPACE FILE FUNCTION                 CP003090
         USING CPBSF,15                                                 CP003100
         L     12,ACPRD                                                 CP003110
         DROP  15                                                       CP003120
         BAL   15,COMENTRY                                              CP003130
         LD    0,BSF            MOVE CCW USING FPR                      CP003140
         STD   0,CP                                                     CP003150
         LA    9,DCBRD          @IHADCB                                 CP003160
         SR    4,4                                                      CP003170
         ST    4,DCBBLKCT       BLOCK COUNT IN DCB TO ZERO              CP003180
         STH   4,IOBRDBCI       SET NO BLOCK INCREMENT IN IOB           CP003190
         MVI   IOBRD,X'02'  NOT CD OR CC - NO RELATED CHANNEL PROGRAMS  CP003200
         LA    10,CLEAR         COMMON END PROCESS ADDRESS              CP003210
         B     EXCPR              - PERFORM REQUESTED FUNCTION          CP003220
         SPACE 3                                                        CP003230
CPFSB    STM   14,12,12(13)     FORWARD SPACE BLOCK FUNCTION            CP003240
         USING CPFSB,15                                                 CP003250
         L     12,ACPRD                                                 CP003260
         DROP  15                                                       CP003270
         BAL   15,COMENTRY      PERFORM STANDARD CHAIN SA'S, ETC.       CP003280
         LA    4,1(,0)                                                  CP003290
         STH   4,IOBRDBCI       SET BLOCK INCREMENT OF 1 IN IOB         CP003300
         MVI   IOBRD,X'02'      NO RELATED CP'S FLAG TO IOB             CP003310
         LD    0,FSB                                                    CP003320
         STD   0,CP             CHUNK IN THAT CCW                       CP003330
         LA    10,CLEAR         SET FOR COMMON EXIT PROCESSING          CP003340
         B     EXCPR            GO PERFORM FUNCTION                     CP003350
         SPACE 3                                                        CP003360
CPBSB    STM   14,12,12(13)     BACKSPACE ONE BLOCK FUNCTION            CP003370
         USING CPBSB,15                                                 CP003380
         L     12,ACPRD                                                 CP003390
         DROP  15                                                       CP003400
         BAL   15,COMENTRY      PERFORM STANDARD CHAIN SA'S, ETC.       CP003410
         L     4,FM1            GET A NEGATIVE ONE                      CP003420
         STH   4,IOBRDBCI       FOR BLOCK INCREMENT                     CP003430
         MVI   IOBRD,X'02'      SAY NO RELATED CP'S                     CP003440
         LD    0,BSB            MOVE APPROPRIATE CCW TO CP AREA         CP003450
         STD   0,CP                                                     CP003460
         LA    10,CLEAR         COMMON END PROCESSING                   CP003470
         B     EXCPR                                                    CP003480
*                                                                       CP003490
         SPACE 3                                                        CP003500
CPREW    STM   14,12,12(13)                                             CP003510
         USING CPREW,15                                                 CP003520
         L     12,ACPRD                                                 CP003530
         DROP  15                                                       CP003540
         BAL   15,COMENTRY     PERFORM STANDARD HOUSEKEEPING            CP003550
         LA    9,DCBRD         @IHADCB                                  CP003560
         SR    4,4             SET TO CLEAR BLOCK COUNT                 CP003570
         ST    4,DCBBLKCT                                               CP003580
         STH   4,IOBRDBCI      SAY DON'T INCREMENT BLOCK COUNT          CP003590
         MVI   IOBRD,X'02'     SAY NO RELATED CP'S                      CP003600
         LD    0,REW           REWIND TAPE CHANNEL COMMAND              CP003610
         STD   0,CP                                                     CP003620
         LA    10,CLEAR        COMMON END PROCESSING                    CP003630
         B     EXCPR                                                    CP003640
*                                                                       CP003650
         SPACE 3                                                        CP003660
CPRDOPEN STM   14,12,12(13)    OPEN THE INPUT TAPE DCB                  CP003670
CPROPN   EQU   CPRDOPEN        FORTRAN WON'T ALLOW 8 CHARACTER NAMES    CP003680
         USING CPRDOPEN,15                                              CP003690
         L     12,ACPRD                                                 CP003700
         DROP  15                                                       CP003710
         BAL   15,COMENTRY     STANDARD HOUSEKEEPING                    CP003720
         LA    9,DCBRD         @IHADCB                                  CP003730
         OI    DCBIFLG,X'0C'   SET SO DON'T DO ERROR RECOVERY IN IOS    CP003740
         SR    5,5             TO CLEAR DCBBLKCT, AIER                  CP003750
         LTR   11,11           ONLY ONE ITEM IN CALL PARMLIST?          CP003760
         BC    4,DEFAULT       ONLY ONE ARG GIVEN, USE DEFAULT DDNAME   CP003770
         L     2,4(,1)         GET @NAME SUPPLIED FOR DDNAME            CP003780
OPN2     MVC   DCBDDNAM(8),0(2)  MOVE WHICHEVER TO DCB DDNAME FIELD     CP003790
         OPEN  (DCBRD,(INPUT))                                          CP003800
         TM    DCBOFLGS,X'10'  DID OPEN SUCCEED?                        CP003810
         BC    8,OPNE          BIF FAILED FOR SOME REASON               CP003820
         ST    5,DCBBLKCT      BLOCK COUNT TO ZERO                      CP003830
         OI    DCBIFLGS,X'0C'  AGAIN SET NO IOS ERROR RECOVERY ATTEMPTS CP003840
OPN3     ST    5,AIER          RETURN WHATEVER STATUS OF OPEN           CP003850
         B     RETURN                                                   CP003860
OPNE     LA    5,1(,0)         SAY OPEN FAILED                          CP003870
         B     OPN3                                                     CP003880
DEFAULT  LA    2,DFLTDDNM POINT TO STRING 'READIN  ' FOR DCB INP DDNAME CP003890
         B     OPN2                                                     CP003900
*                                                                       CP003910
         SPACE 3                                                        CP003920
CPRDCLS  STM   14,12,12(13)   CLOSE INPUT TAPE DCB                      CP003930
CPRCLS   EQU   CPRDCLS         - ALTERNATE FORTRAN USABLE NAME          CP003940
         USING CPRDCLS,15                                               CP003950
         L     12,ACPRD                                                 CP003960
         DROP  15                                                       CP003970
         BAL   15,COMENTRY    PERFORM STANDARD HOUSEKEEPING             CP003980
         CLOSE DCBRD                                                    CP003990
         B     RETURN                                                   CP004000
*                                                                       CP004010
         SPACE 3                                                        CP004020
EXCPR    SR   1,1      ACTUALLY USE CCW'S BUILT FOR READ-TYPE FUNCTIONS CP004030
         ST   1,ECBRD         MAKE ECB SAY "NOT BUSY"                   CP004040
         LA   9,DCBRD         @IHADCB                                   CP004050
         EXCP IOBRD           REQUEST EXECUTION OF CP(S)                CP004060
*                                                                       CP004070
         WAIT  ECB=ECBRD      HANG AROUND FOR COMPLETION OF REQUEST     CP004080
         CLI   ECBRD,X'7F'    EQUAL SAY REQUEST COMPLETED AOK           CP004090
         BC    8,EXCPR6        - NORMAL EXIT, NO PROBLEMS               CP004100
         TM    IOBRDCSW+4,X'0C'  CHANNEL AND DEVICE END?                CP004110
         BC    1,EXCPR2          YES, BOTH                              CP004120
EXCPR1   L     1,FM3             SET TO SHOW HARDWARE FALURE            CP004130
         B     EXCPR7                                                   CP004140
EXCPR2   TM    IOBRDCSW+4,X'04'  UNIT CHECK?                            CP004150
         BC    8,EXCPR4       NONE DETECTED                             CP004160
*                                                                       CP004170
         TM    IOBRD+2,X'F7'  EQUIPMENT MALFUNCTION?                    CP004180
         BC    5,EXCPR1       AFRAID SO                                 CP004190
*                                                                       CP004200
         TM    IOBRD+2,X'02'  DATA CHECK?                               CP004210
         BC    8,EXCPR3       NO, LOOKS OK                              CP004220
         L     1,FM2          SET TO SHOW DATA CHECK                    CP004230
         ST    1,AIER        & POST RETURN CODE IN ANSWER ARRAY OF USER CP004240
*                                                                       CP004250
* A SENSE TO OBTAIN 5 SENSE BYTES FOR ANALYSIS OF A DATA ERROR          CP004260
*                                                                       CP004270
        SR    1,1                                                       CP004180
        ST    1,ECBRD        RESET ECB TO NON-BUSY STATUS               CP004190
        ST    1,ASTATUS      CLEAR USER'S ANSWER AREA                   CP004200
        ST    1,ASTATUS+4                                               CP004210
        MVC   ASTATUS(1),IOBRDCSW+4  STATUS BYTE                        CP004220
        MVC   OLDCSW(8),IOBRDCSW   SAVE READ CSW                        CP004230
        LD    0,SENSE        BUILD NEW CP FOR SENSE COMMAND             CP004240
        STD   0,CP                                                      CP004250
        LA    1,ASTATUS+1-ANSWER(11)  ADDR. FOR 5 STATUS BYTES          CP004260
        O     1,CP                                                      CP004270
        ST    1,CP           SET ADDRESS IN CP                          CP004280
        MVI   OBRD,X'02'     SAY NO RELATED CP'S                        CP004290
        NI    DCBIFLGS,X'3F'   TURN OFF ERROR BITS, LEAVE REST ALONE    CP004300
*                                                                       CP004310
        EXCP  IOBRD                                                     CP004320
        WAIT  ECB=ECBRD                                                 CP004330
        NI    DCBIFLGS,X'3F'   TURN OFF ERROR BITS AGAIN                CP004340
        MVC   ASTATUS+6(1),IOBRDCSW+4  SENSE STATUS BYTE                CP004350
        MVC   SENSECSW(8),IOBRDCSW   STORE SENSE CSW                    CP004360
        MVC   IOBRDCSW(8),OLDCSW     RESET READ CSW                     CP004370
        CLI   ECBRD,X'7F'        TEST FOR ADDITIONAL ERRORS             CP004380
        BCR   8,10               BIF NONE                               CP004390
        MVI   ASTATUS+7,X'03'    SET NOT PERFECT COMPLETION OF SENSE    CP004400
        BR    10                                                        CP004410
*                                                                       CP004420
EXCPR3  TM    IOBRD+3,X'08' TEST FOR LOAD POINT IN CASE OF BSF, BSB     CP004430
        BC    1,EXCPR5    OR A READ BACKWARDS, DON'T SEE EOT ON FORWARD CP004440
        ABEND 44,DUMP,STEP  KILL JOB IF SOMETHING ELSE (UNDECIPHERABLE) CP004450
*                                                                       CP004460
EXCPR4  TM    IOBRDCSW+4,X'01'   UNIT EXCEPTION                         CP004470
        BC    1,EXCPR5           BIF SO                                 CP004480
*                                                                       CP004490
        B     EXCPR6         NOT PERFECT COMPLETION, BUT NO ERRORS NOW  CP004500
*                                                                       CP004510
EXCPR5  L     1,FM1              SET TO SHOW EOF ENCOUNTERED            CP004520
        B     EXCPR7                                                    CP004530
*                                                                       CP004540
EXCPR6  SR    1,1               HERE, EVERYTHING LOOKS AOK              CP004550
EXCPR7  ST    1,AIER            PASS BACK WHATEVER CONDITION WE HAVE    CP004560
        NI    DCBIFLGS,X'3F'    CLEAR ANY EXCEPTION BITS                CP004570
        MVC   ASTATUS(1),IOBRDCSW+4  SENSE BITS (MAYBE UNIT CHECK)      CP004580
        MVC   ASTATUS+1(2),IOBRD+2                                      CP004590
        BR    10                BACK TO WHOEVER CALLED INTERNALLY       CP004600
        EJECT                                                           CP004610
CPWT    STM   14,12,12(13)      WRITE ONE PHYSICAL RECORD (BLOCK)       CP004620
        USING CPWT,15                                                   CP004630
        L     12,ACPRD                                                  CP004640
        DROP  15                                                        CP004650
        BAL   15,COMENTRY       PERFORM STANDARD HOUSEKEEPING           CP004660
        LM    2,3,4(1)          @DATA, @COUNT                           CP004670
        LA    2,0(,2)           24-BIT DATA ADDR. FOR CCW'S             CP004680
        L     3,0(,3)           VAL(COUNT)                              CP004690
        LA    4,1(,0)                                                   CP004700
        STH   4,IOBWTBCI        BLOCK COUNT INCREMENT                   CP004710
        LA    4,9               MAX CCW COUNTER                         CP004720
        MVI   IOBWT,X'02'       ASSUME NO RELATED CP'S AT FIRST         CP004730
CPWTLP  CR    3,5               65K OR LESS?                            CP004740
        BC    12,CPWLAST        BIF LAST OR ONLY CCW TO BUILD           CP004750
        OI    IOBWT,X'80'       TURN ON CD BIT IN IOB                   CP004760
        L     7,WTN                                                     CP004770
        OR    7,2               @DATA TO CCW                            CP004780
        ST    7,0(,6)           HALF CCW TO CP ARRAY                    CP004790
        L     7,WTN+4             - & SECOND HALF                       CP004800
        ST    7,4(,6)           INTO CP ARRAY                           CP004810
        SR    3,5               DECR. # BYTES TO WRITE BY 65K           CP004820
        AR    2,5               INCR. DATA ADDRESS                      CP004830
        LA    6,8(,6)             & CP PTR                              CP004840
        BCT   4,CPWTLP          MORE, IF POSSIBLE                       CP004850
        ABEND 146,DUMP,STEP   MORE THAN 9 CCW'S REQUIRED, ABORT PROGRAM CP004860
*                                                                       CP004870
CPWTLAST L    7,WTF             CONSTRUCT LAST WRITE CCW                CP004880
         OR   7,2               MAKE DATA ADDRESS                       CP004890
         ST   7,0(,6)                                                   CP004900
         L    7,WTF+4           FORM CCW WITH FRAG. COUNT AS LAST       CP004910
         OR   7,3                                                       CP004920
         ST   7,4(,6)           LAST IN CP ARRAY                        CP004930
         LA   7,10              NOW CALC. HOW MANY CCW'S BUILT IN CHAIN CP004940
         SR   7,4                                                       CP004950
         ST   7,NUMCCW                                                  CP004960
         LA   10,RETURN         SET FOR COMMON END PROCESSING           CP004970
         B    EXCPW             PERFORM THE ACTUAL I/O                  CP004980
*                                                                       CP005000
         SPACE 3                                                        CP005010
CPWERG   STM   14,12,12(13)     ERASE GAP FUNCTION                      CP005020
         USING CPWERG,15                                                CP005030
         L     12,ACPRD         SET UP STANDARD BASE REG                CP005040
         DROP  15                                                       CP005050
         BAL   15,COMENTRY      PERFORM STANDARD HOUSEKEEPING           CP005060
         SR    4,4              SAY NO BLOCK COUNT INCREMENT            CP005070
         STH   IOBWTBCI                                                 CP005080
         LD    0,ERG            MOVE THE CCW TO THE CP ARRAY            CP005090
         STD   0,CP              - SINGLE CCW                           CP005100
         MVI   IOBWT,X'02'      SAY NO CD, CC OR OTHER CP               CP005110
         LA    10,RETURN        COMMON END PROCESING                    CP005120
         B     EXCPW            PERFORM CHANPROG                        CP005130
*                                                                       CP005140
         SPACE 3                                                        CP005150
CPWTM   STM    14,12,12(13)     WRITE A TAPE MARK FUNCTION              CP005160
        USING  CPWTM,15                                                 CP005170
        L      12,ACPRD         GET STANDARD BASE                       CP005180
        DROP   15                                                       CP005190
        BAL    15,COMENTRY      PERFORM STANDARD HOUSEKEEPING           CP005200
        LA     9,DCBWT          @IHADCB FOR WRITE DCB                   CP005210
        SR     4,4            CLEAR BLOCK COUNT, BLOCK COUNT INCREMENT  CP005220
        ST     4,DCBBLKCT                                               CP005230
        STH    4,IOBWTBCI                                               CP005340
        LD     0,WTM            MOVE CCW TO CP ARRAY                    CP005350
        STD    0,CP                                                     CP005360
        MVI    IOBWT,X'02'      TURN OFF ALL CHAIN STUFF                CP005370
        LA     10,RETURN        STANDARD END PROCESSING                 CP005380
        B      EXCPW            GO EXECUTE THE CCW                      CP005390
*                                                                       CP005400
        SPACE 3                                                         CP005410
CPERAS  STM   14,12,12(13)      DATA SECURITY ERASE TO EOT MARKER       CP005420
        USING CPERAS,15                                                 CP005430
        L     12,ACPRD          GET STANDARD BASE REG SET               CP005440
        DROP  15                                                        CP005450
        BAL   15,COMENTRY       DO STANDARD HOUSEKEEPING                CP005460
        SR    4,4               CLEAR BLOCK COUNT INCREMENT             CP005470
        STH   4,IOBWTBCI                                                CP005480
        LD    0,ERASEXX         MOVE CCW'S                              CP005490
        STD   0,CP                                                      CP005500
        LD    0,REALERAS                                                CP005510
        STD   0,CP+8                                                    CP005520
        MVI   IOBWT,X'C0'       TURN ON CHAIN BIT FLAGS                 CP005530
        LA    10,RETURN                                                 CP005540
        B     EXCPW             PERFORM FUNCTION                        CP005550
*                                                                       CP005560
        SPACE 3                                                         CP005570
CPWREW  STM   14,12,12(13)    REWIND OUTPUT TAPE (FOR VOLID CHKS, ETC.) CP005580
        USING CPREW,15                                                  CP005590
        L     12,ACPRD          SET STANDARD BASE REG                   CP005600
        DROP  15                                                        CP005610
        BAL   COMENTRY          PERFORM STANDARD HOUSEKEEPING           CP005620
        LA    9,DCBWT                                                   CP005630
        SR    4,4               SET TO CLEAR BLOCK COUNT                CP005640
        ST    4,DCBBLKCT                                                CP005650
        STH   4,IOBWTBCI        SAY NO NCREMENT                         CP005660
        MVI   IOBWT,X'02'       NO CHAINING, NO RELATED CP'S            CP005670
        LD    0,REW                                                     CP005670
        STD   0,CP              REWIND COMMAND TO CP ARRAY              CP005680
        LA    10,RETURN                                                 CP005690
        B     EXCPW             ACTUALLY GO REWIND TAPE                 CP005700
*                                                                       CP005710
        SPACE 3                                                         CP005720
CPWRED  STM  14,12,12(13)       DO READ FROM OUTPUT TAPE (CF. CPWREW)   CP005730
        USING CPREW,15                                                  CP005740
        L     12,ACPRD          STANDARD BASE REG                       CP005750
        DROP  15                                                        CP005760
        BAL   15,COMENTRY       STANDARD HOUSEKEEPING                   CP005770
        LM    2,3,4(1)          @DATA, @COUNT                           CP005780
        LA    2,0(,2)           24-BIT FOR CCW ADDR. FIELD              CP005790
        LA    4,1(,0)           BLOCK COUNT INCREMENT                   CP005800
        STH   4,IOBWTBCI                                                CP005810
        LA    4,9(,0)           MAX # CCW'S                             CP005820
        MVI   IOBWT,X'02' ASSUME HAVE NO MORE THAN ONE CCW IN CP ARRAY  CP005830
        L     3,0(,3            VAL(COUNT OF BYTES TO READ)             CP005840
CPWRLP1 CR    3,5               LESS THAN EQUAL 65K?                    CP005850
        BC    12,CPWRLST         BIF SO                                 CP005860
        OI    IOBWT,X'80'       SAY DATA CHAINING                       CP005870
        L     8,RDN                                                     CP005880
        OR    8,2               BUILD ADDR. PART OF CCW                 CP005890
        ST    8,0(,6)                                                   CP005900
        L     8,RDN+4           AND MAX. CT. PART OF A CP               CP005910
        ST    8,4(,6)                                                   CP005920
        SR    3,5               DECR BYTE COUNT BY 65K                  CP005930
        LA    6,8(,6)           BUMP CP ARRAY PTR                       CP005940
        AR    2,5               @DATA := @DATA + 65K                    CP005950
        BCT   4,CPWRLP1         BUILD ANOTHER, IF POSSIBLE              CP005970
        ABEND 46,DUMP,STEP      MORE THAN 9 CCW'S REQUIRED              CP005980
CPWRLST  L    8,RDF             BUILD LAST (OR ONLY) CCW IN CHAIN       CP005990
         OR   8,2                                                       CP006000
         ST   8,0(,6)           ADDRESS PART TO CP                      CP006010
         L    8,RDF+4                                                   CP006020
         OR   8,3               COUNT PART OF CCW TO CP                 CP006030
         ST   8,4(,6)                                                   CP006040
         LA   8,10(,0)          CALC. # CCW'S BUILT                     CP006050
         SR   8,4                                                       CP006060
         ST   8,NUMCCW                                                  CP006070
         BAL  10,EXCPW          GO TRY TO READ FROM AN OUTPUT TAPE      CP006080
*                                                                       CP006090
         C    1,FM2             BACK FROM EXCP, CHECK FOR ERRORS        CP006100
         BC   4,CLEAR           HW FAILURE, CLEAR COUNT XFER'D & EXIT   CP006110
         L    2,IOBWTCSW                                                CP006120
         LA   2,0(,2)           FORM 24-BIT ADDRESS                     CP006130
         S    2,F8              POINT TO LAST CCW USED                  CP006140
         LR   3,2                                                       CP006150
         L    1,IOBWTCSW+4                                              CP006160
         N    1,MASK            ALL BUT BYTE COUNT FIELD                CP006170
         LA   6,CP                                                      CP006180
         SR   3,6                                                       CP006190
         SRA  3,3(0)                                                    CP006200
         MR   4,3               NOW, R5 = BYTES EXCEPT LAST CCW         CP006210
         L    4,4(,2)           BYTE COUNT OF PARTIAL CCW               CP006220
         N    4,MASK            BYTES POSSIBLE IN LAST CCW              CP006230
         SR   4,1                                                       CP006240
         AR   4,5                                                       CP006250
         ST   4,APARTIAL        FINAL COUNT OF DATA READ                CP006260
         LA   4,1(,0)                                                   CP006270
         ST   4,APART                                                   CP006280
         B    RETURN   STANDARD EXIT                                    CP006290
* NOTE THAT MINIMAL ERROR CHECKING IS DONE WHEN READING OUTPUT TAPE,    CP006300
* SINCE IT IS PRESUMED THAT THIS IS DONE RARELY, AND OS HAS CHECKED     CP006310
* WHAT PROBABLY IS BEING READ ANYWAY.                                   CP006320
*                                                                       CP006330
         SPACE 3                                                        CP006340
CPWTOPEN STM  14,12,12(13)     OPEN THE DCB FOR THE TAPE TO BE WRITTEN  CP006350
CPWOPN   EQU  CPWTOPEN         ALTERNATE NAME                           CP006360
         USING CPWTOPEN,15                                              CP006370
         L    12,ACPRD                                                  CP006380
         DROP 15                                                        CP006390
         BAL  15,COMENTRY      PERFORM STANDARD HOUSEKEEPING            CP006400
         LA   9,DCBWT          @IHADCB                                  CP006410
         LTR  11,11            NEG SAYS ONE PARM - USE DEFAULT DDNAME   CP006420
         BC   4,DFLTOPEN       IN THE DCB FOR THE TAPE                  CP006430
         L    2,4(,1)          ELSE USE STRING PASSED AS DDNAME         CP006440
OPEN2    MVC  DCBDDNAM(8),0(2)   FILL DCB WITH WHICHEVER                CP006450
         OPEN (DCBWT,(OUTPUT))                                          CP006460
         TM   DCBOFLGS,X'10'   DID DCB OPEN SUCCESSFULLY?               CP006470
         BC   8,OPENFAIL       NO, IT DID NOT                           CP006480
         SR   5,5                                                       CP006490
         ST   5,DCBBLKCT       SAY NO BLOCKS PROCESSED                  CP006500
OPEN3    ST   5,AIER           POST COMPLETION CODE TO CALLER           CP006510
         B    RETURN           TAKE STANDARD EXIT                       CP006520
OPENFAIL LA   5,1              SAY OPEN FAILED                          CP006530
         B    OPEN3            GO POST WITHOUT FURTHER ACTION           CP006540
DFLTOPEN LA  2,DFLTDDWT SET TO MOVE "SYSTAPE " TO DCB BEFORE OPENING IT CP006550
         B    OPEN2                                                     CP006560
*                                                                       CP006570
         SPACE 3                                                        CP006580
CPWTCLS  STM  14,12,12(13)  PERFORM A CLOSE ON THE DCB FOR OUTPUT TAPE  CP006590
CPWCLS   EQU  CPWTCLS                                                   CP006600
         USING CPWTCLS,15                                               CP006610
         L    12,ACPRD                                                  CP006620
         DROP  15                                                       CP006630
         BAL   15,COMENTRY     STANDARD HOUSEKEEPING                    CP006640
         CLOSE DCBWT                                                    CP006650
         B     RETURN          SHORT AND SWEET                          CP006660
         EJECT                                                          CP006670
*                                                                       CP006680
***** ACTUALLY DO EXCP I/O FOR TAPE WRITES (MOSTLY).                    CP006690
*                                                                       CP006700
EXCPW   SR    1,1                                                       CP006710
        ST    1,ECBWT         RESET STATUS FOR ECB TO NOT BUSY          CP006720
        EXCP  IOBWT           REQUEST IOS DO CHANPROG                   CP006730
        WAIT  ECB=ECBWT       HANG AROUND UNTL COMPLETE                 CP006740
*                                                                       CP006750
        CLI   ECBWT,X'7F'     IOS SAY AOK?                              CP006760
        BC    8,EXCPW6        BIF NO ERRORS                             CP006770
        TM    IOBWTCSW+4,X'0C'   DEVICE AND CHANNEL END?                CP006780
        BC    1,EXCPW2        YES, BOTH                                 CP006790
EXCPW1  L     1,FM3           SET ANSWER TO -3 (HW FAILURE)             CP006800
        B     EXCPW7          GO POST RETURN CODE TO USER               CP006810
EXCPW2  TM    IOBWTCSW+4,X'02'  DID WE GET UNIT CHECK?                  CP006820
        BC    8,EXCPW4        NO, MUST BE SOMETHING ELSE                CP006830
        TM    IOBWT+2,X'F7'   EQUIPMENT MALFUNCTION?                    CP006840
        BC    5,EXCPW1        JUST GO REPORT IT BACK TO CALLER          CP006850
        TM    IOBWT+2,X'08'   DATA CHECK?                               CP006860
        BC    8,EXCPW3        NO, PERHAPS EOT (BOT IF READ OP)          CP006870
        L     1,FM2           SAY DATA CHECK                            CP006880
        B     EXCPW7          GO POST THAT CODE                         CP006890
EXCPW3  TM    IOBWT+3,X'09'   REFLECTIVE MARKER OF SOME SORT SEEN       CP006900
        BC    1,EXCPW5                                                  CP006910
        ABEND 144,DUMP,STEP   UNDECIPHERABLE ERROR, GIVE UP AND DIE     CP006920
*                                                                       CP006930
EXCPW4  TM    IOBWTCSW+4,X'01'  DEFINITELY UNIT EXCEPTION?              CP006940
        BC    1,EXCPW5        BIF SO                                    CP006950
        B     EXCPW6       MUST HAVE BEEN SYSTEM RETRY FOR SOME REASON  CP006960
EXCPW5  L     1,FM1        SAY UNIT EXCEPTION (REFLECTIVE MARKER FOUND) CP006970
        B     EXCPW7                                                    CP006980
EXCPW6  SR    1,1             SAY NO ERRORS                             CP006990
EXCPW7  ST    1,AIER          SET MAJOR RETURN STATUS TO CALLER         CP007000
        MVC   ASTATUS(1),IOBWTCSW+4   HARDWARE STATUS BYTE              CP007010
        MVC   ASTATUS+1(2),IOBWT+2   UNIT CHECK BYTES, IF ANY           CP007020
        BR    10              RETURN TO INTERNAL CALLER                 CP007030
*                                                                       CP007040
       SPACE 3                                                          CP007050
* VARIOUS DATA AREAS, CONSTANTS, CHANNEL PROGRAMS NEEDED                CP007060
ACPRD   DC   A(CPRD)   BASE ADDRESS FOR ALL INTERNAL INTERNAL ROUTINES  CP007070
SAVERD  DS   9D               STANDARD OS SAVE AREA FOR GPR'S           CP007080
CP      DC   10D'0'           ARRAY FOR ALL THE CCW'S WE MAY BUILD      CP007090
FM1     DC   F'-1'                                                      CP007100
FM2     DC   F'-2'                                                      CP007110
FM3     DC   F'-3'                                                      CP007120
F8      DC   F'8'                                                       CP007130
MASK    DC   XL4'0000FFFF'                                              CP007140
MAX     DC   F'65535'                                                   CP007150
NUMCCW  DC   F'0'                                                       CP007170
DFLTDDWT DC  CL8'SYSTAPE '     DEFAULT DDNAME FOR OUTPUT TAPE IN JCL    CP007180
DFLTDDNM DC  CL8'READIN  '     SAME THING, INPUT TAPE                   CP007190
ACCW2    DC  A(0)                                                       CP007200
ACCW3    DC  A(0)                                                       CP007210
ACCWD    DC  A(16777215)                                                CP007220
*                                                                       CP007230
* CONTROL BLOCKS FOR READ OPERATIONS                                    CP007240
ECBRD   DC   F'0'      EVENT CONTROL BLOCK                              CP007250
IOBRD   DC   F'0'      IOB FOR READ                                     CP007260
        DC   A(ECBRD)  @ECB FOR THIS IOB                                CP007270
IOBRDCSW DC  2F'0'     SLOTS FOR CHANNEL STATUS WORDS                   CP007280
IOBRDACP DC  A(CP)     ADDRESS OF CHANNEL PROGRAM ARRAY                 CP007290
IOBRDDCB DC  A(DCBRD)  ADDRESS OF DCB                                   CP007300
         DC  F'0'      IOBRESTR (PURGE CHAIN/CCHH/COMMAND,CHANPROG)     CP007310
IOBRDBCI DC  H'1'      BLOCK COUNT INCREMENT                            CP007320
IOBRDECT DC  H'0'      ERROR COUNTS                                     CP007330
SENSECSW DS  2F        CSW FOR THE SENSE COMMAND WE MAY HAVE USED       CP007340
OLDCSW   DS  2F        CSW FOR READ WHILE DOING SENSE                   CP007350
*                                                                       CP007360
* CONTROL BLOCKS FOR WRITE OPERATIONS                                   CP007370
ECBWT    DC  F'0'      EVENT CONTROL BLOCK                              CP007380
IOBWT    DC  F'0'      IOB FOR WRITE                                    CP007390
         DC  A(ECBWT)  ADDRESS OF ECB FOR THIS IOB                      CP007400
IOBWTCSW DC  2F'0'     CSW RETURNED BY IOS                              CP007410
IOBWTACP DC  A(CP)     ADDR. OF CHANNEL PROGRAM ARRAY                   CP007420
IOBWTDCB DC  A(DCBWT)  DCB FOR OUTPUT TAPE                              CP007430
         DC  2F'0'                                                      CP007440
IOBWTBCI DC  F'1'      WRITE BLOCK COUNT INCREMENT                      CP007450
IOBWTECT DC  H'0'      WRITE ERROR COUNTS                               CP007460
*                                                                       CP007470
****** SKELETON CHANNEL COMMAND WORDS *****                             CP007480
*                                                                       CP007490
WTN     DC   X'01'     WRITE COMMAND FOR TAPE UNITS (MAX COUNT)         CP007500
        DC   AL3(0)    SKELETON DATA ADDRESS                            CP007510
        DC   X'A0'     CD, SLI FLAG BITS                                CP007520
        DC   AL3(65535)   MAX BYTE COUNT FOR XFER                       CP007530
WTF     DC   X'01'     WRITE COMMAND, MIN. COUNT                        CP007540
        DC   AL3(0)    ADDRESS FIELD FOR DATA                           CP007550
        DC   X'20'     SLI BIT ONLY                                     CP007560
        DC   AL3(0)    FINAL COUNT (MUST BE AT LEAST 1)                 CP007570
WTM     DC   X'1F'     CONTROL - WRITE FILE MARK                        CP007580
        DC   AL3(CP)   JUST AN ADDRESS - PRESUMABLY ANY WOULD DO        CP007590
        DC   X'20'     SLI BIT ONLY                                     CP007600
        DC   AL3(1)    CHANNEL REQUIREMENT - MIN ONE BYTE XFER          CP007610
ERG     DC   X'17'     CONTROL - ERAWE GAP                              CP007620
        DC   AL3(CP)   AGAIN, JUST AN ADDRESS                           CP007630
        DC   X'20'     SLI BIT ONLY                                     CP007640
        DC   AL3(1)    CHANNEL REQUIREMENT                              CP007650
ERASEXX DC   X'17'     FAKE TO MAKE SECURITY ERASE WORK                 CP007660
        DC   AL3(CP)   JUST AN ADDRESS                                  CP007670
        DC   X'60'     CC, SLI BITS                                     CP007680
        DC   AL3(1)    CHANNEL REQUIREMENT                              CP007690
REALERAS DC  X'97'     CONTROL - DATA SECURITY ERASE                    CP007700
         DC  AL3(CP)   AGAIN, JUST AN ADDRESS                           CP007710
         DC  X'20'     SLI FLAG BIT                                     CP007720
         DC  AL3(1)    CHANNEL REQUIREMENT                              CP007730
*                                                                       CP007740
***** READ-TYPE CHANNEL COMMANDS WE MAY USE *****                       CP007750
*                                                                       CP007760
RDN      DC  X'02'     READ COMMAND FOR TAPE UNITS (MAX COUNT)          CP007770
         DC  AL3(0)    SKELETON READ ADDRESS                            CP007780
         DC  X'A0'     CD, SLI FLAG BITS                                CP007790
         DC  AL3(65535)  MAX CCW DATA COUNT FIELD                       CP007800
* NOTE THAT THE MAXIMUM TRANSFER COUNT IS X'FFFF',OR 65535, NOT X'7FFF' CP007810
RDF      DC  X'02'     MAG TAPE READ, SKELETON ADDR., BYTE COUNT        CP007820
         DC  AL3(0)    DATA ADDRESS                                     CP007830
         DC  X'20'     SLI BIT ONLY                                     CP007840
         DC  AL3(0)  PRESUMABLY, A VALID COUNT WILL BE BUILT FOR THIS   CP007850
RDB      DC  X'0C'     TAPE READ BACKWARDS                              CP007860
         DC  AL3(0)    @DATA                                            CP007870
         DC  X'A0'     CD, SLI FLAG BITS                                CP007880
         DC  AL3(65535)  MAX DATA COUNT                                 CP007890
RDBF     DC  X'0C'     TAPE READ BACKWARDS, SKELETON COUNT              CP007900
        DC   AL3(0)    @DATA SKELETON                                   CP007910
        DC   X'20'     SLI BIT                                          CP007920
        DC   AL3(0)    RESIDUAL BYTE COUNT SKELETON                     CP007930
FSF     DC   X'3F'     CONTROL - FORWARD SPACE ONE FILE MARK            CP007930
        DC   AL3(CP)   DUMMY, BUT ADDR REQUIRED BY CHANNEL              CP007940
        DC   X'20'     SLI BIT ONLY                                     CP007950
        DC   AL3(1)    CHANNEL REQUIREMENT                              CP007960
BSF     DC   X'2F'     CONTROL - BACKSPACE ONE FILE MARK                CP007970
        DC   AL3(CP)   DUMMY ADDRESS                                    CP007980
        DC   X'20'     SLI BIT                                          CP007990
        DC   AL3(1)    CHANNEL REQUIREMENT                              CP008000
FSB     DC   X'37'     CONTROL - FORWARD SPACE ONE BLOCK                CP008010
        DC   AL3(CP)   DUMMY                                            CP008020
        DC   X'20'     SLI BIT                                          CP008030
        DC   AL3(1)    CHANNEL REQUIREMENT                              CP008040
BSB    DC  X'27'       CONTROL - BACKSPACE ONE BLOCK                    CP008050
       DC  AL3(CP)     DUMMY                                            CP008060
       DC  X'20'       SLI BIT                                          CP008070
       DC  AL3(1)      CHANNEL REQUIREMENT                              CP008080
SENSE  DC  X'04'       CONTROL/QUERY - SENSE COMMAND                    CP008090
       DC  AL3(0)      FILLED IN DURING EXECUTION IF NEEDED             CP008100
       DC  X'20'       SLI BIT                                          CP008110
       DC  AL3(5)      REQUEST 5 SENSE BYTES FROM CHANNEL/DEVICE        CP008120
REW    DC  X'07'       CONTROL - REWIND TAPE                            CP008130
       DC  AL3(CP)     DUMMY                                            CP008140
       DC  X'20'       SLI BIT                                          CP008150
       DC  AL3(1)      CHANNEL REQUIREMENT                              CP008160
*                                                                       CP008170
DCBRD   DCB MACRF=(E),DEVD=TA,DSORG=PS,IOBAD=IOBRD,DDNAME=NONE,OPTCD=Z  CP008180
* OPTCD=Z REQUESTS REDUCED ERROR RECOVERY BY IOS                        CP008190
*                                                                       CP008200
DCBWT   DCB MACRF=(E),DEVD=TA,DSORG=PS,IOBAD=IOBWT,DDNAME=NONE,OPTCD=Z  CP008210
ANSWER   DSECT                                                          CP008220
AIER     DS    F    ERROR CODE FOR CALLER                               CP008230
APART    DS    F    PARTIAL COMPLETION INDICATOR                        CP008240
APARTIAL DS    F    BYTES ACTUALLY READ                                 CP008250
ASTATUS  DS    2F   UNIT STATUS AND SENSE BYTES                         CP008260
         DCBD  DSORG=PS,DEVD=TA                                         CP008270
         END   CPRDTAPE                                                 CP008280








