//SBGOLOBM JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//ASSEMBLE PROC MEMBER=CCAT,
//          SRCLIB='SBGOLOB.CBT500.FILE535',
//          MACLIB=SYS1.MACLIB,
//          LNKLIB='SYS1.W$$.LINKLIB',
//          APARM='OBJECT,NODECK,ALIGN,FLAG(5)',
//          LPARM='LIST'
//*
//* +-------------------------+
//* ! ASSEMBLING              !
//* +-------------------------+
//*
//ASM      EXEC PGM=ASMA90,PARM='&APARM'
//SYSUT1   DD  UNIT=3390,SPACE=(1700,(6000,100))
//SYSUT2   DD  UNIT=3390,SPACE=(1700,(6000,100))
//SYSUT3   DD  UNIT=3390,SPACE=(1700,(6000,100))
//SYSLIB   DD  DSN=&MACLIB,DISP=SHR
//         DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.MODGEN,DISP=SHR
//SYSLIN   DD  DSN=&&MEMBER,DISP=(NEW,PASS),
//             UNIT=3390,SPACE=(800,(2000,500)),
//             DCB=(BLKSIZE=800,RECFM=FB,LRECL=80)
//SYSPRINT DD  SYSOUT=*
//SYSPUNCH DD  DUMMY,SYSOUT=B
//SYSIN    DD  DSN=&SRCLIB(&MEMBER),DISP=SHR
//*
//* +-------------------------+
//* ! LINK-EDITING            !
//* +-------------------------+
//*
//LNK      EXEC PGM=HEWL,PARM='MAP,LET,NCAL,&LPARM',COND=(8,LT,ASM)
//SYSUT1   DD  UNIT=3390,SPACE=(1024,(500,20))
//SYSLIN   DD  DSN=&&MEMBER,DISP=(OLD,DELETE)
//SYSLMOD  DD  DISP=SHR,DSN=&LNKLIB(&MEMBER)
//SYSPRINT DD  SYSOUT=*
//         PEND
//ASMLINK  EXEC ASSEMBLE
//
