//JCCAT JOB (CCT01),'ASSEMBLE CCAT       ',
//         CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*
// JCLLIB ORDER=CAI.PROCLIB
//*
//  EXEC ASSEMBLE,NAME=CCAT,
//          MEMBER=DERCCT,
//          APARM='OBJECT,NODECK,ALIGN',
//          LPARM='LIST',
//          SRCLIB='CAI.OPS.ASM',
//          LNKLIB='CAI.CA90S.CAILIB',
//          MACLIB='SYS1.MACLIB'
//
