//SMSJISRT JOB (),'SMS ISSUE INPUT TEST',                               JOB09314
//  MSGCLASS=A,CLASS=T,
// USER=COP1CW0,PASSWORD=
//  INCLUDE MEMBER=SMSINF
//PS020.SYSUT1 DD DATA,DLM=@@
SMSCUST:-- CUSTOMER NAME ---
FILENAME:FILENAME
013602000000786261708660000040416800000334914TITLEDGE OF NEW JERSEY, INC.  20072
013602000000786261708660000040416900001459000TOYOTA MOTOR CREDIT           20072
013602000000786261708660000040417000035082796AMC MORTGAGE SERVICES         20072
013602000000786261708660000040417100000066427SANDRA Y. ARENAS              20072
013602000000786261708660000040417200000026000PAT REILLY                    20072
@@
