//*--------------------------------------------------------------*
//*         INSTALL HELP FOR SUBCMD 'LISTTABS'                   *
//*--------------------------------------------------------------*
//LISTTABS  EXEC PGM=IEBUPDTE
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=SYS2.HELP,DISP=SHR
//SYSUT2   DD DSN=SYS2.HELP,DISP=SHR
//SYSIN    DD *
./ CHANGE NAME=IKJEBEHP,LIST=ALL
./ NUMBER SEQ1=31700020,NEW1=31720005,INCR=10,INSERT=YES
=LISTTABS=LTABS
)F FUNCTION -
  LISTTABS WILL DISPLAY THE CURRENT TAB SETTINGS IN YOU EDIT SESSION
)X SYNTAX -
         LISTTABS
  REQUIRED - NONE
  DEFAULTS - NONE
  ALIAS    - LTABS
)O OPERANDS -
             NONE
./ ALIAS NAME=EDIT
./ ALIAS NAME=E
/*
