//* ********************************************************
//* *  INSTALL THE 'CHANGEX' SUBCOMMAND OF EDIT            *
//* ********************************************************
//ASMH     EXEC ASMHCL,
//         PARM.ASM='OBJ,NODECK,NOLIST,TERM',
//         PARM.LKED='LIST,MAP,RENT,REUS,REFR'
//SYSTERM  DD SYSOUT=*
//SYSIN    DD DSN=SHARE.TSOSRC(IKJE9CX),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.SHARE.LOAD,UNIT=,DISP=SHR,SPACE=
//LKED.CMDLIB DD DSN=SYS1.CMDLIB,DISP=SHR
//LKED.SYSIN DD *
 REPLACE IKJEBECH,IKJEBCH1,IKJEBCH2,IKJEBCH3,IKJEBCH4
 INCLUDE CMDLIB(IKJEBECH)
 ALIAS CHANGEX#
 NAME IKJE9CX(R)
/*
