//* ********************************************************
//* *  INSTALL THE 'SPOT' SUBCOMMAND OF EDIT               *
//* ********************************************************
//SPOT     EXEC ASMHCL,
//         PARM.ASM='OBJ,NODECK,RENT',
//         PARM.LKED='LIST,MAP,RENT,REUS,REFR'
//SYSIN    DD DSN=SHARE.TSOSRC(IKJE9SP),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.SHARE.LOAD,DISP=SHR,UNIT=,SPACE=
//LKED.SYSIN DD *
 ALIAS SPOT#
 ALIAS SELECT#
 ALIAS EXCLUDE#
 NAME IKJE9SP(R)
/*
