//* ********************************************************
//* *  INSTALL THE 'DUP' SUBCOMMAND OF EDIT                *
//* ********************************************************
//ASMH     EXEC ASMHCL,
//         PARM.ASM='OBJ,NODECK',
//         PARM.LKED='LIST,MAP,RENT,REUS,REFR'
//SYSIN    DD DSN=SHARE.TSOSRC(IKJE9DU),DISP=SHR
//SYSTERM  DD SYSOUT=A,HOLD=YES
//LKED.SYSLMOD DD DSN=SYS1.SHARE.LOAD,UNIT=,DISP=SHR,SPACE=
//LKED.SYSIN DD *
 ALIAS DUP#
 NAME IKJE9DU(R)
/*
