//*-----------------------------------------------------------------*
//*        INSTALL  'LISTSU' TSO COMMAND
//*-----------------------------------------------------------------*
//ASMHCL   EXEC ASMHCL,
//         PARM.ASM='ALIGN,LIST,NORENT,LOAD,NODECK'
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=SHARE.TSOSRC(LISTSU),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.SHARE.LOAD,DISP=SHR,UNIT=,SPACE=
//LKED.SYSIN DD *
 NAME LISTSU(R)
/*
