//*------------------------------------------------------------------*
//*        INSTALL  SYSID
//*------------------------------------------------------------------*
//STEP1    EXEC ASMHCL,
//         PARM.ASM='OBJ,NODECK,RENT,NOLIST',
//         PARM.LKED='LIST,MAP,RENT'
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=SYS1.AMODGEN,DISP=SHR
//SYSIN    DD DSN=SHARE.TSOSRC(SYSID),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.SHARE.LOAD,DISP=SHR,UNIT=,SPACE=
//SYSIN    DD *
 ENTRY SYSID
 NAME SYSID(R)
/*
