//SBGOLOBU JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//*             .......SUBMIT AND RUN.......
//*
//*    This source may be customized and submitted, to assemble and
//*    linkedit.  In the REASMLNK proc, modify the OUTPUT parameter,
//*    which is the target library for the linkedit.  You almost
//*    have to modify nothing else.
//*
//*    In this copy of the disassembled source code, I eliminated
//*    dependency on the base register displacements by converting
//*    all references to base registers R11 and R10, into labels.
//*    I tested this (in a different copy) by putting two NOPR
//*    instructions before label LAB0050.  The displacements were
//*    all changed, but the program still worked.
//*
//*    This makes the program easier to modify.
//*
//*    The GETMAINed work area, addressed by R13, still has not
//*    been mapped.  But the main instruction flow can now be
//*    modified more safely.
//*
//*    There are many subroutines in this program:  BAL R12,routine
//*    which have now been tracked.  Every BR  R12 has been labeled
//*    and every label which has been BAL'ed to, from R12, has been
//*    marked with SUBxxx as a label.  This makes it easier to follow
//*    the flow of control within the program.  The routines were
//*    numbered consecutively starting from SUB001 thru SUB051.
//*    SUB014 and SUB014A were part of the same routine, branched in
//*    to different places there.
//*
//*
//REASMLNK PROC
//ASM    EXEC  PGM=ASMA90,REGION=7000K,
//             PARM=(DECK,NOOBJECT,NORLD,RENT,TERM,'XREF(SHORT)')
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(CYL,(10,5))
//SYSUT2   DD  UNIT=SYSALLDA,SPACE=(CYL,(10,5))
//SYSUT3   DD  UNIT=SYSALLDA,SPACE=(CYL,(10,5))
//SYSPUNCH DD  UNIT=SYSALLDA,SPACE=(TRK,(5,5)),DISP=(MOD,PASS),DSN=&&X,
//             DCB=BLKSIZE=3120
//SYSPRINT DD  SYSOUT=*
//SYSTERM  DD  SYSOUT=*
//SYSLIB   DD  DSN=SYS1.MODGEN,DISP=SHR,DCB=BLKSIZE=23440
//         DD  DSN=SYS1.MACLIB,DISP=SHR
//LKED   EXEC  PGM=IEWL,PARM='MAP,RENT,REUS,REFR,LET,NCAL',COND=(0,LT)
//SYSPRINT DD  SYSOUT=*
//SYSLIBX  DD  DSN=&&X,DISP=(OLD,DELETE)
//SYSLMOD  DD  DISP=SHR,DSN=&OUTPUT
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(TRK,(5,5))
//       PEND
//*
//USERS     EXEC REASMLNK,OUTPUT='SYS1.W$$.LINKLIB',  <=== CHANGE
//  PARM.LKED='NCAL,MAP,LIST,LET,RENT,REUS,REFR'
//ASM.SYSIN   DD *
ACTIVE   CSECT                                                          00000 00
ACTIVE   AMODE 31                                                       00000 00
ACTIVE   RMODE 24                                                       00000 00
         STM   R14,R12,12(R13)         90EC D00C         *..}.*         00000 00
         BAL   R1,12(,R15)             4510 F00C         *..0.*         00004 00
         DC    X'00000283'             00000283          *...c*         00008 00
         L     R0,0(,R1)               5800 1000         *....*         0000C 00
         SVC   10      FREEMAIN        0A0A              *..*           00010 00
         BALR  R11,R0                  05B0              *..*           00012 00
         USING *,R11,R10
         LA    R10,4095(,R11)          41AB 0FFF         *....*         00014 00
         LA    R10,1(,R10)             41AA 0001         *....*         00018 00
         ST    R13,4(,R1)              50D0 1004         *&}..*         0001C 00
         LR    R12,R13                 18CD              *..*           00020 00
         LR    R13,R1                  18D1              *.J*           00022 00
         ST    R13,8(,R12)             50DC 0008         *&...*         00024 00
         MVC   72(4,R13),FULLZERO      D203 D048 BF6C    *K.}..%*       00028 00
         L     R1,24(,R12)             581C 0018         *....*         0002E 00
         ST    R12,76(,R13)            50C0 D04C         *&{}<*         00032 00
         BAL   R12,SUB051              45C0 BD12         *.{..*         00036 00
         BAL   R12,SUB001              45C0 B056         *.{..*         0003A 00
         L     R12,76(,R13)            58C0 D04C         *.{}<*         0003E 00
         L     R12,72(,R13)            58CD 0048         *....*         00042 00
         LR    R1,R13                  181D              *..*           00046 00
         L     R13,4(,R13)             58D0 D004         *.}}.*         00048 00
         B     LAB0054                 47F0 B040         *.0. *         0004C 00
LAB0050  DC    X'00000283'             00000283          *...c*         00050 00
LAB0054  L     R0,LAB0050              5800 B03C         *....*         00054 00
         LA    R1,0(,R1)               4110 1000         *....*         00058 00
         SVC   10      GETMAIN         0A0A              *..*           0005C 00
         LR    R15,R12                 18FC              *..*           0005E 00
         L     R14,12(,R13)            58ED 000C         *....*         00060 00
         LM    R0,R12,20(R13)          980C D014         *q.}.*         00064 00
         BR    R14                     07FE              *..*           00068 00
SUB001   TM    496(R13),X'C0'          91C0 D1F0         *j{J0*         0006A 00
         BZ    LAB008A                 4780 B076         *....*         0006E 00
         ST    R12,80(,R13)            50C0 D050         *&{}&*         00072 00
         BAL   R12,SUB002              45C0 B090         *.{..*         00076 00
         BAL   R12,SUB009              45C0 B2EE         *.{..*         0007A 00
         BAL   R12,SUB014              45C0 B4B4         *.{..*         0007E 00
         L     R12,80(,R13)            58C0 D050         *.{}&*         00082 00
         B     ESUB001                 47F0 B08E         *.0..*         00086 00
LAB008A  ST    R12,84(,R13)            50C0 D054         *&{}.*         0008A 00
         BAL   R12,SUB002              45C0 B090         *.{..*         0008E 00
         BAL   R12,SUB039              45C0 BB98         *.{.q*         00092 00
         BAL   R12,SUB038              45C0 BB40         *.{. *         00096 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         0009A 00
         L     R12,84(,R13)            58C0 D054         *.{}.*         0009E 00
ESUB001  BR    R12                     07FC              *..*           000A2 00
SUB002   ST    R12,88(,R13)            50C0 D058         *&{}.*         000A4 00
         BAL   R12,SUB043              45C0 BC2C         *.{..*         000A8 00
         L     R12,88(,R13)            58C0 D058         *.{}.*         000AC 00
         L     R2,16                   5820 0010         *....*         000B0 00
         L     R3,196(,R2)             5830 20C4         *...D* SMCA    000B4 00
         C     R3,FULLZERO             5930 BF6C         *...%*         000B8 00
         BE    LAB00C6                 4780 B0B2         *....*         000BC 00
         MVC   472(4,R13),16(R3)  SYSNAME D203 D1D8 3010 *K.JQ..*       000C0 00
LAB00C6  L     R2,556(,R2)             5820 222C         *....* ASVT    000C6 00
         XR    R3,R3                   1733              *..*           000CA 00
         ST    R3,412(,R13)            5030 D19C         *&.J.*         000CC 00
         ST    R3,416(,R13)            5030 D1A0         *&.J.*         000D0 00
         ST    R3,420(,R13)            5030 D1A4         *&.Ju*         000D4 00
         L     R8,516(,R2)             5880 2204       *....* IGVGCAS   000D8 00
         TM    496(R13),C'-'           9160 D1F0         *j-J0*         000DC 00
         BNO   LAB0116                 47E0 B102         *.\..*         000E0 00
         LR    R1,R8                   1818              *..*           000E4 00
         LA    R1,1(,R1)               4111 0001         *....*         000E6 00
         M     R0,F78                  5C00 BF70         **...*         000EA 00
         ST    R1,408(,R13)            5010 D198         *&.Jq*         000EE 00
         LR    R0,R1                   1801              *..*           000F2 00
         BAL   R1,LAB00F8              4510 B0E4         *...U*         000F4 00
LAB00F8  SVC   10      GETMAIN         0A0A              *..*           000F8 00
         ST    R1,404(,R13)            5010 D194         *&.Jm*         000FA 00
         ST    R12,92(,R13)            50C0 D05C         *&{}**         000FE 00
         BAL   R12,SUB005              45C0 B284         *.{.d*         00102 00
         BAL   R12,SUB048              45C0 BCD4         *.{.M*         00106 00
         BAL   R12,SUB046              45C0 BCB2         *.{..*         0010A 00
         L     R12,92(,R13)            58C0 D05C         *.{}**         0010E 00
         B     LAB0172                 47F0 B15E         *.0.;*         00112 00
LAB0116  TM    496(R13),X'80'          9180 D1F0         *j.J0*         00116 00
         BZ    LAB0144                 4780 B130         *....*         0011A 00
         LR    R1,R8                   1818              *..*           0011E 00
         LA    R1,1(,R1)               4111 0001         *....*         00120 00
         M     R0,F25                  5C00 BF74         **...*         00124 00
         ST    R1,392(,R13)            5010 D188         *&.Jh*         00128 00
         LR    R0,R1                   1801              *..*           0012C 00
         BAL   R1,LAB0132              4510 B11E         *....*         0012E 00
LAB0132  SVC   10      GETMAIN         0A0A              *..*           00132 00
         ST    R1,388(,R13)            5010 D184         *&.Jd*         00134 00
         ST    R12,96(,R13)            50C0 D060         *&{}-*         00138 00
         BAL   R12,SUB003              45C0 B254         *.{..*         0013C 00
         L     R12,96(,R13)            58C0 D060         *.{}-*         00140 00
LAB0144  TM    496(R13),C' '           9140 D1F0         *j J0*         00144 00
         BZ    LAB0172                 4780 B15E         *...;*         00148 00
         LR    R1,R8                   1818              *..*           0014C 00
         LA    R1,1(,R1)               4111 0001         *....*         0014E 00
         M     R0,F08                  5C00 BF78         **...*         00152 00
         ST    R1,400(,R13)            5010 D190         *&.J.*         00156 00
         LR    R0,R1                   1801              *..*           0015A 00
         BAL   R1,LAB0160              4510 B14C         *...<*         0015C 00
LAB0160  SVC   10      GETMAIN         0A0A              *..*           00160 00
         ST    R1,396(,R13)            5010 D18C         *&.J.*         00162 00
         ST    R12,100(,R13)           50C0 D064         *&{}.*         00166 00
         BAL   R12,SUB004              45C0 B26C         *.{.%*         0016A 00
         L     R12,100(,R13)           58C0 D064         *.{}.*         0016E 00
LAB0172  SLA   R8,2                    8B80 0002         *....*         00172 00
         BZ    ESUB002                 4780 B232         *....*         00176 00
LAB017A  L     R4,528(R3,R2)           5843 2210         *....*         0017A 00
         ST    R4,328(,R13)            5040 D148         *& J.*         0017E 00
         TM    328(R13),X'80'          9180 D148         *j.J.*         00182 00
         BO    LAB023C                 4710 B228         *....*         00186 00
         L     R5,172(,R4)             5850 40AC         *.& .*         0018A 00
         LA    R5,0(,R5)               4155 0000         *....*         0018E 00
         LTR   R5,R5                   1255              *..*           00192 00
         BZ    LAB01CE                 4780 B1BA         *....*         00194 00
LAB0198  CLC   0(8,R5),INIT            D507 5000 BF14    *N.&...*       00198 00
         BNE   LAB01AC                 4770 B198         *...q*         0019E 00
         AP    480(4,R13),P1           FA30 D1E0 BFEA    *..J\..*       001A2 00
         B     LAB023C                 47F0 B228         *.0..*         001A8 00
LAB01AC  AP    476(4,R13),P1           FA30 D1DC BFEA    *..J...*       001AC 00
         TM    496(R13),X'80'          9180 D1F0         *j.J0*         001B2 00
         BZ    LAB023C                 4780 B228         *....*         001B6 00
         L     R6,412(,R13)            5860 D19C         *.-J.*         001BA 00
         ST    R12,104(,R13)           50C0 D068         *&{}.*         001BE 00
         BAL   R12,SUB008              45C0 B2CC         *.{..*         001C2 00
         L     R12,104(,R13)           58C0 D068         *.{}.*         001C6 00
         B     LAB0234                 47F0 B220         *.0..*         001CA 00
LAB01CE  L     R5,176(,R4)             5850 40B0         *.& .*         001CE 00
         LA    R5,0(,R5)               4155 0000         *....*         001D2 00
         LTR   R5,R5                   1255              *..*           001D6 00
         BZ    LAB0248                 4780 B234         *....*         001D8 00
         CLC   60(4,R4),FULLZERO       D503 403C BF6C    *N. ..%*       001DC 00
         BE    LAB0198                 4780 B184         *...d*         001E2 00
         AP    484(4,R13),P1           FA30 D1E4 BFEA    *..JU..*       001E6 00
         TM    496(R13),C' '           9140 D1F0         *j J0*         001EC 00
         BZ    LAB023C                 4780 B228         *....*         001F0 00
         TM    496(R13),C'-'           9160 D1F0         *j-J0*         001F4 00
         BNO   LAB0218                 47E0 B204         *.\..*         001F8 00
LAB01FC  L     R6,420(,R13)            5860 D1A4         *.-Ju*         001FC 00
         ST    R12,108(,R13)           50C0 D06C         *&{}%*         00200 00
         BAL   R12,SUB007              45C0 B2AC         *.{..*         00204 00
         L     R12,108(,R13)           58C0 D06C         *.{}%*         00208 00
         LA    R6,78(,R6)              4166 004E         *...+*         0020C 00
         ST    R6,420(,R13)            5060 D1A4         *&-Ju*         00210 00
         B     LAB023C                 47F0 B228         *.0..*         00214 00
LAB0218  L     R6,416(,R13)            5860 D1A0         *.-J.*         00218 00
         ST    R12,112(,R13)           50C0 D070         *&{}.*         0021C 00
         BAL   R12,SUB006              45C0 B29C         *.{..*         00220 00
         L     R12,112(,R13)           58C0 D070         *.{}.*         00224 00
         LA    R6,8(,R6)               4166 0008         *....*         00228 00
         ST    R6,416(,R13)            5060 D1A0         *&-J.*         0022C 00
         B     LAB023C                 47F0 B228         *.0..*         00230 00
LAB0234  LA    R6,25(,R6)              4166 0019         *....*         00234 00
         ST    R6,412(,R13)            5060 D19C         *&-J.*         00238 00
LAB023C  LA    R3,4(,R3)               4133 0004         *....*         0023C 00
         CR    R3,R8                   1938              *..*           00240 00
         BL    LAB017A                 4740 B166         *. ..*         00242 00
ESUB002  BR    R12                     07FC              *..*           00246 00
LAB0248  CLC   60(4,R4),FULLZERO       D503 403C BF6C    *N. ..%*       00248 00
         BE    LAB023C                 4780 B228         *....*         0024E 00
         AP    488(4,R13),P1           FA30 D1E8 BFEA    *..JY..*       00252 00
         TM    496(R13),X'60'          9160 D1F0         *j-J0*         00258 00
         BNO   LAB023C                 47E0 B228         *.\..*         0025C 00
         LA    R5,STARTING             4150 BF1C         *.&..*         00260 00
         B     LAB01FC                 47F0 B1E8         *.0.Y*         00264 00
SUB003   STM   R2,R5,424(R13)          9025 D1A8         *..Jy*         00268 00
         L     R2,388(,R13)            5820 D184         *..Jd*         0026C 00
         L     R3,392(,R13)            5830 D188         *..Jh*         00270 00
         XR    R4,R4                   1744              *..*           00274 00
         XR    R5,R5                   1755              *..*           00276 00
         MVCL  R2,R4                   0E24              *..*           00278 00
         LM    R2,R5,424(R13)          9825 D1A8         *q.Jy*         0027A 00
ESUB003  BR    R12                     07FC              *..*           0027E 00
SUB004   STM   R2,R5,424(R13)          9025 D1A8         *..Jy*         00280 00
         L     R2,396(,R13)            5820 D18C         *..J.*         00284 00
         L     R3,400(,R13)            5830 D190         *..J.*         00288 00
         XR    R4,R4                   1744              *..*           0028C 00
         XR    R5,R5                   1755              *..*           0028E 00
         MVCL  R2,R4                   0E24              *..*           00290 00
         LM    R2,R5,424(R13)          9825 D1A8         *q.Jy*         00292 00
ESUB004  BR    R12                     07FC              *..*           00296 00
SUB005   STM   R2,R5,424(R13)          9025 D1A8         *..Jy*         00298 00
         L     R2,404(,R13)            5820 D194         *..Jm*         0029C 00
         L     R3,408(,R13)            5830 D198         *..Jq*         002A0 00
         XR    R4,R4                   1744              *..*           002A4 00
         XR    R5,R5                   1755              *..*           002A6 00
         MVCL  R2,R4                   0E24              *..*           002A8 00
         LM    R2,R5,424(R13)          9825 D1A8         *q.Jy*         002AA 00
ESUB005  BR    R12                     07FC              *..*           002AE 00
SUB006   L     R7,396(,R13)            5870 D18C         *..J.*         002B0 00
         LA    R7,0(R6,R7)             4176 7000         *....*         002B4 00
         MVC   0(8,R7),0(R5)           D207 7000 5000    *K...&.*       002B8 00
ESUB006  BR    R12                     07FC              *..*           002BE 00
SUB007   L     R7,404(,R13)            5870 D194         *..Jm*         002C0 00
         LA    R7,0(R6,R7)             4176 7000         *....*         002C4 00
         MVC   0(8,R7),0(R5)           D207 7000 5000    *K...&.*       002C8 00
         L     R9,60(,R4)              5890 403C         *.. .*         002CE 00
         MVC   16(2,R7),82(R9)         D201 7010 9052    *K.....*       002D2 00
         MVC   8(8,R7),104(R9)         D207 7008 9068    *K.....*       002D8 00
ESUB007  BR    R12                     07FC              *..*           002DE 00
SUB008   L     R7,388(,R13)            5870 D184         *..Jd*         002E0 00
         LA    R7,0(R6,R7)             4176 7000         *....*         002E4 00
         MVC   0(8,R7),0(R5)           D207 7000 5000    *K...&.*       002E8 00
         MVC   8(1,R7),102(R4)         D200 7008 4066    *K... .*       002EE 00
         ST    R12,116(,R13)           50C0 D074         *&{}.*         002F4 00
         BAL   R12,SUB013              45C0 B480         *.{..*         002F8 00
         L     R12,116(,R13)           58C0 D074         *.{}.*         002FC 00
ESUB008  BR    R12                     07FC              *..*           00300 00
SUB009   TM    496(R13),X'80'          9180 D1F0         *j.J0*         00302 00
         BZ    ESUB012                 4780 B47E         *...=*         00306 00
         L     R6,412(,R13)            5860 D19C         *.-J.*         0030A 00
         L     R7,388(,R13)            5870 D184         *..Jd*         0030E 00
         LA    R6,0(R6,R7)             4166 7000         *....*         00312 00
         ST    R12,120(,R13)           50C0 D078         *&{}.*         00316 00
         BAL   R12,SUB009A             45C0 B336         *.{..*         0031A 00
         L     R12,120(,R13)           58C0 D078         *.{}.*         0031E 00
         CLC   72(4,R13),FULLZERO      D503 D048 BF6C    *N.}..%*       00322 00
         BNE   LAB0470                 4770 B45C         *...**         00328 00
LAB032C  ST    R12,124(,R13)           50C0 D07C         *&{}@*         0032C 00
         BAL   R12,SUB011              45C0 B41C         *.{..*         00330 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00334 00
         L     R12,124(,R13)           58C0 D07C         *.{}@*         00338 00
         LA    R7,25(,R7)              4177 0019         *....*         0033C 00
         CR    R7,R6                   1976              *..*           00340 00
         BL    LAB032C                 4740 B318         *. ..*         00342 00
         B     LAB0470                 47F0 B45C         *.0.**         00346 00
SUB009A  ST    R12,128(,R13)           50C0 D080         *&{}.*         0034A 00
         BAL   R12,SUB039              45C0 BB98         *.{.q*         0034E 00
         L     R12,128(,R13)           58C0 D080         *.{}.*         00352 00
         MVI   564(R13),C' '           9240 D234         *k K.*         00356 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       0035A 00
         CR    R7,R6                   1976              *..*           00360 00
         BE    LAB03D0                 4780 B3BC         *....*         00362 00
         MVC   593(4,R13),PROC         D203 D251 BF7C    *K.K..@*       00366 00
         MVC   602(5,R13),READY        D204 D25A BFEB    *K.K!..*       0036C 00
         ST    R12,132(,R13)           50C0 D084         *&{}d*         00372 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00376 00
         L     R12,132(,R13)           58C0 D084         *.{}d*         0037A 00
         MVI   564(R13),C' '           9240 D234         *k K.*         0037E 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       00382 00
         MVC   564(8,R13),JOBNAME      D207 D234 BF24    *K.K...*       00388 00
         MVC   590(8,R13),STEPNAME     D207 D24E BF2C    *K.K+..*       0038E 00
         MVC   577(8,R13),STEPNAME     D207 D241 BF2C    *K.K...*       00394 00
         MVC   602(4,R13),USER         D203 D25A BF80    *K.K!..*       0039A 00
         ST    R12,136(,R13)           50C0 D088         *&{}h*         003A0 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         003A4 00
         L     R12,136(,R13)           58C0 D088         *.{}h*         003A8 00
         MVI   564(R13),C'*'           925C D234         *k*K.*         003AC 00
         MVC   565(44,R13),564(R13)    D22B D235 D234    *K.K.K.*       003B0 00
         MVI   609(R13),C' '           9240 D261         *k K/*         003B6 00
         MVC   610(34,R13),609(R13)    D221 D262 D261    *K.K.K/*       003BA 00
         ST    R12,140(,R13)           50C0 D08C         *&{}.*         003C0 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         003C4 00
         L     R12,140(,R13)           58C0 D08C         *.{}.*         003C8 00
         B     ESUB009                 47F0 B3D4         *.0.M*         003CC 00
LAB03D0  MVC   564(30,R13),LAB0FC8     D21D D234 BFB4    *K.K...*       003D0 00
         ST    R12,144(,R13)           50C0 D090         *&{}.*         003D6 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         003DA 00
         L     R12,144(,R13)           58C0 D090         *.{}.*         003DE 00
         MVC   72(4,R13),FOUR          D203 D048 BF84    *K.}..d*       003E2 00
ESUB009  BR    R12                     07FC              *..*           003E8 00
PUTLINE  LA    R1,544(,R13)            4110 D220         *..K.*         003EA 00
         L     R14,12(,R1)             58E0 100C         *.\..*         003EE 00
         MVI   0(R14),X'30'            9230 E000         *k.\.*         003F2 00
         MVI   1(R14),X'00'            9200 E001         *k.\.*         003F6 00
         LA    R0,560(,R13)            4100 D230         *..K.*         003FA 00
         ST    R0,4(,R14)              5000 E004         *&.\.*         003FE 00
         L     R15,16                  58F0 0010         *.0..*         00402 00
         TM    444(R15),X'80'          9180 F1BC         *j.1.*         00406 00
         BNO   LAB0418                 47E0 B404         *.\..*         0040A 00
         L     R15,444(,R15)           58F0 F1BC         *.01.*         0040E 00
         BALR  R14,R15                 05EF              *..*           00412 00
         B     ESUB010                 47F0 B41A         *.0..*         00414 00
LAB0418  BAL   R15,LAB042C             45F0 B418         *.0..*         00418 00
         DC    AL4(A000424)            00000424          *....*         0041C 00
         DC    X'00000000'             00000000          *....*         00420 00
A000424  DC    C'IKJPUTL '             C9D2D1D7E4E3D340  *IKJPUTL *     00424 00
LAB042C  SVC   6       LINK            0A06              *..*           0042C 00
ESUB010  BR    R12                     07FC              *..*           0042E 00
SUB011   MVI   564(R13),C' '           9240 D234         *k K.*         00430 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       00434 00
         MVC   564(8,R13),0(R7)        D207 D234 7000    *K.K...*       0043A 00
         TM    8(R7),X'04'             9104 7008         *j...*         00440 00
         BZ    LAB0452                 4780 B43E         *....*         00444 00
         MVC   603(3,R13),NO           D202 D25B BFF0    *K.K$.0*       00448 00
         B     LAB0458                 47F0 B444         *.0..*         0044E 00
LAB0452  MVC   603(3,R13),YES          D202 D25B BFF3    *K.K$.3*       00452 00
LAB0458  CLC   9(8,R7),DZERO           D507 7009 BF34    *N.....*       00458 00
         BE    ESUB011                 4780 B45A         *...!*         0045E 00
         MVC   590(8,R13),9(R7)        D207 D24E 7009    *K.K+..*       00462 00
         MVC   577(8,R13),0(R7)        D207 D241 7011    *K.K...*       00468 00
ESUB011  BR    R12                     07FC              *..*           0046E 00
LAB0470  ST    R12,148(,R13)           50C0 D094         *&{}m*         00470 00
         BAL   R12,SUB040              45C0 BBF0         *.{.0*         00474 00
         L     R12,148(,R13)           58C0 D094         *.{}m*         00478 00
         MVI   564(R13),C' '           9240 D234         *k K.*         0047C 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       00480 00
         ST    R12,152(,R13)           50C0 D098         *&{}q*         00486 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         0048A 00
         L     R12,152(,R13)           58C0 D098         *.{}q*         0048E 00
ESUB012  BR    R12                     07FC              *..*           00492 00
SUB013   L     R9,56(,R4)              5890 4038         *.. .*         00494 00
         C     R9,FULLZERO             5990 BF6C         *...%*         00498 00
         BE    ESUB013                 4780 B4B2         *....*         0049C 00
LAB04A0  CLC   0(8,R7),16(R9)          D507 7000 9010    *N.....*       004A0 00
         BE    LAB04BA                 4780 B4A6         *...w*         004A6 00
         L     R9,0(,R9)               5890 9000         *....*         004AA 00
         C     R9,FULLZERO             5990 BF6C         *...%*         004AE 00
         BE    ESUB013                 4780 B4B2         *....*         004B2 00
         B     LAB04A0                 47F0 B48C         *.0..*         004B6 00
LAB04BA  MVC   9(8,R7),32(R9)          D207 7009 9020    *K.....*       004BA 00
         MVC   17(8,R7),64(R9)         D207 7011 9040    *K.... *       004C0 00
ESUB013  BR    R12                     07FC              *..*           004C6 00
SUB014   TM    496(R13),C' '           9140 D1F0         *j J0*         004C8 00
         BZ    ESUB016                 4780 B5E6         *...W*         004CC 00
         TM    496(R13),C'-'           9160 D1F0         *j-J0*         004D0 00
         BO    LAB05C4                 4710 B5B0         *....*         004D4 00
         ST    R12,156(,R13)           50C0 D09C         *&{}.*         004D8 00
         BAL   R12,SUB014A             45C0 B4D8         *.{.Q*         004DC 00
         BAL   R12,SUB015              45C0 B532         *.{..*         004E0 00
         L     R12,156(,R13)           58C0 D09C         *.{}.*         004E4 00
         B     LAB05D8                 47F0 B5C4         *.0.D*         004E8 00
SUB014A  CP    484(4,R13),P2           F930 D1E4 BFF6    *9.JU.6*       004EC 00
         BL    LAB0540                 4740 B52C         *. ..*         004F2 00
         L     R7,396(,R13)            5870 D18C         *..J.*         004F6 00
         L     R6,416(,R13)            5860 D1A0         *.-J.*         004FA 00
         LA    R6,0(R6,R7)             4166 7000         *....*         004FE 00
         S     R6,F08                  5B60 BF78         *$-..*         00502 00
LAB0506  L     R7,396(,R13)            5870 D18C         *..J.*         00506 00
         MVI   497(R13),X'00'          9200 D1F1         *k.J1*         0050A 00
LAB050E  CLC   0(8,R7),8(R7)           D507 7000 7008    *N.....*       0050E 00
         BNH   LAB052E                 47D0 B51A         *.}..*         00514 00
         XC    0(8,R7),8(R7)           D707 7000 7008    *P.....*       00518 00
         XC    8(8,R7),0(R7)           D707 7008 7000    *P.....*       0051E 00
         XC    0(8,R7),8(R7)           D707 7000 7008    *P.....*       00524 00
         MVI   497(R13),X'FF'          92FF D1F1         *k.J1*         0052A 00
LAB052E  LA    R7,8(,R7)               4177 0008         *....*         0052E 00
         CR    R7,R6                   1976              *..*           00532 00
         BL    LAB050E                 4740 B4FA         *. ..*         00534 00
         CLI   497(R13),X'FF'          95FF D1F1         *n.J1*         00538 00
         BE    LAB0506                 4780 B4F2         *...2*         0053C 00
LAB0540  LA    R6,8(,R6)               4166 0008         *....*         00540 00
ESUB014  BR    R12                     07FC              *..*           00544 00
SUB015   ST    R12,160(,R13)           50C0 D0A0         *&{}.*         00546 00
         BAL   R12,SUB038              45C0 BB40         *.{. *         0054A 00
         L     R12,160(,R13)           58C0 D0A0         *.{}.*         0054E 00
         ZAP   504(8,R13),484(4,R13)   F873 D1F8 D1E4    *8.J8JU*       00552 00
         CVB   R15,504(,R13)           4FF0 D1F8         *|0J8*         00558 00
         L     R7,396(,R13)            5870 D18C         *..J.*         0055C 00
         LA    R9,564(,R13)            4190 D234         *..K.*         00560 00
         SR    R6,R6                   1B66              *..*           00564 00
         LA    R14,7                   41E0 0007         *.\..*         00566 00
LAB056A  MVC   0(8,R9),0(R7)           D207 9000 7000    *K.....*       0056A 00
         LA    R6,1(,R6)               4166 0001         *....*         00570 00
         CR    R6,R15                  196F              *.?*           00574 00
         BNL   LAB058E                 47B0 B57A         *...:*         00576 00
         BCTR  R14,R0                  06E0              *.\*           0057A 00
         LTR   R14,R14                 12EE              *..*           0057C 00
         BZ    LAB058E                 4780 B57A         *...:*         0057E 00
         LA    R9,10(,R9)              4199 000A         *.r..*         00582 00
         LA    R7,8(,R7)               4170 7008         *....*         00586 00
         B     LAB056A                 47F0 B556         *.0..*         0058A 00
LAB058E  STM   R14,R1,164(R13)         90E1 D0A4         *..}u*         0058E 00
         ST    R12,180(,R13)           50C0 D0B4         *&{}.*         00592 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00596 00
         L     R12,180(,R13)           58C0 D0B4         *.{}.*         0059A 00
         LM    R14,R1,164(R13)         98E1 D0A4         *q.}u*         0059E 00
         MVI   564(R13),C' '           9240 D234         *k K.*         005A2 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       005A6 00
         CR    R6,R15                  196F              *.?*           005AC 00
         BNL   ESUB015                 47B0 B5AE         *....*         005AE 00
         LA    R7,8(,R7)               4170 7008         *....*         005B2 00
         LA    R9,564(,R13)            4190 D234         *..K.*         005B6 00
         LA    R14,7                   41E0 0007         *.\..*         005BA 00
         B     LAB056A                 47F0 B556         *.0..*         005BE 00
ESUB015  BR    R12                     07FC              *..*           005C2 00
LAB05C4  ST    R12,184(,R13)           50C0 D0B8         *&{}.*         005C4 00
         BAL   R12,SUB017              45C0 B5E8         *.{.Y*         005C8 00
         BAL   R12,SUB042              45C0 BC10         *.{..*         005CC 00
         L     R12,184(,R13)           58C0 D0B8         *.{}.*         005D0 00
         B     ESUB016                 47F0 B5E6         *.0.W*         005D4 00
LAB05D8  ST    R12,188(,R13)           50C0 D0BC         *&{}.*         005D8 00
         BAL   R12,SUB041              45C0 BC00         *.{..*         005DC 00
         L     R12,188(,R13)           58C0 D0BC         *.{}.*         005E0 00
         MVI   564(R13),C' '           9240 D234         *k K.*         005E4 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       005E8 00
         ST    R12,192(,R13)           50C0 D0C0         *&{}{*         005EE 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         005F2 00
         L     R12,192(,R13)           58C0 D0C0         *.{}{*         005F6 00
ESUB016  BR    R12                     07FC              *..*           005FA 00
SUB017   ST    R12,196(,R13)           50C0 D0C4         *&{}D*         005FC 00
         BAL   R12,SUB047              45C0 BCC4         *.{.D*         00600 00
         BAL   R12,SUB038              45C0 BB40         *.{. *         00604 00
         BAL   R12,SUB035              45C0 BA6E         *.{.>*         00608 00
         L     R12,196(,R13)           58C0 D0C4         *.{}D*         0060C 00
         TM    496(R13),X'70'          9170 D1F0         *j.J0*         00610 00
         BO    LAB0638                 4710 B624         *....*         00614 00
         ST    R12,200(,R13)           50C0 D0C8         *&{}H*         00618 00
         BAL   R12,SUB018              45C0 B63A         *.{..*         0061C 00
         BAL   R12,SUB021              45C0 B6FC         *.{..*         00620 00
         BAL   R12,SUB020              45C0 B68C         *.{..*         00624 00
         BAL   R12,SUB028              45C0 B94A         *.{.¢*         00628 00
         BAL   R12,SUB019              45C0 B66A         *.{.¦*         0062C 00
         L     R12,200(,R13)           58C0 D0C8         *.{}H*         00630 00
         B     ESUB017                 47F0 B638         *.0..*         00634 00
LAB0638  ST    R12,204(,R13)           50C0 D0CC         *&{}.*         00638 00
         BAL   R12,SUB022              45C0 B746         *.{..*         0063C 00
         BAL   R12,SUB020              45C0 B68C         *.{..*         00640 00
         BAL   R12,SUB027              45C0 B894         *.{.m*         00644 00
         L     R12,204(,R13)           58C0 D0CC         *.{}.*         00648 00
ESUB017  BR    R12                     07FC              *..*           0064C 00
SUB018   L     R3,444(,R13)            5830 D1BC         *..J.*         0064E 00
         LH    R3,10(,R3)              4830 300A         *....*         00652 00
         LA    R3,1(,R3)               4133 0001         *....*         00656 00
         LA    R1,16                   4110 0010         *....*         0065A 00
         ST    R1,376(,R13)            5010 D178         *&.J.*         0065E 00
         MR    R2,R1                   1C21              *..*           00662 00
         ST    R3,372(,R13)            5030 D174         *&.J.*         00664 00
         LR    R0,R3                   1803              *..*           00668 00
         BAL   R1,LAB066E              4510 B65A         *...!*         0066A 00
LAB066E  SVC   10      GETMAIN         0A0A              *..*           0066E 00
         ST    R1,368(,R13)            5010 D170         *&.J.*         00670 00
         LA    R1,8                    4110 0008         *....*         00674 00
         ST    R1,380(,R13)            5010 D17C         *&.J@*         00678 00
ESUB018  BR    R12                     07FC              *..*           0067C 00
SUB019   L     R1,368(,R13)            5810 D170         *..J.*         0067E 00
         L     R0,372(,R13)            5800 D174         *..J.*         00682 00
         LA    R1,0(,R1)               4110 1000         *....*         00686 00
         SVC   10      FREEMAIN        0A0A              *..*           0068A 00
         XR    R1,R1                   1711              *..*           0068C 00
         ST    R1,368(,R13)            5010 D170         *&.J.*         0068E 00
         ST    R1,372(,R13)            5010 D174         *&.J.*         00692 00
         ST    R1,376(,R13)            5010 D178         *&.J.*         00696 00
         ST    R1,380(,R13)            5010 D17C         *&.J@*         0069A 00
ESUB019  BR    R12                     07FC              *..*           0069E 00
SUB020   L     R3,368(,R13)            5830 D170         *..J.*         006A0 00
         A     R3,384(,R13)            5A30 D180         *!.J.*         006A4 00
         C     R3,368(,R13)            5930 D170         *..J.*         006A8 00
         BNH   ESUB020                 47D0 B6EE         *.}..*         006AC 00
         L     R4,376(,R13)            5840 D178         *. J.*         006B0 00
         L     R5,380(,R13)            5850 D17C         *.&J@*         006B4 00
LAB06B8  L     R2,368(,R13)            5820 D170         *..J.*         006B8 00
         MVI   497(R13),X'00'          9200 D1F1         *k.J1*         006BC 00
LAB06C0  LA    R6,0(R2,R5)             4162 5000         *..&.*         006C0 00
         LA    R7,0(R6,R4)             4176 4000         *.. .*         006C4 00
         CR    R7,R3                   1973              *..*           006C8 00
         BNL   LAB06FA                 47B0 B6E6         *...W*         006CA 00
         CLC   0(8,R6),0(R7)           D507 6000 7000    *N.-...*       006CE 00
         BNH   LAB06F2                 47D0 B6DE         *.}..*         006D4 00
         LA    R1,0(R2,R4)             4112 4000         *.. .*         006D8 00
         BCTR  R4,R0                   0640              *. *           006DC 00
         EX    R4,LAB0704              4440 B6F0         *. .0*         006DE 00
         EX    R4,LAB070A              4440 B6F6         *. .6*         006E2 00
         EX    R4,LAB0704              4440 B6F0         *. .0*         006E6 00
         LA    R4,1(,R4)               4144 0001         *....*         006EA 00
         MVI   497(R13),X'FF'          92FF D1F1         *k.J1*         006EE 00
LAB06F2  LA    R2,0(R2,R4)             4122 4000         *.. .*         006F2 00
         B     LAB06C0                 47F0 B6AC         *.0..*         006F6 00
LAB06FA  CLI   497(R13),X'FF'          95FF D1F1         *n.J1*         006FA 00
         BE    LAB06B8                 4780 B6A4         *...u*         006FE 00
ESUB020  BR    R12                     07FC              *..*           00702 00
LAB0704  XC    0(1,R2),0(R1)  *EXEC*   D700 2000 1000    *P.....*       00704 00
LAB070A  XC    0(1,R1),0(R2)  *EXEC*   D700 1000 2000    *P.....*       0070A 00
SUB021   XR    R2,R2                   1722              *..*           00710 00
         XR    R4,R4                   1744              *..*           00712 00
         XR    R6,R6                   1766              *..*           00714 00
LAB0716  ST    R12,208(,R13)           50C0 D0D0         *&{}}*         00716 00
         BAL   R12,SUB024              45C0 B834         *.{..*         0071A 00
         L     R12,208(,R13)           58C0 D0D0         *.{}}*         0071E 00
         LTR   R2,R2                   1222              *..*           00722 00
         BNP   ESUB021                 47D0 B744         *.}..*         00724 00
LAB0728  ST    R12,212(,R13)           50C0 D0D4         *&{}M*         00728 00
         BAL   R12,SUB025              45C0 B864         *.{..*         0072C 00
         L     R12,212(,R13)           58C0 D0D4         *.{}M*         00730 00
LAB0734  CLC   0(8,R3),0(R5)           D507 3000 5000    *N...&.*       00734 00
         BE    LAB0716                 4780 B702         *....*         0073A 00
         BH    LAB0728                 4720 B714         *....*         0073E 00
         ST    R12,216(,R13)           50C0 D0D8         *&{}Q*         00742 00
         BAL   R12,SUB033              45C0 B9FE         *.{..*         00746 00
         BAL   R12,SUB024              45C0 B834         *.{..*         0074A 00
         L     R12,216(,R13)           58C0 D0D8         *.{}Q*         0074E 00
         LTR   R2,R2                   1222              *..*           00752 00
         BP    LAB0734                 4720 B720         *....*         00754 00
ESUB021  BR    R12                     07FC              *..*           00758 00
SUB022   L     R1,404(,R13)            5810 D194         *..Jm*         0075A 00
         ST    R1,368(,R13)            5010 D170         *&.J.*         0075E 00
         L     R1,420(,R13)            5810 D1A4         *..Ju*         00762 00
         ST    R1,384(,R13)            5010 D180         *&.J.*         00766 00
         S     R1,404(,R13)            5B10 D194         *$.Jm*         0076A 00
         ST    R1,372(,R13)            5010 D174         *&.J.*         0076E 00
         LA    R1,78                   4110 004E         *...+*         00772 00
         ST    R1,376(,R13)            5010 D178         *&.J.*         00776 00
         LA    R1,18                   4110 0012         *....*         0077A 00
         ST    R1,380(,R13)            5010 D17C         *&.J@*         0077E 00
         XR    R2,R2                   1722              *..*           00782 00
         XR    R4,R4                   1744              *..*           00784 00
LAB0786  ST    R12,220(,R13)           50C0 D0DC         *&{}.*         00786 00
         BAL   R12,SUB025              45C0 B864         *.{..*         0078A 00
         L     R12,220(,R13)           58C0 D0DC         *.{}.*         0078E 00
         LTR   R4,R4                   1244              *..*           00792 00
         BNP   ESUB022                 47D0 B7E2         *.}.S*         00794 00
LAB0798  ST    R12,224(,R13)           50C0 D0E0         *&{}\*         00798 00
         BAL   R12,SUB024              45C0 B834         *.{..*         0079C 00
         L     R12,224(,R13)           58C0 D0E0         *.{}\*         007A0 00
LAB07A4  CLC   0(8,R3),0(R5)           D507 3000 5000    *N...&.*       007A4 00
         BL    LAB0798                 4740 B784         *. .d*         007AA 00
         BH    LAB07C2                 4720 B7AE         *....*         007AE 00
         ST    R12,228(,R13)           50C0 D0E4         *&{}U*         007B2 00
         BAL   R12,SUB023              45C0 B7E4         *.{.U*         007B6 00
         L     R12,228(,R13)           58C0 D0E4         *.{}U*         007BA 00
         B     LAB0786                 47F0 B772         *.0..*         007BE 00
LAB07C2  ST    R2,440(,R13)            5020 D1B8         *&.J.*         007C2 00
         LA    R2,460(,R13)            4120 D1CC         *..J.*         007C6 00
         ST    R12,232(,R13)           50C0 D0E8         *&{}Y*         007CA 00
         BAL   R12,SUB023              45C0 B7E4         *.{.U*         007CE 00
         L     R12,232(,R13)           58C0 D0E8         *.{}Y*         007D2 00
         MVI   18(R4),X'FF'            92FF 4012         *k. .*         007D6 00
         MVC   19(7,R4),ERRORR         D206 4013 BF3C    *K. ...*       007DA 00
         L     R2,440(,R13)            5820 D1B8         *..J.*         007E0 00
         ST    R12,236(,R13)           50C0 D0EC         *&{}.*         007E4 00
         BAL   R12,SUB025              45C0 B864         *.{..*         007E8 00
         L     R12,236(,R13)           58C0 D0EC         *.{}.*         007EC 00
         LTR   R4,R4                   1244              *..*           007F0 00
         BP    LAB07A4                 4720 B790         *....*         007F2 00
ESUB022  BR    R12                     07FC              *..*           007F6 00
SUB023   MVI   27(R4),C' '             9240 401B         *k  .*         007F8 00
         MVC   28(49,R4),27(R4)        D230 401C 401B    *K. . .*       007FC 00
         L     R7,8(,R2)               5870 2008         *....*         00802 00
         LR    R8,R7                   1887              *.g*           00806 00
         SRL   R8,24                   8880 0018         *h...*         00808 00
         LA    R7,0(R7,R8)             4177 8000         *....*         0080C 00
         LA    R8,18(,R4)              4180 4012         *.. .*         00810 00
         L     R9,456(,R13)            5890 D1C8         *..JH*         00814 00
         LA    R9,1(,R9)               4199 0001         *.r..*         00818 00
         ST    R12,240(,R13)           50C0 D0F0         *&{}0*         0081C 00
         BAL   R12,SUB034              45C0 BA5A         *.{.!*         00820 00
         L     R12,240(,R13)           58C0 D0F0         *.{}0*         00824 00
         LA    R8,27(,R4)              4180 401B         *.. .*         00828 00
         XR    R9,R9                   1799              *.r*           0082C 00
         IC    R9,8(,R2)               4390 2008         *....*         0082E 00
         L     R7,8(,R2)               5870 2008         *....*         00832 00
         LA    R7,0(,R7)               4177 0000         *....*         00836 00
         ST    R12,244(,R13)           50C0 D0F4         *&{}4*         0083A 00
         BAL   R12,SUB034              45C0 BA5A         *.{.!*         0083E 00
         L     R12,244(,R13)           58C0 D0F4         *.{}4*         00842 00
ESUB023  BR    R12                     07FC              *..*           00846 00
SUB024   LTR   R2,R2                   1222              *..*           00848 00
         BNZ   LAB085A                 4770 B846         *....*         0084A 00
         L     R2,444(,R13)            5820 D1BC         *..J.*         0084E 00
         L     R2,0(,R2)               5820 2000         *....*         00852 00
         B     LAB0872                 47F0 B85E         *.0.;*         00856 00
LAB085A  A     R2,452(,R13)            5A20 D1C4         *!.JD*         0085A 00
         TM    0(R2),X'FF'             91FF 2000         *j...*         0085E 00
         BNO   LAB0872                 47E0 B85E         *.\.;*         00862 00
         LH    R2,FFFF                 4820 BFD2         *...K*         00866 00
         LA    R3,EIGHTFF              4130 BF44         *....*         0086A 00
         B     ESUB024                 47F0 B862         *.0..*         0086E 00
LAB0872  LA    R3,0(,R2)               4130 2000         *....*         00872 00
ESUB024  BR    R12                     07FC              *..*           00876 00
SUB025   LTR   R4,R4                   1244              *..*           00878 00
         BNZ   LAB0886                 4770 B872         *....*         0087A 00
         L     R4,404(,R13)            5840 D194         *. Jm*         0087E 00
         B     LAB088A                 47F0 B876         *.0..*         00882 00
LAB0886  LA    R4,78(,R4)              4140 404E         *.  +*         00886 00
LAB088A  L     R5,404(,R13)            5850 D194         *.&Jm*         0088A 00
         A     R5,420(,R13)            5A50 D1A4         *!&Ju*         0088E 00
         CR    R4,R5                   1945              *..*           00892 00
         BL    LAB08A2                 4740 B88E         *. ..*         00894 00
         LH    R4,FFFF                 4840 BFD2         *. .K*         00898 00
         LA    R5,EIGHTFF              4150 BF44         *.&..*         0089C 00
ESUB025  BR    R12                     07FC              *..*           008A0 00
LAB08A2  LA    R5,8(,R4)               4150 4008         *.& .*         008A2 00
ESUB026  BR    R12                     07FC              *..*           008A6 00
SUB027   ST    R12,248(,R13)           50C0 D0F8         *&{}8*         008A8 00
         BAL   R12,SUB037              45C0 BAFC         *.{..*         008AC 00
         L     R12,248(,R13)           58C0 D0F8         *.{}8*         008B0 00
         MVI   564(R13),C' '           9240 D234         *k K.*         008B4 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       008B8 00
         XR    R4,R4                   1744              *..*           008BE 00
LAB08C0  ST    R12,252(,R13)           50C0 D0FC         *&{}.*         008C0 00
         BAL   R12,SUB025              45C0 B864         *.{..*         008C4 00
         L     R12,252(,R13)           58C0 D0FC         *.{}.*         008C8 00
         LTR   R4,R4                   1244              *..*           008CC 00
         BNP   LAB0946                 47D0 B932         *.}..*         008CE 00
         XR    R1,R1                   1711              *..*           008D2 00
         IC    R1,496(,R13)            4310 D1F0         *..J0*         008D4 00
         N     R1,THREE                5410 BF88         *...h*         008D8 00
         EX    R1,LAB08F8              4410 B8E4         *...U*         008DC 00
         BZ    LAB08C0                 4780 B8AC         *....*         008E0 00
         TM    26(R4),C' '             9140 401A         *j  .*         008E4 00
         BO    LAB0910                 4710 B8FC         *....*         008E8 00
         TM    26(R4),X'80'            9180 401A         *j. .*         008EC 00
         BO    LAB08FC                 4710 B8E8         *...Y*         008F0 00
         B     LAB0906                 47F0 B8F2         *.0.2*         008F4 00
LAB08F8  TM    26(R4),X'00'            9100 401A         *j. .*         008F8 00
LAB08FC  MVC   583(3,R13),REM          D202 D247 BFF7    *K.K..7*       008FC 00
         B     LAB091C                 47F0 B908         *.0..*         00902 00
LAB0906  MVC   583(3,R13),ERR          D202 D247 BFFA    *K.K...*       00906 00
         B     LAB091C                 47F0 B908         *.0..*         0090C 00
LAB0910  UNPK  583(4,R13),16(3,R4)     F332 D247 4010    *3.K. .*       00910 00
         TR    583(3,R13),LAB0FD8+2    DC02 D247 BFC6    *..K..F*       00916 00
LAB091C  MVI   582(R13),C'('           924D D246         *k(K.*         0091C 00
         MVI   586(R13),C')'           925D D24A         *k)K¢*         00920 00
         MVC   564(8,R13),0(R4)        D207 D234 4000    *K.K. .*       00924 00
         MVC   589(50,R13),27(R4)      D231 D24D 401B    *K.K( .*       0092A 00
         MVC   574(8,R13),8(R4)        D207 D23E 4008    *K.K. .*       00930 00
         ST    R12,256(,R13)           50C0 D100         *&{J.*         00936 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         0093A 00
         L     R12,256(,R13)           58C0 D100         *.{J.*         0093E 00
         B     LAB08C0                 47F0 B8AC         *.0..*         00942 00
LAB0946  MVI   564(R13),C' '           9240 D234         *k K.*         00946 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       0094A 00
         ST    R12,260(,R13)           50C0 D104         *&{J.*         00950 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00954 00
         L     R12,260(,R13)           58C0 D104         *.{J.*         00958 00
ESUB027  BR    R12                     07FC              *..*           0095C 00
SUB028   XR    R4,R4                   1744              *..*           0095E 00
         ST    R12,264(,R13)           50C0 D108         *&{J.*         00960 00
         BAL   R12,SUB036              45C0 BAC8         *.{.H*         00964 00
         L     R12,264(,R13)           58C0 D108         *.{J.*         00968 00
         XR    R2,R2                   1722              *..*           0096C 00
LAB096E  ST    R12,268(,R13)           50C0 D10C         *&{J.*         0096E 00
         BAL   R12,SUB029              45C0 B97A         *.{.:*         00972 00
         L     R12,268(,R13)           58C0 D10C         *.{J.*         00976 00
         ST    R12,272(,R13)           50C0 D110         *&{J.*         0097A 00
         BAL   R12,SUB030              45C0 B9A0         *.{..*         0097E 00
         L     R12,272(,R13)           58C0 D110         *.{J.*         00982 00
         LTR   R2,R2                   1222              *..*           00986 00
         BP    LAB096E                 4720 B95A         *...!*         00988 00
ESUB028  BR    R12                     07FC              *..*           0098C 00
SUB029   LTR   R2,R2                   1222              *..*           0098E 00
         BNZ   LAB099C                 4770 B988         *...h*         00990 00
         L     R2,368(,R13)            5820 D170         *..J.*         00994 00
         B     LAB09A0                 47F0 B98C         *.0..*         00998 00
LAB099C  LA    R2,16(,R2)              4120 2010         *....*         0099C 00
LAB09A0  L     R3,368(,R13)            5830 D170         *..J.*         009A0 00
         A     R3,384(,R13)            5A30 D180         *!.J.*         009A4 00
         CR    R2,R3                   1923              *..*           009A8 00
         BL    ESUB029                 4740 B99E         *. ..*         009AA 00
         LH    R2,FFFF                 4820 BFD2         *...K*         009AE 00
ESUB029  BR    R12                     07FC              *..*           009B2 00
SUB030   LTR   R4,R4                   1244              *..*           009B4 00
         BNZ   LAB09BE                 4770 B9AA         *....*         009B6 00
         LA    R4,564(,R13)            4140 D234         *. K.*         009BA 00
LAB09BE  LTR   R2,R2                   1222              *..*           009BE 00
         BNP   LAB09FC                 47D0 B9E8         *.}.Y*         009C0 00
         MVC   9(8,R4),8(R2)           D207 4009 2008    *K. ...*       009C4 00
         MVC   0(8,R4),0(R2)           D207 4000 2000    *K. ...*       009CA 00
         LA    R5,624(,R13)            4150 D270         *.&K.*         009D0 00
         CR    R4,R5                   1945              *..*           009D4 00
         BNL   LAB09E0                 47B0 B9CC         *....*         009D6 00
         LA    R4,20(,R4)              4140 4014         *.  .*         009DA 00
ESUB030  BR    R12                     07FC              *..*           009DE 00
LAB09E0  ST    R12,276(,R13)           50C0 D114         *&{J.*         009E0 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         009E4 00
         L     R12,276(,R13)           58C0 D114         *.{J.*         009E8 00
         MVI   564(R13),C' '           9240 D234         *k K.*         009EC 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       009F0 00
         LA    R4,564(,R13)            4140 D234         *. K.*         009F6 00
ESUB031  BR    R12                     07FC              *..*           009FA 00
LAB09FC  LA    R5,564(,R13)            4150 D234         *.&K.*         009FC 00
         CR    R4,R5                   1945              *..*           00A00 00
         BNHR  R12                     07DC              *..*           00A02 00
         ST    R12,280(,R13)           50C0 D118         *&{J.*         00A04 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00A08 00
         L     R12,280(,R13)           58C0 D118         *.{J.*         00A0C 00
ESUB032  BR    R12                     07FC              *..*           00A10 00
SUB033   LTR   R6,R6                   1266              *..*           00A12 00
         BNZ   LAB0A1C                 4770 BA08         *....*         00A14 00
         L     R6,368(,R13)            5860 D170         *.-J.*         00A18 00
LAB0A1C  L     R7,8(,R2)               5870 2008         *....*         00A1C 00
         LR    R8,R7                   1887              *.g*           00A20 00
         SRL   R8,24                   8880 0018         *h...*         00A22 00
         LA    R7,0(R7,R8)             4177 8000         *....*         00A26 00
         XR    R1,R1                   1711              *..*           00A2A 00
         IC    R1,496(,R13)            4310 D1F0         *..J0*         00A2C 00
         N     R1,THREE                5410 BF88         *...h*         00A30 00
         EX    R1,LAB0A40              4410 BA2C         *....*         00A34 00
         BZ    ESUB033                 4780 BA58         *....*         00A38 00
         B     LAB0A44                 47F0 BA30         *.0..*         00A3C 00
LAB0A40  TM    8(R7),X'00'             9100 7008         *j...*         00A40 00
LAB0A44  LA    R8,8(,R6)               4180 6008         *..-.*         00A44 00
         L     R9,456(,R13)            5890 D1C8         *..JH*         00A48 00
         ST    R12,284(,R13)           50C0 D11C         *&{J.*         00A4C 00
         BAL   R12,SUB034              45C0 BA5A         *.{.!*         00A50 00
         L     R12,284(,R13)           58C0 D11C         *.{J.*         00A54 00
         MVC   0(8,R6),0(R2)           D207 6000 2000    *K.-...*       00A58 00
         LA    R6,16(,R6)              4160 6010         *.--.*         00A5E 00
         LR    R7,R6                   1876              *..*           00A62 00
         S     R7,368(,R13)            5B70 D170         *$.J.*         00A64 00
         ST    R7,384(,R13)            5070 D180         *&.J.*         00A68 00
ESUB033  BR    R12                     07FC              *..*           00A6C 00
SUB034   STM   R2,R5,424(R13)          9025 D1A8         *..Jy*         00A6E 00
         LR    R2,R7                   1827              *..*           00A72 00
         LR    R4,R8                   1848              *..*           00A74 00
         LR    R3,R9                   1839              *..*           00A76 00
         LR    R5,R9                   1859              *..*           00A78 00
         MVCL  R4,R2                   0E42              *..*           00A7A 00
         LM    R2,R5,424(R13)          9825 D1A8         *q.Jy*         00A7C 00
ESUB034  BR    R12                     07FC              *..*           00A80 00
SUB035   CP    492(4,R13),P2           F930 D1EC BFF6    *9.J..6*       00A82 00
         BL    LAB0AD6                 4740 BAC2         *. .B*         00A88 00
         L     R7,404(,R13)            5870 D194         *..Jm*         00A8C 00
         L     R6,420(,R13)            5860 D1A4         *.-Ju*         00A90 00
         LA    R6,0(R6,R7)             4166 7000         *....*         00A94 00
         S     R6,F78                  5B60 BF70         *$-..*         00A98 00
LAB0A9C  L     R7,404(,R13)            5870 D194         *..Jm*         00A9C 00
         MVI   497(R13),X'00'          9200 D1F1         *k.J1*         00AA0 00
LAB0AA4  CLC   8(8,R7),86(R7)          D507 7008 7056    *N.....*       00AA4 00
         BNH   LAB0AC4                 47D0 BAB0         *.}..*         00AAA 00
         XC    0(78,R7),78(R7)         D74D 7000 704E    *P(...+*       00AAE 00
         XC    78(78,R7),0(R7)         D74D 704E 7000    *P(.+..*       00AB4 00
         XC    0(78,R7),78(R7)         D74D 7000 704E    *P(...+*       00ABA 00
         MVI   497(R13),X'FF'          92FF D1F1         *k.J1*         00AC0 00
LAB0AC4  LA    R7,78(R7)               4177 004E         *...+*         00AC4 00
         CR    R7,R6                   1976              *..*           00AC8 00
         BL    LAB0AA4                 4740 BA90         *. ..*         00ACA 00
         CLI   497(R13),X'FF'          95FF D1F1         *n.J1*         00ACE 00
         BE    LAB0A9C                 4780 BA88         *...h*         00AD2 00
LAB0AD6  LA    R6,78(,R6)              4166 004E         *...+*         00AD6 00
ESUB035  BR    R12                     07FC              *..*           00ADA 00
SUB036   MVI   564(R13),C' '           9240 D234         *k K.*         00ADC 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       00AE0 00
         ST    R12,288(,R13)           50C0 D120         *&{J.*         00AE6 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00AEA 00
         L     R12,288(,R13)           58C0 D120         *.{J.*         00AEE 00
         LA    R2,TERMID               4120 BF4C         *...<*         00AF2 00
         ST    R12,292(,R13)           50C0 D124         *&{J.*         00AF6 00
         BAL   R12,SUB030              45C0 B9A0         *.{..*         00AFA 00
         BAL   R12,SUB030              45C0 B9A0         *.{..*         00AFE 00
         BAL   R12,SUB030              45C0 B9A0         *.{..*         00B02 00
         BAL   R12,SUB030              45C0 B9A0         *.{..*         00B06 00
         L     R12,292(,R13)           58C0 D124         *.{J.*         00B0A 00
ESUB036  BR    R12                     07FC              *..*           00B0E 00
SUB037   MVI   564(R13),C' '           9240 D234         *k K.*         00B10 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       00B14 00
         ST    R12,296(,R13)           50C0 D128         *&{J.*         00B1A 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00B1E 00
         L     R12,296(,R13)           58C0 D128         *.{J.*         00B22 00
         MVC   564(8,R13),USERID       D207 D234 BF5C    *K.K..**       00B26 00
         MVC   574(8,R13),TERMID1      D207 D23E BF64    *K.K...*       00B2C 00
         MVI   582(R13),C'('           924D D246         *k(K.*         00B32 00
         MVI   586(R13),C')'           925D D24A         *k)K¢*         00B36 00
         MVC   583(3,R13),UCB          D202 D247 BFFD    *K.K...*       00B3A 00
         MVC   589(20,R13),LOCATLIT    D213 D24D BF8C    *K.K(..*       00B40 00
         ST    R12,300(,R13)           50C0 D12C         *&{J.*         00B46 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00B4A 00
         L     R12,300(,R13)           58C0 D12C         *.{J.*         00B4E 00
ESUB037  BR    R12                     07FC              *..*           00B52 00
SUB038   ZAP   492(4,R13),484(4,R13)   F833 D1EC D1E4    *8.J.JU*       00B54 00
         AP    492(4,R13),488(4,R13)   FA33 D1EC D1E8    *..J.JY*       00B5A 00
         MVC   564(79,R13),LAB1033     D24E D234 A01F    *K+K...*       00B60 00
         LA    R1,564(,R13)            4110 D234         *..K.*         00B66 00
         MVC   1(4,R1),472(R13)        D203 1001 D1D8    *K...JQ*       00B6A 00
         UNPK  35(4,R1),492(4,R13)     F333 1023 D1EC    *3...J.*       00B70 00
         MVZ   38(1,R1),35(R1)         D300 1026 1023    *L.....*       00B76 00
         UNPK  50(4,R1),488(4,R13)     F333 1032 D1E8    *3...JY*       00B7C 00
         MVZ   53(1,R1),50(R1)         D300 1035 1032    *L.....*       00B82 00
         MVC   21(10,R1),TSOUSER       D209 1015 BFD4    *K....M*       00B88 00
         MVC   55(15,R1),USERS1        D20E 1037 A000    *K.....*       00B8E 00
         ST    R12,304(,R13)           50C0 D130         *&{J.*         00B94 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00B98 00
         L     R12,304(,R13)           58C0 D130         *.{J.*         00B9C 00
         MVI   564(R13),C' '           9240 D234         *k K.*         00BA0 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       00BA4 00
ESUB038  BR    R12                     07FC              *..*           00BAA 00
SUB039   ZAP   492(4,R13),476(4,R13)   F833 D1EC D1DC    *8.J.J.*       00BAC 00
         AP    492(4,R13),480(4,R13)   FA33 D1EC D1E0    *..J.J\*       00BB2 00
         MVC   564(79,R13),LAB1033     D24E D234 A01F    *K+K...*       00BB8 00
         LA    R1,564(,R13)            4110 D234         *..K.*         00BBE 00
         MVC   1(4,R1),472(R13)        D203 1001 D1D8    *K...JQ*       00BC2 00
         UNPK  35(4,R1),492(4,R13)     F333 1023 D1EC    *3...J.*       00BC8 00
         MVZ   38(1,R1),35(R1)         D300 1026 1023    *L.....*       00BCE 00
         UNPK  50(4,R1),480(4,R13)     F333 1032 D1E0    *3...J\*       00BD4 00
         MVZ   53(1,R1),50(R1)         D300 1035 1032    *L.....*       00BDA 00
         MVC   21(10,R1),BATCHJOB      D209 1015 BFDE    *K.....*       00BE0 00
         MVC   55(15,R1),FREEINIT      D20E 1037 A00F    *K.....*       00BE6 00
         ST    R12,308(,R13)           50C0 D134         *&{J.*         00BEC 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00BF0 00
         L     R12,308(,R13)           58C0 D134         *.{J.*         00BF4 00
         MVI   564(R13),C' '           9240 D234         *k K.*         00BF8 00
         MVC   565(78,R13),564(R13)    D24D D235 D234    *K(K.K.*       00BFC 00
ESUB039  BR    R12                     07FC              *..*           00C02 00
SUB040   L     R0,392(,R13)            5800 D188         *..Jh*         00C04 00
         L     R1,388(,R13)            5810 D184         *..Jd*         00C08 00
         LA    R1,0(,R1)               4110 1000         *....*         00C0C 00
         SVC   10      FREEMAIN        0A0A              *..*           00C10 00
ESUB040  BR    R12                     07FC              *..*           00C12 00
SUB041   L     R0,400(,R13)            5800 D190         *..J.*         00C14 00
         L     R1,396(,R13)            5810 D18C         *..J.*         00C18 00
         LA    R1,0(,R1)               4110 1000         *....*         00C1C 00
         SVC   10      FREEMAIN        0A0A              *..*           00C20 00
ESUB041  BR    R12                     07FC              *..*           00C22 00
SUB042   ST    R12,312(,R13)           50C0 D138         *&{J.*         00C24 00
         BAL   R12,SUB045              45C0 BC8C         *.{..*         00C28 00
         L     R12,312(,R13)           58C0 D138         *.{J.*         00C2C 00
         L     R0,408(,R13)            5800 D198         *..Jq*         00C30 00
         L     R1,404(,R13)            5810 D194         *..Jm*         00C34 00
         LA    R1,0(,R1)               4110 1000         *....*         00C38 00
         SVC   10      FREEMAIN        0A0A              *..*           00C3C 00
ESUB042  BR    R12                     07FC              *..*           00C3E 00
SUB043   MVI   472(R13),C' '           9240 D1D8         *k JQ*         00C40 00
         MVC   473(3,R13),472(R13)     D202 D1D9 D1D8    *K.JRJQ*       00C44 00
         ZAP   476(4,R13),LAB1032      F830 D1DC A01E    *8.J...*       00C4A 00
         ZAP   480(4,R13),LAB1032      F830 D1E0 A01E    *8.J\..*       00C50 00
         ZAP   484(4,R13),LAB1032      F830 D1E4 A01E    *8.JU..*       00C56 00
         ZAP   488(4,R13),LAB1032      F830 D1E8 A01E    *8.JY..*       00C5C 00
ESUB043  BR    R12                     07FC              *..*           00C62 00
SUB044   LA    R0,LOCTAB               4100 BC58         *....*         00C64 00
         B     LAB0C74                 47F0 BC60         *.0.-*         00C68 00
*        MVZ   995(215,R12),450(R12)   D3D6 C3E3 C1C2    *LOCTAB*       00C6C 00
*        STH   R4,2833(,R1)            4040 1B11         *  ..*         00C72 00
LOCTAB   DC    CL8'LOCTAB  '
LAB0C74  SR    R1,R1
         SVC   8       LOAD            0A08              *..*           00C76 00
         ST    R0,444(,R13)            5000 D1BC         *&.J.*         00C78 00
         LR    R1,R0                   1810              *..*           00C7C 00
         L     R2,4(,R1)               5820 1004         *....*         00C7E 00
         ST    R2,448(,R13)            5020 D1C0         *&.J{*         00C82 00
         LH    R3,8(,R1)               4830 1008         *....*         00C86 00
         ST    R3,452(,R13)            5030 D1C4         *&.JD*         00C8A 00
         L     R3,0(,R2)               5830 2000         *....*         00C8E 00
         ST    R3,468(,R13)            5030 D1D4         *&.JM*         00C92 00
         LH    R3,4(,R2)               4830 2004         *....*         00C96 00
         ST    R3,456(,R13)            5030 D1C8         *&.JH*         00C9A 00
ESUB044  BR    R12                     07FC              *..*           00C9E 00
SUB045   BAL   R0,LAB0CAC              4500 BC98         *...q*         00CA0 00
         MVZ   995(215,R12),450(R12)   D3D6 C3E3 C1C2    *LOCTAB*       00CA4 00
         DC    C'  '                   4040              *  *           00CAA 00
LAB0CAC  SVC   9       DELETE          0A09              *..*           00CAC 00
         XR    R0,R0                   1700              *..*           00CAE 00
         ST    R0,444(,R13)            5000 D1BC         *&.J.*         00CB0 00
         ST    R0,448(,R13)            5000 D1C0         *&.J{*         00CB4 00
         ST    R0,452(,R13)            5000 D1C4         *&.JD*         00CB8 00
         ST    R0,468(,R13)            5000 D1D4         *&.JM*         00CBC 00
         ST    R0,456(,R13)            5000 D1C8         *&.JH*         00CC0 00
ESUB045  BR    R12                     07FC              *..*           00CC4 00
SUB046   NOPR  R0                      0700              *..*           00CC6 00
         BAL   R1,LAB0CD0              4510 BCBC         *....*         00CC8 00
         DC    X'00000030'             00000030          *....*         00CCC 00
LAB0CD0  L     R1,0(,R1)               5810 1000         *....*         00CD0 00
         SVC   107     MODESET         0A6B              *.,*           00CD4 00
ESUB046  BR    R12                     07FC              *..*           00CD6 00
SUB047   BAL   R1,LAB0CE0              4510 BCCC         *....*         00CD8 00
         DC    X'00000020'             00000020          *....*         00CDC 00
LAB0CE0  L     R1,0(,R1)               5810 1000         *....*         00CE0 00
         SVC   107     MODESET         0A6B              *.,*           00CE4 00
ESUB047  BR    R12                     07FC              *..*           00CE6 00
SUB048   LA    R1,512(,R13)            4110 D200         *..K.*         00CE8 00
         NI    16(R1),C' '             9440 1010         *m ..*         00CEC 00
         OI    16(R1),X'20'            9620 1010         *o...*         00CF0 00
         SVC   96      STAX            0A60              *.-*           00CF4 00
ESUB048  BR    R12                     07FC              *..*           00CF6 00
         LA    R1,512(,R13)            4110 D200         *..K.*         00CF8 00
         NI    16(R1),C' '             9440 1010         *m ..*         00CFC 00
         OI    16(R1),X'10'            9610 1010         *o...*         00D00 00
         SVC   96      STAX            0A60              *.-*           00D04 00
ESUB049  BR    R12                     07FC              *..*           00D06 00
SUB050   L     R3,16                   5830 0010         *....*         00D08 00
         L     R3,0(,R3)               5830 3000         *....*         00D0C 00
         L     R3,4(R3)                5833 0004         *....*         00D10 00
         L     R3,180(,R3)             5830 30B4         *....*         00D14 00
         XR    R15,R15                 17FF              *..*           00D18 00
         TM    236(R3),X'01'           9101 30EC         *j...*         00D1A 00
         BOR   R12                     071C              *..*           00D1E 00
         LA    R15,12                  41F0 000C         *.0..*         00D20 00
ESUB050  BR    R12                     07FC              *..*           00D24 00
SUB051   LA    R4,83                   4140 0053         *. ..*         00D26 00
         STH   R4,560(,R13)            4040 D230         *  K.*         00D2A 00
         XC    562(2,R13),562(R13)     D701 D232 D232    *P.K.K.*       00D2E 00
         LR    R4,R1                   1841              *..*           00D34 00
         LA    R2,332(,R13)            4120 D14C         *..J<*         00D36 00
         LA    R5,544(,R13)            4150 D220         *.&K.*         00D3A 00
         MVC   0(4,R2),4(R4)           D203 2000 4004    *K... .*       00D3E 00
         MVC   4(4,R2),12(R4)          D203 2004 400C    *K... .*       00D44 00
         MVC   0(4,R5),4(R4)           D203 5000 4004    *K.&. .*       00D4A 00
         MVC   4(4,R5),12(R4)          D203 5004 400C    *K.&. .*       00D50 00
         MVC   360(4,R13),FULLZERO     D203 D168 BF6C    *K.J..%*       00D56 00
         LA    R3,360(,R13)            4130 D168         *..J.*         00D5C 00
         ST    R3,8(,R2)               5030 2008         *&...*         00D60 00
         ST    R3,8(,R5)               5030 5008         *&.&.*         00D64 00
         MVC   12(4,R2),VL4PARMS       D203 200C BFA0    *K.....*       00D68 00
         LA    R3,364(,R13)            4130 D16C         *..J%*         00D6E 00
         ST    R3,16(,R2)              5030 2010         *&...*         00D72 00
         MVC   20(4,R2),0(R4)          D203 2014 4000    *K... .*       00D76 00
         MVC   24(4,R2),FULLZERO       D203 2018 BF6C    *K....%*       00D7C 00
         LA    R3,532(,R13)            4130 D214         *..K.*         00D82 00
         ST    R3,12(,R5)              5030 500C         *&.&.*         00D86 00
         LA    R1,0(,R2)               4110 2000         *....*         00D8A 00
         L     R15,16                  58F0 0010         *.0..*         00D8E 00
         TM    524(R15),X'80'          9180 F20C         *j.2.*         00D92 00
         BNO   LAB0DA4                 47E0 BD90         *.\..*         00D96 00
         L     R15,524(,R15)           58F0 F20C         *.02.*         00D9A 00
         BALR  R14,R15                 05EF              *..*           00D9E 00
         B     LAB0DBA                 47F0 BDA6         *.0.w*         00DA0 00
LAB0DA4  BAL   R15,LAB0DB8             45F0 BDA4         *.0.u*         00DA4 00
         DC    AL4(A000DB0)            00000DB0          *....*         00DA8 00
         DC    X'00000000'             00000000          *....*         00DAC 00
A000DB0  DC    C'IKJPARS '             C9D2D1D7C1D9E240  *IKJPARS *     00DB0 00
LAB0DB8  SVC   6       LINK            0A06              *..*           00DB8 00
LAB0DBA  L     R2,364(,R13)            5820 D16C         *..J%*         00DBA 00
         LH    R3,8(,R2)               4830 2008         *....*         00DBE 00
         C     R3,FULLZERO             5930 BF6C         *...%*         00DC2 00
         BE    LAB0DF2                 4780 BDDE         *....*         00DC6 00
         C     R3,FONE                 5930 BFA4         *...u*         00DCA 00
         BE    LAB0EF6                 4780 BEE2         *...S*         00DCE 00
         C     R3,FTHREE               5930 BFA8         *...y*         00DD2 00
         BE    LAB0E5A                 4780 BE46         *....*         00DD6 00
         C     R3,FTWO                 5930 BFAC         *....*         00DDA 00
         BE    LAB0E62                 4780 BE4E         *...+*         00DDE 00
         C     R3,FOUR                 5930 BF84         *...d*         00DE2 00
         BE    LAB0E6A                 4780 BE56         *....*         00DE6 00
         C     R3,FFIVE                5930 BFB0         *....*         00DEA 00
         BE    LAB0E72                 4780 BE5E         *...;*         00DEE 00
LAB0DF2  L     R1,0(,R4)               5810 4000         *.. .*         00DF2 00
         LR    R0,R1                   1801              *..*           00DF6 00
         AH    R0,0(,R1)               4A01 0000         *¢...*         00DF8 00
         LA    R1,4(,R1)               4111 0004         *....*         00DFC 00
LAB0E00  CR    R0,R1                   1901              *..*           00E00 00
         BL    LAB0E5A                 4740 BE46         *. ..*         00E02 00
         CLC   0(2,R1),LETTERX         D501 1000 BFE8    *N....Y*       00E06 00
         BE    LAB0E20                 4780 BE0C         *....*         00E0C 00
         CLI   0(R1),C' '              9540 1000         *n ..*         00E10 00
         BNE   LAB0E28                 4770 BE14         *....*         00E14 00
         LA    R1,1(,R1)               4111 0001         *....*         00E18 00
         B     LAB0E00                 47F0 BDEC         *.0..*         00E1C 00
LAB0E20  LA    R1,2(,R1)               4111 0002         *....*         00E20 00
         B     LAB0E00                 47F0 BDEC         *.0..*         00E24 00
LAB0E28  CLI   0(R1),C'U'              95E4 1000         *nU..*         00E28 00
         BE    LAB0E62                 4780 BE4E         *...+*         00E2C 00
         CLI   0(R1),C'C'              95C3 1000         *nC..*         00E30 00
         BE    LAB0E6A                 4780 BE56         *....*         00E34 00
         CLI   0(R1),C'J'              95D1 1000         *nJ..*         00E38 00
         BE    LAB0EF6                 4780 BEE2         *...S*         00E3C 00
         CLI   0(R1),C'W'              95E6 1000         *nW..*         00E40 00
         BE    LAB0E72                 4780 BE5E         *...;*         00E44 00
         LH    R3,10(,R2)              4830 200A         *....*         00E48 00
         LTR   R3,R3                   1233              *..*           00E4C 00
         BNZ   LAB0E72                 4770 BE5E         *...;*         00E4E 00
         CLI   0(R1),C'A'              95C1 1000         *nA..*         00E52 00
         BE    LAB0EF6                 4780 BEE2         *...S*         00E56 00
LAB0E5A  MVI   496(R13),X'C0'          92C0 D1F0         *k{J0*         00E5A 00
         B     LAB0EFA                 47F0 BEE6         *.0.W*         00E5E 00
LAB0E62  MVI   496(R13),C' '           9240 D1F0         *k J0*         00E62 00
         B     LAB0EFA                 47F0 BEE6         *.0.W*         00E66 00
LAB0E6A  MVI   496(R13),X'00'          9200 D1F0         *k.J0*         00E6A 00
         B     LAB0EFA                 47F0 BEE6         *.0.W*         00E6E 00
LAB0E72  ST    R12,316(,R13)           50C0 D13C         *&{J.*         00E72 00
         BAL   R12,SUB050              45C0 BCF4         *.{.4*         00E76 00
         L     R12,316(,R13)           58C0 D13C         *.{J.*         00E7A 00
         LTR   R15,R15                 12FF              *..*           00E7E 00
         BZ    LAB0EA4                 4780 BE90         *....*         00E80 00
         MVC   564(72,R13),WHEREWHO    D247 D234 A06E    *K.K..>*       00E84 00
         MVI   636(R13),C' '           9240 D27C         *k K@*         00E8A 00
         MVC   637(6,R13),636(R13)     D205 D27D D27C    *K.K'K@*       00E8E 00
         ST    R12,320(,R13)           50C0 D140         *&{J *         00E94 00
         BAL   R12,PUTLINE             45C0 B3D6         *.{.O*         00E98 00
         L     R12,320(,R13)           58C0 D140         *.{J *         00E9C 00
         B     LAB0E62                 47F0 BE4E         *.0.+*         00EA0 00
LAB0EA4  LH    R3,10(,R2)              4830 200A         *....*         00EA4 00
         LTR   R3,R3                   1233              *..*           00EA8 00
         BZ    LAB0EB6                 4780 BEA2         *...s*         00EAA 00
         MVI   496(R13),C'-'           9260 D1F0         *k-J0*         00EAE 00
         B     LAB0EBA                 47F0 BEA6         *.0.w*         00EB2 00
LAB0EB6  MVI   496(R13),X'70'          9270 D1F0         *k.J0*         00EB6 00
LAB0EBA  ST    R12,324(,R13)           50C0 D144         *&{J.*         00EBA 00
         BAL   R12,SUB044              45C0 BC50         *.{.&*         00EBE 00
         L     R12,324(,R13)           58C0 D144         *.{J.*         00EC2 00
         L     R2,364(,R13)            5820 D16C         *..J%*         00EC6 00
         LH    R3,12(,R2)              4830 200C         *....*         00ECA 00
         C     R3,FTWO                 5930 BFAC         *....*         00ECE 00
         BNE   LAB0EDE                 4770 BECA         *....*         00ED2 00
         OI    496(R13),X'01'          9601 D1F0         *o.J0*         00ED6 00
         B     LAB0EFA                 47F0 BEE6         *.0.W*         00EDA 00
LAB0EDE  C     R3,FTHREE               5930 BFA8         *...y*         00EDE 00
         BNE   LAB0EEE                 4770 BEDA         *....*         00EE2 00
         OI    496(R13),X'03'          9603 D1F0         *o.J0*         00EE6 00
         B     LAB0EFA                 47F0 BEE6         *.0.W*         00EEA 00
LAB0EEE  OI    496(R13),X'02'          9602 D1F0         *o.J0*         00EEE 00
         B     LAB0EFA                 47F0 BEE6         *.0.W*         00EF2 00
LAB0EF6  MVI   496(R13),X'80'          9280 D1F0         *k.J0*         00EF6 00
LAB0EFA  L     R1,364(,R13)            5810 D16C         *..J%*         00EFA 00
         MVI   0(R1),X'00'             4110 1000         *....*         00EFE 00
         LTR   R1,R1                   1211              *..*           00F02 00
         BZ    ESUB051                 4780 BF0C         *....*         00F04 00
LAB0F08  L     R14,0(,R1)              58E0 1000         *.\..*         00F08 00
         L     R0,4(,R1)               5800 1004         *....*         00F0C 00
         LA    R1,0(,R1)               4110 1000         *....*         00F10 00
         NOPR  10      FREEMAIN        0A0A              *..*           00F14 00
         LA    R14,0(,R14)             41E0 E000         *.\\.*         00F16 00
         LTR   R1,R14                  121E              *..*           00F1A 00
         BNZ   LAB0F08                 4770 BEF4         *...4*         00F1C 00
ESUB051  BR    R12                     07FC              *..*           00F20 00
         DC    X'000000000000'         000000000000      *......*       00F22 00
INIT     DC    C'INIT    '             C9D5C9E340404040  *INIT    *     00F28 00
STARTING DC    C'STARTING'             E2E3C1D9E3C9D5C7  *STARTING*     00F30 00
JOBNAME  DC    C'JOBNAME '             D1D6C2D5C1D4C540  *JOBNAME *     00F38 00
STEPNAME DC    C'STEPNAME'             E2E3C5D7D5C1D4C5  *STEPNAME*     00F40 00
DZERO    DC    X'00000000'             0000000000000000  *........*     00F48 00
         DC    X'00000000'                                              00F4C 00
ERRORR   DC    C'ERROR!  '             C5D9D9D6D95A4040  *ERROR!  *     00F50 00
EIGHTFF  DC    X'FFFFFFFFFFFFFFFF'     FFFFFFFFFFFFFFFF  *........*     00F58 00
TERMID   DC    C'TERM-ID '             E3C5D9D460C9C440  *TERM-ID *     00F60 00
LOCATION DC    C'LOCATION'             D3D6C3C1E3C9D6D5  *LOCATION*     00F68 00
USERID   DC    C'USER-ID '             E4E2C5D960C9C440  *USER-ID *     00F70 00
TERMID1  DC    C'TERM-ID '             E3C5D9D460C9C440  *TERM-ID *     00F78 00
FULLZERO DC    X'00000000'             00000000          *.......+*     00F80 00
F78      DC    X'0000004E'                                              00F84 00
F25      DC    X'00000019'             0000001900000008  *........*     00F88 00
F08      DC    X'00000008'                                              00F8C 00
PROC     DC    C'PROC'                 D7D9D6C3E4E2C5D9  *PROCUSER*     00F90 00
USER     DC    C'USER'                                                  00F94 00
FOUR     DC    X'00000004'             0000000400000003  *........*     00F98 00
THREE    DC    X'00000003'                                              00F9C 00
LOCATLIT DC    C'     LOC'             4040404040D3D6C3  *     LOC*     00FA0 00
         DC    C'ATION   '             C1E3C9D6D5404040  *ATION   *     00FA8 00
         DC    C'    '                 40404040          *    *         00FB0 00
VL4PARMS DC    VL4(PARMS)              000010E0          *...\*         00FB4 00
FONE     DC    X'00000001'             0000000100000003  *........*     00FB8 00
FTHREE   DC    X'00000003'                                              00FBC 00
FTWO     DC    X'00000002'             0000000200000005  *........*     00FC0 00
FFIVE    DC    X'00000005'                                              00FC4 00
LAB0FC8  DC    C'*** NO J'             5C5C5C40D5D640D1  **** NO J*     00FC8 00
         DC    C'OBS ARE '             D6C2E240C1D9C540  *OBS ARE *     00FD0 00
LAB0FD8  DC    C'ACTIVE *'             C1C3E3C9E5C5405C  *ACTIVE **     00FD8 00
         DC    C'**    '               5C5C40404040      ***    *       00FE0 00
FFFF     DC    X'FFFF'                 FFFF              *..*           00FE6 00
TSOUSER  DC    C'TSO USERS '           E3E2D640E4E2C5D9  *TSO USER*     00FE8 00
BATCHJOB DC    C'BATCH JOBS'           E240C2C1E3C3C840  *S BATCH *     00FF2 00
LETTERX  DC    C'X '                   D1D6 C2E2 E740    *JOBSX *       00FFC 00
P1       DC    X'1C'                   1CD9              *.R*           00FFE 00
READY    DC    C'READY'                C5C1C4E8D5D640    *READY*        00FFF 00
NO       DC    C'NO '                                    *NO *          01004 00
YES      DC    C'YES'                  E8C5E2            *YES*          01007 00
P2       DC    X'2C'                   2C                *.R*           0100A 00
REM      DC    C'REM'                  D9                               0100B 00
ERR      DC    C'ERR'                  C5D4C5D9D9E4C3C2  *EMERRUCB*     0100E 00
UCB      DC    C'UCB'                                                   01011 00
USERS1   DC    C'USERS '               E4E2C5D9E240E2E3  *USERS ST*     01014 00
STARTIN1 DC    C'STARTING '                                             0101A 00
FREEINIT DC    C'FREE INITIATORS'      C1D9E3C9D5C740C6  *ARTING F*     01023 00
*        DC    C'REE INIT'             D9C5C540C9D5C9E3  *REE INIT*     01024 00
*        DC    C'IATORS'               C9C1E3D6D9E2      *IATORS*       0102C 00
LAB1032  DC    X'0C'                   0C4D              *.(*           01032 00
LAB1033  DC    C'('                                                     01033 00
         DC    C'XXXX) TH'             E7E7E7E75D40E3C8  *XXXX) TH*     01034 00
         DC    C'E NUMBER'             C540D5E4D4C2C5D9  *E NUMBER*     0103C 00
         DC    C' OF XXXX'             40D6C640E7E7E7E7  * OF XXXX*     01044 00
         DC    C'XXXXXX I'             E7E7E7E7E7E740C9  *XXXXXX I*     0104C 00
         DC    C'S XXXX I'             E240E7E7E7E740C9  *S XXXX I*     01054 00
         DC    C'NCLUDING'             D5C3D3E4C4C9D5C7  *NCLUDING*     0105C 00
         DC    C' XXXX XX'             40E7E7E7E740E7E7  * XXXX XX*     01064 00
         DC    C'XXXXXXXX'             E7E7E7E7E7E7E7E7  *XXXXXXXX*     0106C 00
         DC    C'XXXXX   '             E7E7E7E7E7404040  *XXXXX   *     01074 00
         DC    C'      '               404040404040E6C8  *      WH*     0107C 00
WHEREWHO DC    C'WH'                                                    01082 00
         DC    C'ERE/WHO '             C5D9C561E6C8D640  *ERE/WHO *     01084 00
         DC    C'MUST BE '             D4E4E2E340C2C540  *MUST BE *     0108C 00
         DC    C'USED IN '             E4E2C5C440C9D540  *USED IN *     01094 00
         DC    C'TSO READ'             E3E2D640D9C5C1C4  *TSO READ*     0109C 00
         DC    C'Y MODE O'             E840D4D6C4C540D6  *Y MODE O*     010A4 00
         DC    C'NLY, LIS'             D5D3E86B40D3C9E2  *NLY, LIS*     010AC 00
         DC    C'TING ONL'             E3C9D5C740D6D5D3  *TING ONL*     010B4 00
         DC    C'Y TSO US'             E840E3E2D640E4E2  *Y TSO US*     010BC 00
         DC    C'ER-IDS'               C5D960C9C4E2F0F1  *ER-IDS01*     010C4 00
         DC    C'01'                                                    010CA 00
         DC    C'23456789'             F2F3F4F5F6F7F8F9  *23456789*     010CC 00
         DC    C'ABCDEF'               C1C2C3C4C5C6      *ABCDEF*       010D4 00
         DC    X'00000000'             00000000          *....*         010DC 00
PARMS    CSECT                                                          00000 00
         DC    X'00B000100006'         00B000100006      *......*       00000 00
         DC    C' ',X'00'              4000              * .*           00006 00
         DC    X'00060008'             00060008          *....*         00008 00
         DC    C'-',X'02'              6002              *-.*           0000C 00
         DC    X'001004',C'B'          001004C2          *...B*         0000E 00
         DC    C'ATCH'                 C1E3C3C8          *ATCH*         00012 00
         DC    X'0104'                 0104              *..*           00016 00
         DC    C'JOBS-',X'02'          D1D6C2E26002      *JOBS-.*       00018 00
         DC    X'000F02',C'T'          000F02E3          *...T*         0001E 00
         DC    C'SO'                   E2D6              *SO*           00022 00
         DC    X'0105'                 0105              *..*           00024 00
         DC    C'USERS-'               E4E2C5D9E260      *USERS-*       00026 00
         DC    X'00000802'             00000802          *....*         0002C 00
         DC    C'ALL-'                 C1D3D360          *ALL-*         00030 00
         DC    X'0200'                 0200              *..*           00034 00
         DC    X'0F04'                 0F04              *..*           00036 00
         DC    C'COUNT',X'01'          C3D6E4D5E301      *COUNT.*       00038 00
         DC    X'03',C'C'              03C3              *.C*           0003E 00
         DC    C'NT'                   D5E3              *NT*           00040 00
         DC    X'6402001603',C'U'      6402001603E4      *.....U*       00042 00
         DC    C'CBS',X'00'            C3C2E200          *CBS.*         00048 00
         DC    C'_',X'02'              6D02              *_.*           0004C 00
         DC    X'03',C'W'              03E6              *.W*           0004E 00
         DC    C'HO'                   C8D6              *HO*           00050 00
         DC    X'05',C'W'              05E6              *.W*           00052 00
         DC    C'HERE ',X'00'          C8C5D9C54000      *HERE .*       00054 00
         DC    X'0006000A'             0006000A          *....*         0005A 00
         DC    C'-',X'02'              6002              *-.*           0005E 00
         DC    X'000E03',C'F'          000E03C6          *...F*         00060 00
         DC    C'REE',X'01'            D9C5C501          *REE.*         00064 00
         DC    X'03',C'N'              03D5              *.N*           00068 00
         DC    C'OT'                   D6E3              *OT*           0006A 00
         DC    X'0000'                 0000              *..*           0006C 00
         DC    C'?',X'48'              6F48              *?.*           0006E 00
         DC    X'0000'                 0000              *..*           00070 00
         SVC   0       EXCP            0A00              *..*           00072 00
         BASSM R0,R2                   0C02              *..*           00074 00
         DC    C'SNP-'                 E2D5D760          *SNP-*         00076 00
         DC    X'0200'                 0200              *..*           0007A 00
         DC    X'1B02'                 1B02              *..*           0007C 00
         DC    C'SNP',X'03'            E2D5D703          *SNP.*         0007E 00
         DC    X'05',C'S'              05E2              *.S*           00082 00
         DC    C'ANDP'                 C1D5C4D7          *ANDP*         00084 00
         DC    X'07',C'W'              07E6              *.W*           00088 00
         DC    C'ATER55'               C1E3C5D9F5F5      *ATER55*       0008A 00
         DC    X'03',C'W'              03E6              *.W*           00090 00
         DC    C'55-',X'02'            F5F56002          *55-.*         00092 00
         DC    X'001302',C'C'          001302C3          *...C*         00096 00
         DC    C'DC'                   C4C3              *DC*           0009A 00
         DC    X'0204'                 0204              *..*           0009C 00
         DC    C'TECH'                 E3C5C3C8          *TECH*         0009E 00
         DC    X'04',C'N'              04D5              *.N*           000A2 00
         DC    C'YP4-'                 E8D7F460          *YP4-*         000A4 00
         DC    X'00000802'             00000802          *....*         000A8 00
         DC    C'ALL',X'00'            C1D3D300          *ALL.*         000AC 00
         YREGS
         END
//LKED.SYSLIN  DD *
 INCLUDE SYSLIBX
 ORDER   ACTIVE,PARMS
 MODE    RMODE(24),AMODE(31)
 SETCODE AC(0)
 SETSSI  CB498300
 ENTRY   ACTIVE
 ALIAS   ACTIVE
 NAME    USERS(R)
