)PANEL KEYLIST(ISRSNAB,ISR)
)ATTR DEFAULT(%+_)
   % TYPE(ET)                                      /* Emphasized Text */
   + TYPE(NT)                                          /* Normal Text */
   _ TYPE(NEF)                                  /* Normal Entry Field */
   ] AREA(SCRL) EXTEND(ON)                              /* Scrollarea */
)BODY WINDOW(50,10)
]SAREA39                                         ]
)AREA SAREA39
+                                                +
%To line+is the last line of those lines that    +
+shall be copied. Only numbers must be entered.  +
+You may select a maximum of three groups of     +
+lines. Only available with option 2.            +
+                                                +
+                                                +
+                                                +
)INIT
 &ZWINTTL = ' Help '
)END
