//JOBNAME JOB (ACCT,'ROOM-NBR'),'HOTTEL COMPSORT',MSGCLASS=S,CLASS=K,
//  TIME=(,30)
//PROCLIB JCLLIB ORDER=USERID.DVL.PROC
//        SET TITLE1='XXX.ASM00015'
//OUTPUT INCLUDE MEMBER=DESTCH
//*-------------------------------------------------------------------*
//*        DISPLAY SYSTEM INFO                                        *
//*-------------------------------------------------------------------*
//STEP1    EXEC PGM=COBSYS
//STEPLIB  DD  DSN=PREFIX.DVL.BATLOAD,DISP=SHR
//SYSOUT   DD  SYSOUT=*
//*-------------------------------------------------------------------*
//*        ASSEMBLY                                                   *
//*-------------------------------------------------------------------*
//STEP02   EXEC HLASMCLG
//C.SYSLIB DD DSN=USERID.MACLIB,DISP=SHR
//         DD DSN=SYS1.MACLIB,DISP=SHR
//C.SYSUT2 DD DSN=&&SYSUT2,UNIT=SYSDA,
//           SPACE=(1700,(600,100))
//C.SYSPUNCH DD DUMMY
//C.SYSIN DD *
         TITLE 'COMPARISON COUNTING SORT'
         PRINT NOGEN
*---------------------------------------------------------------------*
*        28 MAR 1983 - CHARLES HOTTEL                                 *
*        COMPARISON COUNTING SORT                                     *
*                                                                     *
*        THE ART OF COMPUTER PROGRAMMING, SORTING AND SEARCHING,      *
*        2ND EDITION. PAGES 76-78.                                    *
*                                                                     *
*        SORTS R(1), ... ,R(N) ON KEYS K(1), ... ,K(N) BY MAINTAINING *
*        AN AUXILLARY TABLE COUNT(1), ... ,COUNT(N) TO COUNT THE      *
*        NUMBER OF KEYS LESS THAN A GIVEN KEY.  AT THE CONCLUSION     *
*        COUNT(J) + 1 SPECIFIES THE FINAL POSITION OF R(J).           *
*                                                                     *
*        NO MOVEMENT OF RECORDS, STABLE, NOT EFFICIENT WHEN LARGE     *
*        NUMBER OF RECORDS.                                           *
*---------------------------------------------------------------------*
*        22 AUG 2002 - CHARLES HOTTEL                                 *
*                                                                     *
*        UPDATED JCL TO RUN COBSYS COBOL PROGRAM WHICH DISPLAYS       *
*        SYSTEM INFORMATION. COBSYS WAS WRITTEN BY GILBERT ST. FLOUR. *
*                                                                     *
*        CHANGED TIMING ROUTINES TO DISPLAY TIMES IN MICROSECONDS     *
*        TIMING ROUTINE IS FROM RICK HEVENER'S ARTCILE "LARGE SYSTEM  *
*        INSTRUCTION TIMINGS", TECHNICAL SUPPORT AUGUST 1997.         *
*---------------------------------------------------------------------*
COMPSORT START
         STM   R14,R12,12(R13)
         BALR  R15,0
         USING *,R15
         L     R1,MAIN-16
         ST    R13,4(R1)
         ST    R1,8(R13)
         LR    R13,R1
         LM    R10,R12,MAIN-12
         DROP  R15
         USING MAIN,R10,R11,R12
         B     MAIN
         DC    A(SAVE,MAIN,MAIN+4096,MAIN+8192)
*---------------------------------------------------------------------*
*   MAIN LINE CODE                                                    *
*---------------------------------------------------------------------*
MAIN     EQU   *
         OPEN  (OUTFILE,OUTPUT)
         STIMER TASK,BINTVL=LONGTIME
         CPUTIMER MIC,BGNTIME
         L     R15,=A(SORTRTN)
         BAL   R14,SENTER          SORT
         CPUTIMER MIC,ENDTIME
         L     R15,=A(CALCTIME)
         BAL   R14,SENTER          CALCULATE MICROSECONDS
         L     R15,=A(PRTRTN)
         BAL   R14,SENTER          PRINT SORTED VALUES
         CLOSE (OUTFILE)
MAIN99   SR    R15,R15
         B     SEXIT
         TITLE 'COMMON SUBROUTINE ENTRY/EXIT'
*
*   COMMON SUBROUTINE ENTRY
*
SENTER   STM   R14,R12,12(R13)
         C     R13,=A(SAVEND)
         BL    SENTER1
         DC    H'0'
         DC    C'SAVE AREA OVERFLOW'
SENTER1  LR    R9,R15
         LA    R15,72(R13)
         ST    R15,8(R13)
         ST    R13,4(R15)
         LR    R13,R15
         BR    R9
*
*   COMMON SUBROUTINE EXIT
*
SEXIT    L     R13,4(R13)
         L     R14,12(R13)
         LM    R0,R12,20(R13)
         OI    15(R13),X'01'
         BR    R14
         TITLE 'REGISTER EQUATES AND USAGE'
*
*   REGISTER EQUATES
*
R0       EQU   0
R1       EQU   1
R2       EQU   2
R3       EQU   3
R4       EQU   4
R5       EQU   5
R6       EQU   6
R7       EQU   7
R8       EQU   8
R9       EQU   9   SENTER BRANCH TO SUBROUTINE, SUBROUTINE USES AS BASE
R10      EQU   10  BASE REGISTER FOR MAIN
R11      EQU   11  BASE REGISTER FOR MAIN
R12      EQU   12  BASE REGISTER FOR MAIN
R13      EQU   13  SAVE AREA ADDRESS
R14      EQU   14  SEXIT RETURN ADDRESS
R15      EQU   15  BRANCH TO ADDRESS, SENTER COPIES TO R9
*                  RETURN CODE FROM SUBROUTINE
         TITLE 'LITERALS'
         LTORG
         TITLE 'MAIN ROUTINE DATA'
         DS    0D
DBLWORD  DS    D
BGNTIME  DS    D                   BEGIN TIME
ENDTIME  DS    D                   END TIME
LONGTIME DC    F'2E9'
COUNTS   DC    1000F'0'
LASTCNT  EQU   *-4
SW       DC    X'00'
*
TIMEREC  DS    0CL133
         DC    C'1'
         DC    CL15'ELAPSED TIME = '
MSGHOLD  DS    CL15
         DC    CL14' MICROSECONDS.'
         DC    CL88' '
*
OUTREC   DS    0CL133
         DC    C' '
OUTKEY   DS    CL10
         DC    CL122' '
*
OUTFILE  DCB   DSORG=PS,                                               X
               RECFM=FBA,                                              X
               MACRF=PM,                                               X
               BLKSIZE=27930,                                          X
               LRECL=133,                                              X
               DDNAME=PRTOUT
*
UNSORTED  EQU  *
          DC   CL10'2113148651'
          DC   CL10'1170852922'
          DC   CL10'2144637213'
          DC   CL10'5195953924'
          DC   CL10'8807543455'
          DC   CL10'9477994206'
          DC   CL10'1563502577'
          DC   CL10'0930832968'
          DC   CL10'5765477779'
          DC   CL10'9159017410'
          DC   CL10'2979680261'
          DC   CL10'3010102732'
          DC   CL10'3416289223'
          DC   CL10'6291772134'
          DC   CL10'1300971865'
          DC   CL10'3325756816'
          DC   CL10'4499203387'
          DC   CL10'3090555978'
          DC   CL10'7385386989'
          DC   CL10'9984956820'
          DC   CL10'8828773871'
          DC   CL10'7724354542'
          DC   CL10'3248183233'
          DC   CL10'8561872344'
          DC   CL10'9967522275'
          DC   CL10'0906281426'
          DC   CL10'2584106197'
          DC   CL10'2488720988'
          DC   CL10'3741778199'
          DC   CL10'1510218230'
          DC   CL10'9580829481'
          DC   CL10'2682008352'
          DC   CL10'0216719243'
          DC   CL10'6750654554'
          DC   CL10'5879594685'
          DC   CL10'8979968036'
          DC   CL10'0826611007'
          DC   CL10'2141727998'
          DC   CL10'6819051409'
          DC   CL10'0847201640'
          DC   CL10'2836247091'
          DC   CL10'4531464162'
          DC   CL10'5778297253'
          DC   CL10'4082518764'
          DC   CL10'6189589095'
          DC   CL10'9987216646'
          DC   CL10'1515117817'
          DC   CL10'5945977008'
          DC   CL10'5081606619'
          DC   CL10'9188307050'
          DC   CL10'9875426701'
          DC   CL10'5201121972'
          DC   CL10'0269317263'
          DC   CL10'8261864974'
          DC   CL10'0129905505'
          DC   CL10'8048427256'
          DC   CL10'0218026627'
          DC   CL10'4677868018'
          DC   CL10'9473843829'
          DC   CL10'7805934460'
          DC   CL10'1658768311'
          DC   CL10'7899381782'
          DC   CL10'8906179273'
          DC   CL10'7473093184'
          DC   CL10'5012943915'
          DC   CL10'4963999866'
          DC   CL10'1783737437'
          DC   CL10'1993801028'
          DC   CL10'9420163039'
          DC   CL10'4052483870'
          DC   CL10'4826671921'
          DC   CL10'3114643592'
          DC   CL10'7785283283'
          DC   CL10'6380603394'
          DC   CL10'2231104325'
          DC   CL10'6214334476'
          DC   CL10'6340650247'
          DC   CL10'0430176038'
          DC   CL10'8824964249'
          DC   CL10'7360355280'
          DC   CL10'7699537531'
          DC   CL10'4615307402'
          DC   CL10'9883029293'
          DC   CL10'2128795604'
          DC   CL10'3256786735'
          DC   CL10'6959831086'
          DC   CL10'5297165057'
          DC   CL10'7403393048'
          DC   CL10'2072647459'
          DC   CL10'5241948690'
          DC   CL10'6277765141'
          DC   CL10'5449773212'
          DC   CL10'1055817303'
          DC   CL10'0342069814'
          DC   CL10'5642391145'
          DC   CL10'8040889696'
          DC   CL10'7341681867'
          DC   CL10'1209852058'
          DC   CL10'0027612669'
          DC   CL10'9289664100'
          DC   CL10'0241754751'
          DC   CL10'3946441022'
          DC   CL10'6040047313'
          DC   CL10'1124826024'
          DC   CL10'9020317555'
          DC   CL10'1977910306'
          DC   CL10'4442600677'
          DC   CL10'7025953068'
          DC   CL10'6034259879'
          DC   CL10'1175901510'
          DC   CL10'8951906361'
          DC   CL10'9713710832'
          DC   CL10'4452119323'
          DC   CL10'5061464234'
          DC   CL10'1102965965'
          DC   CL10'8971292916'
          DC   CL10'7848321487'
          DC   CL10'2908096078'
          DC   CL10'1916989089'
          DC   CL10'8653060920'
          DC   CL10'7448619971'
          DC   CL10'9639982642'
          DC   CL10'6788433333'
          DC   CL10'9216384444'
          DC   CL10'3682736375'
          DC   CL10'2901437526'
          DC   CL10'4087244297'
          DC   CL10'5792681088'
          DC   CL10'3980200299'
          DC   CL10'1553542330'
          DC   CL10'2452295581'
          DC   CL10'3893656452'
          DC   CL10'0425389343'
          DC   CL10'3133986654'
          DC   CL10'8632028785'
          DC   CL10'7328744136'
          DC   CL10'0967769107'
          DC   CL10'7496108098'
          DC   CL10'9008293509'
          DC   CL10'7789745740'
          DC   CL10'8363333191'
          DC   CL10'1923132262'
          DC   CL10'5619387353'
          DC   CL10'4838670864'
          DC   CL10'3903243195'
          DC   CL10'1493612746'
          DC   CL10'3578295917'
          DC   CL10'0714777108'
          DC   CL10'0265668719'
          DC   CL10'9354071150'
          DC   CL10'3262132801'
          DC   CL10'8456810072'
          DC   CL10'1506827363'
          DC   CL10'6834837074'
          DC   CL10'9528779605'
          DC   CL10'6316443356'
          DC   CL10'0287224727'
          DC   CL10'5025088118'
          DC   CL10'3496725929'
          DC   CL10'8318918560'
          DC   CL10'4909094411'
          DC   CL10'9503089882'
          DC   CL10'2104109373'
          DC   CL10'2106885284'
          DC   CL10'3621038015'
          DC   CL10'0397635966'
          DC   CL10'8742955537'
          DC   CL10'2883441128'
          DC   CL10'2925865139'
          DC   CL10'2836687970'
          DC   CL10'6744618021'
          DC   CL10'8350371692'
          DC   CL10'2307633383'
          DC   CL10'0119215494'
          DC   CL10'8372418425'
          DC   CL10'6017590576'
          DC   CL10'1873888347'
          DC   CL10'5626236138'
          DC   CL10'7257486349'
          DC   CL10'3139779380'
          DC   CL10'3889103631'
          DC   CL10'1567055502'
          DC   CL10'3893799393'
          DC   CL10'2816227704'
          DC   CL10'6055320835'
          DC   CL10'5136707186'
          DC   CL10'3888423157'
          DC   CL10'9469873148'
          DC   CL10'5675989559'
          DC   CL10'7540592790'
          DC   CL10'9142951241'
          DC   CL10'5001541312'
          DC   CL10'1519007403'
          DC   CL10'0622321914'
          DC   CL10'5022145245'
          DC   CL10'5395385796'
          DC   CL10'6274959967'
          DC   CL10'1510752158'
          DC   CL10'3845774769'
          DC   CL10'8431528200'
          DC   CL10'8986560851'
          DC   CL10'9782229122'
          DC   CL10'8719657413'
          DC   CL10'8441898124'
          DC   CL10'5705291655'
          DC   CL10'6114026406'
          DC   CL10'3801898777'
          DC   CL10'5725273168'
          DC   CL10'9911241979'
          DC   CL10'8284985610'
          DC   CL10'9580332461'
          DC   CL10'8317518932'
          DC   CL10'3912149423'
          DC   CL10'1659356334'
          DC   CL10'6617160065'
          DC   CL10'4293029016'
          DC   CL10'0517639587'
          DC   CL10'8969836178'
          DC   CL10'0496791189'
          DC   CL10'5653365020'
          DC   CL10'2764666071'
          DC   CL10'0295810742'
          DC   CL10'6392883433'
          DC   CL10'2139096544'
          DC   CL10'0350150475'
          DC   CL10'0612793626'
          DC   CL10'5750582397'
          DC   CL10'6980841188'
          DC   CL10'6706822399'
          DC   CL10'1169066430'
          DC   CL10'2059961681'
          DC   CL10'8685504552'
          DC   CL10'2338259443'
          DC   CL10'4225518754'
          DC   CL10'9576662885'
          DC   CL10'5433720236'
          DC   CL10'0109127207'
          DC   CL10'0374688198'
          DC   CL10'0125735609'
          DC   CL10'3544489840'
          DC   CL10'8666619291'
          DC   CL10'5735000362'
          DC   CL10'0804677453'
          DC   CL10'0743022964'
          DC   CL10'3049097295'
          DC   CL10'4796208846'
          DC   CL10'1481674017'
          DC   CL10'0647777208'
          DC   CL10'8817930819'
          DC   CL10'5572035250'
          DC   CL10'7465038901'
          DC   CL10'8972698172'
          DC   CL10'9728537463'
          DC   CL10'8996009174'
          DC   CL10'1599853705'
          DC   CL10'6420659456'
          DC   CL10'1036622827'
          DC   CL10'6176508218'
          DC   CL10'3327808029'
          DC   CL10'0124102660'
          DC   CL10'3015620511'
          DC   CL10'7206997982'
          DC   CL10'1926239473'
          DC   CL10'6768877384'
          DC   CL10'4141332115'
          DC   CL10'5707472066'
          DC   CL10'9222373637'
          DC   CL10'8217281228'
          DC   CL10'2679767239'
          DC   CL10'6153092070'
          DC   CL10'5558764121'
          DC   CL10'6526299792'
          DC   CL10'1094183483'
          DC   CL10'8326027594'
          DC   CL10'3665932525'
          DC   CL10'1737046676'
          DC   CL10'1767326447'
          DC   CL10'6906496238'
          DC   CL10'0378208449'
          DC   CL10'4691403480'
          DC   CL10'7014869731'
          DC   CL10'6299003602'
          DC   CL10'7808769493'
          DC   CL10'0411859804'
          DC   CL10'3246054935'
          DC   CL10'3269783286'
          DC   CL10'5679881257'
          DC   CL10'7260553248'
          DC   CL10'0407531659'
          DC   CL10'4851436890'
          DC   CL10'6984337341'
          DC   CL10'5173509412'
          DC   CL10'5526397503'
          DC   CL10'8250774014'
          DC   CL10'2034099345'
          DC   CL10'4746081896'
          DC   CL10'5248438067'
          DC   CL10'5175852258'
          DC   CL10'3232136869'
          DC   CL10'9825592300'
          DC   CL10'8747566951'
          DC   CL10'7078217222'
          DC   CL10'6583467513'
          DC   CL10'1547170224'
          DC   CL10'1262465755'
          DC   CL10'2286342506'
          DC   CL10'8041396877'
          DC   CL10'3428793268'
          DC   CL10'1796424079'
          DC   CL10'2886269710'
          DC   CL10'5264958561'
          DC   CL10'7221527032'
          DC   CL10'8196379523'
          DC   CL10'0485448434'
          DC   CL10'0243554165'
          DC   CL10'9690965116'
          DC   CL10'0907157687'
          DC   CL10'7675776278'
          DC   CL10'7524793289'
          DC   CL10'3385869120'
          DC   CL10'5176912171'
          DC   CL10'8091838842'
          DC   CL10'8461533533'
          DC   CL10'1730008644'
          DC   CL10'2369764575'
          DC   CL10'4440349726'
          DC   CL10'5974120497'
          DC   CL10'2453201288'
          DC   CL10'6321644499'
          DC   CL10'2756790530'
          DC   CL10'8803827781'
          DC   CL10'5457552652'
          DC   CL10'2355329543'
          DC   CL10'4425250854'
          DC   CL10'1113496985'
          DC   CL10'3694896336'
          DC   CL10'6650685307'
          DC   CL10'7177468298'
          DC   CL10'4571377709'
          DC   CL10'0511433940'
          DC   CL10'4146105391'
          DC   CL10'4367068462'
          DC   CL10'7734167553'
          DC   CL10'6195575064'
          DC   CL10'6027151395'
          DC   CL10'0295004946'
          DC   CL10'3625252117'
          DC   CL10'2144977308'
          DC   CL10'5138392919'
          DC   CL10'0242199350'
          DC   CL10'2884145001'
          DC   CL10'5148786272'
          DC   CL10'1334447563'
          DC   CL10'9145381274'
          DC   CL10'8743127805'
          DC   CL10'8761075556'
          DC   CL10'0866220927'
          DC   CL10'4532128318'
          DC   CL10'3367090129'
          DC   CL10'5621486760'
          DC   CL10'6378346611'
          DC   CL10'9411106082'
          DC   CL10'4772569573'
          DC   CL10'5859069484'
          DC   CL10'8973826215'
          DC   CL10'1293508166'
          DC   CL10'1621991737'
          DC   CL10'4395321328'
          DC   CL10'3081869339'
          DC   CL10'6401696170'
          DC   CL10'1669110221'
          DC   CL10'6042427892'
          DC   CL10'0544933583'
          DC   CL10'5401039694'
          DC   CL10'0511646625'
          DC   CL10'3772702776'
          DC   CL10'4420964547'
          DC   CL10'0670956338'
          DC   CL10'2587130549'
          DC   CL10'4415227580'
          DC   CL10'7476835831'
          DC   CL10'7211151702'
          DC   CL10'8027939593'
          DC   CL10'9315691904'
          DC   CL10'7228989035'
          DC   CL10'1759059386'
          DC   CL10'9071539357'
          DC   CL10'7175433348'
          DC   CL10'0667273759'
          DC   CL10'9574480990'
          DC   CL10'0201923441'
          DC   CL10'4365677512'
          DC   CL10'9477987603'
          DC   CL10'7627426114'
          DC   CL10'9078253445'
          DC   CL10'6492977996'
          DC   CL10'2662116167'
          DC   CL10'8605152358'
          DC   CL10'2586698969'
          DC   CL10'5871856400'
          DC   CL10'9924773051'
          DC   CL10'4234405322'
          DC   CL10'6031477613'
          DC   CL10'4840642324'
          DC   CL10'8091839855'
          DC   CL10'0894858606'
          DC   CL10'5561094977'
          DC   CL10'6536513368'
          DC   CL10'6089806179'
          DC   CL10'7379753810'
          DC   CL10'6405784661'
          DC   CL10'4825735132'
          DC   CL10'3704809623'
          DC   CL10'5939740534'
          DC   CL10'4382148265'
          DC   CL10'5565101216'
          DC   CL10'7416875787'
          DC   CL10'5425916378'
          DC   CL10'7400995389'
          DC   CL10'4250573220'
          DC   CL10'5085358271'
          DC   CL10'1428066942'
          DC   CL10'9394383633'
          DC   CL10'2389120744'
          DC   CL10'2141578675'
          DC   CL10'4784105826'
          DC   CL10'3157858597'
          DC   CL10'8609761388'
          DC   CL10'7224666599'
          DC   CL10'8716714630'
          DC   CL10'3083893881'
          DC   CL10'2609800752'
          DC   CL10'6876599643'
          DC   CL10'8133182954'
          DC   CL10'5642531085'
          DC   CL10'2512272436'
          DC   CL10'8992443407'
          DC   CL10'4304448398'
          DC   CL10'6745219809'
          DC   CL10'1090578040'
          DC   CL10'5201791491'
          DC   CL10'6219336562'
          DC   CL10'2807857653'
          DC   CL10'5596327164'
          DC   CL10'5237405495'
          DC   CL10'8390001046'
          DC   CL10'8409030217'
          DC   CL10'1606377408'
          DC   CL10'3627055019'
          DC   CL10'5764563450'
          DC   CL10'9919451101'
          DC   CL10'5385074372'
          DC   CL10'2724557663'
          DC   CL10'1682953374'
          DC   CL10'3358601905'
          DC   CL10'3737691656'
          DC   CL10'8176019027'
          DC   CL10'6491948418'
          DC   CL10'8014572229'
          DC   CL10'7211070860'
          DC   CL10'5397272711'
          DC   CL10'4515414182'
          DC   CL10'7043099673'
          DC   CL10'3777461584'
          DC   CL10'0518520315'
          DC   CL10'7555744266'
          DC   CL10'4341809837'
          DC   CL10'7817561428'
          DC   CL10'8532171439'
          DC   CL10'5982500270'
          DC   CL10'5475656321'
          DC   CL10'5298755992'
          DC   CL10'7059883683'
          DC   CL10'5744251794'
          DC   CL10'1309560725'
          DC   CL10'2524558876'
          DC   CL10'8234802647'
          DC   CL10'3319616438'
          DC   CL10'8284252649'
          DC   CL10'4711251680'
          DC   CL10'5675001931'
          DC   CL10'2703499802'
          DC   CL10'0951309693'
          DC   CL10'3927724004'
          DC   CL10'0404123135'
          DC   CL10'1004535486'
          DC   CL10'2463397457'
          DC   CL10'5614513448'
          DC   CL10'0855215859'
          DC   CL10'4109725090'
          DC   CL10'9195709541'
          DC   CL10'0978045612'
          DC   CL10'9773777703'
          DC   CL10'3152278214'
          DC   CL10'8554607545'
          DC   CL10'1036074096'
          DC   CL10'6915994267'
          DC   CL10'8198652458'
          DC   CL10'6309461069'
          DC   CL10'8970320500'
          DC   CL10'2918179151'
          DC   CL10'9650793422'
          DC   CL10'3463687713'
          DC   CL10'2722314424'
          DC   CL10'8593413955'
          DC   CL10'2339574706'
          DC   CL10'4760993077'
          DC   CL10'1448433468'
          DC   CL10'7191388279'
          DC   CL10'4165437910'
          DC   CL10'3402810761'
          DC   CL10'9530143232'
          DC   CL10'6837439723'
          DC   CL10'2422232634'
          DC   CL10'1432942365'
          DC   CL10'2315437316'
          DC   CL10'8446793887'
          DC   CL10'8620256478'
          DC   CL10'4525397489'
          DC   CL10'0647477320'
          DC   CL10'2890004371'
          DC   CL10'8704495042'
          DC   CL10'5591433733'
          DC   CL10'8516432844'
          DC   CL10'2065592775'
          DC   CL10'2044061926'
          DC   CL10'5701796697'
          DC   CL10'1850521488'
          DC   CL10'3815888699'
          DC   CL10'1448838730'
          DC   CL10'5300159981'
          DC   CL10'8542248852'
          DC   CL10'2302069743'
          DC   CL10'9749315054'
          DC   CL10'5563765185'
          DC   CL10'2285848536'
          DC   CL10'5534401507'
          DC   CL10'8155628498'
          DC   CL10'1047261909'
          DC   CL10'7681922140'
          DC   CL10'2233677591'
          DC   CL10'9691804662'
          DC   CL10'2425747753'
          DC   CL10'3345279264'
          DC   CL10'3079859595'
          DC   CL10'9481197146'
          DC   CL10'4233008317'
          DC   CL10'5431977508'
          DC   CL10'8683917119'
          DC   CL10'4539127550'
          DC   CL10'8970957201'
          DC   CL10'8081562472'
          DC   CL10'0298867763'
          DC   CL10'1008725474'
          DC   CL10'7846276005'
          DC   CL10'1750507756'
          DC   CL10'1366017127'
          DC   CL10'8455968518'
          DC   CL10'1670254329'
          DC   CL10'7292854960'
          DC   CL10'0472398811'
          DC   CL10'0919922282'
          DC   CL10'5137829773'
          DC   CL10'4924053684'
          DC   CL10'1175414415'
          DC   CL10'4894180366'
          DC   CL10'5781827937'
          DC   CL10'4884001528'
          DC   CL10'3430673539'
          DC   CL10'7295504370'
          DC   CL10'7378402421'
          DC   CL10'2695284092'
          DC   CL10'7039033783'
          DC   CL10'3755663894'
          DC   CL10'8459674825'
          DC   CL10'8392614976'
          DC   CL10'1608840747'
          DC   CL10'1252476538'
          DC   CL10'1869574749'
          DC   CL10'7979475780'
          DC   CL10'2009368031'
          DC   CL10'1176047902'
          DC   CL10'2978879793'
          DC   CL10'8647956104'
          DC   CL10'5171457235'
          DC   CL10'1406211586'
          DC   CL10'4255455557'
          DC   CL10'8977793548'
          DC   CL10'5371357959'
          DC   CL10'0857169190'
          DC   CL10'4365695641'
          DC   CL10'3410613712'
          DC   CL10'2813767803'
          DC   CL10'9225330314'
          DC   CL10'2863161645'
          DC   CL10'8775370196'
          DC   CL10'6410072367'
          DC   CL10'0356352558'
          DC   CL10'8800423169'
          DC   CL10'1520984600'
          DC   CL10'8127785251'
          DC   CL10'1727381522'
          DC   CL10'5280097813'
          DC   CL10'9592186524'
          DC   CL10'5167188055'
          DC   CL10'7020490806'
          DC   CL10'4041091177'
          DC   CL10'4564553568'
          DC   CL10'9501170379'
          DC   CL10'5643322010'
          DC   CL10'6656036861'
          DC   CL10'9734751332'
          DC   CL10'3994269823'
          DC   CL10'4332924734'
          DC   CL10'3795936465'
          DC   CL10'0341973416'
          DC   CL10'2396911987'
          DC   CL10'3658796578'
          DC   CL10'3297999589'
          DC   CL10'4976581420'
          DC   CL10'8990850471'
          DC   CL10'8321123142'
          DC   CL10'3452683833'
          DC   CL10'4511944944'
          DC   CL10'4541806875'
          DC   CL10'6620218026'
          DC   CL10'2005934797'
          DC   CL10'8575481588'
          DC   CL10'0495310799'
          DC   CL10'3353162830'
          DC   CL10'5852626081'
          DC   CL10'1654896952'
          DC   CL10'5031739843'
          DC   CL10'3673647154'
          DC   CL10'3277199285'
          DC   CL10'3415624636'
          DC   CL10'4676559607'
          DC   CL10'5131008598'
          DC   CL10'1877504009'
          DC   CL10'2685466240'
          DC   CL10'5641763691'
          DC   CL10'3184472762'
          DC   CL10'2987837853'
          DC   CL10'3842431364'
          DC   CL10'1954513695'
          DC   CL10'3968593246'
          DC   CL10'9497186417'
          DC   CL10'0021777608'
          DC   CL10'4708979219'
          DC   CL10'8965891650'
          DC   CL10'0438663301'
          DC   CL10'1638250572'
          DC   CL10'0457377863'
          DC   CL10'1522697574'
          DC   CL10'4606150105'
          DC   CL10'3199523856'
          DC   CL10'8836215227'
          DC   CL10'6824188618'
          DC   CL10'8734136429'
          DC   CL10'8266839060'
          DC   CL10'2003724911'
          DC   CL10'7024630382'
          DC   CL10'5456759873'
          DC   CL10'3698845784'
          DC   CL10'3344508515'
          DC   CL10'3708816466'
          DC   CL10'4342046037'
          DC   CL10'1994641628'
          DC   CL10'2177375639'
          DC   CL10'2740708470'
          DC   CL10'7777348521'
          DC   CL10'6632012192'
          DC   CL10'6882383883'
          DC   CL10'3835275994'
          DC   CL10'4361988925'
          DC   CL10'1776871076'
          DC   CL10'2943078847'
          DC   CL10'0869536638'
          DC   CL10'7743096849'
          DC   CL10'6619899880'
          DC   CL10'6879934131'
          DC   CL10'1028796002'
          DC   CL10'0510649893'
          DC   CL10'7876388204'
          DC   CL10'3930991335'
          DC   CL10'3364087686'
          DC   CL10'2847713657'
          DC   CL10'3665273648'
          DC   CL10'8615700059'
          DC   CL10'2216813290'
          DC   CL10'6111881741'
          DC   CL10'0063381812'
          DC   CL10'4997957903'
          DC   CL10'0246582414'
          DC   CL10'4403915745'
          DC   CL10'0110866296'
          DC   CL10'9544350467'
          DC   CL10'1478252658'
          DC   CL10'4459585269'
          DC   CL10'5923848700'
          DC   CL10'5953591351'
          DC   CL10'8864169622'
          DC   CL10'7880707913'
          DC   CL10'9850258624'
          DC   CL10'0213162155'
          DC   CL10'5337606906'
          DC   CL10'1801389277'
          DC   CL10'2284873668'
          DC   CL10'7419152479'
          DC   CL10'4213406110'
          DC   CL10'6565462961'
          DC   CL10'3839559432'
          DC   CL10'1575299923'
          DC   CL10'6071816834'
          DC   CL10'3871130565'
          DC   CL10'0044709516'
          DC   CL10'7667230087'
          DC   CL10'6941536678'
          DC   CL10'8118801689'
          DC   CL10'9637885520'
          DC   CL10'3787896571'
          DC   CL10'8677951242'
          DC   CL10'9378133933'
          DC   CL10'4775657044'
          DC   CL10'1970220975'
          DC   CL10'8912574126'
          DC   CL10'0470272897'
          DC   CL10'5184641688'
          DC   CL10'1662932899'
          DC   CL10'6829686930'
          DC   CL10'5141292181'
          DC   CL10'0347745052'
          DC   CL10'1465609943'
          DC   CL10'4306179254'
          DC   CL10'1182833385'
          DC   CL10'6301600736'
          DC   CL10'4818917707'
          DC   CL10'1630588698'
          DC   CL10'3635946109'
          DC   CL10'8501210340'
          DC   CL10'5826049791'
          DC   CL10'5097340862'
          DC   CL10'0894127953'
          DC   CL10'1487783464'
          DC   CL10'4261367795'
          DC   CL10'2252189346'
          DC   CL10'2601564517'
          DC   CL10'1775777708'
          DC   CL10'6102241319'
          DC   CL10'1444855750'
          DC   CL10'4722569401'
          DC   CL10'4455138672'
          DC   CL10'9600087963'
          DC   CL10'7624869674'
          DC   CL10'6038224205'
          DC   CL10'8484739956'
          DC   CL10'8986613327'
          DC   CL10'7996608718'
          DC   CL10'3606218529'
          DC   CL10'2533023160'
          DC   CL10'0391251011'
          DC   CL10'1229538482'
          DC   CL10'4399889973'
          DC   CL10'4501837884'
          DC   CL10'9425802615'
          DC   CL10'4399652566'
          DC   CL10'8422464137'
          DC   CL10'5549481728'
          DC   CL10'9172277739'
          DC   CL10'4718112570'
          DC   CL10'7072494621'
          DC   CL10'5508940292'
          DC   CL10'2989933983'
          DC   CL10'0383088094'
          DC   CL10'1416503025'
          DC   CL10'3077327176'
          DC   CL10'0637516947'
          DC   CL10'8570796738'
          DC   CL10'0304818949'
          DC   CL10'3032523980'
          DC   CL10'0686700231'
          DC   CL10'0661744102'
          DC   CL10'9946619993'
          DC   CL10'6013020304'
          DC   CL10'9082725435'
          DC   CL10'7278163786'
          DC   CL10'6640171757'
          DC   CL10'6076953748'
          DC   CL10'4988242159'
          DC   CL10'0588657390'
          DC   CL10'4834267841'
          DC   CL10'9336349912'
          DC   CL10'2726348003'
          DC   CL10'0616034514'
          DC   CL10'5576869845'
          DC   CL10'5442562396'
          DC   CL10'4718828567'
          DC   CL10'7964352758'
          DC   CL10'7686947369'
          DC   CL10'4578912800'
          DC   CL10'6795597451'
          DC   CL10'9461157722'
          DC   CL10'7665518013'
          DC   CL10'7896530724'
          DC   CL10'6131336255'
          DC   CL10'7690923006'
          DC   CL10'6441887377'
          DC   CL10'1009393768'
          DC   CL10'5345334579'
          DC   CL10'2275690210'
          DC   CL10'3531089061'
          DC   CL10'0244567532'
          DC   CL10'5980530023'
          DC   CL10'2038908934'
          DC   CL10'4058524665'
          DC   CL10'1823645616'
          DC   CL10'2657748187'
          DC   CL10'4868476778'
          DC   CL10'3387803789'
          DC   CL10'7031389620'
          DC   CL10'7681142671'
          DC   CL10'8174979342'
          DC   CL10'9767784033'
          DC   CL10'3707569144'
          DC   CL10'6750835075'
          DC   CL10'9321130226'
          DC   CL10'9494810997'
          DC   CL10'8078001788'
          DC   CL10'1718754999'
          DC   CL10'4278411030'
          DC   CL10'3566158281'
          DC   CL10'3020793152'
          DC   CL10'8003680043'
          DC   CL10'6046911354'
          DC   CL10'1680667485'
          DC   CL10'1343776836'
          DC   CL10'4361475807'
          DC   CL10'4054368798'
          DC   CL10'0722588209'
          DC   CL10'7529154440'
          DC   CL10'3186535891'
          DC   CL10'3830408962'
          DC   CL10'2544618053'
          DC   CL10'0681335564'
          DC   CL10'2400421895'
          DC   CL10'4731985446'
          DC   CL10'1946142617'
          DC   CL10'7093977808'
          DC   CL10'7263703419'
          DC   CL10'4376019850'
          DC   CL10'2222675501'
          DC   CL10'4932226772'
          DC   CL10'4126998063'
          DC   CL10'3715241774'
          DC   CL10'4542498305'
          DC   CL10'8006156056'
          DC   CL10'0217211427'
          DC   CL10'8373228818'
          DC   CL10'0686500629'
          DC   CL10'2491407260'
          DC   CL10'6034977111'
          DC   CL10'1934646582'
          DC   CL10'8367220073'
          DC   CL10'1733029984'
          DC   CL10'1819296715'
          DC   CL10'7366688666'
          DC   CL10'6423082237'
          DC   CL10'1948521828'
          DC   CL10'8815379839'
          DC   CL10'5627716670'
          DC   CL10'5663840721'
          DC   CL10'7726068392'
          DC   CL10'1761684083'
          DC   CL10'7799100194'
          DC   CL10'2023217125'
          DC   CL10'2693983276'
          DC   CL10'3092155047'
          DC   CL10'0756256838'
          DC   CL10'3954741049'
          DC   CL10'9617348080'
          DC   CL10'3829666331'
          DC   CL10'8474892202'
          DC   CL10'7686790093'
          DC   CL10'7457852404'
          DC   CL10'3026659535'
          DC   CL10'3548439886'
          DC   CL10'4032829857'
          DC   CL10'2612833848'
          DC   CL10'8888984259'
          DC   CL10'8372701490'
          DC   CL10'0932853941'
          DC   CL10'9629518012'
          DC   CL10'2398938103'
          DC   CL10'4733686614'
          DC   CL10'8782023945'
          DC   CL10'5170458496'
          DC   CL10'0333506667'
          DC   CL10'6214652858'
          DC   CL10'2882509469'
          DC   CL10'9886176900'
          DC   CL10'1053803551'
          DC   CL10'1918345822'
          DC   CL10'1034528113'
          DC   CL10'8131002824'
          DC   CL10'5321710355'
          DC   CL10'4480439106'
          DC   CL10'6362585477'
          DC   CL10'7138113868'
          DC   CL10'7679716679'
          DC   CL10'2230174310'
          DC   CL10'7952915161'
          DC   CL10'7349775632'
          DC   CL10'3609960123'
          DC   CL10'6634201034'
          DC   CL10'6758118765'
          DC   CL10'6078781716'
          DC   CL10'5768466287'
          DC   CL10'3839616878'
          DC   CL10'3505005889'
          DC   CL10'9557093720'
          DC   CL10'1070588771'
          DC   CL10'5212207442'
          DC   CL10'1021634133'
          DC   CL10'5707681244'
          DC   CL10'1283649175'
          DC   CL10'8245886326'
          DC   CL10'7479549097'
          DC   CL10'3655561888'
          DC   CL10'5062777099'
          DC   CL10'8099335130'
          DC   CL10'1527224381'
          DC   CL10'8074041252'
          DC   CL10'1045950143'
          DC   CL10'3295843454'
          DC   CL10'7170701585'
          DC   CL10'8942152936'
          DC   CL10'1704233907'
          DC   CL10'8802348898'
          DC   CL10'7537430309'
          DC   CL10'2169298540'
          DC   CL10'8123221991'
          DC   CL10'7783677062'
          DC   CL10'4339308153'
          DC   CL10'5823087664'
          DC   CL10'8771675995'
          DC   CL10'1807981546'
          DC   CL10'5930920717'
          DC   CL10'2376377908'
          DC   CL10'2593365519'
          DC   CL10'0159383950'
          DC   CL10'3338981601'
          DC   CL10'1469514872'
          DC   CL10'0438108163'
          DC   CL10'4193813874'
          DC   CL10'2518972405'
          DC   CL10'2163772156'
          DC   CL10'0928009527'
          DC   CL10'4354048918'
          DC   CL10'4374982729'
          DC   CL10'0541991360'
          DC   CL10'9334903211'
          DC   CL10'7539954682'
          DC   CL10'3758750173'
          DC   CL10'9792422084'
          DC   CL10'2924990815'
          DC   CL10'3009924766'
          DC   CL10'6743900337'
          DC   CL10'7591761928'
          DC   CL10'5506681939'
          DC   CL10'7869520770'
          DC   CL10'3951386821'
          DC   CL10'1683396492'
          DC   CL10'9597634183'
          DC   CL10'0483312294'
          DC   CL10'8582131225'
          DC   CL10'1026839376'
          DC   CL10'8706993147'
          DC   CL10'3825916938'
          DC   CL10'3092863149'
          DC   CL10'8774372180'
          DC   CL10'6708832431'
          DC   CL10'2868240302'
          DC   CL10'0131160193'
          DC   CL10'6610884504'
          DC   CL10'8162793635'
          DC   CL10'2574915986'
          DC   CL10'3425687957'
          DC   CL10'9672913948'
          DC   CL10'4717926359'
          DC   CL10'7968945590'
          DC   CL10'4807640041'
          DC   CL10'9342886112'
          DC   CL10'0415728203'
          DC   CL10'6999538714'
          DC   CL10'6419378045'
          DC   CL10'9694554596'
          DC   CL10'4788384767'
          DC   CL10'2629152958'
          DC   CL10'4446271569'
          DC   CL10'4245641000'
LASTUN   EQU   *
*
SORTED   DS    1000CL10
         EJECT
         EJECT
COMPSRT  CSECT
*
*   REMOTE AREAS
*
SAVE     DS    90D
SAVEND   EQU   *
         TITLE 'COMPARISON COUNTING SORT'
SORTRTN  B     14(0,R9)
         USING SORTRTN,R9
         DC    AL1(8),CL9'SORTRTN'
*---------------------------------------------------------------------*
* FOR I = 1, ... ,N                                                   *
*   COUNT(I) <- ZERO                                                  *
* ENDFOR                                                              *
* FOR I = 2, ... ,N                                                   *
*   COUNT(I) <- I-1                                                   *
*   FOR J = 1, ... , I-1                                              *
*     IF K(I) < K(J)                                                  *
*       COUNT(J) <- COUNT(J) + 1                                      *
*       COUNT(I) <- COUNT(I) - 1                                      *
*     ENDIF                                                           *
*   ENDFOR                                                            *
* ENDFOR                                                              *
*---------------------------------------------------------------------*
         LA    R1,1                I-1
         LA    R2,COUNTS+4         COUNT(I)
         L     R3,=A(UNSORTED+10)  K(I)
LOOPI    LA    R4,COUNTS           COUNT(J)
         L     R5,=A(UNSORTED)     K(J)
         LR    R6,R1               COUNT(I) <- I-1
LOOPJ    CLC   0(10,R3),0(R5)      K(I) < K(J) ?
         BNL   NEXTJ               NO
         L     R7,0(R4)            YES, GET COUNT(J)
         LA    R7,1(R7)            COUNT(J) <- COUNT(J) + 1
         ST    R7,0(R4)            SAVE NEW COUNT(J)
         BCTR  R6,0                COUNT(I) <- COUNT(I) - 1
NEXTJ    LA    R4,4(R4)            NEXT COUNT(J)
         LA    R5,10(R5)           NEXT K(J)
         CR    R5,R3               DONE?
         BL    LOOPJ               BRANCH IF NOT DONE
         ST    R6,0(R2)            SAVE NEW COUNT(I)
         LA    R1,1(R1)            NEXT I-1
         LA    R2,4(R2)            NEXT COUNT(I)
         LA    R3,10(R3)           NEXT K(I)
         CL    R2,=A(LASTCNT)      DONE?
         BNH   LOOPI               BRANCH IF NOT DONE
         B     SEXIT
         LTORG
         TITLE 'CALCTIME'
CALCTIME B     14(0,R9)
         USING CALCTIME,R9
         DC    AL1(8),CL9'CALCTIME'
*---------------------------------------------------------------------*
* COMPUTE ELAPSED TIME                                                *
*---------------------------------------------------------------------*
         LM    R2,R3,BGNTIME       GET BEGIN TIME
         SL    R3,ENDTIME+4
         BC    3,CALC1
         BCTR  R2,0                BORROW
CALC1    SL    R2,ENDTIME          R2 <- ELAPSED TIME
*---------------------------------------------------------------------*
* MAKE R4 & R3 LESS THAN 2**31                                        *
* GOING INTO CALC2 THERE ARE TWO CASES:                               *
*  1. R2 IS ALREADY ZERO AND THE SLDL R2,2 BEFORE THE LOOP IS REVERSED*
*     BY THE SRDL R2,1 WITHIN THE LOOP AND BY THE SRDL R2,1           *
*     FOLLOWING THE LOOP.                                             *
*  2. R2 IS GREATER THAN ZERO. THE LOOP KEEPS SHIFTING RIGHT UNTIL R2 *
*     IS ZERO. THE SRDL R2,1 AFTER THE LOOP MAKES SURE THAT THE       *
*     LEFTMOST BIT OF R3 IS ZERO. THE VALUE IN R3 IS OVERSHIFTED TO   *
*     THE RIGHT.  SOME BITS MAY HAVE DROPPED OFF THE RIGHT END OF R3  *
*     BUT THEY ARE VERY SMALL FRACTIONS OF A MICROSECOND. THE         *
*     MULTIPLY GIVES MICROSECONDS OVERSHIFTED TO THE RIGHT. THE       *
*     SLDL R2,0(R5) EVENS OUT THE SHIFTING, GIVING MICROSECONDS.      *
*---------------------------------------------------------------------*
         LA    R6,1
         LNR   R5,R6               NBR OF SHIFTS = -1 (SET UP LOOP)
         SLDL  R2,2                RECOVER ONE IN LOOP, ONE AFTER
CALC2    AR    R5,R6               # = # + 1
         SRDL  R2,1                RECOVER 1
         LTR   R2,R2
         BNZ   CALC2
         SRDL  R2,1                NOW R2 & R3 LESS THAN 2**31
*********M     R2,=F'1E6'          CONVERT MICROSEC TO PICOSEC
*********SLDL  R2,0(R5)            RESTORE SHIFTS, BIT 51 = 1 PICOSEC
*********SRDL  R2,12               BIT 63 = 1 PICOSEC
         SLDL  R2,0(R5)            RESTORE SHIFTS, BIT 51 = 1 MICROSEC
         SRDL  R2,12               BIT 63 = 1 MICROSEC
*---------------------------------------------------------------------*
* DISPLAY RESULTS                                                     *
*---------------------------------------------------------------------*
         CVD   R3,DBLWORD
         UNPK  MSGHOLD,DBLWORD
         OI    MSGHOLD+14,X'F0'
         PUT   OUTFILE,TIMEREC
         B     SEXIT
         LTORG
         TITLE 'PRTRTN'
PRTRTN   B     14(0,R9)
         USING PRTRTN,R9
         DC    AL1(8),CL9'PRTRTN'
         L     R1,=A(UNSORTED)
         LA    R2,COUNTS
         LA    R3,1000             NUMBER OF RECORDS
PRTLOOP1 L     R5,0(R2)            GET COUNT(J)
         M     R4,=F'10'           CALC DISP INTO SORTED
         A     R5,=A(SORTED)
         MVC   0(10,R5),0(R1)      PLACE REC IN SORTED SLOT
         LA    R1,10(R1)           NEXT REC
         LA    R2,4(R2)            NEXT COUNT
         BCT   R3,PRTLOOP1         BRANCH IF MORE RECS
         LA    R2,1000             NUMBER OF RECORDS
         L     R3,=A(SORTED)
         LA    R4,56               NUMBER OF RECS PER PAGE
         LA    R5,57               COUNT RECS OUTPUT
PRTLOOP2 MVC   OUTKEY,0(R3)        PLACE IN OUTPUT REC
         LA    R5,1(R5)            COUNT REC
         CR    R5,R4
         BH    NEWPAGE             MORE THAN 56
         PUT   OUTFILE,OUTREC      LESS THAN 56
         B     PRTST
NEWPAGE  MVI   OUTREC,C'1'         NEW PAGE
         PUT   OUTFILE,OUTREC
         MVI   OUTREC,C' '         SINGLE SPACE
         SR    R5,R5
PRTST    LA    R3,10(R3)           NEXT SORTED REC
         BCT   R2,PRTLOOP2         BRANCH IF MORE RECS
         B     SEXIT
         LTORG
         END
//G.PRTOUT   DD SYSOUT=*
//G.SYSOUT   DD SYSOUT=*
//G.SYSUDUMP DD SYSOUT=*
