)ATTR DEFAULT(%+_)
)BODY
%TUTORIAL ---------------  MANUAL MANAGEMENT FACILITY  ---------------- TUTORIAL
%SELECTION ===>_ZCMD                                                           +
%
%                              ------------------
                               |     SEARCH     |
                               ------------------
+
   The%SEARCH+panel allows users to enter operands for a search of the
   LEB's Manual data base.  The following fields may be entered:

   PRODUCT/CATEGORY        1-8 characters
   PRODUCT NUMBER          1-8 characters (in the format XXXX-XXX)
   MANUAL NUMBER           1-12 characters (in the format XKKK-KKKK-KK)
   KEY                     1-9 characters (matches the 'K's in MANUAL NUMBER)
   TNL LEVEL               1-9 characters (in the format XXXX-XXXX)
   VERSION                 1-6 characters
   CURRENCY                1 character
   NUMBER OF COPIES        1-2 characters
   DESCRIPTION             1-70 characters

   If the last character of a field is an '*', a generic search will be
   performed.
)PROC
   &ZUP = LMMPH010
)END
