)ATTR DEFAULT(%+_)
)BODY
%TUTORIAL ---------------  MANUAL MANAGEMENT FACILITY  ---------------- TUTORIAL
%SELECTION ===>_ZCMD                                                           +
%
%                 -------------------------------------------
                  |     UPDATE DISTRIBUTION INFORMATION     |
                  -------------------------------------------
+
   The%U+line command allows authorised users to update distribution
   information for manuals on the LEB's Manual data base.
)PROC
   &ZUP = LMMPH090
)END
