)ATTR DEFAULT(%+_)
)BODY
%TUTORIAL ---------------  MANUAL MANAGEMENT FACILITY  ---------------- TUTORIAL
%SELECTION ===>_ZCMD                                                           +
%
%                        ------------------------------
                         |     ENTER MANUAL NUMBER    |
                         ------------------------------
+
   The%UPDATE+and%DELETE+commands required the user to enter the number of
   the manual to be Updated/Deleted.

   The format of the manual number is XXXX-XXXX-XX.
)PROC
   &ZUP = LMMPH010
)END
