)ATTR DEFAULT(%+_)
  ¢   TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF)  JUST(LEFT)
  !   TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF)  JUST(RIGHT)
)BODY
%------------------------  MANUAL MANAGEMENT FACILITY  -------------------------
%COMMAND ===>_ZCMD                                            %SCROLL ===>_Z   +
%
%S CATEGORY MANUAL NO.    #  GROUP        LOCATION     CONTACT   STATUS
)MODEL CLEAR(SEL) ROWS(SCAN)
_Z¢CATEGORY¢MANUALNO    !Z +¢GROUP       ¢LOCATION    ¢CONTACT     ¢Z+
)INIT
  .HELP = LMMPH100
  .ZVARS = '(ZSCBR SEL COPYNO STATUS)'
)END
