)ATTR DEFAULT(%+_)
)BODY
%------------------------  MANUAL MANAGEMENT FACILITY  -  ADD  -----------------
%COMMAND ===>_ZCMD                                                             +
%
%PRODUCT/CATEGORY ===>_CATEGORY+        %      CURRENCY ===>_Z+
%   MANUAL NUMBER ===>_MANUALNO    +    %PRODUCT NUMBER ===>_PRODUCT +
%          COPIES ===>_Z +              %     TNL LEVEL ===>_TNLLEVEL +
%DESCRIPTION:                           %       VERSION ===>_Z     +
%  ===>_DESCRIPT                                                              %<
)INIT
  .HELP = LMMPH020
  .ZVARS = '(CURRENCY NOCOPIES VERSION)'
)PROC
  VER (&CATEGORY,NB)
  &MAN1TO11 = TRUNC (&MANUALNO,11)
  &MAN12 = .TRAIL
  &MAN1TO9 = TRUNC (&MAN1TO11,9)
  &MAN9TO11 = .TRAIL
  VER (&MAN1TO9,NB,PICT,'AC99-9999')
  VER (&MAN9TO11,PICT,'-9')
  IF (&CURRENCY¬=R,Y,B)
    &MAN1TO11 = TRUNC (&MANUALNO,11)
    VER (&MAN1TO11,NB,PICT,'AC99-9999-9')
  VER (&MAN12,PICT,9)
  VER (&PRODUCT,NB,PICT,'CCCC-CCC')
  VER (&NOCOPIES,NB,RANGE,0,50)
  VER (&TNLLEVEL,PICT,'AC99-9999')
  VER (&DESCRIPT,NB)
)END
