)ATTR DEFAULT(%+_)
)BODY
%TUTORIAL ---------------  MANUAL MANAGEMENT FACILITY  ---------------- TUTORIAL
%SELECTION ===>_ZCMD                                                           +
%
%                           ------------------------
                            |     ADD A MANUAL     |
                            ------------------------
+
   The%ADD+panel allows authorised users to add details of a new manual
   to the LEB's Manual data base.  The following information is accepted:

   PRODUCT/CATEGORY        8 characters, required
   CURRENCY                1 character
   MANUAL NUMBER           9-12 characters in the format XXXX-XXXX-XX, required
   PRODUCT NUMBER          8 characters in the format XXXX-XXX, required
   NUMBER OF COPIES        1-50, required
   TNL LEVEL               9 characters in the format XXXX-XXXX
   VERSION                 6 characters
   DESCRIPTION             70 characters, required

                            (continued on next page)
)PROC
   &ZCONT = LMMPH030
   &ZUP = LMMPH010
)END
