)ATTR DEFAULT(%+_)
  ¢   TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF)  JUST(LEFT)
  !   TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF)  JUST(RIGHT)
)BODY
%------------------------  MANUAL MANAGEMENT FACILITY  -  UPDATE  --------------
%COMMAND ===>_ZCMD                                                             +
%
+PRODUCT/CATEGORY ===>¢CATEGORY+        +      CURRENCY ===>¢Z+
+   MANUAL NUMBER ===>¢MANUALNO    +    +PRODUCT NUMBER ===>¢PRODUCT +
+          COPIES ===>!Z +              +     TNL LEVEL ===>¢TNLLEVEL +
+DESCRIPTION:                           +       VERSION ===>¢Z     +
+  ===>¢DESCRIPT                                                              +<
%
%                           DISTRIBUTION INFORMATION
%
!Z %GROUP ===>_GROUP       %LOCATION ===>_LOCATION    +
% CONTACT ===>_CONTACT     %  STATUS ===>_Z+
)INIT
  .HELP = LMMPH110
  .ZVARS = '(CURRENCY NOCOPIES VERSION COPYNO STATUS)'
)END
