)ATTR
/* LHGN021A - LPF Generate: Job Card General Information (1)
/* ---------------------------------------------------------
/* Amended by iii on dd.mm.yy
/* Amended by NJS on 20.10.88 to remove old-style logonid stuff
/* Started by NJS on 26.11.87


     %  TYPE(TEXT)   INTENS(HIGH)             COLOR(WHITE)
/*   \  TYPE(TEXT)   INTENS(HIGH)             COLOR(YELLOW)
/*   "  TYPE(TEXT)   INTENS(HIGH)             COLOR(TURQ)
     *  TYPE(TEXT)   INTENS(HIGH)             COLOR(PINK)
     {  TYPE(TEXT)   INTENS(HIGH)             COLOR(GREEN)
     }  TYPE(TEXT)   INTENS(LOW)              COLOR(GREEN)
/*   '  TYPE(TEXT)   INTENS(LOW)              COLOR(TURQ)
     \  TYPE(TEXT)   INTENS(LOW)              COLOR(TURQ)
     +  TYPE(TEXT)   INTENS(LOW)              COLOR(BLUE)

     _  TYPE(INPUT)  INTENS(HIGH)  CAPS(ON)   JUST(LEFT)
     $  TYPE(INPUT)  INTENS(HIGH)  CAPS(OFF)  JUST(LEFT)
     ¢  TYPE(INPUT)  INTENS(LOW)   CAPS(ON)
     ¬  TYPE(INPUT)  INTENS(NON)

     !  TYPE(OUTPUT) INTENS(HIGH)  CAPS(OFF)  COLOR(WHITE)
     #  TYPE(OUTPUT) INTENS(HIGH)  CAPS(OFF)  COLOR(TURQ)
/*   |  TYPE(OUTPUT) INTENS(LOW)   CAPS(OFF)  COLOR(WHITE)
/*   @  TYPE(OUTPUT) INTENS(LOW)   CAPS(OFF)  COLOR(TURQ)
     @  TYPE(OUTPUT) INTENS(LOW)   CAPS(OFF)  COLOR(BLUE)
/*   ¦  TYPE(      ) INTENS(HIGH)             COLOR(undefined)
/*   ~  TYPE(      ) INTENS(LOW)              COLOR(undefined)
)BODY EXPAND(¦¦)
%LPF Tutorial ¦-¦ LPF JOB Card Generation ¦-¦ LPF Tutorial
+COMMAND ===>_ZCMD                                            @ZTIME+on@DATE1
@LINE03                                              #CMD              @DATE2
}                            General Information (1)
}
} The Local Productivity Facility (LPF) JOB Card Generation function may be
} used to create a Standard LOLA JOB Card.
}
} To generate a JOB Card, enter edit for the member containing your JCL, and
} in the command line at the top of the screen, enter the command\JOBC.} This
} will display a data-entry panel: other data is obtained from your logonid.
}
} The command\JOBC ?}obtains the Help menu.
}
} The command\JOBC K}creates a JOB card, attempting to Keep information
} from any current JOB Card (see further panels).
}
}
}                       +For more information press%ENTER}
)INIT
/*=====================================================================
/* Start of INITIALISATION Section
/* Set the HELP linkage.
/*---------------------------------------------------------------------
    &ZTOP    = ISR00003                 /* Top HELP Panel
    &ZUP     = LHGN021                  /* Parent HELP Panel
    &ZCONT   = LHGN021B                 /* Next HELP Panel
                                        /* Don't use ZCONT if ZSEL is set

/*=====================================================================
/* INIT section continued.
/* Set the values of various screen fields.
/*---------------------------------------------------------------------
    &LINE03  = &Z
    &CMD     = &Z
    &DATE1   = '&ZDAY/&ZMONTH/&ZYEAR'
    &DATE2   = '(&ZJDATE)'

)PROC
)END
