      /-----------------------------------------------------------------
      *
      * COMPUTED COBOL COPYBOOK TOTAL LENGTH : 615
      *
      *-----------------------------------------------------------------
      * <catalog>
        01 CATALOG.
      *    <book book-id="bk101">
           05 BOOK.
              08 BOOK-ID           PIC X(5).
      *       <book_author>Gambardella, Matthew</book_author>
              08 BOOK-AUTHOR       PIC X(30).
      *       <book_title>XML Developer's Guide</book_title>
              08 BOOK-TITLE        PIC X(50).
      *       <genre>Computer</genre>
              08 GENRE             PIC X(15).
      *       <price>44.95</price>
              08 PRICE             PIC 99.99.
      *       <publish_date>2000-10-01</publish_date>
              08 PUBLISH-DATE      PIC X(10).
      *       <description>An in-depth look at creating applications
              08 DESCRIPTION       PIC X(500).
