//SYS5930C JOB (M096,0616,99,9999),'SYSTEMS*BRIAN',NOTIFY=SYZYGY1,
//       MSGCLASS=A,CLASS=A
//ASMFCL PROC  CLASS=V,        -   SYSOUT CLASS
//             MEM=,
//             DSN='SYZYGY.PDS.DATA',
//             LOAD='SYZYGY.LINKLIB',
//             WORK1=SYSDA,        DASD OUTPUT TYPE
//             WORK2=SYSDA,        DASD WORK TYPE
//             PRI=1,              PRIMARY ALLOCATION
//             SEC=1,              SECONDARY ALLOCATION
//             ALLOC=TRK           ALLOC INCREMENT
//ASM      EXEC  PGM=IFOX00,REGION=500K,COND=EVEN,
//         PARM='LOAD,NODECK,XREF'
//SYSPRINT DD  SYSOUT=&CLASS
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.AMODGEN,DISP=SHR
//SYSUT1   DD  SPACE=(CYL,(10,10)),UNIT=&WORK2
//SYSUT2   DD  SPACE=(CYL,(10,10)),UNIT=&WORK2
//SYSUT3   DD  SPACE=(CYL,(10,10)),UNIT=&WORK2
//SYSGO    DD  DSN=&&INDXOBJ,DISP=(NEW,PASS),
//             UNIT=&WORK1.,FREE=CLOSE,
//             SPACE=(&ALLOC.,(&PRI.,&SEC.),RLSE)
//SYSIN    DD  DSN=&DSN.(&MEM),DISP=SHR
//LKED     EXEC  PGM=IEWL,REGION=256K,COND=(4,LT,ASM),
//         PARM='LIST,MAP,LET,AC=1'
//SYSPRINT DD  SYSOUT=&CLASS
//SYSUT1   DD  SPACE=(CYL,(10,10)),UNIT=&WORK2
//SYSLIB   DD  DSN=SYZYGY.LINKLIB,DISP=SHR
//SYSLMOD  DD  DSN=&LOAD.(&MEM),DISP=SHR
//SYSLIN   DD  DSN=&&INDXOBJ,DISP=(OLD,PASS)
//       PEND
//ASMFCL      EXEC ASMFCL,MEM=VOLCHECK
