//RESCUE08 JOB (XXXXX),'RESCUE BUILD',TIME=1440,CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID,REGION=0M
//*--------------------------------------------------------------------
//*  MODIFY PROCLIB
//*--------------------------------------------------------------------
//MODPROC   EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT  DD   SYSOUT=*
//SYSUT2    DD   DISP=SHR,DSN=SYS1.PROCLIB,UNIT=SYSDA,VOL=SER=RESCUE
//SYSIN     DD   DATA,DLM=$$
./  ADD NAME=BPXAS
//IEFPROC   EXEC   PGM=IEFIIC,DPRTY=12,PARM=',,&GETWORK,BPXPRJRW'
./  ADD NAME=BPXOINIT
//BPXOINIT PROC
//BPXOINIT EXEC PGM=BPXPINPR,REGION=0K,TIME=NOLIMIT
./  ADD NAME=OMVS
//OMVS PROC
//OMVS EXEC     PGM=BPXINIT,REGION=0K,TIME=NOLIMIT
./  ADD NAME=TSO
//TSO     PROC MBR=TSOKEY00
//STEP1   EXEC PGM=IKTCAS00,TIME=1440
//PARMLIB  DD  DSN=SYS1.PARMLIB(&MBR),DISP=SHR,FREE=CLOSE
//PRINTOUT DD  SYSOUT=*,FREE=CLOSE
//*
./  ADD NAME=JES2
//JES2    PROC M=JES2PARM
//IEFPROC EXEC PGM=HASJES20,TIME=1440,DPRTY=(15,15)
//HASPLIST  DD DDNAME=IEFRDER
//HASPPARM  DD DSN=SYS1.PARMLIB(&M),DISP=SHR
//PROC00    DD DSN=SYS1.PROCLIB,DISP=SHR
./  ADD NAME=VTAM
//VTAM    PROC
//VTAM    EXEC PGM=ISTINM01,REGION=2048K,
//             DPRTY=(15,15),TIME=1440,PERFORM=8
//VTAMLST   DD DSN=SYS1.VTAMLST,DISP=SHR
//VTAMLIB   DD DSN=SYS1.VTAMLIB,DISP=SHR
//SISTCLIB  DD DSN=SYS1.SISTCLIB,DISP=SHR
//SYSABEND  DD SYSOUT=*,HOLD=YES
./  ADD NAME=IKJACCNT
//IKJACCNT PROC
//IKJACCT EXEC PGM=IKJEFT01,DYNAMNBR=50,REGION=6000K,TIME=1440,
//  PARM='ISPSTART PANEL(ISR@390) NEWAPPL(ISR)'
//STEPLIB  DD  DSN=ISP.SISPLOAD,DISP=SHR
//ISPLLIB  DD  DSN=ISP.SISPLOAD,DISP=SHR
//ISPPLIB  DD  DSN=ISP.SISPPENU,DISP=SHR
//         DD  DSN=ISF.SISFPLIB,DISP=SHR
//ISPSLIB  DD  DSN=ISP.SISPSENU,DISP=SHR
//         DD  DSN=ISP.SISPSLIB,DISP=SHR
//         DD  DSN=ISF.SISFSLIB,DISP=SHR
//ISPMLIB  DD  DSN=ISP.SISPMENU,DISP=SHR
//         DD  DSN=ISF.SISFMLIB,DISP=SHR
//ISPTLIB  DD  DSN=ISP.SISPTENU,DISP=SHR
//         DD  DSN=ISF.SISFTLIB,DISP=SHR
//SYSPROC  DD  DSN=ISP.SISPCLIB,DISP=SHR
//         DD  DSN=ISF.SISFEXEC,DISP=SHR
//HASPINDX DD  DISP=SHR,DSN=ISF.HASPINDX
//ISPPROF  DD  DISP=SHR,DSN=IBMUSER.ISPPROF
//ISPTABL  DD  DDNAME=ISPPROF
//SYSPRINT DD  TERM=TS,SYSOUT=*
//SYSTERM  DD  TERM=TS,SYSOUT=*
//SYSIN    DD  TERM=TS
$$
//*--------------------------------------------------------------------
//*  COPY ONLY NEEDED MEMBERS FROM PROCLIB
//*--------------------------------------------------------------------
//COPYPROC  EXEC PGM=IEBCOPY
//SYSUT3    DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT4    DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//PROCIN    DD  DISP=SHR,DSN=SYS1.IBM.PROCLIB
//PROCOUT   DD  DISP=SHR,DSN=SYS1.PROCLIB,UNIT=SYSDA,VOL=SER=RESCUE
//SYSPRINT  DD  SYSOUT=*
//SYSIN     DD  *
    COPY I=PROCIN,O=PROCOUT
    S    M=LLA
    S    M=DUMPSRV
    S    M=IEESYSAS
    S    M=IEEVMPCR
    S    M=INIT
