)ATTR DEFAULT(%+¢)
  % TYPE(TEXT) INTENS(LOW) SKIP(ON)
  + TYPE(TEXT) INTENS(HIGH) SKIP(ON)
  ¢ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
  { TYPE(OUTPUT) INTENS(LOW) CAPS(ON) JUST(ASIS)
)BODY
+----------------------------   DELUXE Phone List   ----------------------------
+COMMAND ===>¢ZCMD                                    +SCROLL ===>¢AMT +
+
+     Extension        Plant                         Room
+   -------------    ---------   -------------------------------------------
)MODEL ROWS(SCAN)
+      {Z   +         {Z   +      {Z                                     +
)INIT
 .ZVARS = '(EXTENS PLANT NAME)'
 &AMT = PAGE
)END
