)ATTR
  +  TYPE(TEXT) INTENS(LOW) SKIP(ON)
  %  TYPE(TEXT) INTENS(HIGH) SKIP(ON)
  _  TYPE(INPUT) INTENS(HIGH) CAPS(ON)
)BODY
%----------------------------  SYSLOG UTILITY  ------------------------ --------
% COMMAND ===>_ZCMD                                                            +
%
%
%
%         YOU ARE NOT AUTHORIZED TO BROWSE THE SYSLOGS.
%
%
)INIT
  .HELP = TSYSLOG1
)END
