)ATTR
 # TYPE(OUTPUT) INTENS(HIGH)
)BODY
%------------ ISL (Additional locations) ---------------------------------------
+
+  Enter/modify locations for manual ID:  #SLSID     +
+
+Locations:
+  1  %===>_LOC1    + 2  %===>_LOC2    + 3  %===>_LOC3    + 4  %===>_LOC4    +
+  5  %===>_LOC5    + 6  %===>_LOC6    + 7  %===>_LOC7    + 8  %===>_LOC8    +
+  9  %===>_LOC9    + 10 %===>_LOC10   + 11 %===>_LOC11   + 12 %===>_LOC12   +
+  13 %===>_LOC13   + 14 %===>_LOC14   + 15 %===>_LOC15   + 16 %===>_LOC16   +
+  17 %===>_LOC17   + 18 %===>_LOC18   + 19 %===>_LOC19   + 20 %===>_LOC20   +
+  21 %===>_LOC21   + 22 %===>_LOC22   + 23 %===>_LOC23   + 24 %===>_LOC24   +
+  25 %===>_LOC25   + 26 %===>_LOC26   + 27 %===>_LOC27   + 28 %===>_LOC28   +
+  29 %===>_LOC29   + 30 %===>_LOC30   + 31 %===>_LOC31   + 32 %===>_LOC32   +
+  33 %===>_LOC33   + 34 %===>_LOC34   + 35 %===>_LOC35   + 36 %===>_LOC36   +
+  37 %===>_LOC37   + 38 %===>_LOC38   + 39 %===>_LOC39   + 40 %===>_LOC40   +
+  41 %===>_LOC41   + 42 %===>_LOC42   + 43 %===>_LOC43   + 44 %===>_LOC44   +
+  45 %===>_LOC45   + 46 %===>_LOC46   + 47 %===>_LOC47   + 48 %===>_LOC48   +
+  49 %===>_LOC49   + 50 %===>_LOC50   + 51 %===>_LOC51   + 52 %===>_LOC52   +
+  53 %===>_LOC53   + 54 %===>_LOC54   + 55 %===>_LOC55   + 56 %===>_LOC56   +
+  57 %===>_LOC57   + 58 %===>_LOC58   + 59 %===>_LOC59   + 60 %===>_LOC60   +
+
+Press%END KEY+to terminate process+
)INIT
  .CURSOR = &CSRPOS
)END
