%------------- ISL (Administrative)  -------------------------------------------
%OPTION %===>_SLSSOPT
%
%
%   1 +CREATE   - Create / modify a library
%   2 +DELETE   - Delete a library
%   3 +EDIT     - Edit a library (add, update and/or delete manuals)
%   4 +RESET    - Reset library and enqueue after an error has occured
%   5 +KEYWORDS - Create keyword scan file
%   6 +SORT     - Sort library
%   7 +SUBLIB   - Build sub libraries from MAIN library
%   8 +JOBCARD  - Create / modify jobcards for job submission functions
%   9 +COMPRESS - Compress ISL table library
%
%
+Press%END+key to terminate process+
%
%
%
%
%
%
)INIT
  .HELP = SLSST000
  &SLSSOPT = ' '
)PROC
  VER (&SLSSOPT,LIST,1,2,3,4,5,6,7,8,9)
)END
