)ATTR DEFAULT(%+_)
/* % TYPE(TEXT  ) INTENS(HIGH)              DEFAULTS DISPLAYED FOR */
/* + TYPE(TEXT  ) INTENS(LOW )                   INFORMATION ONLY  */
/* _ TYPE( INPUT) INTENS(HIGH) CAPS(ON ) JUST(LEFT )               */
)BODY
%-----------------------   DELUXE TMC Display Tutorial   -----------------------
%COMMAND ===>_ZCMD
+
     There are no data sets in the table which begin with the characters:
        %&TMCLOC
+
   Press%END+to return.

)INIT
  &TMCLOC = TRUNC (&TMCMSGL,' ')
)PROC
)END
