)ATTR DEFAULT(%+_)
/* % TYPE(TEXT  ) INTENS(HIGH)              DEFAULTS DISPLAYED FOR */
/* + TYPE(TEXT  ) INTENS(LOW )                   INFORMATION ONLY  */
/* _ TYPE( INPUT) INTENS(HIGH) CAPS(ON ) JUST(LEFT )               */
)BODY
%-----------   DELUXE User List Inquiry Selection Panel Tutorial   ------------
%COMMAND ===>_ZCMD
+
  %COMMAND:+     Acceptable entries are all ISPF primary commands
                 (END, RETURN, SWAP, etc.).

                 It is also possible to enter the number relating
                 to a specific area of inquiry.
                     1.  Perform inquiry using RACF profile information.
                     2.  Perform inquiry using TSO account information.
                     3.  Perform inquiry using NCCF profile name.

   Press%END+to return.

)INIT
)PROC
)END
