./ ADD NAME=IKJALPL  0100-12190-12190-1333-00012-00012-00000-SHOW723 00
         MACRO
         IKJALPL
ALPL     DSECT                         ALLOC command defaults
ALPL_ID  DS    C'ALPL'                 Block id
ALPL_LENGTH DS H                       length of control block
ALPL_LEVEL  DS H                       level of control block
         DS    F                       zero
ALPL_FLAG DS   X                       Allocate flag
ALPL_OLD EQU  X'80'                    OLD
ALPL_SHR EQU  X'40'                    SHR
         DS   4F
         MEND
./ ADD NAME=IKJCNPRM 0100-12190-12190-1333-00012-00012-00000-SHOW723 00
         MACRO
         IKJCNPRM
CNPRM    DSECT                         IKJCNPRM Control Table
CNPRM_ID DC    C'IKJCNPRM'             Block id
         DS    H                       Version Number
CNPRM_LENGTH DS H                      Total length of c.b.
CNPRM_MAXSNUM DS F
CNPRM_MAXUNUM DS F
CNPRM_INITSNUM DS F
CNPRM_INITUNUM DS F
         DS    3F
         MEND
./ ADD NAME=IKJCTLT  0100-05180-05180-1403-00017-00017-00000-SHOW723 10
         MACRO
         IKJCTLT
CTLT     DSECT                         TSO/E Control Table
CTLT_ID  DS    C'CTLT'                 BLOCK ID
CTLT_LEN DS    H'60'                   LENGTH OF CTLT
CTLT_VERS DS   FL1'2'                  version number
         DS    X                       UNUSED
CTLTTE2  DS    A,F,H,H                 IKJEFTE2  PTR,LEN,#ENT,ENT_LEN
CTLTTE8  DS    A,F,H,H                 IKJEFTE8  PTR,LEN,#ENT,ENT_LEN
CTLTTNS  DS    A,F,H,H                 IKJEFTNS  PTR,LEN,#ENT,ENT_LEN
CTLTTAP  DS    A,F,H,H                 IKJEFTAP  PTR,LEN,#ENT,ENT_LEN
CTLT_TABLE_BUILT_FLAGS DS X            tables built from IKJTSOxx
CTLTTE2_BUILT EQU X'80'
CTLTTE8_BUILT EQU X'40'
CTLTTNS_BUILT EQU X'20'
CTLTTAP_BUILT EQU X'10'
         MEND
./ ADD NAME=IKJEEPTR 0106-05332-12218-1404-00068-00013-00000-HELP    38
*         Documentation for the IKJTPVT control block
*         ------------- --- --- ------- ------- -----
*
*    Particular reference is given to the EESCB control block here.
*    For further reference, see CBT File 731, member MODGEN.
*
*    The TPVT control block is mostly created by settings in the
*     PARMLIB member, IKJTSOxx.
*    The TPVT control block is not publicly documented by IBM.
*    We have documented the TPVT and some other TPVT-related
*     control blocks.  The console command D IKJTSO will display
*     much of the contents of the TPVT.
*    The EESCB control block is chained off the TPVT, and it points
*     to names for TSO individual userlogs and to the currently used
*     "Broadcast Dataset" name (default name is SYS1.BRODCAST).
*    TPVT stands for TSO Parmlib Vector Table.
*    EESCB stands for TSO SEND PARMLIB Control Block.
*
*    To display most of the contents of the EESCB control block,
*     use console command D IKJTSO,SEND or our TSO command from
*     CBT File 731 called EESCB.
*
*    Three versions of EESCB exist to date (until z/OS 1.13 at least).
*
*    v1 - ESA 5.2.2  to OS/390 1.3       IKJE1SCB
*    v2 - OS/390 2.4 to z/OS 1.2         IKJE2SCB
*    v3 - z/OS 1.3   and above.          IKJEESCB  (in SYS1.MODGEN)
*
*    The following instructions tell you how to get to the TPVT,
*     and to other control blocks that are connected to the TPVT.
*
*    Notation:  j is like a LOAD instruction in assembler
*               j10 means virtual storage, value hex 10
*               j+9c means LOAD what is in hex 9c off the previous
*                    address
*               etc.
*
*    This notation is used by the LOOK TSO command to browse storage.
*    LOOK can be found on CBT File 264, load module on CBT File 035.
*
*    You may need the authorized TSO command called UKEYCSA (File 264)
*     to be able to use LOOK without its abending.  If you need UKEYCSA
*     to allow allocation of Key 8 CSA in your system, please reset it
*     to its previous value, after you've finished using LOOK.
*     (This is relevant for z/OS 1.9 and higher.)
*
address    control     control block                    assembler
*          block       full name                        instructions
*          acronym
*------    -------     -------------                    ------------
j10        CVT         Communication Vector Table       L rx,16
j+9c       TSVT        TSO Vector Table                 L rx,X'9C'(,rx)
j+4c       TPVT        TSO Parmlib Vector Table         L rx,X'4C'(,rx)
j+20       EESCB       TSO SEND PARMLIB Control Block   L rx,X'20'(,rx)
*
*    Some other pointers off the TPVT (see IKJTPVT in MODGEN, in
*                                          CBT File 731).
*
j+14       CTLT        Common Storage copies of TSO Auth tables
j+24       ALPL        Default ALLOC disposition (OLD or SHR)
j+28       TPT         TSO TEST settings
j+2c       INMXPARM    TSO Transmit (XMIT) parameters and settings
j+30       IKJCNPRM    TSO CONSOLE command settings
j+3c       IKJEFHCB    TSO Help dataset settings
*
*    Current settings for all of these, can be displayed using
*     the console command:  D IKJTSO
*
./ ADD NAME=IKJEFCVE 0100-12190-12190-1333-00010-00010-00000-SHOW723 00
         MACRO
         IKJEFCVE
FCVE     DSECT                         Platform Commands
FCVE_ID  DS    C'FCVE'                 Block id
FCVE_VER DS    X'01'                   Version
         DS    XL3                     ?
FCVE_LEN DS    F                       Length of table
FCVE_COUNT DS  F                       Number of entries
FCVE_ENTRY DS  0CL8                    Start of table
         MEND
./ ADD NAME=IKJEFHCB 0100-12190-12190-1333-00018-00018-00000-SHOW723 00
         MACRO
         IKJEFHCB
HELP     DSECT                         IKJEFHCB Control Table
HELP_ID  DC    C'IKJEFHCB'             Block id
         DS    H                       ?
HELP_LENGTH DS H                       Total length of c.b.
HELP_LANG_CNT DS F                     Number of languages
HELP_FIRST_LANG_ENTRY DS A             A(first lang entry)
HELP_LANG_ENTRY DS 0C                  A lng entry and dsn list
HELP_NEXT_LANG_ENTRY DS A              Next lang entry or 0
HELP_LANG_TYPE DS CL3                  Language
HELP_DSN_COUNT DS X                    dsn count for this
*                                      language
HELP_DSN_ENTRY DS 0C                   A dsn entry
HELP_DSN_LENGTH DS F                   length of a dsn
HELP_DSN DS    CL44                    a dsn
HELP_END_ENTRY DS 0C
         MEND
./ ADD NAME=IKJEPPVE 0100-12190-12190-1333-00010-00010-00000-SHOW723 00
         MACRO
         IKJEPPVE
PPVE     DSECT                         Platform Programs
PPVE_ID  DS    C'PPVE'                 Block id
PPVE_VER DS    X'01'                   Version
         DS    XL3                     ?
PPVE_LEN DS    F                       Length of table
PPVE_COUNT DS  F                       Number of entries
PPVE_ENTRY DS  0CL8                    Start of table
         MEND
./ ADD NAME=IKJEXTAB 0100-12190-12190-1333-00016-00016-00000-SHOW723 00
         MACRO                         TSO EXIT/TABLE VECTOR
         IKJEXTAB
EXTAB_VECT     DSECT
EXTV_HEADER    DS 0CL16                HEADER
EXTV_ID        DS C'EXTV'
EXTV_VERS      DS FL1
EXTV_LEN       DS F
EXTV_ENTRY#    DS F
EXTV_ENT       DS 0XL16                ENTRY
EXTV_ENT_NAME  DS C'IKJEFTAP'
EXTV_FLAG1     DS X
EXTV_FLAG1_LPA     EQU X'80'
EXTV_FLAG1_LNKLST  EQU X'40'
EXTV_FLAG1_STEPLIB EQU X'20'
EXTV_LOAD_ADDR DS V(IKJEFTAP)
         MEND
./ ADD NAME=IKJE1SCB 0104-05332-05340-1348-00087-00263-00011-MACRO   10
         MACRO
         IKJE1SCB &DSECT=YES
         AIF ('&DSECT' EQ 'YES').CBDSECT
IKJE1SCB DS    0D
         AGO   .CONT
.CBDSECT ANOP
IKJE1SCB DSECT
.CONT    ANOP
E1SCB_IDENTIFIER DS CL8           *
E1SCB_VERSION    DS CL1           * Identifier Version
E1SCB_RESERVED1  DS CL3           * Reserved
*
E1SCB_PARMS      DS 0CL20
E1SCB_FLAGS_1    DS CL4           * SEND flags
*
E1SCB_OPERSEND   EQU X'80000000'  * Bit position to indicate the
*                                   status of OPERATOR SEND.
*                                   0 - OPERATOR SEND is inactive
*                                   1 - OPERATOR SEND is active
*                                    (OPERATOR SEND only, USER SEND is
*                                     unaffected)
E1SCB_USERSEND   EQU X'40000000'  * Bit position to indicate the
*                                   status of USER SEND.
*                                   0 - USER SEND is inactive
*                                   1 - USER SEND is active
*                                    (User SEND only, OPERATOR SEND is
*                                     unaffected)
E1SCB_SAVE       EQU X'20000000'  * Bit position to indicate if
*                                   messages can be saved.
*                                   0 - Messages can not be saved
*                                   1 - Messages can be saved
E1SCB_CHKBROD    EQU X'10000000'  * Bit position to indicate if the
*                                   SYS1.BRODCAST data set should be
*                                   searched.
*                                   0 - Search the user log data set
*                                       only
*                                   1 - Search the user log data set
*                                       and the SYS1.BRODCAST data set
E1SCB_USEBROD   EQU X'08000000'  * Bit position to indicate whether to
*                                  use SYS1.BRODCAST.
*                                   0 - Do not use SYS1.BRODCAST
*                                   1 - Use SYS1.BRODCAST
*
E1SCB_MSGPROTECT EQU X'04000000' * Bit position to indicate whether to
*                                  enforce security level check
*                                  0 - Do not enforce security use mail
*                                      log USERID.LOGNAME to store
*                                      message.
*                                  1 - Enforce security, use mail log
*                                      LOGNAME.USERID to store message
*
E1SCB_SYSPLEXSHR EQU X'02000000' * Bit position to indicate
*                                  whether the broadcast data set is
*                                  shared only by those systems in the
*                                  sysplex.
*                                  0 - It is not shared exclusively by
*                                      the systems in the sysplex.
*                                  1 - The broadcast data set is shared
*                                      only by systems in the sysplex.
*                                      LISTBC can bypass I/O on the
*                                      broadcast data set.
E1SCB_SYSPLEXSHR_XCF EQU X'01000000' * Bit position to indicate that
*                                  the EESCB_SYSPLEXSHR flag was set as
*                                  a result of an parmlib update on
*                                  another system in the XCF group
*                                  0 - It was updated by a parmlib
*                                      update on this system
*                                  1 - It was updated because a PARMLIB
*                                      update was issued on another
*                                      system in the XCF group.
*
E1SCB_OPERSEWAIT EQU X'00800000'  * Bit position to indicate whether
*                                   OPERATOR SEND should wait for
*                                   message buffers.
*                                   0 - Don't wait for buffers.
*                                   1 - Wait for buffers.
*
E1SCB_LOGNAME    DS 0CL52         * User log
E1SCB_DATASET    DS CL44          * User log data set name
E1SCB_MEMBER     DS CL8           * Data set member name
E1SCB_DATE_AND_TIME DS 0CL8       * Date and time of last update       +

E1SCB_DATE       DS CL4           * Date of last update
E1SCB_TIME       DS CL4           * Time of last update (GMT)
E1SCB_RESERVED2  DS CL28          * Reserved
                 DS 0D            * End on a double word
         MEND
./ ADD NAME=IKJE2SCB 0104-05332-05340-1349-00103-00310-00000-MACRO   10
         MACRO
         IKJE2SCB &DSECT=YES
         AIF ('&DSECT' EQ 'YES').CBDSECT
IKJE2SCB DS    0D
         AGO   .CONT
.CBDSECT ANOP
IKJE2SCB DSECT
.CONT    ANOP
E2SCB_IDENTIFIER DS CL8           *
E2SCB_VERSION    DS CL1           * Identifier Version
E2SCB_RESERVED1  DS CL1           * Reserved
E2SCB_LENGTH     DS H             * Length of control block
*
E2SCB_PARMS      DS 0CL20
E2SCB_FLAGS_1    DS CL4           * SEND flags
*
E2SCB_OPERSEND   EQU X'80000000'  * Bit position to indicate the
*                                   status of OPERATOR SEND.
*                                   0 - OPERATOR SEND is inactive
*                                   1 - OPERATOR SEND is active
*                                    (OPERATOR SEND only, USER SEND is
*                                     unaffected)
E2SCB_USERSEND   EQU X'40000000'  * Bit position to indicate the
*                                   status of USER SEND.
*                                   0 - USER SEND is inactive
*                                   1 - USER SEND is active
*                                    (User SEND only, OPERATOR SEND is
*                                     unaffected)
E2SCB_SAVE       EQU X'20000000'  * Bit position to indicate if
*                                   messages can be saved.
*                                   0 - Messages can not be saved
*                                   1 - Messages can be saved
E2SCB_CHKBROD    EQU X'10000000'  * Bit position to indicate if the
*                                   SYS1.BRODCAST data set should be
*                                   searched.
*                                   0 - Search the user log data set
*                                       only
*                                   1 - Search the user log data set
*                                       and the SYS1.BRODCAST data set
E2SCB_USEBROD   EQU X'08000000'  * Bit position to indicate whether to
*                                  use SYS1.BRODCAST.
*                                   0 - Do not use SYS1.BRODCAST
*                                   1 - Use SYS1.BRODCAST
*
E2SCB_MSGPROTECT EQU X'04000000' * Bit position to indicate whether to
*                                  enforce security level check
*                                  0 - Do not enforce security use mail
*                                      log USERID.LOGNAME to store
*                                      message.
*                                  1 - Enforce security, use mail log
*                                      LOGNAME.USERID to store message
*
E2SCB_SYSPLEXSHR EQU X'02000000' * Bit position to indicate
*                                  whether the broadcast data set is
*                                  shared only by those systems in the
*                                  sysplex.
*                                  0 - It is not shared exclusively by
*                                      the systems in the sysplex.
*                                  1 - The broadcast data set is shared
*                                      only by systems in the sysplex.
*                                      LISTBC can bypass I/O on the
*                                      broadcast data set.
E2SCB_SYSPLEXSHR_XCF EQU X'01000000' * Bit position to indicate that
*                                  the EESCB_SYSPLEXSHR flag was set as
*                                  a result of an parmlib update on
*                                  another system in the XCF group
*                                  0 - It was updated by a parmlib
*                                      update on this system
*                                  1 - It was updated because a PARMLIB
*                                      update was issued on another
*                                      system in the XCF group.
*
E2SCB_OPERSEWAIT EQU X'00800000'  * Bit position to indicate whether
*                                   OPERATOR SEND should wait for
*                                   message buffers.
*                                   0 - Don't wait for buffers.
*                                   1 - Wait for buffers.
*
E2SCB_SYSPLEXSHR_INI EQU X'00400000'  *  Bit position to indicate
*                                  whether the broadcast data set is
*                                  shared only by those systems in the
*                                  sysplex.  Set from the SYSPLEXSHR
*                                  parameter of the SEND statement.
*                                  See EESCB_SYSPLEXSHR for the
*                                  flag settings
E2SCB_LOGNAME    DS 0CL52         * User log
E2SCB_DATASET    DS CL44          * User log data set name
E2SCB_MEMBER     DS CL8           * Data set member name
E2SCB_DATE_AND_TIME DS 0CL8       * Date and time of last update       +

E2SCB_DATE       DS CL4           * Date of last update
E2SCB_TIME       DS CL4           * Time of last update (GMT)
E2SCB_USERLOG_SIZE  DS 0CL6       * User Log size
E2SCB_PRI_NUM    DS H             * Primary space amount
E2SCB_SEC_NUM    DS H             * Secondary space amount
E2SCB_DIR_NUM    DS H             * Number of directory blocks
                 DS H             * Reserved
E2SCB_SYSNAME    DS CL8           * Name of the system that updated the
*                                   EESCB_SYSPLEXSHR flag via XCF path
*
E2SCB_RESERVED2  DS CL12          * Reserved
                 DS 0D            * End on a double word
         MEND
./ ADD NAME=IKJTPT   0101-12190-16220-2315-00027-00026-00000-SHOW723 57
         MACRO
         IKJTPT
TPT      DSECT                         TPT Control block
TPT_ID   DS    C'TPT '                 Block id
TPT_LENGTH DS H                        Total length of c.b.
TPT_VERS DS    C                       TPT Version
         DS    C                       Reserved X'00'
         DS    F                       zeros
TPT_TCT_ENTRY DS A                     Address of TSOCMD c.b.
TPT_TCT_LENGTH DS F                    Length of TSOCMD c.b.
*                                      Length - 4 / 8 = #
TPT_SCT_ENTRY DS A                     Address of SUBCMD c.b.
TPT_SCT_LENGTH DS F                    Length of SUBCMD c.b.
*                                      Length - 4 / 16 = #
         DS    3F
TCT_TEST DSECT
TCT_ID   DS    C'TCT '                 Block id
TCT_TSOCMD DS  CL8                     A TSOCMD
TCT_ENTRY_END DS 0C
*                                      The last entry is x'40'
SCT_TEST DSECT
SCT_ID   DS    C'SCT '                 Block id
SCT_SUBCMD DS  CL8                     A SUBCMD
SCT_PGM  DS    CL8                     A SUBCMD entry name
*                                      The last entry is x'40'
SCT_ENTRY_END DS 0C
         MEND
./ ADD NAME=IKJTPVT  0106-19002-19002-1956-00065-00065-00000-SBGOLOB 00
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
*    This macro is our interpretation of IBM's "internal use only"    *
*    control block macro:  IKJTPVT  (TSO PARMLIB Vector Table)        *
*    The field names are not necessarily IBM's field names.           *
*  The names in this macro have been adjusted for format with CBMACS. *
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
         MACRO
         IKJTPVT
TPVT     DSECT                         TSO PARMLIB VECTOR TABLE
TPVT_ID  DS    CL4'TPVT'            00 BLOCK ID
TPVT_LEN DS    H'72'                04 LENGTH OF TPVT
****     DS    H'220'                  LENGTH OF TPVT          HTE26E2
TPVT_VERS DS   FL1'2'               06 VERSION
TPVT_MEM1 DS  0C'IKJTSO00'          07 CURRENT PARMLIB MEMBER  HTE25E2
TPVTFIL1 DS    X                                               HTE26E2
TPVT_MEM DS    CL8'IKJTSO00'        08 CURRENT PARMLIB MEMBER  HTE26E2
TPVT_GEN DS    F                    10 PARMLIB generation count
TPVTCTLT DS    V(CTLT)              14 IKJCTLT
TPVTCTLTLEN  DS F'60'               18 length of CTLT
         DS    4X                   1C
TPVTSEND DS    V(SCB)               20 IKJEESCB   (SYS1.BRODCAST)
TPVTALPL DS    V(ALPL)              24 ALPL       (ALLOCATE defaults)
TPVTTEST DS    V(TPT)               28 TPT (TEST)
TPVTXPRMD DS   V(XPRM)              2C INMXPARM   (XMIT)
TPVTCONSOLE DS V(CNPRM)             30 IKJCNPRM   (CONSOLE)
TPVTFCVEC DS   A,F                  34 FCVE       (Platform commands)
TPVTHELP DS    V(HCB)               3C IKJEFHCB   (HELP)
TPVTPPVEC DS   A,F                  40 PPVE       (Platform programs)
           ORG  TPVT+X'4C'
TPVTLOGON DS   X                    4C IKJTSOxx LOGON KEYWORD
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
* The following bit settings must correspond to the same bit settings *
* in the TSVTFLG1 field of the TSVT (TSVT + X'5') - lower nibble only *
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
TPVTPHRS  EQU  X'08'                Password phrase support active
TPVTAPPL  EQU  X'04'                LOGON applid verification active
TPVTLGNH  EQU  X'02'                LOGONHERE support is active
TPVTLGPC  EQU  X'01'                LOGONPREPROMPT is active
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
TPVTUMXL  DS   X                4D  MAXIMUM NUMBER OF CHARS IN USERID
*   This is a reflection of the value in TSVTUMXL, but the "real      *
*   switch" where the system "decides" if 8-character userids are     *
*   allowed, appears to be TSVT+X'6', not in this value.              *
*   Permissible values:  X'00' for pre z/OS 2.3 systems               *
*                        X'07' for z/OS 2.3 with 8-char uids off.     *
*                        X'08' for z/OS 2.3 with 8-char uids on.      *
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
           ORG  TPVT+X'50'
TPVTDSNAM  DS  CL44'SYS1.PARMLIB'   50 dsname                  HTE26E2
TPVTVOLSER DS  CL6'SYSCAT'          7C VOLSER                  HTE26E2
           DS  2X                                              HTE26E2
TPVTSYSNAM DS  CL8'P390'            84 from system             HTE26E2
TPVTUSERID DS  CL8'IBMUSERM'        8C by userid               HTE26E2
TPVTHHMMSS DS  CL8'16:59:56'        94 at hh:mm:ss             HTE26E2
TPVTYYMMDD DS  CL10'1998-10-29'     9C on yyyy-mm-dd           HTE26E2
TPVTCPUIDP DS  XL2                  A6 CPUID prefix
TPVTCPUID  DS  F                    A8 CPUID
TPVTMODEL  DS  H                    AC CPU Model
TPVTUPDTIM DS  XL4                  AA Update Time
TPVTUPDDAT DS  XL4                  B2 Update Date
TPVTFEATURE DS  X                   B6 Feature
*              X'80'            Dynamic Broadcast Feature is available
TPVTFEATVER DS X                    B7 Feature Version
         ORG   TPVT+X'DC'              end of TPVT             HTE26E2
         MEND
./ ADD NAME=IKJXPRM  0104-05350-06001-0843-00039-00037-00007-SHOW723 10
         MACRO
         IKJXPRM
XPRM     DSECT                         INMXPARM Control Table
XPRM_ID  DC    C'INMXPARM'             Block id
XPRM_LEN DS    H                       Length of XPRM
XPRM_NJE# DS   H                       Count of NJE/SMF id's
XPRM_NJE_START DS A(XPRM_NODE)         A(start NJE/SMF id's)
XPRM_VERS  DS  X'02',3X                version number          HTE26D2
XPRM_WARN1 DS  F                       OUTWARN 1
XPRM_WARN2 DS  F                       OUTWARN 2
XPRM_LIM DS    F                       Outlim
         DS    F,F,H                   ?
XPRM_VIO_U_SIZE DS H                   Length of VIO unit name
XPRM_VIO_U DS  CL8                     VIO unit name
         DS    F,F                     ?
XPRM_SW  DS    X                       Cipher flag
XPRM_CIPHER_NO EQU X'10'               Cipher - NO
XPRM_CIPHER_ALWAYS EQU X'20'           Cipher - ALWAYS
XPRM_CIPHER_YES EQU X'40'              Cipher - YES
XPRM_USERID EQU X'08'                  Daprefix - userid
         DS    X                       ?
XPRM_SOUT DS   C                       SYSOUT class
         DS    C                       ?
XPRM_LOGNAME DS CL8                    LOGNAME
         DS    H                       ?
XPRM_LOGSEL_1 DS C                     '*'
XPRM_LOGSEL DS  CL8                    LOGSEL name
XPRM_LOGSEL_SIZE DS H                  LOGSEL size (halfword)
XPRM_SYSCTL DS CL44                    SYSCTL name
XPRM_SYSCTL_SIZE DS H                  SYSCTL size (halfword)
XPRM_USRCTL DS CL44                    USRCTL name
XPRM_USRCTL_SIZE DS H                  USRCTL size (halfword)
XPRM_SPOOLCL DS C                      SPOOL CLASS
         ORG   XPRM+X'0F0'             filler                  HTE26D2
XPRM_NODE DS   CL8                     NJE node name
XPRM_SMF DS    CL4                     SMF ID
         DS    XL4
XPRM_NS_L EQU  *-XPRM_NODE             Length of a pair
         MEND
