)ATTR DEFAULT(%+_)
 %   TYPE(TEXT) INTENS(HIGH) Caps(Off)
 +   TYPE(TEXT) INTENS(LOW) Caps(Off)
 _   TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) Hilite(UScore)
)BODY Expand(||) Width(78)
%-|-|- MSIC VDEF Line Commands -|-|-
+
+You can scroll and change as many variables as you like
+without having to select them. Selecting an item, changed
+or not, will undergo validation.
+
)END
Contact:  "Kenneth E. Tomiak"<CBT_Ken@KTomiak.BIZ>
