)ATTR DEFAULT(%+_)
      /*  % TYPE(TEXT) INTENS(HIGH)      defaults displayed for      */
      /*  + TYPE(TEXT) INTENS(LOW)       information only            */
      /*  _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)             */
)BODY Expand(||)
%|-| MSIC: Help |-|
%SELECTION ===>_ZCMD                                                           +
%
%           -----------------------------------------------------
            | Mainframe Software Installation Customizer (MSIC) |
            -----------------------------------------------------
+
This SHAREWARE tool assists in installing other tools that conform to the MSIC
design. You, the end-user, benefit from having a similar installation and
customization experience. The tool author benfits from not having to create a
new process.

Work your way down the tasks in the numbered sequence. Feel free to press your
HELP PFKey whenever the upper right hand corner indicates there is a longer
response to share with you.
)END
Contact:  "Kenneth E. Tomiak"<CBT_Ken@KTomiak.BIZ>
