*          DATA SET WTOEF97I   AT LEVEL 002 AS OF 05/19/86
//O9080RL  JOB (0052,ACCC),
//         'ASM I. R.',
//         NOTIFY=O9080R,
//         CLASS=I,
//         MSGCLASS=Q,
//         MSGLEVEL=1
//R  EXEC A9294A07,USER='O9080R',SYSOUT='(D,,AA01)'
//AS5 EXEC ACFASM,SOUT='(D,,LA01)',MEMBER=WTOEF97I
//SYSLIB DD DISP=SHR,DSN=&ACFX..&ACFMAC
//       DD DISP=SHR,DSN=SYS1.MACLIB
//       DD DISP=SHR,DSN=COKE.MACLIB
//       DD DISP=SHR,DSN=SYS1.HASPSRC
//       DD DISP=SHR,DSN=SYS1.AMODGEN
//       DD DISP=SHR,DSN=TMS.TMSGEN47.ASM
//       DD DISP=SHR,DSN=O9080R.CMPAT.ASM
//SYSIN  DD  *
WTOEF97I TITLE 'WTOEF97I -- WTOR EXIT TO SUPPRESS IEF097I'
WTOEF97I CSECT
WTOEF97I AMODE 31
WTOEF97I RMODE ANY
         USING *,R12
         STM   R14,R12,12(R13)
         LR    R12,R15
         B     START
         DC    C'WTOEF97I'
         DC    C'&SYSDATE',C' &SYSTIME'
         PRINT NOGEN
START    L     R11,0(R1)      PICK UP ADDRESS OF CTXT
         USING CTXT,R11
         OI    CTXTRFB2,CTXTRDTM
RETURN   LM    R14,R12,12(R13)
         SR    R15,R15
         BR    R14
         SPACE 1
         LTORG
         SPACE 3
         PRINT   GEN
         IEZVX100
         PRINT NOGEN
         REGEQU
         END   WTOEF97I
//L  EXEC ACFLINK,SOUT='*',SYSX='SYS2',LIB=LINKLIB,C=' '
//* RENT='RENT,'
//SYSLIN DD *
  INCLUDE ACFOBJ(WTOEF97I)
  NAME   WTOEF97I(R)
//ZZDATA DD  DATA,DLM=ZZ
ZZ
