***********************************************************************
*   COPYRIGHT = 5655-018 (C) COPYRIGHT IBM CORP. 1975                 *
*               THIS MODULE IS "RESTRICTED MATERIALS OF IBM"          *
*               LICENSED MATERIALS - PROPERTY OF IBM                  *
*               REFER TO COPYRIGHT INSTRUCTIONS                       *
*               FORM NUMBER G120-2083                                 *
***********************************************************************
*                                                                     *
*              DFHIRSDS COPY BOOK                                     *
*                                                                     *
*              THIS COPY BOOK CONTAINS THE DESCRIPTIONS OF ALL        *
*        INTER-REGION COMMUNICATION CONTROL BLOCKS WHICH ARE          *
*        VISIBLE TO THE SUBSYSTEM LEVEL OF INTER-REGION               *
*        COMMUNICATION.                                               *
*                                                                     *
*=====================================================================*
* Although provided in a general interface library, DFHIRSDS is       *
* not to be used as a general programming interface. Refer to         *
* product documentation to determine intended usage.                  *
*=====================================================================*
*                                                                     *
*        $SEG(DFHIRSDS) COMP(IRC) PROD(CICS/ESA):                     *
*         PN= REASON REL YYMMDD HDXXIII : REMARKS                     *
*        $L1= 600 160 8010 HD8STC:      CICS/DOS 1.6 BASE FIXES       *
*        $L2= J31 160 8204 HD8STC :  FIX IRP BUGS IN RECOVER          *
*        $L3= J41 161 8210 HDXDRP :  CROSS MEMORY SUPPORT             *
*        $L4= J45 170 8508 HD2FAGW:  MRO/VAE Support                  *
*        $L5= DS1 310 8612 HDEDJZ :  EB1C. Logon options              *
*        $L6= 415 320 8909 HDEDJZ :  MRO Work queues                  *
*        $L7= 504 320 890306 HOUSEGO : IRPL contrl blk 31 bit conversn*
*        $L8= 641 410 930318 HD5LL : XCF support & Dynamic add        *
*    $L9= 641    410 930429 HDAHSCG : Add DFHIRP level checking       *
*        $L9= RESERVED FOR LINE ITEM                                  *
*    $LA= 641    410 930517 HDAHSCG : Dynamic ADD defines for XCF     *
*        $LA= RESERVED FOR LINE ITEM                                  *
*        $P1= M31977 170 8601 HD1MA : RE-INSTATE EQU FOR LCLFLGXM     *
*        $P2= M32244 170 8602 HD1MA : ERROR CODE FOR GETVIS FAILURE   *
*        $P3= M40931 310 8709 HDUGM : MVS global is now redundant     *
*        $P4= M56295 310 8906 HD0VCAP:XM Post simulator exit          *
*        $P5= M60854 320 9002 HD2YAIH:XA2/XB0 co-existence            *
*        $P6= RESERVED FOR PTM                                        *
*        $D1= I01597 170 840223 HD0RJS : REWORK DCR                   *
*        $D2= I03170 310 870904 HD5LL  : MRO BATCHING                 *
*        $D3= I03608 310 890712 HDPBGH : CSIR deadlock avoidance      *
*        $D4= I04147 320 900109 HD5XTY : REMOVE REDUNDANT VTAM GLOBALS*
*        $D5= RESERVED FOR DCR                                        *
*        $D6= RESERVED FOR DCR                                        *
*        $D7= RESERVED FOR DCR                                        *
*        $01= A05567 160 8201    HD8STC: APAR MODIFICATION            *
*                                                                     *
*              THE CONTROL BLOCKS DEFINED IN THIS COPY BOOK           *
*        ARE:                                                         *
*                                                                     *
*        SLCB     SUBSYSTEM LOGON CONTROL BLOCK                       *
*        SCCB     SUBSYSTEM CONNECTION CONTROL BLOCK                  *
*        SCACB(E) SUBSYSTEM CONNECTION ADDRESS CONTROL BLOCK          *
*                                                                     *
         DFHEJECT                                              @BBDJ104
*                                                                     *
*              SUBSYSTEM LOGON CONTROL BLOCK                          *
*                                                                     *
*              THIS DSECT DESCRIBES THE FORMAT OF THE SLCB WHICH      *
*        IS THE CONTROL BLOCK THAT CONTAINS THE INFORMATION           *
*        RELEVANT TO THE LOGON SESSION WHICH IS OF INTEREST TO THE    *
*        SUBSYSTEM LEVEL OF INTER-REGION COMMUNICATION.               *
*                                                                     *
         SPACE 5                                               @BBDJ104
*                                                                     *
&SRVLEVL SETC  '0000'      Service level for IRP level check func. @L9A
*
*              FIRST DEFINE THE FORMAT OF THE FIELDS IN THE SLCB.     *
*                                                                     *
*                                                                     *
*                                                                     *
SLCB     DSECT                                                 @BCA890E
SLCBLECB DS    F           LOGON (MASTER) ECB                  @BCA890E
SLCBSCAC DS    F           SCACB ADDRESS                       @BCA890E
SLCBSTTS DS    0F          STATUS BYTES                        @BCA890E
SLCBSTS1 DS    C           .. STATUS BYTE 1                    @BCA890E
SLCBSTS2 DS    C           .. STATUS BYTE 2                    @BCA890E
SLCBSTS3 DS    C           .. STATUS BYTE 3                    @BCA890E
SLCBSTS4 DS    C           .. STATUS BYTE 4                    @BCA890E
SLCBLCB  DS    A           ADDRESS OF LCB                      @BBDJ10X
         SPACE 1                                               @BDDJ104
SLCBALGN DS    0F                                              @BDDJ104
SLCBLENG EQU   *-SLCB      LENGTH OF SLCB                      @BCA890E
         SPACE 5                                               @BCA890E
*                                                                     *
*              THIS PART OF THE DSECT DESCRIBES THE FLAGS IN THE      *
*        LCB AND SLCB STATUS BYTES. THESE FLAGS ARE COMMON TO THE     *
*        TWO CONTROL BLOCKS (UNLESS OTHERWISE STATED) AND ARE         *
*        THEREFORE ONLY DEFINED HERE                                  *
*                                                                     *
*                                                                     *
*        FLAGS IN STATUS BYTE 1: LCBSTTS1 OR SLCBSTS1                 *
*                                                                     *
LCBFAM31 EQU   X'80'       User of LCB is AMODE(31)                @L8A
LCBFQUIP EQU   X'40'       NORMAL QUIESCE IN PROGRESS          @BCA890E
LCBFQUIM EQU   X'20'       IMMEDIATE QUIESCE REQUESTED         @BCA890E
LCBFSPST EQU   X'10'       SYSTEM POST SCCBDECB for all events     @L5A
*                          except SWITCH FIRST
LCBFBTCH EQU   X'08'   (LCB only) - batching of opsys posts rqd    @D2A
LCBFBTCP EQU   X'04'               BATCH=POSTEXIT                  @D2A
LCBFBEXL EQU   X'02'               Exit loaded                     @P4A
LCBFUNIQ EQU   X'01'       LCB corresponds to a UNIQUE user        @L8A
*                                                                     *
*        FLAGS IN STATUS BYTE 2: LCBSTTS2 OR SLCBSTS2                 *
*                                                                     *
LCBFNWCN EQU   X'80'       NEW CONNECTER: SCAN ECBS            @BM14056
LCBFQUCM EQU   X'40'       QUIESCE COMPLETE                    @BCA890E
LCBFSWFS EQU   X'20'       SWITCH FIRST RECEIVED               @BBDJ104
LCBFDSCR EQU   X'10'       DISCONNECT RECEIVED                 @BBDJ104
LCBFJOIN EQU   X'08'       IXCJOIN might have been done            @L8A
*                                                                     *
*        FLAGS IN STATUS BYTE 4: LCBSTTS4 OR SLCBSTS2                 *
*                                                                     *
LCBSRBSE EQU   X'80'       SERIALIZATION WITH WORK QUEUE PROCESSOR @L4C
         SPACE 2                                               @BDDJ104
         DFHEJECT                                              @BCA890E
*                                                                     *
*              SUBSYSTEM CONNECTION CONTROL BLOCK                     *
*                                                                     *
*              THIS DSECT DEFINES THE SCCB, THE CONTROL BLOCK         *
*        WHICH CONTAINS THAT INFORMATION ABOUT A PARTICULAR           *
*        CONNECTION WHICH CAN BE ACCESSED BY THE SUBSYSTEM            *
*        LEVEL OF INTERREGION COMMUNICATION FUNCTION                  *
*                                                                     *
         SPACE 5                                               @BCA890E
*                                                                     *
*              FIRST DEFINE THE FORMAT OF THE FIELDS IN THE SCCB
*                                                                     *
*                                                                     *
*                                                                     *
SCCB     DSECT                                                 @BCA890E
SCCBDECB DS    F           DEPENDENT ECB                       @BCA890E
SCCBTHNM DS    F           THREAD NUMBER                       @BCA890E
SCCBTHID DS    F           THREAD IDENTIFICATION               @BCA890E
IRXMTHRD EQU   X'80'       If not XCF, Cross-Memory Thread ID      @L3A
IRNXTHRD EQU   X'40'       Non-XCF Thread ID                       @L8A
SCCBSTAT DS    0F          STATUS BYTES                        @BCA890E
SCCBSTS1 DS    C           .. STATUS BYTE 1                    @BCA890E
SCCBSTS2 DS    C           .. STATUS BYTE 2                    @BCA890E
SCCBSTS3 DS    C           .. STATUS BYTE 3                    @BCA890E
SCCBSTS4 DS    C           .. STATUS BYTE 4                    @BCA890E
SCCBDLTH DS    F           TOTAL LENGTH OF DATA PASSED         @BBDJ104
SCCBSLTH DS    F           TARGET AREA LENGTH                  @BBDJ104
SCCBAREA DS    A           TARGET AREA ADDRESS                 @BBDJ104
SCCBCNAM DS    CL8         CONNECTER LOGON NAME                @BM14056
SCCBUSER DS    F           USER FIELD                          @BBDJ104
SCCBSEC  DS    CL8         SECURITY USER FIELD                 @BBDJ104
SCCBELA  DS    A           Address of SCCB associated element      @L6A
******** Double word alignment causes a word to be skipped here!!!!!!!
SCCBCTIM DS    D           STCK time at which connection connected @L6A
SCCBSTOD DS    XL8         STCK time by when the secondary TCB had     X
                           chosen a specific instance of the target    X
                           primary                                 @L8A
         DS    0D          align internal element on DWD           @L6A
SCCBEL   DS    CL24        SCCB internal work element              @L6A
         SPACE 1                                               @BDDJ104
SCCBALGN DS    0F                                              @BDDJ104
SCCBLENG EQU   *-SCCB      LENGTH OF SCCB                      @BCA890E
         SPACE 5                                               @BCA890E
*                                                                     *
*              THIS PART OF THE DSECT DEFINES THE FLAGS IN THE        *
*              SCCB STATUS BYTES                                      *
*                                                                     *
*                                                                     *
*                                                                     *
*              FLAGS IN STATUS BYTE 1: SCCBSTS1                       *
*                                                                     *
CCBFNWCN EQU   X'80'       NEW CONNECTER                       @BM14056
******** EQU   X'40'       Was CCBFCNTR - now reserved         @BA58600
CCBFSWDT EQU   X'20'       DATA PASSED WITH SWITCH             @BCA890E
CCBFSWFS EQU   X'10'       SWITCH FIRST RECEIVED               @BBDJ104
CCBFDTNF EQU   X'08'       DATA DOESN'T FIT                    @BBDJ104
CCBFDWP  EQU   X'04'       DISCONNECT WHEN POSSIBLE            @BBDJ104
CCBFSWIT EQU   X'02'       INVALID TARGET FOR SWITCH           @BCDJ10X
CCBFUNEX EQU   X'02'       UNEXPECTED FAILURE IN SRB/SUBTASK       @L4C
CCBIRCWT EQU   X'01'       this side is waiting for a session          *
                           recovery response from the other side   @D3A
*                                                                     *
*                                                                     *
*                                                                     *
*              FLAGS IN STATUS BYTE 2: SCCBSTS2                       *
*                                                                     *
CCBFTERM EQU   X'80'       OTHER SIDE TERMINATED NORMALLY      @BCA890E
CCBFABTM EQU   X'40'       OTHER SIDE TERMINATED ABNMLY        @BCA890E
CCBFABTQ EQU   X'20'       ABNORMAL TERMINATION DUE TO QUIESCE @BBDJ104
CCBFCNCT EQU   X'10'       Connection is currently connected       @L6A
         SPACE 2                                               @BDDJ104
*                                                                     *
*              FLAGS IN STATUS BYTE 3: SCCBSTS3                       *
*                                                                     *
CCBFPRIM EQU   X'80'               This is a primary SCCB          @L8A
         DFHEJECT                                              @BCA890E
*                                                                     *
*              SUBSYSTEM CONNECTION ADDRESS CONTROL BLOCK             *
*                                                                     *
*              THESE DSECTS DEFINE THE FORMAT OF THE SCACB            *
*        AND ITS ENTRIES. THE SCACB IS USED BY THE SUBSYSTEM          *
*        LEVEL OF INTERREGION COMMUNICATION FUNCTION TO OBTAIN        *
*        THE ADDRESSES OF THE SCCB'S REPRESENTING ITS CONNECTIONS     *
*                                                                     *
         SPACE 5                                               @BCA890E
SCACB    DSECT                                                 @BCA890E
SCACBNUM DS    F           NUMBER OF ENTRIES IN SCACB          @BCA890E
SCACBENT DS    0F          START OF ENTRIES                    @BCA890E
SCACBEND DS    F           END MARKER = X'FFFFFFFF'            @BBDJ10X
         SPACE 1                                               @BBDJ10X
SCACBLEN EQU   *-SCACB     BASIC SCACB LENGTH                  @BBDJ10X
         SPACE 5                                               @BCA890E
SCACBE   DSECT                                                 @BCA890E
SCACBEAD DS    F           ADDRESS OF SCCB                     @BCA890E
         SPACE 1                                               @BDDJ104
SCACBELN EQU   *-SCACBE    LENGTH OF SCACB ENTRY               @BCA890E
         SPACE 2                                               @BDDJ104
         DFHEJECT                                              @BCA890E
*                                                                     *
*             LOGON CONNECTIONS LIST                                  *
*                                                                     *
*        LOGON CONNECTIONS LIST DSECT. THIS LIST IS PASSED            *
*        TO LOGON BY THE REQUESTER, AND IT DESCRIBES THE              *
*        SYSTEMS TO WHICH THIS LOGGER-ON CAN BE CONNECTED             *
         SPACE ,                                               @BBDJ104
LCL      DSECT                                                 @BBDJ104
LCLNAME  DS    CL8         NAME OF CONNECTED SYSTEM            @BBDJ104
LCLUSRID DS    CL8         ACCEPTABLE USERID (SECURITY)        @BBDJ104
LCLSECNO DS    H           NUMBER OF SECONDARIES FOR           @BBDJ104
*                            CONNECTIONS TO GIVEN SYSTEM       @BDDJ104
LCLPRMNO DS    H           NUMBER OF PRIMARIES FOR             @BBDJ104
*                            CONNECTIONS TO GIVEN SYSTEM       @BDDJ104
         SPACE 2                                               @BBDJ104
LCLFLG   DS    B           FLAG BYTE                           @BBDJ104
LCLFLGLS EQU   X'80'       LAST ELEMENT IN LIST                @BBDJ104
LCLFLGCN EQU   X'40'       CONNECTIONS TO THIS SYSTEM          @BBDJ104
*                            ARE INITIALLY 'IN SERVICE'        @BDDJ104
LCLFLGXM EQU   X'10'       CROSS-MEMORY ACCEPTABLE (MVS)
         SPACE ,                                               @BBDJ104
         DS    X           RESERVED                            @BBDJ104
         SPACE ,                                               @BBDJ104
LCLLENG  EQU   *-LCL       CONNECTION LIST ELEMENT LENGTH      @BBDJ104
         SPACE 2                                               @BDDJ104
         DFHEJECT                                              @BBDJ104
***********************************************************************
* * *                                                             * * *
* * *    THE FOLLOWING DSECTS DEFINE THE FORMAT OF THE ARGUMENT   * * *
* * *    LISTS USED WHEN INVOKING THE INTERREGION PROGRAM         * * *
* * *                                                             * * *
* * *    THERE ARE TWO DSECTS: THE SVC ARGUMENT LIST DSECT AND    * * *
* * *    THE FUNCTION ARGUMENT DSECT                              * * *
* * *                                                             * * *
***********************************************************************
         SPACE 2                                               @BBDJ10X
***********************************************************************
* *                                                                 * *
* *      THE SVC ARGUMENT LIST COMPRISES A LIST OF ADDRESSES,       * *
* *      EACH OF WHICH IS THE ADDRESS OF A FUNCTION ARGUMENT LIST   * *
* *                                                                 * *
***********************************************************************
         SPACE 1                                               @BBDJ10X
IRSVCADS DSECT                                                 @BBDJ10X
IRVCAARG DS    F           ADDRESS OF FUNCTION ARGUMENT LIST   @BBDJ10X
         SPACE 5                                               @BBDJ10X
***********************************************************************
* *                                                                 * *
* *      THE FUNCTION ARGUMENT LIST, ADDRESSED FROM THE SVC         * *
* *      ARGUMENT LIST, CONTAINS DIFFERENT ARGUMENTS ACCORDING TO   * *
* *      THE FUNCTION BEING REQUESTED.  THE FIRST SIX ARGUMENTS     * *
* *      IDENTIFY THE FUNCTION REQUIRED, THE FUNCTION               * *
* *      MODIFIER (FOR SWITCH, DISCONNECT OR QUIESCE), THE USER     * *
* *      NUMBER AND IDENTIFICATION AND THE THREAD NUMBER AND        * *
* *      IDENTIFICATION (WHERE REQUIRED).  THE REMAINING THREE      * *
* *      ARGUMENTS DEPEND ON THE FUNCTION REQUESTED AND IDENTIFY    * *
* *      A SYSTEM NAME (FOR LOGON, INSERV OR QUIESCE), A            * *
* *      SUBSYSTEM CONTROL BLOCK ADDRESS (FOR LOGON OR CONNECT)     * *
* *      AND A PARAMETER LIST (FOR LOGON OR SWITCH).                * *
* *                                                                 * *
***********************************************************************
         SPACE 1                                               @BBDJ10X
IRSVCFDS DSECT                                                 @BBDJ10X
         SPACE 1                                               @BBDJ10X
         DS    0H                                                  @AIH
IRVCLEN  DS    X           LENGTH OF PARAMETER LIST                @AIH
         SPACE 1                                                   @AIH
IRVCTYP  DS    X           FUNCTION TYPE                       @BBDJ10X
         SPACE 1                                               @BBDJ10X
IRVCSTYP DS    H           FUNCTION MODIFIER                   @BBDJ10X
         SPACE 1                                               @BBDJ10X
IRVCUSID DS    F           ADDRESS OF USER ID ARGUMENT (EXCEPT LOGON)  *
                             OR USER ID RETURN SLOT (LOGON ONLY)       *
                                                               @BBDJ10X
         SPACE 1                                               @BBDJ10X
IRVCTHID DS    F           ADDRESS OF THREAD ID ARGUMENT (SWITCH,      *
                             PULL OR DISCONNECT ONLY) OR THREAD        *
                             NUMBER RETURN SLOT (CONNECT ONLY) @BBDJ10X
         ORG   IRVCTHID                                            @L5A
IRVCLGFL DS    0XL4        Logon - flags                           @L5A
IRVCLGF1 DS    X           1st flag byte                           @L5A
IRVCLGSP EQU   X'80'       SYS POST req'd on links                 @L5A
IRVCLGBT EQU   X'40'       Batching of operating system POSTs      @D2A
IRVCLGBX EQU   X'20'       BATCH=POSTEXIT                          @D2A
IRVCLEXM EQU   X'10'       Exit module name given                  @P4A
IRVCWELT EQU   X'08'       Latent parameter supplied on logon      @L6A
IRVCLDOK EQU   X'04'       Allow duplicate names for this logon
IRVCLGF2 DS    X           2nd flag byte                           @L5A
IRVCLGBV DS    X           Batching value (if IRVCLGBT set)        @D2A
IRVCLGGM DS    X           GETMAIN above if SVCLOC=ANY       @L5A  @L7C
*                          1... .... SVCLOC=ANY
*                          0... .... SVCLOC=BELOW
         SPACE 1                                               @BBDJ10X
IRVCALST DS    0F          START OF FUNCTION SPECIFIC ARGUMENT LIST    *
                                                               @BBDJ10X
         SPACE 2                                               @BBDJ10X
         ORG   IRVCALST    ARGUMENT LIST FOR LOGON             @BBDJ10X
IRVCLGIM DS    F           ADDRESS OF MYNAME ARGUMENT          @BBDJ10X
IRVCLGSL DS    F           ADDRESS OF SLCB ADDR RETURN SLOT    @BBDJ10X
IRVCLGMU DS    F           ADDRESS OF MAX USERS ARGUMENT       @BBDJ10X
IRVCLGEX DS    F           Addr of Module name (if any) for exits  @P4A
IRVCLGLT DS    F           Latent parameter (if any) for exits     @L6A
IRVCLLEN EQU   *-IRSVCFDS  length of logon plist                   @L6A
         SPACE 2                                               @BM13339
         ORG   IRVCALST    ARGUMENT LIST FOR LOGOFF            @BM13339
IRVCLODS DS    F           ADDRESS OF DYNAMIC STORAGE OPERAND  @BM13339
IRVCOLEN EQU   *-IRSVCFDS  length of logoff plist                  @L6A
         SPACE 2                                               @BBDJ10X
         ORG   IRVCALST    ARGUMENT LIST FOR CONNECT           @BBDJ10X
IRVCCNTO DS    F           ADDRESS OF TO ARGUMENT              @BBDJ10X
IRVCCNSC DS    F           ADDRESS OF SCCB ADDR RETURN SLOT    @BBDJ10X
IRVCCLEN EQU   *-IRSVCFDS  length of connect plist                 @L6A
         SPACE 2                                               @BBDJ10X
         ORG   IRVCALST    ARGUMENT LIST FOR SWITCH            @BBDJ10X
         DS    F           RESERVED                            @BM14056
         DS    F           RESERVED                            @BM14056
IRVCSWPM DS    F           ADDRESS OF PARAMETER TO PASS        @BBDJ10X
IRVCSLEN EQU   *-IRSVCFDS  length of switch plist                  @L6A
         SPACE 2                                               @BBDJ10X
         ORG   IRVCALST    ARGUMENT LIST FOR QUIESCE           @BBDJ10X
IRVCQUTO DS    F           ADDRESS OF TO ARGUMENT              @BBDJ10X
IRVCQLEN EQU   *-IRSVCFDS  length of quiesce plist                 @L6A
         SPACE 2                                               @BBDJ10X
         ORG   IRVCALST    ARGUMENT LIST FOR INSERV            @BBDJ10X
IRVCINTO DS    F           ADDRESS OF TO ARGUMENT              @BBDJ10X
IRVCILEN EQU   *-IRSVCFDS  length of inserv plist                  @L6A
         SPACE 2                                               @BBDJ10X
         ORG   IRVCALST    ARGUMENT LIST FOR RECOVER           @BBDJ10X
         DS    F           .. RESERVED                         @BBDJ10X
IRVCRCRS DS    F           REGISTER 13 SAVE AREA               @BBDJ10X
IRVCRCSA DS    F           ADDRESS OF SAVE AREA ARGUMENT       @BBDJ10X
IRVCRLEN EQU   *-IRSVCFDS  length of recover plist                 @L6A
         SPACE 2                                               @BBDJ10X
         ORG   IRVCALST    ARGUMENT LIST FOR EOT/M CLEAR           @D1C
IRVCEOAS DS    H           ASID OF FAILING MEMORY                  @D1A
*                          OR ASID OF MEMORY CONTAINING FAILING TASK
IRVCEOTA DS    F           TCB ADDRESS OF FAILING TASK             @D1A
IRVCEOSC DS    F           ADDRESS OF SSCT                    @D1A @P6C
IRVCELEN EQU   *-IRSVCFDS  length of EOT/M plist                   @L6A
         SPACE 1                                                   @LAA
         ORG   IRVCALST            argument list for ADD           @LAA
IRVCANM  DS    A                   Pointer to netname = (IRVCLGIM) @LAA
IRVCATOK DS    A                   ADD token pointer               @LAA
IRVCALCL DS    A                   LCL - same offset as for LOGON  @LAA
IRVCALEN EQU   *-IRSVCFDS          length of ADD PLIST             @LAA
         SPACE 2                                                   @L9A
         ORG   IRVCALST    ARGUMENT LIST FOR IRP LEVEL CHECK       @L9A
IRVCALVL DS    A           Value of DFHIRP level required by ca@BA58600
IRVCLVL1 EQU   1           DFHIRP function level 1 - basic XCF @BA58600
IRVCLVL2 EQU   2           DFHIRP function level 1 - reserved  @BA58600
IRVCKLEN EQU   *-IRSVCFDS  Length of LEVEL CHECK plist             @L9A
         SPACE 2                                                   @D1P
         ORG   ,           ORG TO END OF PARAMETER LIST        @BBDJ10X
IRVCEND  DS    0F                                              @BM14268
IRVCMAXM EQU   *-IRSVCFDS  MAXIMUM PARAMETER LENGTH            @BBDJ10X
         DFHEJECT                                              @BBDJ10X
***********************************************************************
* *                                                                 * *
* *      THE FOLLOWING EQUATES DEFINE THE FUNCTION REQUEST          * *
* *      CODES FOR THE INTERREGION COMMUNICATION PROGRAM            * *
* *                                                                 * *
* *      THERE ARE TWO LEVELS OF FUNCTION REQUEST DEFINED HERE:     * *
* *      THE SVC FUNCTION CODE ADDRESSED FROM THE SVC ARG LIST,     * *
* *      AND THE FUNCTION TYPE QUALIFICATION CODE ADDRESSED FROM    * *
* *      THE FUNCTION ARGUMENT LIST FOR PARTICULAR FUNCTIONS        * *
* *                                                                 * *
***********************************************************************
         SPACE 2                                               @BBDJ10X
***********************************************************************
*                                                                     *
*              SVC FUNCTION CODES                                     *
*                                                                     *
***********************************************************************
         SPACE 1                                               @BBDJ10X
IRVCEQLG EQU   0                LOGON                          @BM14056
IRVCEQLF EQU   4                LOGOFF                         @BM14056
IRVCEQCN EQU   8                CONNECT                        @BM14056
IRVCEQDC EQU   12               DISCONNECT                     @BM14056
IRVCEQSW EQU   16               SWITCH                         @BM14056
IRVCEQQU EQU   20               QUIESCE                        @BM14056
IRVCEQPL EQU   24               PULL                           @BM14056
IRVCEQIN EQU   28               INSERV                         @BM14056
IRVCEQCL EQU   32               CLEAR                          @BM14056
IRVCEQRC EQU   36               RECOVER                        @BM14056
IRVCEQEO EQU   40               EOT/M CLEAR                        @D1A
IRVCEQMX EQU   44               Immediate Quiesce                  @LAA
IRVCEQAD EQU   48               Connection ADD                     @LAA
IRVCEQCK EQU   52               Check DFHIRP level                 @L9A
         SPACE 2                                               @BBDJ10X
***********************************************************************
*                                                                     *
*              FUNCTION QUALIFICATION CODES                           *
*                                                                     *
***********************************************************************
         SPACE 1                                               @BBDJ10X
IRVCEQDN EQU   0               NORMAL DISCONNECT               @BM14056
IRVCEQDA EQU   4               ABNORMAL DISCONNECT             @BM14056
         SPACE 1                                               @BBDJ10X
IRVCEQQN EQU   0               NORMAL QUIESCE                  @BM14056
IRVCEQQI EQU   4               IMMEDIATE QUIESCE               @BM14056
         SPACE 1                                               @BBDJ10X
IRVCEQSS EQU   0               SWITCH SUBSEQUENT               @BM14056
IRVCEQSF EQU   4               SWITCH FIRST                    @BM14056
         SPACE 1                                               @BBDJ10X
IRVCEQRP EQU   0               RECOVER FROM PROGRAM CHECK      @BM14056
IRVCEQRA EQU   4               RECOVER FROM ABEND              @BM14056
         SPACE 1                                                   @D1A
IRVCEQET EQU   0               END OF TASK                         @D1A
IRVCEQEC EQU   4               END OF CROSS MEMORY RESOURCE OWNER TASK F
                                                                   @D1A
IRVCEQEM EQU   8               END OF MEMORY                       @D1A
         SPACE 1
IRVCEQPR EQU   0               ADD_PREPARE                         @L8A
IRVCEQCM EQU   4               ADD_COMMIT                          @L8A
IRVCEQRL EQU   8               ADD_ROLLBACK                        @L8A
         DFHEJECT                                              @BBDJ10X
***********************************************************************
* * *                                                             * * *
* * *                ERROR RETURN CODES                           * * *
* * *                                                             * * *
* * *    The following equates define the return codes passed     * * *
* * *    back by the Interregion Communications SVC when it       * * *
* * *    detects an error. These error codes are loaded in to RF. * * *
* * *    R0 may also contain a reason code or qualifier.          * * *
* * *    CICS code checks the L.S. 16 bits of RF which therefore  * * *
* * *    need to be unique. Storage failures use the M.S. 16      * * *
* * *    bits of RF to return the STORAGE macro error code.       * * *
* * *                                                             * * *
* * *                ERROR REASON CODES                           * * *
* * *                                                             * * *
* * *    The reason code returned in R0 is only meaningful        * * *
* * *    for those RF return codes which specify it explicitly.   * * *
* * *                                                             * * *
***********************************************************************
         SPACE 5                                               @BCA890E
*   INVALID REQUEST ERROR RETURN CODES                         @BM14056
IRERRINF EQU   4           INVALID FUNCTION REQUESTED          @BBA890E
IRERRAUT EQU   8           USER NOT AUTHORIZED TO USE SVC (MVS ONLY)   *
                                                               @BCA890E
         SPACE 1                                               @BBDJ104
*   VALIDATE SUDB ERROR RETURN CODES                           @BM14056
IRERRINE EQU   12          ENVIRONMENT INCORRECT               @BBDJ104
         SPACE 1                                               @BBDJ10X
*   VALIDATE USER ERROR RETURN CODES                           @BM14056
IRERRUNM EQU   16          INVALID USER NUMBER                 @BBA890E
IRERRUID EQU   20          INVALID USER IDENTIFICATION         @BBA890E
IRERRUKN EQU   24          INVALID LCB ADDRESS                         *
                                   (INTERNAL ERROR)            @BM14056
         SPACE 1                                               @BBDJ10X
*   VALIDATE THREAD ERROR RETURN CODES                         @BM14056
IRERRTHN EQU   28          INVALID THREAD NUMBER               @BBA890E
IRERRTHD EQU   32          INVALID THREAD ID                   @BBA890E
         SPACE 1                                               @BBDJ10X
*   SET FOOTPRINT ERROR RETURN CODES                           @BM14056
IRERRCFT EQU   36          SET FOOTPRINT FAILED                @BBA890E
         SPACE 1                                               @BBDJ10X
         SPACE 1                                               @BBDJ10X
*   LOGON-SPECIFIC ERROR RETURN CODES                          @BM14056
IRERRNOS EQU   52          NO SCTE IN THE SVA                  @BDDJ104
IRERRNFL EQU   56          NO FREE LACBE FOR LOGON             @BBDJ104
IRERRDPL EQU   60          DUPLICATE LOGON                     @BBA890E
IRERRMXL EQU   64          MAXIMUM LOGONS ALREADY REACHED      @BBA890E
IRERRGMD EQU   68          GETMAIN FAILED DIRECTORY STORAGE            *
                           (DOS/VS ONLY)                       @BM14056
         SPACE 1
*        The following Error codes are used to qualify the
*        STORAGE macro error codes shifted to the top 16 bits of RF
IRERRGM1 EQU   72          GETMAIN FAILED LACB STORAGE         @BBA890E
IRERRGM4 EQU   76          GETMAIN FAILED SUDB STORAGE         @BBDJ104
IRERRGM2 EQU   80          GETMAIN FAILED LCB/CCB STORAGE      @BBA890E
IRERRGM3 EQU   84          GETMAIN FAILED SLCB/SCCB STORAGE    @BBA890E
         SPACE 1
IRERRNAU EQU   204         NOT AUTH'D TO LOGON WITH THIS NAME      @L8A
IRERRWEN EQU   256         Bad name supplied for inter rgn work ex @L6A
IRERRWEL EQU   260         load failed for inter region work exit  @L6A
IRERRWEF EQU   264         inter region work exit has bad format   @L6A
         SPACE 1                                               @BBDJ10X
*   LOGOFF-SPECIFIC ERROR RETURN CODES                         @BM14056
IRERRLCB EQU   88          LCB NOT ON SUDB CHAIN               @BBDJ104
         SPACE 1                                               @BBDJ10X
*   CONNECT-SPECIFIC ERROR RETURN CODES                        @BM14056
IRERRNLG EQU   92          SYSTEM NOT LOGGED ON                @BBDJ10X
IRERRNCT EQU   96          Primary & secondary DFHIRP levels have      X
                           incompatible XCF User State Data for@BA58600
IRERRGM5 EQU   100         GETMAIN FAILED CSB STORAGE          @BBDJ10X
IRERRNSS EQU   104         SECONDARY SYSTEM NOT IN PRIMARY LCB @BBDJ10X
IRERRCCS EQU   108         NO SECONDARY CCB FOUND FOR PRIMARY SYSTEM   *
                                                               @BBDJ10X
IRERRIQS EQU   112         SECONDARY IS IN-QUIESCE             @BM14056
IRERRSP  EQU   12          SECONDARY TO PRIMARY CONVERTER      @BBDJ10X
IRERRNSP EQU   IRERRNSS+IRERRSP  PRIMARY SYSTEM NOT IN SECONDARY LCB   *
                                                               @BBDJ10X
IRERRCCP EQU   IRERRCCS+IRERRSP  NO PRIMARY CCB FOUND FOR SECONDARY    *
                                   SYSTEM                      @BBDJ10X
IRERRIQP EQU   IRERRIQS+IRERRSP  PRIMARY IS IN-QUIESCE         @BM14056
IRERRCCR EQU   128         NO PRIMARY CCB - RETRY REQUEST      @BBDJ10X
IRERRSCF EQU   176         SECURITY CHECK FAILED               @BBDJ10X
         SPACE 1                                               @BBDJ10X
*   DISCONNECT-SPECIFIC ERROR RETURN CODES                     @BM14056
IRERRDSC EQU   132         LINK IS ALREADY DISCONNECTED        @BBDJ10X
         SPACE 1                                               @BBDJ10X
*   SWITCH-SPECIFIC ERROR RETURN CODES                         @BM14056
IRERRSWI EQU   136         OTHER SIDE CANNOT RECEIVE DATA      @BBDJ10X
IRERRNSW EQU   140         THIS SIDE CANNOT SEND DATA          @BBDJ10X
         SPACE 1                                               @BBDJ10X
*   PULL-SPECIFIC ERROR RETURN CODES                           @BM14056
IRERRPL1 EQU   144         OTHER SIDE CANNOT BE PULLED FROM    @BBDJ10X
IRERRPL2 EQU   148         THIS SIDE CANNOT PULL DATA          @BBDJ10X
IRERRNPP EQU   152         THERE IS NO PULL PENDING            @BBDJ10X
IRERRNDP EQU   156         NO DATA TO BE PULLED (INTERNAL ERROR)       *
                                                               @BBDJ10X
         SPACE 1                                               @BBDJ10X
*   INSERVICE-SPECIFIC ERROR RETURN CODES                      @BM14056
IRERRLIQ EQU   160         LCB IS IN-QUIESCE                   @BM14056
IRERRUKS EQU   164         TARGET SYSTEM NOT FOUND IN LCB      @BBDJ10X
         SPACE 1                                               @BBDJ10X
*   MISCELLANEOUS ERROR RETURN CODES                           @BM14056
IRERRCSB EQU   168         CSB CANNOT BE FOUND                 @BBDJ10X
IRERRLNC EQU   172         LINK IS NOT CONNECTED               @BBDJ10X
         SPACE 1                                               @BBDJ10X
IRERRSCH EQU   180         ATTEMPT TO SCHEDULE AN SRB/SUBTASK FAILED   F
                                                                   @L4C
*                          ..EITHER GETMAIN FAILED FOR SRB
*                          ..PARAMETER STORAGE,
*                          ..OR PREVIOUSLY FAILED SCHEDULE
*                          ..REQUEST HAS BEEN DETECTED.
*                          ..or in VSE, an XPCC request failed
IRERRGM7 EQU   184         GETMAIN FAILED FOR SRB STORAGE(MVS) @BBDJ104
IRERRGM8 EQU   208         GETMAIN  FAILED FOR TRANSFER BUFFER @BCDJ104
IRERRGM9 EQU   212         GETMAIN FAILED FOR SSVT,SCTE,WORKAREA       F
                                                           @EAPAR8 @01C
IRERRGMA EQU   236         GETMAIN FAILED FOR LOGON CONNECTIONS LIST   F
                                                           @FJ410R @L3A
IRERRGMX EQU   228         GETMAIN FAILED FOR USE COUNT ARRAY          F
                                                           @FJ410R @L3A
IRERRAX  EQU   232         NON-ZERO AX VALUE CURRENTLY SET @FJ410R @L3A
IRERRCAT EQU   240         CONNECT SRB ATSET FAILED        @FJ410R @L3A
IRERRAXA EQU   244         NO FREE ENTRIES IN AX ARRAY     @FJ410R @L3A
IRERRLXA EQU   244         NO FREE ENTRIES IN LX ARRAY      @17879 @L3A
IRERRXME EQU   244         CROSS MEMORY ENVIRONMENT ERROR  @FJ410R @L3A
IRERRIDL EQU   248         TOTAL DATA LENGTH INVALID FOR SWITCH OR PULLF
                                                           @FJ410R @L3A
IRERRMPD EQU   252         M/C CHECK PAGING I/O OR DAT ERROR           F
                                                           @FJ410R @L3A
IRERRPST EQU   188         'SPECIAL' ABEND (BAD ECB ETC.)              F
                                                           @FJ410R @L3A
IRERRENV EQU   216         SUBSYSTEM NOTIFICATION ERROR (MVS ONLY) @L4C
IRERRDNM EQU   268         Duplicate name in LCL or LCBE chain     @L8A
IRERRDPA EQU   272         Invalid arguments for DPL               @L8A
         SPACE 1                                               @BBDJ104
*   INVALID ADDRESS RETURN CODES                               @BM14056
IRERRIA0 EQU   192         INVALID ARGUMENT OR PARAMETER ADDR  @BM14056
IRRSNDUP EQU   4           Reason - Duplicate names not allowed@BA58600
IRRSNEXC EQU   8           Reason - Not valid for EXCI         @BA58600
         SPACE 1                                               @BA58600
IRERRIA1 EQU   196         INVALID ADDRESS IN PARAMETER LIST   @BM13484
IRERRIA2 EQU   200         INVALID ADDRESS IN DATA LIST        @BM13484
IRERRIA3 EQU   220         INVALID TARGET FOR DATA MOVEMENT        @L4C
         SPACE 1                                               @BM14268
*   INTERNAL LOGIC ERROR CODE                                  @BM14268
IRERRILE EQU   224         INTERNAL LOGIC ERROR                @BM14268
*   CHCKLEVL-SPECIFIC ERROR RETURN CODES                           @L9A
IRERRLVE EQU   228         DFHIRP SERVICES ARE DOWN-LEVEL          @L9A
IRERRXCF EQU   276         XCF failure, R0 has XCF RF return value @L8A
IRERRTKN EQU   280         Token not found - Build/Cmt/Rollback    @L8A
         DFHEJECT                                                  @L6A
*+*-------------------------------------------------------*+       @L6A
*+*                                                       *+       @L6A
*+* IRWE_INPUT Describes the parameter list passed from   *+       @L6A
*+* DFHIRP/DFHXMP to the inter region work exit.          *+       @L6A
*+*                                                       *+       @L6A
*+*-------------------------------------------------------*+       @L6A
IRWE_INPUT DSECT ,                                                 @L6A
IRWE_LATENT DS   F      work exit latent parm (default SLCB)       @L6A
IRWE_SCCB   DS   A      address of session control block(if any)   @L6A
IRWE_TARGET DS   F      ALET for target address psace              @L6A
IRWE_INPUT_L EQU *-IRWE_INPUT  Length of parameter list            @L8A
*                                                                  @L6A
*+*-------------------------------------------------------*+       @L6A
*+*                                                       *+       @L6A
*+* The following equates define the inter region work    *+       @L6A
*+* exit return codes (R15 values)                        *+       @L6A
*+*                                                       *+       @L6A
*+*-------------------------------------------------------*+       @L6A
IRWE_OK     EQU   0       work exit has delivered the work         @L6A
IRWE_IRPDEL EQU   4       IRP is to deliver the work               @L6A
IRWE_ERROR  EQU   8       work exit was unable to deliber the work @L6A
*                                                                  @L6A
*+*-------------------------------------------------------*+       @L6A
*+*                                                       *+       @L6A
*+* The following equates define the exit point id's      *+       @L6A
*+* used by the inter region work exits.                  *+       @L6A
*+*                                                       *+       @L6A
*+*-------------------------------------------------------*+       @L6A
IRWEREC  EQU   0        recovery                                   @L6A
IRWENC   EQU   1        new connect                                @L6A
IRWESW   EQU   2        switch (not  first)                        @L6A
IRWESW1  EQU   3        switch 1st                                 @L6A
IRWENDIS EQU   4        normal disconnect                          @L6A
IRWEADIS EQU   5        abnormal disconenct                        @L6A
IRWEIQU  EQU   6        immediate quiesce                          @L6A
IRWEDWP  EQU   7        disconnect when possible                   @L6A
IRWECQU  EQU   8        quiesce complete                           @L6A
