//EDCDSECT PROC LIBPRFX=CEE,LNGPRFX=CBC,QUAL='PRJ.CBTDSSN'
//*----------------------------------------------------------
//* DSECT UTILITY STEP
//*----------------------------------------------------------
//DSECT EXEC PGM=CCNEDSCT,
// PARM='EQU(DEF),SECT(&M),LOC(DE_DE.IBM-273),LOWERCASE'
//STEPLIB DD   DSNAME=&LIBPRFX..SCEERUN2,DISP=SHR
//         DD  DSNAME=&LNGPRFX..SCCNCMP,DISP=SHR
//         DD  DSNAME=&LIBPRFX..SCEERUN,DISP=SHR
//SYSADATA DD DSN=ESA.&QUAL..ADATA(&IM),DISP=SHR
//EDCDSECT DD DSN=ESA.&QUAL..HPP(&OM),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
// PEND
