//TSO0513 JOB (MVS19200,0181),'B.WILLIAMS',CLASS=W,MSGCLASS=X,
//             NOTIFY=MVS#WFW,COND=(0,NE)
//*
//SYSASM   PROC MEMBER=NEEDED,RVOL=NEWRES,RUNIT=3380,
//             DVOL=NEWRES,DUNIT=3380,
//             JVOL=MVSM02,JUNIT=3380
//*
//ASM      EXEC PGM=IEV90,PARM='XREF,NODECK,OBJECT'
//SYSLIB   DD DSN=TECH.MVS#WFW.INSTALL,DISP=SHR,
//            DCB=BLKSIZE=19040
//         DD DSN=SYS2.MACLIB,DISP=SHR         $FINDCB MACRO
//         DD DSN=SYS1.SMPMTS,DISP=SHR,UNIT=&RUNIT,VOL=SER=&JVOL
//         DD DSN=SYS1.MACLIB,DISP=SHR,UNIT=&RUNIT,VOL=SER=&RVOL
//         DD DSN=SYS1.AMODGEN,DISP=SHR,UNIT=&DUNIT,VOL=SER=&DVOL
//         DD DSN=NTL1.ACF411.ACFMAC,DISP=SHR
//         DD DSN=SYS1.HASPSRC,DISP=SHR,UNIT=&JUNIT,VOL=SER=&JVOL
//SYSUT1   DD DSN=&&SYSUT1,UNIT=VIO,SPACE=(1700,(600,100))
//SYSUT2   DD DSN=&&SYSUT2,UNIT=VIO,SPACE=(1700,(300,50))
//SYSUT3   DD DSN=&&SYSUT3,UNIT=VIO,SPACE=(1700,(300,50))
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=TECH.MVS#WFW.INSTALL(&MEMBER),DISP=SHR
//SYSGO    DD DSN=&&OBJLIB(&MEMBER),DISP=(MOD,PASS),
//            UNIT=WORK,SPACE=(400,(800,400,10),,,ROUND),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=880,DSORG=PO)
//         PEND
//*
//********************************************************************
//TSO051 EXEC SYSASM,MEMBER=TSO0513
//*
//**** LINK NTL1013 LOAD MODULE INTO A AUTHORIZED LIBRARY ****
//*
//LKED   EXEC PGM=IEWL,PARM='XREF,LIST,REUS,AC=1'
//SYSLMOD  DD  DSN=SYS1.LINKLIB,DISP=SHR,UNIT=3380,VOL=SER=NEWRES
//SYSUT1   DD  UNIT=WORK,SPACE=(CYL,(2,1))
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=&&OBJLIB,DISP=SHR
//ACFMOD   DD DSN=NTL1.ACF411.ACFMOD,DISP=SHR
//SYSLIN   DD  *
 ALIAS GETINFO
 ALIAS TSO0513
 INCLUDE SYSLIB(TSO0513)
 INCLUDE ACFMOD($ACFGCVT)
 IDENTIFY GETINFO('GETINFO - TSOE R3 - IKJCT441')
 NAME TSO051(R)
//AFTER  EXEC PGM=IEFBR14
//
