*
* CODING EXAMPLE 2.4.1
*
*
BLDTBL   L     R10,TBLPTR            LOAD ADR OF CUR TBL SLOT
         MVC   0(ENTLEN,R10),ENTRY   MOVE ENTRY INTO TABLE
         LA    10,ENTLEN(0,R10)      INCR TO NEXT TABLE SLOT
         ST    R10,TBLPTR            STORE ADR OF NEXT TBL SLOT
         BR    R8                    RETURN TO CALLER
         ...
ENTLEN   EQU   25
TBLPTR   DS    F
ENTRY    DS    CL25
