*
* CODING EXAMPLE 4.11.1
*
*
         BAL   R6,GETVSER          OBTAIN VOLSER FROM USER
         BAL   R6,SCANUCBS         SCAN UCB TABLE FOR VOLSER
         BAL   R6,GETUADR          GET CORRESPONDING UNIT ADR
         BAL   R6,DPLYINFO         MODIFY AND DSPLY WTO MSG
         ...
DPLYINFO MVC   W1VOLSER,VOLSER     MOVE VOLSER INTO WTO MSG
         MVC   W1UNADR,UNITADR     MOVE UNIT ADR INTO WTO MSG
         LA    R1,WTOLST1          SET R1 TO POINT TO WTO LIST
         WTO   MF=(E,(R1))         ISSUE EXEC FORM OF WTO
         BR    R6                  RETURN TO CALLING RTN
         ...
WTOLST1  DC    AL2(WTOLST1X-WTOLST1)
         DC    H'0'
         DC    C'VOLSER '
W1VOLSER DS    CL6
         DC    C' IS MOUNTED ON '
W1UNADR  DS    CL3
WTOLST1X EQU   *
