*
* CODING EXAMPLE 8.7.3
*
*
         OPEN  (PDSBDCB,(OUTPUT))
         ...
         MVC   BLDLNAME,MEMBNAME   PUT EXISTING MEMB NAME INTO
*                                  BLDL-LIST
         BLDL  PDSBDCB,BLDLLST     OBTAIN TTRC OF MEMB
         ...
         MVC   STOWNAME,ALIASNAM   PUT ALIAS NAME INTO STOW-LIST
         MVC   STOWTTR,BLDLTTR     PUT LOC OF MEMB INTO STOW-LIST
         STOW  PDSBDCB,STOWLST,A   UPDATE DIRECTORY (ADD ALIAS)
         ...                       CHECK RETURN CODE
*
BLDLLST  DS    0CL16
BLDLFFLL DC    X'0001',X'000C'     NUMB OF ENTRIES, MAX ENTRY LEN
BLDLNAME DS    CL8
BLDLTTR  DS    CL3
BLDLK    DS    CL1
*
STOWLST  DS    0CL12
STOWNAME DS    CL8
STOWTTR  DS    CL3
STOWC    DC    X'80'               HIGH ORDER BIT ON TO IND ALIAS
*
MEMBNAME DS    CL8
ALIASNAM DS    CL8
*
PDSBDCB  DCB   DSORG=PO,...
