*
* CODING EXAMPLE 10.1.1
*
*
//LKED         EXEC ASMFCL,PARM.LKED='AC=1,...'
//LKED.SYSLMOD DD   DSN=USER.AUTHLIB(pgm-name),DISP=SHR
//

              or

//L            EXEC ASMHCL,PARM.L='...'
//L.SYSLMOD    DD   DSN=USER.AUTHLIB,DISP=SHR
//L.SYSIN      DD   *
  SETCODE AC(1)
  NAME pgm-name
//
