*
* CODING EXAMPLE 15.4.6
*
*
         ATSET AX=AXVALUE,PT=NO,SSAR=NO    RELEASE ACCESS FROM SP-AS
         ETDIS TKLIST=ET01TKEN             DISCONNECT ENTRY TABLE
*                                          FROM LINKAGE TABLE
         ...
ET01LIST DS    0F
ET01CNT  DC    F'1'                NUMB OF ENT-TBL TOKENS IN LIST
ET01TKEN DS    F                   TOKEN OF ENTRY TABLE OF SP-AS
