*
* CODING EXAMPLE 16.5.1
*
*
          AMODE 31
          RMODE ANY
          ...
          DSPSERV CREATE,TYPE=HIPERSPACE,SHARE=NO,STOKEN=HS01STOK,   -
                NAME=HS01NAME,GENNAME=YES,OUTNAME=HS01GNAM,          -
                BLOCKS=(MAXBLKS,INITBLKS),ORIGIN=HS01ORGN
   *      ...
HS01STOK  DS    D                 RECEIVED FROM THE DSPSERV MACRO
HS01ORGN  DS    F                 RECEIVED FROM THE DSPSERV MACRO
HS01NAME  DC    CL8'$H1'
HS01GNAME DS    CL8
MAXBYTES  EQU   10000000          REQUIRE MAX OF 10 MILLION BYTES
INITBYTES EQU   1000000           REQUIRE 1 MILLION BYTES INITIALLY
MAXBLKS   DC    A((MAXBYTES+4095)/4096)   NUMB 0F BLOCKS REQUIRED
INITBLKS  DC    A(INITBYTES+4095)/4096)   NUMB OF BLOCKS REQUIRED
