//AUTHC    JOB (........),'INSTALL  - AUTHC -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=3
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* PRE-REQUISITE MODULES INSTALLATION :                              *
//*                AUTHCTL                                            *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASS     EXEC PAJIAS3,OPT=',RENT',MBR=AUTHC
//LNK     EXEC PAJILKC,OPT=',RENT'
//SYSIN     DD *
  ENTRY   AUTHC
  SETCODE AC(1)
  NAME    AUTHC(R)
/*
