//DYNALL   JOB (........),'INSTALL  - DYNALL -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=5
//ASS     EXEC PAJIAS3,OPT=',RENT',MBR=DYNALL
//LNK     EXEC PAJILKR,OPT=',RENT'
//SYSIN     DD *
  ENTRY   DYNALL
  NAME    DYNALL(R)
/*
