//EURACFT  JOB (........),'INSTALL  - EURACFT -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=1M,TIME=1
/*JOBPARM L=4
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* PRE-REQUISITE MODULES INSTALLATION :                              *
//*                AUTHSVC                                            *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASS     EXEC PAJIAS3,OPT=',RENT',MBR=EURACFT
//LNK     EXEC PAJILKC,OPT=',MAP,RENT'
//SYSIN     DD *
  ENTRY   EURACFT
  NAME    EURACFT(R)
/*
//HLP     EXEC PAJHELP,MBR=EURACFTH
