//GDGRESET JOB (........),'INSTALL - GDGRESET -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=1M,TIME=1
/*JOBPARM L=4
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* PRE-REQUISITE MODULES INSTALLATION :                              *
//*                TXREAD    TXPRINT                                  *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASS     EXEC PAJIAS3,MBR=GDGRESET
//LNK     EXEC PAJILKL
//SYSIN     DD *
  INCLUDE SYSADD(READ,PRINT)
  ENTRY   GDGRESET
  NAME    GDGRESET(R)
/*
