//ISPCDSN  JOB (........),'INSTALL - ISPCDSN -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=5
//ASS     EXEC PAJIAS2,MBR=ISPCDSN
//LNK     EXEC PAJILKI
//SYSIN     DD *
  INCLUDE      SYSISP(ISPLINK)
  ENTRY   ISPCDSN
  NAME    ISPCDSN(R)
/*
