//JB       JOB (........),'INSTALL  - JB -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=4
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* PRE-REQUISITE MODULES INSTALLATION :                              *
//*                AUTHSVC                                            *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASS     EXEC PAJIAS3,OPT=',RENT',MBR=JB
//LNK     EXEC PAJILKC,OPT=',RENT'
//SYSIN     DD *
  ENTRY   JB
  NAME    JB(R)
/*
//HLP     EXEC PAJHELP,MBR=JBH
