//PAJICT   JOB (........),'ISPF COPY TABLES',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=1
//CPY     EXEC PAJISPF,DST='->.ISPF.TABLES'
//CM.SYSIN  DD *
  COPY   OUTDD=TARGET,INDD=SOURCE
  SELECT MEMBER=((EDITMACT,EDITMACS))
  SELECT MEMBER=(TMTH,TMTHD,TMTHDK,TMTHE,TMTHF,TMTHI,TMTHP)
  SELECT MEMBER=(TWKD,TWKDD,TWKDDK,TWKDE,TWKDF,TWKDI,TWKDP)
/*
