)ATTR
` TYPE(TEXT) COLOR(YELLOW)
$ TYPE(TEXT) COLOR(YELLOW) HILITE(REVERSE)
{ TYPE(TEXT) COLOR(GREEN)
~ TYPE(TEXT) COLOR(BLUE)
} TYPE(TEXT) COLOR(RED)
\ TYPE(TEXT) COLOR(RED) HILITE(BLINK)
! TYPE(TEXT) COLOR(PINK)
¦ TYPE(TEXT) COLOR(TURQ)
# TYPE(TEXT) INTENS(HIGH) SKIP(ON)
)BODY
#---------------------------$   L  O  C  K  table   #---------------------------
+
+
+
¦Do you know how I run ?+
+
+             }... no |!it's your problem,\sorry |+
+
+             {... yes |~OK,+
+                       `then,+
+                       ¦do you know what I want ?+
+
+                                 }... no |!it's also your problem,\sorry |+
+
+                                 {... yes |~OK,+
+                                           `so long and good luck |+
+
)PROC
  &ZCONT = PAJKUMXH
)END
