//&EURUSID.C JOB (&EUACCNO),'PDS - DIRECTORIES',
//             MSGLEVEL=(1,1),MSGCLASS=X,REGION=1M,TIME=(,20),
//             NOTIFY=&EURUSID,USER=&EURUSID
/*JOBPARM L=10
)SEL &PDOPT = &Z
//XEQ     EXEC PGM=PDSMATCH
)ENDSEL
)SEL &PDOPT ¬= &Z
//XEQ     EXEC PGM=PDSMATCH,
//             PARM='&PDOPT'
)ENDSEL
//STEPLIB   DD DSN=->.TARGET.LINKLIB,DISP=SHR
)SEL &PVOL1 = &Z
//SYSLIB1   DD DSN=&PDSNA,DISP=SHR
)ENDSEL
)SEL &PVOL1 ¬= &Z
//SYSLIB1   DD UNIT=DISK,VOL=SER=&PVOL1,
//             DSN=&PDSNA,DISP=SHR
)ENDSEL
)SEL &PVOL2 = &Z
//SYSLIB2   DD DSN=&PDSNB,DISP=SHR
)ENDSEL
)SEL &PVOL2 ¬= &Z
//SYSLIB2   DD UNIT=DISK,VOL=SER=&PVOL2,
//             DSN=&PDSNB,DISP=SHR
)ENDSEL
//SYSPRINT  DD SYSOUT=*
