//&EURUSID.R JOB (&EUACCNO),'R S M    ANALYSIS',
//             MSGLEVEL=(1,1),MSGCLASS=X,REGION=1M,TIME=(,30),
//             NOTIFY=&EURUSID,USER=&EURUSID
/*JOBPARM L=50
)SEL &IVKP = &Z
//XEQ     EXEC PGM=RSMANAL
)ENDSEL
)SEL &IVKP ¬= &Z
//XEQ     EXEC PGM=RSMANAL,
//             PARM='&IVKP'
)ENDSEL
//&IVKL     DD SYSOUT=*
)SEL &IVKS ¬= &Z
//&IVKS     DD SYSOUT=*
)ENDSEL
)SEL &IVKD = YES
//SYSUDUMP  DD SYSOUT=*
)ENDSEL
