)BODY EXPAND(//)
%TUTORIAL-/-/- M A I L - B O X E S -/-/-TUTORIAL
%COMMAND ===>_ZCMD                                                             +
+
%Browsing, Printing "mail-box" entries.+

%Browse a "mail-box" entry.+
 To browse a "mail-box" entry, enter%B+in the action area for the mail. Enter
%Bn+to browse sequentially the%n+successive "mail-box" entries starting from
 the one selected by the line-command.

%Printing a "mail-box" entry.+
 To print a "mail-box" entry, enter%L+in the action area for the mail. Enter
%Ln+to print sequentially the%n+successive "mail-box" entries starting from
 the one selected by the line-command. Verify and set, if you want change it,
 the print output class and destination.

+Enter%&EPF+to exit the tutorial and return to the MAIL-LIST
+Hit%ENTER+to go on to the next tutorial panel
)INIT
  &EPF = PFK(END)
  IF (&EPF = &Z)
    &EPF = 'END'
  &D = TRUNC(&EPF,2)
  &DT = .TRAIL
  &D = TRUNC(&DT,1)
  IF (&D = '0')
    &DT = .TRAIL
    &EPF = 'PF&DT'
)PROC
)END
