//PRINT    JOB (........),'INSTALL  - PRINT -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=4
//ASS     EXEC PAJIAS3,MBR=TXPRINT
//LNK     EXEC PAJILKR
//SYSIN     DD *
  ALIAS   PCLOSE
  NAME    PRINT(R)
/*
