//VREAD    JOB (........),'INSTALL  - VREAD -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=4
//ASS     EXEC PAJIAS3,MBR=VREAD
//LNK     EXEC PAJILKR
//SYSIN     DD *
  ALIAS   VOPEN
  ALIAS   VCLOSE
  NAME    VREAD(R)
/*
