//D061001X JOB (00000000,06009,10),ASMBLE,MSGCLASS=Q,NOTIFY=D061001
//*
//* REF: D061001.SYSLOG(OPTIONE)
//* DOC: ASM/LINK SPF SYSLOG APPLICATION'S EXCEPTION EVENT REPORTER
//*
//ASSEMBLE EXEC PGM=IFOX00,PARM='OBJ,TERM'
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//SYSUT1   DD DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(1700,(600,100))
//SYSUT2   DD DSN=&&SYSUT2,UNIT=SYSDA,SPACE=(1700,(300,50))
//SYSUT3   DD DSN=&&SYSUT3,UNIT=SYSDA,SPACE=(1700,(300,50))
//SYSTERM  DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSGO    DD DSN=&&OBJSET,UNIT=SYSDA,SPACE=(80,(200,50)),
//             DISP=(MOD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
*
*   REFER: D061001.SYSLOG(OPTIONE) - THIS SOURCE IS NAMED 'OPTIONE'
*          SIMPLY BECAUSE THE ISPF SYSLOG APPLICATION MENU OPTION TO
*          INVOKE THE EXCEPTION PROGRAM IS 'OPTION E'.
*
*    - THIS PROGRAM IS INVOKED VIA THE
*      SPF SYSLOG UTILITY PRIMARY OPTION 'E'.     OPTION 'E' SUBMITS
*      AN EXCEPTION REPORT WHICH SCANS THE SYSLOG FOR SPECIFIC LITERALS
*      (I.E., EVENTS).       FOR EACH 'HIT' THAT IS FOUND, A 5 DIGIT
*      IDENTIFIER IS WRITTEN AT THE BEGINNING OF THE RECORD. A 3 DIGIT
*      JULIAN DATE FOLLOWS THEN THE ACTUAL SYSLOG RECORD TEXT COMPLETES
*      THE RECORD.  ONCE THE SYSLOG IS SCANNED FOR VARIOUS EVENTS,
*      THE EXTRACTED RECORDS ARE SORTED IN EVENT-ID, DATE, AND TIME
*      ORDER. THE ISPF SYSLOG APPLICATION PROVIDES FOR THIS PROGRAM TO
*      BE RUN AGAINST THE SYSLOG AT ANY TIME (OPTION 'E'). IN ADDITION,
*      THIS SAME FUNCTION IS BUILT INTO THE WEEKLY SYSLOG DUMP JOB-
*      STREAM (OPTION 'DW') SO AS TO ASSURE AUTOMATED WEEKLY EXECUTION.
*
*    - REPORT IDENTIFIERS ARE GROUPED BY APPLICATION AS FOLLOWS:
*
*      MVS - VARIOUS
*      JES - LINE PROBLEMS, ETC.
*      NET - MAJNODE ACT,LINE PROBLEMS, ETC.
*      TSO - LOGON FAILURES,ETC.
*      RAC - RACF ACTIVITY
*      SAS - ISPF SAS INVOCATIONS
*      VPS - JOBS PRINTED VIA VPS
*      CAD - BUFFER SHORTAGES
*      LOG - SYSLOG APPLICATION INVOCATIONS
*      SMF - MAN FILE STATUS
*      ARC - STATIC TEST DATA ARCHIVAL SYSTEM
*      PCC - PCCOM - HOST/PC FILE TRANSFERS
*      GUN - PE 'GUN' CODE INVOCATIONS
*    PEPGM - PE PROGRAM INVOCATIONS  (NON-GUN)
*      MCG - ABL-TO-MCGREGOR FILE TRANSFERS
*     UTIL - ABL-INSTALLED UTILITIES (NON-IBM)
*      X37 - DASD WOES
*
*    - SEVERAL OF THE APPLICATIONS MENTIONED ABOVE INCLUDE COMMANDS TO
*      ISSUE CONSOLE MESSAGES (EITHER CLIST 'SEND' OR PGM 'WTO') SO
*      THAT THE EXCEPTION PROCESSOR PROGRAM CAN READILY REPORT VARIOUS
*      EVENTS.  TO IDENTIFY SYSLOG RECORDS PRODUCED BY AN ABL-SPECIFIC
*      APPLICATION, THE CHARACTER '#ABL...' PRECEEDS THE TEXT OF EACH
*      RECORD. E.G., THE SYSLOG RECORD '#ABLLOG ... TEXT ...' INDICATES
*      A RECORD CREATED AS A RESULT OF A USER INVOKING ONE OF THE VARI-
*      OUS SYSLOG APPLICATION FUNCTIONS.
*
*
R0       EQU   0
R1       EQU   1
R2       EQU   2
R3       EQU   3
R4       EQU   4
R5       EQU   5
R6       EQU   6
R7       EQU   7
R8       EQU   8
R9       EQU   9
R10      EQU   10
R11      EQU   11
R12      EQU   12
R13      EQU   13
R14      EQU   14
R15      EQU   15
         SPACE 2
OPTIONE  CSECT
         STM   14,12,12(13)
         BALR  9,0
         USING *,9
         ST    13,SAVEAREA+4
         LA    12,SAVEAREA
         ST    12,8(13)
         LR    13,12
STARTPR  OPEN  (SYSUT1,,SYSUT2,(OUTPUT))
*
* REMEMBER TO ADD TO DISPLACE COMPARE'S BY 4 AS RECORDS HAVE RDW'S
* SEE JES2 OPERATOR COMMANDS MANUAL FOR SYSLOG RECORD DESCRIPTION
*
READ     MVI   RECORD,X'40'      CLEAR RECORD OF RECFM=VB POLLUTION
         MVC   RECORD+1(132),RECORD
         GET   SYSUT1,RECORD
         CLC   29(7,R1),=C'IEE136I'  IS THIS A 'D T' DATE STAMP?
*              ADD A JES2 AUTOMATIC COMMAND TO 'D T' ON YOUR SYSTEM
         BNE   JCLERROR           NO, CONTINUE TESTING
         MVC   DATE,66(R1)       YES, SAVE THE 'CURRENT' DATE
         B     READ
JCLERROR CLC   29(7,R1),=C'IEF452I'  IS THIS A JCL ERROR?
         BNE   LOG01
         MVC   PRTLINE(5),=C'MVS01'   ASSIGN UNIQUE SORT ID
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE+10(123),RECORD+10 BYPASS RDW + SYSLOG RECORD #'S
         PUT   SYSUT2,PRTLINE
         B     READ
LOG01    CLC   30(7,R1),=C'#ABLLOG'  IS THIS A SYSLOG VIA SPF RECORD?
         BNE   VPS01
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'LOG01'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
VPS01    CLC   29(10,R1),=C'VPS VPS205'   VPS 'JOB PRINTED' RECORD?
         BNE   X37
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'VPS01'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
X37      CLC   38(4,R1),=C'37-0'      SPACE ABEND?
         BNE   IPL
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'X37  '   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
IPL      CLC   42(7,R1),=C'IEA101A'    IPL RECORD?
         BNE   MOREIPL
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'MVS77'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
MOREIPL  CLC   29(3,R1),=C'IFB'   IPL RECORD ?
         BNE   SRM
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'MVS79'
         PUT   SYSUT2,PRTLINE
         B     READ
SRM      CLC   29(3,R1),=C'IRA'   SRM-RELATED ?
         BNE   JOBABEND
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'MVS81'
         PUT   SYSUT2,PRTLINE
         B     READ
JOBABEND CLC   29(7,R1),=C'IEF450I'   JOB ABEND?
         BNE   MASTCAT
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'MVS05'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
MASTCAT  CLC   32(7,R1),=C'IEC301A'   MASTERCAT VIOLATION ?
         BNE   NETABEND
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'MVS07'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
NETABEND CLC   29(7,R1),=C'IST464I'   NCP CONTACT?
         BNE   SETINITS
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'NET01'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
SETINITS CLC   29(3,R1),=C'$TI'      INITIATOR CHANGED?
         BNE   BADMEMBR
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'JES04'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
BADMEMBR CLC   37(6,R1),=C'013-18'   WRONG MEMBER NAME SPECIFIED?
         BNE   SMFINFO
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'MVS18'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
SMFINFO  CLC   29(5,R1),=C'IEE36'   GENERIC SMF RECORD?
         BNE   SMFINFO2
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'SMF01'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
SMFINFO2 CLC   20(8,R1),=C'SYS1.MAN'   MAN INFO RECORD ?
         BNE   ARC
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'SMF03'   ASSIGN SAME ID AS SMFINFO
         PUT   SYSUT2,PRTLINE
         B     READ
ARC      CLC   30(7,R1),=C'#ABLARC'   ARCHIVAL SYSTEM RECORD ?
         BNE   TSOLOGON
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'ARC00'
         PUT   SYSUT2,PRTLINE
         B     READ
TSOLOGON CLC   29(5,R1),=C'IKJ60'  GENERIC LOGON FAILURE MSGID.
         BNE   BADCMD
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'TSO00'
         PUT   SYSUT2,PRTLINE
         B     READ
BADCMD   CLC   29(7,R1),=C'IEE305I'  BAD OPER COMMAND
         BNE   VTOCFULL
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'MVS30'
         PUT   SYSUT2,PRTLINE
         B     READ
VTOCFULL CLC   29(6,R1),=C'IEF254'  VTOC FULL ?
         BNE   DEVCAN
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'MVS36'
         PUT   SYSUT2,PRTLINE
         B     READ
DEVCAN   CLC   29(6,R1),=C'IEF489'  DOES JOB NEED DEVICE?
         BNE   PCCOM
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'MVS38'
         PUT   SYSUT2,PRTLINE
         B     READ
PCCOM    CLC   30(7,R1),=C'#ABLPCC'  WAS PCCOM INVOKED?
         BNE   ABLVMCF
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'PCC01'
         PUT   SYSUT2,PRTLINE
         B     READ
ABLVMCF  CLC   30(7,R1),=C'#ABLVMCF' WAS VPS/VMCF INVOKED?
         BNE   ABLSAS
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'VPS10'
         PUT   SYSUT2,PRTLINE
         B     READ
ABLSAS   CLC   30(7,R1),=C'#ABLSAS' WAS SAS (ISPSASEX) INVOKED IN SPF?
         BNE   SASVTEC
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'SAS50'
         PUT   SYSUT2,PRTLINE
         B     READ
SASVTEC  CLC   30(7,R1),=C'IEV080I' WAS VERSATEC PLOTTING INVOKED?
         BNE   CADBUFF
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'VTEC0'
         PUT   SYSUT2,PRTLINE
         B     READ
CADBUFF  CLC   29(7,R1),=C'IFF512I' DID CAD TUBE SESSION EXCEED BUFFER
         BNE   CADPLOT
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'CAD00'
         PUT   SYSUT2,PRTLINE
         B     READ
CADPLOT  CLC   30(7,R1),=C'#ABLCAD'  CAD PLOTTER OPERATOR DIALOG USED?
         BNE   GUN
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'CAD02'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
GUN      CLC   30(7,R1),=C'#ABLGUN'  WAS 'GUN' CODE INVOKED IN SPF?
         BNE   PEPGMS
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'PGM01'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
PEPGMS   CLC   30(7,R1),=C'#ABLPEPGM'  WERE PE PROGRAMS INVOKED?
         BNE   ABLUTILS
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'PGM03'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
ABLUTILS CLC   30(7,R1),=C'#ABLUTIL'  WERE ANY ABL UTILITIES INVOKED?
         BNE   SASCBT
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'UTL01'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
SASCBT   CLC   30(7,R1),=C'#SASCBT'      WAS SAS CBT INVOKED?
         BNE   ABLTOMCG
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'SAS61'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
ABLTOMCG CLC   30(7,R1),=C'#ABLTOMCG' TRANSFER DATA TO MCGREGOR ?
         BNE   RACFSPF
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'MCG00'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
RACFSPF  CLC   30(7,R1),=C'#ABLRACF' RACF DIALOG ACCESS
         BNE   RACFTSO
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'RAC00'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
RACFTSO  CLC   33(8,R1),=C'ICH70004' RACF TSO VIOLATION NOTIFICATION?
         BNE   READ
         MVC   PRTLINE+10(123),RECORD+10
         MVC   PRTLINE+6(3),DATE      MOVE CURRENT JULIAN DATE INTO REC
         MVC   PRTLINE(5),=C'RAC02'   ASSIGN UNIQUE SORT ID
         PUT   SYSUT2,PRTLINE
         B     READ
EOF      CLOSE (SYSUT1,,SYSUT2)
         L     13,SAVEAREA+4
         LM    0,12,20(13)
         L     14,12(13)
         BR    14
         EJECT
         LTORG
RECORD   DS    CL133' '
PRTLINE  DS    CL133' '
DATE     DC    CL3'000'
SAVEAREA DC    18F'0'
SYSUT1   DCB   DDNAME=SYSUT1,DSORG=PS,MACRF=GM,EODAD=EOF,              X
               BLKSIZE=32760,LRECL=133,RECFM=VBA,EROPT=SKP
SYSUT2   DCB   DDNAME=SYSUT2,DSORG=PS,MACRF=PM,BLKSIZE=133,RECFM=FB,   X
               LRECL=133
         END
/*
//LINKEDT EXEC PGM=IEWL,COND=(4,LT),
//         PARM='LIST,XREF,LET',REGION=650K
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1700,(400,50))
//SYSLMOD  DD  DISP=SHR,DSN=D061001.LOAD
//OBJSET   DD  DSN=&&OBJSET,DISP=(OLD,DELETE,DELETE)
//SYSLIN   DD  *
 INCLUDE OBJSET
 NAME OPTIONE(R)
//*   END OF JOSTREAM OPTIONE
