)CM REF: D061001.SYSLOG(SLOGSA)
)CM DOC: SKELETON USED BY SYSLOG APPLICATION PANEL LOGSA001 AND ALSO
)CM      CLIST LOGSA TO BUILD JCL TO SAERCH A GIVEN MONTHLY ARCHIVED
)CM      SYSLOG TAPE.
)CM
//&SYSUID.S JOB (00000000,06949,10),'SEARCH ARCHIVES',
// CLASS=A,TIME=1,MSGCLASS=Q,NOTIFY=D061001
//* DOC: THIS JOBSTREAM PRODUCED VIA SPF OPTION 3.S.SA
//SYSLOGSP EXEC PGM=LOGSCAN,REGION=300K,TIME=2,
// PARM='&LOGBDAT.&LOGBHR.&LOGENDHR.&LOGLIT'
//STEPLIB DD DSN=D061001.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD DISP=SHR,DSN=D061001.LOG&LOGQTR.&LOGYEAR
//SYSUT2 DD SYSOUT=*
//SYSUDUMP  DD DUMMY
