//IBMUSERB JOB  MSGCLASS=H
//PROC     JCLLIB ORDER=(CPAC.PROCLIB)
//         EXEC ISP2CSV,TABLE=TEST,FS=';'
//ISPTCSV.TBL DD DISP=SHR,DSN=CPAC.ISPTLIB
//ISPTCSV.CSV DD DISP=(NEW,PASS),DSN=&&CSV,
//             UNIT=VIO,SPACE=(TRK,(1,1)),
//             DCB=(DSORG=PS,LRECL=255,BLKSIZE=0,RECFM=VB)
//PRINT    EXEC PGM=IEBGENER
//SYSPRINT DD  DUMMY
//SYSIN    DD  DUMMY
//SYSUT1   DD  DISP=(OLD,DELETE),DSN=&&CSV
//SYSUT2   DD  SYSOUT=*
//
