*        COPYRIGHT (C) 1986,1994  PRYCROFT SIX PTY LTD
ESRPRMTJ DC    X'C11140403C40400011C5C2&LOW'
*** ENTER DECIMAL SVC NUMBER OF EXTENDED SVC ROUTER
         DC    X'400F'
         DC    C'·HDv'
         DC    X'0E40'
         DC    C' SVC '
         DC    X'400F'
         DC    C'vÔ~¯v×uó'
         DC    X'0E40'
         DC    C' SVC '
         DC    X'400F'
         DC    C'HO¾Wu2×4CòuôuFFÚóõ'
         DC    X'0E40'
***      DC    C'                                    '
         DC    X'&MED',C'===>',X'1BC94E132841F4000000'
         DC    X'2841001BF8C2'
         DCS   SBA,(10,3)
         DC    X'&LOW'
*** (USE E/ FROM DETAIL SCREEN TO CANCEL ESR DISPLAY AND SHOW MAIN
         DC    X'400F'
         DC    C'~­´ü[R¥Yööu¿uZtE~×u2]HòJu¼·HDv'
         DC    X'0E40'
         DC    C' SVC '
         DC    X'400F'
         DC    C'vÔ~¯v×I¨¯yuóvÝvTv3v]vÔ½V~s'
         DC    X'0E40'
         DC    X'400F'
         DC    C'¯X'
         DC    X'0E40'
         DCS   SBA,(11,6)
         DC    C' SVC '
         DC    X'400F'
         DC    C'vF~¯vOvÔuóI¨¯yuÐ¥DG¨'
         DC    X'0E40'
         DC    C')'
***
GTESRJLN EQU   *-ESRPRMTJ
         DC    X'11D1E2&HIGH'
         DC    C'REENTER - SVC'
ESRERNOJ DC    CL4' '
         DC    C' IS NOT AN EXTENDED SVC ROUTER'
GTESRJLX EQU   *-ESRPRMTJ
