         TITLE 'COMMON AREA'
IMGATCOM COM
SAVE     DS    18F
WORK     DS    D
WORK2    DS    D
DASDJOB  DS    CL8                DROP DASD 14/15/17/18 FOR THIS JOB.
TAPEJOB  DS    CL8                DROP TAPE 14/15 EVENTS FOR THIS JOB.
TRACEJOB DS    CL8                COLLECT EVENTS ONLY FOR THIS JOB.
OSLVL    DS    XL16               MVS/ESA FEATURE FLAGS FROM CVTOSLVL.
COMMADDR DS    A                  ADDRESS OF COMMUNICATIONS LIST.
GATFLAGS DS    X                  STATUS FLAGS.
OWNSYS   EQU   X'80'              ONLY PROCESS DATA FROM THIS SYSTEM.
NOTRACK  EQU   X'40'              DO NOT TRACK CURRENT SMF DATA.
DONEOPEN EQU   X'20'              CURRENTLY IN "PRIMING" MODE.
DONCLOSE EQU   X'10'              "PRIMING" MODE HAS COMPLETED.
NONSWAP  EQU   X'08'              CURRENTLY NON-SWAPPABLE.
TSU      EQU   X'04'              RUNNING IN TIME SHARING USER A.S.
BELOW    EQU   X'02'              GETMAINED STORAGE BELOW THE LINE.
*        EQU   X'01'              UNUSED.
SELFLAGS DS    X                  SELECTION FLAGS.
SELINIT  EQU   X'E4'              SELECTION FLAGS INITIAL PATTERN.
SELANY   EQU   X'E0'              ANY DATA TO BE SELECTED FLAG.
DSET     EQU   X'80'              COLLECT DATA SET EVENTS.
PERF     EQU   X'40'              COLLECT SYSTEM PERFORMANCE DATA.
PGMS     EQU   X'20'              COLLECT JOB STEP PROGRAM ACTIVITY.
TAPE     EQU   X'10'              COLLECT TAPE VOLUME USAGE DATA.
DASD     EQU   X'08'              COLLECT DASD SPACE USAGE DATA.
*        EQU   X'04'              UNUSED.
*        EQU   X'02'              UNUSED.
*        EQU   X'01'              UNUSED.
OSBITS   DS    X                  OS BITS FROM CVTDCB.
ENTRYTYP DS    X                  STORAGE ENTRY TYPE CODE.
HSMFNTYP DS    X                  HSM FUNCTION SMF RECORD TYPE.
         DS    0D                 END OF COMMON AREA.
         TITLE 'REGISTER EQUATES'
R0       EQU   0
R1       EQU   1
R2       EQU   2
R3       EQU   3
R4       EQU   4
R5       EQU   5
R6       EQU   6
R7       EQU   7
R8       EQU   8
R9       EQU   9
R10      EQU   10
R11      EQU   11
R12      EQU   12
R13      EQU   13
R14      EQU   14
R15      EQU   15
