*        COPYRIGHT (C) 1986  PRYCROFT SIX PTY LTD
LCMSG    DC    X'C1115DD81BF0502842F42841F2' "LOG CLOSED" MESSAGE.
         DC    CL26'          IMPLOG CLOSED  ('
LCMSGCLS DC    C'?',CL12')           '
         DC    X'1140402842001B404E2841F4130000'
LCMSGLEN EQU   *-LCMSG
NFMSG    DC    X'C5115DD81BF8502842F22841F2' "NO FILE" MESSAGE.
         DC    CL32'    IMPLOG NOT ALLOCATED  -  RC='
NFMSGRC  DC    CL2'00',CL5' '
         DC    X'1140402842001B404E2841F4130000'
NFMSGLEN EQU   *-NFMSG
NPMSG    DC    X'C5115DD81BF8502842F22841F2' "NO PRINT" MESSAGE.
         DC    CL39'    NOT SUPPORTED UNDER THIS OPTION    '
         DC    X'1140402842001B404E2841F4130000'
NPMSGLEN EQU   *-NPMSG
PRMSG    DC    X'C1115DD81BF0502842F42841F2' "PRINTED" MESSAGE.
         DC    CL33'   DETAIL SCREEN IMAGE PRINTED  ('
PRMSGCLS DC    C'?',CL5')    '
         DC    X'1140402842001B404E2841F4130000'
PRMSGLEN EQU   *-PRMSG
ED2PNT1  DC    X'4021204B20'
ED3      DC    X'40202120',C':00:'
ED5      DC    X'402020202120D2'
ED7      DC    X'4020202020202120'
ED3Z     DS    0CL4
ED5Z     DS    0CL6
ED7Z     DS    0CL8
ED9Z     DS    0CL10
ED11     DC    X'402020202020202020202120'
LOWX     DC    X'284100&LOW'
MEDX     DC    X'284100&MED'
HIGHX    DC    X'284100&HIGH'
BLNKREST DC    XL4'3C404040'
         COPY  JPRFXMSG
         AGO   .NOTJUSE
JPRFXMSG DC    X'C11140403C40400011C5C2&LOW'
         DC    C'ENTER JOB NAME PREFIX OR COMPLETE JOB NAME'
         DC    X'&MED',C'===>',X'1BC94E132841F4'
SELJOBNM DC    CL8' '
         DC    X'2841001BF8C2114BD2&LOW'
         DC    C'(USE',X'&HIGH',C'J/',X'&LOW',C'FROM DETAIL SCREEN '
         DC    C'TO CANCEL JOB NAME PREFIX SELECTION)'
         DC    X'11D1E3'
         DC    C'(USE',X'&HIGH',C'*',X'&LOW'
         DC    C'FOR NON-SPECIFIC PLACE-HOLDER CHARACTERS)'
JOBSELEN EQU   *-JPRFXMSG
.NOTJUSE ANOP
         SPACE
         LTORG
         DS    0D
TABLE    DC    X'40C1C2C3C4C5C6C7C8C94A4B4C4D4E4F'
         DC    X'50D1D2D3D4D5D6D7D8D95A5B5C5D5E5F'
         DC    X'6061E2E3E4E5E6E7E8E96A6B6C6D6E6F'
         DC    X'F0F1F2F3F4F5F6F7F8F97A7B7C7D7E7F'
         SPACE
XLATETBL DC    X'404B4B4B4B4B4B4B4B4B4B4B4B4B4B4B'  3278 PRINTABLE
         DC    X'4B4B4B6D4B4B4B4B4B4B4B4B1C4B1E4B'      CHARACTERS.
         DC    X'4B4B4B4B4B4B4B4B4B4B4B4B4B4B4B4B'
         DC    X'4B4B4B4B4B4B4B4B4B4B4B4B4B4B4B4B'
         DC    X'404142434445464748494A4B4C4D4E4F'
         DC    X'505152535455565758595A5B5C5D5E5F'
         DC    X'606162636465666768696A6B6C6D6E6F'
         DC    X'707172737475767778797A7B7C7D7E7F'
         DC    X'808182838485868788898A8B8C8D8E8F'
         DC    X'909192939495969798999A9B9C9D9E9F'
         DC    X'A0A1A2A3A4A5A6A7A8A9AAABACADAEAF'
         DC    X'B0B1B2B3B4B5B6B7B8B9BABBBCBDBEBF'
         DC    X'C0C1C2C3C4C5C6C7C8C9CACBCCCDCECF'
         DC    X'D0D1D2D3D4D5D6D7D8D9DADBDCDDDEDF'
         DC    X'E0E1E2E3E4E5E6E7E8E9EAEBECEDEEEF'
         DC    X'F0F1F2F3F4F5F6F7F8F9FAFBFCFDFE4B'
