//CICSRP03 JOB CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//APPLPROG EXEC DFHZITCL,PROGLIB=OPT.WORK.LOADLIB,OUTC=*
//COBOL.SYSIN  DD DSN=OPT.REPT.PDS(CICSRP03),DISP=SHR
/*
//LKED.SYSLIB DD DSN=CICSTS51.CICS.SDFHLOAD,DISP=SHR
//            DD DSN=OPT.WORK.LOADLIB,DISP=SHR
//            DD DSN=CEE.SCEELKED,DISP=SHR
//LKED.SYSIN DD *
   NAME CICSRP03(R)
/*
