         MACRO ,
         MYLVL ,
         GBLA  &MYLVL,&REL
         GBLB  &MFT,&MVT,&SVS,&MVS,&MVSSP,&MVSXA,&MVSESA,&OS390,&Z900
*   ASSIGN AN (ARBITRARY, BUT CONSISTENT VALUE TO THE GENERATING
*   SYSTEM:   1-MFT   2-MVT   3-SVS   4-MVT   5-SE    6-SP1   7-SP3
*             8-SP6   9-XA   10-ESA  11-S390 12-Z900
&MYLVL   SETA  12
         AIF   (&Z900).LVLSET
&MYLVL   SETA  11
         AIF   (&OS390).LVLSET
&MYLVL   SETA  10
         AIF   (&MVSESA).LVLSET
&MYLVL   SETA  9
         AIF   (&MVSXA).LVLSET
&MYLVL   SETA  8
         AIF   (&MVSSP AND &REL GE 106).LVLSET
&MYLVL   SETA  7
         AIF   (&MVSSP AND &REL GE 103).LVLSET
&MYLVL   SETA  6
         AIF   (&MVSSP).LVLSET
&MYLVL   SETA  5
         AIF   (&MVS AND &REL GT 41).LVLSET
&MYLVL   SETA  4
         AIF   (&MVS).LVLSET
&MYLVL   SETA  3
         AIF   (&SVS).LVLSET
&MYLVL   SETA  2
         AIF   (&MVT).LVLSET
&MYLVL   SETA  1
.LVLSET  MEND  ,
