PROC 0  DEBUG
/*-------------------------------------------------------------*/
/*      OPEN THE TOOL BOX                                      */
/*-------------------------------------------------------------*/
CONTROL NOLIST MSG PROMPT NOFLUSH
IF &DEBUG NE &STR() THEN +
             CONTROL LIST CONLIST SYMLIST
IF  &SYSUID EQ &STR(SPROG1) THEN GOTO TOOLBOX
IF  &SYSUID EQ &STR(SPROG2) THEN GOTO TOOLBOX
IF  &SYSUID EQ &STR(SPROG3) THEN GOTO TOOLBOX
IF  &SYSUID EQ &STR(SPROG4) THEN GOTO TOOLBOX
IF  &SYSUID EQ &STR(SPROG5) THEN GOTO TOOLBOX
ISPEXEC SELECT  PANEL(@PNL#PI)
EXIT
TOOLBOX: +
ISPEXEC SELECT  PANEL(@PNL#PS)
EXIT
