)ATTR
  +  TYPE(TEXT) INTENS(LOW) SKIP(ON)
  %  TYPE(TEXT) INTENS(HIGH) SKIP(ON)
  _  TYPE(INPUT) INTENS(HIGH)
)BODY
+
+        COMMAND%===>_ZCMD                                             +
+
+
+                          % V E R I F Y
+
+
+      YOU  HAVE  MADE  A  REQUEST  TO  DEFINE  AN  ALIAS  ENTRY
+
+
+      ALIAS  ENTRY ===>% &NEWID  +
+
+
+
+       IF  YOU  WISH  TO  CONTINUE  AND  DEFINE  THIS  ENTRY  FOR
+
+      %THIS+ SYSTEM,  PRESS  ENTER.
+
+
+       OTHERWISE  PRESS  PF3  OR  ENTER  END  TO  BYPASS.
+
+
)END
