//*--------------------------------------------------------------*
//*       INSTALLATION 'CVDISPF' COMMAND.
//*--------------------------------------------------------------*
//CVDISPF  EXEC ASMHCL,COND=(0,NE),
//         PARM.C='RENT,OBJECT,NODECK,ALIGN,NOLIST,TERM',
//         PARM.L='LIST,LET,MAP,XREF,RENT'
//SYSTERM  DD SYSOUT=*
//SYSIN    DD DISP=SHR,DSN=SHARE.SOURCE(CVDISPF)
//L.SYSLMOD DD DSN=SHARE.LOAD,DISP=SHR,UNIT=,SPACE=,DCB=
//L.SYSIN  DD *
 NAME CVDISPF(R)
/*
