PROC 0
CONTROL PROMPT NOFLUSH
)SEL  &CATOPT = &Z   &&   &INDEX = &Z
      LISTCAT
)ENDSEL
)SEL  &CATOPT ¬= &Z   &&   &INDEX = &Z
      LISTCAT  &CATOPT
)ENDSEL
)SEL  &CATOPT ¬= &Z   &&   &INDEX ¬= &Z
      LISTCAT  LEVEL(&INDEX)  &CATOPT
)ENDSEL
)SEL  &CATOPT = &Z   &&   &INDEX ¬= &Z
      LISTCAT  LEVEL(&INDEX)
)ENDSEL
