//PL360CG  PROC
//PL360    EXEC  PGM=PL360
//SYSGO    DD  DSN=&&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,
//             SPACE=(3120,(40,10),RLSE),
//             DCB=(BLKSIZE=3120,LRECL=80,RECFM=FB)
//SYSPRINT DD  SYSOUT=A
//SYSPUNCH DD  SYSOUT=B
//GO       EXEC  PGM=LOADER,PARM='MAP',COND=(0,NE,PL360)
//SYSLIB   DD  DSN=SYS1.PL360LIB,DISP=SHR
//SYSLIN   DD  DSN=*.PL360.SYSGO,DISP=(OLD,PASS)
//SYSLOUT  DD  SYSOUT=A
//SYSPRINT DD  SYSOUT=A
//SYSPUNCH DD  SYSOUT=B
//SYSUDUMP DD  SYSOUT=A
