//IBMUSERD JOB (ACCT#),DFDSS4,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//*   DFDSS Restore from the Backup
//*
//DFDSS EXEC PGM=ADRDSSU,REGION=4M PARM='TYPRUN=NORUN'
//SYSPRINT DD SYSOUT=*
//DASD  DD UNIT=SYSALLDA,VOL=SER=vvvvvv,DISP=SHR
//TAPE  DD  DISP=SHR,DSN=IBMUSER.vvvvvv.VOLUME.BACKUP
//SYSIN DD *
 RESTORE                  -
             INDDNAME(TAPE)   OUTDDNAM(DASD)
/*
//
