//TSDAMFCI JOB 01992,FCB.IDR.LIST,NOTIFY=TSDAM,MSGCLASS=H
//S1  EXEC  PGM=FCBIDR
//SYSLIB   DD DSN=SYS1.IMAGELIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
 C SYSLIB
 S FCB2....
