//IEAVMXIT JOB (XSYZ,MSTITT),'MATTHEW STITT',MSGCLASS=X,NOTIFY=MSTITT
//C       EXEC PGM=ASMA90,
//             PARM='OBJECT,NODECK,NOXREF'
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.MODGEN,DISP=SHR
//         DD  DSN=SYS1.AMODGEN,DISP=SHR
//SYSPUNCH DD  DUMMY,DCB=BLKSIZE=80
//SYSLIN   DD  DSN=&OBJ,SPACE=(3040,(40,40),,,ROUND),UNIT=3390,
//             DISP=(MOD,PASS),
//             DCB=(BLKSIZE=3040,LRECL=80,RECFM=FBS,BUFNO=1)
//SYSUT1   DD  DSN=&SYSUT1,SPACE=(1024,(120,120),,,ROUND),
//             DCB=BUFNO=1
//SYSIN    DD  *
***********************************************************************
*                                                                     *
* MODULE NAME         =  IEAVMXIT                                     *
*                                                                     *
* DESCRIPTIVE NAME    =  SAMPLE COMMUNICATIONS TASK USER EXIT FOR     *
*                        MSGS IFB010D, ILR022A, $HASP426, ERB306D     *
*                                                                     *
* FUNCTIONS           =  ROUTES MESSAGES VIA ROUTING CODE 11,         *
*                        SUPPRESSES AND REPLIES TO MESSAGES           *
*                                                                     *
*                        ISSUES $S AFTER JES2 INITIALIZATION          *
*                        ISSUES S TSO AFTER VTAM INITIALIATION        *
*                                                                     *
* OPERATION           =  DETERMINES WHICH MESSAGE IS PROCESSED.       *
*                        REQUESTS TO CHANGE THE ROUTING CODES TO      *
*                        ROUTING CODE 11 ONLY.                        *
*                                                                     *
*                        THIS EXIT ROUTINE                            *
*                        REQUESTS TO SUPPRESS THE WTOR AND THEN       *
*                        REPLIES TO IT VIA THE MSGR MACRO.            *
*                                                                     *
* ENTRY POINT         =  IEAVMXIT                                     *
*                                                                     *
*   LINKAGE           =  BASR                                         *
*                                                                     *
*   INPUT DATA        =  REG 1 POINTS TO THE ADDRESS OF THE CTXT      *
*                        REG 13 ADDRESS OF STANDARD SAVE AREA         *
*                        REG 15 ENTRY POINT                           *
*                                                                     *
*   REGISTERS SAVED   =  REG0 - REG15                                 *
*                                                                     *
*   REGISTER USAGE    =  REG5  - POINTER TO THE ADDRESS OF CTXT       *
*                        REG11 - MODULE DATA REGISTER                 *
*                        REG12 - MODULE BASE REGISTER                 *
*                        REG13 - POINTER TO A STANDARD SAVE AREA      *
*                        REG14 - RETURN POINT                         *
*                                                                     *
*   REGISTERS RESTORED = REG0 - REG15                                 *
*                                                                     *
*   CONTROL BLOCKS    =                                               *
*     NAME     MAPPING MACRO   REASON USED                      USAGE *
*     ----     -------------   -----------                     -------*
*     CTXT      IEZVX100        USER EXIT PARAMETER LIST         R,W  *
*     MGCR      IEZMGCR         SVC 34 PARAMETER LIST            C,D  *
*                                                                     *
*   KEY = R-READ, W-WRITE, C-CREATE, D-DELETE                         *
*                                                                     *
*   TABLES            =  NONE                                         *
*                                                                     *
*   MACROS            =  GETMAIN, FREEMAIN, MGCR, WTO                 *
*                                                                     *
***********************************************************************
         EJECT
IEAVMXIT CSECT
IEAVMXIT AMODE 31                      31-BIT ADDRESSING MODE
IEAVMXIT RMODE ANY                     31-BIT RESIDENCE
         SPACE 1
***********************************************************************
*                                                                     *
*        REGISTER ASSIGNMENTS                                         *
*                                                                     *
***********************************************************************
REG0     EQU   0
REG1     EQU   1
REG2     EQU   2
REG3     EQU   3
REG4     EQU   4
REG5     EQU   5
REG6     EQU   6
REG7     EQU   7
CTXTPTR  EQU   8
REG11    EQU   11
REG12    EQU   12
REG13    EQU   13
REG14    EQU   14
REG15    EQU   15
SPINPRVT EQU   230
         EJECT
***********************************************************************
*                                                                     *
*        STANDARD ENTRY LINKAGE                                       *
*                                                                     *
***********************************************************************
         STM   REG14,REG12,12(REG13)   SAVE CALLER'S REGISTERS
         BASR  REG12,REG0              ESTABLISH MODULE BASE
         USING *,REG12                 REGISTER
         L     CTXTPTR,0(REG1)         ESTABLISH ADDRESSABILITY
         USING CTXT,CTXTPTR            TO THE CXTX
***********************************************************************
*                                                                     *
*        DYNAMIC STORAGE FOR THIS MODULE IS BEING OBTAINED BELOW      *
*        16-MEG LINE BECAUSE SVC 34 REQUIRES THE MQCR PARAMETER       *
*        LIST TO BE IN 24-BIT ADDRESSABLE STORAGE.                    *
*                                                                     *
***********************************************************************
         GETMAIN RU,LV=DATAEND,SP=SPINPRVT,LOC=BELOW
         LR    REG11,REG1              ADDRESS RETURNED IN REG1
         USING DATAAREA,REG11          ADDRESSABILITY TO DYNAMIC
         ST    REG13,SAVEAREA+4        SET BACKWARD PTR
         LA    REG15,SAVEAREA          GET ADDRESS OF SAVE AREA
         ST    REG15,8(REG13)          SET FORWARD PTR
         LR    REG13,REG15             SET REG13 TO POINT TO
*                                      STANDARD SAVE AREA
         EJECT
***********************************************************************
*                                                                     *
*        DETERMINE WHICH MESSAGE IS TO BE PROCESSED.                  *
*                                                                     *
***********************************************************************
         SPACE 1
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO THE MSG ATTRIBUTES
         LA    REG7,CTXTTMSG           ADDRESS OF TEXT AREA
         USING MSGTEXT,REG7            BASE TEXT MAPPING
*        CLC   MSGID,IKT005I           MESSAGE IKT005I?
*        BE    MIKT005I
         CLC   MSGID,IFB010D           MESSAGE IFB010D?
         BE    MIFB010D
         CLC   MSGID,ILR022A           MESSAGE ILR022A?
         BE    MILR022A
         CLC   MSGID,ARC0366           MESSAGE ARC0366A?
         BE    MARC0366
         CLC   MSGID,ARC0310           MESSAGE ARC0310A?
         BE    MARC0310
         CLC   MSGID,ARC0314           MESSAGE ARC0314A?
         BE    MARC0314
         CLC   MSGID,ARC0381           MESSAGE ARC0381A?
         BE    MARC0381
         CLC   MSGID,$HASP426          MESSAGE $HASP426?
         BE    MHASP426
         CLC   MSGID,ERB306D           MESSAGE ERB306D?
         BE    MERB306D
         CLC   MSGID,$HASP400          MESSAGE $HASP400?
         BE    MHASP400
         CLC   MSGID,IST020I           MESSAGE IST020I?
         BE    MIST020I
         CLC   MSGID,IEF238D           MESSAGE IEF238D?
         BE    MIEF238D
         CLC   MSGID,IEF433D           MESSAGE IEF433D?
         BE    MIEF433D
         CLC   MSGID,CAT9013           MESSAGE CAT9013?
         BE    MCAT9013
         CLC   MSGID,EZB6473I          MESSAGE EZB6473I?
         BE    MEZB6473
         CLC   MSGID,ERB100I           MESSAGE ERB100I?
         BE    MERB100I
*        CLC   MSGID,IEE362A           MESSAGE IEE362A?
*        BE    MIEE362A
*        L     REG6,CTXTRCP            ADDRESS OF ROUTING CODES
*        USING CTXTROUT,REG6           BASE ROUTING MAPPING
*        TM    CTXTR002,CTXTR14        ROUTE CODE 14?
*        BO    NOHRDCPY
         B     FINISHED
*********************************************************************
*                                                                     *
*        ISSUE THE CONSOLE MESSAGE                                    *
*                                                                     *
***********************************************************************
ISSMSG   EQU   *
         WTO   MF=(E,USERAUTO)         ISSUE THE MESSAGE
*        BR    REG14                   RETURN TO CALLER
*        B     FINISHED
*********************************************************************
*                                                                     *
*        STANDARD EXIT LINKAGE                                        *
*                                                                     *
***********************************************************************
FINISHED EQU   *
         L     REG13,4(REG13)          RESTORE REG 13
         FREEMAIN RU,LV=DATAEND,A=(REG11),SP=SPINPRVT FREE STORAGE
         LM    REG14,REG12,12(REG13)   RESTORE CALLER'S REGISTERS
         BR    REG14
         EJECT
***********************************************************************
*                                                                     *
*        REPLYING GO TO A MESSAGE                                     *
*                                                                     *
***********************************************************************
MERB306D EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSUGO            REPLY 'R XX,GO'
ISSUGO   EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVC   MGCRTEXT(L'TXTINGO),TXTINGO MOVE IN THE REPLY BUFFER
         MVC   REPLY,CTXTRPID          INSERT THE REPLY ID
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTINGO   GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO THE CALLER
*        BAS   REG14,ISSUWGO           ISSUE THE MESSAGE
ISSUWGO  EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USERGO         MOVE WTO LIST FORM FROM
*                                      STATIC TO SYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      THE MESSAGE ATTRIBUTES
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        REPLYING U TO A MESSAGE                                      *
*                                                                     *
***********************************************************************
MIFB010D EQU   *
MILR022A EQU   *
MCAT9013 EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSUU             REPLY 'R XX,U'
ISSUU    EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVC   MGCRTEXT(L'TXTINU),TXTINU   MOVE IN THE REPLY BUFFER
         MVC   REPLY,CTXTRPID          INSERT THE REPLY ID
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTINU   GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO THE CALLER
*        BAS   REG14,ISSUWU            ISSUE THE MESSAGE
ISSUWU   EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USERU          MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      THE MESSAGE ATTRIBUTES
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        REPLYING NOREQ FOR ENTER REQUEST ($HASP426)                  *
*                                                                     *
***********************************************************************
MHASP426 EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSU426           REPLY 'R XX,NOREQ'
ISSU426  EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVC   MGCRTEXT(L'TXTI426),TXTI426 MOVE IN THE REPLY BUFFER
         MVC   REPLY,CTXTRPID          INSERT THE REPLY ID
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI426   GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO THE CALLER
*        BAS   REG14,ISSUW426          ISSUE THE MESSAGE
ISSUW426 EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USER426        MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      THE MESSAGE ATTRIBUTES
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        REPLYING $S FOR ENTER REQUEST ($HASP400)                     *
*                                                                     *
***********************************************************************
MHASP400 EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSU400           REPLY '$ S'
ISSU400  EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTIN400),TXTIN400 MOVE IN THE REPLY BUF.
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTIN400  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSUW400          ISSUE THE MESSAGE
ISSUW400 EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USER400        MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      STATIC TO DYNAMIC
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        REPLYING S TSO AFTER VTAM INIT (IST020I)                     *
*                                                                     *
***********************************************************************
MIST020I EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSU020A          REPLY 'S TSO'
ISSU020A EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTI020A),TXTI020A MOVE IN THE REPLY BUF.
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI020A  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
*        MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSU020B          REPLY '$S LOGON1'
ISSU020B EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTI020B),TXTI020B MOVE IN THE REPLY BUF.
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI020B  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSUW020          ISSUE THE MESSAGE
ISSU020C EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTI020C),TXTI020C MOVE IN THE REPLY BUF.
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI020C  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSUW020          ISSUE THE MESSAGE
ISSU020D EQU   *
         CLC   CTXTSYSN,PRDCTN         IS THIS PRODUCTION?
         BNE   ISSUW020                NO, DO NOT BRING THESE UP
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTI020D),TXTI020D MOVE IN THE REPLY BUF.
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI020D  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSUW020          ISSUE THE MESSAGE
ISSU020E EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTI020E),TXTI020E MOVE IN THE REPLY BUF.
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI020E  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSUW020          ISSUE THE MESSAGE
ISSUW020 EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USER020        MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      STATIC TO DYNAMIC
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        REPLYING S NET NETSPOOL AFTER TCPIP INIT (EZB6473I)          *
*                                                                     *
***********************************************************************
MEZB6473 EQU   *
         CLC   CTXTSYSN,PRDCTN         IS THIS PRODUCTION?
         BNE   FINISHED                NO, DO NOT BRING THESE UP
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSU647A          REPLY 'S NETSPOOL'
ISSU647A EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTI647A),TXTI647A MOVE IN THE REPLY BUF.
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI647A  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSU647B          REPLY '$S LOGON1'
ISSU647B EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTI647B),TXTI647B MOVE IN THE REPLY BUF.
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI647B  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSU647C          REPLY '$S LOGON1'
ISSUW647 EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USER647        MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      STATIC TO DYNAMIC
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        REPLYING F RMF,S III AFTER RMF INIT (ERB100I)                *
*                                                                     *
***********************************************************************
MERB100I EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSU100I          REPLY 'S NETSPOOL'
ISSU1OOI EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTI100I),TXTI100I MOVE IN THE REPLY BUF.
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI100I  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSU100B          REPLY '$S LOGON1'
ISSUW100 EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USER100        MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      STATIC TO DYNAMIC
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        REPLYING S LMF AFTER TSO INIT (IKT005I)                      *
*                                                                     *
***********************************************************************
MIKT005I EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSU005           REPLY 'S LMF'
ISSU005  EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTI005),TXTI005 MOVE IN THE REPLY BUF.
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI005  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSUW005          ISSUE THE MESSAGE
ISSUW005 EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USER005        MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      STATIC TO DYNAMIC
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        REPLYING WAIT TO IEF238D                                     *
*                                                                     *
***********************************************************************
MIEF238D EQU   *
MARC0381 EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSUWT            REPLY 'R XX,WAIT'
ISSUWT   EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         LA    REG3,CTXTTMSG           FIND START OF MESSAGE
         LA    REG4,1
         LA    REG5,CTXTTMSG+L'CTXTTMSG-6 FIND END OF MESSAGE
WAITCK   EQU   *
         CLC   0(6,REG3),=C'''WAIT'''    DID WE FIND WAIT?
         BE    WAITOK
         CLC   0(6,REG3),=C' WAIT '      DID WE FIND WAIT?
         BE    WAITOK
         CLC   0(7,REG3),=C' WAIT, '     DID WE FIND WAIT?
         BE    WAITOK
         CLC   0(4,REG3),=C'WAIT'        DID WE FIND WAIT?
         BE    WAITOK
         CLC   0(8,REG3),=C'''CANCEL'''    DID WE FIND CANCEL?
         BE    CANCOK
         CLC   0(8,REG3),=C' CANCEL '      DID WE FIND CANCEL?
         BE    CANCOK
         CLC   0(9,REG3),=C' CANCEL, '     DID WE FIND CANCEL?
         BE    CANCOK
         CLC   0(6,REG3),=C'CANCEL'        DID WE FIND CANCEL?
         BE    CANCOK
CONTCK   BXLE  REG3,REG4,WAITCK        KEEP SCANNING
         B     FINISHED                NOT CORRECT MESSAGE FORMAT
WAITOK   EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVC   MGCRTEXT(L'TXTINWT),TXTINWT MOVE IN THE REPLY BUFFER
         MVC   REPLY,CTXTRPID          INSERT THE REPLY ID
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTINWT   GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO THE CALLER
*        BAS   REG14,ISSUWWT           ISSUE THE MESSAGE
ISSUWWT  EQU   *
         MVC   USERAUTO,USERWT         MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         B     ISSMSG                  ISSUE THE MESSAGE
CANCOK   EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVC   MGCRTEXT(L'TXTINCN),TXTINCN MOVE IN THE REPLY BUFFER
         MVC   REPLY,CTXTRPID          INSERT THE REPLY ID
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTINCN   GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO THE CALLER
*        BAS   REG14,ISSUWCN           ISSUE THE MESSAGE
ISSUWCN  EQU   *
         MVC   USERAUTO,USERCN         MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      THE MESSAGE ATTRIBUTES
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        REPLYING NOHOLD TO IEF433D                                   *
*                                                                     *
***********************************************************************
MIEF433D EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSUWT            REPLY 'R XX,WAIT'
ISSUNH   EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVC   MGCRTEXT(L'TXTINNH),TXTINNH MOVE IN THE REPLY BUFFER
         MVC   REPLY,CTXTRPID          INSERT THE REPLY ID
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTINNH   GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO THE CALLER
*        BAS   REG14,ISSUWNH           ISSUE THE MESSAGE
ISSUWNH  EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USERNH         MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      THE MESSAGE ATTRIBUTES
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        REPLYING Y TO A MESSAGE                                      *
*                                                                     *
***********************************************************************
MARC0366 EQU   *
MARC0314 EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSUY             REPLY 'R XX,Y'
ISSUY    EQU   *
*        CLC   MSGID+10(4),=C'CONT'
*        BNE   FINISHED
MARC0310 EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVC   MGCRTEXT(L'TXTINY),TXTINY   MOVE IN THE REPLY BUFFER
         MVC   REPLY,CTXTRPID          INSERT THE REPLY ID
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTINY   GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO THE CALLER
*        BAS   REG14,ISSUWY            ISSUE THE MESSAGE
ISSUWY   EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USERY          MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      THE MESSAGE ATTRIBUTES
         B     ISSMSG                  ISSUE THE MESSAGE
***********************************************************************
*                                                                     *
*        SUBMIT SMF DATASET DUMP JOB   (IEE362A)                      *
*                                                                     *
***********************************************************************
MIEE362A EQU   *
*        OI    CTXTRFB2,CTXTRHCO       SUPPRESS THE MESSAGE
*        BAS   REG14,ISSU362           REPLY WITH SUBMIT
ISSU362  EQU   *
         XC    MGCRPL(MGCRLTH),MGCRPL  CLEAR THE PARAMETER LIST
         MVI   MGCRFLG1,X'80'          SET FLAG
         MVC   MGCRTEXT(L'TXTI362),TXTI362 MOVE IN THE REPLY BUF.
         CLI   MSGID+35,C'1'            SMF DATASET 1?
         BE    M362A1
         CLI   MSGID+35,C'2'            SMF DATASET 2?
         BE    M362A2
         MVI   MGCRTEXT+16,C'2'         THIRD JOB
         B     M362ACN
M362A1   EQU   *
         MVI   MGCRTEXT+16,C'0'         FIRST JOB
         B     M362ACN
M362A2   EQU   *
         MVI   MGCRTEXT+16,C'1'         SECOND JOB
M362ACN  EQU   *
         LA    REG1,(MGCRTEXT-MGCRPL)+L'TXTI362  GET MGCRPL LENGTH
         STC   REG1,MGCRLGTH           SAVE LENGTH IN THE MGCRPL
         SR    REG0,REG0               CLEAR REGISTER ZERO
         MGCR  MGCRPL                  ISSUE THE COMMAND
*        BR    REG14                   RETURN TO CALLER
*        BAS   REG14,ISSUW362          ISSUE THE MESSAGE
ISSUW362 EQU   *
         L     REG2,CTXTTXPJ           ESTABLISH ADDRESSABILITY
         USING CTXTATTR,REG2           TO MESSAGE ATTRIBUTES
         MVC   USERAUTO,USER362        MOVE WTO LIST FORM FROM
*                                      STATIC TO DYNAMIC
         DROP  REG2                    DROP ADDRESSABILITY TO
*                                      STATIC TO DYNAMIC
         B     ISSMSG                  ISSUE THE MESSAGE
         LTORG
***********************************************************************
*                                                                     *
*        SUPPRESS MESSAGE FROM GOING TO HARDCOPY (ROUTE CODE 14)      *
*                                                                     *
***********************************************************************
NOHRDCPY EQU   *
         OI    CTXTRFB2,CTXTRDTM       FORCE NO HARDCOPY (WAS CTXTRNHC)
         B     FINISHED
***********************************************************************
*                                                                     *
*        PROCEDURE - ISSUMGCR                                         *
*        FUNCTION  - REPLIES TO MESSAGES                              *
*        INPUT     - NONE                                             *
*        OUTPUT    - A REPLY COMMAND IS ISSUED VIA SVC 34             *
*        NOTES     - THE MGCR MACRO MAY BE USED TO ISSUE THE REPLY    *
*                                                                     *
***********************************************************************
***********************************************************************
*                                                                     *
* PROCEDURE - ISSUWTO, FUNCTION - ISSUES A MESSAGE, INPUT - NONE      *
*                                                                     *
***********************************************************************
***********************************************************************
*                                                                     *
*        CHARACTER CONSTANTS                                          *
*                                                                     *
***********************************************************************
$HASP426 DC    CL8'$HASP426'           MESSAGE $HASP426
$HASP400 DC    CL8'$HASP400'           MESSAGE $HASP400
$HASP091 DC    CL8'$HASP091'           MESSAGE $HASP091
IEE362A  DC    CL8'IEE362A '           MESSAGE IEE362A
IKT005I  DC    CL8'IKT005I '           MESSAGE IKT005I
IST020I  DC    CL8'IST020I '           MESSAGE IST020I
IEF238D  DC    CL8'IEF238D '           MESSAGE IEF238D
IEF433D  DC    CL8'IEF433D '           MESSAGE IEF433D
ERB306D  DC    CL8'ERB306D '           MESSAGE ERB306D
IFB010D  DC    CL8'IFB010D '           MESSAGE IFB010D
CAT9013  DC    CL8'CAT9013P'           MESSAGE CAT9013
ILR022A  DC    CL8'ILR022A '           MESSAGE ILR022A
ARC0366  DC    CL8'ARC0366A'           MESSAGE ARC0366
ARC0310  DC    CL8'ARC0310A'           MESSAGE ARC0310
ARC0314  DC    CL8'ARC0314A'           MESSAGE ARC0314
ARC0381  DC    CL8'ARC0381A'           MESSAGE ARC0381
ERB100I  DC    CL8'ERB100I '           MESSAGE ERB100I
EZB6473I DC    CL8'EZB6473I'           MESSAGE EZB6473I
TXTINGO  DC    CL11'REPLY XX,GO'       REPLY GO
TXTINWT  DC    CL13'REPLY XX,WAIT'     REPLY WAIT
TXTINCN  DC    CL15'REPLY XX,CANCEL'   REPLY CANCEL
TXTINNH  DC    CL15'REPLY XX,NOHOLD'   REPLY NOHOLD
TXTINU   DC    CL10'REPLY XX,U'        REPLY U
TXTINY   DC    CL10'REPLY XX,Y'        REPLY Y
TXTIN400 DC    CL02'$S'                REPLY $S
TXTI426  DC    CL14'REPLY XX,NOREQ'    REPLY NOREQ
TXTI362  DC    CL21'S INTERN,JOB=D010PUAN' REPLY TO SUBMIT JOB
TXTI020A DC    CL09'$S LOGON1'         REPLY $S LOGON1
TXTI020B DC    CL05'S TSO'             REPLY S TSO
TXTI020C DC    CL09'S TCPIP'           REPLY S TCPIP
TXTI020D DC    CL09'S MOBIUSP'         REPLY S MOBIUSP
TXTI020E DC    CL09'S EDIMAIL'         REPLY S EDIMAIL
TXTI647A DC    CL10'S OSASFSRV'        REPLY S OSASFSRV
TXTI647B DC    CL10'S NETSPOOL'        REPLY S NETSPOOL
TXTI100I DC    CL11'F RMF,S III'       REPLY F RMF,S III
TXTI091  DC    CL09'S JES328X'         REPLY S JES328X
TXTI005  DC    CL05'S LMF'             REPLY S LMF
PRDCTN   DC    CL08'OSPROD  '          PRODUCTION SYSNAME
         SPACE 1
***********************************************************************
*                                                                     *
*        LIST FORM OF WTO MACRO (STATIC)                              *
*        NOTE: ALL LIST FORMS MUST HAVE THE SAME LENGTH !!!           *
*                                                                     *
***********************************************************************
USERWT   WTO   'HHS001I ANSWERED WITH WAIT                       ',    X
               ROUTCDE=(02),DESC=(4),MF=L
LWTOLIST EQU   *-USERWT
USERNH   WTO   'HHS002I ANSWERED WITH NOHOLD                     ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USERU    WTO   'HHS003I ANSWERED WITH U                          ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USER020  WTO   'HHS004I ANSWERED WITH S TSO                      ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USERCN   WTO   'HHS005I ANSWERED WITH CANCEL                     ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USERHD   WTO   'HHS006I ANSWERED WITH HIGHDATE                   ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USER426  WTO   'HHS007I ANSWERED WITH NOREQ                      ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USER005  WTO   'HHS008I ANSWERED WITH S LMF                      ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USERY    WTO   'HHS009I ANSWERED WITH Y                          ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USER362  WTO   'HHS010I ANSWERED WITH JOB SUBMIT                 ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USERGO   WTO   'HHS011I ANSWERED WITH GO                         ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USER400  WTO   'HHS012I ANSWERED WITH $ S                        ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USERSJ   WTO   'HHS013I ANSWERED WITH S JES328X                  ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USER647  WTO   'HHS015I ANSWERED WITH S OSASFSRV                 ',    X
               ROUTCDE=(02),DESC=(4),MF=L
USER100  WTO   'HHS016I ANSWERED WITH F RMF,S III                ',    X
               ROUTCDE=(02),DESC=(4),MF=L
         EJECT
***********************************************************************
*                                                                     *
*        STORAGE DEFINITIONS                                          *
*                                                                     *
***********************************************************************
DATAAREA DSECT
         DS    0F
SAVEAREA DS    18F                     STANDARD SAVE AREA
         DS    0F
USERAUTO DS    CL(LWTOLIST)            DYNAMIC SAVE AREA
         EJECT
MGCR     IEZMGCR DSECT=NO
         ORG   MGCRTEXT
COMMAND  DS    CL6                     THE REPLY COMMAND
REPLY    DS    CL2                     REPLY ID
REPLYMSG DS    CL15                    WTOR RESPONSE
         ORG
DATAEND  EQU   *-DATAAREA
         SPACE 2
***********************************************************************
*                                                                     *
*        MAPPING OF THE MESSAGE TEXT                                  *
*                                                                     *
***********************************************************************
MSGTEXT  DSECT
MSGID    DS    CL8                     MESSAGE ID
JOBDATA  DS    CL8                     JOB DATA (ID AND NAME)
         DS    CL80
         ORG   MSGTEXT
         DS    CL4
WTORID   DS    CL8
         EJECT
         IEZVX100
         EJECT
         END   IEAVMXIT
//LKED     EXEC PGM=HEWL,PARM=(XREF,LET,LIST,NCAL,RENT,REUS),
//             REGION=512K,COND=(7,LT,C)
//SYSLIN   DD  DSN=&&OBJ,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSN=SYS1.LINKLIB,DISP=SHR
//SYSUT1   DD  SPACE=(1024,(50,20))
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  NAME IEAVMXIT(R)
/*
