//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(ALLDSNS)                        *
//*                                                                 *
//*******************************************************************
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.DEL.ALLDSNS.SYSOUT
 DELETE BC0THOR.DEL.ALLDSNS.SYSPRINT
//*
//ALLDSNS  EXEC  PGM=ALLDSNS
//*TEPLIB  DD    DSN=SYS1.TECHLOAD,DISP=SHR
//STEPLIB  DD    DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD    SYSOUT=*
//*YSPRINT DD    SYSOUT=*
//*YSOUT   DD    SYSOUT=*
//SYSPRINT DD    DSN=BC0THOR.DEL.ALLDSNS.SYSPRINT,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(15,5),RLSE),
//         RECFM=FB,LRECL=80
//SYSOUT   DD    DSN=BC0THOR.DEL.ALLDSNS.SYSOUT,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(15,5),RLSE),
//         RECFM=FB,LRECL=80
//SYSIN    DD    DSN=BC0THOR.PDS.DATA(ALLDSNS),DISP=SHR
