//BC0THORE JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(AMBLIST)                        *
//*                                                                 *
//*******************************************************************
//AMBLIST  EXEC  PGM=AMBLIST
//SYSPRINT DD    SYSOUT=*
//SYSLIB   DD    DSN=BC0THOR.PDSE.LOAD,DISP=SHR
//SYSIN    DD    *
 LISTLOAD OUTPUT=BOTH,MEMBER=CBRAKETS
//SAMPLES  DD    *
 LISTLOAD OUTPUT=XREF,MEMBER=GETDSA,TITLE='***** GETDSA *****'
 LISTLOAD OUTPUT=XREF,MEMBER=CBC3GRE4,TITLE='*****CBC3GRE4 *****'
 LISTLOAD OUTPUT=XREF,MEMBER=CBC3GREX,TITLE='*****CBC3GREX *****'
 LISTLPA
 LISTLOAD OUTPUT=MODLIST,MEMBER=IEFBR14
 LISTLOAD OUTPUT=XREF,MEMBER=IEFBR14
 LISTLOAD OUTPUT=BOTH,MEMBER=IEFBR14
