//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=104M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(ASMDASM)                        *
//* IBM'S DISASSEMBLER                                              *
//*******************************************************************
//SCRATCH  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.DEL.________.ASM
/*
//*
//ASMDASM  EXEC PGM=ASMDASM,PARM='COPYRIGHTOK'
//STEPLIB  DD   DSN=ASM.SASMMOD1,DISP=SHR
//         DD   DSN=ASM.SASMMOD2,DISP=SHR
//SYSLIB   DD   DSN=BC0THOR.PDSE.LOAD,DISP=SHR
//SYSPUNCH DD   DSN=BC0THOR.DEL.________.ASM,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(10,5),RLSE),
//         DSORG=PS,RECFM=FB,LRECL=80
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
________ ________
