//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(BACKEDIT)                       *
//*                                                                 *
//* EDITS A FILE FROM A BATCH JOB: STARTS AN ISPF EDIT SESSION AND  *
//* MAKES THE EDIT CHANGES SPECIFIED IN SYSUT1 FILE FOR STEP1 BELOW.*
//*  JIM LITTLE 8/6/99                                              *
//*******************************************************************
//*
//CREATE   EXEC PGM=IEFBR14
//SYSUT2   DD DSN=TEST.DEL.PDS,DISP=(MOD,CATLG),
//         LRECL=80,BLKSIZE=6160,RECFM=FB,DSORG=PO,
//         UNIT=DISK,SPACE=(TRK,(15,5,5))
//*******************************************************************
//* STEP1 CREATES A TEMPORARY PDS AND BUILDS THE CHGFILE CLIST IN IT*
//* IT. MAKE YOUR EDIT SCRIPT IN THE SYSUT1 FILE HERE.              *
//*******************************************************************
//MAKCLIST EXEC PGM=IEBGENER
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSUT2   DD DSN=TEST.DEL.PDS(MYCHANGE),DISP=SHR
//SYSUT1   DD *
PROC 0
CONTROL NOFLUSH   MSG CONLIST SYMLIST
EDIT 'BCOTHOR.TEST.DATA' DATA
CHANGE '*' '$' ALL
SAVE
END
//*
//STEP2    EXEC PGM=IKJEFT01,DYNAMNBR=50,REGION=4096K
//ISPTLIB  DD DSN=TEST.DEL.PDS,DISP=SHR
//         DD DSN=SYS1.ISRTLIB,DISP=SHR
//         DD DSN=SYS1.ISPTLIB,DISP=SHR
//ISPTABL  DD DSN=TEST.DEL.PDS,DISP=SHR
//ISPMLIB  DD DSN=SYS1.ISRMLIB,DISP=SHR
//         DD DSN=SYS1.ISPMLIB,DISP=SHR
//ISPPLIB  DD DSN=SYS1.ISRPLIB,DISP=SHR
//         DD DSN=SYS1.ISPPLIB,DISP=SHR
//ISPSLIB  DD DSN=SYS1.ISRSLIB,DISP=SHR
//         DD DSN=SYS1.ISPSLIB,DISP=SHR
//ISPPROF  DD DSN=TEST.DEL.PDS,DISP=SHR
//SYSPROC  DD DSN=TEST.DEL.PDS,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
  ISPSTART CMD(%MYCHANGE)
