//BC0THORX JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=0M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(BAGETE)                         *
//* EXECUTE THE SAMPLE PROGRAM FOR THE PROGRAM MANAGEMENT API       *
//*******************************************************************
//SCRATCH  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.DEL.BAGETE
/*
//BAGETE   EXEC  PGM=BAGETE
//STEPLIB  DD    DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD    SYSOUT=*
//SYSPRINT DD    SYSOUT=*
//LPALIB   DD    DSN=EMVSP.IMSVS.PGMLIB,DISP=SHR
//MYDDN    DD    DSN=BC0THOR.DEL.BAGETE,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(10,5),RLSE),
//         DSORG=PS,RECFM=F,LRECL=80,BLKSIZE=80
