//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(BATCHEDT)                       *
//* RUN ISPF EDIT IN A BATCH JOB.                                   *
//* BEFORE RUNNING THIS JOB, EDIT PDS.CLIST(BATCHED1): SET FILE NAME*
//* AND PUT THE DESIRED EDIT STATEMENTS IN PDS.CLIST(BATCHEDT)      *
//*******************************************************************
//*
//ISPF     EXEC PGM=IKJEFT01,DYNAMNBR=50,REGION=4096K
//ISPTLIB  DD DSN=SYS1.ISRTLIB,DISP=SHR
//         DD DSN=SYS1.ISPTLIB,DISP=SHR
//ISPMLIB  DD DSN=SYS1.ISRMLIB,DISP=SHR
//         DD DSN=SYS1.ISPMLIB,DISP=SHR
//ISPPLIB  DD DSN=SYS1.ISRPLIB,DISP=SHR
//         DD DSN=SYS1.ISPPLIB,DISP=SHR
//ISPSLIB  DD DSN=SYS1.ISRSLIB,DISP=SHR
//         DD DSN=SYS1.ISPSLIB,DISP=SHR
//ISPPROF  DD DSN=&&ISPPROF,DISP=(,DELETE),
//            DCB=(LRECL=80,BLKSIZE=6160,RECFM=FB,DSORG=PO),
//            UNIT=DISK,SPACE=(TRK,(15,5,5))
//SYSPROC  DD DSN=BC0THOR.PDS.CLIST,DISP=SHR
//         DD DSN=SYS1.ISRCLIB,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
  ISPSTART CMD(%BATCHED1)
