//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=104M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(CICSRGNS)                       *
//*******************************************************************
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.DEL.ALLSORT
 DELETE BC0THOR.DEL.CICSRGNS
//*
//SORT     EXEC PGM=SORT33,PARM='CORE=MAX,MSG=AP'
//SYSUDUMP DD SYSOUT=(*,,DUMP)
//SORTIN   DD DSN=BC0THOR.TST.ALLCICS,DISP=SHR
//SORTOUT  DD DSN=BC0THOR.DEL.ALLSORT,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(15,5),RLSE)
//SORTWK01 DD UNIT=DISK,SPACE=(CYL,(5,5))
//SORTWK02 DD UNIT=DISK,SPACE=(CYL,(5,5))
//SORTWK03 DD UNIT=DISK,SPACE=(CYL,(5,5))
//SORTWK04 DD UNIT=DISK,SPACE=(CYL,(5,5))
//SORTWK05 DD UNIT=DISK,SPACE=(CYL,(5,5))
//SORTWK06 DD UNIT=DISK,SPACE=(CYL,(5,5))
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
 SORT FIELDS=(19,8,CH,A)
//*
//CICSRGNS EXEC PGM=CICSRGNS
//STEPLIB  DD   DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD   SYSOUT=*
//INPUT1   DD   DSN=BC0THOR.DEL.ALLSORT,DISP=SHR
//OUTPUT1  DD   DSN=BC0THOR.DEL.CICSRGNS,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(5,1),RLSE),
//         DSORG=PS,RECFM=FB,LRECL=88
