//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=104M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*               BC0THOR.PDS.JCL(COB390)                           *
//* SIMPLE COBOL COMPILE AND LINKEDIT USING THE COBOL 390 COMPILER  *
//* INPUT IS FROM BC0THOR.PDS.COBOL(XXXXXXXX)                       *
//* OUTPUT IS TO BC0THOR.LOAD.LOAD(XXXXXXXX)                        *
//*******************************************************************
//COBOL    EXEC PGM=IGYCRCTL
//STEPLIB  DD   DSN=IGY.V2R1M0.SIGYCOMP,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//SYSLIN   DD   DSN=&&LOADSET,DISP=(MOD,PASS),
//         UNIT=DISK,SPACE=(TRK,(3,3)),
//         BLKSIZE=3200
//SYSUT1   DD   UNIT=DISK,SPACE=(CYL,(1,1))
//SYSUT2   DD   UNIT=DISK,SPACE=(CYL,(1,1))
//SYSUT3   DD   UNIT=DISK,SPACE=(CYL,(1,1))
//SYSUT4   DD   UNIT=DISK,SPACE=(CYL,(1,1))
//SYSUT5   DD   UNIT=DISK,SPACE=(CYL,(1,1))
//SYSUT6   DD   UNIT=DISK,SPACE=(CYL,(1,1))
//SYSUT7   DD   UNIT=DISK,SPACE=(CYL,(1,1))
//SYSIN    DD   DSN=BC0THOR.PDS.COBOL(XXXXXXXX),DISP=SHR
//*
//LKED     EXEC PGM=HEWL,COND=(8,LT,COBOL),
//         PARM='MAP,XREF,LIST,LET,CALL,SIZE=(2048K,768K)'
//SYSLIB   DD   DSN=CEE.SCEELKED,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSLIN   DD   DSN=&&LOADSET,DISP=(OLD,DELETE)
//SYSUT1   DD   UNIT=DISK,SPACE=(TRK,(10,10))
//SYSLMOD  DD   DSN=BC0THOR.LOAD.LOAD(XXXXXXXX),DISP=SHR
