//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=104M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//********************************************************************
//*                  BC0THOR.PDS.JCL(COUNTBYT)                       *
//* READS THE INPUT1 FILE TALLYING EACH BYTE BY VALUE AND PRINTS THE *
//* NUMBER OF EACH BYTE VALUE FOUND AT END OF FILE.                  *
//********************************************************************
//*
//COUNTBYT EXEC  PGM=COUNTBYT
//STEPLIB  DD    DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//         DD    DSN=CEE.SCEERUN,DISP=SHR
//SYSUDUMP DD    SYSOUT=*
//STDERR01 DD    SYSOUT=*              <== DEFAULT ERROR FILE
//STDOUT01 DD    SYSOUT=*              <== DEFAULT OUTPUT FILE
//STDIN01  DD    *                     <== DEFAULT INPUT FILE
//INPUT1   DD    DSN=BC0THOR.TST.DFC7005P.PGMLIST,DISP=SHR
