//BC0THORJ JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(COPYDUMP)                       *
//*       COPY A SYS1.DUMP DATASET TO ANOTHER VOLUME FOR ANALYSIS   *
//* !!!!!!!!!!!---> SUBMIT ON APPROPRIATE SYSTEM <---!!!!!!!!!!!!!! *
//*******************************************************************
//*
//SCRATCH  EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
           DELETE (BC0THOR.TST.DUMP03) NONVSAM
//*
//COPYDUMP EXEC PGM=COPYSEQ
//STEPLIB  DD   DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//PRINT1   DD   SYSOUT=*
//INPUT1   DD   DSN=SYS1.DUMP03,DISP=SHR,VOL=SER=PAGEA4,UNIT=DISK
//OUTPUT1  DD   DSN=BC0THOR.TST.DUMP03,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(1500,45),RLSE),
//         RECFM=FB,LRECL=4160,BLKSIZE=4160
