//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=104M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(DESERV)                         *
//* EXPERIMENT WITH THE DESERV MACRO                                *
//*******************************************************************
//DESERV   EXEC  PGM=DESERV
//STEPLIB  DD    DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD    SYSOUT=*
//PRINT1   DD    SYSOUT=*
//INPDSE   DD    DSN=BC0THOR.LOAD.LOAD,DISP=SHR
