//BC0THORH JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*********************************************************************
//*                 BC0THOR.PDS.JCL(DISASM)                           *
//* DISASSEMBLE TWO PROGRAMS AND COMPARE THE RESULTS                  *
//*********************************************************************
//SCRATCH  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.DEL.DISASM1
 DELETE BC0THOR.DEL.DISASM2
//*
//DISASM1  EXEC PGM=DISASM0
//STEPLIB  DD   DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//SYSLIB   DD   DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSPUNCH DD   DSN=BC0THOR.DEL.DISASM1,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(90,15),RLSE)
//SYSIN    DD   *
CURRDATE BEGINPGM
//SYSIN2   DD   *
USING 000000 000005 F P 000000
USING 000005        C P 000000
DATA 000026 00003D
//*
//DISASM2  EXEC PGM=DISASM0
//STEPLIB  DD   DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//SYSLIB   DD   DSN=EMVSP.OUTPUT.LOADLIB,DISP=SHR
//SYSPUNCH DD   DSN=BC0THOR.DEL.DISASM2,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(90,15),RLSE)
//SYSIN    DD   *
CURRDATE BEGINPGM
//SYSIN2   DD   *
USING 000000 000005 F P 000000
USING 000005        C P 000000
DATA 000026 00003D
//*
//*UPERC  EXEC PGM=ISRSUPC,PARM=(OVSUML,LINECMP,'','')
//SUPERC  EXEC PGM=ISRSUPC,PARM=(DELTAL,LINECMP,' NOSEQ','')
//NEWDD  DD DSN=BC0THOR.DEL.DISASM1,DISP=SHR
//OLDDD  DD DSN=BC0THOR.DEL.DISASM2,DISP=SHR
//OUTDD  DD SYSOUT=*
