//BC0THORI JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(DSCBXPND)                       *
//*    HIGH-LEVEL ASSEMBLY TO EXPAND THE DSCB FOR DOCUMENTATION     *
//*******************************************************************
//ASM      EXEC PGM=ASMA90,PARM='OBJECT,XREF(SHORT)'
//SYSLIB   DD DSN=SYS1.MODGEN,DISP=SHR
//SYSUT1   DD DSN=&&SYSUT1,UNIT=DISK,SPACE=(CYL,(10,5))
//SYSPRINT DD SYSOUT=*
//*YSPRINT DD DSN=BC0THOR.PDS.CNTLBLOX(DSCB),DISP=SHR
//SYSPUNCH DD DUMMY,DCB=BLKSIZE=80
//SYSLIN   DD DSN=&&LOADSET,DISP=(,PASS),
//         UNIT=DISK,SPACE=(CYL,(5,1),RLSE),
//         DCB=(BLKSIZE=400)
//SYSIN    DD *
***********************************************************************
* EXPANSION OF THE DSCB CONTROL BLOCK                                 *
* THE IECSDSL1 MAPPING MACRO IS IN SYS1.MODGEN                        *
***********************************************************************
ANYNAME  CSECT
         TITLE 'DSCB DEFINITION'
DSCB     DSECT
         IECSDSL1 (1,2,3,4,5,6)
ANYNAME  CSECT
         END
