//BC0THORI JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(FINDSUBR)                       *
//* THIS PROGRAM READS THE DIRECTORY ENTRIES OF AN INPUT PDS        *
//* USING THE SUBROUTINE READDIR, ISSUES A FIND MACRO USING THE     *
//* TTR OF THE MEMBER, AND READS THE LOAD MODULE. THE CESD RECORDS  *
//* ARE PROCESSED TO FIND ALL EXTERNAL REFERENCES. PROCESSING       *
//* STOPS FOR A MEMBER WHEN THE FIRST CONTROL RECORD IS READ.       *
//* THE OUTPUT FILE CONTAINS ONE RECORD PER MEMBER FOR EACH         *
//* EXTERNAL REFERENCE, WITH CALLING AND CALLED MODULE NAMES.       *
//*******************************************************************
//*
//SCRATCH  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.TST.FINDSUBR.BATCH NONVSAM
//*
//FINDLDM  EXEC PGM=FINDSUBR
//STEPLIB  DD DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD SYSOUT=*
//INPUT1   DD DSN=EMVSP.OUTPUT.LOADLIB,DISP=SHR
//OUTPUT1  DD DSN=BC0THOR.TST.FINDSUBR.BATCH,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(CYL,(10,1),RLSE),
//         RECFM=FB,LRECL=16
