//BC0THORT JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(IDCMDIAG)                       *
//* DIAGNOSE COMPARISON BETWEEN A CATALOG AND A VVDS: BOTH MUST BE  *
//* DONE FOR A COMPLETE TEST                                        *
//*******************************************************************
//DIAGCAT  EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
 DIAGNOSE ICFCATALOG  INDATASET(SYS1.CAT.TSO) -
              COMPAREDS(SYS1.VVDS.VMVS220)
//DIAGVVDS EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
 DIAGNOSE VVDS  INDATASET(SYS1.VVDS.VMVS220) -
              COMPAREDS(SYS1.CAT.TSO)
