//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*********************************************************************
//*                 BC0THOR.PDS.JCL(IDCMRECT)                       *
//*                  RECATALOG AN UNCATALOGED VSAM FILE               *
//*********************************************************************
//*
//LISTCAT  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 LISTCAT ENTRIES(TESTVSAM.BC0THOR.TDATE) ALL
//*
//RECATLG  EXEC PGM=IDCAMS
//DD1      DD   VOL=SER=TECH01,UNIT=DISK,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
 DEFINE CLUSTER -
        (NAME (TESTVSAM.BC0THOR.TDATE) -
         VOL (TECH01) FILE (DD1) REUSE RECATALOG) -
         CATALOG(SYS1.CAT.TEST01)
//*
//LISTCAT  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 LISTCAT ENTRIES(TESTVSAM.BC0THOR.TDATE) ALL
