//BC0THORF JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(LINKXPND)                       *
//*         LINKEDIT TO EXPAND A CSECT                              *
//*******************************************************************
//LKED01 EXEC PGM=IEWL,REGION=256K,
// PARM='SIZE=(256K,48K),XREF,LIST,LET,CALL'
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  UNIT=(DISK),SPACE=(CYL,(10,1),RLSE)
//INLIB    DD  DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSLIB   DD  DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//         DD  DSN=CEE.SCEELKED,DISP=SHR,UNIT=DISK,VOL=SER=SYSTS4
//         DD  DSN=EMVSP.OUTPUT.LOADLIB,DISP=SHR
//SYSLMOD  DD  DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSLIN   DD  *
 INCLUDE INLIB(PDSDIR)
 EXPAND READDIR(100)
 NAME NEWDIR(R)
