//BC0THORF JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=104M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(LMODCHEK)                       *
//* CHECK LOCATION OF INCLUDED CSECTS FOR SPECIFIED LOAD MODULES.   *
//* TO USE THIS PROGRAM, THE FOLLOWING JCL MUST BE SUPPLIED:        *
//* 1) //INLIB DD: FOR THE LIBRARY CONTAINING THE MEMBER(S) TO BE   *
//*                ANALYZED.                                        *
//* 2) //SYSLIB DD: THE CONCATENATION OF LIBRARIES THAT IS THE SAME *
//*                AS THAT USED BY THE LINKEDIT STEP IN THE ENDEVOR *
//*                PROCESSOR GROUP THAT WILL BE USED TO MOVE THE    *
//*                PROGRAM TO STAGE 1.                              *
//* 3) //SYSIN DD: EACH RECORD CONTAINS THE NAME OF A MEMBER IN THE *
//*                INLIB FILE THAT IS TO BE ANALYZED. MEMBER NAMES  *
//*                MUST BE LEFT JUSTIFIED IN COLUMNS 1-8, ONE NAME  *
//*                PER RECORD.                                      *
//*                                                                 *
//* THE REPORT WILL PRINT ONE LINE PER CSECT, SHOWING WHERE IT WILL *
//* BE FOUND WHEN THE PROGRAM IS COMPILED AND LINKED INTO ENDEVOR   *
//* STAGE 1. BE SURE TO CHECK OUT ANY CSECTS THAT WILL BE FOUND IN  *
//* LIBRARIES OTHER THAN CURRENT PRODUCTION.                        *
//*                                                                 *
//* NOTE: WHEN PARM=FLAGQ IS SPECIFIED ON THE EXEC STATEMENT, AN    *
//*       ASTERISK IS MOVED TO THE LEFT OF EACH CSECT NAME WHEN IT  *
//*       WOULD BE FOUND ON A SYSLIB DATASET WHOSE NAME BEGINS WITH *
//*       "EMVSQ".                                                  *
//*******************************************************************
//LMODCHEK EXEC  PGM=LMODCHEK,PARM=FLAGQ
//STEPLIB  DD    DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD    SYSOUT=*
//SYSPRINT DD    SYSOUT=*
//INLIB    DD    DSN=EMVSP.IMSVS.PGMLIB,DISP=SHR
//SYSLIB   DD    DSN=EMVSQ.OUTPUT.LOADLIB,DISP=SHR
//         DD    DSN=EMVSP.OUTPUT.LOADLIB,DISP=SHR
//         DD    DSN=SYS1.DB2.TEST.DSNLOAD,DISP=SHR
//         DD    DSN=SYS1.IMSVS.RESLIB,DISP=SHR
//         DD    DSN=IMSVS.PGMLIB,DISP=SHR
//         DD    DSN=IMSDBA.DBT.LOAD,DISP=SHR
//         DD    DSN=SPP.ACF2.ACFMOD,DISP=SHR
//         DD    DSN=CEE.SCEELKED,DISP=SHR
//SYSIN    DD    *
RP150A00
CEN300
