//BC0THORE JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(MODPSWD)                        *
//*******************************************************************
//MODPSWD  EXEC PGM=MODPSWD,PARM=OFF
//STEPLIB  DD   DSN=BC0THOR.LOAD.LOAD,DISP=(OLD,DELETE,DELETE)
//SYSUDUMP DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//MODPSWDE DD   DISP=SHR,UNIT=DISK,VOL=SER=NET001,
//         DSN=CNM.V130.SA23.DSISVRT.I
