//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=104M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(MODSCNDY)                       *
//* SET SECONDARY ALLOCATION TO ZERO FOR THE DATASET IDENTIFIED BY  *
//* THE MODSCNDY DD STATEMENT.
//*******************************************************************
//MODSCNDY EXEC  PGM=MODSCNDY
//STEPLIB  DD    DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD    SYSOUT=*
//ABNLDUMP DD    SYSOUT=*
//MODSCNDY DD    DSN=BC0THOR.TST.MULTXTNT,DISP=SHR
