//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=104M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(MRG4WAY)                        *
//* MERGE FOUR FILES ON COL 1-8. RESPECIALIZE FOR EACH USE.         *
//*******************************************************************
//SCRATCH  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.DEL.FILE558M
 DELETE BC0THOR.DEL.PRNT558M
//*
//MRG4WAY  EXEC  PGM=MRG4WAY
//STEPLIB  DD    DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD    SYSOUT=*
//INPUT1   DD    DSN=BC0THOR.PDS.DATA(FILE558),DISP=SHR
//INPUT2   DD    DSN=BC0THOR.PDS.DATA(CALLEDBY),DISP=SHR
//INPUT3   DD    DSN=BC0THOR.PDS.DATA(CALLSTO),DISP=SHR
//INPUT4   DD    DSN=BC0THOR.PDS.DATA(EXECBY),DISP=SHR
//OUTPUT1  DD    DSN=BC0THOR.DEL.FILE558M,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(15,5),RLSE),
//         DSORG=PS,RECFM=FB,LRECL=80
//PRINT1   DD    DSN=BC0THOR.DEL.PRNT558M,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(15,5),RLSE),
//         DSORG=PS,RECFM=FB,LRECL=80
