//BC0THORA JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(PDSINFO)                        *
//*             PDSINFO - PRINT PDS DIRECTORY INFO                  *
//* READ THE DIRECTORY IN AN INPUT PDS AND PRINT A DETAIL LISTING   *
//* SHOWING THE MODULE NAME, TTR, LENGTH, ALIAS-OF, ATTRIBUTES      *
//*******************************************************************
//*
//SCRATCH  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.TST.PDSINFO NONVSAM
//*
//PDSINFO  EXEC PGM=PDSINFO
//STEPLIB  DD   DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD   SYSOUT=*
//INPUT1   DD   DSN=EMVSP.OUTPUT.LOADLIB,DISP=SHR
//PRINT1   DD   DSN=&&PDSINFO,DISP=(,PASS),
//         UNIT=DISK,SPACE=(TRK,(15,5),RLSE),
//         BLKSIZE=23440
//*
//SORT     EXEC PGM=SORT33,PARM='CORE=MAX,MSG=AP'
//SYSUDUMP DD SYSOUT=(*,,DUMP)
//SORTIN   DD DSN=&&PDSINFO,DISP=(OLD,PASS)
//SORTOUT  DD DSN=BC0THOR.TST.PDSINFO,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(30,5),RLSE),
//         RECFM=FB,LRECL=80,BLKSIZE=23440
//SORTWK01 DD UNIT=DISK,SPACE=(CYL,1)
//SORTWK02 DD UNIT=DISK,SPACE=(CYL,1)
//SORTWK03 DD UNIT=DISK,SPACE=(CYL,1)
//SORTWK04 DD UNIT=DISK,SPACE=(CYL,1)
//SORTWK05 DD UNIT=DISK,SPACE=(CYL,1)
//SORTWK06 DD UNIT=DISK,SPACE=(CYL,1)
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
 SORT FIELDS=(17,31,CH,A)
//*
//PDSCHECK EXEC PGM=PDSCHECK
//STEPLIB  DD   DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD   SYSOUT=*
//INPUT1   DD   DSN=BC0THOR.TST.PDSINFO,DISP=(OLD,PASS)
//PRINT1   DD   SYSOUT=*,BLKSIZE=80
