//BC0THORJ JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.COBOL(RCVRPDS)                      *
//*******************************************************************
//*
//SCRATCH  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.SEQPDS NONVSAM
//*
//RCVRPDS  EXEC PGM=RCVRPDS
//STEPLIB  DD   DSN=TEST.LOAD,DISP=SHR
//SYSUDUMP DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   DSN=CICS.TEST.COMPWARE.SORCMAC,DISP=SHR
//SYSOUT   DD   DSN=BC0THOR.SEQPDS,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(CYL,(15,1),RLSE),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=19440)
