//BC0THORI JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=104M
//JESOUT OUTPUT GROUPID=HDQTRSF2,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*          BC0THOR.PDS.JCL(RELINKB)                               *
//* THIS IS ONE OF FOUR JOBS USED TO RELINK ALL THE MEMBERS IN THE  *
//* ENDEVOR CONTROLLED LOAD LIBRARIES INTO NEW LIBRARIES, REPLACING *
//* ALL COBOL LIBRARY SUBROUTINES (IGZ..., ILBO...) WITH THE        *
//* EQUIVALENT MEMBER FROM CEE.SCEELKED.                            *
//* THIS JOB RELINKS ALL OF EMVSQ.OUTPUT.LOADLIB INTO THE NEW LOAD  *
//* LIBRARY EMVSP.NEWOUTQ.LOADLIB                                   *
//*******************************************************************
//SCRATCH  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE EMVSP.NEWOUTQ.LOADLIB
//*
//LKED   EXEC  PGM=IEWL,PARM='NCAL,LIST=OFF,LET'
//SYSUT1   DD  UNIT=DISK,SPACE=(1024,(200,20))
//SYSPRINT DD  SYSOUT=*
//OLDLIB   DD  DISP=SHR,DSN=EMVSQ.OUTPUT.LOADLIB
//SYSLIB   DD  DISP=SHR,DSN=CEE.SCEELKED
//SYSLMOD  DD  DSN=EMVSP.NEWOUTQ.LOADLIB,DISP=(,CATLG),
//         LIKE=EMVSQ.OUTPUT.LOADLIB
//SYSLIN   DD  DISP=SHR,DSN=BC0THOR.TST.LINKCNTL.EMVSQ
