//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(SCANVBL2)                       *
//* PROCESS AN ENTIRE CLIST LIBRARY PRINTING AUTHOR/USERS/LAST MOD  *
//*******************************************************************
//SCANVBL2 EXEC  PGM=SCANVBL2
//STEPLIB  DD    DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD    SYSOUT=*
//SYSOUT   DD    SYSOUT=*
//SYSLIB   DD    DSN=SYS1.CLIST,DISP=SHR
