//BC0THORG JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*********************************************************************
//*                 BC0THOR.PDS.JCL(SMFABNDS)                         *
//*********************************************************************
//* READS THE SMF FILE AND WRITES ONE RECORD FOR EVERY ABENDING STEP. *
//* OUTPUT RECORDS CONTAIN JOBNAME, PROGRAM NAME, AND ABEND CODE.     *
//*********************************************************************
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.TST.SMFABNDS.SYSAAUG NONVSAM
//*
//*
//SMFABNDS EXEC PGM=SMFABNDS,PARM='JOBLOG'
//STEPLIB  DD DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD SYSOUT=*
//*INPUT1   DD DSN=SMF.DKI0002.RAWDATA,DISP=SHR
//*INPUT1   DD DSN=SMF.DKI9002.RAWDATA,DISP=SHR
//*INPUT1   DD DSN=SMF.MKI0015.SMFACCUM.EOM(-2),DISP=OLD
//INPUT1   DD DSN=SMF.MKI9015.SMFACCUM.EOM(-2),DISP=OLD
//OUTPUT1  DD DSN=BC0THOR.TST.SMFABNDS.SYSAAUG,DISP=(NEW,CATLG,KEEP),
//         UNIT=DISK,SPACE=(CYL,(30,5)),
//         RECFM=FB,LRECL=80
