//BC0THORG JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*********************************************************************
//*                 BC0THOR.PDS.JCL(SMFSTR30)                         *
//*********************************************************************
//* STRIP ALL TYPE 30 SMF RECORDS FOR THE JOBLOG NUMBERS GIVEN ON     *
//* THE READER1 FILE. THE READER1 FILE HAS HARD-CODED RECFM=FB, AND IS*
//* EXPECTED TO BE FORMATTED AS THOUGH OUTPUT FROM SMFSTR14. ONLY THE *
//* JOBNAME, READER START DATE, AND READER START TIME FIELDS ARE USED.*
//* UP TO 1000 JOBLOG NUMBERS MAY BE ENTERED, PER RUN.                *
//*                                                                   *
//* THE EXEC STATEMENT PARM CAN BE "PARM=JOBLOG" TO PRODUCE AN OUTPUT *
//* FILE CONTAINING JOBLOG NUMBER, PROGRAM NAME, STEP NAME, USER ID,  *
//* JES2 JOB NUMBER, SMF TYPE 30 SUBTYPE, AND PROGRAMMER NAME,        *
//* OTHERWISE THE OUTPUT FILE WILL CONTAIN THE ENTIRE INPUT SMF RECORD*
//* FOR PARM=JOBLOG, THE OUTPUT1 DCB INFORMATION SHOULD BE RECFM=FB,  *
//* LRECL=147, BLKSIZE=MULTIPLE OF 147, OTHERWISE THE OUTPUT1 DCB     *
//* SHOULD BE RECFM=VB,LRECL=32716,BLKSIZE=32720.                     *
//*********************************************************************
//SCRATCH  EXEC PGM=IEFBR14
//DD1      DD DSN=BC0THOR.STRIP030.DATA,DISP=(MOD,DELETE,DELETE),
//        UNIT=DISK,SPACE=(TRK,(0))
//*
//SMFSTR30 EXEC PGM=SMFSTR30,PARM='JOBLOG'
//STEPLIB  DD DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD SYSOUT=*
//INPUT1   DD DSN=SMF.DKI0002.RAWDATA,DISP=SHR
//*INPUT1   DD DSN=SMF.DKI9002.RAWDATA,DISP=SHR
//*INPUT1   DD DSN=SMF.MKI0015.SMFACCUM.EOM(-3),DISP=OLD
//*INPUT1   DD DSN=SMF.MKI9015.SMFACCUM.EOM(-1),DISP=OLD
//OUTPUT1  DD DSN=BC0THOR.STRIP030.DATA,DISP=(NEW,CATLG,KEEP),
//        UNIT=DISK,SPACE=(TRK,(10,5)),
//        DCB=(RECFM=FB,LRECL=147,BLKSIZE=23373)
//READER1  DD DSN=BC0THOR.STRIP014.DATA,DISP=SHR
//*
//IEBGENER EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSUT1   DD DSN=BC0THOR.STRIP030.DATA,DISP=SHR
//SYSUT2   DD SYSOUT=*
