//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(SMPXTR6F)                       *
//* WRITES A FILE OF ALL TYPE 6F RECORDS FOUND IN AN INPUT SMPE     *
//* CSI DATASET.                                                    *
//*******************************************************************
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.TST.SMPXTR6F
//*
//SMPXTR6F EXEC PGM=SMPXTR6F
//STEPLIB  DD   DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD   SYSOUT=*
//SMPCSI   DD   DSN=CAI.SMPECSI.CSI,DISP=SHR
//PRINT1   DD   SYSOUT=*
//OUTPUT1  DD   DSN=BC0THOR.TST.SMPXTR6F,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(150,20),RLSE),
//         DSORG=PS,RECFM=VB,LRECL=32756,BLKSIZE=32760
