//BC0THORD JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL,
//   PAGEDEF=GRYBIG,FORMDEF=GRYBIG
//*******************************************************************
//*                 BC0THOR.PDS.JCL(SMPXTRQQ)                       *
//* WRITES A FILE OF ALL TYPE 6F RECORDS WITH THE SUBTYPE GIVEN IN  *
//* THE EXEC PARM FIELD (4 HEX DIGITS) FROM AN SMPE CSI DATASET     *
//*******************************************************************
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE BC0THOR.TST.SMPXTRQQ
//*
//SMPXTRQQ EXEC PGM=SMPXTRQQ,PARM=0140
//STEPLIB  DD   DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD   SYSOUT=*
//*MPCSI   DD   DSN=CAI.SMPECSI.CSI,DISP=SHR
//SMPCSI   DD   DSN=ESASMPE.GLOBAL.REL50.CSI,DISP=SHR
//PRINT1   DD   SYSOUT=*
//OUTPUT1  DD   DSN=BC0THOR.TST.SMPXTRQQ,DISP=(,CATLG),
//         UNIT=DISK,SPACE=(TRK,(15,5),RLSE),
//         DSORG=PS,RECFM=FB,LRECL=44
