//BC0THORA JOB (1152002-9800039,,TMVS01-UR-XXXX),'DTHORNTON',CLASS=V,
//   MSGCLASS=Y,NOTIFY=BC0THOR,REGION=4M
//JESOUT OUTPUT GROUPID=02A,DEFAULT=YES,JESDS=ALL
//*******************************************************************
//*                 BC0THOR.PDS.JCL(VTOCDSVL)                       *
//*******************************************************************
//SCRATCH  EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
 DELETE BC0THOR.TST.VTOCDSVL
//*
//VTOCDSVL EXEC PGM=VTOCDSVL
//STEPLIB  DD DSN=BC0THOR.LOAD.LOAD,DISP=SHR
//SYSUDUMP DD SYSOUT=*
//OUTPUT1  DD DSN=BC0THOR.TST.VTOCDSVL,DISP=(,CATLG),UNIT=DISK,
//            SPACE=(CYL,(6,1),RLSE),
//            LRECL=80,RECFM=FB
//PRINT1   DD SYSOUT=*
//VTOC1    DD UNIT=DISK,VOL=SER=EM20A1,DISP=SHR
//VTOC2    DD UNIT=DISK,VOL=SER=EM20A2,DISP=SHR
//VTOC3    DD UNIT=DISK,VOL=SER=EM20A3,DISP=SHR
//VTOC4    DD UNIT=DISK,VOL=SER=EM20A4,DISP=SHR
//VTOC5    DD UNIT=DISK,VOL=SER=EM20A5,DISP=SHR
//VTOC6    DD UNIT=DISK,VOL=SER=EM20A6,DISP=SHR
//VTOC7    DD UNIT=DISK,VOL=SER=EM20A7,DISP=SHR
//VTOC8    DD UNIT=DISK,VOL=SER=EM20A8,DISP=SHR
//VTOC9    DD UNIT=DISK,VOL=SER=EM20A9,DISP=SHR
//VTOCA    DD UNIT=DISK,VOL=SER=EM20D1,DISP=SHR
//VTOCB    DD UNIT=DISK,VOL=SER=EM20D2,DISP=SHR
//VTOCC    DD UNIT=DISK,VOL=SER=EM20D3,DISP=SHR
//VTOCD    DD UNIT=DISK,VOL=SER=EM20D4,DISP=SHR
//VTOCE    DD UNIT=DISK,VOL=SER=EM20D5,DISP=SHR
//VTOCF    DD UNIT=DISK,VOL=SER=EM20D6,DISP=SHR
//VTOC10   DD UNIT=DISK,VOL=SER=EM20D7,DISP=SHR
//VTOC11   DD UNIT=DISK,VOL=SER=EM209A,DISP=SHR
//VTOC12   DD UNIT=DISK,VOL=SER=EM209B,DISP=SHR
//VTOC13   DD UNIT=DISK,VOL=SER=EM209C,DISP=SHR
//VTOC14   DD UNIT=DISK,VOL=SER=EM209D,DISP=SHR
//VTOC15   DD UNIT=DISK,VOL=SER=EM209E,DISP=SHR
//VTOC16   DD UNIT=DISK,VOL=SER=EM209F,DISP=SHR
//VTOC17   DD UNIT=DISK,VOL=SER=EM2090,DISP=SHR
//VTOC18   DD UNIT=DISK,VOL=SER=EM2091,DISP=SHR
//VTOC19   DD UNIT=DISK,VOL=SER=EM2092,DISP=SHR
//VTOC1A   DD UNIT=DISK,VOL=SER=EM2093,DISP=SHR
//VTOC1B   DD UNIT=DISK,VOL=SER=EM2094,DISP=SHR
//VTOC1C   DD UNIT=DISK,VOL=SER=EM2095,DISP=SHR
//VTOC1D   DD UNIT=DISK,VOL=SER=EM2096,DISP=SHR
//VTOC1E   DD UNIT=DISK,VOL=SER=EM2097,DISP=SHR
//VTOC1F   DD UNIT=DISK,VOL=SER=EM2098,DISP=SHR
//VTOC20   DD UNIT=DISK,VOL=SER=EM2099,DISP=SHR
//VTOC21   DD UNIT=DISK,VOL=SER=MIGY2K,DISP=SHR
//VTOC22   DD UNIT=DISK,VOL=SER=SME100,DISP=SHR
//VTOC23   DD UNIT=DISK,VOL=SER=SME101,DISP=SHR
//VTOC24   DD UNIT=DISK,VOL=SER=SME102,DISP=SHR
//VTOC25   DD UNIT=DISK,VOL=SER=SME103,DISP=SHR
//VTOC26   DD UNIT=DISK,VOL=SER=SME104,DISP=SHR
//VTOC27   DD UNIT=DISK,VOL=SER=SME105,DISP=SHR
//VTOC28   DD UNIT=DISK,VOL=SER=SME106,DISP=SHR
//VTOC29   DD UNIT=DISK,VOL=SER=SME107,DISP=SHR
//VTOC2A   DD UNIT=DISK,VOL=SER=SME108,DISP=SHR
//VTOC2B   DD UNIT=DISK,VOL=SER=SME109,DISP=SHR
//VTOC2C   DD UNIT=DISK,VOL=SER=SMYA00,DISP=SHR
//VTOC2D   DD UNIT=DISK,VOL=SER=SMYA01,DISP=SHR
//VTOC2E   DD UNIT=DISK,VOL=SER=SMYA02,DISP=SHR
//VTOC2F   DD UNIT=DISK,VOL=SER=SMYA03,DISP=SHR
//VTOC30   DD UNIT=DISK,VOL=SER=SMYA04,DISP=SHR
//VTOC31   DD UNIT=DISK,VOL=SER=SMYA05,DISP=SHR
//VTOC32   DD UNIT=DISK,VOL=SER=SMYA06,DISP=SHR
//VTOC33   DD UNIT=DISK,VOL=SER=SMYA07,DISP=SHR
//VTOC34   DD UNIT=DISK,VOL=SER=SMYA08,DISP=SHR
//VTOC35   DD UNIT=DISK,VOL=SER=SMYA09,DISP=SHR
//VTOC36   DD UNIT=DISK,VOL=SER=SMYB00,DISP=SHR
//VTOC37   DD UNIT=DISK,VOL=SER=SMYB01,DISP=SHR
//VTOC38   DD UNIT=DISK,VOL=SER=SMYB02,DISP=SHR
//VTOC39   DD UNIT=DISK,VOL=SER=SMYB03,DISP=SHR
//VTOC3A   DD UNIT=DISK,VOL=SER=SMYB04,DISP=SHR
//VTOC3B   DD UNIT=DISK,VOL=SER=SMYB05,DISP=SHR
//VTOC3C   DD UNIT=DISK,VOL=SER=SMYB06,DISP=SHR
//VTOC3D   DD UNIT=DISK,VOL=SER=SMYB07,DISP=SHR
//VTOC3E   DD UNIT=DISK,VOL=SER=SMYB08,DISP=SHR
//VTOC3F   DD UNIT=DISK,VOL=SER=SMYB09,DISP=SHR
//VTOC40   DD UNIT=DISK,VOL=SER=SMYB10,DISP=SHR
//VTOC41   DD UNIT=DISK,VOL=SER=SMYB11,DISP=SHR
//VTOC42   DD UNIT=DISK,VOL=SER=SMYB12,DISP=SHR
//VTOC43   DD UNIT=DISK,VOL=SER=SMYB13,DISP=SHR
//VTOC44   DD UNIT=DISK,VOL=SER=SMYB14,DISP=SHR
//VTOC45   DD UNIT=DISK,VOL=SER=SMYB15,DISP=SHR
//VTOC46   DD UNIT=DISK,VOL=SER=SMYB16,DISP=SHR
//VTOC47   DD UNIT=DISK,VOL=SER=SMYB17,DISP=SHR
//VTOC48   DD UNIT=DISK,VOL=SER=SMYB18,DISP=SHR
//VTOC49   DD UNIT=DISK,VOL=SER=SMYB19,DISP=SHR
//VTOC4A   DD UNIT=DISK,VOL=SER=SMYB20,DISP=SHR
//VTOC4B   DD UNIT=DISK,VOL=SER=SMYB21,DISP=SHR
//VTOC4C   DD UNIT=DISK,VOL=SER=SMYB22,DISP=SHR
//VTOC4D   DD UNIT=DISK,VOL=SER=SMYB23,DISP=SHR
//VTOC4E   DD UNIT=DISK,VOL=SER=SMYB24,DISP=SHR
//VTOC4F   DD UNIT=DISK,VOL=SER=SMYB25,DISP=SHR
//VTOC50   DD UNIT=DISK,VOL=SER=SMYB26,DISP=SHR
//VTOC51   DD UNIT=DISK,VOL=SER=SMYB27,DISP=SHR
//VTOC52   DD UNIT=DISK,VOL=SER=SMYB28,DISP=SHR
//VTOC53   DD UNIT=DISK,VOL=SER=SMYB29,DISP=SHR
//VTOC54   DD UNIT=DISK,VOL=SER=SMYB30,DISP=SHR
//VTOC55   DD UNIT=DISK,VOL=SER=SMYB31,DISP=SHR
//VTOC56   DD UNIT=DISK,VOL=SER=SMYD00,DISP=SHR
//VTOC57   DD UNIT=DISK,VOL=SER=SMYD01,DISP=SHR
//VTOC58   DD UNIT=DISK,VOL=SER=SMYD02,DISP=SHR
//VTOC59   DD UNIT=DISK,VOL=SER=SMYD03,DISP=SHR
//VTOC5A   DD UNIT=DISK,VOL=SER=SMYD04,DISP=SHR
//VTOC5B   DD UNIT=DISK,VOL=SER=SMYD05,DISP=SHR
//VTOC5C   DD UNIT=DISK,VOL=SER=SMYI00,DISP=SHR
//VTOC5D   DD UNIT=DISK,VOL=SER=SMYI01,DISP=SHR
//VTOC5E   DD UNIT=DISK,VOL=SER=SMYI02,DISP=SHR
//VTOC5F   DD UNIT=DISK,VOL=SER=SMYI03,DISP=SHR
//VTOC60   DD UNIT=DISK,VOL=SER=SMYI04,DISP=SHR
//VTOC61   DD UNIT=DISK,VOL=SER=SMYI05,DISP=SHR
//VTOC62   DD UNIT=DISK,VOL=SER=SMYI06,DISP=SHR
//VTOC63   DD UNIT=DISK,VOL=SER=SMYI07,DISP=SHR
//VTOC64   DD UNIT=DISK,VOL=SER=SMYI08,DISP=SHR
//VTOC65   DD UNIT=DISK,VOL=SER=SMYI09,DISP=SHR
//VTOC66   DD UNIT=DISK,VOL=SER=SMYO00,DISP=SHR
//VTOC67   DD UNIT=DISK,VOL=SER=SMYO01,DISP=SHR
//VTOC68   DD UNIT=DISK,VOL=SER=SMYO02,DISP=SHR
//VTOC69   DD UNIT=DISK,VOL=SER=SMYO03,DISP=SHR
//VTOC6A   DD UNIT=DISK,VOL=SER=SMYO04,DISP=SHR
//VTOC6B   DD UNIT=DISK,VOL=SER=SMYO05,DISP=SHR
//VTOC6C   DD UNIT=DISK,VOL=SER=SMYO06,DISP=SHR
//VTOC6D   DD UNIT=DISK,VOL=SER=SMYO07,DISP=SHR
//VTOC6E   DD UNIT=DISK,VOL=SER=SMYO08,DISP=SHR
//VTOC6F   DD UNIT=DISK,VOL=SER=SMYO09,DISP=SHR
//VTOC70   DD UNIT=DISK,VOL=SER=SMYS00,DISP=SHR
//VTOC71   DD UNIT=DISK,VOL=SER=SMYS01,DISP=SHR
//VTOC72   DD UNIT=DISK,VOL=SER=SMYS02,DISP=SHR
//VTOC73   DD UNIT=DISK,VOL=SER=SMYX00,DISP=SHR
//VTOC74   DD UNIT=DISK,VOL=SER=SMYX01,DISP=SHR
//VTOC75   DD UNIT=DISK,VOL=SER=SMYX02,DISP=SHR
//VTOC76   DD UNIT=DISK,VOL=SER=Y2KFDR,DISP=SHR
//VTOC77   DD UNIT=DISK,VOL=SER=Y2KMIG,DISP=SHR
//VTOC78   DD UNIT=DISK,VOL=SER=Y2KSMS,DISP=SHR
//VTOC79   DD UNIT=DISK,VOL=SER=Y2KSPL,DISP=SHR
//VTOC7A   DD UNIT=DISK,VOL=SER=Y2KWK1,DISP=SHR
//VTOC7B   DD UNIT=DISK,VOL=SER=Y2KWK2,DISP=SHR
//VTOC7C   DD UNIT=DISK,VOL=SER=Y2KWK3,DISP=SHR
//VTOC7D   DD UNIT=DISK,VOL=SER=Y2KWK4,DISP=SHR
//VTOC7E   DD UNIT=DISK,VOL=SER=Y2KWK5,DISP=SHR
//VTOC7F   DD UNIT=DISK,VOL=SER=Y2KWK6,DISP=SHR
//VTOC80   DD UNIT=DISK,VOL=SER=Y2KWK7,DISP=SHR
//VTOC81   DD UNIT=DISK,VOL=SER=Y2KWK8,DISP=SHR
//VTOC82   DD UNIT=DISK,VOL=SER=Y2KWK9,DISP=SHR
//VTOC83   DD UNIT=DISK,VOL=SER=Y2KW00,DISP=SHR
//VTOC84   DD UNIT=DISK,VOL=SER=Y2KW01,DISP=SHR
//VTOC85   DD UNIT=DISK,VOL=SER=Y2K001,DISP=SHR
//VTOC86   DD UNIT=DISK,VOL=SER=Y2K002,DISP=SHR
//VTOC87   DD UNIT=DISK,VOL=SER=Y2K003,DISP=SHR
//VTOC88   DD UNIT=DISK,VOL=SER=Y2K004,DISP=SHR
//VTOC89   DD UNIT=DISK,VOL=SER=Y2K005,DISP=SHR
//VTOC8A   DD UNIT=DISK,VOL=SER=Y2K006,DISP=SHR
//VTOC8B   DD UNIT=DISK,VOL=SER=Y2K007,DISP=SHR
//VTOC8C   DD UNIT=DISK,VOL=SER=Y2K008,DISP=SHR
//VTOC8D   DD UNIT=DISK,VOL=SER=Y2K009,DISP=SHR
//VTOC8E   DD UNIT=DISK,VOL=SER=Y2K010,DISP=SHR
//VTOC8F   DD UNIT=DISK,VOL=SER=Y2K011,DISP=SHR
//VTOC90   DD UNIT=DISK,VOL=SER=Y2K012,DISP=SHR
//VTOC91   DD UNIT=DISK,VOL=SER=Y2K013,DISP=SHR
//VTOC92   DD UNIT=DISK,VOL=SER=Y2K014,DISP=SHR
//VTOC93   DD UNIT=DISK,VOL=SER=Y2K015,DISP=SHR
//VTOC94   DD UNIT=DISK,VOL=SER=Y2K016,DISP=SHR
//VTOC95   DD UNIT=DISK,VOL=SER=Y2K017,DISP=SHR
//VTOC96   DD UNIT=DISK,VOL=SER=Y2K018,DISP=SHR
//VTOC97   DD UNIT=DISK,VOL=SER=Y2K019,DISP=SHR
//VTOC98   DD UNIT=DISK,VOL=SER=Y2K020,DISP=SHR
//VTOC99   DD UNIT=DISK,VOL=SER=Y2K021,DISP=SHR
//VTOC9A   DD UNIT=DISK,VOL=SER=Y2K022,DISP=SHR
//VTOC9B   DD UNIT=DISK,VOL=SER=Y2K023,DISP=SHR
//VTOC9C   DD UNIT=DISK,VOL=SER=Y2K024,DISP=SHR
//VTOC9D   DD UNIT=DISK,VOL=SER=Y2K025,DISP=SHR
//VTOC9E   DD UNIT=DISK,VOL=SER=Y2K026,DISP=SHR
//VTOC9F   DD UNIT=DISK,VOL=SER=Y2K027,DISP=SHR
//VTOCA0   DD UNIT=DISK,VOL=SER=Y2K028,DISP=SHR
