)ATTR DEFAULT(!ç¢)
   % TYPE(TEXT)   INTENS(HIGH) COLOR(WHITE)
   } TYPE(TEXT)   INTENS(HIGH) COLOR(BLUE)
   + TYPE(TEXT)   INTENS(HIGH) COLOR(GREEN)
   { TYPE(OUTPUT)   INTENS(HIGH) COLOR(WHITE)
)BODY WINDOW(74,8)

   + Hash {tipo      +
   + data {file                                         +

            {Hash                                    +

)INIT
  &ZWINTTL='< Pergen''s radical company >'
)END
