         MACRO
&LABEL   BKMGRLOC &IGNORE
.*
         TITLE 'BOOKMANAGER CATALOG LOCATE DATA SET MAPPING DSECT'
***********************************************************************
*                                                                     *
*        MAPPING DSECT FOR THE BOOKMANAGER CATALOG LOCATE RECORD      *
*                                                                     *
*                                                                     *
*                                                                     *
*                                                                     *
***********************************************************************
*
BKLDSECT DSECT
*
BKLTYPE  DS    CL1                 TYPE OF DATA SET
         DS    C                   FILLER FOR HUMAN READABILITY
*
BKLDSNME DS    CL44                FULL DATA SET NAME
         DS    C                   FILLER FOR HUMAN READABILITY
*
BKLDSNHL DS    CL8                 DATA SET NAME HIGH LEVEL QUALIFIER
         DS    C                   FILLER FOR HUMAN READABILITY
*
BKLDSNLL DS    CL8                 DATA SET NAME LOW LEVEL QUALIFIER
*
BKLEND   EQU   *
BKLLNGTH EQU   *-BKLDSECT          LENGTH OF CATALOG LOCATE RECORD
*
         MEND
