//ANALYZE  JOB (5304010530000000),'TECH110 TECH SUPPT',CLASS=S,
//         MSGCLASS=G,NOTIFY=TECH110
//STEP1    EXEC PGM=ICKDSF,REGION=6M
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
   REVAL   UNIT(7D6) -
        NOVFY
//
