//TECH110Z JOB (530000000000),'TECH.JEFF.KAPLAN',
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=TECH110
//S EXEC PGM=ICKDSF
//SYSPRINT DD SYSOUT=*
//DISK     DD UNIT=3390,DISP=OLD,VOL=SER=POS003
//SYSIN    DD *
   BUILDIX DDNAME(DISK) IXVTOC
/*
//S EXEC PGM=ICKDSF
//SYSPRINT DD SYSOUT=*
//DISK     DD UNIT=3390,DISP=OLD,VOL=SER=SEQDA4
//SYSIN    DD *
   BUILDIX DDNAME(DISK) IXVTOC
/*
//
