//COPYDB JOB 53050105300000000,'J KAPLAN',NOTIFY=TECH110,
//         CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),REGION=6M
//*
//*  THIS JOB COPIES THE RACF DATA BASE FROM SYSA TO SYSM
//*  JOB MUST BE RUN TWICE - ALSO FOR RACF2
//*  THE "M" SYSTEM MUST BE DOWN WHEN THIS RUNS
//*
//STEP1 EXEC PGM=IRRUT400,PARM='NOLOCKINPUT'
//SYSPRINT DD SYSOUT=*
//INDD1   DD DSN=SYSA.RACF1,DISP=SHR
//OUTDD1  DD DSN=SYSM.RACF1,DISP=SHR
//
