//TECH110Z JOB (530000000000),'TECH.JEFF.KAPLAN',
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=TECH110
//S EXEC PGM=FDRCPK,REGION=6M
//SYSPRINT DD SYSOUT=*
//SYSMAP DD SYSOUT=*
//CPKWORK DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//INPUT   DD DSN=TECH105.SMSSS1.BKUP1,DISP=SHR
//OUTDISK DD UNIT=3380,DISP=OLD,VOL=SER=SMSXXX
//SYSIN DD *
  CPK TYPE=COMPAKT,CPY=YES,ENQ=NO,E=KEEP,NOSECOND=NORLSE,OVERRIDE=YES,
       TODD=OUTDISK,FDD=INPUT,SMSPROT=NONE
  S ALLDSN
/*
//S EXEC PGM=ICKDSF
//SYSPRINT DD SYSOUT=*
//DISK     DD UNIT=3380,DISP=OLD,VOL=SER=SMSSS1
//SYSIN    DD *
   BUILDIX DDNAME(DISK) IXVTOC
/*
//
