//TECH110Z JOB (530000000000),'TECH.JEFF.KAPLAN',
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=TECH110
//S EXEC PGM=FDRCPK,REGION=6M
//SYSPRINT DD SYSOUT=*
//SYSMAP DD SYSOUT=*
//CPKWORK DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSIN DD *
  SIM TYPE=COMPAKT,CPY=YES,NOSECOND=NORLSE,OVERRIDE=NO,
       VOL=SMSU35,T=KEEP,ENQ=RESERVE,CONFMESS=NO,DUMP=NO,
       PSR=ALL,POR=ALL,CPKFREEX=16,CPKDSNMX=8,CPKMULTX=8
  S ALLDSN
/*
//
