//DELTNVR  JOB 530401053000000,'TECH.KAPLAN',NOTIFY=TECH110,
//            CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1)
//STEP01 EXEC PGM=IDCAMS,REGION=8M
//SYS020 DD VOL=SER=SYS020,DISP=OLD,UNIT=3390
//SYSPRINT DD SYSOUT=*
//SYSIN   DD *
 DEF NVSAM (NAME(SYS1.PCSQL.V1R02M00.CONFIG.DATA) -
  VOL(SYS021) DEVT(3390) RECATALOG) CAT(SYS1.MCATSB.CLUSTER)
 DEF NVSAM (NAME(SYS1.IPCS.V4R2M0.SBLSMSG0) -
  VOL(SYS017) DEVT(3390) RECATALOG) CAT(SYS1.MCATSB.CLUSTER)
 DEF NVSAM (NAME(SYS1.EXAMINE.V3R1M0.EXAMINE.CLIST) -
  VOL(SYS020) DEVT(3390) RECATALOG) CAT(SYS1.MCATSB.CLUSTER)
 DEF NVSAM (NAME(SYS1.EXAMINE.V3R1M0.EXAMINE.DBASE1) -
  VOL(SYS020) DEVT(3390) RECATALOG) CAT(SYS1.MCATSB.CLUSTER)
 DEF NVSAM (NAME(SYS1.EXAMINE.V3R1M0.EXAMINE.DBASE2) -
  VOL(SYS020) DEVT(3390) RECATALOG) CAT(SYS1.MCATSB.CLUSTER)
 DEF NVSAM (NAME(SYS1.EXAMINE.V3R1M0.EXAMINE.LOAD) -
  VOL(SYS020) DEVT(3390) RECATALOG) CAT(SYS1.MCATSB.CLUSTER)
 DEF NVSAM (NAME(SYS1.EXAMINE.V3R1M0.EXAMINE.MESSAGES) -
  VOL(SYS020) DEVT(3390) RECATALOG) CAT(SYS1.MCATSB.CLUSTER)
 DEF NVSAM (NAME(SYS1.EXAMINE.V3R1M0.EXAMINE.PANELS) -
  VOL(SYS020) DEVT(3390) RECATALOG) CAT(SYS1.MCATSB.CLUSTER)
 DEF NVSAM (NAME(SYS1.EXAMINE.V3R1M0.EXAMINE.TABLES) -
  VOL(SYS020) DEVT(3390) RECATALOG) CAT(SYS1.MCATSB.CLUSTER)
//*
