//TECH110Z JOB (530000000000),'TECH.JEFF.KAPLAN',
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=TECH110
//L       EXEC PGM=IEWL,
//             PARM='LIST,LET,XREF,MAP'
//SYSLIN   DD  *
   INCLUDE SYSLMOD(PSF50SO)
   INCLUDE SYSLMOD(PSF50B)
   ENTRY PSF50B
   NAME PSF50BZZ(R)
//SYSLMOD  DD  DSN=SYSS.FSA.REFORMAT.V1R0M0.BATLOAD,DISP=SHR
//SYSUT1   DD  DSN=&SYSUT1,SPACE=(1024,(120,120),,,ROUND),UNIT=VIO,
//             DCB=BUFNO=1
//SYSPRINT DD  SYSOUT=*
