//JEFFTECH JOB (530000000000),'TECH.JEFF.KAPLAN',
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=TECH110
//S EXEC PGM=IEFBR14
//MODEL DD DSN=MODEL.DSCB,DISP=(NEW,CATLG),
// UNIT=3390,VOL=SER=SMSSM1,SPACE=(CYL,(0,0)),
// MGMTCLAS=NOACTION,STORCLAS=SCSTNRDG,DATACLAS=DATAIN
