//POLLT320 JOB (5304010530000000,,,STEP),'TECH.JEFF.KAPLAN',
// CLASS=H,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=JEFFK,REGION=6M
//S EXEC PGM=POLLDOWN,DPRTY=(15,15)
//STEPLIB DD DSN=SYS1.TECH.LPALIB,DISP=SHR
//        DD DSN=SYS3.XCOMM.LOAD,DISP=SHR
//SYSUDUMP DD SYSOUT=*
//REPORT   DD SYSOUT=*
//DMASTER DD DISP=SHR,DSN=FNCL.N.SDD.POLL.PPM320,FREE=CLOSE
//EMASTER DD DISP=SHR,DSN=FNCL.N.SDD.POLL.E0320,FREE=CLOSE
//BREAKER DD DSN=JEFFK.POLL.OUTPUT(+1),DISP=(NEW,CATLG,DELETE),
// UNIT=3390,VOL=SER=SYSDA5,SPACE=(CYL,(200,50,500),RLSE),
// FREE=CLOSE,
// DCB=(SYS1.LINKLIB,DSORG=PO,RECFM=VB,BLKSIZE=32760,LRECL=32756)
//SYSIN01 DD DSN=JEFFK.TSO1.PDS(XCOMMDIR),DISP=SHR
