//TECH110F JOB (530000000000),'TECH.JEFF.KAPLAN',
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=TECH110
//DEF EXEC PGM=IDCAMS,REGION=8M
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DELETE TECH110.IPCSDDIR.CLUSTER CLUSTER
  SET MAXCC=0
  DEF CL(NAME(TECH110.IPCSDDIR.CLUSTER) -
     CYLINDERS(1 1) KEYS(128 0) -
     CONTROLINTERVALSIZE(4096) RECORDSIZE(384 3072))
/*
// IF RC = 0 THEN
//IPCSINIT EXEC PGM=IKJEFT01,REGION=8M
//SYSTSPRT DD SYSOUT=*
//SYSPROC DD DSN=SYSS.IPCS.V4R2M0.SBLSCLI0,DISP=SHR
//SYSTSIN DD *
  IPCS NOPARM
  IPCSDDIR 'TECH110.IPCSDDIR.CLUSTER'
  END
/*
// ENDIF
// IF RC = 0 THEN
//IPCSINIT EXEC PGM=IKJEFT01,REGION=8M
//SYSTSPRT DD SYSOUT=*
//SYSPROC DD DSN=SYSS.IPCS.V4R2M0.SBLSCLI0,DISP=SHR
//IPCSDDIR DD DSN=TECH110.IPCSDDIR.CLUSTER,DISP=SHR
//DUMP DD DSN=SYS1.DUMP01,DISP=SHR
//SYSTSIN DD *
  IPCS NOPARM
  SETDEF DDNAME(DUMP) NOCONFIRM
  SUMMARY
  LPAMAP
  VERBEXIT DAEDATA
  VERBEXIT LOGDATA
  VERBEXIT MMSDATA
  VERBEXIT MTRACE
  VERBEXIT SUMDUMP
  VERBEXIT TRACE
  LIST (0:7FFFFFFF)
  END
/*
// ENDIF
