//JEFFKZ   JOB (5304010530000000,,,STEP),'TECH.JEFF.KAPLAN',
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=JEFFK,REGION=6M
//**** THE OUTPUT SYSUT2 DCB PARAM MUST MATCH THE INPUT SYSUT1 */
//S EXEC PGM=PDSTOSEQ
//SYSUDUMP DD SYSOUT=*
//SYSUT1 DD DSN=MDC23.N.DATA,DISP=SHR
//SYSUT2 DD DSN=JEFFK.MDC23.N.DATA,DISP=(NEW,CATLG,DELETE),
// UNIT=3390,VOL=SER=SYSDA5,SPACE=(CYL,(1,1)),
// DCB=(MDC23.N.DATA,DSORG=PS)
