//TECH110L JOB (530000000000),'TECH.JEFF.KAPLAN',PRTY=15,
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=TECH110
//S EXEC PGM=ERBRMFPP,REGION=8M
//MFPINPUT DD DSN=TECH110.RMF72,DISP=SHR,DCB=BUFNO=63
//SYSIN DD *
 REPORTS(WKLD(GROUP))
 DINTV(9959)
 SYSOUT(G)
/* END
//
