//TECH110X JOB (530000000000),'TECH.JEFF.KAPLAN',
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=TECH110
/*JOBPARM S=SYSB
//STEP1 EXEC PGM=FDRABRP,REGION=8M
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//ABRMAP   DD DSN=TECH110.DASD.VTOCSUM,DISP=SHR
//ABRSUM   DD DSN=TECH110.DASD.APPLSUM,DISP=SHR
//SYSIN DD *
 P VTOC,SUMPFX=YES,COMBINE,DETAIL=NO,FORMAT=CRT,SUM=YES,
    ONLINE
/*
//STEP2 EXEC PGM=FDRABRP,REGION=8M
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//ABRMAP   DD DSN=TECH110.DASD.VTOCSYSD,DISP=SHR
//ABRSUM   DD DSN=TECH110.DASD.APPLSYSD,DISP=SHR
//SYSIN DD *
 P VTOC,SUMPFX=YES,COMBINE,DETAIL=NO,FORMAT=CRT,SUM=YES,
    VOLG=SYSDA
/*
//
