//TECH110A JOB (530000000000),'JEFFK TECH SUPPT',CLASS=S,
//         MSGCLASS=G,NOTIFY=TECH110
// JCLLIB ORDER=TECH110.USER.CNTLLIB
//STDSYM INCLUDE MEMBER=STDSYM
//STEP1 EXEC PROC=TESTPROC,SYS='TECH110.',MERC='USER2',
//   EZ0='CNTLLIB'
//
