//TECH110A JOB 530401053000000,'TECH.SUPPORT.DB2',
//           CLASS=S,MSGCLASS=G,NOTIFY=TECH110
//UTIL EXEC DSNUTILB,PARM='DSNB,UIDX'
/*JOBPARM S=SYSB
//SYSREC   DD DUMMY,DISP=OLD
//SYSDISC  DD DSN=TECH110.NOTLOAD,
//     DISP=(MOD,CATLG)
//SYSUT1   DD DSN=TECH110.SYSUT1,
//     DISP=(MOD,DELETE,CATLG),
//     SPACE=(16384,(20,20),,,ROUND),
//     UNIT=SYSDA
//SORTOUT  DD DSN=TECH110.SORTOUT,
//     DISP=(MOD,DELETE,CATLG),
//     SPACE=(16384,(20,20),,,ROUND),
//     UNIT=SYSDA
//SYSERR   DD DSN=TECH110.SYSERR,
//     DISP=(MOD,DELETE,CATLG),
//     SPACE=(16384,(20,20),,,ROUND),
//     UNIT=SYSDA
//UTPRINT  DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//DSNUPROC.SYSMAP DD DSN=TECH110.SYSMAP,
//     DISP=(MOD,DELETE,CATLG),
//     SPACE=(16384,(20,20),,,ROUND),
//     UNIT=SYSDA
//SYSIN    DD *
  LOAD DATA INDDN(SYSREC) RESUME(NO) REPLACE LOG(NO)
  INTO TABLE TECH110.PLAN_TABLE
