//TECH110Z JOB 530401053000000,'TECH.SUPPORT.DB2',
//           CLASS=S,MSGCLASS=G,NOTIFY=TECH110,MSGLEVEL=(1,1)
//UTIL EXEC DSNUPROC,SYSTEM=DSNA,UID='TEMPA',UTPROC=''
/*JOBPARM S=SYSA
//**********************************************
//* LOAD UTILITY
//SYSUDUMP DD SYSOUT=*
//**********************************************
//DSNUPROC.SYSREC DD DSN=TECH110.USER.SMFCPU,
//     DISP=SHR
//*
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,
//     DISP=(NEW,DELETE),
//     SPACE=(CYL,(5,5)),
//     UNIT=VIO
//*
//DSNUPROC.SORTOUT DD DSN=&&SORTOUT,
//     DISP=(NEW,DELETE),
//     SPACE=(CYL,(5,5)),
//     UNIT=VIO
//DSNUPROC.SYSERR DD SYSOUT=*
//DSNUPROC.SYSMAP DD SYSOUT=*
//*
//DSNUPROC.SYSIN    DD *
  LOAD DATA INDDN(SYSREC) RESUME(NO) REPLACE LOG(NO)
  INTO TABLE BUILD.TRMFCPU
  (INTVDATE         POSITION (001:010) DATE EXTERNAL(10),
   INTVTIME         POSITION (011:012) CHAR,
   SYSID            POSITION (013:016) CHAR,
   CPUWAIT          POSITION (017:020) INTEGER,
   CPUID            POSITION (021:022) CHAR)
//
