//JEFFKZ   JOB (530000000000),'TECH.JEFF.KAPLAN',
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=JEFFK,REGION=6M
//S EXEC PGM=VSMRESET
//* RESET TO EMPTY A REUSABLE VSAM CLUSTER
//STEPLIB DD DSN=TD.TEST1.BATCH.LOADLIB,DISP=SHR
//VSMRESET DD DSN=YOURCLUSTERNAMEHERE,DISP=OLD
