//AIMS31A7 JOB 'IMSGROUP  SH28205610*110A044         999  3000003037',
//  REGION=996K,TIME=5,MSGLEVEL=1,MSGCLASS=H,NOTIFY=$A1016
//*MAIN ORG=RMP01,CLASS=L5
//AOS70     EXEC IMSUPDTE,SMEMBER=DFSAOS70,LMEMBER=XXXXXXXX,
//             PRELIB='SYS1.MACLIB',
//             AUXLIB='SYS1.MODGEN',
//             SYSLMOD=TEMP,
//             P=IMA,LOAD='PVT.MODS',RE=RENT,DISPR=SHR,
//  DECK='NODECK,SYSPARM(S)',
//*CONDL=0,
//  SYMI=SOURCESV,SYMO=SOURCESV,RECORD=NO,ACCT=1,SOUT='*'
//SYSIN  DD *
./DFSAOS70 CHANGE NAME=DFSAOS70
    SPACE 3        FORCE ASSEMBLY.
