//AIMS22IV JOB 'IMSGROUP  SH28205610*110A044         015  1001007037',
//  MSGLEVEL=1,MSGCLASS=H,
//  REGION=1024K,TIME=010,
//  NOTIFY=$A1016
//*MAIN ORG=LOCAL,CLASS=L
//****************************
//DFSIINV0 EXEC IMSUPDTE,P=IMA,DISPR=SHR,
//   SYMI=SOURCETM,SYMO=SOURCETM,
//   SMEMBER=DFSIINV0,LMEMBER=DFSIINVG,
//   RE='RENT,REFR',
//   LOAD='PVT.MODS',
//   SOUT='*',
//   CONDL=0,
//   OSLIBS=AMVSXA,
//   ACCT=0
//U.SYSINA DD  *
./ CHANGE   NAME=DFSIINV0
*              ASSEMBLE.
