         MACRO
         DO    &MODNAME
         GBLA  &GDOCNT,&GDOLVL,&GIFLVL,&GDOSTK(16),&GDOIFST(16)
         GBLC  &GLREG
         LCLC  &LBLYSS
.*
         AIF   ('&MODNAME' EQ '').ERR01
         AIF   ('&MODNAME' NE 'BELOW').ERR01
         AGO   .OK
.ERR01   MNOTE 12,'YS000030-PARAMETER NOT SPECIFIED OR INVALID'
         MEXIT
.*
.OK      ANOP
         SEQCK DO
.*
&GDOCNT  SETA  &GDOCNT+3
&GDOLVL  SETA  &GDOLVL+1
&GDOSTK(&GDOLVL) SETA &GDOCNT
&GDOIFST(&GDOLVL) SETA &GIFLVL
.*
         SPACE
.*
&GDOCNT  SETA  &GDOCNT-1
.*
&LBLYSS  SETC  'ZLDO&GDOCNT'
&LBLYSS  DS    0H                                LOOP START
.*
&GDOCNT  SETA  &GDOCNT+1
         SPACE
.*
         MEND
