++USERMOD(???????)    /*
*****************************************************************
*  ZAP TO ALLOW CHECKPOINT RESTART PROCESSING ON SHARED DASD    *
*  ON OS/390 1.2 - DFSMS 1.3.0                                  *
***************************************************************** */ .
++VER(Z038) FMID(HDZ11C0) .
++ZAP(IHJACP00).
 NAME IGC0006C IGC0006C
 VER 09F2 9120,5011
 VER 09F6 47E0,BAD6
 VER 09FC 47F0,BA08
 REP 09F6 47F0,BAD6

++USERMOD(???????)    /*
*****************************************************************
*  ZAP TO ALLOW CHECKPOINT RESTART PROCESSING ON SHARED DASD    *
*  ON OS/390 2.6 - DFSMS 1.4.0                                  *
***************************************************************** */ .
++VER(Z038) FMID(HDZ11D0) .
++ZAP(IHJACP00).
 NAME IGC0006C IGC0006C
 VER 09F2 9120,5011
 VER 09F6 47E0,BAD6
 VER 09FC 47F0,BA08
 REP 09F6 47F0,BAD6
