//----------------- JOB CARD HERE ------------------------
//*
//* ASMLK PGM W/OUT SMPE (NAME=TSOSPA)
//*
//* ASSEMBLE AND LINK USING PDS INPUT
//ASMLK  PROC  AREGION=2M,
//             LREGION=2M,
//             UNIT='SYSDA',
//             CLASS='*',
//             SYSLIB1='SYS1.MODGEN',
//             SYSLIB2='SYS1.AMODGEN',
//             SYSLIB3='SYS1.MACLIB',
//             SRCLIB=TEMPNAME,
//             LODLIB=TEMPNAME,
//             RENT='NO',  /* ENTER RENT=NO FOR NON REENTRANT */
//             SRCMOD='TEMPNAME',
//             LODMOD='TEMPNAME'
//*
//ASM    EXEC  PGM=IEV90,PARM='NODECK,OBJECT,&RENT.RENT',
//             REGION=&AREGION
//SYSLIB   DD  DSN=&SYSLIB1.,DISP=SHR
//         DD  DSN=&SYSLIB2.,DISP=SHR
//         DD  DSN=&SYSLIB3.,DISP=SHR
//SYSIN    DD  DSN=&SRCLIB.(&SRCMOD.),DISP=SHR
//SYSUT1   DD  UNIT=(&UNIT.,SEP=SYSLIB),SPACE=(CYL,(10,5)),DSN=&SYSUT1
//SYSPUNCH DD  DUMMY
//SYSPRINT DD SYSOUT=&CLASS.,DCB=(BLKSIZE=3509),UNIT=(,SEP=(SYSUT1))
//SYSLIN   DD  DISP=(,PASS),UNIT=SYSDA,SPACE=(CYL,(5,5,0)),
//             DCB=(BLKSIZE=400),DSN=&&LOADSET
//*
//LNK  EXEC  PGM=IEWL,
//  PARM='MAP,LET,LIST,NCAL,&RENT.RENT,AMODE=24,RMODE=24',
//             REGION=&LREGION.,COND=(0,LT,ASM)
//SYSLIN   DD  DSN=&&LOADSET,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSN=&LODLIB.(&LODMOD.),DISP=SHR
//SYSUT1   DD  UNIT=&UNIT.,SPACE=(CYL,(3,2)),DSN=&SYSUT1
//SYSPRINT DD  SYSOUT=&CLASS.,DCB=(RECFM=FB,BLKSIZE=3509)
// PEND
//*
//STEP1 EXEC ASMLK,CLASS='*',
//           RENT='NO',   /* ''=RENT, 'NO'=NON-RENT */
//           SRCLIB='YOUR.SORCLIB', <=== CHANGE
//           LODLIB='YOUR.LOADLIB', <=== CHANGE
//           SRCMOD=TSOSPA,
//           LODMOD=TSOSPA
//*-------------------------------------
//LNK.SYSIN  DD *
  INCLUDE PRODLIB(ASMPARSE)
  NAME TSOSPA(R)
/*
//PRODLIB  DD DSN=YOUR.LOADLIB,DISP=SHR <=== CHANGE
