         MACRO
         PLIONCB
ONCB     DSECT ,                  PL/I ONCB MAPPING
         SPACE
LSCD     DS    XL1                PL/I CONDITION ID
LSFG     DS    XL1                PL/I ON UNIT FLAGS
LSF2     EQU   X'20'              ON UNIT IS A GOTO
         DS    XL2
LSTR     DS    A                  ADDR OF ON-UNIT OR LABEL
         MEND
