//E0115DMS JOB EDPCSBS1,'PGM',MSGCLASS=X,CLASS=A,NOTIFY=ED115DM
//*
//SAS     EXEC SAS,OPTIONS=NODATE
//SMFTAPE DD DSN=C4H1.PROD.SMFDUMPW,DISP=SHR
//        DD DSN=C4H1.PROD.SMFDUMPW.HOLD,DISP=SHR
//SYSIN   DD *
TITLE SASMF4;
  DATA STEPS;
  KEEP TYPE TIMEOUT JOBNAME PROGNAME CPUTIME ;
  INFILE SMFTAPE;
  INPUT @1
           SMFXXFLG PIB1. TYPE PIB1. TIMEOUT SMFSTAMP8.
        SMFXXSID $CHAR4. @;
  IF TYPE = 4;
  INPUT JOBNAME  $CHAR8.     JOBSTART  SMFSTAMP8.   SMF04UIF $CHAR8.
        SMF04STN PIB1.
        TIMEIN   SMFSTAMP8.  SMF04NCI  PIB4.        CCODE    PIB2.
        SMF4PRTY PIB1.       PROGNAME  $CHAR8.      SMF4STMN $CHAR8.
        SMF4RSH0 PIB2.       SMF4SYST  PIB2.        SMF4HOST PIB2.
        SMF4RV1  PIB6.       SMF4SPK   PIB1.        SMF4STI  PIB1.
        SMF4RV2  PIB2.       SMF4AST   PIB4.        SMF4PPST PIB4.
        SMF4RV3  PIB1.       SMF4SRBT  PIB3.        SMF4RIN  PIB2.
        COLREL   PIB2.       DEVLEN    PIB2. @;
 N = (DEVLEN -2)/8;
        INPUT @107+DEVLEN SMF4LNTH PIB1.  @;
   IF SMF4LNTH > 0 THEN DO;
        INPUT      CPUTIME  PIB3.2 SMF4NAF PIB1.  @;
   END;
        OFF = COLREL   +5 ;
INPUT @OFF PAGEIN   PIB4.    PAGEOUT  PIB4. @ ;
ELAPSED = TIMEOUT - TIMEIN;
HOUR = MOD(INT(TIMEOUT/3600),24);
FORMAT TIMEOUT DATETIME. ;

PROC SORT  DATA=STEPS; BY PROGNAME JOBNAME ;
DATA FRED (KEEP = PGM JBN C    );
RETAIN JBN '       ';
RETAIN PGM '        ';
RETAIN C 0;
SET ;
CJOB = SUBSTR(JOBNAME,1,7);
IF          (CJOB = JBN) THEN DO;
                          C+1;
                          DELETE;
                          END;
IF          _N_ = 1       THEN DO;
                          C+1;
                          JBN = CJOB;
                          PGM = PROGNAME ;
                          DELETE;
                          END;
OUTPUT;
JBN = CJOB;
PGM = PROGNAME ;
C = 1;
DELETE;
PROC PRINT;
PROC CHART;
      HBAR PGM;
