//C4SYSDMS JOB EDPCSBS1,'SASD',MSGCLASS=X,CLASS=1,NOTIFY=ED115DM
//*
//SAS     EXEC VSAS,OPTIONS=NODATE
//DATLIB  DD DSN=SYS1.MAN1,DISP=SHR
//*ATLIB  DD DSN=C4H1.PROD.SMF1285,DISP=SHR
//*ATLIB  DD DSN=C4H1.PROD.SMFHIST(0),DISP=SHR
//*ATLIB  DD DSN=C4H1.PROD.SMF0885,DISP=SHR
//*       DD DSN=C4H1.PROD.SMFDUMPW,DISP=SHR
//SYSIN   DD *
TITLE SMF 15;
  DATA W (KEEP = TIMEOUT SMF15JBN JFCB1)
  ;
  RETAIN V;
  INFILE DATLIB JFCB=JF MISSOVER;
  IF _N_ = 1 THEN DO;
                  INPUT @;
                  IF INDEX(JF,'SYS1.MAN') ¬=0 THEN V=4; ELSE V=0;
                  END;
  IF V=4 THEN
      INPUT    SMFXXLEN PIB2. SMFXXSEG PIB2. @ ;
  INPUT    SMFXXFLG PIB1. SMFXXRTY PIB1.
                       @;
  IF SMFXXRTY = 212 THEN DO;
                        *PUT '212 DETECTED - SKIPPING';
                         DELETE;
                         END;
  INPUT    TIMEOUT SMFSTAMP8.
      SMFXXSID $CHAR4. @;
  IF SMFXXRTY = 15;
  INPUT SMF15JBN $CHAR8.  SMF15RST PIB4.  SMF15RSD PD4.
        SMF15UID $CHAR8.  SMF15RIN PIB2.  SMF15SDC PIB1.
        SMF15NUC PIB1.    SMF15SUC PIB1.  SMF15SET PIB1.
        SMF15OPN PIB4. @;
  INPUT SMFTIOE1 PIB1.    SMFTIOE2 PIB1.  SMFTIOE3 PIB1.
        SMFTIOE4 PIB1.    SMFTIOE5 $CHAR8. SMFTIOE6 PIB1.
        SMFTIOE7 PIB1.
        @ ;
  INPUT SMFJFCB1 $176. @ ;
  INPUT SMFDCBOR PIB2.   SMFDCBRF PIB1.   SMFDCBMF PIB2.
        SMFDCBFL PIB1.   SMFDCBOP PIB1.   SMF15RV2 PIB1.
        SMFDEBFL PIB1.   SMFDEBOP PIB1.   SMFDEBVL PIB2.
        @ ;
JFCB1 = SUBSTR(SMFJFCB1,1,44);
TIM = TIMEPART(TIMEOUT);
IF TIM     > '00:00'T;
IF TIM     < '23:59'T;
IF SMF15JBN = 'C4C1P0X7';
RETURN;
PROC PRINT;
FORMAT TIMEOUT DATETIME.;
