//ED115DMH JOB EDPCSBS1,MSGCLASS=X,CLASS=L,REGION=4M,NOTIFY=ED115DM
// EXEC EDMXGSAS
//SMF    DD DSN=EDH1.PROD.SMFDUMPW.HOLD,DISP=OLD
//*MF    DD DSN=SYS1.MAN1,DISP=SHR
//SMD    DD DISP=OLD,DSN=EDH1.PROD.DISASTER
//SYSIN DD DISP=SHR,DSN=EDS1.PROD.MXG1111.SOURCLIB(VMXGFOR)
//      DD DISP=SHR,DSN=EDS1.PROD.MXG1111.SOURCLIB(TYPE1415)
//      DD *
DATA SMD.DS (KEEP = DDNAME DISP DSNAME DSORG JOB);
SET;
IF DISP = 'NEW' THEN DELETE;
IF SUBSTR(DSNAME,1,5) = 'SYS94' THEN DELETE;
IF SUBSTR(DSNAME,1,9) = 'EDH2.HMIG' THEN DELETE;
IF SUBSTR(VOLSER,1,2) = 'C4';
I = INDEX(DSNAME,'.');
IF I < 6
OR SUBSTR(DSNAME,1,8) = 'CATINDEX'
OR SUBSTR(DSNAME,1,6) = 'EDBBOP'
;
RETURN;
PROC SORT NODUP; BY JOB DSNAME;
PROC PRINT;
