//ED115DMA JOB C4ADM000,MSGCLASS=X,CLASS=J,REGION=4M,NOTIFY=C4ADMDM
//*MAIN PROC=C4
// EXEC EDMXGSAS
//SMF    DD DSN=C4H1.PROD.SMFDUMPW,DISP=SHR
//*MF    DD DSN=SYS1.MAN1,DISP=SHR
//*MF    DD DSN=EDH1.PROD.C4#3.SMFDAILY.COPY1,DISP=SHR
//SYSIN DD DISP=SHR,DSN=C4S2.PROD.MXG.SOURCLIB(TYPEACF2)
//      DD *
PROC PRINT DATA=ACF2AR;
PROC PRINT DATA=ACF2CR;
PROC PRINT DATA=ACF2DR;
PROC PRINT DATA=ACF2ER;
PROC PRINT DATA=ACF2JR;
PROC PRINT DATA=ACF2JRL;
PROC PRINT DATA=ACF2NRA;
PROC PRINT DATA=ACF2NRB;
PROC PRINT DATA=ACF2PR;
PROC PRINT DATA=ACF2TR;
PROC PRINT DATA=ACF2VR;
