//E0115DMS JOB EDPCSBS1,MSGCLASS=X,CLASS=2,NOTIFY=ED115DM
//*
//SAS     EXEC SAS606,OPTIONS=NODATE
//*ATLIB  DD DSN=EDH1.PROD.SMFDUMPW,DISP=SHR
//DATLIB  DD DSN=SYS1.MAN1,DISP=SHR
//SYSIN   DD *
TITLE SMF 50;
  DATA;
  DROP V SMFXXLEN SMFXXSEG SMFXXFLG SMFXXRTY;
  RETAIN V;
  INFILE DATLIB JFCB=JF;  * MISSOVER;
  IF _N_ = 1 THEN DO;
                  INPUT @;
                  IF INDEX(JF,'SYS1.MAN') ¬=0 THEN V=4; ELSE V=0;
                  END;
  IF V=4 THEN
      INPUT    SMFXXLEN PIB2. SMFXXSEG PIB2. @ ;
  INPUT    SMFXXFLG PIB1. SMFXXRTY PIB1.
                       @;
  IF SMFXXRTY = 212 THEN DO;
                        *PUT '212 DETECTED - SKIPPING';
                         DELETE;
                         END;
  INPUT    TIMEOUT SMFSTAMP8.
      SMFXXSID $CHAR4. @;
  IF SMFXXRTY = 50;
  INPUT SMF50NME $CHAR8. SMF50DLR PIB4.    SMF50CWR PIB4.
        SMF50CRD   PIB4. SMF50ATN PIB4.    SMF50ATR PIB4.
        SMF50PUI   PIB4. SMF50PUO PIB4.    SMF50BUF PIB4.
        SMF50SLD   PIB4.
   @ ;
RETURN;
PROC PRINT;
FORMAT TIMEOUT DATETIME.;
