//C4SYSDMS JOB EDPCSBS1,'SMF60',MSGCLASS=X,CLASS=L,NOTIFY=ED115DM
//*
//SAS     EXEC SAS,OPTIONS=NODATE
//*ATLIB  DD DSN=C4H1.PROD.SMFDUMPW.HOLD,DISP=SHR
//*       DD DSN=C4H1.PROD.SMFDUMPW,DISP=SHR
//DATLIB  DD DSN=SYS1.MAN4,DISP=SHR
//*ATLIB  DD DSN=C4H1.PROD.C4#1.SMFDAILY.COPY1,DISP=OLD,UNIT=CART,
//* VOL=SER=(600658,603061)
//SYSIN   DD *
TITLE SMF 60;
  DATA  INIT (KEEP =   TIMEOUT SMFXXSID
        SMF60SBS       SMF60SUB
        SMF60POF       SMF60PLN       SMF60PNO
        SMF60DOF       SMF60DLN       SMF60DNO )
      PROD (KEEP = SMF60VER
                   SMF60PNM )
      DAT  (KEEP = SMF60JNM
                   SMF60DT
                   SMF60UID
                   SMF60FNC
                   SMF60CNM )
        ;
  RETAIN V;
  INFILE DATLIB      JFCB=JF MISSOVER;
  IF _N_ = 1 THEN DO;
                  INPUT @;
                  IF INDEX(JF,'SYS1.MAN') ¬=0 THEN V=4; ELSE V=0;
                  END;
  IF V=4 THEN
      INPUT    SMFXXLEN PIB2. SMFXXSEG PIB2. @ ;
  INPUT    SMFXXFLG PIB1. SMFXXRTY PIB1.
                       @;
  IF SMFXXRTY = 212 THEN DO;
                        *PUT '212 DETECTED - SKIPPING';
                         DELETE;
                         END;
  INPUT    TIMEOUT SMFSTAMP8.
      SMFXXSID $CHAR4. @;
  IF SMFXXRTY = 60;
  INPUT SMF60SBS PIB4. SMF60SUB $CHAR2.
        SMF60POF PIB4. SMF60PLN PIB2. SMF60PNO PIB2.
        SMF60DOF PIB4. SMF60DLN PIB2. SMF60DNO PIB2.  @;
   IF SMF60PNO > 0 THEN DO;
      DO I = 0 TO (SMF60PNO - 1);
        OFF = SMF60POF -3+V + I*SMF60PLN;
        INPUT @OFF SMF60VER   $CHAR2.
                   SMF60PNM   $CHAR8.
        @ ;
      END;
   END;
   IF SMF60DNO > 0 THEN DO;
      DO I = 0 TO (SMF60DNO - 1);
        OFF = SMF60DOF -3+V + I*SMF60DLN;
        INPUT @OFF SMF60JNM   $CHAR8.
                   SMF60DT    SMFSTAMP8.
                   SMF60UID   $CHAR8.
                   SMF60FNC   PIB1.
                   SMF60CNM   $CHAR44.
        @ ;
      END;
   END;
RETURN;
PROC PRINT DATA=INIT;
FORMAT TIMEOUT DATETIME.;
PROC PRINT DATA=PROD;
FORMAT TIMEOUT DATETIME.;
PROC PRINT DATA=DAT;
FORMAT TIMEOUT DATETIME.;
FORMAT SMF60DT DATETIME.;
