//C4SYSDM8 JOB EDPCSBS1,'RMF78',MSGCLASS=X,CLASS=L,NOTIFY=ED115DM
//** ESA FORMAT
//** ARRAYS :  BELOW 16 MB = 20 BYTES (5*4)
//** VSDBMIN   MIN VALUE FOR BELOW 16 MB           PIB4.
//** VSDBNTIME TIME STAMP FOR MINIMUM              PIB4.
//** VSDBMAX   MAX VALUE FOR BELOW 16 MB           PIB4.
//** VSDBXTME  TIME STAMP FOR MAXIMUM              PIB4.
//** VSDBTOTL  TOTAL FOR ALL SAMPLES BELOW 16 MB   PIB4.
//** ARRAYS :  ABOVE 16 MB = 20 BYTES (5*4)
//**           MIN VALUE FOR ABOVE 16 MB
//**           TIME STAMP FOR MINIMUM
//**           MAX VALUE FOR ABOVE 16 MB
//**           TIME STAMP FOR MAXIMUM
//**           TOTAL FOR ALL SAMPLES ABOVE 16 MB
//*
//SAS     EXEC EDSAS608,OPTIONS=NODATE
//*AS.WORK   DD UNIT=SYSDA,SPACE=(CYL,(100,9),,,ROUND)
//*ATLIB  DD DSN=ED115DM.PROD.SMFDUMPW,DISP=SHR,DCB=(BUFNO=15)
//DATLIB  DD DSN=SYS1.MAN4,DISP=SHR
//SYSIN   DD *
TITLE 'SMF 78';
DATA T78 (KEEP = TIMEOUT SMFXXSID
        SMF78SSI          SMF78STY        SMF78TRN
        SMF78RV1          SMF78PRS        SMF78PRL
        SMF78PRN          SMF78DCS        SMF78DCL
        SMF78DCN          SMF78ASS        SMF78ASL
        SMF78ASN          SMF78SPS        SMF78SPL
        SMF78SPN          SMF78QDS        SMF78QDL
        SMF78QDN
        )
     PRODUCT (KEEP = TIMEOUT
             SMF78MFV          SMF78PRD           SMF78IST
             SMF78DAT          SMF78INT           SMF78MFL
             SMF78SAM          SMF78RV2           SMF78FLA
             SMF78RLS          SMF78CYC           SMF78MVS
             SMF78IML          SMF78PRF           SMF78PTN
             SMF78SRL          SMF78IET
             )
         IOQCNTL (KEEP = TIMEOUT
             R781IDI           R781NTR
             R781CPDS          R781CPDL
             R781CPDN
             )
         IOQCONF (KEEP = TIMEOUT
               R781CPID          R781CPST
               R781CUN           R781CU1
               R781CU2           R781CU3
               R781CU4
             )
         IOQDATA (KEEP = TIMEOUT
             R781ID2           R781DST
             R781ICT           R781ABY
             R781TIS           R781SIS
             R781CUB           R781DVB
             R781QUE           R781DVB
             )
     VSCOMMON (KEEP = TIMEOUT
             R782PA             R782PS
             R782EPA            R782EPS
             R782CA             R782CS
             R782ECA            R782ECS
             R782BA             R782BS
             R782MLA            R782MLS
             R782EMLA           R782EMLS
             R782FLA            R782FLS
             R782EFLA           R782EFLS
             R782PLA            R782PLS
             R782EPLA           R782EPLS
             R782SA             R782SS
             R782ESA            R782ESS
             R782NA             R782NS
             R782ENA            R782ENS
             R782NL             R782ENL
             R782LPA1           R782ELP1
             R782MR             R782EMR
             SQA1-SQA10
             CSA1-CSA10
             CSK1-CSK90
             CSF1-CSF10
             CSL1-CSL10
             CSZ1-CSZ10
             SQF1-SQF10
             SQL1-SQL10
             SQZ1-SQZ10
             SQE1-SQE10
             K227K1-K227K50
             K228K1-K228K50
             K231K1-K231K50
             K241K1-K241K50
             K226K1-K226K5
             K239K1-K239K5
             K245K1-K245K5
             )
     PVDAT    (KEEP = TIMEOUT
    R782JOBN            R782RDTM
    R782RDDT            R782SUBI
    R782SUBN            R782STEP
    R782PGMN            R782FLGS
    R782RSV             R782SAMP
    R782REGR            R782RGAB
    R782RGAA            R782GMLB
    R782RGLA            R782URAB          R782URAA
    LSFP1-LSFP10
    LSFB1-LSFB10
    LSAL1-LSAL10
    LSPA1-LSPA10
    USFP1-USFP10
    USFB1-USFB10
    USAL1-USAL10
    USPA1-USPA10
             )
     PVSP     (KEEP = TIMEOUT R782SPN R782SPRS
                      R782SPZ1-R782SPZ5
             )
     IOQG (KEEP =
  TIMEOUT    R783GFLG           R783R1
             R783GNTR           R783GIDS
             R783GIDL           R783GIDN
             R783GSAM           R783GTSR
             R783R2             R783GTOT
             R783NXT            R783CFL
             R783R3             R783TNM
             R783TSF            R783R4
             R783TOK            R783TDT
             R783TTM
  )
          ;
  ARRAY R782SQAU(SQAI)  SQA1-SQA10;
  ARRAY R782CSAU(CSAI)  CSA1-CSA10;
  ARRAY R782CSAK(CSKI)  CSK1-CSK90;
  ARRAY R782CSAF(CSFI)  CSF1-CSF10;
  ARRAY R782CSLF(CSFI)  CSL1-CSL10;
  ARRAY R782CSAL(CSZI)  CSZ1-CSZ10;
  ARRAY R782SQAF(SQFI)  SQF1-SQF10;
  ARRAY R782SQLF(SQLI)  SQL1-SQL10;
  ARRAY R782SQAL(SQZI)  SQZ1-SQZ10;
  ARRAY R782SQEX(SQEI)  SQE1-SQE10;
  ARRAY R782227K(K227I)  K227K1-K227K50;
  ARRAY R782228K(K228I)  K228K1-K228K50;
  ARRAY R782231K(K231I)  K231K1-K231K50;
  ARRAY R782241K(K241I)  K241K1-K241K50;
  ARRAY R782226(K226I)  K226K1-K226K5;
  ARRAY R782239(K239I)  K239K1-K239K5;
  ARRAY R782245(K245I)  K245K1-K245K5;
  ARRAY R782LSFP(LSFPI)  LSFP1-LSFP10;
  ARRAY R782LSFB(LSFBI)  LSFB1-LSFB10;
  ARRAY R782LSAL(LSALI)  LSAL1-LSAL10;
  ARRAY R782LSPA(LSPAI)  LSPA1-LSPA10;
  ARRAY R782USFP(USFPI)  USFP1-USFP10;
  ARRAY R782USFB(USFBI)  USFB1-USFB10;
  ARRAY R782USAL(USALI)  USAL1-USAL10;
  ARRAY R782USPA(USPAI)  USPA1-USPA10;
  ARRAY R782SPD(SPDI)  R782SPZ1-R782SPZ5;
  RETAIN V;
  INFILE DATLIB JFCB=JF MISSOVER;
  IF _N_ = 1 THEN DO;
                  INPUT @;
                  IF INDEX(JF,'SYS1.MAN') ¬=0 THEN V=4; ELSE V=0;
                  END;
  IF V=4 THEN
      INPUT    SMFXXLEN PIB2. SMFXXSEG PIB2. @ ;
  INPUT    SMFXXFLG PIB1. SMFXXRTY PIB1.
                       @;
  IF SMFXXRTY = 212 THEN DO;
                        *PUT '212 DETECTED - SKIPPING';
                         DELETE;
                         END;
  IF SMFXXRTY = 78;
  INPUT    TIMEOUT SMFSTAMP8.
      SMFXXSID $CHAR4. @;
  INPUT SMF78SSI $CHAR4.  SMF78STY PIB2.  SMF78TRN PIB2.
        SMF78RV1 PIB2.    SMF78PRS PIB4.  SMF78PRL PIB2.
        SMF78PRN PIB2.    SMF78DCS PIB4.  SMF78DCL PIB2.
        SMF78DCN PIB2.    SMF78ASS PIB4.  SMF78ASL PIB2.
        SMF78ASN PIB2. @;
  IF SMF78STY =2 THEN DO;
        INPUT             SMF78SPS PIB4.  SMF78SPL PIB2.
        SMF78SPN PIB2. @;
                      END;
  IF SMF78STY =3 THEN DO;
        INPUT             SMF78QDS PIB4.  SMF78QDL PIB2.
        SMF78QDN PIB2. @;
                      END;
  OUTPUT T78;
  IF SMF78PRN > 0 THEN
  DO I=1 TO SMF78PRN;
  OFF = V -3 + SMF78PRS + (I-1)*SMF78PRL;
  INPUT @OFF SMF78MFV $CHAR2.  SMF78PRD $CHAR8.   SMF78IST PD4.
             SMF78DAT PD4.     SMF78INT RMFDUR.   SMF78MFL PIB2.
             SMF78SAM PIB4.    SMF78RV2 PIB2.     SMF78FLA PIB2.
             SMF78RLS $CHAR4.  SMF78CYC PD4.      SMF78MVS $CHAR8.
             SMF78IML PIB1.    SMF78PRF PIB1.     SMF78PTN PIB1.
             SMF78SRL PIB1.    SMF78IET $CHAR8.
  @;
  OUTPUT PRODUCT;
  END;
  IF SMF78STY =1 THEN DO;
  IF SMF78DCN > 0 THEN
  DO I=1 TO SMF78DCN;
  OFF = V -3 + SMF78DCS + (I-1)*SMF78DCL;
  OFFH = OFF;
  INPUT @OFF R781IDI  PIB2.    R781NTR  PIB2.
             R781CPDS PIB4.    R781CPDL PIB2.
             R781CPDN PIB2.
  @;
  OUTPUT IOQCNTL;
  IF R781CPDN > 0 THEN
      DO J=1 TO R781CPDN;
      OFF = OFFH + R781CPDS + (J-1)*R781CPDL;
      INPUT @OFF R781CPID PIB1.    R781CPST PIB1.
                 R781CUN  PIB2.    R781CU1  PIB2.
                 R781CU2  PIB2.    R781CU3  PIB2.
                 R781CU4  PIB2.
      @;
      OUTPUT IOQCONF;
      END;
  END;
  IF SMF78ASN > 0 THEN
  DO I=1 TO SMF78ASN;
  OFF = V -3 + SMF78ASS + (I-1)*SMF78ASL;
  INPUT @OFF R781ID2  PIB1.    R781DST  PIB1.
             R781ICT  PIB2.    R781ABY  PIB4.
             R781TIS  PIB4.    R781SIS  PIB4.
             R781CUB  PIB4.    R781DVB  PIB4.
             R781QUE  PIB4.    R781DVB  PIB4.
  @;
  OUTPUT IOQDATA;
  END;
                      END;
  ****************************** ; * OF =1;
  IF SMF78STY =2 THEN DO;
  IF SMF78DCN > 0 THEN
  DO I=1 TO SMF78DCN;
  OFF = V -3 + SMF78DCS + (I-1)*SMF78DCL;
  INPUT @OFF R782PA   PIB4.     R782PS   PIB4.
             R782EPA  PIB4.     R782EPS  PIB4.
             R782CA   PIB4.     R782CS   PIB4.
             R782ECA  PIB4.     R782ECS  PIB4.
             R782BA   PIB4.     R782BS   PIB4.
             R782MLA  PIB4.     R782MLS  PIB4.
             R782EMLA PIB4.     R782EMLS PIB4.
             R782FLA  PIB4.     R782FLS  PIB4.
             R782EFLA PIB4.     R782EFLS PIB4.
             R782PLA  PIB4.     R782PLS  PIB4.
             R782EPLA PIB4.     R782EPLS PIB4.
             R782SA   PIB4.     R782SS   PIB4.
             R782ESA  PIB4.     R782ESS  PIB4.
             R782NA   PIB4.     R782NS   PIB4.
             R782ENA  PIB4.     R782ENS  PIB4.
             R782NL   PIB4.     R782ENL  PIB4.
             R782LPA1 PIB4.     R782ELP1 PIB4.
             R782MR   PIB4.     R782EMR  PIB4.
  @;
           DO OVER R782SQAU;
           INPUT R782SQAU PIB4. @;
           END;
           DO OVER R782CSAU;
           INPUT R782CSAU PIB4. @;
           END;
           DO OVER R782CSAK;
           INPUT R782CSAK PIB4. @;
           END;
           DO OVER R782CSAF;
           INPUT R782CSAF PIB4. @;
           END;
           DO OVER R782CSLF;
           INPUT R782CSLF PIB4. @;
           END;
           DO OVER R782CSAL;
           INPUT R782CSAL PIB4. @;
           END;
           DO OVER R782SQAF;
           INPUT R782SQAF PIB4. @;
           END;
           DO OVER R782SQLF;
           INPUT R782SQLF PIB4. @;
           END;
           DO OVER R782SQAL;
           INPUT R782SQAL PIB4. @;
           END;
           DO OVER R782SQEX;
           INPUT R782SQEX PIB4. @;
           END;
           DO OVER R782227K;
           INPUT R782227K PIB4. @;
           END;
           DO OVER R782228K;
           INPUT R782228K PIB4. @;
           END;
           DO OVER R782231K;
           INPUT R782231K PIB4. @;
           END;
           DO OVER R782241K;
           INPUT R782241K PIB4. @;
           END;
           DO OVER R782226;
           INPUT R782226 PIB4. @;
           END;
           DO OVER R782239;
           INPUT R782239 PIB4. @;
           END;
           DO OVER R782245;
           INPUT R782245 PIB4. @;
           END;
  OUTPUT VSCOMMON;
  END;
  IF SMF78ASN > 0 THEN
  DO I=1 TO SMF78ASN;
  OFF = V -3 + SMF78ASS + (I-1)*SMF78ASL;
  INPUT @OFF
    R782JOBN $CHAR8.    R782RDTM  PIB4.
    R782RDDT PD4.       R782SUBI  PIB4.
    R782SUBN PIB2.      R782STEP  $CHAR8.
    R782PGMN $CHAR8.    R782FLGS  PIB2.
    R782RSV  PIB2.      R782SAMP  PIB4.
    R782REGR PIB4.      R782RGAB  PIB4.
    R782RGAA PIB4.      R782GMLB  PIB4.
    R782RGLA PIB4.      R782URAB  PIB4.   R782URAA  PIB4.
  @;
           DO OVER R782LSFP;
           INPUT R782LSFP PIB4. @;
           END;
           DO OVER R782LSFB;
           INPUT R782LSFB PIB4. @;
           END;
           DO OVER R782LSAL;
           INPUT R782LSAL PIB4. @;
           END;
           DO OVER R782LSPA;
           INPUT R782LSPA PIB4. @;
           END;
           DO OVER R782USFP;
           INPUT R782USFP PIB4. @;
           END;
           DO OVER R782USFB;
           INPUT R782USFB PIB4. @;
           END;
           DO OVER R782USAL;
           INPUT R782USAL PIB4. @;
           END;
           DO OVER R782USPA;
           INPUT R782USPA PIB4. @;
           END;
  OUTPUT PVDAT;
  END;
  IF SMF78SPN > 0 THEN
  DO I=1 TO SMF78SPN;
  OFF = V -3 + SMF78SPS + (I-1)*SMF78SPL;
  INPUT @OFF
      R782SPN   PIB2.     R782SPRS   PIB2.
  @;
           DO OVER R782SPD;
           INPUT R782SPD PIB4. @;
           END;
  OUTPUT PVSP;
  END;
                      END; * IF =2;
  ****************************** ;
  IF SMF78STY =3 THEN DO;
  IF SMF78QDN > 0 THEN
  DO I=1 TO SMF78QDN;
  OFF = V -3 + SMF78QDS + (I-1)*SMF78QDL;
  INPUT @OFF R783GFLG PIB1.     R783R1   PIB1.
             R783GNTR PIB2.     R783GIDS PIB4.
             R783GIDL PIB2.     R783GIDN PIB2.
             R783GSAM PIB4.     R783GTSR PIB2.
             R783R2   PIB4.     R783GTOT PIB4.
             R783NXT  PIB4.     R783CFL  PIB1.
             R783R3   PIB3.     R783TNM  $CHAR44.
             R783TSF  $CHAR2.   R783R4   PIB2.
             R783TOK  $CHAR16.  R783TDT  $CHAR8.
             R783TTM  $CHAR8.
  @ ;
  OUTPUT IOQG;
  END;
                      END;
  ****************************** ; * OF =3;
RETURN;
 PROC PRINT DATA=T78;
 FORMAT TIMEOUT DATETIME.;
 PROC PRINT DATA=PRODUCT;
 FORMAT TIMEOUT DATETIME.;
*FORMAT SMF78INT TIME.;
*PROC PRINT DATA=IOQCNTL;
*FORMAT TIMEOUT DATETIME.;
*PROC PRINT DATA=IOQCONF;
*FORMAT TIMEOUT DATETIME.;
*FORMAT R781CPID R781CPST HEX2.;
*FORMAT R781CU1 R781CU2 R781CU3 R781CU4 HEX4.;
*PROC PRINT DATA=IOQDATA;
*FORMAT TIMEOUT DATETIME.;
*PROC PRINT DATA=VSCOMMON;
*FORMAT TIMEOUT DATETIME.;
*PROC PRINT DATA=PVDAT;
*FORMAT TIMEOUT DATETIME.;
 PROC PRINT DATA=IOQG ;
 FORMAT TIMEOUT DATETIME.;
DATA X;
SET IOQCONF;
IF R781CUN=0 THEN DELETE;
IF R781CPST ¬= 0C0X THEN DELETE;
RETURN;
PROC SORT DATA=X; BY R781CU1 R781CPID;
DATA;
RETAIN N;
SET; BY R781CU1 R781CPID;
IF FIRST.R781CPID THEN N=0;
N+1;
IF  LAST.R781CPID THEN OUTPUT;
RETURN;
PROC PRINT;
FORMAT TIMEOUT DATETIME.;
FORMAT R781CPID R781CPST HEX2.;
FORMAT R781CU1 R781CU2 R781CU3 R781CU4 HEX4.;
PROC SORT DATA=X; BY R781CPID R781CU1;
DATA;
RETAIN N;
SET; BY R781CPID R781CU1;
IF FIRST.R781CU1 THEN N=0;
N+1;
IF  LAST.R781CU1 THEN OUTPUT;
RETURN;
PROC PRINT;
FORMAT TIMEOUT DATETIME.;
FORMAT R781CPID R781CPST HEX2.;
FORMAT R781CU1 R781CU2 R781CU3 R781CU4 HEX4.;
