//XSDMNDMA JOB MSGCLASS=X,CLASS=A,REGION=4M,NOTIFY=XSDMN
// EXEC MXGSAS
//SMF    DD DSN=XSDMN.SMFDUMPW,DISP=SHR
//SOURCLIB DD DSN=SAS.PROD.MXG.USERMOD.SOURCLIB,DISP=SHR
//         DD DSN=SAS.PROD.MXG.SOURCLIB,DISP=SHR
//LIBRARY  DD DSN=SAS.PROD.MXG.SASLIB,DISP=SHR
//WRK      DD DSN=XSDMN.WRK.SAS,DISP=OLD
//SYSIN DD DISP=SHR,DSN=SAS.PROD.MXG.SOURCLIB(TYPE74)
//      DD *
DATA WRK.TYPE74; SET TYPE74; RETURN;
PROC PRINT DATA=TYPE74;
