)ATTR
 ¬ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) HILITE(REVERSE)
 @ TYPE(TEXT) INTENS(HIGH) COLOR(PINK)
 # TYPE(TEXT) INTENS(LOW)  COLOR(TURQ)
 \ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
 ! TYPE(TEXT) INTENS(HIGH) COLOR(RED)
 $ TYPE(TEXT) INTENS(LOW)  COLOR(GREEN)
)BODY EXPAND(``)
%TUTORIAL -`-`- ZIL - COMPILATION OPTIONS -`-`- TUTORIAL
%SELECTION ===>_ZCMD                                                           +
+
 When you compile, you must specify whether you are compiling a
%function,%program+or%module.+

 A%function+is a single LISP function definition, which may be brought into a
 ZIL session via the autoloading process automatically when the function is
 referenced by name, or may be linkedited with a ZIL%program.+ The input source
 to be compiled must contain a definition for the function of that name.

 A%module+is a compiled LISP load module which is "loaded" by executing it by
 name as a function of no arguments (it will be automatically loaded via the
 autoloading process).  When this is done, all of the code in the module,
 including function definitions, variable definitions and executable
 expressions, gets loaded into the ZIL system in compiled format.  There cannot
 be a function of the same name as the name you are giving the input source as
 a module.

\ ` ` -- continued -- ` `
)INIT
)PROC
 &ZCONT = TXZILP1
)END
