//SBGOLOBU JOB (CCMVS),ASMLINK,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X,COND=(1,LT)
//*-----------------------------------------------------------------*
//*   ASSEMBLE ONE MODULE - LINK THEM ALL
//*-----------------------------------------------------------------*
//ASMIT  PROC  MEMB=XXXX,LIBR='SBGOLOB.CBT447.FILE267',
//             OBJLIB='SBGOLOB.HETUTL.OBJECT',
//             MAC1='SBGOLOB.R10.MACLIB',
//             MAC2='SBGOLOB.R10.MODGEN'
//*
//*     ASM LINKEDIT FROM SOURCE ASM
//*
//ASMH EXEC PGM=ASMA90,PARM=(OBJECT,NODECK,NOESD,NORLD)
//SYSLIB   DD DISP=SHR,DSN=&MAC1
//         DD DISP=SHR,DSN=&MAC2
//         DD DISP=SHR,DSN=&LIBR
//SYSIN    DD DISP=SHR,DSN=&LIBR.(&MEMB)
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,4)
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DISP=SHR,DSN=&OBJLIB.(&MEMB)
//   PEND
//*
//HETUTL    EXEC ASMIT,MEMB=BZINTERR
//*
//LKED   EXEC  PGM=IEWL,
//       PARM='MAP,LIST,LET'
//SYSUT1   DD  UNIT=SYSDA,SPACE=(2048,(200,20))
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DSN=CEE.SCEELKED
//SYSLMOD  DD  DISP=SHR,DSN=SBGOLOB.LOAD
//OBJECT   DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(HETUTL)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(ADLER32)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(BLKSRT)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(BZINTERR)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(BZLIB)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(COMPRESB)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(COMPRESS)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(CRCTABLE)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(CRC32)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(DECOMPR)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(DEFLATE)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(HUFFMAN)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(INFBLOCK)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(INFCODES)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(INFFAST)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(INFLATE)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(INFTREES)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(INFUTIL)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(LIB)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(MEMPOOL)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(PRINTF)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(PROFILE)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(RANDTAB)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(STACK)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(TREES)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(UNCOMPR)
//         DD  DISP=SHR,DSN=SBGOLOB.HETUTL.OBJECT(ZUTIL)
//SYSLIN   DD  *
 INCLUDE OBJECT
 SETSSI  CB447267
 SETCODE AC(1)
 NAME    HETUTL(R)
/*
