*
*  Compiled by DCC Version 1.31.00
*           on Wed Jan 10 16:23:30 2001
*

*
*
*
*  Non-Re-Entrant Data Section
*
@BZLIB06 CSECT
@DATA    DS 0D
         ENTRY bzrnums
bzrnums  DC    X'0000026B000002D00000007F000001E1' ................
         DC    X'000003A3000003300000032D000000E9' ...t...........Z
         DC    X'00000236000000F7000003D9000002D4' .......7...R...M
         DC    X'000000CD000001C60000035F000001EB' .......F........
         DC    X'000002E5000000F2000003B5000000D6' ...V...2.......O
         DC    X'000002DD0000035B0000014F000002C4' ...............D
         DC    X'0000026D0000023E000000490000028E' ................
         DC    X'000002DA000001D8000001A3000001B4' .......Q...t....
         DC    X'00000116000001F000000363000000D2' .......0.......K
         DC    X'0000018F000002A8000001E000000033' .......y........
         DC    X'0000036E000001D10000032B000000A9' .......J.......z
         DC    X'00000365000002A300000263000002B9' .......t........
         DC    X'00000363000002310000035E000002AF' ................
         DC    X'000001FB0000011B000001E200000081' ...........S...a
         DC    X'000003270000024F000002DD0000026F' ................
         DC    X'00000096000000EE0000003B0000017B' ...o............
         DC    X'000002AC0000036D00000271000000A9' ...............z
         DC    X'0000028300000069000000AA0000025F' ...c............
         DC    X'00000208000003A4000002D7000001DC' .......u...P....
         DC    X'000002B5000001A9000000AE00000287' .......z.......g
         DC    X'000000490000007A0000014F00000212' ................
         DC    X'000001BA00000355000002B7000000F9' ...............9
         DC    X'000001BD000002030000038D00000221' ................
         DC    X'000002BF000003970000036A000001DA' .......p........
         DC    X'00000372000001F40000025200000264' .......4........
         DC    X'0000028100000321000000DC000000A2' ...a...........s
         DC    X'00000333000003D80000024D00000201' .......Q........
         DC    X'000001EF0000031F000000A10000025C' ................
         DC    X'000003BE00000215000000DD00000190' ................
         DC    X'0000018200000363000002580000030E' ...b............
         DC    X'0000017E000002540000019E000000AB' ................
         DC    X'0000020400000177000002AA000001E5' ...............V
         DC    X'0000038F000001140000006200000229' ................
         DC    X'000000A3000001620000029A000003A5' ...t...........v
         DC    X'000001A8000001550000021500000366' ...y............
         DC    X'000000E3000002DA000001DB000000BA' ...T............
         DC    X'000001070000028700000219000002AE' .......g........
         DC    X'00000258000000E0000001D500000044' ...........N....
         DC    X'0000030200000397000000BE00000175' .......p........
         DC    X'000001260000033600000328000000CE' ................
         DC    X'000000B8000003AF0000031B00000180' ................
         DC    X'0000017F000001CD00000194000002F6' ...........m...6
         DC    X'0000034700000377000002CB00000043' ................
         DC    X'0000026A00000114000000CC00000396' ...............o
         DC    X'00000369000003090000025C00000230' ................
         DC    X'000003B7000000A000000242000002D2' ...............K
         DC    X'0000004F000003240000006000000199' ...............r
         DC    X'000002C9000003AC0000028C000003A6' ...I...........w
         DC    X'000003CA000001BF0000013E00000161' ................
         DC    X'0000035B000002A00000007000000311' ................
         DC    X'000002850000035F000003230000015E' ...e............
         DC    X'0000008B0000005D0000016200000063' ................
         DC    X'000003340000038C0000026100000304' ................
         DC    X'0000009A0000011200000244000000B8' ................
         DC    X'0000004F0000027200000276000002E6' ...............W
         DC    X'0000028D0000011A000002FA0000026F' ................
         DC    X'000002A8000000510000039F00000272' ...y............
         DC    X'000003150000007D0000019B00000209' ................
         DC    X'000003AA'                         ....
         DC    X'0000012C000003350000004E00000157' ................
         DC    X'000000AF00000080000000FA000000AA' ................
         DC    X'00000306000003CC00000113000003E7' ...............X
         DC    X'0000027F000001EF0000004E00000160' ................
         DC    X'0000007E00000359000003BC00000166' ................
         DC    X'0000026B000002440000007C000002E1' ................
         DC    X'00000252000002BD000002640000029D' ................
         DC    X'0000007000000086000002B60000016B' .......f........
         DC    X'000003E000000329000002E7000000A8' ...........X...y
         DC    X'000003CE000003B000000177000002EC' ................
         DC    X'0000003400000258000002EB00000282' ...............b
         DC    X'000000B60000035E0000005100000158' ................
         DC    X'00000325000003DC000002E3000001FF' ...........T....
         DC    X'0000028F0000032E0000014E000000F9' ...............9
         DC    X'0000020300000381000003BB00000298' .......a.......q
         DC    X'000003D50000028900000071000003CE' ...N...i........
         DC    X'000001CB0000037D000000E4000001B1' ...........U....
         DC    X'00000345000002290000010C0000039E' ................
         DC    X'000000F0000000660000028E000001CB' ...0............
         DC    X'00000033000002AE000002F200000326' ...........2....
         DC    X'000002F8000001ED000001930000019F' ...8.......l....
         DC    X'0000018A000002AF000002BC000003B2' ................
         DC    X'0000029E0000029000000262000002E2' ...............S
         DC    X'00000188000002F80000031F00000377' ...h...8........
         DC    X'0000028D000003D20000014100000240' .......K........
         DC    X'0000026900000272000001F60000037E' ...........6....
         DC    X'000002A7000000F3000001B8000002A8' ...x...3.......y
         DC    X'0000036F000000C20000023C00000280' .......B........
         DC    X'000002D40000039E00000038000000CC' ...M............
         DC    X'000002BC000002C300000097000001C9' .......C...p...I
         DC    X'000001C10000031D000000C300000317' ...A.......C....
         DC    X'0000022E000003B1000002A700000129' ...........x....
         DC    X'0000003B0000005700000338000002C9' ...............I
         DC    X'000002970000019C000002B500000156' ...p............
         DC    X'0000025E000000860000006C0000023B' .......f........
         DC    X'0000016C00000277000000D4000000AE' ...........M....
         DC    X'00000283000001300000014900000157' ...c............
         DC    X'00000061000001AE000002EF000001F1' ...............1
         DC    X'0000013A000003D70000017600000336' .......P........
         DC    X'000003A00000008C000000CE00000049' ................
         DC    X'00000107000003D4000002E00000036C' .......M........
         DC    X'000001DE000001AE00000131000000AA' ................
         DC    X'000002020000016C000002B40000033D' ................
         DC    X'0000005200000357000003B9000002A4' ...............u
         DC    X'000000F600000171000003CA00000126' ...6............
         DC    X'000002EE000003270000033B00000096' ...............o
         DC    X'00000316000001200000039B00000324' ................
         DC    X'0000017A000000D70000033C00000250' .......P........
         DC    X'00000119000002350000022B000002C6' ...............F
         DC    X'00000052000003800000033F00000223' ................
         DC    X'000001050000020C000001CE00000125' ................
         DC    X'000001D1000001F60000003800000295' ...J...6.......n
         DC    X'00000335000003D0000003DF00000292' ...............k
         DC    X'0000036500000389000002F6000002E9' .......i...6...Z
         DC    X'000000C1000003000000022600000260' ...A............
         DC    X'000003A50000017A0000011E000000D7' ...v...........P
         DC    X'000003D300000318000003C10000003D' ...L.......A....
         DC    X'000002B00000031900000284000003DA' ...........d....
         DC    X'00000193'                         ...l
         DC    X'0000006A0000016E0000038900000284' ...........i...d
         DC    X'0000017400000237000001D2000001B2' ...........K....
         DC    X'00000285000000D20000018500000226' ...e...K...e....
         DC    X'00000397000000870000030C00000305' ...p...g........
         DC    X'0000027B00000185000002C300000064' .......e...C....
         DC    X'00000272000003BE000000A5000001F8' ...........v...8
         DC    X'00000398000000B0000000C1000002C9' ...q.......A...I
         DC    X'0000035900000109000000CB00000032' ................
         DC    X'0000029C0000006C00000285000003DE' ...........e....
         DC    X'00000272000000C5000001FE00000165' .......E........
         DC    X'00000166000003520000035A0000016C' ................
         DC    X'000003A80000027E'                 ...y....
*
         END
