)ATTR
  @  TYPE(OUTPUT) INTENS(&HILITE)
)BODY
%-----------------Execution Display Facility (XDF) -----------------------------
 BAT, STC, TSU, OR ALL ==>_XDFCMD                               %SCROLL =>_AMT %
+CPU_XCPU+AFC_XAFC +PFR_XPFR+ASQ_XASQ+UIC_XUIC+DIO_XDIO+DMN_XDMN1 _XDMN2 _XDMN3
+  ASID   JOB    PSTEP    STEP     STATUS   MEM  WSS DP PG SWP      CPU   SIO'S
)MODEL
_Z@Z
)INIT
 .CURSOR=XDFCMD
  &AMT=PAGE
  &VARS='(XDFSEL XDFLINE)'
  .HELP=XDFHELP
)END
