/* REXX UPDTMEMB
   OBTAIN MEMBER INFORMATION ABOUT A PDS,
   UPDATE A MEMBER IN THAT PDS NAMED ##INFO
   WITH THAT INFORMATION.
   1 PARAMETER REQUIRED TO BE ENTERED ON THE COMMAND LINE:
   PDS
   IF IT IS NOT ENTERED ON THE COMMAND LINE,
   THE PROGRAM WILL ASK FOR IT.
*/

ARG PDS .
DEBUG = "NO"                    /* YES OR NO */

IF PDS = "" THEN CALL GET_INPUT  /* NO ARG, ASK FOR INFO */

/* INITIALIZE VARIABLES */
MEMBER_NAME = "##INFO"

/* VERIFY PDS */
RET_CODE = LISTDSI(PDS)
IF RET_CODE <> 0 THEN SIGNAL BAD_DSN

IF SYSDSORG <> "PO" THEN SIGNAL NOT_PDS

/* BUILD FULL DSN + MEMBER NAME
   LISTDSI RETURNS THE FULL NAME OF THE PDS
   IN THE RESERVED VARIABLE SYSDSNAME
*/
PDS_AND_MEMB = "'"SYSDSNAME"("##INFO")'"
IF DEBUG = "YES" THEN SAY "FULL NAME IS " PDS_AND_MEMB

/* CAPTURE OUTPUT OF LISTDS */
CALL OUTTRAP "LINE.","*"

"LISTDS" PDS
CALL OUTTRAP "OFF"
IF DEBUG = "YES" THEN CALL DISPLAY_LINE_ARRAY

WRITE_TO_FILE:
IF DEBUG = "YES" THEN TRACE C
"ALLOCATE DDNAME(OUT) DSNAME("PDS_AND_MEMB") SHR REUSE"
IF DEBUG = "YES" THEN SAY "GOING TO WRITE " LINE.0 " RECORDS"

"EXECIO " LINE.0 "DISKW OUT (STEM LINE. FINIS)"
IF RC = 0 | RC = 1 THEN SAY "MEMBER CREATED SUCCESSFULLY"
ELSE SAY "MEMBER CREATION FAILED"
IF DEBUG = "YES" THEN SAY "RETURN CODE FROM EXECIO " RC
"FREE     DDNAME(OUT)"
RETURN

GET_INPUT:
   SAY "ENTER THE NAME OF A PDS, STANDARD TSO NAMING CONVENTIONS"
   SAY "INFORMATION ABOUT THE PDS WILL BE COLLECTED"
   SAY "AND INSERTED INTO THE PDS IN MEMBER NAME ##STATS"
   PULL PDS
   IF PDS  = "" THEN DO
      SAY "NOTHING ENTERED, ENDING"
      EXIT
      END /* NO PDS  SECOND TIME */

RETURN

DISPLAY_LINE_ARRAY:
DO I = 1 TO LINE.0
   SAY "TRAPPED LISTD" I LINE.I
END I
RETURN

BAD_DSN:
SAY "DATASET NAME ENTERED DOES NOT EXIST" PDS
EXIT

NOT_PDS:
SAY "DATASET NAME ENTERED IS NOT A PDS" PDS
EXIT

