//SBGOLOBU JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//MINUNZP  EXEC PGM=MINIUNZ,PARM='ZIPIN PDSOUT'
//STEPLIB   DD DSN=SYS1.W$$.LINKLIB,DISP=SHR
//STDOUT    DD SYSOUT=*
//ZIPIN     DD DISP=SHR,DSN=SBGOLOB.B.SISPGUI.ZIP
//* ==> zipped file (contains one/more files)
//PDSOUT    DD DISP=SHR,DSN=SBGOLOB.B.ASM.TEST
//* ==> PDS (after running it contains DATA1 and DATA2
//*          from zip job)
//SYSUT1 DD UNIT=SYSALLDA,SPACE=(CYL,300),
// DCB=(DSORG=PS,RECFM=FB,LRECL=128,BLKSIZE=6144)
//*
