//SBGOLOBT  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - *//
//*  YOU MUST ADAPT THIS JOB TO YOUR INSTALLATION'S NAMING  *//
//*   STANDARDS.  THIS JOB CREATES THE PDS'ES.  SEE THE     *//
//*   VTOCFIX.DOC PDS FOR FURTHER INSTRUCTIONS.             *//
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - *//
//TSOBATCH EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
  RECEIVE INDS('SBGOLOB.CBT479.FILE824(DOC)'
  DSN('SBGOLOB.VTOCFIX.DOC') VOL(WORK05)
  RECEIVE INDS('SBGOLOB.CBT479.FILE824(MACS)'
  DSN('SBGOLOB.VTOCFIX.FORMATS') VOL(WORK05)
  RECEIVE INDS('SBGOLOB.CBT479.FILE824(ISPPLIB)'
  DSN('SBGOLOB.VTOCFIX.ISPPLIB') VOL(WORK05)
  RECEIVE INDS('SBGOLOB.CBT479.FILE824(JCL)'
  DSN('SBGOLOB.VTOCFIX.JCL') VOL(WORK05)
  RECEIVE INDS('SBGOLOB.CBT479.FILE824(SOURCE)'
  DSN('SBGOLOB.VTOCFIX.SOURCE') VOL(WORK05)
/*
