//CLARKEZ JOB (1011,1011),CLARK1,MSGCLASS=X,NOTIFY=CLARKE
//ZAP EXEC PGM=IMASPZAP
//SYSLIB   DD  DSN=SYS2.LINKLIB,DISP=SHR
//*SYSLIB   DD  DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN DD *
* PROBLEM:   ON THE FUJITSU F4 OPERATING SYSTEM, THE EXCP COUNT IS
*            NOT COLLECTED BECAUSE THE JSCB OFFSET X'168' IS NOT
*            POINTING TO ITSELF.
*
* SYMTOMS:   SMF RECORD 4 AND 30 NOT COLLECTING EXCP COUNTS.
*
* SOLUTION:  ZAP SCHEDULER AS FOLLOWS:-
*
*** NOTE *** THIS CODE OVERWRITES VS1 CODE - DO NOT APPLY
*            THIS CODE TO A VS1 SYSTEM !!
*
 NAME $JOLMN40 $JOLMN40
 VER 019C 95F2,D11F       IS IT VS2/F4 ?
 VER 01A0 4780,B1B4       NO, MOVE OTHER JSCB.
 REP 019C D7BB,8000,8000  SET 1ST 188 BYTES TO ZEROS
 REP 01A2 D2BF,80BC,60BC  MVC 188(192,R8),188(R6) COPY OUR JSCB
 REP 01A8 5080,8168       STORE NEW JSCB ADDRESS AT OFFSET X'168'
 REP 01AC 47F0,B1C0       GO AND CLEAR DEB ADDR, RESET AUTHORIZATION
 IDRDATA EXCPFAIL
