//CLARKEZ JOB (1011,1011),CLARK1,MSGCLASS=P,NOTIFY=CLARKE
//ZAP EXEC PGM=IMASPZAP
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSIN DD *
* PROBLEM: JOL GENERATES PROTECT=YES FOR EXISTING RACF-PROTECTED
*   DATASETS. OS, OF COURSE, REFUSES TO FINISH RUNNING THEM.
*
* SOLUTION: ZAP UJG03DS AS FOLLOWS:-
*
 NAME UJG00MN UJG03DS
 BASE 0C18
 VER 12BA 4780B6B4
 VER 20C2 74AA,74AC
 VER 20C6 74AE,74B0
 VER 20CA 74B2,74B4
 VER 20CE 74B6,74B8
 VER 20D2 74BA,74BC
 VER 20D6 74BE,74C0
 VER 20DA 74C2,74C4
 VER 20DE 74C6,74C8
*
 REP 12BA   47F074AA
 REP 20C2   4780B6B4    PROTECT NOT SPECIFIED
 REP 20C6   91C08058    TEST DISP BITS
 REP 20CA   47B0B6B0    IT S USES OR OLD OR SHR
 REP 20CE   91408058    NEW?
 REP 20D2   4710B6A6    YES, GO ADD PROTECT=YES
 REP 20D6   95408061    SOMETHING ON VOLUME FIELD?
 REP 20DA   4780B6A6    NO, GO ADD PROTECT=YES
 REP 20DE   47F0B6B0    IGNORE PROTECT FOR EXISTING DAT
