//CLARKEZ JOB (1011,1011),CLARK1,MSGCLASS=X,NOTIFY=CLARKE
//ZAP EXEC PGM=IMASPZAP
//SYSLIB   DD  DSN=CLARKE.JOL40.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN DD *
* PROBLEM: EXECUTION SCHEDULER DOESN'T RECOGNISE SOME UNITS ON XA.
*AND MSP.
*
* SOLUTION: ZAP SCHEDULER AS FOLLOWS:-
*
 NAME $SCHED40 UJE00MN
 VER 0BFA C7
 VER 0C22 CD
 VER 0C27 CE
 VER 0C2C CF
 REP 0BFA 87
 REP 0C22 8D
 REP 0C27 8E
 REP 0C2C 8F
 IDRDATA XADEVNMT
