//TSCLKZ  JOB ACC,CLARKE,MSGCLASS=X,NOTIFY=TSCLK
//ZAP EXEC PGM=IMASPZAP
//SYSLIB   DD  DSN=SYS4.JOL51.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN DD *
* PROBLEM: ON MVS, COPYING THE JOL STATEMENTS TO THE JOL SYSIN
*          FILE FAILS ON OCCASSIONS.
* REASON : ??
*          - F4 SETS THE AMOUNT READ IN THE DECB, BUT MVS
*            DOES NOT.
* SOLUTION:TEMPORARILY TURN IT OFF
 NAME UJG01JOB UJG01SPL
 VER 00 47F0,F01C
 REP 00 1BFF,07FE       BRANCH BACK AFTER DOING NOTHING.
*VER 62 41F0A150
*REP 62 58F0A150
 IDRDATA S001
