//CLARKEZ JOB (1011,1011),CLARK1,MSGCLASS=X,NOTIFY=CLARKE
//ZAP EXEC PGM=IMASPZAP
//SYSLIB   DD  DSN=SYS2.LINKLIB,DISP=SHR
//*SYSLIB   DD  DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN DD *
* TURN OF RSAPF TO TEST IF THIS AFFECTS THE VSAM LOOP PROBLEM.
*
*NAME $JOLMN40 $JOLMN40
*VER 01CE 9640,F034       TURN ON RSAPF FLAG
*REP 01CE 94BF,F034       TURN IT OFF INSTEAD
*IDRDATA VSAMLUP1
 NAME $JOLMN40 $JOLMN40
 VER 01CE 94BF,F034       TURN IT OFF INSTEAD
 REP 01CE 9640,F034       TURN ON RSAPF FLAG
 IDRDATA VSAMLUP1
* TURN OF JSTCB=YES IN ATTACH ?
*
 NAME $JOLMN40 $JOLMN40
 VER 01C6 9602,F01B       ???????????????????
 REP 01C6 0700,0700       TURN OFF WHATEVER IT DOES
 IDRDATA VSAMLUP2
