//CLARKEZ JOB (1011,1011),CLARK1,MSGCLASS=X,NOTIFY=CLARKE
//ZAP EXEC PGM=IMASPZAP
//*SYSLIB   DD  DSN=SYS2.LINKLIB,DISP=SHR
//SYSLIB   DD  DSN=CLARKE.JOL35.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN DD *
* THE FOLLOWING COMMENTS APPLY TO THE TAPE SEND APPROXIMATELY AUGUST
*     1985 TO CORRECT THESE PROBLEMS. OTHER PROBLEMS WERE ALSO
*     INTRODUCED, BUT ONLY REPORTED BY FUJITSU F4 USERS.
*
* PROBLEMS SOLVED:-
*
* 1.       WHEN A DATA SET IS DELETED THEN ALLOCATED AND RECATLOGUED,
*          THE DATA SET IS DELETED AT THE END OF THE JOB.
*
* 2.       ABEND UNDER F4, AND PROBABLY MVS (NONE REPORTED THOUGH).
*
* SYMTOMS: THERE ARE THREE MAIN PROBLEMS THAT SEEM TO OCCUR.
*
* 1.       JOL SIGNALLED THAT AN ABEND OCCURRED, BUT NO DUMP WAS
*          TAKEN.
*
*          IN FACT, AN ABEND DID OCCUR, (AN 0B0), AND F4 DID NOT
*          SIGNAL THIS. WHY NO DUMP WAS TAKEN IS STILL TO BE RESOLVED.
*
* 2.       JOL PLACES DATA SETS ON THE PASSED DATA SET QUEUE MORE THAN
*          ONCE ON OCCASSIONS.
*
*          OS BECOMES CONFUSED AND DELETES THE DATA SET.
*          MVS MAY WELL DO THE SAME.
*
*    ****  NOTE THIS CAN ALSO HAPPEN WITH JCL.
*
* 3.       WHEN JOL DELETED OR KEPT A DATA SET, IT DID NOT SEARCH
*          THE PASS QUEUE FOR SECOND AND SUBSEQUENT DATA SET NAMES.
*
*
* SOLUTION: ZAP SCHEDULER AS FOLLOWS:-
*
*
* FIX1 :- REMOVE PDQ NAMES FOR KEEP
*
 NAME $SCHED35 UJE07KEE
 BASE 5248
 VER 561A 47E0,B3DC       IS IT ISAM? NO GO OUT
 REP 561A 0700,0700       NEVER GO OUT
 IDRDATA PDQKEEP
*
* FIX2 :- REMOVE PDQ NAMES FOR DELETE
*
 NAME $SCHED35 UJE08SCR
 BASE 5840
 VER 5C36 58DD,0004       PREPARE TO RETURN
 REP 5C36 58F0,B100       ADDRESS OF PASS QUEUE LOOKUP RTN
 REP 5C3A 05EF            CALL IT
 REP 5C3C 47F0,B394       BRANCH TO REMOVE FROM PDQ IF THERE
 IDRDATA PDQDEL
*
* FIX3 :- REPAIR 0B0 ABEND
*
 NAME $SCHED35 UJEISPDQ
 BASE 8128
 VER 848A 95F2,3027       '2' FOR F4/MVS?
 VER 848E 47F0,B380       ALWAYS BRANCH
 REP 848E 4770,B380       NOT A '2', THEREFORE BRANCH
 IDRDATA ABEND0B0
