//T92CVCX JOB (R777),'LONS 8TH',MSGCLASS=X,NOTIFY=T92CVC,
// CLASS=A,USER=????????,PASSWORD=????????
//*MAIN LINES=999
//ZAP EXEC PGM=IMASPZAP
//SYSLIB   DD  DSN=T41.JOLXA.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN DD *
 NAME UJP00MN UJP28SCR
 VER 0274 1B11,4310,D921
 VER 0282 4110,100C
 VER 029E 4310,D921,1801
 REP 0274 1BEE,43E0,D921
 REP 0282 41E0,E00C
 REP 029E 43E0,D921,180E
