//IBMUSERO JOB (ACCT#),SHOWMVS,
// NOTIFY=&SYSUID,
// CLASS=A,
// MSGCLASS=X,
// REGION=0M
//*  This step create the SHOWMVS output as a PDF file using
//*  a nice utility from Martin Truebner. Please create the
//*  X2P2C.LOADLIB via TSO RECEIVE IN(IBMUSER.FILE492.PDS(X2PXMIT))
//*  Download IBMUSER.X2P.SHOWMVS to you PC as binary,
//*  rename the file extension PDF and open your Adobe browser
//*  Enjoy the display (remember it's a demo)
//PDF1    EXEC PGM=SHOWMVS
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.LOAD
//         DD DISP=SHR,DSN=CEE.SCEERUN            required or Linklist
//         DD DISP=SHR,DSN=DB2.SDSNEXIT           DSNHMCID for V8
//         DD DISP=SHR,DSN=DB2.SDSNLOAD           optional
//SHOWMVS  DD DSN=IBMUSER.SHOWMVS.PRINT,
//            UNIT=SYSALLDA,SPACE=(TRK,(10,10),RLSE),
//            LRECL=123,RECFM=FBA,
//            DISP=(NEW,CATLG,DELETE)
//ABNLTERM DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//*
//PDF2    EXEC PGM=X2PMP
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.X2P2C.LOADLIB
//FORMLIB  DD DISP=SHR,DSN=IBMUSER.X2P2C.LOADLIB
//INFILE   DD DISP=SHR,DSN=IBMUSER.SHOWMVS.PRINT
//PDFOUT   DD DSN=XSSGSCH.X2P.SHOWMVS,
//            UNIT=SYSALLDA,SPACE=(TRK,(10,10),RLSE),
//            LRECL=256,RECFM=FB,  SUPERFLOUSH - JUST FOR THE RECORD
//            BLKSIZE=2560,
//            DISP=(NEW,CATLG,DELETE)
//SYSPRINT DD SYSOUT=*
//LOGFILE  DD SYSOUT=*
//INPARM   DD *
INDRV=3 OUTDRV=3 X2POPT=CMQ BKMEXIT=SHOWBKM DEFFORM='SHOWFRM /B' X2PECP=CP-037
//INPARMX  DD *
INDRV=3 OUTDRV=3 X2POPT=CMQ DEFFORM='SHOWFRM /B' BKMEXIT=SHOWBKM
