//JOBNAME  JOB (),MSGCLASS=O,NOTIFY=&SYSUID
/*JOBPARM S=*,L=999999 <== CHANGE TO SYSTEM
//*
//STEP1    EXEC PGM=ACBLIST
//STEPLIB  DD DISP=SHR,DSN=YOUR-LOAD-LIB
//* JOB FAILS ON S013 WITHOUT SYSPRINT DCB - BLKSIZE CAN BE BUMPED UP
//SYSPRINT DD SYSOUT=*,LRECL=133,BLKSIZE=1334,RECFM=VBA
//ACBLIB   DD DSN=YOUR-ACBLIB-DSN,DISP=SHR
//
