//RACFST# JOB (000000,YOUR STUFF)
//*-------------------------------------------------------------------*
//*                                                                   *
//* THIS IS THE JCL TO ASSEMBLE, LINK, AND EXEC THE RACFST CODE.      *
//*                                                                   *
//*                                                                   *
//*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*
//**
//ASM     EXEC PGM=IEV90,PARM='OBJECT,XREF(SHORT)',REGION=4M
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR,DCB=BLKSIZE=32000
//         DD  DSN=SYS1.AMODGEN,DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=VIO,SPACE=(CYL,(6,1))
//SYSPRINT DD  SYSOUT=(,)
//SYSPUNCH DD  DUMMY
//SYSLIN   DD  DSN=&&OBJSET,UNIT=SYSDA,SPACE=(3120,(200,50)),
//             DISP=(MOD,PASS)
//SYSIN    DD  DSN=THIS.LIBRARY(RACFST),DISP=SHR
//*
//LKED    EXEC PGM=IEWL,PARM=(XREF,LET,LIST,NCAL),
//             COND=(0,LT,ASM),REGION=256K
//SYSLIN   DD  DSN=&&OBJSET,DISP=(OLD,DELETE)
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=VIO,SPACE=(CYL,(3,1))
//SYSPRINT DD  SYSOUT=(,)
//SYSLMOD  DD  DSN=LINKLIB(RACFST),DISP=SHR
//* TEST RUN IT
//RACFST  EXEC PGM=RACFST,COND=(0,LT)
//STEPLIB  DD  DSN=*.LKED.SYSLMOD,DISP=SHR
//SYSOUT   DD  SYSOUT=(,)
