//@JESSMF  JOB  1
//*
//* PROGRAM TSJESSMF PRINTS CHECKPOINT PERFORMANCE STATISTICS FROM
//* SMF DATA.  IF ANY OF THE DDNAMES SUMMARY, DETAIL, WAITTIME,
//* HOLDTIME, OR DORMTIME ARE NOT PRESENT NO ERROR IS POSTED,
//* THE CORRESPONDING REPORT OR PLOT IS NOT GENERATED.
//*
//SYSA    EXEC PGM=TSJESSMF,REGION=1024K
//SYSPRINT  DD SYSOUT=*
//SUMMARY   DD SYSOUT=A
//*DETAIL    DD SYSOUT=A         IF NOT PRESENT NO DETAIL RECS PRINTED
//SMFIN     DD DSN=SYSA.SMFDUMPD(+0),DISP=OLD
//WAITTIME  DD SYSOUT=A
//HOLDTIME  DD SYSOUT=A
//DORMTIME  DD SYSOUT=A
//*
//SYSB    EXEC PGM=TSJESSMF,REGION=1024K
//SYSPRINT  DD SYSOUT=*
//SUMMARY   DD SYSOUT=A
//*DETAIL    DD SYSOUT=A         IF NOT PRESENT NO DETAIL RECS PRINTED
//SMFIN     DD DSN=SYSB.SMFDUMPD(+0),DISP=OLD
//WAITTIME  DD SYSOUT=A
//HOLDTIME  DD SYSOUT=A
//DORMTIME  DD SYSOUT=A
//
