         MACRO
         DADSMBLK &TYPE=DSECT
DADSMPRM TYPE  &TYPE
DSMPSPLN DS    0A                    SUBPOOL, BLOCK LENGTH
DSMPSP   DC    AL1(DADSMSP)          SUBPOOL
DSMPLEN  DC    AL3(0)                BLOCK LENGTH
DSMPID   DC    CL8'DADSMBLK'
DSMPNENT DC    AL2(0)                NUMBER OF ENTRIES IN TABLE
DSMPFLAG DS    0XL2                  FLAGS
DSMPFLG1 DC    X'00'                 FLAG BYTE 1:
DSMPNRST EQU   X'80'                 - DO NOT ENFORCE ANY RESTRICTIONS
DSMPNHSM EQU   X'40'                 - DO NOT ENFORCE HSM RESTRICTIONS
DSMPDBUG EQU   X'20'                 - OPERATE IN DEBUG MODE
DSMPFLG2 DC    X'00'                 FLAG BYTE 2: (RESERVED)
         DC    2A(0)                 RESERVED
DSMPSTRT EQU   *                     START OF ENTRIES
         SPACE 3
DADSMENT TYPE  &TYPE
DSMENEXT DC    A(0)                  ADDRESS OF NEXT ENTRY OR 0
DSMEVOLI DC    CL6'      '           VOLUME SERIAL NUMBER
DSMEFLAG DS    0XL2                  FLAGS
DSMEFLG1 DC    X'00'                 FLAG BYTE 1:
DSMECKPF EQU   X'80'                 DSN PREFIX RESTRICTIONS SUPPLIED
DSMEXCPF EQU   X'40'                 PREFIXES ARE EXCLUDE TYPE
DSMENTMP EQU   X'20'                 TEMPORARY DATASETS NOT ALLOWED
DSMECKUS EQU   X'10'                 RACF USERID RESTRICTIONS ENFORCED
DSMENGBL EQU   X'08'                 DO NOT PERFORM GLOBAL CHECKING
DSMEHSMP EQU   X'04'                 HSM MIG PACK - BYPASS HSM RESTR.
DSMEFLG2 DC    X'00'                 RESERVED
DSMELPFX DC    AL2(0)                TOTAL LENGTH OF PREFIX LIST
DSMENOVR DC    AL1(0)                # OF OVERRIDES SUPPLIED
DSMENPFX DC    AL1(0)                # OF PREFIX ENTRIES SUPPLIED
DSMEPLST EQU   *                     START OF PREFIX LIST
         SPACE 3
DSMPFXE  TYPE  &TYPE
DSMPFXL  DC    AL1(0)                LENGTH OF FOLLOWING PREFIX
DSMPFXC  EQU   *,,C'C'               PREFIX VALUE
DADSMSP  EQU   231                   GLOBAL, FETCH PROTECTED STG.
         MEND
