)ATTR
      + TYPE(TEXT)  INTENS(LOW)
      % TYPE(TEXT)  INTENS(HIGH)
      _ TYPE(INPUT) INTENS(HIGH)
)BODY EXPAND (//)
%-/-/ Blocksize Calculator -/-/
+
+   Enter the LRECL of the dataset being created and%optionally+the number of
+   records the dataset will contain, the block size,  and the key length.
+
+   The optimum blocksize and the space needed for the dataset will be displayed
+
+   DEVICE TYPE ==>_DEVT+     (3380 or 3390)
+
+   LRECL ========>_LRECL+
+
+
+
+   RECORDS ======>_RECORDS+
+
+   BLOCK SIZE ===>_BLK  +
+
+   KEY LENGTH ===>_KEY+
+
+Press%PF3+to exit+
+
)INIT
  &ZPRIM = NO
 .CURSOR = LRECL
  &DEVT = 3390
)PROC
  VER (&DEVT,LIST,3380,3390)
  VER (&LRECL,NONBLANK)
  VER (&LRECL,NUM)
  VER (&RECORDS,NUM)
  VER (&BLK,NUM)
  VER (&KEY,NUM)
)END
