//USZCZT0C JOB (AD00),'#04D42 ZELDEN',
//             NOTIFY=&SYSUID,
//             CLASS=M,MSGCLASS=H,MSGLEVEL=(1,1)
//*
//*
//************************************************************
//* GLOBALLY CHANGE  "INPRS1"  TO VOLID OF INPUT SYSRES #1   *
//* GLOBALLY CHANGE  "NEWRS1"  TO VOLID OF NEW SYSRES #1     *
//* GLOBALLY CHANGE  "INPRS2"  TO VOLID OF INPUT SYSRES #2   *
//* GLOBALLY CHANGE  "NEWRS2"  TO VOLID OF NEW SYSRES #2     *
//************************************************************
//*  NOTE: YOU MUST MANUALLY MOUNT OMVS.ROOT.NEWRS1          *
//*    TO THE SERVICE MOUNT POINT TO APPLY MAINTENANCE.      *
//************************************************************
//* DON'T FORGET TO REPLY "YES" TO THE FOLLOWING MESSAGE     *
//* "FDRW01 CONFIRM REQUEST TO RESTORE UNIT=CUU,VOL=NEWRS1   *
//************************************************************
//*  ===================                                     *
//*  ===>  WARNING  <===                                     *
//*  ===================                                     *
//*  CANCEL OUT OF THIS JOB AFTER MAKING CHANGES             *
//*  AND SUBMITTING IT OR IT WILL BE UNUSABLE NEXT TIME.     *
//*  ===>  WARNING  <===                                     *
//*  ALL VSAM DATASETS COPIED TO NEWRS1 WILL BE REMOVED      *
//*  DURING THIS JOBSTREAM IF THEY EXIST. YOU MUST MANUALLY  *
//*  MAKE PROVISIONS FOR COPYING/MOVING VSAM DATASETS TO     *
//*  NEWRS1 AFTER THIS JOB COMPLETES.                        *
//************************************************************
//*
//***************************************
//* VOLUME COPY OF INPRS1 TO NEWRS1     *
//***************************************
//COPY1    EXEC PGM=FDR,REGION=2M
//SYSPRINT DD  SYSOUT=*
//SYSPRIN1 DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//DISK1    DD  UNIT=SYSDA,VOL=SER=INPRS1,DISP=SHR
//TAPE1    DD  UNIT=SYSDA,VOL=SER=NEWRS1,DISP=SHR
//SYSIN    DD  *
 COPY TYPE=FDR,VOLRESET=YES
/*
//* COPY TYPE=FDR,VOLRESET=YES,CONFMESS=NO
//***************************************
//* VOLUME COPY OF INPRS2 TO NEWRS2     *
//***************************************
//COPY2    EXEC PGM=FDR,REGION=2M
//SYSPRINT DD  SYSOUT=*
//SYSPRIN1 DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//DISK1    DD  UNIT=SYSDA,VOL=SER=INPRS2,DISP=SHR
//TAPE1    DD  UNIT=SYSDA,VOL=SER=NEWRS2,DISP=SHR
//SYSIN    DD  *
 COPY TYPE=FDR,VOLRESET=YES
/*
//* COPY TYPE=FDR,VOLRESET=YES,CONFMESS=NO
//***************************************
//* COPY OF ROOT HFS FILE               *
//***************************************
//COPYHFS  EXEC PGM=FDRCOPY,REGION=4M
//SYSPRINT DD  SYSOUT=*
//SYSPRIN1 DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSIN    DD  *
 COPY     TYPE=DSF,DSNENQ=NONE,ENQERR=NO
 SELECT   CATDSN=OMVS.ROOT.INPRS1,
            NEWN=OMVS.ROOT.NEWRS1
/*
//**************************************
//* REMOVE EXISTING VSAM ZONES, DSN'S  *
//* AND VVDS IF THEY EXIST ON NEWRS1   *
//* OR NEWRS2                          *
//**************************************
//REMOVE   EXEC PGM=IDCAMS,REGION=2M,COND=(0,NE)
//NEWRS1   DD  UNIT=SYSDA,DISP=SHR,VOL=SER=NEWRS1
//NEWRS2   DD  UNIT=SYSDA,DISP=SHR,VOL=SER=NEWRS2
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 ALTER SYSICF.MASTER.ASYS FILE(NEWRS1) +
       REMOVEVOLUMES(NEWRS1)
 ALTER SYSICF.MASTER.ASYS FILE(NEWRS2) +
       REMOVEVOLUMES(NEWRS2)
/*
//**************************************
//* DEL/DEF NEW TARGET ZONE            *
//**************************************
//DEFREPRO EXEC PGM=IDCAMS,REGION=2M,COND=(0,NE)
//VDSBYPAS DD  DUMMY       /* BYPASS VAM */
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 DELETE (MVSSMPE.ZOS14.NEWRS1.CSI)
 IF LASTCC = 8 THEN SET MAXCC=0
 DEFINE CLUSTER( +
                NAME(MVSSMPE.ZOS14.NEWRS1.CSI) +
                FREESPACE(10,5) +
                KEYS(24 0) +
                RECORDSIZE(24 143) +
                SHR(2) +
                BUFSP(90000) +
                VOLUME(MVS001) +
               ) +
          DATA( +
               NAME(MVSSMPE.ZOS14.NEWRS1.CSI.DATA) +
               CYLINDERS(90 9) +
               CISZ(4096) +
              ) +
          INDEX( +
               NAME(MVSSMPE.ZOS14.NEWRS1.CSI.INDEX) +
               CYLINDERS(2 1) +
               )
 IF MAXCC = 0 THEN +
 REPRO INDATASET(MVSSMPE.ZOS14.INPRS1.CSI) +
       OUTDATASET(MVSSMPE.ZOS14.NEWRS1.CSI)
/*
//**************************************
//* DEFINE ZONES TO SMP/E AND ZONEEDIT *
//* DDDEFS TO POINT TO NEW VOLUMES.    *
//**************************************
//SMPE    EXEC SMPE,
//             COND=(0,NE)
//SMPCNTL  DD  *
 SET BOUNDARY(GLOBAL).
 UCLIN.
 DEL GLOBALZONE ZONEINDEX((NEWRS11)).
 DEL GLOBALZONE ZONEINDEX((NEWRS12)).
 DEL GLOBALZONE ZONEINDEX((NEWRS13)).
 ENDUCL.
 RESETRC.
 ZONERENAME(INPRS11)
    TO(NEWRS11)
    NEWDATASET(MVSSMPE.ZOS14.NEWRS1.CSI)
    RELATED(MVSD100).
 ZONERENAME(INPRS12)
    TO(NEWRS12)
    NEWDATASET(MVSSMPE.ZOS14.NEWRS1.CSI)
    RELATED(MVSD200).
 ZONERENAME(INPRS13)
    TO(NEWRS13)
    NEWDATASET(MVSSMPE.ZOS14.NEWRS1.CSI)
    RELATED(MVSD300).
 SET BOUNDARY(NEWRS11).
 ZONEEDIT DDDEF.
    CHANGE VOLUME(INPRS1,NEWRS1).
    CHANGE VOLUME(INPRS2,NEWRS2).
 ENDZONEEDIT.
 SET BOUNDARY(NEWRS12).
 ZONEEDIT DDDEF.
    CHANGE VOLUME(INPRS1,NEWRS1).
    CHANGE VOLUME(INPRS2,NEWRS2).
 ENDZONEEDIT.
 SET BOUNDARY(NEWRS13).
 ZONEEDIT DDDEF.
    CHANGE VOLUME(INPRS1,NEWRS1).
    CHANGE VOLUME(INPRS2,NEWRS2).
 ENDZONEEDIT.
 SET BOUNDARY(MVSD100).
 ZONEEDIT DDDEF.
    CHANGE VOLUME(INPRS1,NEWRS1).
    CHANGE VOLUME(INPRS2,NEWRS2).
 ENDZONEEDIT.
 SET BOUNDARY(MVSD200).
 ZONEEDIT DDDEF.
    CHANGE VOLUME(INPRS1,NEWRS1).
    CHANGE VOLUME(INPRS2,NEWRS2).
 ENDZONEEDIT.
 SET BOUNDARY(MVSD300).
 ZONEEDIT DDDEF.
    CHANGE VOLUME(INPRS1,NEWRS1).
    CHANGE VOLUME(INPRS2,NEWRS2).
 ENDZONEEDIT.
/*
//*
//**************************************
//* RESYNCHRONIZE THE GENERATION AND   *
//* CYCLE NUMBERS IN THE FDR/ABR MODEL *
//* DSCB TO MATCH THE FDR/ABR CATALOG. *
//**************************************
//FDRABRM  EXEC PGM=FDRABRM,
//             COND=((8,LT,SMPE.SMPE),(0,NE,COPY1),(0,NE,COPY2),
//             (0,NE,DEFREPRO))
//SYSPRINT DD  SYSOUT=*
//ABRMAP   DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//DISK1    DD  UNIT=SYSDA,DISP=SHR,VOL=SER=NEWRS1
//DISK2    DD  UNIT=SYSDA,DISP=SHR,VOL=SER=NEWRS2
//SYSIN    DD  *
  REMODEL VOL=NEWRS1,FORCE
  REMODEL VOL=NEWRS2,FORCE
/*
