)ATTR
           + TYPE(TEXT)   INTENS(LOW)  COLOR(BLUE)
           % TYPE(TEXT)   INTENS(HIGH) COLOR(PINK)
           _ TYPE(INPUT)  INTENS(HIGH) COLOR(RED)
)BODY EXPAND(//)
%XEF - eXtended Editor Facility (&ZAPPLID) - HELP  (continued)  -/-/ V6.4 ---
%COMMAND ===>_ZCMD
+
+ To%BROWSE+dataset%1,+type in%B+in the command area and%1+in the number area.
+ If you want a browse member list, leave the member field name blank. You can
+ also specify a specific member or a member name pattern in the member field.
+
+ To%VIEW+dataset%1,+type in%V+in the command area and%1+in the number area.
+ If you want a view member list, leave the member field name blank. You can
+ also specify a specific member or a member name pattern in the member field.
+
+ To%EDIT+dataset%1,+type in%E+in the command area and%1+in the number area.
+ If you want an edit member list, leave the member field name blank. You can
+ also specify a specific member or a member name pattern in the member field.
+
+ To use the%PDS+interface with dataset%1,+type in%P+in the command area and
+%1+in the number area.
+
+ To%FIND+dataset names in your list that match a search string,+type in%F+in
+ the command area and hit enter. You will be prompted for the search string.
+
+                               (continued)
+
)PROC
 &ZCONT = 'XEFHELP3'
)END
