)ATTR
  01 TYPE(TEXT) CAPS(OFF) INTENS(HIGH) COLOR(WHITE)
  02 TYPE(TEXT) CAPS(OFF) INTENS(HIGH) COLOR(BLUE)
  }  TYPE(TEXT) CAPS(OFF) INTENS(HIGH) COLOR(RED)
  04 TYPE(TEXT) CAPS(OFF) INTENS(HIGH) COLOR(GREEN)
  05 TYPE(TEXT) CAPS(OFF) INTENS(HIGH) COLOR(PINK)
  {  TYPE(TEXT) CAPS(OFF) INTENS(HIGH) COLOR(TURQ)
  !  TYPE(TEXT) CAPS(OFF) INTENS(HIGH) COLOR(YELLOW)
)BODY WINDOW(76,22) WIDTH(72) EXPAND(@@)
% @ @ Battle - Find and "kill" the enemy's fleet  @ @ +
%                                               +
% To achieve this, just select a valid coordinate (A0-J9). The number +
% and length of the hidden boats is shown in the top-right statistics. +
% A hit is indicated by a}#x%, (x=boat-nbr.) a mishit by a}--%.
% There is always at least one empty field beneath two different
% boats. There are 4 possible directions how a boat can be placed.
%                                               +
% The more MUST-free fields you find out and remember, the less
% number of attempts you will need.       +
%                                            !4 possible directions:+
%    {±××±××±××±××±××±××±××±××±               ----------------------+
%    {³FF³#3³#3³#3³FF³??³??³??³ !#x%= Hit           }Ð×××××××¯%  +
%    {±××±××±××±××±××±××±××±××± !FF%= MUST free     }³%\ « /}³%  +
%    {³FF³FF³FF³FF³FF³FF³??³??³ !??%= Unknown       }³% \³/ }³%  +
%    {±××±××±××±××±××±××±××±××±                     }³%ú-*-ÿ}³%  +
%    {³??³??³??³FF³#8³FF³FF³??³                     }³% /³\ }³%  +
%    {±××±××±××±××±××±××±××±××±                     }³%/ ß \}³%  +
%    {³??³??³??³FF³FF³#8³FF³??³                     }¿×××××××]%  +
%    {±××±××±××±××±××±××±××±××±
%                                               +
% @ @ Have fun. +
)INIT
)END
