/* rexx */
/* used to start the ispf interface to the svc dumps routines. copy */
/* this to a common SYSEXEC lib so that sysprogs can access it.     */
Hlq = "MA133.TSO.SVCDUMPS"

Address TSO
"ALTLIB ACTIVATE APPLICATION(EXEC)" ,
  "DSNAME('"Hlq".SYSEXEC')"

Address ISPEXEC
"LIBDEF ISPMLIB DATASET ID('"Hlq".ISPMLIB') STACK"
"LIBDEF ISPPLIB DATASET ID('"Hlq".ISPPLIB') STACK"
"LIBDEF ISPSLIB DATASET ID('"Hlq".ISPSLIB') STACK"

"CONTROL ERRORS RETURN"
"SELECT CMD(%DUMPISPF) NEWAPPL(SD) PASSLIB"
"CONTROL ERRORS CANCEL"

"LIBDEF ISPSLIB"
"LIBDEF ISPPLIB"
"LIBDEF ISPMLIB"

Address TSO
"ALTLIB DEACTIVATE APPLICATION(EXEC)"

Return
