//ED115DM1 JOB C4SYS000,MSGCLASS=X,CLASS=J,REGION=4M,NOTIFY=C4SYSDM
//*
//*MAIN PROC=C4
// EXEC EDMXGSAS,OPTIONS='SOURCE'
//*MF    DD DISP=SHR,DSN=C4MS.OSTAR
//SMF    DD DISP=SHR,DSN=C4MS.OSTAR.SAMPLE
//SYSIN DD *
  DATA T12 (KEEP =
           SMFXXFLG          SMFNO             TIMEOUT
           SYSTEM            HSRSSI            HSRSTY
           HSRHVR            HSRJBN            HSRRST
      HU12CID            HU12VOLS
      HU12TRK            RESV1
      HU12CAPA           HU12XSEQ
      HU12JIO            HU12PAG
      HU12EXCP           HU12REX
      HU12NTRX           HU12DAT
      HU12IDX            HU12BIT
      HU12OTH            HU12USED
      HU12HIT            RESV2
      RESV3              HU12TIM1
      HU12TIM2           HU12TIM3
      HU12TIM4           HU12TIM5
      HU12TIM6           HU12TCBT
      HU12SRBT           HU12IO
  )
  ;
  RETAIN N 0;
  INFILE SMF MISSOVER;
  N+1;
  *F N > 1000 THEN STOP;
  INPUT @1 SMFXXFLG PIB1.    SMFNO    PIB1.    TIMEOUT SMFSTAMP8.
           SYSTEM $CHAR4.    HSRSSI   $CHAR4.  HSRSTY  PIB2.
           HSRHVR PIB2.      HSRJBN   $CHAR8.  HSRRST  SMFSTAMP8.
@  ;
*;
IF HSRSTY = 12 THEN DO;
INPUT HU12CID  PIB2.     HU12VOLS $CHAR6.
      HU12TRK  PIB2.     RESV1    PIB2.
      HU12CAPA PIB4.     HU12XSEQ PIB4.
      HU12JIO  PIB4.     HU12PAG  PIB4.
      HU12EXCP PIB4.     HU12REX  PIB4.
      HU12NTRX PIB4.     HU12DAT  PIB4.
      HU12IDX  PIB4.     HU12BIT  PIB4.
      HU12OTH  PIB4.     HU12USED PIB4.
      HU12HIT  PIB4.     RESV2    PIB4.
      RESV3    PIB4.     HU12TIM1 PIB8.6
      HU12TIM2 PIB8.6    HU12TIM3 PIB8.6
      HU12TIM4 PIB8.6    HU12TIM5 PIB8.6
      HU12TIM6 PIB8.6    HU12TCBT PIB4.
      HU12SRBT PIB4.     HU12IO   PIB4.
      @;
      OUTPUT T12;
END; * IF TYPE 12;
RETURN;
PROC PRINT DATA=T12;
FORMAT TIMEOUT DATETIME. ;
FORMAT HSRRST  DATETIME. ;
FORMAT HU12TCBT HU12SRBT TIME.;
