//ED115DM4 JOB C4SYS000,MSGCLASS=X,CLASS=J,REGION=4M,NOTIFY=C4SYSDM
//*
//*MAIN PROC=C4
// EXEC EDMXGSAS,OPTIONS='SOURCE'
//SMF    DD DISP=SHR,DSN=C4MS.OSTAR
//*MF    DD DISP=SHR,DSN=C4MS.OSTAR.SAMPLE
//SYSIN DD *
  DATA T24 (KEEP =
           SMFXXFLG          SMFNO             TIMEOUT
           SYSTEM            HSRSSI            HSRSTY
           HSRHVR            HSRJBN            HSRRST
      HU24ICHP           HU24ITIM
      HU24Q002           HU24Q004
      HU24Q008           HU24Q016
      HU24Q032           HU24Q066
      HU24Q128           HU24QLNG
      HU24C002           HU24C004
      HU24C008           HU24C016
      HU24C032           HU24C066
      HU24C128           HU24CLNG
  )
  ;
  RETAIN N 0;
  INFILE SMF MISSOVER;
  N+1;
  *F N > 1000 THEN STOP;
  INPUT @1 SMFXXFLG PIB1.    SMFNO    PIB1.    TIMEOUT SMFSTAMP8.
           SYSTEM $CHAR4.    HSRSSI   $CHAR4.  HSRSTY  PIB2.
           HSRHVR PIB2.      HSRJBN   $CHAR8.  HSRRST  SMFSTAMP8.
@  ;
*;
IF HSRSTY = 24 THEN DO;
INPUT HU24ICHP PIB2.     HU24ITIM PIB4.
      HU24Q002 PIB4.     HU24Q004 PIB4.
      HU24Q008 PIB4.     HU24Q016 PIB4.
      HU24Q032 PIB4.     HU24Q066 PIB4.
      HU24Q128 PIB4.     HU24QLNG PIB4.
      HU24C002 PIB4.     HU24C004 PIB4.
      HU24C008 PIB4.     HU24C016 PIB4.
      HU24C032 PIB4.     HU24C066 PIB4.
      HU24C128 PIB4.     HU24CLNG PIB4.
      @;
      OUTPUT T24;
END; * IF TYPE 24;
RETURN;
PROC PRINT DATA=T24;
FORMAT TIMEOUT DATETIME. ;
FORMAT HSRRST  DATETIME. ;
