//VHSPLHEX JOB (6948),'OFFLOADER HEX',
//             REGION=4M,
//             CLASS=X,MSGCLASS=Q
/*JOBPARM LINES=9999
//HEX     EXEC PGM=SPOOLSEL,PARM=HEX
//STEPLIB  DD DISP=SHR,DSN=SFT1.CUSTMODS.LOAD
//SYSUT1   DD DISP=SHR,DSN=SFT1.VHUTCH.SPOOLA.JES2OFFL
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
