//VHSPLPRX JOB (6948),'PRINT OFFLOADER',
//             REGION=2M,
//             CLASS=X,MSGCLASS=Q
/*JOBPARM LINES=9999
//PRINT   EXEC  PGM=SPOOLSEL,PARM=PRINT
//SYSUT1   DD   DISP=SHR,DSN=datasetname.of.spool.offload
//SYSPRINT DD   SYSOUT=*
//SYSUDUMP DD   SYSOUT=*
//SYSIN    DD   *
OUTPUTS  ALL
