//XSPRBUJV JOB  (SP,9030,0000000),'WESTERMAN - BOX 3',
//       CLASS=H,MSGCLASS=S,TIME=30,
//       NOTIFY=XSPRBWW TYPRUN=HOLD
//*
//JS001     EXEC ASMFCL,
//             REGION.ASM=1024K,
//             PARM.ASM=('OBJ','NODECK','BUFSIZE(MAX)','NOTEST'),
//             COND.LKED=(4,LT,ASM),
//             PARM.LKED='XREF,LIST,NCAL,RENT,REUS'
//ASM.SYSLIB   DD DSN=SYS1.SMPMTS,
//             DCB=BLKSIZE=23200,
//             DISP=SHR
//             DD DSN=SYS1.AMODGEN,
//             DISP=SHR
//             DD DSN=SYS1.AGENLIB,
//             DISP=SHR
//             DD DSN=SYS1.MACLIB,
//             DISP=SHR
//SYSIN        DD DSN=XSPRBWW.POSSIBLE.MODS(IEFUJV),DISP=SHR
//LKED.SYSLMOD DD DSN=ALCATEL.LINKLIB,DISP=SHR
//LKED.SYSIN   DD *
  NAME IEFUJV(R)
/*
