//XSPRBUTL JOB (SP,9030,0000000),'WESTERMAN   - BOX 3',
//             TIME=30,TYPRUN=HOLD,
//             NOTIFY=XSPRBWW,
//             CLASS=H,MSGCLASS=S,MSGLEVEL=(1,1)
//*
//* DOC: THIS JOB CAN BE USED TO INSTALL THE
//*      SMF USER TIME LIMIT EXIT, IEFUTL.
//*
//ASMUTL1 EXEC ASMFCL,PARM.ASM='RENT,OBJECT,NODECK',
//             PARM.LKED='RENT,REUS,XREF,LIST'
//ASM.SYSLIB   DD UNIT=3380,VOL=SER=R12007
//SYSIN    DD  DSN=XSPRBWW.POSSIBLE.MODS(IEFUTL),DISP=SHR
//LKED.SYSLMOD DD DSN=ALCATEL.LINKLIB(IEFUTL),DISP=SHR,
//             VOL=SER=R120RS,UNIT=3380
//SYSIN    DD  *
      IDENTIFY IEFUTL('ALSMF01')
/*
//SMPAPP2 EXEC IPOSMPE,COND=(0,NE)
//SMPPTFIN DD  *
++ USERMOD (ALSMF01) .
++ VER (Z038) FMID(HBB3310).
++ VER (Z038) FMID(HBB2102).
++ VER (Z038) FMID(JBB1326).
++ MOD (IEFUTL) DISTLIB(AOSB3) LKLIB(ALCLINK) .
/*
//SMPEIN   DD  *
  SET BOUNDARY(GLOBAL) .
  RECEIVE      S(ALSMF01) SYSMODS .
  SET BOUNDARY(M220TZ).
  APPLY        S(ALSMF01) .
  LIST         SYSMOD(ALSMF01) .
/*
//ALCLINK  DD  DSN=ALCATEL.LINKLIB,DISP=SHR,
//             VOL=SER=R120RS,UNIT=3380
