//XSPRBJ16 JOB  (SP,9030,0000000),'WESTERMAN   - BOX 3',
//         CLASS=H,MSGCLASS=S,TIME=99,
//         NOTIFY=XSPRBWW,REGION=4096K TYPRUN=HOLD
//*
//*
//ASM    EXEC  PGM=IEV90,PARM=OBJECT,REGION=1200K
//SYSLIB DD DSN=SYS1.HASPSRC,DISP=SHR,DCB=BLKSIZE=23000,
//       VOL=SER=R12002,UNIT=SYSDA
//       DD DSN=SYS1.MACLIB,DISP=SHR,
//       VOL=SER=R12007,UNIT=SYSDA
//       DD DSN=SYS1.AMODGEN,DISP=SHR,
//       VOL=SER=R12002,UNIT=SYSDA
//*      DD DSN=ALCATEL.MACLIB,DISP=SHR
//SYSUT1   DD  UNIT=(SYSDA,SEP=SYSLIB),SPACE=(CYL,(10,5)),DSN=&SYSUT1
//SYSPUNCH DD  DUMMY,DCB=BLKSIZE=80
//SYSPRINT DD SYSOUT=*,DCB=(BLKSIZE=3509),UNIT=(,SEP=(SYSUT1,SYSPUNCH))
//SYSLIN   DD  DISP=(,PASS),UNIT=SYSDA,SPACE=(CYL,(5,5,0)),
//             DSN=&&LOADSET
//SYSIN DD DSN=XSPRBWW.POSSIBLE.MODS(JX16),DISP=SHR
//LKED EXEC  PGM=IEWL,PARM='MAP,LET,LIST,XREF',
//        REGION=1000K,COND=(8,LT,ASM)
//SYSLIN   DD  DSN=&&LOADSET,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD DSN=ALCATEL.LINKLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//*  NAME JESEX005(R)
//*  NAME J005$DV(R)
//*  NAME J005LOAD(R)
//SYSIN DD *
  NAME JX016(R)
/*
