//$SPBHW   JOB  (BHWEST,NOBOX),'SYSTEMS*BRIAN',CLASS=7,
//     MSGCLASS=W,NOTIFY=$SPBHW,REGION=0M,TIME=1440
//*
//*  THE OUTPUT GOES TO SYS6.ZEKE.TESTJCL FOR AUTOMATIC SUBMITS
//*   REFER   SYSX.SYS.CNTL(SYSBLD00)
//STEP0  EXEC PGM=IKJEFT01,PARM='%CATLIST'
//JOBOUT   DD DISP=OLD,DSN=$SPBHW.PDS.DATA(SYSCATBK)
//SYSPROC  DD DISP=SHR,DSN=TSO.SYSTEM.CLIST
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
