)ATTR
  @ TYPE(OUTPUT) INTENS(LOW)
)BODY
%-------------- DISK SPACE INFORMATION -----------------------------------------
+ COMMAND =======>_ZCMD                                        %SCROLL ===>_TBS
+ Volume%&ULXV01 +Device%&ULXUNIT +Trk/Cyl%&ULXTPC +Extents%&ULXEXT
+
+      XXXX = Rel Trk of 1st Trk    YYYY = No. of Cyls    ZZ = No. of Trks
+
+SEQNO XXXXYYYYZZ     CYLINDERS   TRACKS   TOTAL     BEGIN CCHH  END CCHH
+----- ----------     ---------   ------  -------    ---------- ----------
)MODEL
@Z    @Z                @Z        @Z      @Z         @Z         @Z
)INIT
  .ZVARS = '(TBSEQ TBEXT TBCYL TBTRA TBTRK TBBEG TBEND)'
  &TBS = HALF
)END
