         MACRO
         #INSTACK &DSECT=INSTACK
*
*        I/O SERVICE ROUTINE INSTACK MAP
*
         SPACE
         AIF   ('&DSECT' EQ 'NO').ND
&DSECT   DSECT ,
.ND      ANOP
INSCODE  DS    XL1   TYPE OF ELEMENT
INSDATA  EQU   X'80' DATASET/TERMINAL
INSSTOR  EQU   X'40' STORAGE SOURCE/TERMIN DLM
INSINDD  EQU   X'20' INPUT DD PRESENT
INSOTDD  EQU   X'10' OUTPUT DD PRESENT
INSEXEC  EQU   X'08' EXEC COMMAND ELEMENT
INSPROM  EQU   X'04' PROMPTING ALLOWED
INSPROC  EQU   X'02' PROCEDURE ELEMENT
INSLIST  EQU   X'01' LIST OPTION
INADLSD  DS    AL3   LSD/IODSD ADDRESS
         MEND
