         MACRO
         IEZCTGPL ,
CTGPL    DSECT ,
*/********************************************************************/
*/*                                                                  */
*/*   $MAC(IEZCTGPL):                                                */
*/*                                                                  */
*/*   DESCRIPTIVE NAME = CATALOG PARAMETER LIST                      */
*/*                                                                  */
*/*   FUNCTION = THE CATALOG PARAMETER LIST (CTGPL) DEFINES THE      */
*/*              CATALOG MANAGEMENT REQUEST AND ITS OPTIONS, THE     */
*/*              CATALOG RECORD TO BE PROCESSED, AND THE VSAM        */
*/*              CATALOG THAT CONTAINES THE RECORD.  THE CTGPL IS    */
*/*              BUILT BEFORE AN OS/VS COMPONENT ISSUES THE CATLG    */
*/*              MACRO INSTRUCTION (SVC 26) TO PROCESS A CATALOG     */
*/*              RECORD.  WHEN THE CATALOG MANAGEMENT ROUTINES       */
*/*              BUILD A CCA TO SUPPORT THE REQUEST, THE ADDRESS     */
*/*              OF THE CTGPL IS PUT INTO THE CCA (CCACPL).          */
*/*                                                                  */
*/*   CONTROL BLOCK STRUCTURE = THE CTGPL IS POINTED TO BY           */
*/*                             REGISTER 1.                          */
*/*                                                                  */
*/********************************************************************/
CTGOPTN1 DS    XL1                      FIRST OPTION INDICATOR
CTGBYPSS EQU   X'80'                    BYPASS
CTGMAST  EQU   X'40'                    VERIFY MASTER PASSWORD
CTGCI    EQU   X'20'                    VERIFY CONTROL INDICATOR
CTGUPD   EQU   X'10'                    VERIFY UPDATE
CTGREAD  EQU   X'08'                    VERIFY READ
CTGNAME  EQU   X'04'                    1 - 44-BYTE NAME OR VOLSER
*                                       0 - ENTRY ID NUMBER
CTGCNAME EQU   X'02'                    1 - 44-BYTE NAME
*                                       0 - ACB ADDRESS
CTGGENLD EQU   X'01'                    GENERIC LOCATE REQUEST
*
CTGOPTN2 DS    XL1                      SECOND OPTION INDICATOR
CTGEXT   EQU   X'80'                    EXTEND(UPDATE)
CTGNSVS  EQU   X'80'                    CATLG CLEANUP REQUEST
CTGERASE EQU   X'40'                    ERASE(DELETE)
CTGSMF   EQU   X'40'                    WRITE SMF(LSPACE)
CTGREL   EQU   X'40'                    RELEASE(UPDATE)
CTGGTALL EQU   X'40'                    CONCAT SEARCH (LISTCAT)
CTGGFLIC EQU   X'40'                    SRCH ONLY 1 CAT(GFL)
CTGGGFL1 EQU   X'40'                    SEARCH ONLY 1 CAT (GFL)
CTGPURG  EQU   X'20'                    PURGE (DELETE)
CTGVMNT  EQU   X'20'                    VOLUME MOUNT CALLER
CTGRCATN EQU   X'20'                    RTN CAT NAME(GLOC,GFL)
CTGSWAP  EQU   X'20'                    SWAPSPACE (DEFINE)
CTGGTNXT EQU   X'10'                    GET NEXT (LIST CTLG)
CTGUCRAX EQU   X'10'                    UCRA EXTEND OPTION
CTGDELRC EQU   X'10'                    DELETE RECOVER
CTGDISC  EQU   X'08'                    DISCONNECT (DELETE)
CTGRESM  EQU   X'08'                    GFL RESUME FUNCTION
CTGOVRID EQU   X'04'                    ERASE OVERRIDE (DELETE)
CTGCNVTC EQU   X'04'                    CONVERT CAT (DELETE SPACE)
*
CTGSCR   EQU   X'02'                    SCRATCH SPACE (DELETE)
CTGCDI   EQU   X'02'                    DATA INDEX ARE MATCHES IF ITS
*                                       CLUSTER/AIX MATCH FILTER KEY
*
CTGBOTH  EQU   X'01'                    CALLER CAN ACCEPT ICF CATALOG
*                                       ARCHITECTURE
CTGOPTN3 DS    XL1                      THIRD OPTION INDICATOR
CTGFUNC  EQU   X'E0'                    HIGH ORDER THREE BITS DEFINE
*                                       FUNCTION
*   LOCATE     -   001* ****
CTGLOC   EQU   X'20'                    LOCATE - BITS ON
*   LSPACE     -   010* ****
CTGLSP   EQU   X'40'                    LSPACE - BITS ON
*   UPDATE     -   011* ****
CTGUPDAT EQU   X'60'                    UPDATE - BITS ON
*   CMS FUNCTION - 100* ****
CTGCMS   EQU   X'80'                    CMS FUNCTION - BITS ON
*   GFL          - 101* ****
CTGGFL   EQU   X'A0'                    GFL          - BITS ON
*   CNL          - 110* ****
CTGCNL   EQU   X'C0'                    CNL          - BITS ON
*
CTGSUPLT EQU   X'10'                    SUPER LOCATE
CTGGDGL  EQU   X'08'                    GDG LOCATE FUNCTION (CTGWAGB IN
*                                       CTGWA)
CTGSRH   EQU   X'04'                    0 - SEARCH MASTER CAT ONLY
*                                       1 - SEARCH OS CAT FIRST
CTGNUM   EQU   X'02'                    0 - SEARCH BOTH CATALOGS
*                                       1 - SEARCH ONE CATALOG
CTGAM0   EQU   X'01'                    VSAM REQ VERSUS NONVSAM
*
CTGOPTN4 DS    XL1                      FOURTH OPTION INDICATOR
CTGLBASE EQU   X'80'                    LOCATE GDG BASE ONLY
CTGNDISC EQU   CTGLBASE                 DELETE CATALOG NO DISCONNECT
*
CTGNOCON EQU   CTGLBASE                 DELETE CATALOG NO CONNECT
CTGDOCAT EQU   X'40'                    DO NOT OPEN NEEDED CATLG
CTGNPROF EQU   X'20'                    NO (RAC) PROFILE SHOULD BE
*                                       DEFINED OR DELETED
CTGCOIN  EQU   X'10'                    CONTROLLER INTERCEPT REQUESTED
*
CTGBYPMT EQU   X'08'                    BYPASS SECURITY PROMPTING TO
*                                       SYSTEM OPERATOR
CTGTIOT  EQU   X'04'                    CALLER OWNS SYSZTIOT EXCLUSIVE
CTGICFC  EQU   X'02'                    REQUEST ORIENTED TO ICF CATALOG
*
CTGICFOR EQU   X'01'                    ICF ONLY REQUEST
CTGENT   DS    0A                       USER ENTRY ADDRESS OR POINTER
*                                       TO VOLUME SERIAL NUMBER(LSPACE)
CTGFVT   DS    0A                       FVT ADDRESS (DEFINE, ALTER)
CTGDNT   DS    A                        POINTER TO DATA SET NAME TABLE
*
CTGCAT   DS    0A                       CATALOG POINTER
*
CTGCVOL  DS    A                        CVOL PTR (SUPER LOCATE)
*
CTGWKA   DS    A                        WORKAREA ADDRESS
*
CTGDSORG DS    CL2                      DATA SET ORG (SUPER LOCATE)
         ORG   CTGDSORG
CTGDSOR1 DS    CL1                      BYTE 1
*   BITS 0-4 DEFINE ORGANIZATION
CTGOPTNS EQU   X'F8'                    TOP 5 BITS
*   DEFINE          - 0000 1*** **** ****
CTGDEFIN EQU   X'08'                    DEFINE
*   ALTER           - 0001 0*** **** ****
CTGALTER EQU   X'10'                    ALTER
*   DELETE          - 0001 1*** **** ****
CTGDELET EQU   X'18'                    DELETE
*   LIST CATALOG    - 0010 0*** **** ****
CTGLTCAT EQU   X'20'                    LIST CATALOG
*   CONVERTV        - 0011 0*** **** ****
CTGCNVTV EQU   X'30'                    CONVERTV
*   CAS CAT OPEN    - 0011 1*** **** ****
CTGOPEN  EQU   X'38'                    CAS CAT OPEN
*   CAS CAT CLOSE   - 0100 0*** **** ****
CTGCLOSE EQU   X'40'                    CAS CAT CLOSE
*   CAS CAT VVDS    - 0100 1*** **** ****
CTGVVDS  EQU   X'48'                    CAS CAT VVDS
CTGF2WKA EQU   X'04'                    FORMAT 2 WORK AREA
CTGVVRUP EQU   X'02'                    VVDS UPDATE ONLY
CTGF2SEN EQU   X'01'                    CAN HANDLE 40-2 RC
CTGDSOR2 DS    CL1                      BYTE 2
CTGFVFY  EQU   X'80'                    FORCE PASSWORD VERIFICATION -
*                                       DO NOT CHECK FOR AUTHORIZED
*                                       CALLER.
CTGHDLET EQU   X'40'                    HSM HAS DELETED A MIGRATED
*                                       DATA SET
CTGHALTL EQU   X'20'                    LOCATE FROM ALTER
CTGHDLTL EQU   X'10'                    LISTCAT FROM DELETE
CTGBRCAT EQU   X'08'                    BRANCH ENTRY TO IGGOCLAH -
*                                       RESTRICTED TO KEY ZERO USE AND
*                                       CMS FUNCTIONS CTGOPEN,
*                                       CTGCLOSE, AND CTGVVDS.
*
*   BITS 13-15 RESERVED
*
CTGTYPE  DS    CL1                      ENTRY TYPE-LISTCAT,DELETE
CTGTALIN EQU   C'A'                     ALIEN - A
CTGTGBS  EQU   C'B'                     GDG BASE - B
CTGTCL   EQU   C'C'                     CLUSTER - C
CTGTDATA EQU   C'D'                     DATA - D
CTGTFREE EQU   C'F'                     FREE - F
CTGTAIX  EQU   C'G'                     ALTERNATE INDEX - G
CTGTGDS  EQU   C'H'                     GDS - H
CTGTINDX EQU   C'I'                     INDEX - I
CTGTLIB  EQU   C'L'                     LIBRARYENTRY - L
CTGTVVR  EQU   C'K'                     VSAM VOLUME RECORD
CTGTMCAT EQU   C'M'                     MASTER CATALOG - M
CTGTPGSP EQU   C'P'                     PAGE SPACE - P
CTGTPATH EQU   C'R'                     PATH - R
CTGTPTH  EQU   C'R'                     PATH - R
CTGTTNAM EQU   C'T'                     ICF TRUE NAME
CTGTUCAT EQU   C'U'                     USER CATALOG - U
CTGTVOL  EQU   C'V'                     VOLUME - V
CTGTANM  EQU   C'X'                     ALIAS BASE -X
CTGTUPG  EQU   C'Y'                     UPGRADE - Y
CTGTJES3 EQU   X'01'                    JES3 SUPERLOCATE REQUEST
CTGMULTY EQU   X'FF'                    MULTIPLE TYPES - 'FF'X
*
CTGNOFLD DS    XL1                      NUMBER FIELD POINTERS
CTGDDNM  DS    0A                       DD NAME ADDRESS
CTGNEWNM DS    0A                       NEWNAME ADDRESS - ALTER
CTGFILTR DS    0A                       GFL FILTER KEY ADDRESS
CTGPROB  DS    0XL4                     PROBLEM DETERMINATION
CTGMODID DS    0CL2                     MODULE IDENTIFICATION
CTGFDBK  DS    XL2                      SUPER LOCATE FEEDBACK
CTGFBFLG DS    0XL2                     SUPER LOCATE FLAGS
CTGREASN DS    0XL2                     ERROR REASON CODE
CTGREAS1 DS    XL1                      HIGH ORDER BYTE ZERO
CTGPAR   EQU   X'80'                    PARALLEL MOUNT - SUPER LOC
CTGKEEP  EQU   X'40'                    FORCED KEEP = SUPER LOCATE
CTGGDGB  EQU   X'20'                    GDG BASE LOCATED
CTGNGDSN EQU   X'10'                    GDG NAME GENERATED
CTGCLV   EQU   X'08'                    CANDIDATE VOLUME LIST
*        6-8  RESERVED
CTGREAS2 DS    XL1                      REASON CODE LOW BYTE
*
CTGJSCB  DS    0A                       JSCB ADDRESS
CTGPSWD  DS    A                        PASSWORD ADDRESS
CTGFIELD DS    A                        FIELD POINTERS - MAY BE MORE
*                                       THAN ONE
CTGPLLEN EQU   *-CTGPL                  LENGTH OF CTG WITH ONE FIELD
*                                       POINTER
         MEND
