)ATTR
  +  TYPE(TEXT) INTENS(LOW) SKIP(ON)
  %  TYPE(TEXT) INTENS(HIGH) SKIP(ON)
  _  TYPE(INPUT) INTENS(HIGH)
)BODY
%-------------- +FDR ABR%BACKUP+FUNCTION SELECTION MENU %-----------------------
%COMMAND ===>_ZCMD                                                             +
%
%   1+- SELECT A DATASET FOR%BACKUP+PROCESSING
%   2+- SELECT A DATASET FOR%RESTORE FROM BACKUP+PROCESSING
%   3+-%RESET+BACKUP SELCTION INDICATORS (REVERSE OPTION 1)
%   4+-%REMOVE+DATASET(S) FROM BACKUP RESTORE QUEUE (REVERSE OPTION 2)
%
)INIT
  .HELP = ISR00003
  &ZHTOP = ISR00003   /* TUTORIAL TABLE OF CONTENTS        */
  &ZHINDEX = ISR91000 /* TUTORIAL INDEX - 1ST PAGE         */
)PROC
  &ZSEL = TRANS( TRUNC (&ZCMD,'.')
                1,'CMD(ABRBKUP1)'
                2,'CMD(ABRBKUP2)'
                3,'CMD(ABRBKUP3)'
                4,'CMD(ABRBKUP4)'
              ' ',' '
                *,'?' )
)END
