)CM 10/03/83 MURA - MOVE LKED.SYSLIB AHEAD OF SYSLMOD
)CM 10/05/83 MURA - ADD REGION.LKED
)CM 01/27/84 MURA - CHANGE BCL1/BCL2 TO BPL1/BPL2
)CM 02/06/84 MURA - ADD BCL3
)SET S = &S + 1
//*---------------------------------------------------------------------
//*  JH BG - PLI OPT COMPILE OF &TDSN
)SEL &PL1PRC ¬= PLIXC
//*          AND LINK TO &TLNKLB2(&TLMEM)
)ENDSEL
//*---------------------------------------------------------------------
//STEP&S   EXEC &PL1PRC,REGION.PLI=256K,
<//    PARM.PLI='&BPLO',|>
)SEL &PL1PRC ¬= PLIXC
//    REGION.LKED=256K,
)SEL &BLNK ¬= &Z
//    PARM.LKED='&BLNK',
)ENDSEL
)ENDSEL
//    CLASS='*'
)SEL &TBPL1 ¬= &Z | &TBPL2 ¬= &Z | &TBCL3 ¬= &Z
//PLI.SYSLIB DD DSN=SYS1.BLOCKLIB,DISP=SHR
<//         DD DSN=&TBPL1,DISP=SHR|>
<//         DD DSN=&TBPL2,DISP=SHR|>
<//         DD DSN=&TBCL3,DISP=SHR|>
)ENDSEL
//PLI.SYSIN    DD DSN=&TDSN,DISP=SHR
)SEL &PL1PRC ¬= PLIXC
)SEL &TBSL1 ¬= &Z
//LKED.SYSLIB DD DSN=&TBSL1,DISP=SHR
)SEL &TBSL2 ¬= &Z
//         DD DSN=&TBSL2,DISP=SHR
//         DD DSN=SYS1.PLIBASE,DISP=SHR
)ENDSEL
)ENDSEL
)SEL &TBSL1 = &Z && &TBSL2 ¬= &Z
//LKED.SYSLIB DD DSN=&TBSL2,DISP=SHR
)ENDSEL
//LKED.SYSLMOD DD DSN=&TLNKLB2,DISP=SHR,UNIT=
//LKED.SYSIN DD *
   <ENTRY &TENTRY|>
   NAME &TLMEM.(R)
/*
)ENDSEL
//*
