)ATTR
 /* 01/16/84 Mura - panel, msg ids changed; PROC section added       */
  %  TYPE(TEXT)   INTENS(HIGH)  SKIP(ON)
  +  TYPE(TEXT)   INTENS(LOW)   SKIP(ON)
  /  TYPE(INPUT)  INTENS(HIGH)  PAD(_)     CAPS(ON)
  ¢  TYPE(INPUT)  INTENS(LOW)   PAD('''')  CAPS(ON)
  |  TYPE(INPUT)  INTENS(LOW)   PAD(_)     CAPS(OFF)
  @  TYPE(OUTPUT) INTENS(LOW)   SKIP(ON)   CAPS(ON)
)BODY
%SELECTION PANEL UPDATE TABLE - &TBNM ------------------------------------------
%COMMAND ===>_ZCMD                                            %SCROLL ===>_SCIN+
%
%     PANEL    OPT  KEYWORD     F N SELECT
+
)MODEL
¢Z   /PANEL   /Z   /KEYWORD    /Z@Z/SELECT                        +
+              TEXT1:|TEXT1
+              TEXT2:|TEXT2
+              TEXT3:|TEXT3
+              TEXT4:|TEXT4
%
)INIT
 &SCIN = CSR
 .ZVARS = '(SEL OPTION KEYFLAG TEXTNUM)'

)PROC
 VER(&ZCMD,LIST,C,CAN,CANCEL,MSG=JHA@M031) /*                01/16/84*/

 &SELT = TRUNC(&SEL,1)               /*                      01/16/84*/
 &SELN = .TRAIL                      /*                      01/16/84*/
 VER(&SELT,LIST,D,I,R,MSG=JHA@M033)  /*                      01/16/84*/
 VER(&SELN,NUM,MSG=JHA@M033)         /*                      01/16/84*/

 IF (&SELT ¬= D)                     /*                      01/16/84*/
   VER(&PANEL,NB,MSG=JHAYM141)       /*                      01/16/84*/
)END
