)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL+-\-\-¢REVEDIT Detailed Information+-\-\-%TUTORIAL
%OPTION  ===>_ZCMD                                                             +


   Detailed information for the¢REVEDIT+option of¢REVIEW+is contained
   in the TSO HELP member¢REVEDIT.+ This member resides in the SYSHELP
   concatenation.   Enter one of the following commands to view the HELP
   member in 3270 full screen mode.

     %TSO FSHELP REVEDIT+
     %TSO HEL REVEDIT+

)INIT
)PROC
)END
