)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL+-\-\-¢REVEDIT Types of Datasets+-\-\-%TUTORIAL
%OPTION  ===>_ZCMD                                                             +


 ¢REVEDIT+can edit sequential, partitioned, and partitioned-extended
  files that have the following characteristics.


      %Record Formats+- fixed or variable
                      - blocked or unblocked
                      - with or without printer control characters

      %Data Lengths+  - 1 to 32760 bytes of data, inclusive

)INIT
)PROC
)END
