)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ! TYPE(TEXT) INTENS(LOW)  COLOR(GREEN) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL+-\-\-¢REVIEW PDSE Load Directory Display+-\-\-%TUTORIAL
%OPTION  ===>_ZCMD                                                             +

%TRIDJK.PDSEU -------------------------------
 Command ===>
¢  RealName Alias-Name      Size AC AMd At RU V Non-0-EP Save-Timestamp User/Job
+. BLKDISK  SSI=CB346296    1B88              1
 . CDAEQED         501K    7D340    A64 NE RN 42d        07-12-17 13:25 TSC3901
 . COBANAL          40K     9D28 00 A31    RN 2          08-01-31 08:37 TRIDJK
 . DEX               6K     15E0              1
 . MFCTFSN  SSI=71900820     990           RN 2          07-07-09 14:20 TRIDJKA
 . MFCTMMD  SSI=71800820     4B8           RN 2          07-06-29 08:06 TRIDJK
!. PDS86    PDS            49E10 00     PG RF 2          08-08-27 07:59 TRIDJK
!. PDS86    PDSE           49E10 00     PG RF 2          08-08-27 07:59 TRIDJK
 . PDS86           296K    49E10 00     PG RF 2          08-08-27 07:59 TRIDJK
 . TEST2            26K     6600    A31       2          07-08-09 10:21 TRIDJK
 . TRSMAIN          82K    14558 00 ANY    RN 2          98-12-30 11:27 TRIDJK

¢  **END**        959K      393K:R=24                 2007-12-11 PERM69
)INIT
)PROC
)END
