)ATTR DEFAULT(%#_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    $ TYPE(TEXT) INTENS(HIGH) COLOR(GREEN)
    @ TYPE(TEXT) INTENS(HIGH) COLOR(RED) HILITE(USCORE)
    # TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL#-\-\-¢REVIEW ASCII Display Screen Format#-\-\-%TUTORIAL
%OPTION  ===>_ZCMD                                                             #


   The six areas of the¢REVIEW%ASCII#display screen are shown below.
   They are:%(1)#Title,%(2)#Line/Column numbers,%(3)#Command,
  %(4)#Scroll amount,%(5)#Ruler,%(6)#ASCII data fields.

        .--------------------------------------------------------------.#
        |                                                              |
%(1)#=> | %TRIDJK.README.TXT on WORK15 --------------- Line 1 Col 1 80#| <=%(2)#
%(3)#=> | %Command ==>@                               %Scroll ==>@CSR #| <=%(4)#
%(5)#=> |¢1       10        20        30        40        50        60#|
        |¢+---+----+----+----+----+----+----+----+----+----+----+----+#|
        |$Vista TN3270 For Windows..------------------------....Vista #| <=%(6)#
        |$s a program designed to emulate IBM..standard 3270 series te#|
        |$(TCP) environment..provided by a standard WINSOCK interface.#|
        |$ by:....    Tom Brennan..    523 N. Nora Ave...    West Covi#|
        |$f you need support, enhancements, registration information,.#|
        |$ress your opinion of the product, please..send a note to:...#|
        |$oftware.com....or visit..   ..    www.tombrennansoftware.com#|

)INIT
)PROC
)END
