)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL+-\-\-¢REVIEW Member Selection Codes+-\-\-%TUTORIAL
%OPTION  ===>_ZCMD                                                             +


 Code  Function

%   S +Browse the member with¢REVIEW.+ This is the default
       selection code when the cursor is placed on the leader dot.

%   /+¢REVIEW+the member with the%DATA+operand.

%   B +Browse the member with ISPF Browse.

%   R +Reset or untag the member.
%   T +Tag the member for display control purposes, or for
       later processing by SEARCH, OFFLOAD, SEQLOAD or DELINK.

%   H +Display program history.
%   M +Display program map.
)INIT
)PROC
)END
