)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL+-\-\-¢REVIEW Entry Selection Codes+-\-\-%TUTORIAL
%OPTION  ===>_ZCMD                                                             +


 Code  Function

%   S +Browse the entry contents with¢REVIEW.+ This is the default
       selection code when the cursor is placed on the leader dot.

%   /+¢REVIEW+the entry contents with the%DATA+operand.

%   A+¢REVIEW+the entry contents - if a file treat as an
      %ASCII text+file.

%   B +Browse the regular file with ISPF Browse.
%   E +Edit the regular file with ISPF Edit.

%   R +Reset or untag the member.
%   T +Tag the member for display control purposes, or for
       later processing by SEARCH.

%   H +Display program history.
%   M +Display program map.
)INIT
)PROC
)END
