)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL+-\-\-¢REVIEW Session Control+-\-\-%TUTORIAL
%OPTION  ===>_ZCMD                                                             +


 Subcmd   Aliases  Function

%EXIT     END  =X +Terminate the¢REVIEW+session.
%CANCEL   CAN     +Terminate the¢REVIEW+session without updating your profile.

%SWAP LIST        +Display a list of parallel¢REVIEW+sessions.
%SWAP             +Swap to the second most recent¢REVIEW+session.
%SWAP #           +Swap to the¢REVIEW+session number%#+where%#+is a
                   decimal number which can be obtained from%SWAP LIST.+

%TSO      TSS     +Invoke the Command Processor named by the operand.
                   If the named command is¢REVIEW+a parallel session
                   is started.

)INIT
)PROC
)END
