)ATTR
  ! TYPE(TEXT) COLOR(WHITE) HILITE(USCORE)
  { TYPE(NT)
  @ TYPE(ET)
  # TYPE(DT)
  | AREA(SCRL) EXTEND(ON)
)BODY CMD( ) WINDOW(60,10)
{     @Unlicensed Materials - Property of the Free World  {
{                                                         {
{     !http://www.cbttape.org/ftp/cbt/CBT134.zip+         {
{                                                         {
@      Weapon Masters present and past...
|S1                                                       |
)AREA S1
#        Greg Price
#        John Kalinich
#        Bruce Leland
#        Tony Watson
#        Bill Godfrey
)INIT
  &ZUP = REVLOGO
  &ZWINTTL = 'REVIEW Command'
  &ZCMD = ' '
  &CMD = ' '
)END
