//-YOUR-USERID-A JOB  (-YOUR-ACCT-INFO-),'-YOUR-NAME-',
//             CLASS=2,MSGCLASS=X,NOTIFY=-YOUR-USERID-
//***
//***  ADD CARRIAGE CONTROL USING CONTROL TAGS AND CREATE AS FULLY
//***  FLUSHED OUT ASCII CONTROL CARD FILE AND SAVE
//***
//CLEANUP    EXEC     PGM=IEFBR14
//DEL001       DD       DSN=...,
//             DISP=(MOD,DELETE,DELETE),UNIT=SYSDA,SPACE=(TRK,0)
//***
//CREATE     EXEC     PGM=ADDCC,REGION=464M,
//             PARM='HEAP(01M,01M,ANYWHERE)'
//I            DD       *
:PAGESIZE  55
:LINESIZE  80
:TOC       NO
//             DD       DISP=SHR,DSN=...
//O            DD       DSN=...,
//             DISP=(,CATLG),UNIT=SYSDA,SPACE=(CYL,(10,10),RLSE),
//             DCB=(BLKSIZE=80,RECFM=FBA)
//STEPLIB      DD       DISP=SHR,DSN=-YOUR-LOADLIB-
//***
