/**  REXX -- CENTER DATA USING CC/C## RANGE OR DEFAULT TO ENTIRE  **/
/*           FILE; WILL TAKE COLS AS PARMS OR USE ISPF BOUNDS      */

   SAVEMSG = MSG()
   X = MSG("OFF")
   X = ADDRESS()
   SUBCOM ISPEXEC
   IF RC <> 0 THEN DO
      SAY "CENTER MUST BE RUN UNDER ISPF EDIT!"
      SIGNAL QUIT
      END
   SUBCOM ISREDIT
   UMODE = "ISREDIT"
   ADDRESS ISPEXEC "CONTROL ERRORS RETURN"
   ADDRESS ISREDIT
   "MACRO (LEFT,RIGHT) NOPROCESS"
   IF LEFT = '?' THEN SIGNAL DISPDOC

   IF LEFT <> "" AND RIGHT = "" THEN DO
      "ISREDIT (L2,RIGHT) = BOUNDS"
      END

   "PROCESS RANGE C"
   IF RC > 0 THEN DO
      "(TOP) = LINENUM .ZFIRST"
      "(BOT) = LINENUM .ZLAST"
   END
   ELSE DO
      "(TOP) = LINENUM .ZFRANGE"
      "(BOT) = LINENUM .ZLRANGE"
   END

   "ISREDIT("LB","RB") = BOUNDS"
   IF LEFT  <> "" THEN LB = LEFT
   IF RIGHT <> "" THEN RB = RIGHT

   DO II = TOP TO BOT BY 1
      "ISREDIT (RECORD) = LINE &II"
      DO JJ = RB TO LB BY -1 WHILE(SUBSTR(RECORD,JJ,1) = ' ')
         END
      DO KK = LB TO RB BY  1 WHILE(SUBSTR(RECORD,KK,1) = ' ')
         END
      IF KK <= JJ THEN DO
         NN = ( RB - JJ + KK - LB )
         LL = NN % 2
         MM = NN - LL
         RECORD = SUBSTR(RECORD,1,LB-1)  || COPIES(' ',LL),
            || SUBSTR(RECORD,KK,JJ-KK+1) || COPIES(' ',MM),
            || SUBSTR(RECORD,RB+1)
         "ISREDIT LINE &II = &STR(RECORD)"
         END
      END

QUIT:
   ADDRESS ISPEXEC
   X = MSG(SAVEMSG)
   ADDRESS ISREDIT "LOCATE" TOP
   EXIT(0)

DISPDOC:
   ADDRESS TSO "CLEAR"
   SAY "CENTER - SHIFT TEXT TO AS CLOSE TO CENTER AS POSSIBLE     "
   SAY
   SAY " FORMAT "
   SAY
   SAY "    CENTER  ( LEFT-COLUMN RIGHT-COLUMN )                  "
   SAY
   SAY "       CENTERS TEXT WITHIN A MARKED RANGE OF LINES (C, C# "
   SAY "       OR CC MARKED) OR WITHIN THE ENTIRE FILE. THE TEXT  "
   SAY "       IS CENTERED WITHIN THE CURRENT BOUNDS OR THE LEFT  "
   SAY "       AND RIGHT COLUMNS IF SPECIFIED.                    "
   SAY
   EXIT(1)

