//-YOUR-USERID-V JOB  (-YOUR-ACCT-INFO-),'-YOUR-NAME-',
//             CLASS=2,MSGCLASS=X,NOTIFY=-YOUR-USERID-
//SUMMARY    EXEC     PGM=VALUES,REGION=464M,
//             PARM='HEAP(01M,01M,ANYWHERE)/VALUES'
//I            DD       DISP=SHR,DCB=BUFNO=32,
//             DSN=...
//SYSIN        DD       *
00026-00030 SOME COMMENT...
    ...     COL 5 <> '-' MEANS SUMMARIZE AS IF INDIVIDUAL BYTES
    ...        AS MANY FIELDS AS DESIRED
    ...           ANYTHING AFTER COLUMN 11 IS CONSIDERED A COMMENT
    ...           AND DISPLAYED ON THE SYSPRINT REPORT
//STEPLIB      DD       DISP=SHR,DSN=-YOUR-LOADLIB-
//SYSPRINT     DD       SYSOUT=*
//***
