//-YOUR-USERID-W JOB  (-YOUR-ACCT-INFO-),'-YOUR-NAME-',
//             CLASS=2,MSGCLASS=X,NOTIFY=-YOUR-USERID-
//***
//SETWAIT    EXEC     PGM=WAIT,PARM=0090
//STEPLIB      DD       DISP=SHR,DSN=-YOUR-LOADLIB-
//***
