//CEB40DS JOB (*),'*',TIME=(0,10),MSGCLASS=Y,
//        NOTIFY=$
//ASM   EXEC ASMHCL, ARM.C='OBJECT,NODECK',
//            PARM.LKED='LIST,MAP,LET'
//ASM.SYSLIB DD DSN=SYS1.MACLIB,DISP=SHR
//           DD DSN=SYS1.MODGEN,DISP=SHR
//           DD DSN=CEB40.NEW.MACLIB,DISP=SHR
//ASM.SYSIN  DD DSN=CEB40.V24.ACU.ASM(CACHSTAT),DISP=SHR
//LKED.SYSLMOD DD DSN=CEB40.V24.ACU.ISPLLIB(CACHSTAT),DISP=SHR
