//*        JOB CARD GOES HERE
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
//*                                                                   *
//*  COMPENENT LIST FOR THIS DIALOG:                                  *
//*                                                                   *
//*  1)    MANY PANELS                                                *
//*  2)  1 PROGRAM                                                    *
//*                                                                   *
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
//*                                                                   *
//*  THIS JCL WILL RUN AN IEBCOPY TO COPY THE COMPONENTS FOR THE NEW  *
//*  COMMANDS FUNCTION.                                               *
//*                                                                   *
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
//*                                                                   *
//*  THIS JCL WILL REPLACE MEMBERS IF THEY ALREADY EXIST.             *
//*                                                                   *
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
//*                                                                   *
//STEP1    EXEC PGM=IEBCOPY,REGION=1024K
//SYSPRINT DD  SYSOUT=*
//SYSUT3   DD  UNIT=SYSDA,SPACE=(TRK,(5,1))
//SYSUT4   DD  UNIT=SYSDA,SPACE=(TRK,(5,1))
//INDD1    DD  DISP=SHR,DSN=GUIDE.PLIB                  <== MODIFY ==
//OUTDD1   DD  DISP=SHR,DSN=INSTALL.ISPPLIB             <== MODIFY ==
//SYSIN    DD  *
           COPY INDD=((INDD1,R)),OUTDD=OUTDD1
          S M=$BR
          S M=$BREAKSE
          S M=$COMMAND
          S M=$CURSOR
          S M=$DOWN
          S M=$DSM
          S M=$DSNLIST
          S M=$ED
          S M=$END
          S M=$HELP
          S M=$HOLD
          S M=$IBM
          S M=$KBR
          S M=$KBR$2
          S M=$KED
          S M=$KED$2
          S M=$KEYS
          S M=$LEFT
          S M=$LISTA
          S M=$LOGMSG
          S M=$NOP
          S M=$PANELID
          S M=$PFKINIT
          S M=$PRINT
          S M=$PRINTL
          S M=$PRINTLH
          S M=$RCHANGE
          S M=$RETURN
          S M=$RFIND
          S M=$RIGHT
          S M=$SECURE
          S M=$SPLIT
          S M=$SPLITV
          S M=$SUGGEST
          S M=$SWAP
          S M=$TSO
          S M=$TSOCMD
          S M=$UP
          S M=CMDB
          S M=CMDB1
          S M=COMHMAN
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
//ASM1     EXEC    PGM=IEV90,REGION=1024K,
//             PARM='RENT,LOAD,NOOBJECT,DECK,TERM'
//SYSUT1   DD  DSN=&&SYSUT1,
//             SPACE=(6400,(160,20)),
//             UNIT=SYSDA
//SYSUT2   DD  DSN=&&SYSUT2,
//             SPACE=(6400,(160,20)),
//             UNIT=SYSDA
//SYSUT3   DD  DSN=&&SYSUT3,
//             SPACE=(6400,(160,20)),
//             UNIT=SYSDA
//SYSPUNCH DD  DSN=&&LOAD1,
//             UNIT=SYSDA,
//             DISP=(MOD,PASS),
//             DCB=(BLKSIZE=400,RECFM=FB),
//             SPACE=(6400,(75,20))
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DCB=BLKSIZE=16000,
//             DSN=GUIDE.ISPFMACS                    <== MODIFY ==
//         DD  DSN=SYS1.MACLIB,DISP=SHR
//SYSIN    DD  DISP=SHR,DSN=GUIDE.SOURCE(CMD0TABL)   <== MODIFY ==
//SYSTERM  DD  SYSOUT=*
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
//LINK     EXEC PGM=IEWL,
//             REGION=1024K,
//             PARM=(XREF,RENT),
//             COND=(7,LT)
//SYSPRINT DD  SYSOUT=*
//SYSLMOD  DD  DISP=SHR,DSN=INSTALL.ISPLLIB             <== MODIFY ==
//SYSUT1   DD  DSN=&&SYSUT1,
//             SPACE=(1024,(500,100)),
//             UNIT=SYSDA
//SYSLIN   DD  DSN=&&LOAD1,DISP=(OLD,DELETE)
//         DD  *
  NAME CMD0TABL(R)
