)ATTR
~ TYPE(OUTPUT) INTENS(HIGH) JUST(LEFT)
)BODY
+%Line commands:
+
+ %B +  -   Browse member
+ %E +  -   Edit member
+ %V +  -   View member
+ %BD+  -   Browse dataset
+ %ED+  -   Edit dataset
+ %VD+  -   View dataset
+
+
)END
