/* REXX */
ARG MEMBER
/* ALLOCATE XREF CLUSTER */
"ALLOC F(PDSFILE) DA('PDSX.PDSMEM.DATAV') SHR REU"
/* ADD YOUR PANEL LIBRARY */
ADDRESS ISPEXEC,
"LIBDEF ISPPLIB DATASET ID('YOUR PANEL LIBRARY')"
"CALL 'RZ22.SYS.LOAD(PDSMEM4)' '/"MEMBER"'"
ADDRESS ISPEXEC "LIBDEF ISPPLIB"
RETURN
