)PANEL KEYLIST (ISRHELP ISR)
)ATTR
   % TYPE(ET)
   _ TYPE(NEF) PAD(USER) CAPS(ON)
   + TYPE(NT)
   ` TYPE(SAC)
   \ AREA(SCRL) EXTEND(ON)
)BODY
%TSADMIN  -------------------- TABLE OF CONTENTS ---------------------- TUTORIAL
%OPTION  ===>_ZCMD                                                             +
\S1                                                                            \
)AREA S1
%                ----------------------------------------------
                 | SPI Expert mode tutorial version 1.5       |
                 ----------------------------------------------
+  The following topics are presented in sequence, or may be selected by
   entering a selection code in the option field:
      `1+ Basics          - Basic command functions
      `2+ Listing         - Listing ACIDs from the database
      `3+ Addition        - Adding IDs to the database
      `4+ Authorities     - Granting authority clusters
      `5+ Backup          - Backing up and retrieving ID images
      `6+ Conversion      - Converting IDs and resources
      `7+ Deletion        - Deleting IDs from the database
      `8+ Utility DSN     - Accessing the utility datasets
      `9+ Profiles        - Profile manipulation
     `10+ Group commands  - Issuing commands for multiple IDs
     `11+ Internal Options- TS-Admin internal commands
)INIT
  &ZHTOP = SPI00003   /* TUTORIAL TABLE OF CONTENTS        */
  &ZHINDEX= SPI00003   /* TUTORIAL TABLE OF CONTENTS        */
)PROC
   &ZSEL = TRANS(&ZCMD
                1,SPI01000
                2,SPI02000
                3,SPI03000
                4,SPI04000
                5,SPI05000
                6,SPI06000
                7,SPI07000
                8,SPI08000
                9,SPI09000
               10,SPI10000
               11,SPI11000
               20,*SPI20000
               21,*SPI21000
                )
)END
/*                                                                */
