)PANEL KEYLIST (ISRHELP ISR)
)ATTR
   % TYPE(ET)
   _ TYPE(NEF) PAD(USER) CAPS(ON)
   + TYPE(NT)
   # AREA(SCRL) EXTEND(ON)
)BODY
%TUTORIAL -------------------TS-Admin Commandload command---------------TUTORIAL
%COMMAND ===>_ZCMD                                                             +
%
+  TS-Admin                                                                    +
#S1                                                                            #
)AREA S1
   This command loads a new command table from the dataset specified
   in the ACID field. This would normally be done to test a new
   command table prior to implementing it on a large scale.


   Note: This command can radically alter your environment with no
   visual indicator.

)INIT
)PROC
)END
