)ATTR
#  TYPE(TEXT) COLOR(TURQ) INTENS(HIGH)
@ TYPE(INPUT) INTENS(HIGH) COLOR(WHITE) JUST(LEFT)
¬ TYPE(TEXT) INTENS(HIGH) COLOR(WHITE)
/  TYPE(TEXT) COLOR(RED) INTENS(HIGH)
)BODY WINDOW(60,10)
%---Message Display Service             +
#OPTION  ===>_opt
/ &POPMSG
#Type     ==>¬&type                 +
#Access   ==>¬&access                                     +
#Resource ==>¬&rsname                                     +
#Library  ==>¬&library                                    +
#Facility ==>¬&facility +    #Until   ==>¬&until          +
#Action   ==>¬&Action  +     #Program ==>¬&privpgm        +
#Other    ==>¬&Other                                      +
)INIT
  .HELP = tsstut
  &ZHTOP = ISR00003   /* fdIAL TABLE OF CONTENTS           */
)PROC
)END
