//QC22505M JOB (),'DISASM COMPILE',
//  CLASS=D,NOTIFY=QC22505,MSGCLASS=X,MSGLEVEL=(1,1)
//* JOB(DISASMA) - ASSEMBLE DISASSEMBLER
//S0  EXEC ASMHCL,CLASS='*',
// PARM.ASM='OBJECT,NODECK,BATCH',
// PARM.LKED='XREF,LET,LIST,NCAL'
//ASM.SYSLIB DD DISP=SHR,DSN=SYS1.MACLIB
//           DD DISP=SHR,DSN=SYS1.MODGEN
//           DD DISP=SHR,DSN=SYS1.ATSOMAC
//           DD DISP=SHR,DSN=QC22505.DISASM2.ASM
//ASM.SYSIN DD DISP=SHR,DSN=QC22505.DISASM2.ASM(DISASM)
//          DD DISP=SHR,DSN=QC22505.DISASM2.ASM(DISASM1)
//          DD DISP=SHR,DSN=QC22505.DISASM2.ASM(DISASM2)
//LKED.SYSLMOD DD DISP=SHR,DSN=QC22505.TSO2.LOAD
//LKED.SYSIN DD *
 NAME DISASM(R)
/*
