)CM*------------------------------------------------------------------*
)CM*  Purpose:  RACFADM - General Resources - SAve command
)CM*------------------------------------------------------------------*
)CM*  FLG  YYMMDD  USERID   DESCRIPTION
)CM*  ---  ------  -------  ------------------------------------------
)CM*  @A1  200616  RACFA    Added capability to SAve file as TXT/CSV
)CM*  @A0  200611  RACFA    Created skeleton
)CM*------------------------------------------------------------------*
)SEL &RACFSFIL = T
 &ZDATE ------------( RACFADM - General Resources )------------ &ZTIME
)BLANK
)TB 2 11 65
!PROFILE:!&PROFILE!&TYPE
)TB 2 11 21
!CLASS:!&RCLASS
)TB 2 11 21 40 47 55
!UACC:!&UACC!(Default access)!OWNER:!&OWNER!(Owner of profile)
!WARNING:!&WARN!(YES/NO)!AUDIT:!&AUDIT
)SETF DATA    = &LEFT(&DATA,70, )
!DATA:!&DATA
)BLANK
 Group/ID    Access
 ---------------------------------------------------------------------
)TB 2 14
)DOT &TABLEB
)SETF ID      = &LEFT(&ID,8, )
)SETF ACC     = &LEFT(&ACC,58, )
!&ID!&ACC
)ENDDOT
)ENDSEL
)SEL &RACFSFIL = C
RACFADM - General Resources
Group/ID,Access
--------,------
)DOT &TABLEB
)SETF ID      = &STRIP(&ID,, )
)SETF ACC     = &STRIP(&ACC,, )
&ID,&ACC
)ENDDOT
)ENDSEL
