//CBT1116 JOB 527TSO000S0008,VSAMANAL,CLASS=J,MSGCLASS=6,
//          NOTIFY=TS15500
//STEP00    EXEC PLIX,SO=6
//SYSIN     DD   DSN=TS15500.CBT1116.PDS(VSAMANDX),DISP=SHR
//STEP01    EXEC TESTLINK,SO=6,LIB='SYS2.MLINKLIB',NAME=VSAMANDX
//STEP02    EXEC ASMBLR,SO=6,LIB='TS15500.CBT1116.PDS'
//SYSLIB    DD   DCB=BLKSIZE=32720
//SYSIN     DD   DSN=TS15500.CBT1116.PDS(VSAMADTL),DISP=SHR
//STEP03    EXEC TESTLINK,SO=6,LIB='SYS2.MLINKLIB',NAME=VSAMADTL
//STEP04    EXEC ASMBLR,SO=6,LIB='TS15500.CBT1116.PDS'
//SYSLIB    DD   DCB=BLKSIZE=32720
//SYSIN     DD   DSN=TS15500.CBT1116.PDS(VSAMAGET),DISP=SHR
//STEP05    EXEC TESTLINK,SO=6,LIB='SYS2.MLINKLIB',NAME=VSAMAGET
//STEP06    EXEC ASMBLR,SO=6,LIB='TS15500.CBT1116.PDS'
//SYSLIB    DD   DCB=BLKSIZE=32720
//SYSIN     DD   DSN=TS15500.CBT1116.PDS(VSAMAHLP),DISP=SHR
//STEP07    EXEC TESTLINK,SO=6,LIB='SYS2.MLINKLIB',NAME=VSAMAHLP
//STEP08    EXEC ASMBLR,SO=6,LIB='TS15500.CBT1116.PDS'
//SYSLIB    DD   DCB=BLKSIZE=32720
//SYSIN     DD   DSN=TS15500.CBT1116.PDS(VSAMANAL),DISP=SHR
//STEP09    EXEC TESTLINK,SO=6,LIB='SYS2.MLINKLIB',NAME=VSAMANAL
 INCLUDE A(VSAMANDX)
 INCLUDE B(IBMBPIIA)
 INCLUDE B(IBMBPGRA)
 INCLUDE B(IBMBPITA)
//A         DD   DSN=SYS2.MLINKLIB,DISP=SHR
//B         DD   DSN=SYS2.MLINKLIB,DISP=SHR
//STEP10    EXEC ASMBLR,SO=6,LIB='TS15500.CBT1116.PDS'
//SYSLIB    DD   DCB=BLKSIZE=32720
//SYSIN     DD   DSN=TS15500.CBT1116.PDS(VSAMSIZE),DISP=SHR
//STEP11    EXEC TESTLINK,SO=6,LIB='SYS2.MLINKLIB',NAME=VSAMSIZE
