)BODY
%TUTORIAL -------------------  RECEIVE PROCESSING -------------------- TUTORIAL
%COMMAND ===>_ZCMD
%
+  Entering the value R in the "RECEIVE Processing ===>" field invokes
+ RECEIVE command processing.  The RECEIVE command obtains data transmitted
+ to your TSO userid.  During TSO LOGON the RECEIVE command is invoked so
+ that any data transmitted will be automatically received.  During a TSO
+ session you will be notified of any data that is transmitted to you.  You
+ can receive this data in one of two ways:
+
+  1. Enter R in the "RECEIVE Processing ===>" field
+  2. From the "COMMAND ===>" field on any SPF screen, enter: TSO RECEIVE
+
+ RECEIVE will display descriptive information about the incoming data. You
+ will be prompted for information to control the RECEIVE operation.  The most
+ common responses used to control RECEIVE processing are reviewed on the
+ following screens.  To view a list of all possible responses, enter:
+ TSO HELP RECEIVE in the "COMMAND ===>" field on any screen.  Notification
+ of data received will be transmitted back to the sender automatically.
+
% Tutorial continued on next screen  ... press ENTER to continue. +
+
+
+Press%PF3+to exit this screen
)INIT
  &ZCONT = XMTREC2T
)PROC
)END
