//SBGOLOBL JOB (ACCT#),PDSLOAD,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//*    PDSLOAD JOB TO CREATE FB-80 REXX LIBRARY
//*
//TSOBATCH EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
   RECEIVE INDS('SBGOLOB.CBT488.FILE220(PDSLOAD)')
   DSN ('SBGOLOB.FILE220.LOADLIB') VOL(WORKE2)
/*
//*
//LOAD   EXEC PGM=PDSLOAD
//STEPLIB  DD DISP=SHR,DSN=SBGOLOB.FILE220.LOADLIB
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=SBGOLOB.CBT488.FILE220(REXXES)
//SYSUT2   DD UNIT=SYSALLDA,VOL=SER=WORKE2,
//             DSN=SBGOLOB.FB80PDS.FILE220,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(30,45,44),RLSE)
