//T       PROC V=                   Vol Ser for HETUTL
//IEFPROC EXEC PGM=CHANGE71,PARM=(,@@@@@@,&V,)
//SYSUT1   DD  DISP=SHR,DSN=SYS1.xxxxLIB(TAPE2HET)
//SYSUT2   DD  SYSOUT=(A,INTRDR),
//             RECFM=F,LRECL=80,BLKSIZE=80,BUFNO=1
