STSAD0202
Tz/OS MVS Diagnosis -Tools and Service Aids
T-Chapter 2.
T-Obtaining SVC dumps
E"Kenneth Tomiak"<CBT_Ken@KTomiak.BIZ>
Z20180517-180107
*
@IBM Corporation
*
Biea2v1c2.pdf
BGA22-7589-19 z/OS MVS Diagnosis
B-Tools and Service Aids
BVersion 1 Release 13
*
NTools and Service Aids
N======================
NChapter 2: SVC dump
N-------------------
NObtaining SVC dumps
N-------------------
N
NIssuing a macro for SVC dump
N----------------------------
NObtain an SVC dump by issuing a SDUMP or SDUMPX macro in an authorized
Nprogram, issuing a DUMP operator command, issuing a SLIP operator
Ncommand, or using a SLIP command in the IEASLPxx parmlib member.
N
D**************************************************************
D**                                                           *
D**  This is a sample assembler language program that is      *
D**  used with the TEST tutorial in the publication,          *
D**  TSO/E Programming Guide.                                 *
D**                                                           *
D**************************************************************
DSAMP1    CSECT
D         STM   14,12,12(13)
D         BALR  12,0
D         USING *,12
D         ST    13,SAVE+4
D         LA    15,SAVE
D         ST    15,8(13)
D         LR    13,15
DSTOP1    LH    3,HALFCON
D         SDUMPX
DSTOP2    A     3,FULLCON
DSTOP3    ST    3,HEXCON
D         L     13,4(13)
D         LM    14,12,12(13)
D         BR    14
DSAVE     DC    18F'0'
DADCON    DC    A(SAVE)
DFULLCON  DC    F'-1'
DHEXCON   DC    XL4'FD38'
DHALFCON  DC    H'32'
DCHARCON  DC    CL10'TEST EXAMP'
DPACKCON  DC    PL4'25'
DBINCON   DC    B'10101100'
D         END   SAMP1
N
NOR Sample2
N
D**************************************************************
D**                                                           *
D**  This is a sample assembler language program that is      *
D**  used with the TEST tutorial in the publication,          *
D**  TSO/E Programming Guide.                                 *
D**                                                           *
D** NOTE: There is an error in this program.  It is intended  *
D**       to be located and fixed in the TEST tutorial.       *
D**************************************************************
DTABAVG   CSECT
D         STM   14,12,12(13)
D         BALR  12,0
D         USING *,12
D         ST    13,SAVE+4
D         LA    15,SAVE
D         ST    15,8(13)
D         LR    13,15
D         OPEN  (OUTDCB,(OUTPUT))
D         L     7,TABSIZE
D         SR    6,6
D         SR    5,5
DADDIT    AH    5,TAB(6)
D         LA    6,2(6)
D         BCT   7,ADDIT
D         ST    5,SUM
D         SR    4,4
D         DR    4,7
D         SDUMPX
D         STM   4,5,AVG
D         PUT   OUTDCB,OUTMSG
D         CLOSE (OUTDCB)
D         L     13,4(13)
D         LM    14,12,12(13)
D         BR    14
DSAVE     DC    18F'0'
DTABSIZE  DC    F'12'
DAVG      DC    2F'0'
DSUM      DC    F'0'
DTAB      DC    H'31'
D         DC    H'29'
D         DC    H'31'
D         DC    H'30'
D         DC    H'31'
D         DC    H'30'
D         DC    H'31'
D         DC    H'31'
D         DC    H'30'
D         DC    H'31'
D         DC    H'30'
D         DC    H'31'
DOUTMSG   DC    CL50'TABLE AVERAGE PROGRAM                            '
DOUTDCB   DCB   DDNAME=OUTDD,LRECL=50,BLKSIZE=50,RECFM=F,               *
D               MACRF=(PM),DSORG=PS
D         END   TABAVG
N
NOperator activities
N-------------------
NFrom a console with master authority, the operator can enter either of
Nthe following commands:
N-> DUMP operator command.
N-> SLIP operator command.
N
NDUMP operator command
N---------------------
DDUMP COMM=(title for the dump)
IThe system will respond with the message:
I nn IEE094D SPECIFY OPERAND(S) FOR DUMP COMMAND
N
NReply to message nn:
Ir nn,jobname=name-of-your-job
Ir nn,u  dumps the master scheduler address space
Ir nn,tsoname=userid
Ir nn,asid=hex-asid or decimal-asid?
N
NSLIP operator command
N---------------------
DSLIP SET,ACTION=SVCD,ERRTYP=PROG,JOBNAME=MYJOB1,END
N
NFinding SVC dumps
N-----------------
NIssue one of the display commands:
NStatic SYS1.DUMPnn data sets
DDISPLAY DUMP,TITLE,DSN=ALL
N
NAutomatically allocated dump data sets
DDISPLAY DUMP,TITLE,AUTODSN=5
* End of WISH.
