//SBGOLOBU JOB (CCMVS),ASMLINK,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X,COND=(1,LT)
//* ------------------------------------------------- *//
//*        ASM LINKEDIT Z/OS VERSION OF PACKRAT       *//
//*          USING THE ULUT UCB LOOKUP METHOD         *//
//* ------------------------------------------------- *//
//*
//*     YOU HAVE TO ASSEMBLE BOTH PACKRATU AND BACKENDU
//*      SOURCE MEMBERS.
//*
//ASMH EXEC PGM=ASMA90,PARM=(OBJECT,NODECK,NOESD,NORLD)
//SYSLIB   DD DISP=SHR,DSN=SYS1.MACLIB
//         DD DISP=SHR,DSN=SYS1.MODGEN
//         DD DISP=SHR,DSN=SBGOLOB.CBT490.FILE046   <== ULU**** MACROS
//SYSIN    DD DISP=SHR,DSN=SBGOLOB.CBT490.FILE046(PACKRATU)
//         DD DISP=SHR,DSN=SBGOLOB.CBT490.FILE046(BACKENDU)
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,2)
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD UNIT=VIO,SPACE=(TRK,1),DISP=(,PASS),DCB=BLKSIZE=3200,
//            DSN=&&TEMP
//*
//LKED   EXEC  PGM=HEWL,
//       PARM='NCAL,MAP,LIST,LET'
//SYSUT1   DD  UNIT=SYSDA,SPACE=(2048,(200,20))
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSLMOD  DD  DISP=SHR,DSN=SYS1.W$$.LINKLIB
//OBJECT   DD  DISP=(OLD,DELETE),DSN=&&TEMP
//SYSLIN   DD  *
 INCLUDE OBJECT
 ENTRY   PACKRAT
 SETSSI  CB490046
 SETCODE AC(0)
 NAME    PACKRATU(R)
/*
