)ATTR DEFAULT(@+_)
$ TYPE(INPUT)  INTENS(LOW)  COLOR(TURQ) HILITE(USCORE)
¬ TYPE(TEXT)   INTENS(LOW)  COLOR(GREEN)
* TYPE(TEXT)   INTENS(LOW)  COLOR(TURQ)
)BODY EXPAND(ÝÝ)
+Ý-Ý&p2pverno Primary HelpÝ-Ý
¬OPTION  ===>$zcmd                                                             +
¬
*  Display only if member names and stats match
¬
¬     This option will display a pds member only if the name appears
¬     in both partitioned datasets, AND the statistics for each member
¬     are exactly the same.
¬
¬     Members that appear only in one pds or the other will not be
¬     displayed and members that appear in both datasets but whose
¬     statistics are different will not be displayed.
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
)INIT
)PROC
)END
