)ATTR DEFAULT(@+_)
$ TYPE(INPUT)  INTENS(LOW)  COLOR(TURQ) HILITE(USCORE)
¬ TYPE(TEXT)   INTENS(LOW)  COLOR(GREEN)
* TYPE(TEXT)   INTENS(LOW)  COLOR(TURQ)
)BODY EXPAND(ÝÝ)
+Ý-Ý&p2pverno Primary HelpÝ-Ý
¬OPTION  ===>$zcmd                                                             +
¬
*  Display only if member names match
¬
¬     This option will display a pds member only if the name appears
¬     in both partitioned datasets.
¬
¬     A name that appears only in one pds or the other will not show
¬     on the member list panel.
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
)INIT
)PROC
)END
