)ATTR DEFAULT(@+_)
$ TYPE(INPUT)  INTENS(LOW)  COLOR(TURQ) HILITE(USCORE)
¬ TYPE(TEXT)   INTENS(LOW)  COLOR(GREEN)
)BODY EXPAND(ÝÝ)
+Ý-Ý&p2pverno Primary HelpÝ-Ý
¬OPTION  ===>$zcmd                                                             +
¬
¬  Line Command 'C' - Copy a member from one pds to the other
¬
¬      This command immediately copies the member to the other pds.
¬
¬      If you want command confirmation for line commands enter a 'Y'
¬      into the Confirm Line Command field for this pds.
¬
¬      See the tutorial panel for the Global Copy command for details
¬      of command confirmation.
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
)INIT
)PROC
)END
