)ATTR DEFAULT(@+_)
$ TYPE(INPUT)  INTENS(LOW)  COLOR(TURQ) HILITE(USCORE)
¬ TYPE(TEXT)   INTENS(LOW)  COLOR(GREEN)
)BODY EXPAND(ÝÝ)
+Ý-Ý&p2pverno Primary HelpÝ-Ý
¬OPTION  ===>$zcmd                                                             +
+
+                         ---------------------------
+                         |    Member List Panel    |
+                         ---------------------------
¬
¬  Most of the work in PDS2PDS is done from the Member List Panel,
¬  for which there are four types of commands.
¬
¬  The following topics are presented in sequence,
¬  or may be selected by number:
¬
@   1¬- Primary Commands
@   2¬- Confirm Line Command
@   3¬- Global Commands
@   4¬- Line Commands
¬
¬
¬
¬
¬
)INIT
)PROC
  &zsel = TRANS(&zcmd
                1,P2P21000
                2,P2P22000
                3,P2P23000
                4,P2P24000
                )
)END
