)ATTR DEFAULT(@+_)
$ TYPE(INPUT)  INTENS(LOW)  COLOR(TURQ) HILITE(USCORE)
¬ TYPE(TEXT)   INTENS(LOW)  COLOR(GREEN)
)BODY EXPAND(ÝÝ)
+Ý-Ý&p2pverno Primary HelpÝ-Ý
¬OPTION  ===>$zcmd                                                             +
¬
¬  Line Command 'V' - View a member of a pds
¬
¬      This command will View the member.
¬
¬      The Confirm Line Command setting is ignored for the View line
¬      command.
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
)INIT
)PROC
)END
