)ATTR DEFAULT(@+_)
$ TYPE(INPUT)  INTENS(LOW)  COLOR(TURQ) HILITE(USCORE)
¬ TYPE(TEXT)   INTENS(LOW)  COLOR(GREEN)
)BODY EXPAND(ÝÝ)
+Ý-Ý&p2pverno Primary HelpÝ-Ý
¬OPTION  ===>$zcmd                                                             +
¬
¬  Global Command 'TL' - Show Total Number of lines in datasets
¬
¬      This command will count the number of SIZE and INIT lines for
¬      each member, total them up, and show the results in a pop-up
¬      panel.
¬
¬      This command only counts lines for those members that have
¬      statistics. Members without statistics are not counted in the
¬      total. For this information to be accurate for all members of
¬      the datasets, all members must have statics showing.
¬
¬      Press PF3 to exit the pop-up panel and return to the Member List
¬      Panel.
¬
¬
¬
¬
¬
¬
)INIT
)PROC
)END
