)ATTR DEFAULT(@+_)
$ TYPE(INPUT)  INTENS(LOW)  COLOR(TURQ) HILITE(USCORE)
¬ TYPE(TEXT)   INTENS(LOW)  COLOR(GREEN)
)BODY EXPAND(ÝÝ)
+Ý-Ý&p2pverno Primary HelpÝ-Ý
¬OPTION  ===>$zcmd                                                             +
¬
¬  Global Command 'I' - Show Dataset Information
¬
¬      This command will display the attributes of the pds in a pop-up
¬      panel.
¬
¬      Press PF3 to exit the information panel and return to the member
¬      list panel.
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
¬
)INIT
)PROC
)END
