)PANEL KEYLIST (ISRHLP2 ISR)
)ATTR
  ¢ TYPE(TEXT)    INTENS(LOW)  COLOR(YELLOW)
  ! TYPE(TEXT)    INTENS(LOW)  COLOR(WHITE)
  + TYPE(TEXT)    INTENS(LOW)  COLOR(GREEN)
  " TYPE(TEXT)    INTENS(LOW)  COLOR(TURQ)
  # AREA(SCRL) EXTEND(ON)
)BODY EXPAND(¯¯) DEFAULT($¦_)
¢MXI - HELP - MAP Command ------------------------------------------------------
!Option ===>_ZCMD
#MXIHAREA                                                                      #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
#                                                                              #
+
)AREA MXIHAREA
!Function
+  Displays storage in DSECT form using the specified control block name.
+
+  If issued on the"MEM+command display, it captures the starting address of
+  the storage display and then dynamically constructs and issues the following
+  command :"MEM address MAP(mapname)+
+
+  If issued on a display other than MEM, it will dynamically construct and
+  issue the following command :"MEM @mapname MAP(mapname)+
+
+  This command is useful when you have followed a 'point-and-shoot' address and
+  wish to view the storage using a known DSECT control block name.
+
!Command Syntax
+ "MEM mapname
+
!Keywords
  "mapname    +Specifies that the storage should be displayed in the DSECT form
              +for control block 'mapname'.
+
!Examples
+ "MAP TCB    +Show the storage for the TCB as a TCB DSECT
+
!Output Panel Fields
+  The output is exactly the same as the"MEM+command.
+
)INIT
.ATTRCHAR(¢)  = 'COLOR(&M7CC) HILITE(&M7CH) INTENS(&M7CI)'
.ATTRCHAR(!)  = 'COLOR(&M08C) HILITE(&M08H) INTENS(&M08I)'
.ATTRCHAR(+)  = 'COLOR(&M06C) HILITE(&M06H) INTENS(&M06I)'
.ATTRCHAR(")  = 'COLOR(&M09C) HILITE(&M09H) INTENS(&M09I)'
)PROC
 &ZUP   = MXIHTOC
 &ZCONT = MXIHPEEK
)END
