//JOBNAME  JOB 'PGMRNAME',MSGLEVEL=(1,1),
//         CLASS=A,MSGCLASS=X,REGION=1024K
//*
//*   JOB TO BUILD @PARSE, @SYNTXCK, @INTRPRT AND #PUTMSG
//*
//S1       EXEC ASMHCL,PARM.C='OBJECT,XREF(SHORT)',
//          PARM.L='MAP,LET,XREF,LIST=SUMMARY,NCAL'
//C.SYSLIB  DD
//          DD DISP=SHR,DSN=userid.RTI.MACLIB
//C.SYSIN   DD DISP=SHR,DSN=userid.RTI.SOURCE(@PARSE)
//L.SYSLMOD DD DISP=SHR,DSN=userid.RTI.LOADLIB(@PARSE)
//*
//S2       EXEC ASMHCL,PARM.C='OBJECT,XREF(SHORT)',
//          PARM.L='MAP,LET,XREF,LIST=SUMMARY,NCAL'
//C.SYSLIB  DD
//          DD DISP=SHR,DSN=userid.RTI.MACLIB
//C.SYSIN   DD DISP=SHR,DSN=userid.RTI.SOURCE(@SYNTXCK)
//L.SYSLMOD DD DISP=SHR,DSN=userid.RTI.LOADLIB(@SYNTXCK)
//*
//S3       EXEC ASMHCL,PARM.C='OBJECT,XREF(SHORT)',
//          PARM.L='MAP,LET,XREF,LIST=SUMMARY,NCAL'
//C.SYSLIB  DD
//          DD DISP=SHR,DSN=userid.RTI.MACLIB
//C.SYSIN   DD DISP=SHR,DSN=userid.RTI.SOURCE(@INTRPRT)
//L.SYSLMOD DD DISP=SHR,DSN=userid.RTI.LOADLIB(@INTRPRT)
//*
//S4       EXEC ASMHCL,PARM.C='OBJECT,XREF(SHORT)',
//          PARM.L='MAP,LET,XREF,LIST=SUMMARY,NCAL'
//C.SYSLIB  DD
//          DD DISP=SHR,DSN=userid.RTI.MACLIB
//C.SYSIN   DD DISP=SHR,DSN=userid.RTI.SOURCE(#PUTMSG)
//L.SYSLMOD DD DISP=SHR,DSN=userid.RTI.LOADLIB(#PUTMSG)
