         MACRO
         CAMLSTD &LIST=,&DSECT=
         PUSH  PRINT
         AIF   ('&LIST' EQ 'NO').OFF
         PRINT ON
         AGO   .GEN
.OFF     ANOP
         PRINT OFF
.GEN     AIF   ('&DSECT' EQ 'NO').NODS
CAMLSTD  DSECT
.NODS    ANOP  ,
         DS    0F
CAMOPTN1 DS    XL1            * OPTIONS BYTE  1
CAMCVOL  EQU   X'80'          * CAT IS NOT ON SYSRES
*              X'40'          * UNKNOWN
CAMCAT   EQU   X'20'          * CAT OR CATBX SPECIFIED
CAMRECAT EQU   X'10'          * RECAT SPECIFIED
CAMUNCAT EQU   X'08'          * UNCAT OR UNCATDX SPECIFIED
*              X'04'          * UNKNOWN
CAMBLOCK EQU   X'02'          * LOCATE-BY-BLOCK REQUEST
*              X'01'          * UNKNOWN
*
CAMOPTN2 DS    XL1            * OPTIONS BYTE  2
*              X'80'          * UNKNOWN
CAMBLDX  EQU   X'40'          * BLDX OR CATBX SPECIFIED
CAMBLDG  EQU   X'20'          * BLDG SPECIFIED
CAMBLDA  EQU   X'10'          * BLDA SPECIFIED
CAMLNKX  EQU   X'08'          * LNKX SPECIFIED
CAMDLTX  EQU   X'04'          * DLTX SPECIFIED
CAMDSCBT EQU   X'02'          * DSCB-TTR SPECIFIED
CAMDLTA  EQU   X'01'          * DLTA SPECIFIED
*
CAMOPTN3 DS    XL1            * OPTIONS BYTE  3
CAMDRPX  EQU   X'80'          * DISCONNECT CVOLS REQUESTED
CAMDELET EQU   X'40'          * SCRATCH GDG DATASETS
*              X'20'          * UNKNOWN
*              X'10'          * UNKNOWN
CAMEMPTY EQU   X'08'          * EMPTY GDG INDX WHEN MAX CNT REACHED
CAMVSCAT EQU   X'04'          * SEARCH VS CAT FIRST
CAM1CAT  EQU   X'02'          * SEARCH ONLY ONE CATALOG
CAMAM0   EQU   X'01'          * VSAM CAT. (- VS CAT WHEN '0')
*
CAMGEN   DS    XL1            * MAXIMUM GENERATION COUNT
*
CAMPTR1  DS    F              * ADDR OF NAME FIELD IN CALLERS AREA.
*                                 FOR LOCATE-BY-BLOCK, THE NAME FIELD
*                                 CONTAINS A RELATIVETRACK ADDR.
*
CAMCVOLP DS    F              * ADDR OF CVOL VOLSER(A 6-BYTE FIELD)
*
CAMPTR3  DS    0A             * ADDR OF CALLER'S 3RD PARM. MEANING
*                                 DEPENDS ON THE FUNCTION:
CAMWORKP DS    0A             *  LOCATE    -    CALLER'S 256 BYTE WKA
CAMALIAP DS    0A             *  BLDA      -    8-BYTE NAME FIELD
CAMNCVLP DS    0A             *  LNKX      -    10-BYTE VOL.ID.
CAMVOLLP DS    0A             *  CAT,CATBX,RECAT- VOL LIST ADDR
         DS    A              *  OTHER     -    NOT USED
*
CAMDSCBP DS    F              * ADDR OF 3-BYTE TTR OF F1 DSCB
         POP   PRINT
         MEND
