//SPACE    JOB ....
//*
//STEP1   EXEC PGM=ASMA90,
//             PARM='NODECK,OBJECT,XREF(SHORT,UNREFS),NOALIGN',
//             REGION=6M
//SYSLIB    DD DISP=SHR,DSN=SYS1.MACLIB
//          DD DISP=SHR,DSN=SYS1.MODGEN
//SYSPRINT  DD SYSOUT=*
//SYSUT1    DD UNIT=SYSALLDA,
//             SPACE=(4096,(120,120),,,ROUND)
//SYSLIN    DD UNIT=SYSALLDA,DISP=(,PASS,DELETE),
//             DSN=&&OBJ,SPACE=(3040,(40,40),,,ROUND),
//             DCB=(RECFM=FB,LRECL=0080,BLKSIZE=0)
//SYSIN     DD DISP=SHR,DSN=hlq.SPACE.PDS(SPACE)  <=== Update !!!
//*
//STEP2   EXEC PGM=HEWL,
//             PARM='MAP,LET,LIST=SUMMARY,NCAL,RENT,REUS,REFR',
//             COND=(0,LT),
//             REGION=4M
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DISP=(OLD,DELETE,DELETE),DSN=&&OBJ
//SYSLMOD   DD DISP=SHR,DSN=load.library(SPACE)  <=== Update !!!
//
