)PANEL KEYLIST(ISRHLP2 ISR)
)ATTR FORMAT(MIX) DEFAULT(|+_)                             /* ENGLISH */
 } TYPE(TEXT)    INTENS(HIGH)  COLOR(GREEN) HILITE(REVERSE)
 ¢ TYPE(TEXT)    INTENS(HIGH)  COLOR(YELLOW)
 $ TYPE(TEXT)    INTENS(HIGH)  COLOR(TURQ)
 + TYPE(TEXT)    INTENS(LOW)   COLOR(GREEN)
 @ TYPE(TEXT)    INTENS(HIGH)   COLOR(WHITE)
27 AREA(SCRL) EXTEND(ON)
)BODY WINDOW(60,19) EXPAND(!!)
$COMMAND ===>_ZCMD                                      +
$                                                       +
@-!-! ¢Display Option@ !-!-
@ Detail Lines
$
SAREA01                                                 
                                                        
                                                        
                                                        
                                                        
                                                        
                                                        
                                                        
                                                        
                                                        
                                                        
                                                        
                                                        
                                                        
)AREA SAREA01
$ + Specifies whether or not detail lines (one for each
$ + selected DASD volume) are to be displayed.
$ +
$ + Valid values are:
$   Y+es and
$   N+o
$ +
$ + Default: Y
$ +          Detail lines will be displayed.
)INIT
  &PANEL   = 'SSCSPCF9'
)END
