)ATTR DEFAULT(%+_)

/******************************************************************************/
/*                                                                            */
/* NOTE:                                                                      */
/*    The above attribute defaults are equivalent to:                         */
/*                                                                            */
/*       )ATTR                                                                */
/*          % TYPE(TEXT)  INTENS(HIGH)                                        */
/*          + TYPE(TEXT)  INTENS(LOW)                                         */
/*          _ TYPE(INPUT) INTENS(HIGH)                                        */
/*                                                                            */
/******************************************************************************/

)BODY EXPAND(//)
%TUTORIAL/-/CUT and PASTE Help: The Default Table Name/-/
%COMMAND ===>_ZCMD                                                             +
%
%
+      The default table name will be assumed whenever you issue  the %CUT+
+      or%PASTE+command  without  a %tablename+ argument.  Initially,  the
+     %CUT and PASTE Defaults+panel will designate table name %AA+ as  the
+      default table,  but you can override this  specification  with  any
+      valid table name, if you wish.
+
+      Remember that table names consist  of  two  alphanumeric  character
+      positions  (i.e., decimal digits, case-insensitive letters,  or the
+      symbols '#', '$', '@').  Also,  for the numeric table names '00' to
+      '09',  only the rightmost character  position,  '0'  to  '9',  need
+      actually be typed;  the leading zero will,  then,  automatically be
+      added in.
+
+
+
+
+
+
+
)PROC

   &ZUP   = CUTHELP

)END
