         MACRO
&NAME    TESTMAC &START
         GBLB  &DMPFST1
.A$00    ANOP
&DMPFST1 SETB  1
         AIF   (&DMPFST1 EQ 0).A$01
FRED00   DC    C'EQ 1'
.A$01    ANOP
         AIF   (&DMPFST1 EQ 1).A$10
FRED01   DC    C'EQ 0'
.A$10    ANOP
&DMPFST1 SETB  0
         AIF   (&DMPFST1 EQ 0).A$11
FRED10   DC    C'EQ 1'
.A$11   ANOP
         AIF   (&DMPFST1 EQ 1).A$20
FRED11   DC    C'EQ 0'
.A$20    ANOP
&DMPFST1 SETB  1
         AIF   (&DMPFST1 EQ 0).A$21
FRED20   DC    C'EQ 1'
.A$21   ANOP
         AIF   (&DMPFST1 EQ 1).A$30
FRED21   DC    C'EQ 0'
.A$30    ANOP
&DMPFST1 SETB  0
         AIF   (&DMPFST1 EQ 0).A$31
FRED30   DC    C'EQ 1'
.A$31   ANOP
         AIF   (&DMPFST1 EQ 1).A$40
FRED31   DC    C'EQ 0'
.A$40    ANOP
         MEND
