//SICQ    JOB ,JACK,CLASS=Z
/*JOBPARM Q=F,I,CARDS=9999999
/*ROUTE  PUNCH X10 SIC
//COMP   PROC  PRE='NER.S685.',D=
//COMP   EXEC  PGM=COMPLIB
//SYSPRINT DD  SYSOUT=A
//SYSLIB   DD  DSN=&PRE.&D,DISP=SHR
//SYSUT2   DD  SYSOUT=B,HOLD=YES
//SYSIN    DD  DSN=*.SYSIN.SYSUT2,DISP=(OLD,PASS)
//PEND   PEND
//SYSIN  EXEC  PGM=IEBGENER
//SYSPRINT DD  DUMMY
//SYSIN    DD  DUMMY
//SYSUT2   DD  UNIT=VIO,SPACE=(CYL,1),DISP=(,PASS),
//             DCB=(LRECL=80,RECFM=FB,BLKSIZE=800)
//SYSUT1   DD  *
++SETLIB FLAGS=IEBUPDTE
++INCLUDE LIBRARY=ALL
/*
//QUEUE  EXEC  COMP,D='NEW.QUEUE'
//COMP.SYSIN DD *
++SETLIB FLAGS=IEBUPDTE
++INCLUDE $$$$$$$$
++INCLUDE $$INST
++INCLUDE $LOG
++INCLUDE $UFDOC
++INCLUDE CKPT
++INCLUDE FINDJOB
/*
