&TUTORIAL ------------- JTIP UTILITY - FETCH AND BROWSE -------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
   THE&FETCH AND BROWSE$FUNCTION ( OPTION&BLANK$) IS USED TO VIEW THE OUTPUT
   OF A JOB IN THE&FETCH$QUEUE. JOB OUTPUT IS FETCHED TO A TEMPORARY DATASET
   AND CONTROL IS PASSEDTO SPF BROWSE. ANY OF THE BROWSE OPTIONS CAN BE USED.

   FILL IN THE FOLLOWING FIELDS OF THE JTIP UTILITY MENU:
      - ENTER&BLANK$IN THE SELECT OPTION FIELD.
      - ENTER A&JOBNAME$OR&JOBID.$ ONE OR THE OTHER MUST BE SPECIFIED.

   THE FOLLOWING RULES APPLY FOR THE&DDNAME/DATASET ID$PARAMETERS WHEN
   USED WITH THE&BLANK$OPTION:

      -&DDNAME$AND&DATASET ID$ARE MUTUALLY EXCLUSIVE. CHOSE ONE OR THE OTHER.

      -&DDNAME$    -  ENTER THE 1 TO 8 CHARACTER DDNAME TO BE DISPLAYED.
      -&DATASET ID$-  ENTER THE 1 TO 4 DIGIT NUMBER OF THE DATASET TO BE
                      DISPLAYED. THIS IS THE NUMBER UNDER THE&PN$HEADING
                      OBTAINED WITH THE&SHOW FETCH$FUNCTION ( OPTION&S$).
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTJTIP  ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
