&TUTORIAL ------------ PAN EDIT - DISPLAY OPTION ---------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
                     &-----------------------------------&
                     &-            PAN EDIT             -&
                     &-      OPTION 'D' - DISPLAY       -&
                     &-----------------------------------$
$
$ THE DISPLAY FUNCTION PERFORMS THE FOLLOWING FUNCTION:
$   1. THE LAST ACTION PERFORMED USING PAN/TSO IS DISPLAYED.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTPANE  ');
4 * CHAR(8) INIT('VTPANE  ');
5 * CHAR(8) INIT('VTPAN01 ');
<END>
