//IBMUSERS JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//* Purpose of this program is to remove IPL text from a volume,
//*  and restore the volume to its original ICKDSF initted state,
//*  in Track 0.
//*   -------------------------------------------------
//*    IF YOU ARE ERASING THE IPL TEXT OFF A DISK PACK,
//*    YOU SHOULD PLEASE MAKE SURE THAT YOU BACK IT UP
//*    FIRST, USING TRK0SAVE.  THEN YOU CAN RESTORE IT
//*    LATER WITH TRK0UPD.
//*   -------------------------------------------------
//TRK0SAV1 EXEC PGM=TRK0INIT
//STEPLIB  DD  DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSUDUMP DD  SYSOUT=*
//DISKUPD  DD  UNIT=SYSALLDA,SPACE=(TRK,1),VOL=SER=TEST01
//*
