//SALBERTA  JOB  (U32048,DCSG),GUY,CLASS=R,MSGCLASS=T
//*
//*  ASSEMBLE THOSE MODULES THAT HAVE BEEN DISASSEMBLED,
//*  PARTIALLY COMMENTED, BUT NOT CHANGED
//*
//MAPEDIT  EXEC  ASMHC
//ASM.SYSIN  DD  DISP=SHR,DSN=SFTB.INSTALL.IEHMAP.SOURCE1(ZAPEDIT)
//MAPKEY   EXEC  ASMHC
//ASM.SYSIN  DD  DISP=SHR,DSN=SFTB.INSTALL.IEHMAP.SOURCE1(ZAPKEY)
