MAPVMSG  CSECT
MSG000   DC    X'08',C'MAP000I  '
MSG001   DC    X'29',C'MAP001I TSO SPECIFIED, OPERATION CANCELLED'
MSG002   DC    X'1A',C'MAP002T NO SYSINXXX DD CARD'
MSG003   DC    X'2D',C'MAP003E "        " - UNKNOWN OPERATION-OPERAND'
MSG004   DC    X'21',C'MAP004E F1 DOES NOT -> AT F3 OR F2'
MSG005   DC    X'1B',C'MAP005E F2 DOES NOT -> AT F3'
MSG006   DC    X'1B',C'MAP006E F4 DOES NOT -> AT F6'
MSG007   DC    X'21',C'MAP007I 99999 TOTAL TRACKS MISSING'
MSG008   DC    X'21',C'MAP008I 99999 TRACKS ACCOUNTED FOR'
MSG009   DC    X'24',C'MAP009E CANNOT FIND DDCARD FOR VOLUME'
MSG010   DC    X'1F',C'MAP010E DEVICE NOT DIRECT ACCESS'
MSG011   DC    X'1A',C'MAP011E UNKNOWN DEVICE TYPE'
MSG012   DC    X'22',C'MAP012E ATTEMPT TO OPEN VTOC FAILED'
MSG013   DC    X'18',C'MAP013E FIRST DSCB NOT F4'
MSG014   DC    X'24',C'MAP014E BAD DSCB; SHOULD HAVE BEEN F5'
MSG015   DC    X'08',C'MAP015I  '
MSG016   DC    X'15',C'MAP016E  CARD IN ERROR'
MSG017   DC    X'17',C'MAP017E CVOL NOT MOUNTED'
MSG018   DC    X'1C',C'MAP018E DATASET NOT CATALOGED'
MSG019   DC    X'23',C'MAP019E INDEX FOUND AT DATASET LEVEL'
MSG020   DC    X'23',C'MAP020E DATASET FOUND AT INDEX LEVEL'
MSG021   DC    X'23',C'MAP021E SYNTAX ERROR IN DATASET NAME'
MSG022   DC    X'25',C'MAP022E PERMANENT I/O ERROR IN CATALOG'
MSG023   DC    X'22',C'MAP023E RELATIVE TTR NOT IN CATALOG'
MSG024   DC    X'19',C'MAP024E VOLUME NOT MOUNTED'
MSG025   DC    X'23',C'MAP025E DATA SET NOT FOUND ON VOLUME'
MSG026   DC    X'22',C'MAP026E PERMANENT I/O ERROR IN VTOC'
MSG027   DC    X'1A',C'MAP027E INVALID WORKAREA ->'
MSG028   DC    X'17',C'MAP028E CCHH NOT IN VTOC'
MSG029   DC    X'15',C'MAP029E EOF READING F4'
MSG030   DC    X'19',C'MAP030E EOF READING 1ST F5'
MSG031   DC    X'1B',C'MAP031E F6 DOES NOT -> AT F6'
MSG032   DC    X'24',C'MAP032W *** NO MORE CORE, ABORTED ***'
MSG033   DC    X'1B',C'MAP033E F3 DOES NOT -> AT F3'
MSG034   DC    X'1A',C'MAP034E ERROR RE-WRITING F5'
MSG035   DC    X'27',C'MAP035W PERMANENT I/O ERROR IN DIRECTORY'
MSG036   DC    X'1C',C'MAP036I 99999 TRACKS REPLACED'
MSG037   DC    X'20',C'MAP037I 99999 TRACKS NOT REPLACED'
MSG038   DC    X'21',C'MAP038W VTOC CONTAMINATED, WARNING'
MSG039   DC    X'1B',C'MAP039E F5 DOES NOT -> AT F5'
MSG040   DC    X'34',C'MAP040I *** OUTPUT MAY BE ERRONEOUS'
         DC    C' DUE TO ERRORS ***'
MSG041   DC    X'19',C'MAP041I TOTALS FOR VOLUME:'
MSG042   DC    X'28',C'MAP042E "VOLIDX" DOES NOT CONTAIN CATALOG'
MSG043   DC    X'21',C'MAP043W AT XXXXXX DID NOT FIND ICE'
MSG044   DC    X'1A',C'MAP044W AT XXXXXX FOUND ICE'
MSG045   DC    X'29',C'MAP045W AT XXXXXX FOUND INVALID ENTRY TYPE'
MSG046   DC    X'23',C'MAP046E COULD NOT FIND SYSRES DEVICE'
MSG047   DC    X'26',C'MAP047I PASSWORD PROTECTED, NO PDS LIST'
MSG048   DC    X'20',C'MAP048W F0 KEY NOT ALL HEX ZEROES'
MSG049   DC    X'16',C'MAP049W FOUND SECOND F4'
MSG050   DC    X'1B',C'MAP050W FOUND UNCONNECTED F5'
MSG051   DC    X'1B',C'MAP051W FOUND UNCONNECTED F6'
MSG052   DC    X'1B',C'MAP052W FOUND UNCONNECTED F2'
MSG053   DC    X'1B',C'MAP053W FOUND UNCONNECTED F3'
MSG054   DC    X'1E',C'MAP054W FOUND UNKNOWN DSCB TYPE'
MSG055   DC    X'25',C'MAP055E VERIFY CANCELLED, NO MORE CORE'
MSG056   DC    X'08',C'MAP056I  '
MSG057   DC    X'08',C'MAP057I  '
MSG058   DC    X'15',C'MAP058W COULD NOT OPEN'
MSG059   DC    X'08',C'MAP059I  '
MSG060   DC    X'08',C'MAP060I  '
MSG061   DC    X'1E',C'MAP061E DSNAME GT 44 CHARACTERS'
MSG062   DC    X'1C',C'MAP062E VOLID GT 6 CHARACTERS'
MSG063   DC    X'20',C'MAP063E OPERATION GT 8 CHARACTERS'
MSG064   DC    X'21',C'MAP064E QUALIFIER GT 42 CHARACTERS'
MSG065   DC    X'08',C'MAP065I  '
MSG066   DC    X'08',C'MAP066I  '
MSG067   DC    X'1E',C'MAP067C SAVEAREA COUNT EXCEEDED'
MSG068   DC    X'08',C'MAP068I  '
MSG069   DC    X'08',C'MAP069I  '
MSG070   DC    X'08',C'MAP070I  '
MSG071   DC    X'08',C'MAP071I  '
MSG072   DC    X'08',C'MAP072I  '
MSG073   DC  AL1(55),C'MAP073I DYNAMIC ALLOC/DEALLOC OF CATALOG FAILED X
               XXXXXXXX'
MSG074   DC  AL1(38),C'MAP074I CVAF FREE SPACE RETURNED ERRORS'
MSG075   DC  AL1(36),C'MAP075I CVAF DSCB ERROR RC=XX STAT=XX'
         EJECT
MAPMSG00 CSECT
         DC    AL2(MSG000-MAPVMSG)
         DC    AL2(MSG001-MAPVMSG)
         DC    AL2(MSG002-MAPVMSG)
         DC    AL2(MSG003-MAPVMSG)
         DC    AL2(MSG004-MAPVMSG)
         DC    AL2(MSG005-MAPVMSG)
         DC    AL2(MSG006-MAPVMSG)
         DC    AL2(MSG007-MAPVMSG)
         DC    AL2(MSG008-MAPVMSG)
         DC    AL2(MSG009-MAPVMSG)
         DC    AL2(MSG010-MAPVMSG)
         DC    AL2(MSG011-MAPVMSG)
         DC    AL2(MSG012-MAPVMSG)
         DC    AL2(MSG013-MAPVMSG)
         DC    AL2(MSG014-MAPVMSG)
         DC    AL2(MSG015-MAPVMSG)
         DC    AL2(MSG016-MAPVMSG)
         DC    AL2(MSG017-MAPVMSG)
         DC    AL2(MSG018-MAPVMSG)
         DC    AL2(MSG019-MAPVMSG)
         DC    AL2(MSG020-MAPVMSG)
         DC    AL2(MSG021-MAPVMSG)
         DC    AL2(MSG022-MAPVMSG)
         DC    AL2(MSG023-MAPVMSG)
         DC    AL2(MSG024-MAPVMSG)
         DC    AL2(MSG025-MAPVMSG)
         DC    AL2(MSG026-MAPVMSG)
         DC    AL2(MSG027-MAPVMSG)
         DC    AL2(MSG028-MAPVMSG)
         DC    AL2(MSG029-MAPVMSG)
         DC    AL2(MSG030-MAPVMSG)
         DC    AL2(MSG031-MAPVMSG)
         DC    AL2(MSG032-MAPVMSG)
         DC    AL2(MSG033-MAPVMSG)
         DC    AL2(MSG034-MAPVMSG)
         DC    AL2(MSG035-MAPVMSG)
         DC    AL2(MSG036-MAPVMSG)
         DC    AL2(MSG037-MAPVMSG)
         DC    AL2(MSG038-MAPVMSG)
         DC    AL2(MSG039-MAPVMSG)
         DC    AL2(MSG040-MAPVMSG)
         DC    AL2(MSG041-MAPVMSG)
         DC    AL2(MSG042-MAPVMSG)
         DC    AL2(MSG043-MAPVMSG)
         DC    AL2(MSG044-MAPVMSG)
         DC    AL2(MSG045-MAPVMSG)
         DC    AL2(MSG046-MAPVMSG)
         DC    AL2(MSG047-MAPVMSG)
         DC    AL2(MSG048-MAPVMSG)
         DC    AL2(MSG049-MAPVMSG)
         DC    AL2(MSG050-MAPVMSG)
         DC    AL2(MSG051-MAPVMSG)
         DC    AL2(MSG052-MAPVMSG)
         DC    AL2(MSG053-MAPVMSG)
         DC    AL2(MSG054-MAPVMSG)
         DC    AL2(MSG055-MAPVMSG)
         DC    AL2(MSG056-MAPVMSG)
         DC    AL2(MSG057-MAPVMSG)
         DC    AL2(MSG058-MAPVMSG)
         DC    AL2(MSG059-MAPVMSG)
         DC    AL2(MSG060-MAPVMSG)
         DC    AL2(MSG061-MAPVMSG)
         DC    AL2(MSG062-MAPVMSG)
         DC    AL2(MSG063-MAPVMSG)
         DC    AL2(MSG064-MAPVMSG)
         DC    AL2(MSG065-MAPVMSG)
         DC    AL2(MSG066-MAPVMSG)
         DC    AL2(MSG067-MAPVMSG)
         DC    AL2(MSG068-MAPVMSG)
         DC    AL2(MSG069-MAPVMSG)
         DC    AL2(MSG070-MAPVMSG)
         DC    AL2(MSG071-MAPVMSG)
         DC    AL2(MSG072-MAPVMSG)
         DC    AL2(MSG073-MAPVMSG)
         DC    AL2(MSG074-MAPVMSG)
         DC    AL2(MSG075-MAPVMSG)
         END
