*        (C) COPYRIGHT 1989,1993 PRYCROFT SIX PTY LTD
DSST     DSECT                      DISK SPACE SNAP-SHOT TABLE.
DSSTSIZE DS    F                    SIZE OF THIS DSST.
DSSTADDR DS    A                    ADDRESS OF THIS DSST.
DSSTDSST DS    A                    ADDRESS OF NEXT DSST.
DSSTBACK DS    A                    ADDRESS OF PREVIOUS DSST.
DSSTTIME DS    F                    TIME OF SNAP-SHOT.
DSSTDATE DS    PL4                  DATE OF SNAP-SHOT.
DSSTBEND DS    0D
DSSTBLEN EQU   DSSTBEND-DSST        LENGTH OF DSST BASE.
*        END OF DSST BASE WHICH IS THREE (3) DOUBLEWORDS IN SIZE.
DSSTE    DS    0D                   DISK SPACE SNAP-SHOT TABLE ENTRY.
DSSTEUCB DS    A                    UCB ADDRESS OR DEVICE NUMBER.
DSSTEVOL DS    CL6                  VOLUME SERIAL NUMBER AT THE TIME.
DSSTEUSE DS    H                    VOLUME USAGE COUNT AT THE TIME.
DSSTEOPN DS    H                    VOLUME OPEN COUNT AT THE TIME.
DSSTECPV DS    H                    NUMBER OF CYLINDERS ON VOLUME.
DSSTETPC DS    H                    NUMBER OF TRACKS PER CYLINDER.
DSSTETSZ DS    H                    TRACK SIZE IN BYTES.
DSSTECYL DS    F                    FREE CYLINDER COUNT.
DSSTETRK DS    F                    FREE TRACK (NOT IN CYL) COUNT.
DSSTEEXT DS    F                    FREE EXTENT COUNT.
DSSTEMXC DS    F                    LARGEST FREE EXTENT CYLINDER COUNT.
DSSTEMXT DS    F                    LARGEST FREE EXTENT TRACK COUNT.
DSSTEGRP DS    CL8                  SMS STORAGE GROUP NAME.
DSSTEEND DS    0D
DSSTELEN EQU   DSSTEEND-DSSTE       LENGTH OF A DSST VOLUME ENTRY.
*        END OF DSST ENTRY WHICH IS SIX (6) DOUBLEWORDS IN SIZE.
