//TECH110L JOB (5304010530000000),'TECH.JEFF.KAPLAN',
// CLASS=S,MSGCLASS=G,MSGLEVEL=(1,1),NOTIFY=TECH110
//* ASREXIT REF SYS1.SAMPLIB(ASREXT1) AS PER CICS ESA 3.3 REQ
//S EXEC ASMHCL,PARM.L='AC=1,XREF,LIST,RENT'
//C.SYSLIB DD
//         DD DSN=SYS1.MODGEN,DISP=SHR
//C.SYSIN  DD DSN=SYS1.SAMPLIB(ASREXT1),DISP=SHR
//L.SYSLMOD DD DSN=SYS1.TECH.COMMON.LOADLIB(ASREXIT),DISP=SHR,UNIT=
//
