PROC 0
CONTROL PROMPT
ISREDIT MACRO
ISREDIT (DSNAME) = DATASET
ISREDIT (MEMBER) = MEMBER
IF &MEMBER EQ /*NULL*/ -
   THEN SET &PRDSN = &STR('&DSNAME')
   ELSE SET &PRDSN = &STR('&DSNAME(&MEMBER)')
ISPEXEC DISPLAY PANEL(PRPANL)
ISPEXEC VPUT (PROPTS) PROFILE
IF &RESPONSE EQ /* NULL */ THEN -
   DO
   WRITE PRINTOFF &PRDSN &PROPTS
   WRITE
   PRINTOFF &PRDSN &PROPTS
   SET &CCODE = &LASTCC
   SET &ZEDSMSG = &STR(ENDED RC=&CCODE)
   SET &ZEDLMSG = &STR(PRINTOFF ENDED WITH A RETURN CODE OF &CCODE)
   END
ELSE DO
   SET &ZEDSMSG = &STR(REQUEST CANCELLED)
   SET &ZEDLMSG = &STR(EDPRT TERMINATED BY AN END OR RETURN COMMAND)
   END
ISPEXEC SETMSG MSG(ISRZ000)
ISPEXEC CONTROL DISPLAY REFRESH
