%------------------ Wilson Street Regional Computing Center ------------
%                       Setup &KDSP Menu For &ZUSER
%                 Enter Selection Characters and Dataset Names
%   Selection        Dataset
%   Character(s)      Name
%   >_WEI1    %>_WEN1
%   >_WEI2    %>_WEN2
%   >_WEI3    %>_WEN3
%   >_WEI4    %>_WEN4
%   >_WEI5    %>_WEN5
%   >_WEI6    %>_WEN6
%   >_WEI7    %>_WEN7
%   >_WEI8    %>_WEN8
%   >_WEI9    %>_WEN9
%   >_WEI10   %>_WEN10
%   >_WEI11   %>_WEN11
%   >_WEI12   %>_WEN12
%   >_WEI13   %>_WEN13
%   >_WEI14   %>_WEN14
%   >_WEI15   %>_WEN15
%    SET Printoff options for PR1 and PR2:
%      PR1 >_WPR1                                +
%      PR2 >_WPR2                                +
+    PRESS%END KEY+TO TERMINATE THIS PANEL+
)INIT
     .CURSOR = WEI1
     IF (&OROPT = 'E')
         &KDSP = 'Edit'
     IF (&OROPT = 'B')
         &KDSP = 'Browse'
)PROC
   IF (&WEI1 ¬= &Z)
     VER (&WEN1,NONBLANK)
     VER (&WEN1,DSNAME)
     VER (&WEI1,NONBLANK)
   IF (&WEI2 ¬= &Z)
     VER (&WEN2,NONBLANK)
     VER (&WEN2,DSNAME)
     VER (&WEI2,NONBLANK)
   IF (&WEI3 ¬= &Z)
     VER (&WEN3,NONBLANK)
     VER (&WEN3,DSNAME)
     VER (&WEI3,NONBLANK)
   IF (&WEI4 ¬= &Z)
     VER (&WEN4,NONBLANK)
     VER (&WEN4,DSNAME)
     VER (&WEI4,NONBLANK)
   IF (&WEI5 ¬= &Z)
     VER (&WEN5,NONBLANK)
     VER (&WEN5,DSNAME)
     VER (&WEI5,NONBLANK)
   IF (&WEI6 ¬= &Z)
     VER (&WEN6,NONBLANK)
     VER (&WEN6,DSNAME)
     VER (&WEI6,NONBLANK)
   IF (&WEI7 ¬= &Z)
     VER (&WEN7,NONBLANK)
     VER (&WEN7,DSNAME)
     VER (&WEI7,NONBLANK)
   IF (&WEI8 ¬= &Z)
     VER (&WEN8,NONBLANK)
     VER (&WEN8,DSNAME)
     VER (&WEI8,NONBLANK)
   IF (&WEI9 ¬= &Z)
     VER (&WEN9,NONBLANK)
     VER (&WEN9,DSNAME)
     VER (&WEI9,NONBLANK)
   IF (&WEI10 ¬= &Z)
     VER (&WEN10,NONBLANK)
     VER (&WEN10,DSNAME)
     VER (&WEI10,NONBLANK)
   IF (&WEI11 ¬= &Z)
     VER (&WEN11,NONBLANK)
     VER (&WEN11,DSNAME)
     VER (&WEI11,NONBLANK)
   IF (&WEI12 ¬= &Z)
     VER (&WEN12,NONBLANK)
     VER (&WEN12,DSNAME)
     VER (&WEI12,NONBLANK)
   IF (&WEI13 ¬= &Z)
     VER (&WEN13,NONBLANK)
     VER (&WEN13,DSNAME)
     VER (&WEI13,NONBLANK)
   IF (&WEI14 ¬= &Z)
     VER (&WEN14,NONBLANK)
     VER (&WEN14,DSNAME)
     VER (&WEI14,NONBLANK)
   IF (&WEI15 ¬= &Z)
     VER (&WEN15,NONBLANK)
     VER (&WEN15,DSNAME)
     VER (&WEI15,NONBLANK)
   IF (&WEN1 ¬= &Z)
     VER (&WEN1,NONBLANK)
     VER (&WEN1,DSNAME)
     VER (&WEI1,NONBLANK)
   IF (&WEN2 ¬= &Z)
     VER (&WEN2,NONBLANK)
     VER (&WEN2,DSNAME)
     VER (&WEI2,NONBLANK)
   IF (&WEN3 ¬= &Z)
     VER (&WEN3,NONBLANK)
     VER (&WEN3,DSNAME)
     VER (&WEI3,NONBLANK)
   IF (&WEN4 ¬= &Z)
     VER (&WEN4,NONBLANK)
     VER (&WEN4,DSNAME)
     VER (&WEI4,NONBLANK)
   IF (&WEN5 ¬= &Z)
     VER (&WEN5,NONBLANK)
     VER (&WEN5,DSNAME)
     VER (&WEI5,NONBLANK)
   IF (&WEN6 ¬= &Z)
     VER (&WEN6,NONBLANK)
     VER (&WEN6,DSNAME)
     VER (&WEI6,NONBLANK)
   IF (&WEN7 ¬= &Z)
     VER (&WEN7,NONBLANK)
     VER (&WEN7,DSNAME)
     VER (&WEI7,NONBLANK)
   IF (&WEN8 ¬= &Z)
     VER (&WEN8,NONBLANK)
     VER (&WEN8,DSNAME)
     VER (&WEI8,NONBLANK)
   IF (&WEN9 ¬= &Z)
     VER (&WEN9,NONBLANK)
     VER (&WEN9,DSNAME)
     VER (&WEI9,NONBLANK)
   IF (&WEN10 ¬= &Z)
     VER (&WEN10,NONBLANK)
     VER (&WEN10,DSNAME)
     VER (&WEI10,NONBLANK)
   IF (&WEN11 ¬= &Z)
     VER (&WEN11,NONBLANK)
     VER (&WEN11,DSNAME)
     VER (&WEI11,NONBLANK)
   IF (&WEN12 ¬= &Z)
     VER (&WEN12,NONBLANK)
     VER (&WEN12,DSNAME)
     VER (&WEI12,NONBLANK)
   IF (&WEN13 ¬= &Z)
     VER (&WEN13,NONBLANK)
     VER (&WEN13,DSNAME)
     VER (&WEI13,NONBLANK)
   IF (&WEN14 ¬= &Z)
     VER (&WEN14,NONBLANK)
     VER (&WEN14,DSNAME)
     VER (&WEI14,NONBLANK)
   IF (&WEN15 ¬= &Z)
     VER (&WEN15,NONBLANK)
     VER (&WEN15,DSNAME)
     VER (&WEI15,NONBLANK)
 VPUT (WEI1,WEI2,WEI3,WEI4,WEI5,WEI6,WEI7,WEI8,WEI9,WEI10) PROFILE
 VPUT (WEN1,WEN2,WEN3,WEN4,WEN5,WEN6,WEN7,WEN8,WEN9,WEN10) PROFILE
 VPUT (WEI11,WEI12,WEI13,WEI14,WEI15,WEN11,WEN12,WEN13)    PROFILE
 VPUT (WEN14,WEN15,WPR1,WPR2) PROFILE
 &ZSEL=' '
)END
