//ALLOCARC JOB (@SYSUID,@SYSACCT),'INIT SHSW.LSARCLIB',CLASS=A
/*JOBPARM   I,W,T=5,Q=T,L=3
//INIT     EXEC PGM=LIBRARY,PARM='NRJS,NJTA'
//SYSPRINT  DD SYSOUT=A
//MASTER    DD DSN=SYSX.LIBSPOOL.LIBREST,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,4),
//            DCB=(DSORG=DA,BLKSIZE=9440),
//            VOL=SER=SFTS02,
//            UNIT=3350
//SYSIN    DD  *
-OPT INIT,DISK,SEQ=/81,8,10,10/
-END
