//LSLIBCPY JOB (@SYSUID,@SYSACCT),'COPY SHSW.LSLIB',CLASS=A
/*JOBPARM   I,W,T=5,Q=T,L=9
//*
//* THIS JOB CAN BE USED TO REALLOCATE THE LIBSPOOL DATA SET
//* TO INCREASE OR DECREASE ITS SPACE ALLOCATION OR VOLUME ALLOCATION.
//* LIBSPOOL SHOULD BE STOPPED WHILE RUNNING THIS JOB. DATA SETS SHOULD
//* BE RENAMED AFTER SUCCESSSFUL COMPLETION.
//*
//COPY    EXEC PGM=LIBRARY,PARM='NRJS,NJTA'
//SYSPRINT DD SYSOUT=A
//LIST     DD SYSOUT=A
//INDEX    DD SYSOUT=A
//OSJOB    DD DSN=&&TEMP,DISP=(,PASS),DCB=BLKSIZE=800,
//           UNIT=SYSDA,SPACE=(CYL,(5,5))
//MASTER   DD DSN=SHSW.LSLIB,DISP=SHR
//BACKUP   DD DSN=SHSW.NEWLSLIB,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,75),                              CHANGE ?
//            DCB=(DSORG=DA,BLKSIZE=2220),
//            VOL=SER=F031L1,                              CHANGE ?
//            UNIT=3350
//SYSIN    DD  *
-OPT BKUPDISK,INDEX
-END
