//ARCLBSPL PROC BLK=19040,PRIME=100,SEC=100,                SPACE PARMS
//        PARMINF='NRJS,NJTA',                          LIBRARIAN PARMS
//       FROMDSN='PPODOPR.LIBSPOOL.DALYARCH',GEN=XXXX,VER=V00,PG='.G',
//        TOLIB='SYSX.LIBSPOOL.LIBREST'             TARGET DISK LIBRARY
//*
//* STEP ONE RETRIEVES THE MODULE(S) FROM THE LIBSPOOL ARCHIVE TAPE
//* REQUESTED. STEP TWO ADDS THEM TO THE LIBSPOOL RESTORE
//* FROM ARCHIVE DATA SET.
//*
//FROMSTEP EXEC PGM=LIBRARY,PARM='&PARMINF'
//MASTIN   DD DSN=&FROMDSN&PG&GEN&VER,DISP=OLD
//MASTOUT  DD DUMMY,DCB=BLKSIZE=32760
//OSJOB    DD DSN=&&COPY,DISP=(,PASS),DCB=BLKSIZE=&BLK,
//            UNIT=SYSDA,SPACE=(&BLK,(&PRIME,&SEC),RLSE)
//SYSAF01  DD UNIT=SYSDA,SPACE=(CYL,(1,1)),DCB=BLKSIZE=19069
//SYSAF02  DD UNIT=SYSDA,SPACE=(CYL,(1,1)),DCB=BLKSIZE=19069
//SYSAF03  DD UNIT=SYSDA,SPACE=(CYL,(1,1)),DCB=BLKSIZE=19069
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD SYSOUT=B
//INDEX    DD SYSOUT=A
//LIST     DD SYSOUT=A
//TOSTEP   EXEC PGM=LIBRARY,PARM='&PARMINF'
//MASTER   DD DSN=&TOLIB,DISP=SHR
//OSJOB    DD DUMMY
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD SYSOUT=B
//INDEX    DD SYSOUT=A
//LIST     DD SYSOUT=A
//SYSIN    DD DSN=&&COPY,DISP=(OLD,DELETE)
