PROC 0
/* IF PANEL GIM@PRIM IS FOUND, SMPE ISPF DATASETS ARE ALLOCATED */
ISPEXEC CONTROL ERRORS RETURN
ISPEXEC PQUERY PANEL(GIM@PRIM) AREANAME(DUMMY)
IF &LASTCC = 12 THEN +
   DO
        /*  PERFORM DYNAMIC ALLOCATION  */
        ALTLIB ACT APPLICATION(CLIST) DA('GIM.SGIMCLS0') COND QUIET
        ISPEXEC LIBDEF ISPPLIB DATASET ID('GIM.SGIMPENU')
        ISPEXEC LIBDEF ISPMLIB DATASET ID('GIM.SGIMMENU')
        ISPEXEC LIBDEF ISPSLIB DATASET ID('GIM.SGIMSENU')
        ISPEXEC LIBDEF ISPTLIB DATASET ID('GIM.SGIMTENU')
        FREE FILE(SMPTABL)
        ALLOC FILE(SMPTABL) DA('&SYSUID..ISPF.ISPPROF') SHR
        FREE FILE(CIDTABL)
        ALLOC FILE(CIDTABL) DA('&SYSUID..ISPF.ISPPROF') OLD
   END
ISPEXEC SELECT PGM(GIMSTART)
END
