//XXXXXXXJ JOB XXX,'ISPFDSN',CLASS=A,REGION=4M,
//         MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//* ---------------------
//* TEST ISPFDSN IN BATCH MIODE
//* ---------------------
//IKJACCT EXEC PGM=IKJEFT01,REGION=4096K
//STEPLIB  DD  DISP=SHR,DSN=YOUR.LOADLIB
//SYSTSPRT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
ISPFDSN TRACE PREFIX(SYS2)
LISTA ST
//
ISPFDSN DSN(SYS1.PROCLIB) MEMBER($SPPROF3) TRACE
ISPFDSN DSN(SYS2.$ISPFDSN.PROCLIB) MEMBER($TEST) TRACE
ISPFDSN LOGONPRC PREFIX(SYS2) TRACE
