//SYSPROC  DD DISP=SHR,DSN=SYSD.DB2.SDSNCLST
//ISPLLIB  DD DISP=SHR,DSN=SYSD.DB2.RUNLIB.LOAD
//ISPSLIB  DD DISP=SHR,DSN=SYSD.DB2.SDSNSPFS
//ISPPLIB  DD DISP=SHR,DSN=SYSD.DB2.SDSNSPFP
//         DD DISP=SHR,DSN=SYSD.DB2.SDSNPFPE
//ISPMLIB  DD DISP=SHR,DSN=SYSD.DB2.SDSNSPFM
//ISPTLIB  DD DISP=SHR,DSN=SYS2.WLB.SCPPTENU
