  MACRO
&NAME PARMEXEC  &L=R3,&P=R2
 COPY SYSGBL
 CNOP 0,4
&NAME L &P.,0(1)
 LH &L.,0(&P.) IN QUESTO REGISTRO LUNGHEZZA PARAMETER LIST
 LA &P.,2(&P.) IN QUESTO REGISTRO PUNTATORE INIZIO STRINGA PARAMETRI
 STH &L.,PARML
 ST &P.,PARMP
 AIF (&PARMEXE EQ 1).SKIP
&PARMEXE SETB 1
 B *+10
PARMP DC F'0'  PUNTATORE     INIZIO PARAMETRI
PARML DC H'0'  LUNGHEZZA     STRINGA PARAMETRI
 MNOTE  *,' (&L) = LUNGHEZZA / (&P) = PUNTATORE PARAMETRI '
 MNOTE  *,' (PARML) = LUNG.-HALFWORD- / (PARMP) = PUNT. PARAMETRI '
.SKIP  MEND
