//LDW$Q#FJ JOB (1,SYS,AF0555,00,42,A9---),'WOREN, LEONARD      ',
//            COND=(0,NE),
//            NOTIFY=@@@@@@@,MSGCLASS=Y,CLASS=E
/*JOBPARM K=0
//ZZ OUTPUT JESDS=ALL,DEFAULT=Y,GROUPID=LDW,UCS=GT15,FCB=S8,DEST=LASER3
//* JCL DSN ==> SYS5.Q.ASM($$ASM) <==
//*---
//ASM      EXEC QUEUEASM,M=Q#FJ
//SYSIN     DD  DISP=SHR,DSN=SYS5.Q.ASM(#MHELP)
//          DD  DISP=SHR,DSN=SYS5.Q.ASM(QSTART)
//          DD  DISP=SHR,DSN=SYS5.Q.ASM(Q##TITLE)
//          DD  DISP=SHR,DSN=SYS5.Q.ASM(&M)
//          DD  DISP=SHR,DSN=SYS5.Q.ASM(Q##END)
//LINK     EXEC QUEUELNK
