//LDW$Q### JOB (ZSY11,4L00),'LEONARD D. WOREN',MSGCLASS=H,NOTIFY=LDW,
//*           RESTART=Q#??.ASM,
//            MSGLEVEL=(2,0),
//            COND=(0,NE),CLASS=D
/*JOBPARM L=100,F=SDB4
//*Z OUTPUT JESDS=ALL,DEFAULT=Y,GROUPID=LDW,UCS=GT15,FCB=S8,DEST=LASER3
//* JCL DSN ==> LDW.Q.ASM($$ASMCHK) <==
//*---
//Q#AF     EXEC  QUEUEASM,OBJ=NO,M=Q#AF
//Q#AL     EXEC  QUEUEASM,OBJ=NO,M=Q#AL
//Q#AT     EXEC  QUEUEASM,OBJ=NO,M=Q#AT
//Q#BL     EXEC  QUEUEASM,OBJ=NO,M=Q#BL
//Q#CH     EXEC  QUEUEASM,OBJ=NO,M=Q#CH
//Q#CK     EXEC  QUEUEASM,OBJ=NO,M=Q#CK
//Q#CP     EXEC  QUEUEASM,OBJ=NO,M=Q#CP
//Q#CT     EXEC  QUEUEASM,OBJ=NO,M=Q#CT
//Q#DD     EXEC  QUEUEASM,OBJ=NO,M=Q#DD
//Q#DY     EXEC  QUEUEASM,OBJ=NO,M=Q#DY
//Q#FJ     EXEC  QUEUEASM,OBJ=NO,M=Q#FJ
//Q#FM     EXEC  QUEUEASM,OBJ=NO,M=Q#FM
//Q#FR     EXEC  QUEUEASM,OBJ=NO,M=Q#FR
//Q#GP     EXEC  QUEUEASM,OBJ=NO,M=Q#GP
//Q#GR     EXEC  QUEUEASM,OBJ=NO,M=Q#GR
//Q#HB     EXEC  QUEUEASM,OBJ=NO,M=Q#HB
//Q#HE     EXEC  QUEUEASM,OBJ=NO,M=Q#HE
//Q#HT     EXEC  QUEUEASM,OBJ=NO,M=Q#HT
//Q#II     EXEC  QUEUEASM,OBJ=NO,M=Q#II
//Q#IN     EXEC  QUEUEASM,OBJ=NO,M=Q#IN
//Q#JI     EXEC  QUEUEASM,OBJ=NO,M=Q#JI
//Q#JN     EXEC  QUEUEASM,OBJ=NO,M=Q#JN
//Q#JS     EXEC  QUEUEASM,OBJ=NO,M=Q#JS
//Q#LD     EXEC  QUEUEASM,OBJ=NO,M=Q#LD
//Q#LI     EXEC  QUEUEASM,OBJ=NO,M=Q#LI
//Q#LT     EXEC  QUEUEASM,OBJ=NO,M=Q#LT
//Q#MC     EXEC  QUEUEASM,OBJ=NO,M=Q#MC
//Q#MO     EXEC  QUEUEASM,OBJ=NO,M=Q#MO
//Q#OC     EXEC  QUEUEASM,OBJ=NO,M=Q#OC
//Q#PA     EXEC  QUEUEASM,OBJ=NO,M=Q#PA
//Q#PF     EXEC  QUEUEASM,OBJ=NO,M=Q#PF
//Q#PR     EXEC  QUEUEASM,OBJ=NO,M=Q#PR
//Q#QC     EXEC  QUEUEASM,OBJ=NO,M=Q#QC
//Q#QD     EXEC  QUEUEASM,OBJ=NO,M=Q#QD
//Q#QI     EXEC  QUEUEASM,OBJ=NO,M=Q#QI
//Q#QS     EXEC  QUEUEASM,OBJ=NO,M=Q#QS
//Q#QQ     EXEC  QUEUEASM,OBJ=NO,M=Q#QQ
//Q#RL     EXEC  QUEUEASM,OBJ=NO,M=Q#RL
//Q#RP     EXEC  QUEUEASM,OBJ=NO,M=Q#RP
//Q#RS     EXEC  QUEUEASM,OBJ=NO,M=Q#RS
//Q#SF     EXEC  QUEUEASM,OBJ=NO,M=Q#SF
//Q#SL     EXEC  QUEUEASM,OBJ=NO,M=Q#SL
//Q#SO     EXEC  QUEUEASM,OBJ=NO,M=Q#SO
//Q#SR     EXEC  QUEUEASM,OBJ=NO,M=Q#SR
//Q#SV     EXEC  QUEUEASM,OBJ=NO,M=Q#SV
//Q#SY     EXEC  QUEUEASM,OBJ=NO,M=Q#SY
//Q#TC     EXEC  QUEUEASM,OBJ=NO,M=Q#TC
//Q#TG     EXEC  QUEUEASM,OBJ=NO,M=Q#TG
