//LDWQ$??  JOB (ZSY11,4L00),'LEONARD D. WOREN',MSGCLASS=H,NOTIFY=LDW,
//            COND=(0,NE),CLASS=C
/*PROCLIB LDW.Q.PROCLIB
/*JOBPARM L=100,F=SDB4
//*Z OUTPUT JESDS=ALL,DEFAULT=Y,GROUPID=LDW,UCS=GT15,FCB=S8,DEST=LASER3
//* JCL DSN ==> LDW.Q.ASM($$NEWALL) <==
//*---
//ASM      EXEC QUEUEASM,M=Q#??,
//             RES=MVSXR1,DLIB=MVSXR1  ,TEST=TEST
//SYSLIB    DD
//          DD
//          DD
//          DD
//          DD
//          DD
//          DD
//          DD
//          DD  UNIT=,VOL=SER=          *ACFMAC*
//LINK     EXEC QUEUELNK,INCLUDE=INCLUDX,MOD=QX$
