* GENQHELP was run on THURSDAY   Mar 19, 1992  (92.079)  at 21:32:59
* LDW.TEXT(QHELP) - last updated 19Mar92
HELPTEXT CSECT
         DC    A(HELPTAB,HELPTABL,HELPEND-HELPTABL)    BXLE registers
*---  The following table should be kept in ascending order to     ---*
*---  allow a binary search to be implemented someday.             ---*
*---  (The first entry will have to be an exception.)              ---*
*  Flag byte definition:
*    X'80' - This entry is an alias, and should be skipped when
*            doing "HELP /ALL"
HELPTAB  DC    CL8'GENERAL ',X'00',AL3(HE#GENL-HELPTEXT)
HELPTABL EQU   *-HELPTAB                Length of an entry
*%%%     DC    CL8'/       ',X'00',AL3(HE#SLASH-HELPTEXT)
         DC    CL8'?       ',X'80',AL3(HE#HELP-HELPTEXT)
         DC    CL8'@       ',X'80',AL3(HE#MD-HELPTEXT)
*%%%     DC    CL8'ABEND   ',X'00',AL3(HE#ABEND-HELPTEXT)
         DC    CL8'ADMIN   ',X'00',AL3(HE#ADMN-HELPTEXT)
         DC    CL8'AI      ',X'80',AL3(HE#DI-HELPTEXT)
         DC    CL8'AJ      ',X'00',AL3(HE#AJ-HELPTEXT)
         DC    CL8'AT      ',X'80',AL3(HE#ATTR-HELPTEXT)
         DC    CL8'ATTR    ',X'00',AL3(HE#ATTR-HELPTEXT)
         DC    CL8'AO      ',X'80',AL3(HE#DO-HELPTEXT)
         DC    CL8'B       ',X'80',AL3(HE#BOT-HELPTEXT)
         DC    CL8'BOT     ',X'80',AL3(HE#BOT-HELPTEXT)
         DC    CL8'BOTTOM  ',X'00',AL3(HE#BOT-HELPTEXT)
*%%%     DC    CL8'BR      ',X'80',AL3(HE#BR-HELPTEXT)
*%%%     DC    CL8'BROWSE  ',X'00',AL3(HE#BR-HELPTEXT)
         DC    CL8'C       ',X'80',AL3(HE#COL-HELPTEXT)
         DC    CL8'CAN     ',X'80',AL3(HE#CAN-HELPTEXT)
         DC    CL8'CANCEL  ',X'00',AL3(HE#CAN-HELPTEXT)
         DC    CL8'CHGS    ',X'00',AL3(HE#CHGS-HELPTEXT)
         DC    CL8'CJ      ',X'80',AL3(HE#CAN-HELPTEXT)
*%%%     DC    CL8'CKPT    ',X'00',AL3(HE#CKPT-HELPTEXT)
         DC    CL8'CMDS    ',X'80',AL3(HE#CMDS-HELPTEXT)
         DC    CL8'COL     ',X'80',AL3(HE#COL-HELPTEXT)
         DC    CL8'COLS    ',X'00',AL3(HE#COLS-HELPTEXT)
         DC    CL8'COLUMN  ',X'00',AL3(HE#COL-HELPTEXT)
         DC    CL8'COMMANDS',X'00',AL3(HE#CMDS-HELPTEXT)
*%%%     DC    CL8'CONS    ',X'00',AL3(HE#CONS-HELPTEXT)
         DC    CL8'COPY    ',X'00',AL3(HE#COPY-HELPTEXT)
         DC    CL8'CPU     ',X'00',AL3(HE#CPU-HELPTEXT)
         DC    CL8'CY      ',X'80',AL3(HE#COPY-HELPTEXT)
         DC    CL8'D       ',X'80',AL3(HE#DOWN-HELPTEXT)
         DC    CL8'DA      ',X'00',AL3(HE#DA-HELPTEXT)
*%%%     DC    CL8'DC      ',X'80',AL3(HE#CPU-HELPTEXT)   obsolete
         DC    CL8'DD      ',X'00',AL3(HE#DD-HELPTEXT)
         DC    CL8'DEL     ',X'80',AL3(HE#DEL-HELPTEXT)
         DC    CL8'DELETE  ',X'00',AL3(HE#DEL-HELPTEXT)
         DC    CL8'DEVICES ',X'00',AL3(HE#DEV-HELPTEXT)
         DC    CL8'DEV     ',X'80',AL3(HE#DEV-HELPTEXT)
         DC    CL8'DH      ',X'00',AL3(HE#DH-HELPTEXT)
         DC    CL8'DI      ',X'00',AL3(HE#DI-HELPTEXT)
         DC    CL8'DJ      ',X'00',AL3(HE#DJ-HELPTEXT)
         DC    CL8'DN      ',X'00',AL3(HE#DN-HELPTEXT)
         DC    CL8'DO      ',X'00',AL3(HE#DO-HELPTEXT)
         DC    CL8'DOWN    ',X'00',AL3(HE#DOWN-HELPTEXT)
         DC    CL8'DQ      ',X'00',AL3(HE#DQ-HELPTEXT)
         DC    CL8'DS      ',X'00',AL3(HE#DS-HELPTEXT)
         DC    CL8'DSS     ',X'00',AL3(HE#DSS-HELPTEXT)
         DC    CL8'DT      ',X'00',AL3(HE#DT-HELPTEXT)
         DC    CL8'E       ',X'80',AL3(HE#END-HELPTEXT)
*%%%     DC    CL8'ED      ',X'80',AL3(HE#ED-HELPTEXT)
*%%%     DC    CL8'EDIT    ',X'00',AL3(HE#ED-HELPTEXT)
*%%%     DC    CL8'EJ      ',X'00',AL3(HE#EJ-HELPTEXT)
         DC    CL8'ELIST   ',X'80',AL3(HE#ELIST-HELPTEXT)
         DC    CL8'EL      ',X'80',AL3(HE#ELIST-HELPTEXT)
         DC    CL8'END     ',X'00',AL3(HE#END-HELPTEXT)
         DC    CL8'EXIT    ',X'00',AL3(HE#EXIT-HELPTEXT)
         DC    CL8'F       ',X'80',AL3(HE#FIND-HELPTEXT)
         DC    CL8'FA      ',X'80',AL3(HE#FALL-HELPTEXT)
         DC    CL8'FALL    ',X'00',AL3(HE#FALL-HELPTEXT)
         DC    CL8'FIND    ',X'00',AL3(HE#FIND-HELPTEXT)
         DC    CL8'FT      ',X'80',AL3(HE#FTIME-HELPTEXT)
         DC    CL8'FTIME   ',X'00',AL3(HE#FTIME-HELPTEXT)
         DC    CL8'H       ',X'80',AL3(HE#HELP-HELPTEXT)
         DC    CL8'HB      ',X'00',AL3(HE#HB-HELPTEXT)
*%%%     DC    CL8'HCT     ',X'00',AL3(HE#HCT-HELPTEXT)
         DC    CL8'HELP    ',X'00',AL3(HE#HELP-HELPTEXT)
         DC    CL8'HF      ',X'00',AL3(HE#HF-HELPTEXT)
         DC    CL8'HI      ',X'80',AL3(HE#DI-HELPTEXT)
         DC    CL8'HJ      ',X'00',AL3(HE#HJ-HELPTEXT)
         DC    CL8'HOLD    ',X'80',AL3(HE#HJ-HELPTEXT)
*%%%     DC    CL8'IN      ',X'80',AL3(HE#INIT-HELPTEXT)
*%%%     DC    CL8'INIT    ',X'00',AL3(HE#INIT-HELPTEXT)
         DC    CL8'IOQ     ',X'00',AL3(HE#IOQ-HELPTEXT)
         DC    CL8'J       ',X'80',AL3(HE#JSUMM-HELPTEXT)
         DC    CL8'JC      ',X'80',AL3(HE#JCL-HELPTEXT)
         DC    CL8'JCL     ',X'00',AL3(HE#JCL-HELPTEXT)
*%%%     DC    CL8'JCT     ',X'00',AL3(HE#JCT-HELPTEXT)  line cmd = JT
         DC    CL8'JD      ',X'00',AL3(HE#JD-HELPTEXT)
*%%%     DC    CL8'JDX     ',X'00',AL3(HE#JDX-HELPTEXT)
         DC    CL8'JL      ',X'80',AL3(HE#JLOG-HELPTEXT)
         DC    CL8'JLOG    ',X'00',AL3(HE#JLOG-HELPTEXT)
         DC    CL8'JM      ',X'80',AL3(HE#JMSG-HELPTEXT)
         DC    CL8'JMSG    ',X'00',AL3(HE#JMSG-HELPTEXT)
         DC    CL8'JN      ',X'80',AL3(HE#JNEWS-HELPTEXT)
         DC    CL8'JNEWS   ',X'00',AL3(HE#JNEWS-HELPTEXT)
         DC    CL8'JSUMM   ',X'00',AL3(HE#JSUMM-HELPTEXT)
         DC    CL8'JS      ',X'80',AL3(HE#JSUMM-HELPTEXT)
         DC    CL8'JOB     ',X'80',AL3(HE#JD-HELPTEXT)
*%%%     DC    CL8'JOBX    ',X'80',AL3(HE#JDX-HELPTEXT)  line cmd = JX
*%%%     DC    CL8'JOE     ',X'00',AL3(HE#JOE-HELPTEXT)
*%%%     DC    CL8'JQE     ',X'00',AL3(HE#JQE-HELPTEXT)
*%%%     DC    CL8'JX      ',X'00',AL3(HE#JDX-HELPTEXT)  line cmd = JX
         DC    CL8'L       ',X'80',AL3(HE#LIST-HELPTEXT)
*%%%     DC    CL8'LBLK    ',X'00',AL3(HE#LBLK-HELPTEXT)  line cmd = LB
*%%%     DC    CL8'LDAS    ',X'00',AL3(HE#LDAS-HELPTEXT)
         DC    CL8'LE      ',X'80',AL3(HE#LEFT-HELPTEXT)
         DC    CL8'LEFT    ',X'00',AL3(HE#LEFT-HELPTEXT)
         DC    CL8'LINECMDS',X'00',AL3(HE#LCMDS-HELPTEXT)
         DC    CL8'LIST    ',X'00',AL3(HE#LIST-HELPTEXT)
*%%%     DC    CL8'LKIT    ',X'00',AL3(HE#LKIT-HELPTEXT)
*%%%     DC    CL8'LL      ',X'00',AL3(HE#LL-HELPTEXT) doesn't work yet
         DC    CL8'LRMT    ',X'00',AL3(HE#LRMT-HELPTEXT)
*%%%     DC    CL8'LSYS    ',X'00',AL3(HE#LSYS-HELPTEXT)
*%%%     DC    CL8'LTXT    ',X'00',AL3(HE#LTXT-HELPTEXT)  line cmd = LT
*%%%     DC    CL8'MCS     ',X'80',AL3(HE#CONS-HELPTEXT)
         DC    CL8'MD      ',X'00',AL3(HE#MD-HELPTEXT)
         DC    CL8'MODE    ',X'00',AL3(HE#MODE-HELPTEXT)
         DC    CL8'NJ      ',X'00',AL3(HE#NJ-HELPTEXT)
         DC    CL8'NS      ',X'00',AL3(HE#NS-HELPTEXT)
         DC    CL8'P       ',X'80',AL3(HE#PAGE-HELPTEXT)
         DC    CL8'PAGE    ',X'00',AL3(HE#PAGE-HELPTEXT)
         DC    CL8'PB      ',X'00',AL3(HE#PB-HELPTEXT)
*%%%     DC    CL8'PDDB    ',X'00',AL3(HE#PDDB-HELPTEXT)
         DC    CL8'PF      ',X'00',AL3(HE#PF-HELPTEXT)
         DC    CL8'PFK     ',X'00',AL3(HE#PFK-HELPTEXT)
         DC    CL8'PJ      ',X'80',AL3(HE#PURGE-HELPTEXT)
         DC    CL8'PR      ',X'80',AL3(HE#PRINT-HELPTEXT)
         DC    CL8'PRINT   ',X'00',AL3(HE#PRINT-HELPTEXT)
         DC    CL8'PRIV    ',X'80',AL3(HE#PRIV-HELPTEXT)
         DC    CL8'PRIVCMDS',X'00',AL3(HE#PRIV-HELPTEXT)
         DC    CL8'PS      ',X'00',AL3(HE#PS-HELPTEXT)
         DC    CL8'PUR     ',X'80',AL3(HE#PURGE-HELPTEXT)
         DC    CL8'PURGE   ',X'00',AL3(HE#PURGE-HELPTEXT)
*%%%     DC    CL8'QCMN    ',X'00',AL3(HE#QCMN-HELPTEXT)
         DC    CL8'QINT    ',X'00',AL3(HE#QINT-HELPTEXT)
         DC    CL8'QPROF   ',X'00',AL3(HE#QPROF-HELPTEXT)
         DC    CL8'QUIT    ',X'80',AL3(HE#EXIT-HELPTEXT)
         DC    CL8'RD      ',X'80',AL3(HE#RD-HELPTEXT)
         DC    CL8'RE      ',X'80',AL3(HE#RE-HELPTEXT)
         DC    CL8'REDISP  ',X'00',AL3(HE#RD-HELPTEXT)
         DC    CL8'REL     ',X'80',AL3(HE#AJ-HELPTEXT)
         DC    CL8'RELEASE ',X'80',AL3(HE#AJ-HELPTEXT)
         DC    CL8'REPOS   ',X'00',AL3(HE#REPOS-HELPTEXT)
         DC    CL8'REQ     ',X'80',AL3(HE#REQ-HELPTEXT)
         DC    CL8'REQUEUE ',X'00',AL3(HE#REQ-HELPTEXT)
         DC    CL8'RET     ',X'80',AL3(HE#EXIT-HELPTEXT)
         DC    CL8'RETRIEVE',X'00',AL3(HE#RE-HELPTEXT)
         DC    CL8'RETURN  ',X'80',AL3(HE#EXIT-HELPTEXT)
         DC    CL8'RI      ',X'80',AL3(HE#RIGHT-HELPTEXT)
         DC    CL8'RIGHT   ',X'00',AL3(HE#RIGHT-HELPTEXT)
         DC    CL8'RJ      ',X'80',AL3(HE#ROUTE-HELPTEXT)
         DC    CL8'ROU     ',X'80',AL3(HE#ROUTE-HELPTEXT)
         DC    CL8'ROUTE   ',X'00',AL3(HE#ROUTE-HELPTEXT)
         DC    CL8'SAVE    ',X'00',AL3(HE#SAVE-HELPTEXT)
         DC    CL8'S       ',X'80',AL3(HE#SJ-HELPTEXT)
*%%%     DC    CL8'SETUP   ',X'00',AL3(HE#SETUP-HELPTEXT)
         DC    CL8'SJ      ',X'00',AL3(HE#SJ-HELPTEXT)
         DC    CL8'SL      ',X'80',AL3(HE#SLOG-HELPTEXT)
         DC    CL8'SLOG    ',X'00',AL3(HE#SLOG-HELPTEXT)
*%%%     DC    CL8'SPSP    ',X'00',AL3(HE#SPSP-HELPTEXT)
         DC    CL8'ST      ',X'80',AL3(HE#STAT-HELPTEXT)
         DC    CL8'STATUS  ',X'00',AL3(HE#STAT-HELPTEXT)
         DC    CL8'STOP    ',X'80',AL3(HE#EXIT-HELPTEXT)
*%%%     DC    CL8'SU      ',X'80',AL3(HE#SETUP-HELPTEXT)
         DC    CL8'SYNTAX  ',X'00',AL3(HE#SYNT-HELPTEXT)
         DC    CL8'T       ',X'80',AL3(HE#TOP-HELPTEXT)
*%%%     DC    CL8'TGPS    ',X'80',AL3(HE#SPSP-HELPTEXT)
*%%%     DC    CL8'TJ      ',X'00',AL3(HE#TJ-HELPTEXT)
         DC    CL8'TOP     ',X'00',AL3(HE#TOP-HELPTEXT)
         DC    CL8'TOPICS  ',X'00',AL3(HE#TOPIC-HELPTEXT)
          AIF   (NOT &@@TMPSV).HE#NTS1
         DC    CL8'TSO     ',X'00',AL3(HE#TSO-HELPTEXT)
.HE#NTS1  ANOP
         DC    CL8'U       ',X'80',AL3(HE#UP-HELPTEXT)
         DC    CL8'UP      ',X'00',AL3(HE#UP-HELPTEXT)
*%%%     DC    CL8'XB      ',X'80',AL3(HE#XBLK-HELPTEXT)
*%%%     DC    CL8'XBLK    ',X'00',AL3(HE#XBLK-HELPTEXT)
*%%%     DC    CL8'XJ      ',X'80',AL3(HE#XJ-HELPTEXT)  line cmd = XJ
*%%%     DC    CL8'XP      ',X'00',AL3(HE#XP-HELPTEXT)
HELPEND  DC    X'FFFFFFFFFFFFFFFFFFFFFFFF'
         EJECT
HE#ADMN  DC    AL1(060,0,00),C'                             << Administ$
               rative subcommands >>'
         DC    AL1(037,0,00),C'DELete    - Delete a job''s held output'$

         DC    AL1(041,0,00),C'REQueue   - Change held output to non-he$
               ld'
         DC    AL1(055,0,00),C'CANcel|CJ - Cancel a job and optionally $
               purge the output'
         DC    AL1(034,0,00),C'ROUte|RJ  - Re-route a job''s output'
          AIF   (NOT &@@TMPSV).HE#NTS2
         DC    AL1(034,0,00),C'TSO       - Execute any TSO command'
.HE#NTS2  ANOP
         DC    AL1(061,0,00),C'MODE      - Display and set various QUEU$
               E options and defaults'
         DC    AL1(046,0,00),C'COLS      - Turn column scale display on$
                or off'
         DC    AL1(070,1,00),C'QINT      - Display and set various inte$
               rnal QUEUE options and defaults'
         DC    AL1(045,0,00),C'LRMT      - List JES2 remote destination$
                names'
         DC    AL1(049,0,00),C'*         - Recall a previously entered $
               subcommand'
         DC    AL1(033,0,00),C'Help|?    - Display help for QUEUE'
         DC    AL1(061,0,00),C'CHGS      - List updates and enhancement$
               s to the QUEUE command'
         DC    AL1(055,0,00),C'End       - Return to next higher level $
               QUEUE subcommand'
         DC    AL1(034,0,00),C'EXIT|STOP|QUIT|RETURN - Leave QUEUE'
         DC    AL1(047,0,00),C'SAVE      - Create a copy of the current$
                dataset'
         DC    AL1(060,0,00),C'PRint     - Open print file and/or print$
                current screen image'
         DC    AL1(078,0,00),C'COPY      - Copy all or part of the curr$
               ently selected spooled dataset to print'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#AJ    DC    AL1(000,0,00),C' '
         DC    AL1(035,0,00),C' The "AJ" subcommand releases a job.'
         DC    AL1(000,0,00),C' '
         DC    AL1(021,0,02),X'1DE8',C'Syntax',X'1D60',C'- AJ <jobid>'
         DC    AL1(024,0,02),X'1DE8',C'Aliases',X'1D60',C'- RELEASE, RE$
               L'
         DC    AL1(068,0,04),C' From a status display,',X'1DE8',C'AJ',X$
               '1D60',C'or',X'1DE8',C'A',X'1D60',C'may be entered as a $
               line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),X'1DE8',C'Note    ',X'1D60',C'- An asteris$
               k',X'1DE8',C'("*")',X'1D60',C'may be used in place of <j$
               obid> to refer'
         DC    AL1(045,0,00),C'            to the most recently selecte$
               d job.'
          AIF (&@@SCSVC NE 0 OR &@@TSOE GE 120).HE#AJ
         DC    AL1(064,0,00),C'NOTE:  The "AJ" subcommand can only func$
               tion if QUEUE was entered'
         DC    AL1(060,0,00),C'       at the "READY" level (i.e., it ca$
               nnot work inside SPF)'
.HE#AJ    ANOP
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#ATTR  DC    AL1(000,0,00),C' '
         DC    AL1(062,0,00),C' The "ATTR subcommand displays attribute$
               s of a spooled dataset.'
         DC    AL1(000,0,00),C' '
         DC    AL1(030,0,02),X'1DE8',C'Syntax',X'1D60',C'- ATTR <jobid>$
                <dsid>'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- AT'
         DC    AL1(069,0,06),C' From the',X'1DE8',C'DDname',X'1D60',C'd$
               isplay, line command',X'1DE8',C'AT',X'1D60',C'may be use$
               d for',X'1DE8',C'ATTR.',X'1D60'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(075,0,02),C'   <dsid>  - The DSID of the dataset, as$
                displayed by the',X'1DE8',C'"DD"',X'1D60',C'subcommand.$
               '
         DC    AL1(000,0,00),C' '
         DC    AL1(068,0,02),X'1DE8',C'Defaults',X'1D60',C'- If no oper$
               ands are entered, attributes of the currently'
         DC    AL1(054,0,00),C'            selected spooled dataset wil$
               l be displayed.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),X'1DE8',C'Note    ',X'1D60',C'- An asteris$
               k',X'1DE8',C'("*")',X'1D60',C'may be used in place of <j$
               obid> to refer'
         DC    AL1(045,0,00),C'            to the most recently selecte$
               d job.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#BOT   DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "BOTTOM" subcommand repositions the$
                currently selected dataset to'
         DC    AL1(011,0,00),C' the bottom.'
         DC    AL1(000,0,00),C' '
         DC    AL1(017,0,02),X'1DE8',C'Syntax',X'1D60',C'- BOTTOM'
         DC    AL1(018,0,02),X'1DE8',C'Aliases',X'1D60',C'- BOT, B'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#CHGS  DC    AL1(000,0,00),C' '
         DC    AL1(068,0,00),C' The "CHGS" subcommand lists, in reverse$
                chronological order, changes'
         DC    AL1(066,0,00),C' which have been made to the QUEUE comma$
               nd.  This display should be'
         DC    AL1(070,0,00),C' checked periodically to see what''s new$
               .  You only need to page through'
         DC    AL1(061,0,00),C' until you come to the start of what you$
                have previously seen.'
         DC    AL1(000,0,00),C' '
         DC    AL1(015,0,02),X'1DE8',C'Syntax',X'1D60',C'- CHGS'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    AL1(068,1,00),C'            For privileged users, the fo$
               llowing operand is available:'
         DC    AL1(000,1,00),C' '
         DC    AL1(062,1,00),C'   INTERNAL - Internal (design/logic) ch$
               anges are to be listed.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#CMDS  DC    AL1(051,0,00),C'                             << QUEUE su$
               bcommands >>'
         DC    AL1(074,0,00),C' AI  AO  ATtr  Bottom  BRowse  CANcel  C$
               HGS  Col  COLumn  COPY  CPU  DA  DD'
         DC    AL1(076,0,00),C' DELete  DEVices  DH  DI  DJ  DO  Down  $
               DN  DQ  DS  DT  EDit  End  EXIT  Find'
         DC    AL1(075,0,00),C' FAll  HB  Help  HF  HI  INit  JCl  JD  $
               JLog  JMsg  JNews  Jsumm  LEft  List'
         DC    AL1(073,0,00),C' LRMT  MD  MODE  NS  Page  PB  PF  PFK  $
               PRint  PS  PURGE  REtrieve  REDISP'
         DC    AL1(053,0,00),C' REQueue  RIght  ROUte  SAVE  SJ  STatus$
                 Top  TSO  Up'
         DC    AL1(000,0,00),C' '
         DC    AL1(081,1,02),X'1DE8',C'-------  The following subcomman$
               ds are restricted to privileged users: -------',X'1D60'
         DC    AL1(070,1,00),C' /  ABEND  AJ  CKPT  CONS  EJ  FTime  HC$
               T  HJ  JCT  JDX  JQE  JOE  LBLK'
         DC    AL1(070,1,00),C' LDAS  LKIT  LTXT  LSYS  PDDB  QCMN  QIN$
               T  SLog  SPSP  TJ  XBlk  XJ  XP'
         DC    AL1(000,1,00),C' '
         DC    AL1(069,1,01),X'1DE8',C'*******  Many of the control blo$
               ck display commands (privileged) are'
         DC    AL1(068,1,01),X'1DE8',C'*******  being rewritten.  Some $
               of the new commands don''t work yet.'
         DC    AL1(068,1,01),X'1DE8',C'*******  If you get an S0C3 on o$
               ne of these, the old command may be'
         DC    AL1(064,1,01),X'1DE8',C'*******  available with an X pre$
               fix.  For example, JCT -> XJCT.'
         DC    AL1(000,1,00),C' '
         DC    AL1(000,0,00),C' '
         DC    AL1(062,0,04),C' For more information, enter',X'1DE8',C'$
               HELP subcmdname',X'1D60',C'or',X'1DE8',C'HELP HELP.',X'1$
               D60'
         DC    AL1(000,0,00),C' '
         DC    AL1(076,0,02),C' In addition, HELP for other topics is a$
               vailable, by entering',X'1DE8',C'HELP',X'1D60',C'followe$
               d'
         DC    AL1(051,0,02),C' by one of the keywords listed under',X'$
               1DE8',C'HELP TOPICS.',X'1D60'
         DC    AL1(000,0,00),C' '
         DC    AL1(057,0,02),X'1DE8',C'NOTE:',X'1D60',C' As of May 25, $
               1989, help should now be complete.'
         DC    AL1(038,1,00),C' Except for the privileged subcommands!'$

         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#CAN   DC    AL1(000,0,00),C' '
         DC    AL1(068,0,00),C' The "CANCEL" subcommand cancels an inpu$
               t or execution job, or purges'
         DC    AL1(040,0,00),C' all output for a job on an output queue$
               .'
         DC    AL1(000,0,00),C' '
         DC    AL1(033,0,02),X'1DE8',C'Syntax',X'1D60',C'- CANCEL <jobi$
               d> (PURGE)'
         DC    AL1(019,0,02),X'1DE8',C'Aliases',X'1D60',C'- CAN, CJ'
         DC    AL1(083,0,06),C' From a status display,',X'1DE8',C'CJ',X$
               '1D60',C'or',X'1DE8',C'CA',X'1D60',C'may be entered as a$
                line command for',X'1DE8',C'CANcel.',X'1D60'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(071,0,00),C'   PURGE   - If PURGE is entered, all ou$
               tput for the job will be purged.'
         DC    AL1(071,0,00),C'             This operand is required if$
                the job is on the output queue.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),X'1DE8',C'Note    ',X'1D60',C'- An asteris$
               k',X'1DE8',C'("*")',X'1D60',C'may be used in place of <j$
               obid> to refer'
         DC    AL1(045,0,00),C'            to the most recently selecte$
               d job.'
         AIF (&@@TMPSV OR &@@SCSVC NE 0 OR &@@TSOE GE 120).HE#CAN
         DC    AL1(068,0,00),C'NOTE:  The "CANCEL" subcommand can only $
               function if QUEUE was entered'
         DC    AL1(060,0,00),C'       at the "READY" level (i.e., it ca$
               nnot work inside SPF)'
.HE#CAN   ANOP
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#COL   DC    AL1(000,0,00),C' '
         DC    AL1(073,0,00),C' The "COLumn" subcommand repositions the$
                currently selected dataset to the'
         DC    AL1(024,0,00),C' requested column number.'
         DC    AL1(000,0,00),C' '
         DC    AL1(023,0,02),X'1DE8',C'Syntax',X'1D60',C'- COLUMN <col>$
               '
         DC    AL1(019,0,02),X'1DE8',C' Aliases',X'1D60',C'- COL, C'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(071,0,00),C'   <col> - The column which should be th$
               e leftmost column on the screen.'
         DC    AL1(000,0,00),C' '
         DC    AL1(070,0,02),X'1DE8',C'Defaults',X'1D60',C'- The origin$
               al column number specified or defaulted to when'
         DC    AL1(044,0,00),C'            the current dataset was sele$
               cted.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#COLS  DC    AL1(000,0,00),C' '
         DC    AL1(055,0,00),C' The "COLS" subcommand turns the column $
               scale on or off.'
         DC    AL1(000,0,00),C' '
         DC    AL1(022,0,02),X'1DE8',C'Syntax',X'1D60',C'- COLS ON OFF'$

         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(044,0,00),C'   ON  - The column scale is to be displ$
               ayed.'
         DC    AL1(048,0,00),C'   OFF - The column scale is not to be d$
               isplayed.'
         DC    AL1(000,0,00),C' '
         DC    AL1(039,0,02),X'1DE8',C'Default',X'1D60',C'- ON, if no o$
               perand is given.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#COPY  DC    AL1(000,0,00),C' '
         DC    AL1(071,0,00),C' The "COPY" subcommand copies all or a p$
               ortion of the currently selected'
         DC    AL1(018,0,00),C' dataset to sysout.'
         DC    AL1(000,0,00),C' '
         DC    AL1(019,0,02),X'1DE8',C'Syntax',X'1D60',C'- COPY ALL'
         DC    AL1(013,0,00),C'          -or-'
         DC    AL1(027,0,00),C'          COPY <start> <end>'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- CY'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(050,0,00),C'   ALL     - The complete dataset should$
                be copied.'
         DC    AL1(049,0,00),C'   <start> - The number of the first lin$
               e to copy.'
         DC    AL1(048,0,00),C'   <end>   - The number of the last line$
                to copy.'
         DC    AL1(000,0,00),C' '
         DC    AL1(045,0,04),X'1DE8',C'Note:   ',X'1D60',C'- See also t$
               he',X'1DE8',C'PRINT',X'1D60',C'subcommand.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#CPU   DC    AL1(000,0,00),C' '
         DC    AL1(062,0,00),C' The "CPU" subcommand displays CPU relat$
               ed information for jobs'
         DC    AL1(042,0,00),C' executing on the CPU you are logged on $
               to.'
         DC    AL1(000,0,00),C' '
         DC    AL1(014,0,02),X'1DE8',C'Syntax',X'1D60',C'- CPU'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(038,0,00),C'   J - Limit the display to batch jobs.'$

         DC    AL1(041,0,00),C'   S - Limit the display to started task$
               s.'
         DC    AL1(037,0,00),C'   T - Limit the display to TSO users.'
         DC    AL1(057,0,00),C'   B - Limit the display to batch jobs p$
               lus started tasks.'
         DC    AL1(000,0,00),C' '
         DC    AL1(014,0,02),X'1DE8',C'Defaults',X'1D60',C'- B'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DA    DC    AL1(000,0,00),C' '
         DC    AL1(060,0,00),C' The "DA" subcommand displays currently $
               executing batch jobs.'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Syntax',X'1D60',C'- DA TIME'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(049,0,00),C'   /TIME    - Display the start time for$
                each job.'
         DC    AL1(029,0,00),C'   /T       - Alias for /TIME.'
         DC    AL1(067,1,00),C'   /PERCENT - Display the percent of spo$
               ol space in use by each job.'
         DC    AL1(032,1,00),C'   /PCT     - Alias for /PERCENT.'
         DC    AL1(032,1,00),C'   /P       - Alias for /PERCENT.'
         DC    AL1(066,1,00),C'   /SPACE   - Display the amount of spoo$
               l space in use by each job.'
         DC    AL1(030,1,00),C'   /SIZE    - Alias for /SPACE.'
         DC    AL1(030,1,00),C'   /S       - Alias for /SPACE.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DD    DC    AL1(000,0,00),C' '
         DC    AL1(078,0,00),C' The "DD" subcommand displays the DSID f$
               or each SYSIN/SYSOUT dataset for a job.'
         DC    AL1(000,0,00),C' '
         DC    AL1(021,0,02),X'1DE8',C'Syntax',X'1D60',C'- DD <jobid>'
         DC    AL1(075,0,04),C' From a status display,',X'1DE8',C'DD',X$
               '1D60',C'may be entered as a line command for',X'1DE8',C$
               'DDname.',X'1D60'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(000,0,00),C' '
         DC    AL1(069,0,02),X'1DE8',C'Defaults',X'1D60',C'- DSIDs for $
               the previously selected job will be displayed.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DEL   DC    AL1(000,0,00),C' '
         DC    AL1(058,0,00),C' The "DELETE" subcommand deletes the hel$
               d sysout for a job.'
         DC    AL1(000,0,00),C' '
         DC    AL1(025,0,02),X'1DE8',C'Syntax',X'1D60',C'- DELETE <jobi$
               d>'
         DC    AL1(014,0,02),X'1DE8',C' Alias',X'1D60',C'- DEL'
         DC    AL1(083,0,06),C' From a status display,',X'1DE8',C'DE',X$
               '1D60',C'or',X'1DE8',C'DL',X'1D60',C'may be entered as a$
                line command for',X'1DE8',C'DELete.',X'1D60'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),X'1DE8',C'Note    ',X'1D60',C'- An asteris$
               k',X'1DE8',C'("*")',X'1D60',C'may be used in place of <j$
               obid> to refer'
         DC    AL1(045,0,00),C'            to the most recently selecte$
               d job.'
        AIF (&@@TMPSV OR &@@SCSVC NE 0 OR &@@TSOE GE 120).HE#DEL
         DC    AL1(068,0,00),C'NOTE:  The "DELETE" subcommand can only $
               function if QUEUE was entered'
         DC    AL1(060,0,00),C'       at the "READY" level (i.e., it ca$
               nnot work inside SPF)'
.HE#DEL   ANOP
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DEV   DC    AL1(000,0,00),C' '
         DC    AL1(065,0,00),C' The "DEVICES" subcommand displays jobs $
               currently on JES2 devices.'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Syntax',X'1D60',C'- DEVICES'
         DC    AL1(013,0,02),X'1DE8',C'Alias',X'1D60',C'- DEV'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DH    DC    AL1(000,0,00),C' '
         DC    AL1(059,0,00),C' The "DH" subcommand displays jobs in th$
               e held output queue.'
         DC    AL1(000,0,00),C' '
         DC    AL1(022,0,02),X'1DE8',C'Syntax',X'1D60',C'- DH TIME ALL'$

         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(050,0,00),C'   /TIME    - Display the ending time fo$
               r each job.'
         DC    AL1(065,0,00),C'   /ALL     - Display all jobs in the $O$
               UTPUT queue, regardless of'
         DC    AL1(056,0,00),C'              whether they actually have$
                any held output.'
         DC    AL1(067,1,00),C'   /PERCENT - Display the percent of spo$
               ol space in use by each job.'
         DC    AL1(032,1,00),C'   /PCT     - Alias for /PERCENT.'
         DC    AL1(032,1,00),C'   /P       - Alias for /PERCENT.'
         DC    AL1(066,1,00),C'   /SPACE   - Display the amount of spoo$
               l space in use by each job.'
         DC    AL1(030,1,00),C'   /SIZE    - Alias for /SPACE.'
         DC    AL1(030,1,00),C'   /S       - Alias for /SPACE.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DI    DC    AL1(000,0,00),C' '
         DC    AL1(053,0,00),C' The "DI" subcommand displays jobs in th$
               e input queue.'
         DC    AL1(062,0,00),C' The "AI" subcommand displays jobs in th$
               e input queue which are'
         DC    AL1(066,0,00),C'    available for execution (not held an$
               d not currently executing).'
         DC    AL1(068,0,00),C' The "HI" subcommand displays jobs in th$
               e input queue which are held.'
         DC    AL1(000,0,00),C' '
         DC    AL1(041,0,02),X'1DE8',C'Syntax',X'1D60',C'- DI <classes>$
                TIME SYSAFF=<sid>'
         DC    AL1(039,0,00),C'        - AI <classes> TIME SYSAFF=<sid>$
               '
         DC    AL1(039,0,00),C'        - HI <classes> TIME SYSAFF=<sid>$
               '
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(062,0,00),C'   <classes> - A list of up to 8 input c$
               lasses to be displayed.'
         DC    AL1(050,0,00),C'   /TIME     - Display the input time fo$
               r each job.'
         DC    AL1(069,0,00),C'   /SYSAFF   - Only select jobs with aff$
               inity to the specified system.'
         DC    AL1(067,0,00),C'               (This keyword may be repe$
               ated to select jobs for more'
         DC    AL1(031,0,00),C'               than one system.)'
         DC    AL1(032,0,00),C'   /S        - Alias for /SYSAFF.'
         DC    AL1(066,0,00),C'   <sid>     - A valid system id in the $
               M.A.S. complex.  "*" may be'
         DC    AL1(063,0,00),C'               entered to denote the cur$
               rent system (i.e., S=*).'
         DC    AL1(068,1,00),C'   /PERCENT  - Display the percent of sp$
               ool space in use by each job.'
         DC    AL1(033,1,00),C'   /PCT      - Alias for /PERCENT.'
         DC    AL1(033,1,00),C'   /P        - Alias for /PERCENT.'
         DC    AL1(067,1,00),C'   /SPACE    - Display the amount of spo$
               ol space in use by each job.'
         DC    AL1(031,1,00),C'   /SIZE     - Alias for /SPACE.'
         DC    AL1(000,0,00),C' '
         DC    AL1(070,0,02),X'1DE8',C'Defaults',X'1D60',C'- All input $
               classes will be displayed if none are selected.'
         DC    AL1(063,0,00),C'            Jobs will be selected regard$
               less of system affinity.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DJ    DC    AL1(000,0,00),C' '
         DC    AL1(062,0,00),C' The "DJ" subcommand displays a specific$
                job by name or number.'
         DC    AL1(000,0,00),C' '
         DC    AL1(029,0,02),X'1DE8',C'Syntax',X'1D60',C'- DJ <jobid> /$
                OUT O'
         DC    AL1(061,0,02),C' From a status display,',X'1DE8',C'DJ',X$
               '1D60',C'may be entered as a line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(059,0,00),C'   <jobid>  - The name or number of the $
               job to be displayed.'
         DC    AL1(067,0,00),C'   /OUT     - Display output group names$
                instead of the device name.'
         DC    AL1(028,0,00),C'   /O       - Alias for /OUT.'
         DC    AL1(067,1,00),C'   /PERCENT - Display the percent of spo$
               ol space in use by each job.'
         DC    AL1(032,1,00),C'   /PCT     - Alias for /PERCENT.'
         DC    AL1(032,1,00),C'   /P       - Alias for /PERCENT.'
         DC    AL1(066,1,00),C'   /SPACE   - Display the amount of spoo$
               l space in use by each job.'
         DC    AL1(030,1,00),C'   /SIZE    - Alias for /SPACE.'
         DC    AL1(030,1,00),C'   /S       - Alias for /SPACE.'
         DC    AL1(000,0,00),C' '
         DC    AL1(059,0,02),X'1DE8',C'Defaults',X'1D60',C'- The previo$
               usly selected job will be displayed.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DN    DC    AL1(000,0,00),C' '
         DC    AL1(052,0,00),C' The "DN" subcommand displays all jobs i$
               n all queues.'
         DC    AL1(000,0,00),C' '
         DC    AL1(021,0,02),X'1DE8',C'Syntax',X'1D60',C'- DN / OUT O'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(068,0,00),C'   /OUT      - Display output group name$
               s instead of the device name.'
         DC    AL1(029,0,00),C'   /O        - Alias for /OUT.'
         DC    AL1(067,1,00),C'   /PERCENT - Display the percent of spo$
               ol space in use by each job.'
         DC    AL1(032,1,00),C'   /PCT     - Alias for /PERCENT.'
         DC    AL1(032,1,00),C'   /P       - Alias for /PERCENT.'
         DC    AL1(066,1,00),C'   /SPACE   - Display the amount of spoo$
               l space in use by each job.'
         DC    AL1(030,1,00),C'   /SIZE    - Alias for /SPACE.'
         DC    AL1(030,1,00),C'   /S       - Alias for /SPACE.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DO    DC    AL1(000,0,00),C' '
         DC    AL1(054,0,00),C' The "DO" subcommand displays jobs in th$
               e output queue.'
         DC    AL1(063,0,00),C' The "AO" subcommand displays jobs in th$
               e output queue which are'
         DC    AL1(066,0,00),C'    available for printing, punching, or$
                plotting (not held and not'
         DC    AL1(028,0,00),C'    currently on any device).'
         DC    AL1(000,0,00),C' '
         DC    AL1(062,0,02),X'1DE8',C'Syntax',X'1D60',C'- DO <classes>$
                / TIME USER OUT O R=<dest> W=<wtrname>'
         DC    AL1(060,0,00),C'        - AO <classes> / TIME USER OUT O$
                R=<dest> W=<wtrname>'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(063,0,00),C'   <classes> - A list of up to 8 output $
               classes to be displayed.'
         DC    AL1(069,0,00),C'   /TIME     - Display the time each job$
                appeared on the output queue.'
         DC    AL1(072,0,00),C'   /USER     - Display the submitter''s $
               userid instead of the remote name.'
         DC    AL1(068,0,00),C'   /OUT      - Display output group name$
               s instead of the device name.'
         DC    AL1(029,0,00),C'   /O        - Alias for /OUT.'
         DC    AL1(075,0,00),C'   R=<dest>  - Select output jobs for <d$
               est>.  If <dest> ends with ''*'', then'
         DC    AL1(074,0,00),C'               all dests starting with <$
               dest> (minus the ''*'') are selected.'
         DC    AL1(054,0,00),C'   R=ALL     - Select output jobs for al$
               l destinations.'
         DC    AL1(067,0,00),C'   W=<wtrname> - Select output jobs with$
                a writer name of <wtrname>.'
         DC    AL1(070,0,00),C'               (If the job is destined f$
               or a TSO user, the userid is in'
         DC    AL1(037,0,00),C'               the writer name field.)'
         DC    AL1(068,0,00),C'   W=ALL     - Select output jobs which $
               have a non-blank writer name.'
         DC    AL1(068,1,00),C'   /PERCENT  - Display the percent of sp$
               ool space in use by each job.'
         DC    AL1(033,1,00),C'   /PCT      - Alias for /PERCENT.'
         DC    AL1(033,1,00),C'   /P        - Alias for /PERCENT.'
         DC    AL1(067,1,00),C'   /SPACE    - Display the amount of spo$
               ol space in use by each job.'
         DC    AL1(031,1,00),C'   /SIZE     - Alias for /SPACE.'
         DC    AL1(031,1,00),C'   /S        - Alias for /SPACE.'
         DC    AL1(000,0,00),C' '
         DC    AL1(071,0,02),X'1DE8',C'Defaults',X'1D60',C'- All output$
                classes will be displayed if none are selected.'
         DC    AL1(068,0,00),C'            Only output for your logon d$
               estination will be displayed.'
         DC    AL1(077,0,00),C'          - If W is entered with no oper$
               and, no selection based on writer name'
         DC    AL1(077,0,00),C'            will occur, but the writer n$
               ame will be displayed instead of dest.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DOWN  DC    AL1(000,0,00),C' '
         DC    AL1(071,0,00),C' The "DOWN" subcommand repositions the c$
               urrently selected dataset toward'
         DC    AL1(011,0,00),C' the bottom.'
         DC    AL1(000,0,00),C' '
         DC    AL1(019,0,02),X'1DE8',C'Syntax',X'1D60',C'- DOWN <#>'
         DC    AL1(012,0,02),X'1DE8',C' Alias',X'1D60',C'- D'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(070,0,00),C'   <#> - The number of records to go for$
               ward from the current position.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DQ    DC    AL1(000,0,00),C' '
         DC    AL1(070,0,00),C' The "DQ" subcommand displays the number$
                of jobs in the various queues.'
         DC    AL1(000,0,00),C' '
         DC    AL1(013,0,02),X'1DE8',C'Syntax',X'1D60',C'- DQ'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(028,0,00),C'   I - Limit to input queues.'
         DC    AL1(029,0,00),C'   O - Limit to output queues.'
         DC    AL1(036,0,00),C'   M - Limit to miscellaneous queues.'
         DC    AL1(078,0,00),C'   X - Count all $OUTPUT jobs, regardles$
               s of whether they have any held output.'
         DC    AL1(000,0,00),C' '
         DC    AL1(047,0,02),X'1DE8',C'Defaults',X'1D60',C'- All queue $
               types will be displayed.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DS    DC    AL1(000,0,00),C' '
         DC    AL1(063,0,00),C' The "DS" subcommand displays currently $
               executing started tasks.'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Syntax',X'1D60',C'- DS TIME'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(047,0,00),C'   /TIME - Display the start time for ea$
               ch task.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DSS   DC    AL1(063,0,00),C'                             << Dataset $
               selection subcommands >>'
         DC    AL1(019,0,00),C'JCl       - List JCL'
         DC    AL1(027,0,00),C'JLog      - List JES2 joblog'
         DC    AL1(031,0,00),C'JMsg      - List system messages'
         DC    AL1(054,0,00),C'DD        - Display DSID''s of SYSIN and$
                SYSOUT datasets'
         DC    AL1(041,0,00),C'List      - List a SYSIN or SYSOUT datas$
               et'
         DC    AL1(000,0,00),C' '
         DC    AL1(048,0,00),C'SJ        - Select first SYSOUT dataset $
               for a job'
         DC    AL1(061,0,00),C'NS        - Select the next SYSOUT datas$
               et (must use SJ first)'
         DC    AL1(065,0,00),C'PS        - Select the previous SYSOUT d$
               ataset (must use SJ first)'
         DC    AL1(000,0,00),C' '
         DC    AL1(052,0,00),C'REDISP|RD - Resume display of selected s$
               ysout dataset'
         DC    AL1(000,0,00),C' '
         DC    AL1(037,0,00),C'JNews     - List the current JES2 news'
         DC    AL1(047,1,00),C'SLog      - List the system log dataset $
               (SYSLOG)'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#DT    DC    AL1(000,0,00),C' '
         DC    AL1(059,0,00),C' The "DT" subcommand displays currently $
               executing TSO users.'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Syntax',X'1D60',C'- DT TIME'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(054,0,00),C'   /TIME - Display the start time for ea$
               ch TSO session.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#ELIST DC    AL1(000,0,00),C' '
         DC    AL1(066,0,00),C' The "ELIST" subcommand is similar to "L$
               IST" but in ISPF mode ELIST'
         DC    AL1(034,0,00),C'    invokes EDIT instead of BROWSE.'
         DC    AL1(000,0,00),C' '
         DC    AL1(031,0,02),X'1DE8',C'Syntax',X'1D60',C'- ELIST <jobid$
               > <dsid>'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- EL'
         DC    AL1(070,0,06),C' From the',X'1DE8',C'DDname',X'1D60',C'd$
               isplay, line command',X'1DE8',C'EL',X'1D60',C'may be use$
               d for',X'1DE8',C'ELIST.',X'1D60'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(075,0,02),C'   <dsid>  - The DSID of the dataset, as$
                displayed by the',X'1DE8',C'"DD"',X'1D60',C'subcommand.$
               '
         DC    AL1(000,0,00),C' '
         DC    AL1(052,0,02),X'1DE8',C'Defaults',X'1D60',C'- <dsid> - t$
               he previously selected <dsid>'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),X'1DE8',C'Note    ',X'1D60',C'- An asteris$
               k',X'1DE8',C'("*")',X'1D60',C'may be used in place of <j$
               obid> to refer'
         DC    AL1(045,0,00),C'            to the most recently selecte$
               d job.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#END   DC    AL1(000,0,00),C' '
         DC    AL1(070,0,00),C' The "END" subcommand terminates the cur$
               rent subcommand, and returns to'
         DC    AL1(032,0,00),C' a higher level QUEUE subcommand.'
         DC    AL1(000,0,00),C' '
         DC    AL1(014,0,02),X'1DE8',C'Syntax',X'1D60',C'- END'
         DC    AL1(011,0,02),X'1DE8',C'Alias',X'1D60',C'- E'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    AL1(000,0,00),C' '
         DC    AL1(072,0,02),X'1DE8',C'********************************$
               *************************************',X'1D60'
         DC    AL1(076,0,06),X'1DE8',C'*',X'1D60',C'Since QUEUE is now $
               tree structure (sort of), the',X'1DE8',C'END',X'1D60',C'$
               subcommand  ',X'1DE8',C'*',X'1D60'
         DC    AL1(074,0,04),X'1DE8',C'*',X'1D60',C'no longer terminate$
               s QUEUE immediately, unless you are currently ',X'1DE8',$
               C'*',X'1D60'
         DC    AL1(076,0,06),X'1DE8',C'*',X'1D60',C'at the top level.  $
               The',X'1DE8',C'EXIT',X'1D60',C'subcommand may be used to$
                leave      ',X'1DE8',C'*',X'1D60'
         DC    AL1(074,0,04),X'1DE8',C'*',X'1D60',C'QUEUE regardless of$
                the current level.                           ',X'1DE8',$
               C'*',X'1D60'
         DC    AL1(072,0,02),X'1DE8',C'********************************$
               *************************************',X'1D60'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#EXIT  DC    AL1(000,0,00),C' '
         DC    AL1(039,0,00),C' The "EXIT" subcommand terminates QUEUE.$
               '
         DC    AL1(000,0,00),C' '
         DC    AL1(015,0,02),X'1DE8',C'Syntax',X'1D60',C'- EXIT'
         DC    AL1(036,0,02),X'1DE8',C'Aliases',X'1D60',C'- EXIT, STOP,$
                QUIT, RETURN'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    AL1(000,0,00),C' '
         DC    AL1(072,0,02),X'1DE8',C'********************************$
               *************************************',X'1D60'
         DC    AL1(076,0,06),X'1DE8',C'*',X'1D60',C'Since QUEUE is now $
               tree structure (sort of), the',X'1DE8',C'END',X'1D60',C'$
               subcommand  ',X'1DE8',C'*',X'1D60'
         DC    AL1(074,0,04),X'1DE8',C'*',X'1D60',C'no longer terminate$
               s QUEUE immediately, unless you are currently ',X'1DE8',$
               C'*',X'1D60'
         DC    AL1(076,0,06),X'1DE8',C'*',X'1D60',C'at the top level.  $
               The',X'1DE8',C'EXIT',X'1D60',C'subcommand may be used to$
                leave      ',X'1DE8',C'*',X'1D60'
         DC    AL1(074,0,04),X'1DE8',C'*',X'1D60',C'QUEUE regardless of$
                the current level.                           ',X'1DE8',$
               C'*',X'1D60'
         DC    AL1(072,0,02),X'1DE8',C'********************************$
               *************************************',X'1D60'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#FIND  DC    AL1(000,0,00),C' '
         DC    AL1(067,0,00),C' The "FIND" subcommand searches the curr$
               ently selected dataset for a'
         DC    AL1(077,0,00),C' character string, then repositions with$
                that record at the top of the screen.'
         DC    AL1(000,0,00),C' '
         DC    AL1(041,0,02),X'1DE8',C'Syntax',X'1D60',C'- FIND ''<stri$
               ng>'' COL(start,end)'
         DC    AL1(012,0,02),X'1DE8',C' Alias',X'1D60',C'- F'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(070,0,00),C'   <string> - The string to be located. $
                The string must be enclosed in'
         DC    AL1(068,0,00),C'              delimiters, unless it star$
               ts with a letter or digit and'
         DC    AL1(077,0,00),C'              contains no blanks.  The d$
               elimiter may be any special character.'
         DC    AL1(058,0,00),C'   <start>  - The starting column to sea$
               rch for the string.'
         DC    AL1(056,0,00),C'   <end>    - The ending column to searc$
               h for the string.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,02),X'1DE8',C'Defaults',X'1D60',C'- The next o$
               ccurrence of the previously entered string will be'
         DC    AL1(019,0,00),C'            located.'
         DC    AL1(041,0,01),C'         ',X'1D60',C'- All columns will $
               be searched.'
         DC    AL1(000,0,00),C' '
         DC    AL1(044,0,04),X'1DE8',C'Notes   ',X'1D60',C'- See also t$
               he',X'1DE8',C'FALL',X'1D60',C'subcommand.'
         DC    AL1(069,0,01),C'         ',X'1D60',C'- If COL is specifi$
               ed, both <start> and <end> are required.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#FALL  DC    AL1(000,0,00),C' '
         DC    AL1(067,0,00),C' The "FALL" subcommand searches the curr$
               ently selected dataset for a'
         DC    AL1(068,0,00),C' character string, displaying only recor$
               ds which contain that string.'
         DC    AL1(000,0,00),C' '
         DC    AL1(041,0,02),X'1DE8',C'Syntax',X'1D60',C'- FALL ''<stri$
               ng>'' COL(start,end)'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- FA'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(070,0,00),C'   <string> - The string to be located. $
                The string must be enclosed in'
         DC    AL1(068,0,00),C'              delimiters, unless it star$
               ts with a letter or digit and'
         DC    AL1(077,0,00),C'              contains no blanks.  The d$
               elimiter may be any special character.'
         DC    AL1(058,0,00),C'   <start>  - The starting column to sea$
               rch for the string.'
         DC    AL1(056,0,00),C'   <end>    - The ending column to searc$
               h for the string.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,02),X'1DE8',C'Defaults',X'1D60',C'- The next o$
               ccurrence of the previously entered string will be'
         DC    AL1(019,0,00),C'            located.'
         DC    AL1(041,0,01),C'         ',X'1D60',C'- All columns will $
               be searched.'
         DC    AL1(000,0,00),C' '
         DC    AL1(044,0,04),X'1DE8',C'Notes   ',X'1D60',C'- See also t$
               he',X'1DE8',C'FIND',X'1D60',C'subcommand.'
         DC    AL1(069,0,01),C'         ',X'1D60',C'- If COL is specifi$
               ed, both <start> and <end> are required.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#FTIME DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "FTIME" subcommand searches the cur$
               rently selected SYSLOG dataset'
         DC    AL1(067,0,00),C' for the first record with a time stamp $
               greater than or equal to the'
         DC    AL1(015,0,00),C' requested time.'
         DC    AL1(000,0,00),C' '
         DC    AL1(023,0,02),X'1DE8',C'Syntax',X'1D60',C'- FTIME <time>$
               '
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- FT'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(069,0,00),C'   <time> - The time (in the form HH.MM.$
               SS or HH.MM) to reposition to.'
         DC    AL1(000,0,00),C' '
         DC    AL1(076,0,02),X'1DE8',C'Note    ',X'1D60',C'- If the tim$
               e you specify is less than the time you are currently'
         DC    AL1(077,0,00),C'            positioned at, no reposition$
               ing will occur.  This will happen when'
         DC    AL1(077,0,00),C'            the SYSLOG starts before mid$
               night and you are searching for a time'
         DC    AL1(072,0,00),C'            after midnight.  To get arou$
               nd this problem, scroll down past'
         DC    AL1(072,0,00),C'            midnight, then enter FTIME f$
               or the desired time.  FTIME 23.59'
         DC    AL1(078,0,00),C'            and then ENTER may be used t$
               o accomplish this, if there is at least'
         DC    AL1(079,0,00),C'            one and at most a screen ful$
               l of records with a time stamp of 23.59.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#GENL  DC    AL1(056,0,00),C'                             << General $
               notes on QUEUE >>'
         DC    AL1(069,0,02),C' When you see',X'1DE8',C'"*MORE*"',X'1D6$
               0',C'in the upper right-hand corner of the screen,'
         DC    AL1(071,0,02),C' it means that more information is waiti$
               ng.  You may either hit',X'1DE8',C'ENTER',X'1D60'
         DC    AL1(049,0,00),C' to view it, or enter a new subcommand t$
               o skip it.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,02),X'1DE8',C'********************************$
               **************************************',X'1D60'
         DC    AL1(075,0,04),X'1DE8',C'*',X'1D60',C'  This version of Q$
               UEUE is now "tree structured", like ISPF.  It  ',X'1DE8'$
               ,C'*',X'1D60'
         DC    AL1(075,0,04),X'1DE8',C'*',X'1D60',C'  is a primitive im$
               plementation, and may not always get you to    ',X'1DE8'$
               ,C'*',X'1D60'
         DC    AL1(077,0,06),X'1DE8',C'*',X'1D60',C'  where you expect $
               when you enter',X'1DE8',C'END.',X'1D60',C'  See Help for$
                END and     ',X'1DE8',C'*',X'1D60'
         DC    AL1(075,0,04),X'1DE8',C'*',X'1D60',C'  EXIT subcommands.$
                                                              ',X'1DE8'$
               ,C'*',X'1D60'
         DC    AL1(073,0,02),X'1DE8',C'********************************$
               **************************************',X'1D60'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#HB    DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "HB" subcommand repositions the cur$
               rently selected dataset toward'
         DC    AL1(008,0,00),C' the top.'
         DC    AL1(000,0,00),C' '
         DC    AL1(017,0,02),X'1DE8',C'Syntax',X'1D60',C'- HB <#>'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(076,0,00),C'   <#> - The number of half screens to g$
               o backward from the current position.'
         DC    AL1(000,0,00),C' '
         DC    AL1(066,0,02),X'1DE8',C'Default',X'1D60',C'- <#> = 1.  T$
               he dataset is scrolled up by half a screen.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#HELP  DC    AL1(000,0,00),C' '
         DC    AL1(030,0,02),X'1DE8',C'Syntax',X'1D60',C'- HELP subcomm$
               andname'
         DC    AL1(012,0,02),X'1DE8',C' Alias',X'1D60',C'- H'
         DC    AL1(000,0,00),C' '
         DC    AL1(061,0,00),C' Note - A list of subcommand names may b$
               e obtained by entering'
         DC    AL1(040,0,04),C'       ',X'1DE8',C'HELP COMMANDS',X'1D60$
               ',C'(or',X'1DE8',C'HELP CMDS)',X'1D60'
         DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' Note - There are several other topics w$
               hich may be viewed by entering'
         DC    AL1(079,0,02),C'       ',X'1DE8',C'HELP other-topic',X'1$
               D60',C'.  A list of these topics is given under "HELP CM$
               DS".'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#HF    DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "HF" subcommand repositions the cur$
               rently selected dataset toward'
         DC    AL1(011,0,00),C' the bottom.'
         DC    AL1(000,0,00),C' '
         DC    AL1(017,0,02),X'1DE8',C'Syntax',X'1D60',C'- HF <#>'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(075,0,00),C'   <#> - The number of half screens to g$
               o forward from the current position.'
         DC    AL1(000,0,00),C' '
         DC    AL1(068,0,02),X'1DE8',C'Default',X'1D60',C'- <#> = 1.  T$
               he dataset is scrolled down by half a screen.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#HJ    DC    AL1(000,0,00),C' '
         DC    AL1(032,0,00),C' The "HJ" subcommand holds a job.'
         DC    AL1(000,0,00),C' '
         DC    AL1(021,0,02),X'1DE8',C'Syntax',X'1D60',C'- HJ <jobid>'
         DC    AL1(015,0,02),X'1DE8',C' Alias',X'1D60',C'- HOLD'
         DC    AL1(068,0,04),C' From a status display,',X'1DE8',C'HJ',X$
               '1D60',C'or',X'1DE8',C'H',X'1D60',C'may be entered as a $
               line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),X'1DE8',C'Note    ',X'1D60',C'- An asteris$
               k',X'1DE8',C'("*")',X'1D60',C'may be used in place of <j$
               obid> to refer'
         DC    AL1(045,0,00),C'            to the most recently selecte$
               d job.'
          AIF   (&@@SCSVC NE 0 OR &@@TSOE GE 120).HE#HJ
         DC    AL1(064,0,00),C'NOTE:  The "HJ" subcommand can only func$
               tion if QUEUE was entered'
         DC    AL1(060,0,00),C'       at the "READY" level (i.e., it ca$
               nnot work inside SPF)'
.HE#HJ    ANOP
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#IOQ   DC    AL1(079,0,00),C'                             << Input/Ou$
               tput queue display subcommand summary >>'
         DC    AL1(046,0,00),C'STatus   - Display jobs matching a given$
                prefix'
         DC    AL1(035,0,00),C'DA       - Display jobs in execution'
         DC    AL1(027,0,00),C'DT       - Display TSO users'
         DC    AL1(030,0,00),C'DS       - Display system tasks'
         DC    AL1(033,0,00),C'DEVices  - Display jobs on devices'
         DC    AL1(047,0,00),C'CPU      - Display CPU time etc for acti$
               ve tasks'
         DC    AL1(028,0,00),C'DI       - Display input jobs'
         DC    AL1(029,0,00),C'DO       - Display output jobs'
         DC    AL1(039,0,00),C'DH       - Display jobs with held output$
               '
         DC    AL1(048,0,00),C'DQ       - Display summary of Input/Outp$
               ut queues'
         DC    AL1(052,0,00),C'AI       - Display input jobs available $
               for execution'
         DC    AL1(054,0,00),C'AO       - Display jobs available for pr$
               inting/punching'
         DC    AL1(033,0,00),C'HI       - Display held input jobs'
         DC    AL1(040,0,00),C'DN       - Display all jobs in all queue$
               s'
         DC    AL1(045,0,00),C'DJ       - Display job by jobname or job$
               number'
         DC    AL1(050,0,00),C'JD       - Display detailed information $
               about a job'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#JCL   DC    AL1(000,0,00),C' '
         DC    AL1(045,0,00),C' The "JCL" subcommand lists the JCL for $
               a job.'
         DC    AL1(000,0,00),C' '
         DC    AL1(031,0,02),X'1DE8',C'Syntax',X'1D60',C'- JCL <jobid> $
               / EDIT E'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- JC'
         DC    AL1(061,0,02),C' From a status display,',X'1DE8',C'JC',X$
               '1D60',C'may be entered as a line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(070,0,00),C'   /EDIT   - (ISPF mode only) Invoke EDI$
               T instead of BROWSE.  Note that'
         DC    AL1(050,0,00),C'             changes cannot be saved bac$
               k to spool.'
         DC    AL1(028,0,00),C'   /E      - Alias for /EDIT.'
         DC    AL1(000,0,00),C' '
         DC    AL1(071,0,02),X'1DE8',C'Defaults',X'1D60',C'- The JCL fo$
               r the previously selected job will be displayed.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#JD    DC    AL1(000,0,00),C' '
         DC    AL1(070,0,00),C' The "JD" subcommand displays detailed i$
               nformation for a job, including'
         DC    AL1(052,0,00),C' input, execution, and output times (whe$
               n available).'
         DC    AL1(000,0,00),C' '
         DC    AL1(021,0,02),X'1DE8',C'Syntax',X'1D60',C'- JD <jobid>'
         DC    AL1(061,0,02),C' From a status display,',X'1DE8',C'JD',X$
               '1D60',C'may be entered as a line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(058,0,00),C'   <jobid> - The name or number of the j$
               ob to be displayed.'
         DC    AL1(000,0,00),C' '
         DC    AL1(059,0,02),X'1DE8',C'Defaults',X'1D60',C'- The previo$
               usly selected job will be displayed.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#JLOG  DC    AL1(000,0,00),C' '
         DC    AL1(055,0,00),C' The "JLOG" subcommand lists the JES2 jo$
               b log for a job.'
         DC    AL1(000,0,00),C' '
         DC    AL1(032,0,02),X'1DE8',C'Syntax',X'1D60',C'- JLOG <jobid>$
                / EDIT E'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- JL'
         DC    AL1(061,0,02),C' From a status display,',X'1DE8',C'JL',X$
               '1D60',C'may be entered as a line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(070,0,00),C'   /EDIT   - (ISPF mode only) Invoke EDI$
               T instead of BROWSE.  Note that'
         DC    AL1(050,0,00),C'             changes cannot be saved bac$
               k to spool.'
         DC    AL1(028,0,00),C'   /E      - Alias for /EDIT.'
         DC    AL1(000,0,00),C' '
         DC    AL1(075,0,02),X'1DE8',C'Defaults',X'1D60',C'- The job lo$
               g for the previously selected job will be displayed.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#JMSG  DC    AL1(000,0,00),C' '
         DC    AL1(060,0,00),C' The "JMSG" subcommand lists the JES2 jo$
               b messages for a job.'
         DC    AL1(000,0,00),C' '
         DC    AL1(032,0,02),X'1DE8',C'Syntax',X'1D60',C'- JMSG <jobid>$
                / EDIT E'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- JM'
         DC    AL1(061,0,02),C' From a status display,',X'1DE8',C'JM',X$
               '1D60',C'may be entered as a line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(070,0,00),C'   /EDIT   - (ISPF mode only) Invoke EDI$
               T instead of BROWSE.  Note that'
         DC    AL1(050,0,00),C'             changes cannot be saved bac$
               k to spool.'
         DC    AL1(028,0,00),C'   /E      - Alias for /EDIT.'
         DC    AL1(000,0,00),C' '
         DC    AL1(080,0,02),X'1DE8',C'Defaults',X'1D60',C'- The job me$
               ssages for the previously selected job will be displayed$
               .'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#JSUMM DC    AL1(000,0,00),C' '
         DC    AL1(067,0,00),C' The "JSUMM" subcommand summarizes the r$
               esults of a job''s execution.'
         DC    AL1(071,0,00),C' A line is produced for each step showin$
               g information such as completion'
         DC    AL1(075,0,00),C' code, CPU time, etc.  In addition, erro$
               r messages and some warning messages'
         DC    AL1(067,0,02),C' (such as',X'1DE8',C'"NOT CATALOGED")',X$
               '1D60',C' from the JOBMSG dataset are displayed.'
         DC    AL1(000,0,00),C' '
         DC    AL1(024,0,02),X'1DE8',C'Syntax',X'1D60',C'- JSUMM <jobid$
               >'
         DC    AL1(018,0,02),X'1DE8',C' Aliases',X'1D60',C'- JS, J'
         DC    AL1(061,0,02),C' From a status display,',X'1DE8',C'JS',X$
               '1D60',C'may be entered as a line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(000,0,00),C' '
         DC    AL1(075,0,02),X'1DE8',C'Defaults',X'1D60',C'- The job lo$
               g for the previously selected job will be displayed.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#JNEWS DC    AL1(000,0,00),C' '
         DC    AL1(049,0,00),C' The "JNEWS" subcommand lists the curren$
               t JESNEWS.'
         DC    AL1(000,0,00),C' '
         DC    AL1(016,0,02),X'1DE8',C'Syntax',X'1D60',C'- JNEWS'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- JN'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#LEFT  DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "LEFT" subcommand repositions the c$
               urrently selected dataset left'
         DC    AL1(030,0,00),C' a specified number of columns.'
         DC    AL1(000,0,00),C' '
         DC    AL1(019,0,02),X'1DE8',C'Syntax',X'1D60',C'- LEFT <#>'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- LE'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(044,0,00),C'   <#> - The number of columns to shift $
               left.'
         DC    AL1(000,0,00),C' '
         DC    AL1(022,0,02),X'1DE8',C'Defaults',X'1D60',C'- <#> = 40.'$

         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#LIST  DC    AL1(000,0,00),C' '
         DC    AL1(064,0,00),C' The "LIST" subcommand lists a SYSIN or $
               SYSOUT dataset for a job.'
         DC    AL1(000,0,00),C' '
         DC    AL1(044,0,02),X'1DE8',C'Syntax',X'1D60',C'- LIST <jobid>$
                <dsid> <col> /EDIT E'
         DC    AL1(012,0,02),X'1DE8',C' Alias',X'1D60',C'- L'
         DC    AL1(075,0,08),C' From the',X'1DE8',C'DDname',X'1D60',C'd$
               isplay, line command',X'1DE8',C'L',X'1D60',C'or',X'1DE8'$
               ,C'S',X'1D60',C'may be used for',X'1DE8',C'LIST.',X'1D60$
               '
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(075,0,02),C'   <dsid>  - The DSID of the dataset, as$
                displayed by the',X'1DE8',C'"DD"',X'1D60',C'subcommand.$
               '
         DC    AL1(058,0,00),C'   <col>   - The default column number f$
               or the left margin.'
         DC    AL1(070,0,00),C'   /EDIT   - (ISPF mode only) Invoke EDI$
               T instead of BROWSE.  Note that'
         DC    AL1(050,0,00),C'             changes cannot be saved bac$
               k to spool.'
         DC    AL1(028,0,00),C'   /E      - Alias for /EDIT.'
         DC    AL1(000,0,00),C' '
         DC    AL1(052,0,02),X'1DE8',C'Defaults',X'1D60',C'- <dsid> - t$
               he previously selected <dsid>'
         DC    AL1(019,0,01),C'         ',X'1D60',C'- <col>=1'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),X'1DE8',C'Note    ',X'1D60',C'- An asteris$
               k',X'1DE8',C'("*")',X'1D60',C'may be used in place of <j$
               obid> to refer'
         DC    AL1(045,0,00),C'            to the most recently selecte$
               d job.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#LCMDS DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),C' Many',X'1DE8',C'QUEUE',X'1D60',C'subcom$
               mands may be entered as line commands (as in',X'1DE8',C'$
               ISPF).',X'1D60'
         DC    AL1(069,0,02),C' Some are valid from',X'1DE8',C'status',$
               X'1D60',C'type displays, and others are valid from'
         DC    AL1(068,0,02),C' the',X'1DE8',C'DDname',X'1D60',C'displa$
               y.  The Help screen for each subcommand will give'
         DC    AL1(064,0,00),C' the one or two character command name t$
               hat can be used as a line'
         DC    AL1(067,0,00),C' command.  (Line commands are entered in$
                the input field at the left'
         DC    AL1(019,0,00),C' of a display line.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' If an operand in addition to the jobid $
               is required, it may be entered'
         DC    AL1(068,0,00),C' in the input field at the right of the $
               display line.  (This field is'
         DC    AL1(070,0,00),C' also used to display the destination, b$
               ut if not overtyped, is treated'
         DC    AL1(018,0,00),C' as if left blank.)'
         DC    AL1(000,0,00),C' '
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#LRMT  DC    AL1(000,0,00),C' '
         DC    AL1(061,0,00),C' The "LRMT" subcommand lists the names a$
               nd numbers of all JES2'
         DC    AL1(020,0,00),C' remote destinations.'
         DC    AL1(000,0,00),C' '
         DC    AL1(015,0,02),X'1DE8',C'Syntax',X'1D60',C'- LRMT'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#MD    DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "MD" (move display) subcommand repo$
               sitions the currently selected'
         DC    AL1(039,0,00),C' dataset to the specified record number.$
               '
         DC    AL1(000,0,00),C' '
         DC    AL1(017,0,02),X'1DE8',C'Syntax',X'1D60',C'- MD <#>'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(067,0,00),C'   <#> - The record number to be display$
               ed at the top of the screen.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#MODE  DC    AL1(000,0,00),C' '
         DC    AL1(068,0,00),C' The "MODE" subcommand is used to displa$
               y and/or change various QUEUE'
         DC    AL1(019,0,00),C' processing options.'
         DC    AL1(000,0,00),C' '
         DC    AL1(074,0,02),X'1DE8',C'The "MODE" subcommand may be use$
               d in a QUEUE "PROFILE".',X'1D60',C' See HELP QPROF.'
         DC    AL1(000,0,00),C' '
         DC    AL1(043,0,02),X'1DE8',C'Syntax',X'1D60',C'- MODE option1$
                option2 ... optionn'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(000,0,00),C' '
         DC    AL1(053,0,00),C' (blank)         - Display current Queue$
                mode settings#{â
         DC    AL1(055,0,00),C' SHOWCC/NOSHOWCC - Display carriage cont$
               rol when present'
         DC    AL1(059,0,00),C' PAGE            - Format output display$
               s by (printed) pages'
         DC    AL1(060,0,00),C' LINE            - Format output display$
               s by line number only'
         DC    AL1(073,0,00),C' FANUM/NOFANUM   - "FALL" (find all) com$
               mand should display record numbers'
         DC    AL1(056,0,00),C' BEEP/NOBEEP     - Sound audible alarm f$
               or error messages'
         DC    AL1(055,0,00),C' PFK12           - Map PF13-PF24 to PF1-$
               PF12 definitions'
         DC    AL1(072,0,00),C' PFK24           - Allow PF13-PF24 to be$
                defined separately from PF1-PF12'
         DC    AL1(063,0,00),C' JDATE           - Display all dates in $
               "Julian" (yy.ddd) format'
         DC    AL1(067,0,00),C' GDATE           - Display all dates in $
               "Gregorian" (nnmmmyy) format'
         DC    AL1(076,0,00),C' VERIFY/NOVERIFY - Indicates whether act$
               ion subcmds should verify before exec'
         DC    AL1(074,0,00),C' STACK/NOSTACK   - Indicates whether PF3$
                should pop the stack or exit QUEUE'
         DC    AL1(072,0,00),C' RSCA/NORSCA     - Indicates whether to $
               Reissue the Stacked Command After'
         DC    AL1(033,0,00),C'                   action commands'
         DC    AL1(051,0,00),C' STATUS=<prefix> - Set default search ke$
               y for "ST *"'
         DC    AL1(070,0,00),C' DESTR=<dest>    - Set default route des$
               tination for "ROUTE" subcommand'
         DC    AL1(071,0,00),C' DEST=<dest>     - Set default output de$
               stination for "PRint" subcommand'
         DC    AL1(065,0,00),C' CLASS=<class>   - Set default sysout cl$
               ass for "PRint" subcommand'
         DC    AL1(056,0,00),C' FCB=<fcb>       - Set default fcb for "$
               PRint" subcommand'
         DC    AL1(057,0,00),C' FORM=<form>     - Set default form for $
               "PRint" subcommand'
         DC    AL1(056,0,00),C' UCS=<ucs>       - Set default ucs for "$
               PRint" subcommand'
         DC    AL1(049,0,00),C' COLS            - Column scale is to be$
                displayed'
         DC    AL1(053,0,00),C' NOCOLS          - Column scale is not t$
               o be displayed'
         DC    AL1(050,0,00),C' LINECT          - Set linecount for pri$
               nted output'
         DC    AL1(069,0,03),C'*',X'1DE8',X'1DE8',X'1DE8',C' need to do$
               cument privileged operands SLxxx && APPLCOPY/NOAPPCPY'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#NJ    DC    AL1(000,0,00),C' '
         DC    AL1(064,0,00),C' The "NJ" subcommand displays jobs on th$
               e network transmit queue.'
         DC    AL1(000,0,00),C' '
         DC    AL1(013,0,02),X'1DE8',C'Syntax',X'1D60',C'- NJ'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#NS    DC    AL1(000,0,00),C' '
         DC    AL1(070,0,00),C' The "NS" subcommand causes the next (or$
                previous) sysout dataset to be'
         DC    AL1(010,0,00),C' displayed.'
         DC    AL1(000,0,00),C' '
         DC    AL1(036,0,02),X'1DE8',C'Syntax',X'1D60',C'- NS NEXT PREV$
                TOP BOTTOM *'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(076,0,00),C'   NEXT   - The next sysout dataset is t$
               o be displayed.  This is the default.'
         DC    AL1(026,0,00),C'   N      - Alias for NEXT.'
         DC    AL1(058,0,00),C'   PREV   - The previous sysout dataset $
               is to be displayed.'
         DC    AL1(026,0,00),C'   P      - Alias for PREV.'
         DC    AL1(055,0,00),C'   TOP    - The first sysout dataset is $
               to be displayed.'
         DC    AL1(025,0,00),C'   T      - Alias for TOP.'
         DC    AL1(054,0,00),C'   BOTTOM - The last sysout dataset is t$
               o be displayed.'
         DC    AL1(028,0,00),C'   B      - Alias for BOTTOM.'
         DC    AL1(072,0,00),C'   *      - Display the next or previous$
                sysout, depending on the current'
         DC    AL1(031,0,00),C'            direction indicator.'
         DC    AL1(017,0,02),X'1DE8',C'Default ',X'1D60',C'- NEXT'
         DC    AL1(000,0,00),C' '
         DC    AL1(069,0,02),X'1DE8',C'Notes  ',X'1D60',C'- The job mus$
               t first be selected using the "SJ" subcommand.'
         DC    AL1(080,0,02),C'         - If using',X'1DE8',C'NS *',X'1$
               D60',C'(the default PF6/PF18), when the end (or beginnin$
               g) of'
         DC    AL1(075,0,00),C'           the output is reached, enteri$
               ng NS * again will cause the default'
         DC    AL1(075,0,00),C'           direction to be changed for t$
               he duration of this "SJ" subcommand.'
         DC    AL1(058,0,02),C'         - See also the description of t$
               he',X'1DE8',C'PS',X'1D60',C'subcommand.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#PAGE  DC    AL1(000,0,00),C' '
         DC    AL1(071,0,00),C' The "PAGE" subcommand repositions the c$
               urrently selected dataset to the'
         DC    AL1(022,0,00),C' specified page number.'
         DC    AL1(000,0,00),C' '
         DC    AL1(019,0,02),X'1DE8',C'Syntax',X'1D60',C'- PAGE <#>'
         DC    AL1(011,0,02),X'1DE8',C'Alias',X'1D60',C'- P'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(065,0,00),C'   <#> - The page number to be displayed$
                at the top of the screen.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#PB    DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "PB" subcommand repositions the cur$
               rently selected dataset toward'
         DC    AL1(008,0,00),C' the top.'
         DC    AL1(000,0,00),C' '
         DC    AL1(017,0,02),X'1DE8',C'Syntax',X'1D60',C'- PB <#>'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(071,0,00),C'   <#> - The number of screens to go bac$
               kward from the current position.'
         DC    AL1(000,0,00),C' '
         DC    AL1(055,0,02),X'1DE8',C'Default',X'1D60',C'- <#> = 1.  T$
               he previous screen is displayed.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#PF    DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "PF" subcommand repositions the cur$
               rently selected dataset toward'
         DC    AL1(011,0,00),C' the bottom.'
         DC    AL1(000,0,00),C' '
         DC    AL1(017,0,02),X'1DE8',C'Syntax',X'1D60',C'- PF <#>'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(070,0,00),C'   <#> - The number of screens to go for$
               ward from the current position.'
         DC    AL1(000,0,00),C' '
         DC    AL1(051,0,02),X'1DE8',C'Default',X'1D60',C'- <#> = 1.  T$
               he next screen is displayed.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#PFK   DC    AL1(000,0,00),C' '
         DC    AL1(038,0,02),X'1DE8',C'The default PF Key definitions a$
               re:',X'1D60'
         DC    AL1(028,0,00),C' ____________________________'
         DC    AL1(074,0,00),C' |PF1 /13 |PF2 /14 |PF3 /15 |       PF K$
               eys 13-24 are mapped to perform the'
         DC    AL1(067,0,06),C' |',X'1DE8',C' Help ',X'1D60',C'|',X'1DE$
               8',C' RC   ',X'1D60',C'|',X'1DE8',C' End  ',X'1D60',C'| $
                     same functions as PF 1-12.'
         DC    AL1(028,0,00),C' |________|________|________|'
         DC    AL1(077,0,00),C' |PF4 /16 |PF5 /17 |PF6 /18 |       To s$
               pecify operands for any PF Key, key in'
         DC    AL1(084,0,06),C' |',X'1DE8',C' PRint',X'1D60',C'|',X'1DE$
               8',C' Find ',X'1D60',C'|',X'1DE8',C' NS * ',X'1D60',C'| $
                     the value and press the appropriate PF Key.'
         DC    AL1(028,0,00),C' |________|________|________|'
         DC    AL1(070,0,00),C' |PF7 /19 |PF8 /20 |PF9 /21 |       PFK $
               definitions may be displayed by'
         DC    AL1(082,0,06),C' |',X'1DE8',C' Up   ',X'1D60',C'|',X'1DE$
               8',C' Down ',X'1D60',C'|',X'1DE8',C' AO   ',X'1D60',C'| $
                     entering the PFK command with no operand.'
         DC    AL1(028,0,00),C' |________|________|________|'
         DC    AL1(028,0,00),C' |PF10/22 |PF11/23 |PF12/24 |'
         DC    AL1(034,0,06),C' |',X'1DE8',C' LEft ',X'1D60',C'|',X'1DE$
               8',C' RIght',X'1D60',C'|',X'1DE8',C' ST   ',X'1D60',C'|'$

         DC    AL1(028,0,00),C' |________|________|________|'
         DC    AL1(000,0,00),C' '
         DC    AL1(046,0,00),C'The PFK definitions may be changed by en$
               tering:'
         DC    AL1(058,0,02),C'         ',X'1DE8',C'PFK <numb> <any QUE$
               UE subcommand and operands>',X'1D60'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,02),X'1DE8',C'The "PFK" subcommand may be used$
                in a QUEUE "PROFILE".',X'1D60',C' See HELP QPROF.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#PRINT DC    AL1(000,0,00),C' '
         DC    AL1(067,0,00),C' The "PRINT" subcommand prints the scree$
               n image to a sysout dataset.'
         DC    AL1(000,0,00),C' '
         DC    AL1(072,0,02),X'1DE8',C'Syntax',X'1D60',C'- PRINT ON  <c$
               lass> DEST=<dest> FCB=<fcb> FORM=<form> UCS=<ucs>'
         DC    AL1(026,0,00),C'          PRINT OFF <class>'
         DC    AL1(023,0,00),C'          PRINT OFF HOLD'
         DC    AL1(018,0,00),C'          PRINT DEL'
         DC    AL1(014,0,00),C'          PRINT'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- PR'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(070,0,00),C'   ON      - The print file is to be ope$
               ned with the specified options.'
         DC    AL1(078,0,00),C'             ** The screen image will no$
               t be printed if the operand is "ON". **'
         DC    AL1(048,0,00),C'   <class> - The sysout class for the pr$
               int file.'
         DC    AL1(047,0,00),C'   <dest>  - The destination for the pri$
               nt file.'
         DC    AL1(039,0,00),C'   <fcb>   - The FCB for the print file.$
               '
         DC    AL1(046,0,00),C'   <form>  - The forms code for the prin$
               t file.'
         DC    AL1(039,0,00),C'   <ucs>   - The UCS for the print file.$
               '
         DC    AL1(061,0,00),C'   HOLD    - The sysout is to be marked $
               "HELD" as it is freed.'
         DC    AL1(040,0,00),C'   DEL     - The sysout is to be deleted$
               .'
         DC    AL1(046,0,00),C'   (blank) - The screen image is to be p$
               rinted.'
         DC    AL1(000,0,00),C' '
         DC    AL1(081,0,02),X'1DE8',C'Defaults',X'1D60',C'- If PRINT i$
               s entered with no operands and the print file is not ope$
               n,'
         DC    AL1(075,0,00),C'            it will be opened with all d$
               efaults taken from values set by the'
         DC    AL1(070,0,00),C'            "MODE" subcommand.  If not s$
               et by "MODE", the defaults are:'
         DC    AL1(077,0,00),C'            CLASS=A, DEST= your logon de$
               st, no FCB, FORM, or UCS (installation'
         DC    AL1(028,0,00),C'            standard output).'
         DC    AL1(000,0,00),C' '
         DC    AL1(044,0,04),X'1DE8',C'Note:   ',X'1D60',C'- See also t$
               he',X'1DE8',C'COPY',X'1D60',C'subcommand.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#PRIV  DC    AL1(056,0,00),C'                             << Privileg$
               ed subcommands >>'
         DC    AL1(046,0,00),C'INit                 - Display initiator$
                status'
         DC    AL1(057,0,00),C'XJ       <jobid>     - Display uninterpr$
               eted JQEs and JOEs'
         DC    AL1(053,0,00),C'XBlk     <mttr>      - Display block fro$
               m SYS1.HASPACE'
         DC    AL1(062,0,00),C'JOBX|JDX <jobid>     - Display other inf$
               o from JCT (mostly hex)'
         DC    AL1(052,0,00),C'JCT <jobid> <offset> - Display JCT in he$
               x dump format'
         DC    AL1(062,0,00),C'LTXT <jobid>         - Display internal $
               text in hex dump format'
         DC    AL1(043,0,00),C'HCT  <displacement>  - Display HCT $SAVE$
               AREA'
         DC    AL1(047,0,00),C'QCMN <displacement>  - Display QCOMMON w$
               ork area'
         DC    AL1(039,0,00),C'CKPT <displacement>  - Display CKPT data$
               '
         DC    AL1(067,0,00),C'LBLK     <jobid>     - Format control bl$
               ocks which reside on HASPACE'
         DC    AL1(068,0,00),C'LSYS                 - Display names and$
                status in Multi-Access Spool'
          AIF   (&QLEVEL LT 8).HE#PRV1
         DC    AL1(038,0,00),C'LDAS                 - Display all DASs'$

         DC    AL1(047,0,00),C'LKIT                 - Display all KITs $
               and HDPs'
.HE#PRV1  ANOP
          AIF   (&@@SCSVC NE 0 OR &@@TSOE GE 120).HE#PRV2
         DC    AL1(000,0,00),C' '
         DC    AL1(070,0,00),C'The following may only be executed if "Q$
               UEUE" is running APF authorized'
         DC    AL1(000,0,00),C' '
.HE#PRV2  ANOP
         DC    AL1(035,0,00),C'AJ/RELease <jobid>   - Release a job'
         DC    AL1(032,0,00),C'HJ/HOLD    <jobid>   - Hold a job'
         DC    AL1(053,0,00),C'EJ         <jobid>   - Hold, Restart, an$
               d Cancel a job'
         DC    AL1(072,0,00),C'TJ <jobid> C=? P=? S=?  - Set a job''s c$
               lass, priority, or system affinity'
         DC    AL1(051,0,00),C'/          <command> - Issue any MVS or $
               JES2 command'
         DC    AL1(079,0,00),C'           (JES2 commands for the select$
               ed JES need not be preceeded by a slash)'
         DC    AL1(076,0,00),C'CONS       <addr>    - Display MCS conso$
               le buffer (default is master console)'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#PS    DC    AL1(000,0,00),C' '
         DC    AL1(071,0,00),C' The "PS" subcommand causes the previous$
                sysout dataset to be displayed.'
         DC    AL1(000,0,00),C' '
         DC    AL1(013,0,02),X'1DE8',C'Syntax',X'1D60',C'- PS'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    AL1(000,0,00),C' '
         DC    AL1(069,0,02),X'1DE8',C'Notes  ',X'1D60',C'- The job mus$
               t first be selected using the "SJ" subcommand.'
         DC    AL1(058,0,02),C'         - See also the description of t$
               he',X'1DE8',C'NS',X'1D60',C'subcommand.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#PURGE DC    AL1(000,0,00),C' '
         DC    AL1(068,0,00),C' The "PURGE" subcommand purges (removes $
               from the JES2 queue) an input'
         DC    AL1(063,0,00),C' or output job, or all output if the job$
                is currently executing.'
         DC    AL1(000,0,00),C' '
         DC    AL1(024,0,02),X'1DE8',C'Syntax',X'1D60',C'- PURGE <jobid$
               >'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- PJ'
         DC    AL1(061,0,02),C' From a status display,',X'1DE8',C'PJ',X$
               '1D60',C'may be entered as a line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),X'1DE8',C'Note    ',X'1D60',C'- An asteris$
               k',X'1DE8',C'("*")',X'1D60',C'may be used in place of <j$
               obid> to refer'
         DC    AL1(045,0,00),C'            to the most recently selecte$
               d job.'
          AIF   (&@@SCSVC NE 0 OR &@@TSOE GE 120).HE#PUR
         DC    AL1(067,0,00),C'NOTE:  The "PURGE" subcommand can only f$
               unction if QUEUE was entered'
         DC    AL1(060,0,00),C'       at the "READY" level (i.e., it ca$
               nnot work inside SPF)'
.HE#PUR   ANOP
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#QINT  DC    AL1(000,0,00),C' '
         DC    AL1(070,0,00),C' The "QINT" subcommand is used to displa$
               y internal QUEUE statistics and'
         DC    AL1(071,0,00),C' operational data, and change some inter$
               nal operational characteristics.'
         DC    AL1(000,0,00),C' '
         DC    AL1(074,0,02),X'1DE8',C'The "QINT" subcommand may be use$
               d in a QUEUE "PROFILE".',X'1D60',C' See HELP QPROF.'
         DC    AL1(000,0,00),C' '
         DC    AL1(043,0,02),X'1DE8',C'Syntax',X'1D60',C'- QINT option1$
                option2 ... optionn'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(000,0,00),C' '
         DC    AL1(059,0,00),C' (blank)        - Display current Queue $
               internal information'
         DC    AL1(038,0,00),C' USERMODE|USER  - Reset privilege flags'$

         DC    AL1(036,0,00),C' DEBUG=xxxxxxxx - Set debugging flags'
         DC    AL1(079,0,00),C' SYSP/NOSYSP    - Set/Reset system progr$
               ammer authorization (must have PSCBACCT)'
         DC    AL1(070,0,00),C' OPER/NOPER     - Set/Reset operator aut$
               horization (must have PSCBACCT)'
         DC    AL1(077,0,00),C' COMCHAR|COMCHR=<char> - Set or change J$
               ES2 communications char (for secondary'
         DC    AL1(077,0,00),C'                   JES2) (Only affects t$
               he "AJ", "HJ", "RJ", "PJ" subcommands)'
         DC    AL1(055,0,00),C' SIDTRAN/NOSIDTRAN - Set/Reset translati$
               on of system ids'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#QPROF DC    AL1(000,0,00),C' '
         DC    AL1(068,0,00),C' QUEUE, during initialization, will opti$
               onally execute a user-defined'
         DC    AL1(070,0,00),C' list of QUEUE subcommands.  If DDNAME S$
               YSPROC is allocated at entry to'
         DC    AL1(071,0,02),C' QUEUE, and it contains a member named',$
               X'1DE8',C'QPROF,',X'1D60',C'that member will be read'
         DC    AL1(070,0,00),C' and then each subcommand it contains wi$
               ll be executed.  QPROF may only'
         DC    AL1(065,0,04),C' contain',X'1DE8',C'MODE',X'1D60',C'and'$
               ,X'1DE8',C'PFK',X'1D60',C'subcommands.  If any other sub$
               command is'
         DC    AL1(065,0,00),C' encountered, it will be the last profil$
               e command executed, and no'
         DC    AL1(068,0,00),C' warning message will be given.  This wi$
               ll also apply to MODE and PFK'
         DC    AL1(037,0,00),C' subcommands entered with no operands.'
         DC    AL1(000,0,00),C' '
         DC    AL1(061,1,02),C' Privileged users may also supply',X'1DE$
               8',C'QINT',X'1D60',C'subcommands in QPROF.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#RE    DC    AL1(000,0,00),C' '
         DC    AL1(074,0,00),C' The "RETRIEVE" subcommand recalls a pre$
               vious subcommand to the input area.'
         DC    AL1(000,0,00),C' '
         DC    AL1(032,0,02),X'1DE8',C'Syntax',X'1D60',C'- RETRIEVE (F)$
                (I)  (T)'
         DC    AL1(012,0,02),X'1DE8',C'Alias',X'1D60',C'- RE'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(066,0,00),C'   (blank) - The previous subcommand of $
               any type is to be recalled.'
         DC    AL1(055,0,00),C'   F       - The last FIND subcommand is$
                to be recalled.'
         DC    AL1(058,0,00),C'   I       - The last inquiry subcommand$
                is to be recalled.'
         DC    AL1(054,0,00),C'   T       - The last TSO subcommand is $
               to be recalled.'
         DC    AL1(062,1,00),C'   C       - The last MVS or JES2 subcom$
               mand is to be recalled.'
         DC    AL1(000,0,00),C' '
         DC    AL1(053,0,02),X'1DE8',C'Note    ',X'1D60',C'- Only 1 ope$
               rand may be entered at a time.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#RD    DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "REDISP" subcommand will list the m$
               ost recently selected dataset,'
         DC    AL1(028,0,00),C' at the last position viewed.'
         DC    AL1(000,0,00),C' '
         DC    AL1(017,0,02),X'1DE8',C'Syntax',X'1D60',C'- REDISP'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- RD'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#REPOS DC    AL1(067,0,00),C'                             << Dataset $
               repositioning subcommands >>'
         DC    AL1(048,0,00),C'Find       - Find a character string in $
               a dataset'
         DC    AL1(044,0,00),C'FAll       - Find all occurrences of <st$
               ring>'
         DC    AL1(047,0,00),C'FTime      - Reposition system log to gi$
               ven time'
         DC    AL1(035,0,00),C'Column     - Reposition horizontally'
         DC    AL1(039,0,00),C'LEft       - Reposition left <#> columns$
               '
         DC    AL1(040,0,00),C'Right      - Reposition right <#> column$
               s'
         DC    AL1(048,0,00),C'MD         - Reposition to specific reco$
               rd number'
         DC    AL1(041,0,00),C'Down       - Reposition forward in datas$
               et'
         DC    AL1(042,0,00),C'Up         - Reposition backward in data$
               set'
         DC    AL1(040,0,00),C'Top        - Reposition to top of datase$
               t'
         DC    AL1(043,0,00),C'Bottom     - Reposition to bottom of dat$
               aset'
         DC    AL1(044,0,00),C'PF, PB     - Page forward or back <#> sc$
               reens'
         DC    AL1(049,0,00),C'HF, HB     - Page forward or back <#> ha$
               lf screens'
         DC    AL1(053,0,00),C'REDISP|RD  - Resume display of selected $
               sysout dataset'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#REQ   DC    AL1(000,0,00),C' '
         DC    AL1(070,0,00),C' The "REQUEUE" subcommand changes the he$
               ld sysout for a job to non-held'
         DC    AL1(021,0,00),C' in a different class.'
         DC    AL1(000,0,00),C' '
         DC    AL1(034,0,02),X'1DE8',C'Syntax',X'1D60',C'- REQUEUE <job$
               id> <class>'
         DC    AL1(014,0,02),X'1DE8',C' Alias',X'1D60',C'- REQ'
         DC    AL1(084,0,06),C' From a status display,',X'1DE8',C'RE',X$
               '1D60',C'or',X'1DE8',C'RQ',X'1D60',C'may be entered as a$
                line command for',X'1DE8',C'REQueue.',X'1D60'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(033,0,00),C'   <class> - The new output class.'
         DC    AL1(000,0,00),C' '
         DC    AL1(069,0,04),X'1DE8',C'Default',X'1D60',C'- <class> def$
               aults to the class specified via the',X'1DE8',C'"MODE"',$
               X'1D60'
         DC    AL1(063,0,02),C'           subcommand.  If not specified$
                there, default is',X'1DE8',C'A.',X'1D60'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),X'1DE8',C'Note    ',X'1D60',C'- An asteris$
               k',X'1DE8',C'("*")',X'1D60',C'may be used in place of <j$
               obid> to refer'
         DC    AL1(045,0,00),C'            to the most recently selecte$
               d job.'
        AIF (&@@TMPSV OR &@@SCSVC NE 0 OR &@@TSOE GE 120).HE#REQ
         DC    AL1(069,0,00),C'NOTE:  The "REQUEUE" subcommand can only$
                function if QUEUE was entered'
         DC    AL1(060,0,00),C'       at the "READY" level (i.e., it ca$
               nnot work inside SPF)'
.HE#REQ   ANOP
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#RIGHT DC    AL1(000,0,00),C' '
         DC    AL1(071,0,00),C' The "RIGHT" subcommand repositions the $
               currently selected dataset right'
         DC    AL1(030,0,00),C' a specified number of columns.'
         DC    AL1(000,0,00),C' '
         DC    AL1(020,0,02),X'1DE8',C'Syntax',X'1D60',C'- RIGHT <#>'
         DC    AL1(012,0,02),X'1DE8',C' Alias',X'1D60',C'- R'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(045,0,00),C'   <#> - The number of columns to shift $
               right.'
         DC    AL1(000,0,00),C' '
         DC    AL1(022,0,02),X'1DE8',C'Defaults',X'1D60',C'- <#> = 40.'$

         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#ROUTE DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "ROUTE" subcommand changes the prin$
               t/punch destination for a job.'
         DC    AL1(000,0,00),C' '
         DC    AL1(031,0,02),X'1DE8',C'Syntax',X'1D60',C'- ROUTE <jobid$
               > <dest>'
         DC    AL1(019,0,02),X'1DE8',C'Aliases',X'1D60',C'- ROU, RJ'
         DC    AL1(068,0,04),C' From a status display,',X'1DE8',C'RJ',X$
               '1D60',C'or',X'1DE8',C'R',X'1D60',C'may be entered as a $
               line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(039,0,00),C'   <dest>  - The new output destination.$
               '
         DC    AL1(000,0,00),C' '
         DC    AL1(074,0,04),X'1DE8',C'Default',X'1D60',C'- <dest> defa$
               ults to the destination specified via the',X'1DE8',C'"MO$
               DE"',X'1D60'
         DC    AL1(074,0,00),C'           subcommand.  If not specified$
                there, default is your LOGON dest.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,04),X'1DE8',C'Note    ',X'1D60',C'- An asteris$
               k',X'1DE8',C'("*")',X'1D60',C'may be used in place of <j$
               obid> to refer'
         DC    AL1(045,0,00),C'            to the most recently selecte$
               d job.'
          AIF   (&@@SCSVC NE 0 OR &@@TSOE GE 120).HE#ROU
         DC    AL1(067,0,00),C'NOTE:  The "ROUTE" subcommand can only f$
               unction if QUEUE was entered'
         DC    AL1(060,0,00),C'       at the "READY" level (i.e., it ca$
               nnot work inside SPF)'
.HE#ROU   ANOP
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#SAVE  DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "SAVE" subcommand writes a copy of $
               the currently selected spooled'
         DC    AL1(040,0,00),C' dataset (or a part) into a disk dataset$
               .'
         DC    AL1(000,0,00),C' '
         DC    AL1(067,0,02),X'1DE8',C'Syntax',X'1D60',C'- SAVE <dsname$
               > / OLD MOD NEW NORLSE UNIT=<unit> VOL=<vol>'
         DC    AL1(061,0,00),C'                          START=<start> $
               STOP=<stop> END=<stop>'
         DC    AL1(058,0,00),C'                          PRI=<pri> SEC=$
               <sec> TRACK TRK CYL'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(044,0,00),C'   <dsname> - The name of the output dat$
               aset.'
         DC    AL1(059,0,00),C'   /NEW     - The output dataset is to b$
               e created (default).'
         DC    AL1(047,0,00),C'   /OLD     - The output dataset already$
                exists.'
         DC    AL1(052,0,00),C'   /MOD     - The output dataset is to b$
               e added onto.'
         DC    AL1(070,0,00),C'   /NORLSE  - Unused space in the output$
                dataset is not to be released.'
         DC    AL1(051,0,00),C'              (Only applies to NEW outpu$
               t datasets.)'
         DC    AL1(067,0,00),C'   <unit>   - The unitname to use for al$
               locating the output dataset.'
         DC    AL1(065,0,00),C'   <vol>    - The volser to use for allo$
               cating the output dataset.'
         DC    AL1(043,0,00),C'   <start>  - The first line number to s$
               ave.'
         DC    AL1(042,0,00),C'   <stop>   - The last line number to sa$
               ve.'
         DC    AL1(064,0,00),C'   <pri>    - The amount of primary spac$
               e for the output dataset.'
         DC    AL1(066,0,00),C'   <sec>    - The amount of secondary sp$
               ace for the output dataset.'
         DC    AL1(046,0,00),C'   /TRACK   - The specified space is in $
               tracks.'
         DC    AL1(030,0,00),C'   /TRK     - Alias for /TRACK.'
         DC    AL1(049,0,00),C'   /CYL     - The specified space is in $
               cylinders.'
         DC    AL1(000,0,00),C' '
         DC    AL1(071,0,02),X'1DE8',C'Defaults',X'1D60',C'- If <dsname$
               > is not a fully qualified name, it will be pre-'
         DC    AL1(071,0,00),C'               fixed with your TSO prefi$
               x, and suffixed with ''.OUTLIST''.'
         DC    AL1(062,0,00),C'            If no disposition is specifi$
               ed, the default is NEW.'
         DC    AL1(064,0,00),C'            Default for <start> is the f$
               irst line in the dataset.'
         DC    AL1(062,0,00),C'            Default for <stop> is the la$
               st line in the dataset.'
         DC    AL1(042,0,00),C'            Default for <pri> is 10 trac$
               ks.'
         DC    AL1(042,0,00),C'            Default for <sec> is 50 trac$
               ks.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#SJ    DC    AL1(000,0,00),C' '
         DC    AL1(075,0,04),C' The "SJ" subcommand selects a job for v$
               iewing sysout via the',X'1DE8',C'NS',X'1D60',C'and',X'1D$
               E8',C'PS',X'1D60'
         DC    AL1(063,0,00),C' subcommands, and displays the first sys$
               out dataset (usually the'
         DC    AL1(008,0,00),C' JOBLOG.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(026,0,02),X'1DE8',C'Syntax',X'1D60',C'- SJ <jobid> /$
               ALL'
         DC    AL1(012,0,02),X'1DE8',C' Alias',X'1D60',C'- S'
         DC    AL1(068,0,04),C' From a status display,',X'1DE8',C'SJ',X$
               '1D60',C'or',X'1DE8',C'S',X'1D60',C'may be entered as a $
               line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(042,0,00),C'   <jobid> - The name or number of the j$
               ob.'
         DC    AL1(070,0,00),C'   ALL     - All Sysout datasets will be$
                selected, including those that'
         DC    AL1(031,0,00),C'             appear to be empty.'
         DC    AL1(000,0,00),C' '
         DC    AL1(058,0,02),X'1DE8',C'Defaults',X'1D60',C'- The previo$
               usly selected job will be selected.'
         DC    AL1(000,0,00),C' '
         DC    AL1(071,0,06),X'1DE8',C'Notes   ',X'1D60',C'- See also t$
               he description of the',X'1DE8',C'NS',X'1D60',C'and',X'1D$
               E8',C'PS',X'1D60',C'subcommands.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#SLOG  DC    AL1(000,0,00),C' '
         DC    AL1(058,0,00),C' The "SLOG" subcommand lists a system lo$
               g (SYSLOG) dataset.'
         DC    AL1(000,0,00),C' '
         DC    AL1(029,0,02),X'1DE8',C'Syntax',X'1D60',C'- SLOG <jobid>$
                <seq>'
         DC    AL1(013,0,02),X'1DE8',C' Alias',X'1D60',C'- SL'
         DC    AL1(061,0,02),C' From a status display,',X'1DE8',C'SL',X$
               '1D60',C'may be entered as a line command.'
         DC    AL1(081,0,02),C' (See',X'1DE8',C'"Help LINECMDS"',X'1D60$
               ',C'for information on entering subcommands as line comm$
               ands.)'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(054,0,00),C'   <jobid> - The system id or job number$
                of the SYSLOG.'
         DC    AL1(073,0,00),C'   <seq>   - The number of datasets to b$
               ack up, with 0 indicating current.'
         DC    AL1(000,0,00),C' '
         DC    AL1(069,0,02),X'1DE8',C'Defaults',X'1D60',C'- If <jobid>$
                is omitted, the active SYSLOG for the current'
         DC    AL1(035,0,00),C'            system will be selected.'
         DC    AL1(068,0,00),C'          - If <seq> is omitted, the lat$
               est (or only) dataset will be'
         DC    AL1(045,0,00),C'            selected for the specified S$
               YSLOG.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#STAT  DC    AL1(000,0,00),C' '
         DC    AL1(068,0,00),C' The "STATUS" subcommand displays all jo$
               bs beginning with any prefix,'
         DC    AL1(077,0,00),C' or with a writer name (target userid) e$
               xactly equal to the operand of STATUS.'
         DC    AL1(000,0,00),C' '
         DC    AL1(041,0,02),X'1DE8',C'Syntax',X'1D60',C'- STATUS <pref$
               ix> / OUT O TIME T'
         DC    AL1(020,0,02),X'1DE8',C'Aliases',X'1D60',C'- STAT, ST'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(033,0,00),C'   <prefix> - The partial jobname.'
         DC    AL1(067,1,00),C'   /ALL     - All JCT''s will be read an$
               d checked for a NOTIFY= which'
         DC    AL1(070,1,00),C'              starts with <prefix>.  Thi$
               s operand is not documented for'
         DC    AL1(068,1,00),C'              unprivileged users, and ma$
               y be made unavailable to them'
         DC    AL1(068,1,00),C'              since it results in a very$
                large number of I/O requests'
         DC    AL1(059,1,00),C'              to the spool (one for each$
                job in the system!)'
         DC    AL1(067,1,00),C'   /PERCENT - Display the percent of spo$
               ol space in use by each job.'
         DC    AL1(032,1,00),C'   /PCT     - Alias for /PERCENT.'
         DC    AL1(032,1,00),C'   /P       - Alias for /PERCENT.'
         DC    AL1(066,1,00),C'   /SPACE   - Display the amount of spoo$
               l space in use by each job.'
         DC    AL1(030,1,00),C'   /SIZE    - Alias for /SPACE.'
         DC    AL1(030,1,00),C'   /S       - Alias for /SPACE.'
         DC    AL1(067,0,00),C'   /OUT     - Display output group names$
                instead of the device name.'
         DC    AL1(028,0,00),C'   /O       - Alias for /OUT.'
         DC    AL1(078,0,00),C'   /TIME    - Display the input time (in$
               put jobs) or output time (output jobs).'
         DC    AL1(029,0,00),C'   /T       - Alias for /TIME.'
         DC    AL1(000,0,00),C' '
         DC    AL1(072,0,02),X'1DE8',C'Defaults',X'1D60',C'- The previo$
               usly entered prefix will be used (initially, your'
         DC    AL1(023,0,00),C'            TSO userid).'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#SYNT  DC    AL1(057,0,00),C'                             << QUEUE su$
               bcommand syntax >>'
         DC    AL1(052,0,00),C' There are 3 types of operands for QUEUE$
                subcommands.'
         DC    AL1(000,0,00),C' '
         DC    AL1(073,0,02),X'1DE8',C'Positional',X'1D60',C'operands i$
               mmediately follow the command, with no delimiters.'
         DC    AL1(069,0,00),C' For example, "JCL myjobname".  Any posi$
               tional operands specified must'
         DC    AL1(049,0,00),C' appear before any operands of the next $
               two types.'
         DC    AL1(000,0,00),C' '
         DC    AL1(072,0,02),X'1DE8',C'Keyword value',X'1D60',C'operand$
               s are of the form KEYWORD=value.  For example, in'
         DC    AL1(070,0,00),C' "PRINT ON FCB=F002", "ON" is a position$
               al operand, and "FCB=F002" is a'
         DC    AL1(022,0,00),C' keyword value operand.'
         DC    AL1(000,0,00),C' '
         DC    AL1(069,0,02),X'1DE8',C'Reserved word',X'1D60',C'operand$
               s are special options.  To distinquish between'
         DC    AL1(070,0,00),C' positional and reserved word operands, $
               the first reserved word must be'
         DC    AL1(064,0,00),C' preceeded by a slash, for example, "DI $
               /TIME".  The slash may be'
         DC    AL1(069,0,00),C' omitted if:  1) the subcommand does not$
                allow any positional operands'
         DC    AL1(069,0,00),C' (example:  "DH TIME") , or, 2) a keywor$
               d=value operand appears before'
         DC    AL1(054,0,00),C' the reserved word operand (example:  "D$
               O R=ALL TIME").'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#TOP   DC    AL1(000,0,00),C' '
         DC    AL1(066,0,00),C' The "TOP" subcommand repositions the cu$
               rrently selected dataset to'
         DC    AL1(008,0,00),C' the top.'
         DC    AL1(000,0,00),C' '
         DC    AL1(014,0,02),X'1DE8',C'Syntax',X'1D60',C'- TOP'
         DC    AL1(013,0,02),X'1DE8',C'Aliases',X'1D60',C'- T'
         DC    AL1(000,0,00),C' '
         DC    AL1(018,0,02),X'1DE8',C'Operands',X'1D60',C'- None.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
HE#TOPIC DC    AL1(059,0,00),C'                             << Miscella$
               neous HELP Topics >>'
         DC    AL1(079,0,02),C' HELP for various miscellaneous topics i$
               s available, by entering',X'1DE8',C'HELP',X'1D60',C'foll$
               owed'
         DC    AL1(036,0,00),C' by one of the keywords listed below.'
         DC    AL1(000,0,00),C' '
         DC    AL1(054,0,02),C'   ',X'1DE8',C'ADMIN    ',X'1D60',C'- Su$
               mmary of Administrative subcommands'
         DC    AL1(028,0,02),C'   ',X'1DE8',C'COMMANDS ',X'1D60',C'- Th$
               is screen'
         DC    AL1(057,0,02),C'   ',X'1DE8',C'DSS      ',X'1D60',C'- Su$
               mmary of Dataset selection subcommands'
         DC    AL1(039,0,02),C'   ',X'1DE8',C'GENERAL  ',X'1D60',C'- Ge$
               neral notes on QUEUE'
         DC    AL1(066,0,02),C'   ',X'1DE8',C'IOQ      ',X'1D60',C'- Su$
               mmary of Input/Output queue display subcommands'
         DC    AL1(043,0,02),C'   ',X'1DE8',C'LINECMDS ',X'1D60',C'- Li$
               ne subcommand processing'
         DC    AL1(050,1,02),C'   ',X'1DE8',C'PRIVCMDS ',X'1D60',C'- Su$
               mmary of privileged subcommands'
         DC    AL1(058,0,02),C'   ',X'1DE8',C'QPROF    ',X'1D60',C'- Ho$
               w to use a QUEUE initialization profile'
         DC    AL1(061,0,02),C'   ',X'1DE8',C'REPOS    ',X'1D60',C'- Su$
               mmary of Dataset repositioning subcommands'
         DC    AL1(057,0,02),C'   ',X'1DE8',C'SYNTAX   ',X'1D60',C'- Sy$
               ntax of QUEUE subcommands and operands'
         DC    AL1(000,0,00),C' '
         DC    AL1(000,0,00),C' '
         DC    AL1(041,0,02),C' For more information, enter',X'1DE8',C'$
               HELP HELP.',X'1D60'
         DC    AL1(000,0,00),C' '
         DC    AL1(078,0,02),X'1DE8',C'NOTE:',X'1D60',C' At this time, $
               HELP is still incomplete.  I''m typing as fast as I can.$
               '
         DC    X'FF'                    Flag end of screen
         SPACE 3
          AIF   (NOT &@@TMPSV).HE#NTS3
HE#TSO   DC    AL1(000,0,00),C' '
         DC    AL1(071,0,00),C' The "TSO" subcommand allows most TSO co$
               mmands and CLISTs to be executed'
         DC    AL1(022,0,00),C' without leaving QUEUE.'
         DC    AL1(000,0,00),C' '
         DC    AL1(023,0,02),X'1DE8',C'Syntax',X'1D60',C'- TSO <tsocmd>$
               '
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(067,0,00),C'            <tsocmd> is any TSO command $
               which may be executed at the'
         DC    AL1(065,0,00),C'                     "READY" level, exce$
               pt those which require APF'
         DC    AL1(034,0,00),C'                     authorization.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
.HE#NTS3  ANOP
HE#UP    DC    AL1(000,0,00),C' '
         DC    AL1(069,0,00),C' The "UP" subcommand repositions the cur$
               rently selected dataset toward'
         DC    AL1(008,0,00),C' the top.'
         DC    AL1(000,0,00),C' '
         DC    AL1(017,0,02),X'1DE8',C'Syntax',X'1D60',C'- UP <#>'
         DC    AL1(012,0,02),X'1DE8',C' Alias',X'1D60',C'- U'
         DC    AL1(000,0,00),C' '
         DC    AL1(012,0,02),X'1DE8',C'Operands',X'1D60',C'-'
         DC    AL1(067,0,00),C'   <#> - The number of records to back u$
               p from the current position.'
         DC    X'FF'                    Flag end of screen
         SPACE 3
