//SBGOLOBL  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//*     STRING PDS MEMBERS INTO A SEQUENTIAL DATASET.
//*
//*
//DSPEQMOD EXEC PGM=OFFLOAD,REGION=5000K
//STEPLIB  DD DISP=SHR,DSN=SBGOLOB.LOAD
//SYSPRINT DD SYSOUT=*
//IN    DD  DISP=SHR,DSN=MVS5.SMPPTS
//OUT   DD  DSN=SBGOLOB.TEST.SEQ.PTS,DISP=(NEW,CATLG,DELETE),
// UNIT=SYSDA,SPACE=(TRK,(120,300),RLSE),
// DCB=(RECFM=FB,DSORG=PS,LRECL=80,BLKSIZE=27920)
//SYSIN  DD *
 O I=IN,O=OUT
