       ID DIVISION.
       PROGRAM-ID.  SEPLINE.
       ENVIRONMENT DIVISION.                                            000000
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  LINEX     PIC X(70) VALUE  ALL "-".
       01  LASTL     PIC 9(6) VALUE 0 COMP.
       01  LYNE      PIC 9(6) VALUE 0 COMP.
       01  ISREDIT   PIC X(8) VALUE "ISREDIT ".
       01  VDEFINE   PIC X(8) VALUE "VDEFINE ".
       01  ZLASTL    PIC X(8) VALUE "LASTL   ".
       01  ZLINE     PIC X(8) VALUE "LINE    ".
       01  ZLINEX    PIC X(8) VALUE "LINEX   ".
       01  FIXED     PIC X(8) VALUE "FIXED   ".
       01  CHAR      PIC X(8) VALUE "CHAR    ".
       01  LEN0      PIC 9(6) VALUE 0 COMP.
       01  LEN4      PIC 9(6) VALUE 4 COMP.
       01  LEN70     PIC 9(6) VALUE 70 COMP.
       01  EM1       PIC X(10) VALUE "¢  MACRO ¢".
       01  EM2       PIC X(24) VALUE "¢  (SAVE) = USER_STATE ¢".
       01  EM3       PIC X(10) VALUE "¢  RESET ¢".
       01  EM4       PIC X(25) VALUE "¢  EXCLUDE ------ 1 ALL ¢".
       01  EM5       PIC X(18) VALUE "¢  DELETE ALL X  ¢".
       01  EM6       PIC X(30) VALUE "¢ LINE_AFTER &LINE = (LINEX) ¢".
       01  EM7       PIC X(28) VALUE "¢ (LASTL) = LINENUM .ZLAST ¢".
       01  EM8       PIC X(23) VALUE "¢ USER_STATE = (SAVE) ¢".
       PROCEDURE DIVISION.
           CALL "ISPLINK" USING VDEFINE ZLASTL LASTL FIXED LEN4
           CALL "ISPLINK" USING VDEFINE ZLINE  LYNE  FIXED LEN4
           CALL "ISPLINK" USING VDEFINE ZLINEX LINEX CHAR  LEN70
           CALL "ISPLINK" USING ISREDIT LEN0 EM1
           CALL "ISPLINK" USING ISREDIT LEN0 EM2
           CALL "ISPLINK" USING ISREDIT LEN0 EM3
           CALL "ISPLINK" USING ISREDIT LEN0 EM4
           CALL "ISPLINK" USING ISREDIT LEN0 EM5
           MOVE 1 TO LASTL
           MOVE 0 TO LYNE
           PERFORM LOOP UNTIL LYNE IS NOT LESS THAN (LASTL + 1)
           CALL "ISPLINK" USING ISREDIT LEN0 EM8
           GOBACK.
       LOOP.
           CALL "ISPLINK" USING ISREDIT LEN0 EM6
           CALL "ISPLINK" USING ISREDIT LEN0 EM7
           ADD 2 TO LYNE.
