//SMJES11J JOB (A006,SYTM,999,9999),'ROOM 9 - SAM GOLOB',
//         CLASS=V,MSGCLASS=V,REGION=6M,
//         NOTIFY=&SYSUID
//*
//*        LIB: XSYS.MVSESA.USERMODS(SMJES11J)
//*        GDE: JES2
//*        DOC: JES2 EXIT FOR CSC - EXIT 5 - EXIT LOADER
//*
//SMPPROC  EXEC  PROC=SMPPROC
//SMPPTFIN DD  DISP=SHR,DSN=XSYS.MVSESA.USERMODS(SMJES11)
//SMPCNTL  DD  *
  SET      BDY(GLOBAL)
           .
  RECEIVE  S(SMJES11)
           LIST
           .
  RESETRC  .
  SET      BDY(XRS001)
           .
  APPLY    S(SMJES11)    CHECK
           ASSEM
           REDO
           .
/*
//
