//JOBNAME  JOB 'PGMRNAME',MSGLEVEL=(1,1),
//         CLASS=A,MSGCLASS=X,REGION=1024K
//         EXEC PGM=T@SYNTXC
//STEPLIB  DD DISP=SHR,DSN=RTI.LOADLIB
//SYSUDUMP DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 MYCMD
 NAME
 MYCMD NAME
 MYCMD NAME =
 MYCMD NAME,   SCORES
 MYCMD     =   RICHARD, SCORES=( HELLO, 91
 MYCMD    RICHARD
 MYCMD NAME =   RICHARD, SCORES=( HELLO, 91
 MYCMD NAME =   RICHARD, NAME=ROGER SCORES=( HELLO, 91
 MYCMD NAME , SCORES=( HELLO, 91)
 MYCMD NAME =   RICHARD, SCORES=   =( HELLO, 91
 MYCMD NAME =   RICHARD, SCORES=   =( HELLO, 91 )
 MYCMD NAME =   RICHARD, SCORES   =( HELLO, 91 )
 MYCMD NAME =   RICHARD, SCORES=( 100)
 MYCMD NAME =   RICHARD,   +
            SCORES   =( 111  , 91 )
/*
