//SNTP    PROC
//*
//*********************************************************************
//*
//*                    SIMPLE NETWORK TIME PROTOCOL
//*                    --------- SERVER -----------
//*
//*
//* KENNETH W CLAPP
//* 7 OCTOBER 1999
//*
//*********************************************************************
//*
//SERVER  EXEC PGM=SNTP,
//             TIME=1440
//*
//SYSPRINT  DD SYSOUT=8
//*
//SYSUDUMP  DD SYSOUT=T
//*
