*
*        COPY BOOK USED BY SNTP (MAYBE OTHERS)
*
X2CTBL   DS    0F
         DC    C'00'
         DC    C'01'
         DC    C'02'
         DC    C'03'
         DC    C'04'
         DC    C'05'
         DC    C'06'
         DC    C'07'
         DC    C'08'
         DC    C'09'
         DC    C'0A'
         DC    C'0B'
         DC    C'0C'
         DC    C'0D'
         DC    C'0E'
         DC    C'0F'
         DC    C'10'
         DC    C'11'
         DC    C'12'
         DC    C'13'
         DC    C'14'
         DC    C'15'
         DC    C'16'
         DC    C'17'
         DC    C'18'
         DC    C'19'
         DC    C'1A'
         DC    C'1B'
         DC    C'1C'
         DC    C'1D'
         DC    C'1E'
         DC    C'1F'
         DC    C'20'
         DC    C'21'
         DC    C'22'
         DC    C'23'
         DC    C'24'
         DC    C'25'
         DC    C'26'
         DC    C'27'
         DC    C'28'
         DC    C'29'
         DC    C'2A'
         DC    C'2B'
         DC    C'2C'
         DC    C'2D'
         DC    C'2E'
         DC    C'2F'
         DC    C'30'
         DC    C'31'
         DC    C'32'
         DC    C'33'
         DC    C'34'
         DC    C'35'
         DC    C'36'
         DC    C'37'
         DC    C'38'
         DC    C'39'
         DC    C'3A'
         DC    C'3B'
         DC    C'3C'
         DC    C'3D'
         DC    C'3E'
         DC    C'3F'
         DC    C'40'
         DC    C'41'
         DC    C'42'
         DC    C'43'
         DC    C'44'
         DC    C'45'
         DC    C'46'
         DC    C'47'
         DC    C'48'
         DC    C'49'
         DC    C'4A'
         DC    C'4B'
         DC    C'4C'
         DC    C'4D'
         DC    C'4E'
         DC    C'4F'
         DC    C'50'
         DC    C'51'
         DC    C'52'
         DC    C'53'
         DC    C'54'
         DC    C'55'
         DC    C'56'
         DC    C'57'
         DC    C'58'
         DC    C'59'
         DC    C'5A'
         DC    C'5B'
         DC    C'5C'
         DC    C'5D'
         DC    C'5E'
         DC    C'5F'
         DC    C'60'
         DC    C'61'
         DC    C'62'
         DC    C'63'
         DC    C'64'
         DC    C'65'
         DC    C'66'
         DC    C'67'
         DC    C'68'
         DC    C'69'
         DC    C'6A'
         DC    C'6B'
         DC    C'6C'
         DC    C'6D'
         DC    C'6E'
         DC    C'6F'
         DC    C'70'
         DC    C'71'
         DC    C'72'
         DC    C'73'
         DC    C'74'
         DC    C'75'
         DC    C'76'
         DC    C'77'
         DC    C'78'
         DC    C'79'
         DC    C'7A'
         DC    C'7B'
         DC    C'7C'
         DC    C'7D'
         DC    C'7E'
         DC    C'7F'
         DC    C'80'
         DC    C'81'
         DC    C'82'
         DC    C'83'
         DC    C'84'
         DC    C'85'
         DC    C'86'
         DC    C'87'
         DC    C'88'
         DC    C'89'
         DC    C'8A'
         DC    C'8B'
         DC    C'8C'
         DC    C'8D'
         DC    C'8E'
         DC    C'8F'
         DC    C'90'
         DC    C'91'
         DC    C'92'
         DC    C'93'
         DC    C'94'
         DC    C'95'
         DC    C'96'
         DC    C'97'
         DC    C'98'
         DC    C'99'
         DC    C'9A'
         DC    C'9B'
         DC    C'9C'
         DC    C'9D'
         DC    C'9E'
         DC    C'9F'
         DC    C'A0'
         DC    C'A1'
         DC    C'A2'
         DC    C'A3'
         DC    C'A4'
         DC    C'A5'
         DC    C'A6'
         DC    C'A7'
         DC    C'A8'
         DC    C'A9'
         DC    C'AA'
         DC    C'AB'
         DC    C'AC'
         DC    C'AD'
         DC    C'AE'
         DC    C'AF'
         DC    C'B0'
         DC    C'B1'
         DC    C'B2'
         DC    C'B3'
         DC    C'B4'
         DC    C'B5'
         DC    C'B6'
         DC    C'B7'
         DC    C'B8'
         DC    C'B9'
         DC    C'BA'
         DC    C'BB'
         DC    C'BC'
         DC    C'BD'
         DC    C'BE'
         DC    C'BF'
         DC    C'C0'
         DC    C'C1'
         DC    C'C2'
         DC    C'C3'
         DC    C'C4'
         DC    C'C5'
         DC    C'C6'
         DC    C'C7'
         DC    C'C8'
         DC    C'C9'
         DC    C'CA'
         DC    C'CB'
         DC    C'CC'
         DC    C'CD'
         DC    C'CE'
         DC    C'CF'
         DC    C'D0'
         DC    C'D1'
         DC    C'D2'
         DC    C'D3'
         DC    C'D4'
         DC    C'D5'
         DC    C'D6'
         DC    C'D7'
         DC    C'D8'
         DC    C'D9'
         DC    C'DA'
         DC    C'DB'
         DC    C'DC'
         DC    C'DD'
         DC    C'DE'
         DC    C'DF'
         DC    C'E0'
         DC    C'E1'
         DC    C'E2'
         DC    C'E3'
         DC    C'E4'
         DC    C'E5'
         DC    C'E6'
         DC    C'E7'
         DC    C'E8'
         DC    C'E9'
         DC    C'EA'
         DC    C'EB'
         DC    C'EC'
         DC    C'ED'
         DC    C'EE'
         DC    C'EF'
         DC    C'F0'
         DC    C'F1'
         DC    C'F2'
         DC    C'F3'
         DC    C'F4'
         DC    C'F5'
         DC    C'F6'
         DC    C'F7'
         DC    C'F8'
         DC    C'F9'
         DC    C'FA'
         DC    C'FB'
         DC    C'FC'
         DC    C'FD'
         DC    C'FE'
         DC    C'FF'
*
*
