//ADRUNLOD JOB (DVRF,PS,,,,,,,00,4703F0000),'CILESIZ 225',
//             CLASS=D,MSGCLASS=T,REGION=0M,NOTIFY=&SYSUID
//* JCL ADRUNJCL
//*
//* DATA SET   : RE03063.MSG.CNTL(ADRUNJCL)
//* NAME       : UGUR CILESIZ
//* DATE       : 06.08.2002
//* PARAMETER  :
//* DESCRIPTION:
//*
//*
//IDCAMS  EXEC PGM=IDCAMS
//*========================
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
 DELETE RE03063.ADRMSG.OFF NONVSAM PURGE
 IF MAXCC = 8 THEN SET MAXCC = 0
/*
//TSOBATCH EXEC PGM=IKJEFT01
//*-------------------------
//OUTFILE   DD DSN=RE03063.ADRMSG.OFF,
//             DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(100,100),RLSE),
//             DCB=(DSORG=PS,RECFM=FB,LRECL=132)
//SYSEXEC   DD DISP=SHR,DSN=RE03063.MSG.CNTL
//INFILE    DD DISP=SHR,DSN=RE03063.ADR.MSGS
//SYSTSPRT  DD SYSOUT=*
//SYSTSIN   DD *
 %ADRUNLOD
/*
//PDSMAKE EXEC PGM=PDSLOAD,PARM='UPDTE(><)'
//*-------------------------
//STEPLIB  DD  DSN=RE03063.REVIEW.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DSN=RE03063.ADRMSG.OFF,DISP=SHR
//SYSUT2   DD  DSN=RE03063.ADR.MSG.PDS,DISP=(NEW,CATLG),
//             UNIT=3390,SPACE=(CYL,(10,10,100),RLSE)
//
