./ ADD NAME=$RAB
//$RAB    JOB (2000,C010),'DOBBINS, DENNIS G.',CLASS=Z,NOTIFY=$SYS11
/*JOBPARM Q=F
//STEP01   EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE($RAB)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 NAME  $RAB(R)
/*
./ ADD NAME=$RELOAD,SSI=00009025
//$RELOAD JOB (8220,0952),WENZEL,CLASS=Z,NOTIFY=$SYS13,MSGCLASS=X
/*JOBPARM Q=F
//STEP01   EXEC ASMFCL,MAC1='SYS2.MACLIB'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS.CMDLIB2.SOURCE($RELOAD)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 NAME  $RELOAD(R)
/*
./ ADD NAME=#        0100-80017-80017-0728-00008-00008-00000-$SYS13  00
//#       JOB (2000,S010),WENZEL
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS2.MACLIB'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(#)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 NAME  #(R)
/*
./ ADD NAME=ASID,SSI=00000038
//ASID  JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(ASID)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 ALIAS AS
 NAME  ASID(R)
/*
./ ADD NAME=BURN     0100-80017-80017-0728-00011-00011-00000-$SYS13  00
//BURN  JOB (2000,S010),WENZEL
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSLIB DD DISP=SHR,DSN=SYS1.MACLIB
//           DD DISP=SHR,DSN=SYS2.MACLIB
//           DD DISP=SHR,DSN=SYS1.AMODGEN
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(BURN)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 NAME  BURN(R)
/*
./ ADD NAME=CATCLEAN 0102-80184-80184-0811-00008-00009-00004-$SYS13  00
//CATCLEAN  JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(CATCLEAN)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  CATCLEAN(R)
/*
./ ADD NAME=CBT973   0101-80056-80056-1312-00009-00010-00003-$SYS13  00
//CBT973 JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//STEP1   EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN    DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(CBT973)
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN   DD  *
 NAME  CBT973(R)
/*
./ ADD NAME=CLEANSYS
//CLEANSYS  JOB (2000,S010),WENZEL,CLASS=A,NOTIFY=$SYS13,MSGCLASS=A
/*JOBPARM Q=F
//STEP01   EXEC ASMFCL
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(CLEANSYS)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 SETCODE AC(1)
 NAME  CLEANSYS(R)
/*
./ ADD NAME=CREATE   0100-80017-80017-0729-00009-00009-00000-$SYS13  00
//CREATE  JOB (2000,S010),WENZEL
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(CREATE)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 ALIAS CR
 NAME  CREATE(R)
/*
./ ADD NAME=DEBUG    0101-80017-80081-1221-00012-00012-00001-$SYS13  00
//DEBUG  JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSLIB DD DISP=SHR,DSN=SYS2.MACLIB
//        DD DISP=SHR,DSN=SYS1.MACLIB
//        DD DISP=SHR,DSN=SYS1.AMODGEN
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(DEBUG)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 SETCODE AC(1)
 NAME  DEBUG(R)
/*
./ ADD NAME=DISK,SSI=00000185
//DISK  JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS2.MACLIB'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(DISK)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *,DCB=BLKSIZE=80
 ALIAS DI
 NAME  DISK(R)
/*
./ ADD NAME=DMN      0101-80017-80161-1320-00010-00010-00001-$SYS13  00
//DMN JOB (2000,S010),WENZEL
/*JOBPARM Q=F,I
//STEP01   EXEC PLIXCL
//PLI.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(DMN)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 ENTRY PLICALLA
 PAGE PLISTART
 NAME  DMN(R)
/*
./ ADD NAME=DMOD     0101-80017-80128-1116-00014-00014-00001-$SYS13  00
//DMOD  JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFC,MAC1='SYS1.AMODGEN'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(DMOD)
//STEP02   EXEC ASMFC,MAC1='SYS1.AMODGEN'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(DMODFNDV)
//STEP03   EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(DMODRDVT)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 SETCODE AC(1)
 ENTRY DMOD
 NAME  DMOD(R)
/*
./ ADD NAME=DPCPROB  0101-80035-80035-1147-00012-00008-00006-$SYS13  00
//DPCPROB JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS2.MACLIB'
//ASM.SYSLIB DD  DISP=SHR,DSN=SYS1.MACLIB,DCB=BLKSIZE=18960
//           DD  DISP=SHR,DSN=SYS2.MACLIB
//           DD  DISP=SHR,DSN=SYS1.AMODGEN
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(DPCPROB)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 SETCODE AC(1)
 NAME  DPCPROB(R)
/*
./ ADD NAME=DSUTIL   0101-80058-80058-1805-00016-00011-00013-$SYS13  00
//DSUTIL JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//DSUTIL1 EXEC ASMFC,MAC1='SYS2.MACLIB'
//ASM.SYSIN DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(DSUTIL1)
//*
//DSUTIL2 EXEC ASMFC,MAC1='SYS2.MACLIB'
//ASM.SYSIN DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(DSUTIL2)
//*
//DSUTIL3 EXEC ASMFCL,MAC1='SYS2.MACLIB'
//ASM.SYSIN DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(DSUTIL3)
//*
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN   DD  *
 ENTRY DSUTIL
 NAME  DSUTIL(R)
./ ADD NAME=EYEBALL  0104-80051-80058-1805-00014-00010-00013-$SYS13  00
//EYEBALL JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//EYEBALL EXEC ASMFC,MAC1='SYS1.AMODGEN'
//ASM.SYSIN DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(EYEBALL)
//*
//EYE001  EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(EYE001)
//*
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN   DD  *
 ENTRY EYEBALL
 SETCODE AC(1)
 NAME  EYEBALL(R)
./ ADD NAME=HELPLIST 0102-80160-80160-1445-00006-00006-00004-$SYS13  00
//HELPLIST JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//STEP1   EXEC ASMFCL,MAC1='SYS2.MACLIB'
//ASM.SYSIN    DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(HELPLIST)
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS2.LINKLIB(HELPLIST)
./ ADD NAME=INTTAB   0100-80104-80104-2140-00006-00006-00000-$SYS13  00
//INTTAB JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//STEP1   EXEC ASMFCL
//ASM.SYSIN    DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(INTTAB)
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS1.VTAMLIB(INTTAB)
./ ADD NAME=ITELACCT 0101-80080-80080-1940-00006-00010-00004-$SYS13  00
//ITELACCT JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//STEP1   EXEC ASMFCL
//ASM.SYSIN    DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(ITELACCT)
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS2.LINKLIB(ITELACCT)
./ ADD NAME=LPDS     0101-80017-80029-1645-00009-00009-00001-$SYS13  00
//LPDS  JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(LPDS)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 ALIAS LP
 NAME  LPDS(R)
/*
./ ADD NAME=MCPGEN   0107-79351-80170-1323-00007-00009-00007-$SYS13  00
//MCPGEN JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//MCPGEN  EXEC MCPGEN,
//             DSNIN1='SYS0.LINKLIB2.SOURCE(MCPGEN)',
//             VOLIN1=SYS500,UIN1=DISK,
//             DSNOUT2='SYS2.LINKLIB(IEDQTCAM)',
//             VOLOUT2=SYS200,UOUT2=DISK
./ ADD NAME=MCPGEN9  0100-80170-80170-1322-00010-00010-00000-$SYS13  00
//MCPGEN JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//TABLES  EXEC ASMFC
//ASM.SYSGO DD DSN=&&OBJSET2,UNIT=VIO
//ASM.SYSIN DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(TCAMTBLS)
//MCPGEN  EXEC MCPGEN,
//             DSNIN1='SYS0.LINKLIB2.SOURCE(MCPGEN)',
//             VOLIN1=SYS500,UIN1=DISK,
//             DSNOUT2='SYS2.LINKLIB(IEDQTCAN)',
//             VOLOUT2=SYS200,UOUT2=DISK
./ ADD NAME=MCS      0101-80119-80119-1131-00008-00009-00004-$SYS13  00
//MCS   JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(MCS)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 NAME  MCS(R)
/*
./ ADD NAME=MODREP   0100-80037-80037-2303-00010-00010-00000-$SYS13  00
//MODREP JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//STEP1   EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN    DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(MODREP)
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN   DD  *
 SETCODE AC(1)
 NAME  MODREP(R)
/*
./ ADD NAME=PAGES    0102-80017-80205-1532-00010-00010-00002-$SYS13  00
//PAGES JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC PLIXCL
//PLI.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(PAGES)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=$SYS13.STEPLIB.LOAD
//LKED.SYSIN    DD  *
 ENTRY PLICALLA
 PAGE PLISTART
 NAME  PAGES(R)
/*
./ ADD NAME=PERFORM  0100-80017-80017-0724-00011-00011-00000-$SYS13  00
//PERFORM  JOB (2000,S010),WENZEL
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSLIB DD DISP=SHR,DSN=SYS1.AMODGEN
//         DD DISP=SHR,DSN=SYS1.MACLIB
//         DD DISP=SHR,DSN=SYS2.MACLIB
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(PERFORM)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 ALIAS PERF
 NAME PERFORM(R)
./ ADD NAME=PREOSTIQ
//PREOSTIQ  JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS2.MACLIB'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(PREOSTIQ)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  PREOSTIQ(R)
/*
./ ADD NAME=QUE1     0101-80017-80018-1915-00018-00011-00010-$SYS13  00
//QUE1 JOB (2000,S010),WENZEL
/*JOBPARM Q=F,I
//*
//DELETE  EXEC  PGM=IEFBR14
//DD1      DD DSN=SYS0.QUE.MACLIB,DISP=(MOD,DELETE),
//            UNIT=DISK,SPACE=(CYL,0)
//DD2      DD DSN=SYS0.QUE.OBJ,DISP=(MOD,DELETE),
//            UNIT=DISK,SPACE=(CYL,0)
//*
//UPDT    EXEC  PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD DUMMY
//SYSUT2   DD DSN=SYS0.QUE.MACLIB,DISP=(,CATLG),
//            UNIT=DISK,SPACE=(CYL,(2,1,27)),VOL=SER=PAG001,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//SYSIN    DD DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(QUEUPDTE)
//DD       DD DSN=SYS0.QUE.OBJ,DISP=(,CATLG),
//            UNIT=DISK,SPACE=(CYL,(1,1,27)),VOL=SER=PAG001,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
./ ADD NAME=QUE2     0101-80059-80137-1604-00035-00035-00000-$SYS13  00
//QUE2  JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//UPDT    EXEC  PGM=IEBUPDTE,PARM=MOD
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=SYS0.QUE.MACLIB,DISP=SHR
//SYSUT2   DD DSN=SYS0.QUE.MACLIB,DISP=SHR
//SYSIN    DD *
>< CHANGE NAME=QCOMMON,SEQFLD=738
               &UNIT=3350,     DEFAULT UNIT NAME FOR SYS1.HASPCKPT     X
               &VOLSER=SYS400, DEFAULT VOLUME SERIAL FOR SYS1.HASPCKPT X
               &SID1='A000',   SYSTEM ID FOR SYSTEM # 1 (UP TO 8 CHARS)X
               &SID2='     ',  SYSTEM ID FOR SYSTEM # 2                X
               &SID3='      ', SYSTEM ID FOR SYSTEM # 3                X
>< CHANGE NAME=Q7,SEQFLD=738
*        DELETED                                                MRX
*        DELETED                                                MRX
         MVC   CONVERT-4(8),=X'4020202020202120' EDIT MASK      MRX
         ED    CONVERT-4(8),CONVERT+4   CONVERT TO EBCDIC       MRX
         MVC   FLINES(5),CONVERT-1      MOVE IT TO MSG          MRX
         C     R0,=F'99999'             COUNT FIT IN 5 DIGITS?  MRX
         BNH   LISTJOE1                 B IF SO                 MRX
         MVC   FLINES(5),CONVERT-4      CONVERT TO K'S          MRX
         MVI   FLINES+5,C'K'            SET INDICATOR           MRX
LISTJOE1 EQU   *                                                MRX
*        DELETED                                                MRX
*        DELETED                                                MRX
         MVC   CONVERT-4(8),=X'4020202020202120' EDIT MASK      MRX
         ED    CONVERT-4(8),CONVERT+4   CONVERT TO EBCDIC       MRX
         MVC   FLINES(5),CONVERT-1      MOVE IT TO MSG          MRX
         MVI   FLINES+5,C' '            SET BLANK TO BE SAFE    MRX
         C     R0,=F'99999'             COUNT FIT IN 5 DIGITS?  MRX
         BNH   LISTJOE2                 B IF SO                 MRX
         MVC   FLINES(5),CONVERT-4      CONVERT TO K'S          MRX
         MVI   FLINES+5,C'K'            SET INDICATOR           MRX
LISTJOE2 EQU   *                                                MRX
./ ADD NAME=QUE3     0108-79319-80205-1315-00093-00090-00026-$SYS13  00
//QUE3  JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//QASM     PROC MBR=
//ASM      EXEC PGM=IFOX00,PARM='LOAD,NODECK',REGION=4000K
//SYSLIB   DD DISP=SHR,DSN=SYS0.QUE.MACLIB
//         DD DISP=SHR,DSN=SYS1.SMPMTS
//         DD DISP=SHR,DSN=SYS1.MACLIB
//         DD DISP=SHR,DSN=SYS4.ACF2.V221.ACFMAC
//         DD DISP=SHR,DSN=SYS1.HASPSRC
//         DD DISP=SHR,DSN=SYS4.JTIP.V12.MAC
//SYSUT1    DD  SPACE=(CYL,(5,5)),UNIT=VIO
//SYSUT2    DD  SPACE=(CYL,(5,5)),UNIT=VIO
//SYSUT3    DD  SPACE=(CYL,(5,5)),UNIT=VIO
//SYSPRINT  DD  SYSOUT=*
//SYSGO     DD  DISP=OLD,DSN=SYS0.QUE.OBJ(&MBR)
//SYSIN     DD  DISP=SHR,DSN=SYS0.QUE.MACLIB(&MBR)
//         PEND
//*
//*
//**** ASSEMBLE ALL THE REENTRANT MODULES
//*
//*
//QUEUE    EXEC QASM,MBR=Q1          QUEUE
//ALLOCATE EXEC QASM,MBR=Q2          ALLOCATE
//CKPT     EXEC QASM,MBR=Q3          CKPT
//DDNAME   EXEC QASM,MBR=Q4          DDNAME
//DISPLAY  EXEC QASM,MBR=Q5          DISPLAY
//FINDJOB  EXEC QASM,MBR=Q6          FINDJOB
//FORMAT   EXEC QASM,MBR=Q7          FORMAT
//HELP     EXEC QASM,MBR=Q8          HELP
//HEXBLK   EXEC QASM,MBR=Q9          HEXBLK
//INIT     EXEC QASM,MBR=Q10         INIT
//JCL      EXEC QASM,MBR=Q11         JCL
//JLOG     EXEC QASM,MBR=Q12         JLOG
//JMSG     EXEC QASM,MBR=Q13         JMSG
//LIST     EXEC QASM,MBR=Q14         LIST
//LISTDS   EXEC QASM,MBR=Q15         LISTDS
//PARSE    EXEC QASM,MBR=Q16         PARSE
//READSPC  EXEC QASM,MBR=Q17         READSPC
//REPOS    EXEC QASM,MBR=Q18         REPOS
//SAVE     EXEC QASM,MBR=Q19         SAVE
//SEARCH   EXEC QASM,MBR=Q20         SEARCH
//SYSLOG   EXEC QASM,MBR=Q21         SYSLOG
//XDS      EXEC QASM,MBR=Q22         XDS
//*
//*
//**** LINK THE REENTRANT MODULES TO FORM THE QUEUE COMMAND
//*
//*
//LINKEDIT EXEC PGM=IEWL,PARM='XREF,LIST,LET,NCAL,REFR,RENT,REUS',
//         COND=(7,LT)
//SYSLMOD   DD  DISP=SHR,DSN=SYS2.CMDLIB
//SYSUT1    DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSPRINT  DD  SYSOUT=*
//SYSLIB    DD  DISP=SHR,DSN=SYS0.QUE.OBJ
//SYSLIN    DD  *
 INCLUDE SYSLIB(Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8,Q9,Q10)
 INCLUDE SYSLIB(Q11,Q12,Q13,Q14,Q15,Q16,Q17,Q18,Q19,Q20)
 INCLUDE SYSLIB(Q21,Q22)
 ENTRY QUEUE
 ALIAS Q
 NAME QUEUE(R)
/*
//*
//*
//**** ASSEMBLE AND LINK THE NON REENTRANT COMMON MODULE
//*
//*
//ASM2     EXEC PGM=IFOX00,PARM='LOAD,NODECK',REGION=4000K
//SYSLIB   DD DISP=SHR,DSN=SYS0.QUE.MACLIB
//         DD DISP=SHR,DSN=SYS1.SMPMTS
//         DD DISP=SHR,DSN=SYS1.MACLIB
//         DD DISP=SHR,DSN=SYS4.ACF2.V221.ACFMAC
//         DD DISP=SHR,DSN=SYS1.HASPSRC
//         DD DISP=SHR,DSN=SYS4.JTIP.V12.MAC
//SYSUT1    DD  SPACE=(CYL,(5,5)),UNIT=SYSDA
//SYSUT2    DD  SPACE=(CYL,(5,5)),UNIT=SYSDA
//SYSUT3    DD  SPACE=(CYL,(5,5)),UNIT=SYSDA
//SYSPRINT  DD  SYSOUT=*
//SYSGO     DD  DISP=OLD,DSN=SYS0.QUE.OBJ(Q0)
//SYSIN     DD  DISP=SHR,DSN=SYS0.QUE.MACLIB(Q0)
/*
//LINKEDT2 EXEC PGM=IEWL,PARM='XREF,LIST,LET,NCAL',
//         COND=(7,LT,ASM2)
//SYSLMOD   DD  DISP=SHR,DSN=SYS2.CMDLIB
//SYSUT1    DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSPRINT  DD  SYSOUT=*
//SYSLIB    DD  DISP=SHR,DSN=SYS0.QUE.OBJ
//SYSLIN    DD  *
 INCLUDE SYSLIB(Q0)
 NAME QUEUECMN(R)
/*
//
./ ADD NAME=RCT      0100-80017-80017-0726-00010-00010-00000-$SYS13  00
//RCT JOB (2000,S010),WENZEL
/*JOBPARM Q=F,I
//STEP01   EXEC PLIXCL
//PLI.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(RCT)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 ENTRY PLICALLA
 PAGE PLISTART
 NAME  RCT(R)
/*
./ ADD NAME=RECAP    0100-79347-79347-1240-00004-00004-00000-$SYS13  00
//SMFDUMP0 JOB (2000,S010),SMFDUMP0,CLASS=A,MSGCLASS=A
//S1 EXEC ASMSCL,LIB1='MRX.LINKLIB2.SOURCE',LIB2='SYS2.LINKLIB',
// MEMBER=RECAP,MAC1='SYS3.NSC.MACLIB',MAC2='SYS1.MACLIB'
/*
./ ADD NAME=RMFRPT   0101-80044-80044-1606-00009-00021-00003-$SYS13  00
//RMFRPT   JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//STEP01   EXEC PLIXCL
//PLI.SYSIN  DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(RMFRPT)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  RMFRPT(R)
//*
./ ADD NAME=SMFBLOCK,SSI=00000088
//SMFBLOCK JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSIN     DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(SMFBLOCK)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  SMFBLOCK(R)
/*
./ ADD NAME=SMFCPUID 0101-80198-80198-1010-00008-00008-00003-$SYS13  00
//SMFCPUID JOB (2000,S010),SMFCPUID,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSIN     DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(SMFCPUID)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  SMFCPUID(R)
/*
./ ADD NAME=SMFDUMP1 0101-80121-80121-1504-00009-00009-00003-$SYS13  00
//SMFDUMP1 JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSIN     DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(SMFDUMP1)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 SETCODE AC(1)
 NAME  SMFDUMP1(R)
/*
./ ADD NAME=SMFDUMP2 0101-80121-80121-1505-00009-00009-00004-$SYS13  00
//SMFDUMP2 JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN     DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(SMFDUMP2)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 SETCODE AC(1)
 NAME  SMFDUMP2(R)
/*
./ ADD NAME=SMFDUP   0101-80092-80092-1230-00008-00009-00003-$SYS13  00
//SMFDUP JOB (2000,S010),SMFDUP,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSIN     DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(SMFDUP)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  SMFDUP(R)
/*
./ ADD NAME=SMFFIX   0101-80141-80141-1547-00008-00008-00003-$SYS13  00
//SMFFIX JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSIN     DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(SMFFIX)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  SMFFIX(R)
/*
./ ADD NAME=SMF234   0102-79166-80017-0727-00012-00012-00003-$SYS13  00
//SMF234  JOB (2000,S010),WENZEL
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL
//ASM.SYSLIB  DD DISP=SHR,DSN=SYS1.MACLIB
//        DD DISP=SHR,DSN=SYS2.MACLIB
//        DD DISP=SHR,DSN=SYS1.AMODGEN
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(SMF234)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 SETCODE AC(1)
 NAME  SMF234(R)
/*
./ ADD NAME=STATE    0101-80017-80137-1804-00008-00008-00000-$SYS13  00
//STATE  JOB (2000,S010),WENZEL
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS2.MACLIB'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(STATE)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 NAME  STATE(R)
/*
./ ADD NAME=TAPEINQ  0100-80023-80023-1428-00008-00008-00000-$SYS13  00
//TAPEINQ JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS2.MACLIB'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.CMDLIB2.SOURCE(TAPEINQ)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.CMDLIB
//LKED.SYSIN    DD  *
 NAME  TAPEINQ(R)
/*
./ ADD NAME=TKSPBR0D 0100-80109-80109-1414-00011-00011-00000-$SYS13  00
//TKSPBR0D JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//*         STEP 1 ASSEMBLE AND LINKEDIT TKSPBR0D
//*
//STEP1    EXEC ASMFCL,MAC='SYS4.JTIP.CSG.MACLIB'
//ASM.SYSLIB DD
//          DD UNIT=DISK,VOL=SER=ITEL01
//ASM.SYSIN DD DSN=SYS0.CMDLIB2.SOURCE(TKSPBR0D),DISP=SHR
//LKED.SYSLMOD DD DISP=OLD,DSN=SYS2.CMDLIB(TKSPBR0D)
//*
./ ADD NAME=TMSACTRT 0101-80099-80099-1532-00010-00010-00005-$SYS13  00
//TMSACTRT JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//STEP1   EXEC ASMFCL,MAC1='SYS3.TMS.TMSGEN',
//        PARM.LKED='XREF,LET,LIST,NCAL,RENT'
//ASM.SYSIN    DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(TMSACTRT)
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN   DD  *
 NAME  TMSACTRT(R)
/*
./ ADD NAME=TSOHOLD,SSI=00000030
//TSOHOLD JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP1   EXEC ASMFCL
//ASM.SYSIN    DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(TSOHOLD)
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN   DD  *
 NAME  TSOHOLD(R)
/*
./ ADD NAME=UICPACK  0101-80035-80036-1441-00018-00017-00000-$SYS13  00
//UICPACK  JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//DIRECT   EXEC PGM=DIRECT
//DIRECT   DD DSN=SYS0.PSWSAMP.DIRECT,DISP=SHR
//ANALYSIS EXEC PGM=ANALYSIS
//SYSPRINT DD SYSOUT=*
//PAKLIST  DD DSN=SYS0.PSWSAMP.IEAPAK00,DISP=SHR,
//            DCB=(LRECL=80,BLKSIZE=3120,RECFM=FB)
//DIRECT   DD DSN=SYS0.PSWSAMP.DIRECT,DISP=SHR
//TAPE     DD DSN=SYS0.PSWSAMP.DATA,DISP=SHR
EQUATE IEFW21SD,DEVMASKT,DEVNAMET
EQUATE IGG0199F,IGG0199G,IGG0199W,IGG0198L
EQUATE IGC0008C,IEFU83
EQUATE IEEPRTN,IEEPRWI2,IEESB605
EQUATE IEFIRECM,IEFJDSNA,IEFJJTRM,IEFJRASP,IEFJRECM,IEFJSDTN,IEFJSREQ
EQUATE IGG0196S,IGG019T3,IGG019T4,IGG019T5,IGG019T6,IGG019T7,IGG019T8
EQUATE IGG019T5,IGG019TX,IGG019TY,IGG019TZ
/*
./ ADD NAME=UICPSWAS 0101-80035-80035-1731-00021-00021-00001-$SYS13  00
//UICPSWAS JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//STEP01   EXEC PLIXCL
//PLI.SYSIN  DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(ANALYSIS)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  ANALYSIS(R)
//*
//STEP02   EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(DIRECT)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  DIRECT(R)
//*
//STEP03   EXEC ASMFCL,MAC1='SYS1.AMODGEN'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(PSWSAMP)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  PSWSAMP(R)
/*
./ ADD NAME=USSTAB   0101-80104-80104-1613-00006-00006-00003-$SYS13  00
//USSTAB JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//*
//STEP1   EXEC ASMFCL
//ASM.SYSIN    DD DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(USSTAB)
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS1.VTAMLIB(USSTAB)
./ ADD NAME=VTOCSCAN 0100-80203-80203-1139-00008-00008-00000-$SYS13  00
//VTOCSCAN JOB (2000,S010),WENZEL,CLASS=Z
/*JOBPARM Q=F,I
//STEP01   EXEC ASMFCL,MAC1='SYS2.MACLIB'
//ASM.SYSIN  DD  DISP=SHR,DSN=SYS0.LINKLIB2.SOURCE(VTOCSCAN)
//LKED.SYSLMOD  DD  DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSIN    DD  *
 NAME  VTOCSCAN(R)
/*
