./ ADD NAME=APRIOPT  0101-80119-80137-1417-00074-00076-00000-$SYS13  00
&-----------------------  SPF/TSO PRIMARY OPTION MENU  -------------------------
&SELECT OPTION ===>%OPT     $
 &                                                          $USERID   -@ID
&   0 $SPF PARMS  - SPECIFY TERMINAL AND SPF PARAMETERS     $TIME     -@TIME
$                   1) TERMINAL  2) LOG/LIST  3) PF KEYS    $TERMINAL -@TERM
&   1 $BROWSE     - DISPLAY SOURCE DATA OR OUTPUT LISTINGS  $PFKEYS   -@KY
&   2 $EDIT       - CREATE OR CHANGE SOURCE DATA
&   3 $UTILITY    - PERFORM SPF UTILITY FUNCTIONS
$                   1) LIBRARY    3) MOVE/COPY   5) RESET      7) VTOC
$                   2) DATA SET   4) CATALOG     6) HARDCOPY   8) OUTLIST
&   4 $FOREGROUND - COMPILE, ASSEMBLE, OR LINK EDIT, OR DEBUG
&   5 $BACKGROUND - COMPILE, ASSEMBLE, OR LINK EDIT
&   6 $TSO        - ENTER TSO COMMAND OR CLIST
&   7 $TUTORIAL   - DISPLAY INFORMATION ABOUT SPF
&   J $JTIP       - PERFORM JTIP UTILITY FUNCTIONS
&   P $PANVALET   - SPF/TSO/PANVALET INTERFACE
$                               2) CHANGE    4) DISPLAY  6) PRINT    8) RETRIEVE
$                   1) ADD      3) COPY      5) LISTDS   7) RENAME   9) STORE
&   X $EXIT       - TERMINATE SPF USING LIST/LOG DEFAULTS
&
$PRESS&END KEY$TO TERMINATE SPF$
&
<ACTION>
1 OPT CHAR(8) CURSOR GENHELP(TTUTOR)
 LIST   (0     ,0.1   ,0.2   ,0.3   ,1     ,2      ,
  3      ,3.1   ,3.2   ,3.3   ,3.4   ,3.5   ,3.6   ,3.7   ,3.8   ,3.9   ,
  4      ,4.1   ,4.2   ,4.3   ,4.4   ,4.5   ,4.6   ,4.7   ,4.8   ,
  5     ,5.1   ,5.2   ,5.3   ,5.4   ,5.5   ,5.6   ,
  6     ,7       ,
  P     ,P.0   ,P.1   ,P.2   ,P.3   ,P.4   ,P.5   ,P.6    ,P.7   ,
  P.8   ,P.9   ,
  A     ,A.1   ,A.2   ,A.3   ,
  J     ,
  X  ,TESTMENU,' ',*)
 RETURN (SPFOPT,SPFOPT,SPFOPT,SPFOPT,SPFBRO,SPFEDIT,
  SPFUTIL,SPFUDA,SPFUDA,SPFUMC,SPFUCA,SPFURS,SPFUHC,SPFUVT,SPFUOL,SPFUSC,
  SPFUTIL,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,
  SPFJOB,SPFJOB,SPFJOB,SPFJOB,SPFJOB,SPFJOB,SPFJOB,
  SPFTSO,SPFTUTOR,
  SPFUTIL,TKSPED0D,SPFFOR,SPFFOR,SPFFOR,SPFIPAN2,SPFFOR,SPFFOR,SPFFOR
  SPFFOR,SPFFOR,
  SPFUTIL,SPFFOR,SPFFOR,SPFFOR,
  SPFIJTIP,
  END,SPFTMENU,' ',?);
2 OPT CHAR(8) INIT($PARM2)
 LIST   (0    ,0.1  ,0.2  ,0.3  ,3   ,3.1 ,3.2 ,3.8  ,3.9   ,
  4   ,4.1  ,4.2  ,4.3  ,4.4  ,4.5  ,4.6  ,4.7  ,4.8  ,
  5    ,5.0  ,5.1  ,5.2  ,5.3  ,5.4  ,5.5  ,5.6  ,7,
  P    ,P.0  ,P.1  ,P.2  ,P.3  ,P.4  ,P.5  ,P.6  ,P.7,
  P.8  ,P.9  ,
  A    ,A.1  ,A.2  ,A.3  ,
  J)
 RETURN (OPT00,OPT01,OPT02,OPT03,UTIL,UDA1,UDA2,UOL01,SCRPTA,
  FORA,FOR01,FOR02,FOR03,FOR04,FOR05,FOR06,FOR07,FOR08,
  *JOBA,JOB00,JOB01,JOB02,JOB03,JOB04,JOB05,JOB06,T,
  VPAN,VPANE,VPAN01,VPAN02,VPAN03,VPAN04,VPAN05,VPAN06,VPAN07,
  VPAN08,VPAN09,
  VASM2,V$AR,V$BK,V$SM,
  VJTIP);
3 ID CHAR(8) INIT($PARM3);
4 TIME CHAR(5) INIT($PARM4);
5 DATE CHAR(8) INIT($PARM5);
6 DATEJ CHAR(6) INIT($PARM6);
7 KY CHAR(2) INIT($PARM7);
8 TERM CHAR(8) INIT($PARM8);
9 MODE CHAR(1) INIT($PARM9)
 LIST   (MONO,DUAL)
 RETURN (M   ,D   );
10 PFX CHAR(8) INIT($PARM10);
11 STEP CHAR(8) INIT($PARM11);
12 * FIXED(8) INIT(0);  ** RESERVED **
13 * CHAR(8) INIT(' '); ** RESERVED **
14 * FIXED(31) INIT(0); ** RESERVED **
<END>
./ ADD NAME=APRIOPT0 0100-80137-80137-1416-00076-00076-00000-$SYS13  00
&-----------------------  SPF/TSO PRIMARY OPTION MENU  -------------------------
&SELECT OPTION ===>%OPT     $
 &                                                          $USERID   -@ID
&   0 $SPF PARMS  - SPECIFY TERMINAL AND SPF PARAMETERS     $TIME     -@TIME
$                   1) TERMINAL  2) LOG/LIST  3) PF KEYS    $TERMINAL -@TERM
&   1 $BROWSE     - DISPLAY SOURCE DATA OR OUTPUT LISTINGS  $PFKEYS   -@KY
&   2 $EDIT       - CREATE OR CHANGE SOURCE DATA
&   3 $UTILITY    - PERFORM SPF UTILITY FUNCTIONS
$                   1) LIBRARY    3) MOVE/COPY   5) RESET      7) VTOC
$                   2) DATA SET   4) CATALOG     6) HARDCOPY   8) OUTLIST
&   4 $FOREGROUND - COMPILE, ASSEMBLE, OR LINK EDIT, OR DEBUG
&   5 $BACKGROUND - COMPILE, ASSEMBLE, OR LINK EDIT
&   6 $TSO        - ENTER TSO COMMAND OR CLIST
&   7 $TUTORIAL   - DISPLAY INFORMATION ABOUT SPF
&   A $ASM2       - ASM2 DISK STORAGE MANAGEMENT SYSTEM
$                   1) ARCHIVE  2) BACKUP    3) SPACE MANAGEMENT
&   J $JTIP       - PERFORM JTIP UTILITY FUNCTIONS
&   P $PANVALET   - SPF/TSO/PANVALET INTERFACE
$                               2) CHANGE    4) DISPLAY  6) PRINT    8) RETRIEVE
$                   1) ADD      3) COPY      5) LISTDS   7) RENAME   9) STORE
&   X $EXIT       - TERMINATE SPF USING LIST/LOG DEFAULTS
&
$PRESS&END KEY$TO TERMINATE SPF$
&
<ACTION>
1 OPT CHAR(8) CURSOR GENHELP(TTUTOR)
 LIST   (0     ,0.1   ,0.2   ,0.3   ,1     ,2      ,
  3      ,3.1   ,3.2   ,3.3   ,3.4   ,3.5   ,3.6   ,3.7   ,3.8   ,3.9   ,
  4      ,4.1   ,4.2   ,4.3   ,4.4   ,4.5   ,4.6   ,4.7   ,4.8   ,
  5     ,5.1   ,5.2   ,5.3   ,5.4   ,5.5   ,5.6   ,
  6     ,7       ,
  P     ,P.0   ,P.1   ,P.2   ,P.3   ,P.4   ,P.5   ,P.6    ,P.7   ,
  P.8   ,P.9   ,
  A     ,A.1   ,A.2   ,A.3   ,
  J     ,
  X  ,TESTMENU,' ',*)
 RETURN (SPFOPT,SPFOPT,SPFOPT,SPFOPT,SPFBRO,SPFEDIT,
  SPFUTIL,SPFUDA,SPFUDA,SPFUMC,SPFUCA,SPFURS,SPFUHC,SPFUVT,SPFUOL,SPFUSC,
  SPFUTIL,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,
  SPFJOB,SPFJOB,SPFJOB,SPFJOB,SPFJOB,SPFJOB,SPFJOB,
  SPFTSO,SPFTUTOR,
  SPFUTIL,TKSPED0D,SPFFOR,SPFFOR,SPFFOR,SPFIPAN2,SPFFOR,SPFFOR,SPFFOR
  SPFFOR,SPFFOR,
  SPFUTIL,SPFFOR,SPFFOR,SPFFOR,
  SPFIJTIP,
  END,SPFTMENU,' ',?);
2 OPT CHAR(8) INIT($PARM2)
 LIST   (0    ,0.1  ,0.2  ,0.3  ,3   ,3.1 ,3.2 ,3.8  ,3.9   ,
  4   ,4.1  ,4.2  ,4.3  ,4.4  ,4.5  ,4.6  ,4.7  ,4.8  ,
  5    ,5.0  ,5.1  ,5.2  ,5.3  ,5.4  ,5.5  ,5.6  ,7,
  P    ,P.0  ,P.1  ,P.2  ,P.3  ,P.4  ,P.5  ,P.6  ,P.7,
  P.8  ,P.9  ,
  A    ,A.1  ,A.2  ,A.3  ,
  J)
 RETURN (OPT00,OPT01,OPT02,OPT03,UTIL,UDA1,UDA2,UOL01,SCRPTA,
  FORA,FOR01,FOR02,FOR03,FOR04,FOR05,FOR06,FOR07,FOR08,
  *JOBA,JOB00,JOB01,JOB02,JOB03,JOB04,JOB05,JOB06,T,
  VPAN,VPANE,VPAN01,VPAN02,VPAN03,VPAN04,VPAN05,VPAN06,VPAN07,
  VPAN08,VPAN09,
  VASM2,V$AR,V$BK,V$SM,
  VJTIP);
3 ID CHAR(8) INIT($PARM3);
4 TIME CHAR(5) INIT($PARM4);
5 DATE CHAR(8) INIT($PARM5);
6 DATEJ CHAR(6) INIT($PARM6);
7 KY CHAR(2) INIT($PARM7);
8 TERM CHAR(8) INIT($PARM8);
9 MODE CHAR(1) INIT($PARM9)
 LIST   (MONO,DUAL)
 RETURN (M   ,D   );
10 PFX CHAR(8) INIT($PARM10);
11 STEP CHAR(8) INIT($PARM11);
12 * FIXED(8) INIT(0);  ** RESERVED **
13 * CHAR(8) INIT(' '); ** RESERVED **
14 * FIXED(31) INIT(0); ** RESERVED **
<END>
./ ADD NAME=UDA1     0100-80038-80038-2341-00038-00038-00000-$SYS13  00
&----------------------------  LIBRARY UTILITY  --------------------------------
&SELECT OPTION ===>%CODE                                                       $
&
&   C$- COMPRESS DATASET                   &P$- PRINT MEMBER
&   X$- PRINT INDEX LISTING                &R$- RENAME MEMBER
&   L$- PRINT ENTIRE DATASET               &D$- DELETE MEMBER
&   BLANK$- DISPLAY MEMBER LIST            &B$- BROWSE MEMBER
$
$SPF LIBRARY DATASET:
$   PROJECT&===>%PROJECT $
$   LIBRARY&===>%LIBRARY $
$   TYPE   &===>%TYPE    $
$   MEMBER &===>%MEMBER  $ (IF OPTION "P", "R", "D", OR "B" SELECTED)
$   NEWNAME&===>%NEWNAME $ (IF OPTION "R" SELECTED)
$
$OTHER PARTITIONED OR SEQUENTIAL DATASET:
$   DATASET NAME &===>%DSN                                                     $
$   VOLUME SERIAL&===>%VOL   $  (IF NOT CATALOGED)
$
$DATASET PASSWORD&===>¬PSWD    $(IF PASSWORD PROTECTED)
<ACTION>
 1 CODE    CHAR(1)  INIT($PARM1) CURSOR   GENHELP(TUL)
           LIST  (C,L,X,P,R,D,B,' ',*)
           RETURN(Z,L,X,P,R,D,B,M  ,?);
 2 PROJECT CHAR(8)  INIT($PARM2) NOCURSOR;
 3 LIBRARY CHAR(8)  INIT($PARM3) NOCURSOR;
 4 TYPE    CHAR(8)  INIT($PARM4) NOCURSOR;
 5 DSN     CHAR(56) INIT($PARM5) NOCURSOR;
 6 VOL     CHAR(6)  INIT($PARM6) NOCURSOR;
 7 PSWD    CHAR(8)  INIT($PARM7) NOCURSOR;
 8 MEMBER  CHAR(8)  INIT($PARM8) NOCURSOR;
 9 NEWNAME CHAR(8)  INIT($PARM9) NOCURSOR;
10 *       CHAR(8)  INIT('SPFCOPY '); - COMPRESS PGM NAME IF NOT IEBCOPY
11 *       CHAR(8)  INIT('PPRINTED'); - PRINT MEMBER OPT/RESPONSE
12 *       CHAR(8)  INIT('RRENAMED'); - RENAME MEMBER OPT/RESPONSE
13 *       CHAR(8)  INIT('DDELETED'); - DELETE MEMBER OPT/RESPONSE
14 *       CHAR(8)  INIT('B       '); - BROWSE MEMBER OPT/RESPONSE
<END>
./ ADD NAME=V$AR     0120-80014-80039-0852-00062-00061-00000-TYD9801 00
&------------------------ ASM2 ARCHIVE UTILITY ---------------------------------
&SELECT OPTION ===>%OPT                                                        $
&
&   A$- QUEUE A DATASET TO BE ARCHIVED
&   R$- QUEUE A DATASET TO BE RELOADED FROM AN ARCHIVE TAPE
&   BLANK$- INQUIRE ABOUT ARCHIVED DATASET(S)
$
$COMPLETE DSN (OR PARTIAL DSN, WITHOUT QUOTES, FOR INQUIRY.)
$  NAME &===>%DSN                                                $
$
$FOR ARCHIVE REQUEST (OPTION A)
$   RETENTION  &===>%RET$  PERMANENT ARCHIVE &===>%P$ (Y OR N)
$   QUALIFIER  &===>%QUAL    $
$   COMMENT    &===>%CMT                           $
$
$FOR INQUIRY REQUEST (OPTION 'BLANK')
$   CYCLE      &===>%CYC$  (ONLY DATASETS ARCHIVED WITHIN LAST NNN DAYS)
$   COMMENT    &===>%C$    (ENTER 'Y' TO DISPLAY COMMENTS)
$
$
$
$
$
$
<ACTION>
 1 OPT     CHAR (1)  INIT(' ')     LIST   (A,R,' ',*) GENHELP(VT$AR)
                       CURSOR      RETURN (A,R,' ',?);
 2 OPT     CHAR (1)  INIT(' ')     LIST   ('A' ,  * )  KEY(SW1)
                     NOCURSOR      RETURN (' ' , '¬');
 3 OPT     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW2)
                     NOCURSOR      RETURN (' ' , '¬');
 4 OPT     CHAR (1)  INIT(' ')     LIST   ('R' ,  * )  KEY(SW3)
                     NOCURSOR      RETURN (' ' , '¬');
 5 DSN     CHAR (51) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
 6 DSN     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW8)
                     NOCURSOR      RETURN ('¬' , ' ');
 7 RET     CHAR (3)  INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
 8 RET     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW4)
                     NOCURSOR      RETURN ('¬' , ' ');
 9 P       CHAR (1)  INIT('N')     LIST   ('Y' , 'N',  * )
                     NOCURSOR      RETURN ('Y' , 'N',  ? );
10 P       CHAR (1)  INIT('N')     LIST   ('Y' ,  * )  KEY(SW6)
                     NOCURSOR      RETURN (' ' , '¬');
11 QUAL    CHAR (8)  INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
12 QUAL    CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW5)
                     NOCURSOR      RETURN ('¬' , ' ');
13 CMT     CHAR (30) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
14 CMT     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW7)
                     NOCURSOR      RETURN ('¬' , ' ');
15 C       CHAR (1)  INIT('N')     LIST   ('Y' , 'N',  * )
                     NOCURSOR      RETURN ('Y' , 'N',  ? );
16 C       CHAR (1)  INIT('N')     LIST   ('Y' ,  * )  KEY(SWB)
                     NOCURSOR      RETURN (' ' , '¬');
17 CYC     CHAR (3)  INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
18 CYC     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW9)
                     NOCURSOR      RETURN ('¬' , ' ');
<END>
./ ADD NAME=V$BK     0119-80014-80021-0729-00058-00061-00000-TYD9801 00
&------------------------ ASM2 BACKUP UTILITY ----------------------------------
&SELECT OPTION ===>%OPT                                                        $
&
&   B$- QUEUE A DATASET TO BE BACKED UP
&   R$- QUEUE A DATASET TO BE RELOADED FROM AN BACKUP TAPE
&   BLANK$- INQUIRE ABOUT BACKED UP DATASET(S)
$
$COMPLETE DSN (OR PARTIAL DSN, WITHOUT QUOTES, FOR INQUIRY)
$  NAME &===>%DSN                                                $
$
$FOR ARCHIVE REQUEST (OPTION B)
$   RETENTION  &===>%RET$
$   QUALIFIER  &===>%QUAL    $
$   COMMENT    &===>%CMT                           $
$
$FOR INQUIRY REQUEST (OPTION 'BLANK')
$   CYCLE      &===>%CYC$ (ONLY DATASETS BACKED UP WITHIN LAST NNN DAYS)
$   COMMENT    &===>%C$   (ENTER 'Y' TO DISPLAY COMMENTS)
$
$
$
$
$
$
<ACTION>
 1 OPT     CHAR (1)  INIT(' ')     LIST   (B,R,' ',*) GENHELP(VT$BK)
                       CURSOR      RETURN (B,R,' ',?);
 2 OPT     CHAR (1)  INIT(' ')     LIST   ('B' ,  * )  KEY(SW1)
                     NOCURSOR      RETURN (' ' , '¬');
 3 OPT     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW2)
                     NOCURSOR      RETURN (' ' , '¬');
 4 OPT     CHAR (1)  INIT(' ')     LIST   ('R' ,  * )  KEY(SW3)
                     NOCURSOR      RETURN (' ' , '¬');
 5 DSN     CHAR (51) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
 6 DSN     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW8)
                     NOCURSOR      RETURN ('¬' , ' ');
 7 RET     CHAR (3)  INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
 8 RET     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW4)
                     NOCURSOR      RETURN ('¬' , ' ');
10 QUAL    CHAR (8)  INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
11 QUAL    CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW5)
                     NOCURSOR      RETURN ('¬' , ' ');
12 CMT     CHAR (30) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
13 CMT     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW7)
                     NOCURSOR      RETURN ('¬' , ' ');
14 C       CHAR (1)  INIT('N')     LIST   ('Y' , 'N',*)
                     NOCURSOR      RETURN ('Y' , 'N',?);
15 C       CHAR (1)  INIT('N')     LIST   ('Y' , 'N')  KEY(SWB)
                     NOCURSOR      RETURN (' ' , '¬');
16 CYC     CHAR (3)  INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
17 CYC     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW9)
                     NOCURSOR      RETURN ('¬' , ' ');
<END>
./ ADD NAME=V$SM     0110-80014-80018-1638-00048-00060-00000-TYD9801 00
&---------------- ASM2 DISK SPACE MANAGEMENT UTILITY ---------------------------
&SELECT OPTION ===>%OPT                                                        $
&
&   BLANK$- DISPLAY DISK DATASET SPACE INFORMATION
&   U$- DISPLAY DISK DATASET USAGE INFORMATION
&   C$- COMPRESS DATASET WITHOUT RELEASING UNUSED SPACE
&   R$- RELEASE UNUSED SPACE IN DATASETS (COMPRESS OPTIONAL)
&   E$- RESET END-OF-FILE TO BEGINNING OF SEQUENTIAL DATASET
$
$TYPE OF NAME  &===>%T$     (L=INDEX LEVELS, BLANK=FULL DSN))
$   NAME       &===>%DSN                                         $
$
$OPTIONS FOR RELEASE/COMPRESS OPTION (OPTION 'R','C')
$   COMPRESS   &===>%C$     (FOR PDS ONLY, 'Y' OR 'N')
$   BACKUP     &===>%B$     (FOR COMPRESS ONLY, 'Y' OR 'N')
$   SAVE       &===>%S    $ (SAVE NNNNN UNUSED TRACKS)
<ACTION>
 1 OPT     CHAR (1)  INIT(' ')     LIST   (U,R,E,C,' ',*) GENHELP(VT$SM)
                       CURSOR      RETURN (U,R,E,C,' ',?);
 2 OPT     CHAR (1)  INIT(' ')     LIST   ('U' ,  * )  KEY(SW1)
                     NOCURSOR      RETURN ('¬' , ' ');
 3 OPT     CHAR (1)  INIT(' ')     LIST   ('U' ,  * )  KEY(SW2)
                     NOCURSOR      RETURN (' ' , '¬');
 4 OPT     CHAR (1)  INIT(' ')     LIST   ('R' ,  * )  KEY(SW7)
                     NOCURSOR      RETURN (' ' , '¬');
 5 OPT     CHAR (1)  INIT(' ')     LIST   ('E' ,  * )  KEY(SW8)
                     NOCURSOR      RETURN (' ' , '¬');
 6 OPT     CHAR (1)  INIT(' ')     LIST   ('C' ,  * )  KEY(SW9)
                     NOCURSOR      RETURN (' ' , '¬');
 7 DSN     CHAR (44) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
 8 DSN     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW3)
                     NOCURSOR      RETURN ('¬' , ' ');
 9 T       CHAR (1)  INIT(' ')     LIST   (' ' , 'L' ,  * )
                     NOCURSOR      RETURN (' ' , 'L' ,  ? ); OPTIONAL
10 T       CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW4)
                     NOCURSOR      RETURN ('¬' , ' ');
11 T       CHAR (1)  INIT(' ')     LIST   ('L' ,  * )  KEY(SW5)
                     NOCURSOR      RETURN ('¬' , ' ');
12 C       CHAR (2)  INIT('Y')     LIST   ('N' ,  'Y' ,  * )
                     NOCURSOR      RETURN ('NO' , ' ' ,  ? ); REQUIRED
13 B       CHAR (2)  INIT('Y')     LIST   ('N' ,  'Y' ,  * )
                     NOCURSOR      RETURN ('NO' , ' ' ,  ? ); REQUIRED
14 S       CHAR (5)  INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
15 S       CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW6)
                     NOCURSOR      RETURN ('¬' , ' ');
<END>
./ ADD NAME=VAPRIOPT 0108-79288-80108-1411-00157-00144-00000-$CSG05  00
&-----------------------  SPF/TSO PRIMARY OPTION MENU  -------------------------
&SELECT OPTION ===>%OPT     $
&                                                           $USERID   -@ID
&   0 $SPF PARMS  - SPECIFY TERMINAL AND SPF PARAMETERS     $TIME     -@TIME
$                   1) TERMINAL  2) LOG/LIST  3) PF KEYS    $TERMINAL -@TERM
&   1 $BROWSE     - DISPLAY SOURCE DATA OR OUTPUT LISTINGS  $PFKEYS   -@KY
&   2 $EDIT       - CREATE OR CHANGE SOURCE DATA
&   3 $UTILITY    - PERFORM SPF UTILITY FUNCTIONS
$                   1) LIBRARY    3) MOVE/COPY   5) RESET      7) VTOC
$                   2) DATA SET   4) CATALOG     6) HARDCOPY   8) OUTLIST
&   4 $FOREGROUND - COMPILE, ASSEMBLE, OR LINK EDIT, OR DEBUG
&   5 $BACKGROUND - COMPILE, ASSEMBLE, OR LINK EDIT
&   6 $TSO        - ENTER TSO COMMAND OR CLIST
&   7 $TUTORIAL   - DISPLAY INFORMATION ABOUT SPF
&   A $ASM2       - ASM2 DISK STORAGE MANAGEMENT SYSTEM
$                   1) ARCHIVE  2) BACKUP    3) SPACE MANAGEMENT
&   P $PANVALET   - SPF/TSO/PANVALET INTERFACE
$                               2) CHANGE    4) DISPLAY  6) PRINT    8) RETRIEVE
$                   1) ADD      3) COPY      5) LISTDS   7) RENAME   9) STORE
&   J $JTIP       - PERFORM JTIP UTILITY FUNCTIONS
&   X $EXIT       - TERMINATE SPF USING LIST/LOG DEFAULTS
&
&
$PRESS&PF3$(END KEY) TO TERMINATE SPF$
&
<ACTION>
1 OPT CHAR(8) CURSOR GENHELP(TTUTOR)
 LIST    (0       ,0.1     ,0.2     ,0.3     ,
  1       ,
  2       ,
  3       ,3.1     ,3.2     ,3.3     ,3.4     ,3.5     ,3.6     ,3.7    ,
  3.8     ,3.9     ,
  4       ,4.1     ,4.2     ,4.3     ,4.4     ,4.5     ,4.6     ,4.7    ,
  4.8     ,
  5       ,5.1     ,5.2     ,5.3     ,5.4     ,5.5     ,5.6     ,5.7    ,
  5.8     ,
  6       ,
  7       ,
  8       ,8.0     ,8.1     ,8.2     ,8.3     ,8.4     ,8.5     ,8.6    ,
  8.7     ,8.8     ,8.9     ,
  9       ,
  A       ,A.1     ,A.2     ,A.3     ,
  C       ,
  J       ,
  X       ,TESTMENU,' '    ,*)
 RETURN  (SPFOPT  ,SPFOPT  ,SPFOPT  ,SPFOPT  ,
  SPFBRO  ,
  SPFEDIT ,
  SPFUTIL ,SPFUDA  ,SPFUDA  ,SPFUMC  ,SPFUCA  ,SPFURS  ,SPFUHC  ,SPFUVT  ,
  SPFUOL  ,SPFUTIL ,
  SPFUTIL ,SPFUTIL ,SPFUTIL ,SPFUTIL ,SPFUTIL ,SPFUTIL ,SPFUTIL ,SPFUTIL ,
  SPFUTIL ,
  SPFJOB  ,SPFJOB  ,SPFJOB  ,SPFJOB  ,SPFJOB  ,SPFJOB  ,SPFJOB  ,SPFJOB  ,
  SPFJOB  ,
  SPFTSO  ,
  SPFTUTOR,
  SPFUTIL ,TKSPED0D,SPFFOR  ,SPFFOR  ,SPFFOR  ,TKSPBR0D,SPFFOR  ,SPFFOR ,
  SPFFOR  ,SPFFOR  ,SPFFOR  ,
  SPFUTIL ,
  SPFUTIL ,SPFFOR  ,SPFFOR  ,SPFFOR  ,
  TKSUOL0D,
  TKSJOL0D,
  END     ,SPFTMENU,' '   ,?);
2 OPT CHAR(8) INIT($PARM2)
 LIST     (0       ,0.1     ,0.2     ,0.3     ,
  3       ,3.1     ,3.2     ,3.8     ,3.9     ,
  4       ,4.1     ,4.2     ,4.3     ,4.4     ,4.5     ,4.6     ,4.7     ,
  4.8     ,
  5       ,5.1     ,5.2     ,5.3     ,5.4     ,5.5     ,5.6     ,5.7     ,
  5.8     ,
  7       ,
  8       ,8.0     ,8.1     ,8.2     ,8.3     ,8.4     ,8.5     ,8.6     ,
  8.7     ,8.8     ,8.9     ,
  9       ,
  A       ,A.1     ,A.2     ,A.3     ,
  C       ,
  J       )
 RETURN   (OPT00   ,OPT01   ,OPT02   ,OPT03   ,
  UTIL    ,UDA1    ,UDA2    ,UOL01   ,VNOTSUP ,
  VNOTSUP ,VNOTSUP ,VNOTSUP ,VNOTSUP ,VNOTSUP ,VNOTSUP ,VNOTSUP ,VNOTSUP ,
  VNOTSUP ,
  *JOBA   ,JOB01   ,JOB02   ,JOB03   ,JOB04   ,JOB05   ,JOB06   ,JOB07   ,
  JOB08   ,
  T       ,
  VPAN    ,VPANE   ,VPAN01  ,VPAN02  ,VPAN03  ,VPAN04  ,VPAN05  ,VPAN06  ,
  VPAN07  ,VPAN08  ,VPAN09  ,
  VINDEV  ,
  VASM2   ,V$AR    ,V$BK    ,V$SM    ,
  VUOL01  ,
  VJTIP   );
 3 ID       CHAR (8) INIT($PARM3);
 4 TIME     CHAR (5) INIT($PARM4);
 5 DATE     CHAR (8) INIT($PARM5);
 6 DATEJ    CHAR (6) INIT($PARM6);
 7 KY       CHAR (2) INIT($PARM7);
 8 TERM     CHAR (8) INIT($PARM8);
 9 MODE     CHAR (1) INIT($PARM9)
            LIST   (MONO,DUAL)
            RETURN (M   ,D   );
10 PFX      CHAR (8) INIT($PARM10);
11 STEP     CHAR (8) INIT($PARM11);
12 *        FIXED (8) INIT(0);  ** RESERVED **
13 *        CHAR (8) INIT(' '); ** RESERVED **
14 *        FIXED (31) INIT(0); ** RESERVED **
<END>
***
*** ORIGINAL STATEMENTS
***
&-----------------------  SPF/TSO PRIMARY OPTION MENU  -------------------------
&SELECT OPTION ===>%OPT     $
 &                                                          $USERID   -@ID
 &  0 $SPF PARMS  - SPECIFY TERMINAL AND SPF PARAMETERS     $TIME     -@TIME
&   1 $BROWSE     - DISPLAY SOURCE DATA OR OUTPUT LISTINGS  $TERMINAL -@TERM
&   2 $EDIT       - CREATE OR CHANGE SOURCE DATA            $PF KEYS  -@KY
&   3 $UTILITY    - PERFORM SPF UTILITY FUNCTIONS
&   4 $FOREGROUND - COMPILE, ASSEMBLE, LINK EDIT, OR DEBUG
&   5 $BACKGROUND - COMPILE, ASSEMBLE, OR LINK EDIT
&   6 $TSO        - ENTER TSO COMMAND OR CLIST
&   7 $TUTORIAL   - DISPLAY INFORMATION ABOUT SPF
&   X $EXIT       - TERMINATE SPF USING LIST/LOG DEFAULTS
&
$PRESS&END KEY$TO TERMINATE SPF$
&
<ACTION>
1 OPT CHAR(8) CURSOR GENHELP(TTUTOR)
 LIST   (0     ,0.1   ,0.2   ,0.3   ,1     ,2      ,
  3      ,3.1   ,3.2   ,3.3   ,3.4   ,3.5   ,3.6   ,3.7   ,3.8   ,3.9   ,
  4      ,4.1   ,4.2   ,4.3   ,4.4   ,4.5   ,4.6   ,4.7   ,4.8   ,
  5     ,5.1   ,5.2   ,5.3   ,5.4   ,5.5   ,5.6   ,
  6     ,7       ,X  ,TESTMENU,' ',*)
 RETURN (SPFOPT,SPFOPT,SPFOPT,SPFOPT,SPFBRO,SPFEDIT,
  SPFUTIL,SPFUDA,SPFUDA,SPFUMC,SPFUCA,SPFURS,SPFUHC,SPFUVT,SPFUOL,SPFUSC,
  SPFUTIL,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,SPFFOR,
  SPFJOB,SPFJOB,SPFJOB,SPFJOB,SPFJOB,SPFJOB,SPFJOB,
  SPFTSO,SPFTUTOR,END,SPFTMENU,' ',?);
2 OPT CHAR(8) INIT($PARM2)
 LIST   (0    ,0.1  ,0.2  ,0.3  ,3   ,3.1 ,3.2 ,3.8  ,3.9   ,
  4   ,4.1  ,4.2  ,4.3  ,4.4  ,4.5  ,4.6  ,4.7  ,4.8  ,
  5    ,5.0  ,5.1  ,5.2  ,5.3  ,5.4  ,5.5  ,5.6  ,7)
 RETURN (OPT00,OPT01,OPT02,OPT03,UTIL,UDA1,UDA2,UOL01,SCRPTA,
  FORA,FOR01,FOR02,FOR03,FOR04,FOR05,FOR06,FOR07,FOR08,
  *JOBA,JOB00,JOB01,JOB02,JOB03,JOB04,JOB05,JOB06,T);
3 ID CHAR(8) INIT($PARM3);
4 TIME CHAR(5) INIT($PARM4);
5 DATE CHAR(8) INIT($PARM5);
6 DATEJ CHAR(6) INIT($PARM6);
7 KY CHAR(2) INIT($PARM7);
8 TERM CHAR(8) INIT($PARM8);
9 MODE CHAR(1) INIT($PARM9)
 LIST   (MONO,DUAL)
 RETURN (M   ,D   );
10 PFX CHAR(8) INIT($PARM10);
11 STEP CHAR(8) INIT($PARM11);
12 * FIXED(8) INIT(0);  ** RESERVED **
13 * CHAR(8) INIT(' '); ** RESERVED **
14 * FIXED(31) INIT(0); ** RESERVED **
<END>
./ ADD NAME=VASM2    0105-80014-80015-0744-00026-00021-00000-TYD9801 00
&---------------------  ASM2 UTILITY SELECTION MENU  ---------------------------
&SELECT OPTION ===>%OPT     $
&
&
&       1$- ARCHIVE FUNCTIONS
$           REQUEST ARCHIVE TO TAPE.  INQUIRE ABOUT ARCHIVED DATASETS.
$           REQUEST RELOAD OF ARCHIVED DATASET.
$
&       2$- BACKUP FUNCTIONS
$           REQUEST BACKUP TO TAPE.   INQUIRE ABOUT BACKED UP DATASETS.
$           REQUEST RESORE OF BACKED UP DATASET.
$
&       3$- SPACE MANAGEMENT FUNCTIONS
$           LIST DISK DATASET SPACE AND USAGE INFORMATION.
$           COMPRESS AND/OR RELEASE UNUSED SPACE FROM DATASETS.
$           RESET END-OF-FILE ON A SEQUENTIAL DATASET.
&
&
<ACTION>
1 OPT CHAR(8) CURSOR GENHELP(VTASM2)
      LIST   (1       ,2       ,3       ,*        )
      RETURN (SPFFOR  ,SPFFOR  ,SPFFOR  ,?        );
2 OPT CHAR(8)
      LIST   (1       ,2       ,3       )
      RETURN (V$AR    ,V$BK    ,V$SM    );
<END>
./ ADD NAME=VINDEV   0100-79269-79269-1311-00021-00021-00000-TYD9835 00
&-------------------  SPF MENU DEVELOPMENT DISPLAY  ----------------------------
&
&
&
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
&         * * $                                                 & * *
&         * * $                                                 & * *
&         * * $         THE MENU THAT WAS SELECTED              & * *
&         * * $         IS CURRENTLY IN DEVELOPMENT.            & * *
&         * * $                                                 & * *
&         * * $                                                 & * *
&         * * $    PRESS&(PF3)$TO DISPLAY PRIMARY OPTION MENU   & * *
&         * * $                                                 & * *
&         * * $                                                 & * *
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
<ACTION>
 1 PRJ1    CHAR (8)  INIT(' ')      LIST   (' ')
                     NOCURSOR       RETURN (' '); REQUIRED
<END>
./ ADD NAME=VJTIP    0108-80108-80135-1122-00051-00051-00000-$SYS13  00
&-----------------------------  JTIP UTILITY  ----------------------------------
&SELECT OPTION ===>%TCOD                                                       $
&
&   L$- SHOW JOB NAMES/ID'S VIA THE JTIP SHOW COMMAND
&   S$- SHOW A JOB'S FETCH DATASET INFORMATION
&   D$- DELETE JOB OUTPUT FROM FETCH OR SYSOUT QUEUE
&   R$- REQUEUE JOB OUTPUT FROM FETCH QUEUE TO SYSOUT QUEUE
&   O$- DISPLAY JOB OUTPUT AT TERMINAL
&   BLANK$- COPY OUTPUT FROM FETCH QUEUE TO TEMPORARY DATASET AND BROWSE
$
$FOR JOB TO BE SELECTED:
$   JOBNAME OR JOBID &===>%TJNM    $
$
$   DDNAME(S)     &===>%TDDNAME                            $
$   DATASET ID(S) &===>%TPN                                $
$
$FOR OPTION 'O':                       FOR OPTION 'R':
$   START  COLUMN &===>%TC1$              DEST &===>%TDST  $
$   ENDING COLUMN &===>%TC2$
<ACTION>
 1 TCOD    CHAR (1)  INIT(' ')     LIST   (L,S,D,R,O,' ',*) GENHELP(VTJTIP)
                       CURSOR      RETURN (L,S,D,R,O, B ,?); REQUIRED
 2 TCOD    CHAR (1)  INIT(' ')     LIST   ('L' ,  * )  KEY(SW1)
                     NOCURSOR      RETURN ('¬' , ' ');
 3 TCOD    CHAR (1)  INIT(' ')     LIST   ('S' ,  * )  KEY(SW2)
                     NOCURSOR      RETURN ('¬' , ' ');
 4 TCOD    CHAR (1)  INIT(' ')     LIST   ('D' ,  * )  KEY(SW3)
                     NOCURSOR      RETURN ('¬' , ' ');
 5 TCOD    CHAR (1)  INIT(' ')     LIST   ('R' ,  * )  KEY(SW4)
                     NOCURSOR      RETURN ('¬' , ' ');
 6 TCOD    CHAR (1)  INIT(' ')     LIST   ('O' ,  * )  KEY(SW5)
                     NOCURSOR      RETURN ('¬' , ' ');
 7 TCOD    CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW6)
                     NOCURSOR      RETURN ('¬' , ' ');
 8 TJNM    CHAR (8)  INIT($PARM8)  LIST   (' ' ,  * )
                     NOCURSOR      RETURN ('¬'      ); OPTIONAL
 9 TDDNAME CHAR (35) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
10 TDDNAME CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW7)
                     NOCURSOR      RETURN ('¬' , ' ');
11 TPN     CHAR (35) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
12 TPN     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW8)
                     NOCURSOR      RETURN ('¬' , ' ');
13 TC1     CHAR (3)  INIT('001')   LIST   (' ' ,  * )
                     NOCURSOR      RETURN ('001'    ); OPTIONAL
14 TC2     CHAR (3)  INIT('079')   LIST   (' ' ,  * )
                     NOCURSOR      RETURN ('079'    ); OPTIONAL
15 TDST    CHAR (4)  INIT($PARM15)  LIST   (' ' , * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
<END>
./ ADD NAME=VJTIPB   0100-79269-79269-1311-00007-00007-00000-TYD9835 00
&JTIP OUTPUT LISTING FOR#JOB                            &LINE 00001 COLS 001 080
&COMMAND INPUT ===>%INPUT                                     &SCROLL ===>%AMT $
<ACTION>
1 JOB   CHAR(35) INIT($PARM1) GENHELP(VTJTIPB);
0 INPUT CHAR(40) CURSOR;
0 AMT   CHAR(4)  INIT('PAGE');
<END>
./ ADD NAME=VJTIPO   0104-79269-80108-0931-00051-00049-00000-$CSG05  00
&-----------------------------  JTIP UTILITY  ----------------------------------
&SELECT OPTION ===>%TCOD                                                       $
&
&   L$- SHOW JOB NAMES/ID'S VIA THE JTIP SHOW COMMAND
&   S$- SHOW A JOB'S FETCH DATASET INFORMATION
&   D$- DELETE JOB OUTPUT FROM FETCH OR SYSOUT QUEUE
&   R$- REQUEUE JOB OUTPUT FROM FETCH QUEUE TO SYSOUT QUEUE
&   O$- DISPLAY JOB OUTPUT AT TERMINAL
&   BLANK$- COPY OUTPUT FROM FETCH QUEUE TO TEMPORARY DATASET AND BROWSE
$
$FOR JOB TO BE SELECTED:
$   JOBNAME OR JOBID &===>%TJNM    $
$
$   DDNAME(S)     &===>%TDDNAME                            $
$   DATASET ID(S) &===>%TPN                                $
$
$FOR OPTION 'O':                       FOR OPTION 'R':
$   START  COLUMN &===>%TC1$              DEST &===>%TDST$
$   ENDING COLUMN &===>%TC2$
<ACTION>
 1 TCOD    CHAR (1)  INIT(' ')     LIST   (L,S,D,R,O,' ',*) GENHELP(VTJTIP)
                       CURSOR      RETURN (L,S,D,R,O, B ,?); REQUIRED
 2 TCOD    CHAR (1)  INIT(' ')     LIST   ('L' ,  * )  KEY(SW1)
                     NOCURSOR      RETURN ('¬' , ' ');
 3 TCOD    CHAR (1)  INIT(' ')     LIST   ('S' ,  * )  KEY(SW2)
                     NOCURSOR      RETURN ('¬' , ' ');
 4 TCOD    CHAR (1)  INIT(' ')     LIST   ('D' ,  * )  KEY(SW3)
                     NOCURSOR      RETURN ('¬' , ' ');
 5 TCOD    CHAR (1)  INIT(' ')     LIST   ('R' ,  * )  KEY(SW4)
                     NOCURSOR      RETURN ('¬' , ' ');
 6 TCOD    CHAR (1)  INIT(' ')     LIST   ('O' ,  * )  KEY(SW5)
                     NOCURSOR      RETURN ('¬' , ' ');
 7 TCOD    CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW6)
                     NOCURSOR      RETURN ('¬' , ' ');
 8 TJNM    CHAR (8)  INIT($PARM8)  LIST   (' ' ,  * )
                     NOCURSOR      RETURN ('¬'      ); OPTIONAL
 9 TDDNAME CHAR (35) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
10 TDDNAME CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW7)
                     NOCURSOR      RETURN ('¬' , ' ');
11 TPN     CHAR (35) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
12 TPN     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW8)
                     NOCURSOR      RETURN ('¬' , ' ');
13 TC1     CHAR (3)  INIT('001')   LIST   (' ' ,  * )
                     NOCURSOR      RETURN ('001'    ); OPTIONAL
14 TC2     CHAR (3)  INIT('079')   LIST   (' ' ,  * )
                     NOCURSOR      RETURN ('079'    ); OPTIONAL
15 TDST    CHAR (4)  INIT($PARM15)  LIST   (' ' , * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
<END>
./ ADD NAME=VJTIP9   0100-80135-80135-1114-00051-00051-00000-$SYS13  00
&-----------------------------  JTIP UTILITY  ----------------------------------
&SELECT OPTION ===>%TCOD                                                       $
&
&   L$- SHOW JOB NAMES/ID'S VIA THE JTIP SHOW COMMAND
&   S$- SHOW A JOB'S FETCH DATASET INFORMATION
&   D$- DELETE JOB OUTPUT FROM FETCH OR SYSOUT QUEUE
&   R$- REQUEUE JOB OUTPUT FROM FETCH QUEUE TO SYSOUT QUEUE
&   O$- DISPLAY JOB OUTPUT AT TERMINAL
&   BLANK$- COPY OUTPUT FROM FETCH QUEUE TO TEMPORARY DATASET AND BROWSE
$
$FOR JOB TO BE SELECTED:
$   JOBNAME OR JOBID &===>%TJNM    $
$
$   DDNAME(S)     &===>%TDDNAME                            $
$   DATASET ID(S) &===>%TPN                                $
$
$FOR OPTION 'O':                       FOR OPTION 'R':
$   START  COLUMN &===>%TC1$              DEST &===>%TDST$
$   ENDING COLUMN &===>%TC2$
<ACTION>
 1 TCOD    CHAR (1)  INIT(' ')     LIST   (L,S,D,R,O,' ',*) GENHELP(VTJTIP)
                       CURSOR      RETURN (L,S,D,R,O, B ,?); REQUIRED
 2 TCOD    CHAR (1)  INIT(' ')     LIST   ('L' ,  * )  KEY(SW1)
                     NOCURSOR      RETURN ('¬' , ' ');
 3 TCOD    CHAR (1)  INIT(' ')     LIST   ('S' ,  * )  KEY(SW2)
                     NOCURSOR      RETURN ('¬' , ' ');
 4 TCOD    CHAR (1)  INIT(' ')     LIST   ('D' ,  * )  KEY(SW3)
                     NOCURSOR      RETURN ('¬' , ' ');
 5 TCOD    CHAR (1)  INIT(' ')     LIST   ('R' ,  * )  KEY(SW4)
                     NOCURSOR      RETURN ('¬' , ' ');
 6 TCOD    CHAR (1)  INIT(' ')     LIST   ('O' ,  * )  KEY(SW5)
                     NOCURSOR      RETURN ('¬' , ' ');
 7 TCOD    CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW6)
                     NOCURSOR      RETURN ('¬' , ' ');
 8 TJNM    CHAR (8)  INIT($PARM8)  LIST   (' ' ,  * )
                     NOCURSOR      RETURN ('¬'      ); OPTIONAL
 9 TDDNAME CHAR (35) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
10 TDDNAME CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW7)
                     NOCURSOR      RETURN ('¬' , ' ');
11 TPN     CHAR (35) INIT(' ')     LIST   (' ' ,  * )
                     NOCURSOR      RETURN (' '      ); OPTIONAL
12 TPN     CHAR (1)  INIT(' ')     LIST   (' ' ,  * )  KEY(SW8)
                     NOCURSOR      RETURN ('¬' , ' ');
13 TC1     CHAR (3)  INIT('001')   LIST   (' ' ,  * )
                     NOCURSOR      RETURN ('001'    ); OPTIONAL
14 TC2     CHAR (3)  INIT('079')   LIST   (' ' ,  * )
                     NOCURSOR      RETURN ('079'    ); OPTIONAL
15 TDST    CHAR (4)  INIT('RMT0')   LIST   (' ' , * )
                     NOCURSOR      RETURN ('RMT0'   ); OPTIONAL
<END>
./ ADD NAME=VNOTSUP  0100-79269-79269-1311-00021-00021-00000-TYD9835 00
&-------------------  SPF MENU UNSUPPORTED DISPLAY  ----------------------------
&
&
&
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
&         * * $                                                 & * *
&         * * $                                                 & * *
&         * * $         THE MENU THAT WAS SELECTED              & * *
&         * * $         IS NOT CURRENTLY SUPPORTED.             & * *
&         * * $                                                 & * *
&         * * $                                                 & * *
&         * * $    PRESS&(PF3)$TO DISPLAY PRIMARY OPTION MENU   & * *
&         * * $                                                 & * *
&         * * $                                                 & * *
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
<ACTION>
 1 PRJ1     CHAR (8)  INIT(' ')    LIST   (' ')
                      NOCURSOR     RETURN (' '); REQUIRED
<END>
./ ADD NAME=VOPT01SM 0100-79269-79269-1311-00087-00087-00000-TYD9835 00
&-----------------------  TERMINAL CHARACTERISTICS  ----------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$
$TERMINAL TYPE    &===>%TERM    $(3277 - 3277/3275 DISPLAY STATION)
$                                (3278 - 3278/3276 DISPLAY STATION)
$
$NUMBER OF PF KEYS&===>%KY$      (12 - TWELVE PROGRAM FUNCTION KEYS)
$                                (24 - TWENTY FOUR PROGRAM FUNCTION KEYS)
$
$CHARACTER MODE   &===>%MODE$    (DUAL - DISPLAY UPPER/LOWER CASE CHARACTERS)
$                                (MONO - DISPLAY UPPER CASE CHARACTERS ONLY)
$
$SESSION MANAGER MODE FOR LINE MESSAGES
$                 &===>%SMM$    (NO  - DO NOT ENTER SESSION MANAGER MODE)
$                               (YES - ENTER SESSION MANAGER MODE)
<ACTION>
 1 TERM    CHAR(8)  INIT(' '   ) CURSOR GENHELP(TOPT1)
                    LIST   (3277   ,3278   ,3278C   ,' ',*)
                    RETURN (SPF3277,SPF3278,SPF3278C,' ',?);
 2 TERM    CHAR(8)  INIT($PARM2) NOCURSOR;
 3 KY      CHAR(2)  INIT($PARM3) NOCURSOR;
 4 MODE    CHAR(1)  INIT($PARM4) NOCURSOR
                    LIST   (MONO,DUAL,*)
                    RETURN (M   ,D   );
 5 SMM     CHAR(1)  INIT($PARM5) NOCURSOR
                    LIST   (NO,YES,*)
                    RETURN (N ,Y  );
<END>
************************************************************************

THE FOLLOWING MODIFICATIONS MAY BE MADE TO THIS MENU IF YOU WANT TO
TO CONTROL SESSION MANAGER MODE FOR TSO MESSAGES OUTSIDE OF OPTION 6
AND OPTION 4.

*** MOVE THE FOLLOWING 4 LINES BEFORE THE "<ACTION>" STATEMENT *********
$
$SESSION MANAGER MODE FOR LINE MESSAGES
$                 &===>%SMM$    (NO  - DO NOT ENTER SESSION MANAGER MODE)
$                               (YES - ENTER SESSION MANAGER MODE)

*** REPLACE ACTION STATEMENT 5 WITH THE FOLLOWING 3 LINES **************
 5 SMM     CHAR(1)  INIT($PARM5) NOCURSOR
                    LIST   (NO,YES,*)
                    RETURN (N ,Y  );
*
* ORGINAL STATEMENTS
*
&-----------------------  TERMINAL CHARACTERISTICS  ----------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$
$TERMINAL TYPE    &===>%TERM    $(3277 - 3277/3275 DISPLAY STATION)
$                                (3278 - 3278/3276 DISPLAY STATION)
$
$NUMBER OF PF KEYS&===>%KY$      (12 - TWELVE PROGRAM FUNCTION KEYS)
$                                (24 - TWENTY FOUR PROGRAM FUNCTION KEYS)
$
$CHARACTER MODE   &===>%MODE$    (DUAL - DISPLAY UPPER/LOWER CASE CHARACTERS)
$                                (MONO - DISPLAY UPPER CASE CHARACTERS ONLY)
<ACTION>
 1 TERM    CHAR(8)  INIT(' '   ) CURSOR GENHELP(TOPT1)
                    LIST   (3277   ,3278   ,3278C   ,' ',*)
                    RETURN (SPF3277,SPF3278,SPF3278C,' ',?);
 2 TERM    CHAR(8)  INIT($PARM2) NOCURSOR;
 3 KY      CHAR(2)  INIT($PARM3) NOCURSOR;
 4 MODE    CHAR(1)  INIT($PARM4) NOCURSOR
                    LIST   (MONO,DUAL,*)
                    RETURN (M   ,D   );
 5 SMM     CHAR(1)  INIT('N'); SESSION MANAGER MODE - SEE COMMENTS BELOW
<END>
************************************************************************

THE FOLLOWING MODIFICATIONS MAY BE MADE TO THIS MENU IF YOU WANT TO
TO CONTROL SESSION MANAGER MODE FOR TSO MESSAGES OUTSIDE OF OPTION 6
AND OPTION 4.

*** MOVE THE FOLLOWING 4 LINES BEFORE THE "<ACTION>" STATEMENT *********
$
$SESSION MANAGER MODE FOR LINE MESSAGES
$                 &===>%SMM$    (NO  - DO NOT ENTER SESSION MANAGER MODE)
$                               (YES - ENTER SESSION MANAGER MODE)

*** REPLACE ACTION STATEMENT 5 WITH THE FOLLOWING 3 LINES **************
 5 SMM     CHAR(1)  INIT($PARM5) NOCURSOR
                    LIST   (NO,YES,*)
                    RETURN (N ,Y  );
./ ADD NAME=VPAN     0105-79269-80119-1603-00021-00021-00000-$SYS13  00
&--------------------------  PANVALET SELECTION MENU  --------------------------
&SELECT OPTION ===>%P       $
&
&  0$- PAN EDIT                            &5$- PAN LISTDS
&  1$- PAN ADD                             &6$- PAN PRINT
&  2$- PAN CHANGE                          &7$- PAN RENAME
&  3$- PAN COPY                            &8$- PAN RETRIEVE
&  4$- PAN DISPLAY                         &9$- PAN STORE
&
<ACTION>
1 P   CHAR(8) CURSOR GENHELP(VTPAN)
      LIST   (0       ,1       ,2       ,3        ,4        ,5       ,
              6       ,7       ,8        ,9        ,*       )
      RETURN (TKSPED0D,SPFFOR  ,SPFFOR  ,SPFFOR   ,SPFIPAN2 ,SPFFOR  ,
              SPFFOR  ,SPFFOR  ,SPFFOR   ,SPFFOR   ,'?'     );
2 P   CHAR(8)
      LIST   (0       ,1       ,2        ,3       ,4        ,5       ,
              6       ,7       ,8        ,9        )
      RETURN (VPANE   ,VPAN01  ,VPAN02   ,VPAN03  ,VPAN04   ,VPAN05  ,
              VPAN06  ,VPAN07  ,VPAN08   ,VPAN09   );
<END>
./ ADD NAME=VPANE    0122-79262-79333-1709-00050-00055-00000-TYD9801 00
&---------------------------------  PAN EDIT  ----------------------------------
&SELECT OPTION ===>%VOPT$
&
&   S$- SAVE EDITED MEMBER VIA PAN STORE (SPF MEMBER DELETED)
&   D$- DISPLAY EDIT STATUS OF PANVALET MEMBER
&   E$- END PANVALET MEMBER EDIT STATUS WITHOUT SAVE
&   BLANK$- EDIT PANVALET MEMBER
&
$    PANVALET LIBRARY$===> DDNAME&===>%VDDNAME $
$                         PANNAME&===>%VPANNAM   $
$                          ACCESS&===>¬VACC $
$                         CONTROL&===>¬VCTL $
&
$    SPF DATASET$===>     PROJECT&===>%PRJ0    &
$                         LIBRARY&===>%LIB0    &
$                            TYPE&===>%TYP0    &
$                          MEMBER&===>%MEMBER  $(IF DIFFERENT THAN PANNAME)&
&
<ACTION>
 1 VOPT    CHAR (1)   INIT(' ')   LIST   (S,D,E,' ',*) GENHELP(VTPANE)
                        CURSOR    RETURN (S,D,E, R ,?); REQUIRED
 2 VOPT    CHAR (1)   INIT(' ')   LIST   (' ' ,  * )  KEY(SW1)
                      NOCURSOR    RETURN (' ' , '¬');
 3 VOPT    CHAR (1)   INIT(' ')   LIST   ('S' ,  * )  KEY(SW2)
                      NOCURSOR    RETURN (' ' , '¬');
 4 VOPT    CHAR (1)   INIT(' ')   LIST   ('E' ,  * )  KEY(SW3)
                      NOCURSOR    RETURN (' ' , '¬');
 5 VOPT    CHAR (1)   INIT(' ')   LIST   ('D' ,  * )  KEY(SW4)
                      NOCURSOR    RETURN (' ' , '¬');
 6 PRJ0     CHAR (8)  INIT($PARM6)  LIST   (' ' , * )
                      NOCURSOR      RETURN ('?'     ); REQUIRED
 7 LIB0     CHAR (8)  INIT($PARM7)  LIST   (' ' , * )
                      NOCURSOR      RETURN ('?'     ); REQUIRED
 8 TYP0     CHAR (8)  INIT($PARM8)  LIST   (' ' , * )
                      NOCURSOR      RETURN ('?'     ); REQUIRED
 9 MEMBER   CHAR (8)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('?'     ); OPTIONAL
10 VDDNAME  CHAR (8)  INIT($PARM10) LIST   (' ' , * )
                      NOCURSOR      RETURN ('?'     ); REQUIRED
11 VPANNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                        CURSOR      RETURN ('?'     ); OPTIONAL
12 VACC     CHAR (5)  INIT(' ')
                      NOCURSOR                       ; OPTIONAL
13 VACC     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW5)
                      NOCURSOR      RETURN ('¬' ,' ');
14 VCTL     CHAR (5)  INIT(' ')
                      NOCURSOR                       ; OPTIONAL
15 VCTL     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW6)
                      NOCURSOR      RETURN ('¬' ,' ');
<END>
./ ADD NAME=VPAN01   0101-79269-80028-2005-00055-00055-00000-TYD9801 00
&----------------------------------  PAN ADD  ----------------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$TO PANVALET LIBRARY $                        PANVALET OPTIONS
$        DDNAME&===>%VDDNAME $                          USER&===>¬VUSR$
$       PANNAME&===>%VPANNAM   $                     CONTROL&===>¬VCTL $
$        FORMAT&===>%VFORMAT $                  INTERNAL FMT&===>%VINTFMT $
$                                                DISPOSITION&===>%VDISP $
$FROM SPF DATASET
$       PROJECT&===>%PRJ1    &
$       LIBRARY&===>%LIB1    &
$          TYPE&===>%TYP1    &
$        MEMBER&===>%MEMBER  &
&
$FROM NON-SPF SEQUENTIAL OR PARTITIONED DATASET
$        DSNAME&===>%VDSNAME                                                 $
&
<ACTION>
40 VDDNAME  CHAR (8)  INIT($PARM40) LIST   (' ' , * )  GENHELP(VTPAN01)
                      NOCURSOR      RETURN ('?'     ); REQUIRED
41 VPANNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                        CURSOR      RETURN ('?'     ); REQUIRED
42 VFORMAT  CHAR (8)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('?'     ); REQUIRED
10 PRJ1     CHAR (8)  INIT($PARM10) LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
11 LIB1     CHAR (8)  INIT($PARM11) LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
12 TYP1     CHAR (8)  INIT($PARM12) LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
31 MEMBER   CHAR (8)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
61 MEMBER   CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW1)
                      NOCURSOR      RETURN ('¬' ,' ');
47 VDSNAME  CHAR (56) INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
67 VDSNAME  CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW2)
                      NOCURSOR      RETURN ('¬' ,' ');
43 VUSR     CHAR (4)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
63 VUSR     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW3)
                      NOCURSOR      RETURN ('¬' ,' ');
44 VCTL     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
64 VCTL     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW4)
                      NOCURSOR      RETURN ('¬' ,' ');
45 VINTFMT  CHAR (8)  INIT('TSO')   LIST (' ' , TSO , PANVALET , NOFORMAT ,
                                             T , P , N )
                      NOCURSOR      RETURN ('?' , TSO , PANVALET , NOFORMAT ,
                                             T , P , N ); REQUIRED
46 VDISP    CHAR (6)  INIT('DELETE') LIST  (' ' , DELETE , KEEP ,
                                                      DE , K )
                      NOCURSOR      RETURN ('?' , DELETE , KEEP ,
                                                      DE , K ); REQUIRED
<END>
./ ADD NAME=VPAN02   0100-79269-79269-1311-00047-00047-00000-TYD9835 00
&--------------------------------  PAN CHANGE  ---------------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$IN PANVALET LIBRARY
$        DDNAME&===>%VDDNAME $
$       PANNAME&===>%VPANNAM   $
&
&ENTER CHANGE IN ONLY ONE CRITERION
$       STATUS &===>%VSTATUS $
$       COMMENT&===>%VCOM                                              $
$          USER&===>¬VUSR$
$         LEVEL&===>%VLV$
&
$PANVALET OPTIONS
$        ACCESS&===>¬VACC $
$       CONTROL&===>¬VCTL $
&
<ACTION>
40 VDDNAME  CHAR (8)  INIT($PARM40) LIST   (' ' , * )  GENHELP(VTPAN02)
                      NOCURSOR      RETURN ('?'     ); REQUIRED
41 VPANNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                        CURSOR      RETURN ('?'     ); REQUIRED
49 VSTATUS  CHAR (8)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
3  VSTATUS  CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW1)
                      NOCURSOR      RETURN ('¬' ,' ');
50 VCOM     CHAR (50) INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
2  VCOM     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW2)
                      NOCURSOR      RETURN ('¬' ,' ');
43 VUSR     CHAR (4)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
63 VUSR     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW3)
                      NOCURSOR      RETURN ('¬' ,' ');
51 VLV      CHAR (3)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
61 VLV      CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW4)
                      NOCURSOR      RETURN ('¬' ,' ');
48 VACC     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
68 VACC     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW5)
                      NOCURSOR      RETURN ('¬' ,' ');
44 VCTL     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
64 VCTL     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW6)
                      NOCURSOR      RETURN ('¬' ,' ');
<END>
./ ADD NAME=VPAN03   0100-79269-79269-1311-00028-00028-00000-TYD9835 00
&---------------------------------  PAN COPY  ----------------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$IN PANVALET LIBRARY
$        DDNAME&===>%VDDNAME $
$  FROM PANNAME&===>%VPANNAM   $
$    TO NEWNAME&===>%VNEWNAM   $
&
$PANVALET OPTIONS
$        ACCESS&===>¬VACC $
$       CONTROL&===>¬VCTL $
&
<ACTION>
40 VDDNAME  CHAR (8)  INIT($PARM40) LIST   (' ' , * )  GENHELP(VTPAN03)
                      NOCURSOR      RETURN ('?'     ); REQUIRED
41 VPANNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                        CURSOR      RETURN ('?'     ); REQUIRED
52 VNEWNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ( '?'    ); REQUIRED
48 VACC     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
68 VACC     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW1)
                      NOCURSOR      RETURN ('¬' ,' ');
44 VCTL     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
64 VCTL     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW2)
                      NOCURSOR      RETURN ('¬' ,' ');
<END>
./ ADD NAME=VPAN04   0104-79269-79304-1425-00029-00039-00000-TYD9801 00
&--------------------------------  PAN DISPLAY  --------------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
&
&
&
&
&
         $IN PANVALET LIBRARY
                     $DDNAME&===>%VDDNAME $
             $      $PANNAME&===>%VPANNAM   $
&
         $PANVALET OPTIONS
                     $ACCESS&===>¬VACC$
                     $EXPAND&===>%VEXPAND $
&
&
<ACTION>
1  VDDNAME  CHAR (8)  INIT($PARM1)  LIST   (' ' , * )  GENHELP(VTPAN04)
                      NOCURSOR      RETURN ('?'     ); REQUIRED
2  VPANNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                        CURSOR      RETURN ('?'     ); REQUIRED
3  VACC     CHAR (4)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('?'     ); OPTIONAL
4  VEXPAND  CHAR (8)  INIT('NOEXPAND') LIST (' ' , NOEXPAND , EXPAND ,
                                                          N , E )
                      NOCURSOR      RETURN ('?'  , NOEXPAND , EXPAND ,
                                                          N , E ); REQUIRED
<END>
./ ADD NAME=VPAN04B  0104-79269-79304-1503-00007-00007-00000-TYD9801 00
&PAN BROWSE#TITLE                                       &LINE 00001 COLS 001 080
&COMMAND INPUT ===>%INPUT                                     &SCROLL ===>%AMT $
<ACTION>
1 TITLE CHAR(44) INIT($PARM1)  GENHELP(TB)    ;
0 INPUT CHAR(40) CURSOR;
0 AMT   CHAR(4)  INIT('PAGE');
<END>
./ ADD NAME=VPAN05   0100-79269-79269-1311-00030-00030-00000-TYD9835 00
&--------------------------------  PAN LISTDS  ---------------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$IN PANVALET LIBRARY
$        DDNAME&===>%VDDNAME $
$       PANNAME&===>%VPANNAM   $
&
$PANVALET OPTIONS
$        ACCESS&===>¬VACC $
$       CONTROL&===>¬VCTL $
$       COMMENT&===>%VCOM   $
&
<ACTION>
40 VDDNAME  CHAR (8)  INIT($PARM40) LIST   (' ' , * )  GENHELP(VTPAN05)
                      NOCURSOR      RETURN ('?'     ); REQUIRED
41 VPANNAM  CHAR (10) INIT(' '  )   LIST   (' ' , * )
                        CURSOR      RETURN ('?'     ); REQUIRED
50 VCOM     CHAR (7)  INIT('COMMENT') LIST (' ' , COMMENT , COM )
                      NOCURSOR      RETURN ('¬' , COMMENT , COM ); OPTIONAL
60 VCOM     CHAR (1)  INIT('COMMENT') LIST (' ' , COMMENT , COM )  KEY(SW1)
                      NOCURSOR      RETURN ('¬' ,' ',' ');
48 VACC     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
68 VACC     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW2)
                      NOCURSOR      RETURN ('¬' ,' ');
44 VCTL     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
64 VCTL     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW3)
                      NOCURSOR      RETURN ('¬' ,' ');
<END>
./ ADD NAME=VPAN06   0100-79269-79269-1311-00044-00044-00000-TYD9835 00
&---------------------------------  PAN PRINT  ---------------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$IN PANVALET LIBRARY
$        DDNAME&===>%VDDNAME $
&
&ENTER ONLY ONE SELECTION CRITERION
$          NAME&===>%VPANNAM   $
$        STATUS&===>%VSTATUS $
$          TYPE&===>%VTYPE   $
$          USER&===>¬VUSR$
&
$PANVALET OPTIONS
$       CONTROL&===>¬VCTL $
$       COMMENT&===>%VCOM   $
&
<ACTION>
40 VDDNAME  CHAR (8)  INIT($PARM40) LIST   (' ' , * )  GENHELP(VTPAN06)
                      NOCURSOR      RETURN ('?'     ); REQUIRED
41 VPANNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                        CURSOR      RETURN ('¬'     ); OPTIONAL
4  VPANNAM  CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW3)
                      NOCURSOR      RETURN ('¬' ,' ');
49 VSTATUS  CHAR (8)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
3  VSTATUS  CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW1)
                      NOCURSOR      RETURN ('¬' ,' ');
53 VTYPE    CHAR (8)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
1  VTYPE    CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW2)
                      NOCURSOR      RETURN ('¬' ,' ');
43 VUSR     CHAR (4)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
63 VUSR     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW4)
                      NOCURSOR      RETURN ('¬' ,' ');
44 VCTL     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
64 VCTL     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW5)
                      NOCURSOR      RETURN ('¬' ,' ');
50 VCOM     CHAR (7)  INIT('COMMENT') LIST (' ' , COMMENT , COM )
                      NOCURSOR      RETURN ('¬' , COMMENT , COM ); OPTIONAL
60 VCOM     CHAR (1)  INIT('COMMENT') LIST (' ' , * )  KEY(SW6)
                      NOCURSOR      RETURN ('¬' ,' ');
<END>
./ ADD NAME=VPAN07   0100-79269-79269-1311-00028-00028-00000-TYD9835 00
&--------------------------------  PAN RENAME  ---------------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$IN PANVALET LIBRARY
$        DDNAME&===>%VDDNAME $
$  FROM PANNAME&===>%VPANNAM   $
$    TO NEWNAME&===>%VNEWNAM   $
&
$PANVALET OPTIONS
$        ACCESS&===>¬VACC $
$       CONTROL&===>¬VCTL $
&
<ACTION>
40 VDDNAME  CHAR (8)  INIT($PARM40) LIST   (' ' , * )  GENHELP(VTPAN07)
                      NOCURSOR      RETURN ('?'     ); REQUIRED
41 VPANNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                        CURSOR      RETURN ('?'     ); REQUIRED
52 VNEWNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('?'     ); REQUIRED
48 VACC     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
68 VACC     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW1)
                      NOCURSOR      RETURN ('¬' ,' ');
44 VCTL     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
64 VCTL     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW2)
                      NOCURSOR      RETURN ('¬' ,' ');
<END>
./ ADD NAME=VPAN08   0100-79269-79269-1311-00053-00053-00000-TYD9835 00
&-------------------------------  PAN RETRIEVE  --------------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$FROM PANVALET LIBRARY $                        PANVALET OPTIONS
$          DDNAME&===>%VDDNAME $                          ACCESS&===>¬VACC $
$         PANNAME&===>%VPANNAM   $                       CONTROL&===>¬VCTL $
$          EXPAND&===>%VEXPAND $                    INTERNAL FMT&===>%VINTFMT $
&
$TO SPF DATASET
$         PROJECT&===>%PRJ1    &
$         LIBRARY&===>%LIB1    &
$            TYPE&===>%TYP1    &
$          MEMBER&===>%MEMBER  &
&
$TO NON-SPF SEQUENTIAL OR PARTITIONED DATASET
$          DSNAME&===>%VDSNAME                                                 $
&
<ACTION>
40 VDDNAME  CHAR (8)  INIT($PARM40) LIST   (' ' , * )  GENHELP(VTPAN08)
                      NOCURSOR      RETURN ('?'     ); REQUIRED
41 VPANNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                        CURSOR      RETURN ('?'     ); REQUIRED
1  PRJ1     CHAR (8)  INIT($PARM1)  LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
2  LIB1     CHAR (8)  INIT($PARM2)  LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
6  TYP1     CHAR (8)  INIT($PARM6)  LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
31 MEMBER   CHAR (8)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
61 MEMBER   CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW1)
                      NOCURSOR      RETURN ('¬' ,' ');
54 VEXPAND  CHAR (8)  INIT('NOEXPAND') LIST (' ' , NOEXPAND , EXPAND ,
                                                          N , E )
                      NOCURSOR      RETURN ('?' , NOEXPAND , EXPAND ,
                                                      N , E ); OPTIONAL
47 VDSNAME  CHAR (56) INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
67 VDSNAME  CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW2)
                      NOCURSOR      RETURN ('¬' ,' ');
44 VCTL     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
64 VCTL     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW3)
                      NOCURSOR      RETURN ('¬' ,' ');
45 VINTFMT  CHAR (8)  INIT('TSO')   LIST   (' ' , TSO , PANVALET ,
                                                    T , P )
                      NOCURSOR      RETURN ('?' , TSO , PANVALET ,
                                                    T , P ); OPTIONAL
48 VACC     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
68 VACC     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW4)
                      NOCURSOR      RETURN ('¬' ,' ');
<END>
./ ADD NAME=VPAN09   0100-79269-79269-1311-00055-00055-00000-TYD9835 00
&---------------------------------  PAN STORE  ---------------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$TO PANVALET LIBRARY$                          PANVALET OPTIONS
$        DDNAME&===>%VDDNAME $                         ACCESS&===>¬VACC $
$       PANNAME&===>%VPANNAM   $                      CONTROL&===>¬VCTL $
$         LEVEL&===>%VLV$                        INTERNAL FMT&===>%VINTFMT $
$                                                 DISPOSITION&===>%VDISP $
$FROM SPF DATASET
$       PROJECT&===>%PRJ1    &
$       LIBRARY&===>%LIB1    &
$          TYPE&===>%TYP1    &
$        MEMBER&===>%MEMBER  &
&
$FROM NON-SPF SEQUENTIAL OR PARTITIONED DATASET
$        DSNAME&===>%VDSNAME                                                 $
&
<ACTION>
40 VDDNAME  CHAR (8)  INIT($PARM40) LIST   (' ' , * )  GENHELP(VTPAN09)
                      NOCURSOR      RETURN ('?'     ); REQUIRED
41 VPANNAM  CHAR (10) INIT(' ')     LIST   (' ' , * )
                        CURSOR      RETURN ('?'     ); REQUIRED
51 VLV      CHAR (3)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('?'     ); REQUIRED
1  PRJ1     CHAR (8)  INIT($PARM1)  LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
2  LIB1     CHAR (8)  INIT($PARM2)  LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
6  TYP1     CHAR (8)  INIT($PARM6)  LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
31 MEMBER   CHAR (8)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
61 MEMBER   CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW1)
                      NOCURSOR      RETURN ('¬' ,' ');
47 VDSNAME  CHAR (56) INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
67 VDSNAME  CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW2)
                      NOCURSOR      RETURN ('¬' ,' ');
44 VCTL     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
64 VCTL     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW3)
                      NOCURSOR      RETURN ('¬' ,' ');
45 VINTFMT  CHAR (8)  INIT('PANVALET') LIST (' ' , TSO , PANVALET ,
                                                    T , P )
                      NOCURSOR      RETURN ('?' , TSO , PANVALET ,
                                                    T , P ); REQUIRED
46 VDISP    CHAR (6)  INIT('DELETE') LIST  (' ' , DELETE , KEEP ,
                                                      DE , K )
                      NOCURSOR      RETURN ('?' , DELETE , KEEP ,
                                                      DE , K ); REQUIRED
48 VACC     CHAR (5)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
68 VACC     CHAR (1)  INIT(' ')     LIST   (' ' , * )  KEY(SW4)
                      NOCURSOR      RETURN ('¬' ,' ');
<END>
./ ADD NAME=VSUBMT   0100-79269-79269-1311-00037-00037-00000-TYD9835 00
&----------------------------------  SUBMIT  -----------------------------------
&ENTER/VERIFY PARAMETERS BELOW:
&
$FROM SPF DATASET
$       PROJECT&===>%PRJ1    &        $       PROJECT&===>%PRJ2    &
$       LIBRARY&===>%LIB1    &        $       LIBRARY&===>%LIB2    &
$          TYPE&===>%TYP1    &        $          TYPE&===>%TYP2    &
$        MEMBER&===>%MEMBER1 &        $        MEMBER&===>%MEMBER2 &
&
$FROM NON-SPF SEQUENTIAL OR PARTITIONED DATASET
$        DSNAME&===>%VDSNAME1                                                $
&
$FROM NON-SPF SEQUENTIAL OR PARTITIONED DATASET
$        DSNAME&===>%VDSNAME2                                                $
&
$FROM PANNVALET LIBRARY
$        DDNAME&===>%VDDNAME1&        $        DDNAME&===>%VDDNAME2&
$       PANNAME&===>%VPANNAM1  &      $       PANNAME&===>%VPANNAM2  &
&
<ACTION>
10 PRJ1     CHAR (8)  INIT($PARM10) LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
11 LIB1     CHAR (8)  INIT($PARM11) LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
12 TYP1     CHAR (8)  INIT($PARM12) LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
31 MEMBER1  CHAR (8)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
10 PRJ2     CHAR (8)  INIT($PARM10) LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
11 LIB2     CHAR (8)  INIT($PARM11) LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
12 TYP2     CHAR (8)  INIT($PARM12) LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
31 MEMBER2  CHAR (8)  INIT(' ')     LIST   (' ' , * )
                      NOCURSOR      RETURN ('¬'     ); OPTIONAL
<END>
./ ADD NAME=VT$AR    0103-80015-80105-1504-00031-00031-00000-$CSG05  00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 ARCHIVE UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                      ----------------------------------
                       | ASM2 ARCHIVE UTILITY FUNCTIONS |
                       ----------------------------------
$
  THE ASM2 ARCHIVE UTILITY ALLOWS USERS TO MAKE USE OF THE ASM2 ARCHIVE
  FACILITY.  ARCHIVING IS THE PROCESS BY WHICH A DATASET IS COPIED TO AN ASM2
  ARCHIVE TAPE AND THEN DELETED FROM DISK AND UNCATALOGED.  THIS PROCESS ALLOWS
  DATA TO BE RETAINED FOR POSSIBLE FUTURE USE ON DISK EVEN THOUGH THE VOLUME OR
  FREQUENCY OF USE WOULD NOT NORMALLY WARRANT KEEPING THE DATASET ON DISK.
  ARCHIVING CAN OCCUR AUTOMATICALLY IN ACCORDANCE WITH INSTALLATION STANDARDS,
  OR IT CAN BE EXPLICITLY REQUESTED BY THE USER.  IN EITHER CASE THE DATASET IS
  RETAINED FOR A SPECIFIED,  OR DEFAULT, TIME DURING WHICH IT MAY BE RESTORED
  TO DISK VIA A USER REQUEST.

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &1$- GENERAL ARCHIVE CONSIDERATIONS
    &2$- QUEUEING DATASETS TO BE ARCHIVED
    &3$- QUEUEING DATASETS TO BE RESTORED
    &4$- INQUIRING ABOUT THE STATUS OF ARCHIVED DATASETS
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(   1   ,   2   ,   3   ,   4   )
               RETURN(VT$AR1 ,VT$AR2 ,VT$AR3 ,VT$AR4 );
3 * CHAR(8) INIT('VTASM2 ');
4 * CHAR(8) INIT('VT$BK   ');
5 * CHAR(8) INIT('VT$AR1  ');
<END>
./ ADD NAME=VT$AR1   0103-80015-80015-1657-00030-00028-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 ARCHIVE UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                      ----------------------------------
                       | GENERAL ARCHIVE CONSIDERATIONS |
                       ----------------------------------
$
  THE ASM2 ARCHIVE FACILITY IS USED TO COPY A DATASET FROM DISK TO TAPE.
  THE DISK DATASET IS UNCATALOGED AND DELETED.

  ASM2 PROVIDES FACILITIES TO ARCHIVE DATASETS ,  INQUIRE ABOUT ARCHIVED
  DATASETS, AND TO RESTORE ARCHIVED DATASETS.    THESE FUNCTIONS MAY BE
  REQUESTED  FROM A TSO TERMINAL.   THE DATASET IS NOT ARCHIVED OR RESTORED
  IMMEDIATELY UPON REQUEST.  THE REQUEST IS QUEUED UNTIL A BATCH ARCHIVE OR
  RESTORE RUN IS SUBMITTED.

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &1$- ARCHIVE DATASET RESTRICTIONS
    &2$- TYPES OF ARCHIVE TAPES
    &3$- SYSTEM INITIATED ARCHIVING
    &4$- USER INITIATED ARCHIVE
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(   1   ,   2   ,   3   ,   4   )
               RETURN(VT$AR11,VT$AR12,VT$AR13,VT$AR14);
3 * CHAR(8) INIT('VT$AR  ');
4 * CHAR(8) INIT('VT$AR2  ');
5 * CHAR(8) INIT('VT$AR11 ');
<END>
./ ADD NAME=VT$AR11  0102-80015-80016-0739-00028-00021-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 ARCHIVE UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                      --------------------------------
                       | ARCHIVE DATASET RESTRICTIONS |
                       --------------------------------
$
  THE ASM2 ARCHIVE FACILITY CAN BE USED ON ALMOST ALL TYPES OF DATASETS.

  CERTAIN TYPES OF DATASETS ARE NOT NORMALLY ARCHIVED.
    1. UNMOVEABLE DATASETS
    2. MULTI-VOLUME DATASETS
    3. DATSETS WITH INVALID DCB INFORMATION.
    4. EMPTY DATASETS (CAN BE ARCHIVED WITH PARAMETER OVERRIDE)
    5. GDG DATASETS (SPECIAL GDG HANDLING IS AVAILABLE)

  VSAM CATALOGS,  PAGE SPACES,  ALTERNATE INDEXES,  DATA COMPONENTS, AND INDEX
  COMPONENTS CANNOT BE ARCHIVED.  VSAM CLUSTERS MAY BE ARCHIVED AS LONG AS THEY
  DO NOT HAVE ALTERNATE INDEXES ASSOCIATED WITH THEM.

  ASM2 USES THE 'EXPORT PERMANENT' FUNCTION OF IDCAMS TO ARCHIVE THE CLUSTER.
<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$AR1 ');
4 * CHAR(8) INIT('VT$AR12 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$AR12  0100-80015-80015-1646-00025-00025-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 ARCHIVE UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                             --------------------------
                              | TYPES OF ARCHIVE TAPES |
                              --------------------------
$
  ARCHIVED DATASETS ARE GROUPED ON TO ASM2 CONTROLLED ARCHIVE TAPES.  MANY
  DATASETS ARE WRITTEN ON TO EACH TAPE,  THUS PROVIDING SAVINGS IN TAPES.

  ASM2 SEGREGATES ARCHIVED TAPES INTO TWO GROUPS.  THESE ARE KNOWN AS 'NORMAL'
  ARCHIVES AND 'PERMANENT' ARCHIVES.  THIS IS DONE TO REDUCE THE HANDLING AND
  PASSING OF TAPES CONTAINING DATA WHICH IS TO BE KEPT  FOR  LONG  PERIODS  OF
  TIME,  AND MOST LIKELY,  NOT REFERENCED VERY FREQUENTLY.  ANY ARCHIVE REQUEST
  SPECIFYING  A  RETENTION  PERIOD  GREATER  THAN  3  YEARS,   IS  CONSIDERED
  'PERMANENT'.   YOU  MAY  ALSO  DESIGNATE  AN  ARCHIVE  DATASET AS PERMANENT,
  REGARDLESS OF RETENTION.  THE DEFAULT RETENTION PERIOD IS 1 YEAR FOR NORMAL
  ARCHIVES,  AND 5 YEARS FOR PERMANENT ARCHIVES.
<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$AR1 ');
4 * CHAR(8) INIT('VT$AR13 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$AR13  0104-80015-80017-1605-00021-00025-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 ARCHIVE UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                         ------------------------------
                          | SYSTEM INITIATED ARCHIVING |
                          ------------------------------
$
  IN SYSTEM INITIATED ARCHIVAL,  ONLINE DISK VOLUMES ARE SCANNED FOR DATASETS
  WHICH ARE NOT PRE-AUTHORIZED TO REMAIN ON DISK.  THE UNAUTHORIZED DATASETS
  ARE THEN SUBJECT TO TESTS FOR INACTIVITY.  A DATASET IS INACTIVE IF IT HAS
  NOT BEEN ACCESSED IN 'X' DAYS. ('X' IS DETERMINED BY CURRENT INSTALLATION
  STANDARDS.)  INACTIVE DATASETS WHICH ARE ARCHIVABLE ARE ARCHIVED.
  NON-ARCHIVABLE DATASETS ARE SCRATCHED.  (SEE 'ARCHIVE DATASET RESTRICTIONS')

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$AR1 ');
4 * CHAR(8) INIT('VT$AR14 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$AR14  0105-80015-80016-0758-00023-00025-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 ARCHIVE UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                           ----------------------------
                            | USER INITIATED ARCHIVING |
                            ----------------------------
$
  USER INITIATED ARCHIVING IS DONE TO REMOVE DATASETS FROM DISK WHILE KEEPING A
  COPY OF THE DATASET AVAILABLE FOR FUTURE PROCESSING.  DATA SUCH AS TEST DATA,
  YEAR END FILES,  OLD VERSIONS OF LIBRARIES,  ETC.  ARE ALL CANDADATES FOR
  ARCHIVING.

  A USER ARCHIVE REQUEST IS USUALLY INITIATED THROUGH THE ASM2 TSO COMMAND.
  THE SPF INTERFACE PROVIDES MENU SUPPORT TO THIS COMMAND.  (SEE 'QUEUEING
  DATASETS TO BE ARCHIVED' FOR MORE INFORMATION.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$AR1 ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$AR2   0104-80015-80021-0730-00030-00015-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 ARCHIVE UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     ------------------------------------
                      | QUEUEING DATASETS TO BE ARCHIVED |
                      ------------------------------------
$
  A DATASET IS QUEUED FOR LATER ARCHIVE PROCESSING THROUGH THE ASM2 TSO
  COMMAND.  AN SPF INTERFACE HAS BEEN PROVIDED TO SIMPLIFY USE OF THIS COMMAND.

  A DATASET IS QUEUED FOR ARCHIVING BY SELECTING OPTION&A$ON THE &ASM2 ARCHIVE
  UTILITY$MENU.  ENTER THE NAME OF THE DATASET TO BE ARCHIVED IN THE&NAME$AREA.
  NORMAL TSO NAMING CONVENTIONS APPLY.  USE SINGLE QUOTES&(')$FOR FULLY
  QUALIFIED NAMES.

  YOU MAY SPECIFY THE NUMBER OF DAYS THE ARCHIVED DATASET SHOULD BE KEPT IN
  THE&RETENTION$FIELD.  NOTE:  DEFAULTS ARE&365 (1 YR.)$FOR &NORMAL
  ARCHIVES$,AND&1825 (5 YR.)&FOR PERMANENT ARCHIVES$. A RETENTION GREATER
  THAN&3 YEARS$IS AUTOMATICALLY CONSIDERED PERMANENT.  YOU MAY CLASSIFY AN
  ARCHIVE REQUEST AS PERMANENT,  REGARDLESS OF THE RETENTION PERIOD,  BY CODING
  A&Y$ IN THE&PERMANENT ARCHIVE$FIELD.

                         (CONTINUED ON NEXT PAGE)
<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$AR  ');
4 * CHAR(8) INIT('VT$AR3  ');
5 * CHAR(8) INIT('VT$AR2A ');
<END>
./ ADD NAME=VT$AR2A  0103-80016-80016-1330-00025-00030-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 ARCHIVE UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     ------------------------------------
                      | QUEUEING DATASETS TO BE ARCHIVED |
                      ------------------------------------
$
  WHEN A DATASET IS ARCHIVED TO TAPE IT NORMALLY RETAINS THE SAME NAME.  USE OF
  THE&QUALIFIER$CAUSES THE DATASET TO BE RENAMED.  THE VALUE SPECIFIED IS
  INSERTED IMMEDIATELY BEFORE THE LAST NODE OF THE DATASET NAME.  FOR EXAMPLE:
  IF THE QUALIFIER&SMITH$WERE SPECIFIED WHEN ARCHIVING A DATASET NAMED
 &BCPQT.A1007211.CLAIMS$, THE NEW DATASET WOULD BE&BCPQT.A1007211.SMITH.CLAIMS$

  THE&COMMENT$FIELD IS USED TO PLACE ANY USER INFORMATION, UP TO 30 CHARACTERS
  LONG,  INTO THE ASM2 CATALOG.  WHEN INQUIRIES ARE MADE ABOUT ARCHIVED
  DATASETS,  THE COMMENT CAN BE DISPLAYED.


<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$AR2 ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$AR3   0104-80015-80021-0730-00027-00015-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 ARCHIVE UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     ------------------------------------
                      | QUEUEING DATASETS TO BE RESTORED |
                      ------------------------------------
$
  DATASETS ARE QUEUED FOR RELOADING BY SELECTING OPTION&R$ON THE&ASM2 ARCHIVE
  UTILITY$MENU.  THE NAME OF THE DATASET TO BE RELOADED IS ENTERED IN
  THE&NAME$FIELD. NORMAL TSO NAMING CONVENTIONS APPLY.  FULLY QUALIFIED DATASET
  NAMES MUST BE ENCLOSED IN SINGLE QUOTES&(')$.

  IF MULTIPLE ARCHIVED VERSIONS OF A DATASET EXIST,  YOU MAY SPECIFY THE
  VERSION IN A MANNER SIMILAR TO GENERATION DATASETS.  YOU SPECIFY THE NEXT TO
  LATEST VERSION BY ADDING A&(-1)$FOLLOWING THE NAME.&(-2)$ SPECIFIES THE ONE
  BEFORE THAT,  AND SO ON.

  WHEN THE BATCH RELOAD JOB IS COMPLETE,  A MESSAGE WILL BE SENT TO THE TSO
  USER WHO REQUESTED THE RELOAD.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$AR  ');
4 * CHAR(8) INIT('VT$AR4  ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$AR4   0103-80015-80021-0731-00030-00015-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 ARCHIVE UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                          -----------------------------
                           | ARCHIVE DATASET INQUIRIES |
                           -----------------------------
$
  ONCE A DATASET HAS BEEN ARCHIVED BY THE BATCH RUN,  IT IS POSSIBLE TO INQUIRE
  ABOUT THE STATUS THROUGH THE INQUIRY OPTION&(OPTION BLANK)$.

  AN INQUIRY WITH NOTHING IN THE&NAME$FIELD WILL CAUSE DATASETS BEGINNING WITH
  THE REQUESTOR'S USERID TO BE LISTED.

  YOU MAY ENTER A PARTIAL OR FULL NAME IN THE&NAME$FIELD. UNLIKE NORMAL TSO
  DATASET NAMES,   YOUR  USERID  IS&NOT$APPENDED TO  THE  BEGINNING.   ALL
  DATASETS&BEGINNING$WITH THE CHARACTERS SPECIFIED WILL BE LISTED.

  THE&CYCLE$FIELD IS USED TO LIMIT THE INQUIRIES TO DATASETS ARCHIVED WITHIN
  THE LAST 'NNN' DAYS.  WHERE 'NNN' IS THE NUMBER ENTERED.

  TYPING A&Y$IN THE&COMMENT$FIELD CAUSES ANY USER COMMENTS ENTERED AT THE TIME
  THE DATASET WAS ARCHIVED TO BE DISPLAYED.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$AR  ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$BK    0101-80015-80015-1715-00030-00030-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 BACKUP UTILITY ---------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                      ---------------------------------
                       | ASM2 BACKUP UTILITY FUNCTIONS |
                       ---------------------------------
$
  THE ASM2 BACKUP UTILITY ALLOWS USERS MAKE USE OF THE ASM2 BACKUP FACILITY.
  'BACKUP' IS THE PROCESS BY WHICH A DATASET IS COPIED TO AN ASM2 BACKUP TAPE,
  WHILE THE DISK RESIDENT DATASET IS LEFT UNDISTURBED.   THIS PROCESS ALLOWS
  DATA TO BE REFERENCED ON DISK,  AND INSURES THE DATASET MAY BE RECONSTRUCTED
  IF THE DISK  DATASET  IS  DAMAGED.   BACKUP  CAN  OCCUR  AUTOMATICALLY  IN
  ACCORDANCE WITH INSTALLATION STANDARDS,  OR IT CAN BE EXPLICITLY REQUESTED BY
  THE USER.  IN EITHER CASE THE BACKED UP DATASET IS RETAINED FOR A SPECIFIED,
  OR DEFAULT,  TIME DURING WHICH IT MAY BE RESTORED TO DISK VIA A USER REQUEST.

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &1$- GENERAL BACKUP CONSIDERATIONS
    &2$- QUEUEING DATASETS TO BE BACKED UP
    &3$- QUEUEING DATASETS TO BE RESTORED
    &4$- INQUIRING ABOUT THE STATUS OF BACKED UP DATASETS
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(   1   ,   2   ,   3   ,   4   )
               RETURN(VT$BK1 ,VT$BK2 ,VT$BK3 ,VT$BK4 );
3 * CHAR(8) INIT('VTASM2 ');
4 * CHAR(8) INIT('VT$SM   ');
5 * CHAR(8) INIT('VT$BK1  ');
<END>
./ ADD NAME=VT$BK1   0101-80015-80015-1656-00029-00028-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 BACKUP UTILITY ---------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                      ---------------------------------
                       | GENERAL BACKUP CONSIDERATIONS |
                       ---------------------------------
$
  THE ASM2 BACKUP FACILITY IS USED TO COPY A DATASET FROM DISK TO TAPE.
  THE DISK DATASET IS LEFT UNDISTURBED.

  ASM2 PROVIDES FACILITIES TO BACK UP DATASETS ,  INQUIRE ABOUT BACKED UP
  DATASETS, AND TO RESTORE BACKED UP DATASETS.   THESE  FUNCTIONS MAY BE
  REQUESTED  FROM A TSO TERMINAL.   THE DATASET IS NOT BACKED UP OR RESTORED AT
  THE TIME THE REQUEST IS ENTERED.  THE REQUEST IS PLACED IN A QUEUE TO BE
  PROCESSED WHEN A BATCH BACKUP OR RESTORE RUN IS SUBMITTED.

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &1$- BACK UP DATASET RESTRICTIONS
    &2$- SYSTEM INITIATED INCREMENTAL BACKUP
    &3$- USER INITIATED BACKUP
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(   1   ,   2   ,   3   )
               RETURN(VT$BK11,VT$BK12,VT$BK13);
3 * CHAR(8) INIT('VT$BK  ');
4 * CHAR(8) INIT('VT$BK2  ');
5 * CHAR(8) INIT('VT$BK11 ');
<END>
./ ADD NAME=VT$BK11  0104-80015-80017-1606-00027-00021-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 BACK UP UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                      --------------------------------
                       | BACK UP DATASET RESTRICTIONS |
                       --------------------------------
$
  THE ASM2 BACK UP FACILITY CAN BE USED ON ALMOST ALL TYPES OF DATASETS.

  CERTAIN TYPES OF DATASETS ARE NOT NORMALLY BACKED UP.
    1. MULTI-VOLUME DATASETS
    2. DATSETS WITH INVALID DCB INFORMATION.
    3. EMPTY DATASETS (CAN BE ARCHIVED WITH PARAMETER OVERRIDE)
    4. GDG DATASETS (SPECIAL GDG HANDLING IS AVAILABLE)

  VSAM CATALOGS,  PAGE SPACES,  ALTERNATE INDEXES,  DATA COMPONENTS, AND INDEX
  COMPONENTS CANNOT BE BACKED UP.  VSAM CLUSERS CAN BE BACKED UP.

  ASM2 USES THE 'EXPORT TEMPORARY' FUNCTION OF IDCAMS TO BACK UP THE CLUSTER.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$BK1 ');
4 * CHAR(8) INIT('VT$BK12 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$BK12  0105-80015-80016-1600-00026-00025-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 BACK UP UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                  ----------------------------------------
                   | SYSTEM INITIATED INCREMENTAL BACK UP |
                   ----------------------------------------
$
  IN SYSTEM INITIATED BACK UP,   ONLINE DISK VOLUMES ARE SCANNED FOR DATASETS
  WHICH HAVED BEEN OPENED FOR UPDATE SINCE THE LAST INCREMENTAL BACKUP FOR THAT
  VOLUME.  THESE DATASETS ARE AUTOMATICALLY BACKUP.

  THIS METHOD INSURES ALL DATASETS (ON VOLUMES PROCESSED BY INCREMENTAL BACKUP)
  ARE BACKED UP IF THEY HAVE BEEN CHANGED SINCE THE LAST INCREMENTAL BACKUP.
  DATASETS NOT CHANGED NEED NOT BE BACKED UP SINCE A PREVIOUS BACKUP ALREADY
  EXISTS.

  NO ACTION IS NECESSARY BY THE USER OTHER THAN INSURING HIS DATASETS RESIDE ON
  AN 'INCREMENATLLY BACKED UP' VOLUME.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$BK1 ');
4 * CHAR(8) INIT('VT$BK13 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$BK13  0106-80015-80016-1426-00019-00025-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 BACK UP UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                            --------------------------
                             | USER INITIATED BACK UP |
                             --------------------------
$
  USER INITIATED BACK UP IS AVAILABLE TO SUPPLEMENT THE SYSTEM INITIATED BACK
  UP OF ASM2.  THE USER CAN EXPLICITLY REQUEST BACK UP OF HIS DATASETS VIA A
  TSO COMMAND.  THE SPF INTERFACE PROVIDES MENU SUPPORT TO THIS COMMAND.  (SEE
  'QUEUEING DATASETS TO BE BACKED UP' FOR MORE INFORMATION.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$BK1 ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$BK2   0107-80015-80021-0731-00027-00015-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 BACK UP UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     -------------------------------------
                      | QUEUEING DATASETS TO BE BACKED UP |
                      -------------------------------------
$
  A DATASET IS QUEUED FOR LATER BACK UP PROCESSING THROUGH THE ASM2 TSO
  COMMAND.  AN SPF INTERFACE HAS BEEN PROVIDED TO SIMPLIFY USE OF THIS COMMAND.

  A DATASET IS QUEUED FOR BACK UP BY SELECTING OPTION&B$ON THE &ASM2 BACK UP
  UTILITY$MENU.  ENTER THE NAME OF THE DATASET TO BE BACKED UP IN THE&NAME$AREA.
  NORMAL TSO NAMING CONVENTIONS APPLY.  USE SINGLE QUOTES&(')$FOR FULLY
  QUALIFIED NAMES.

  YOU MAY SPECIFY THE NUMBER OF DAYS THE BACKED UP DATASET SHOULD BE KEPT IN
  THE&RETENTION$FIELD.  NOTE:  DEFAULT (AND MAXIMUM) IS&90$.  NOTE THAT THIS
  MAXIMUM DOES NOT AFFECT INCREMENTALLY BACKED UP DATASET RETENTIONS.

                         (CONTINUED ON NEXT PAGE)
<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$BK  ');
4 * CHAR(8) INIT('VT$BK3  ');
5 * CHAR(8) INIT('VT$BK2A ');
<END>
./ ADD NAME=VT$BK2A  0105-80016-80016-1603-00024-00030-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 BACK UP UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     -------------------------------------
                      | QUEUEING DATASETS TO BE BACKED UP |
                      -------------------------------------
$
  WHEN A DATASET IS BACKED UP TO TAPE IT NORMALLY RETAINS THE SAME NAME.  USE
  OF THE&QUALIFIER$CAUSES THE DATASET TO BE RENAMED.  THE VALUE SPECIFIED IS
  INSERTED IMMEDIATELY BEFORE THE LAST NODE OF THE DATASET NAME.  FOR EXAMPLE:
  IF THE QUALIFIER&SMITH$WERE SPECIFIED WHEN BACKING UP A DATASET NAMED
 $BCPQT.A1007211.CLAIMS$, THE NEW DATASET WOULD BE&BCPQT.A1007211.SMITH.CLAIMS$

  THE&COMMENT$FIELD IS USED TO PLACE ANY USER INFORMATION, UP TO 30 CHARACTERS
  LONG,  INTO THE ASM2 CATALOG.  WHEN INQUIRIES ARE MADE ABOUT BACKED UP
  DATASETS,  THE COMMENT CAN BE DISPLAYED.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$BK2 ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$BK3   0106-80015-80021-0731-00027-00015-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 BACK UP UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     ------------------------------------
                      | QUEUEING DATASETS TO BE RESTORED |
                      ------------------------------------
$
  DATASETS ARE QUEUED FOR RELOADING BY SELECTING OPTION&R$ON THE&ASM2 BACK UP
  UTILITY$MENU.  THE NAME OF THE DATASET TO BE RELOADED IS ENTERED IN
  THE&NAME$FIELD. NORMAL TSO NAMING CONVENTIONS APPLY.  FULLY QUALIFIED DATASET
  NAMES MUST BE ENCLOSED IN SINGLE QUOTES&(')$.

  IF MULTIPLE BACK UP VERSIONS EXIST,  AND YOU DO NOT WANT TO RELOAD THE LATEST
  VERSION,  YOU MAY SPECIFY THE RELATIVE VERSION IN MUCH THE SAME WAY AS
  GENERATION DATASETS. YOU SPECIFY THE NEXT TO LATEST VERSION BY ADDING&(-1)$
  FOLLOWING THE NAME. &(-2)$SPECIFIES THE ONE BEFORE THAT,  AND SO ON.

  WHEN THE BATCH RELOAD JOB IS COMPLETE,  A MESSAGE WILL BE SENT TO THE TSO
  USER WHO REQUESTED THE RELOAD.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$BK  ');
4 * CHAR(8) INIT('VT$BK4  ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$BK4   0104-80015-80021-0732-00030-00015-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------ ASM2 BACK UP UTILITY --------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                          -----------------------------
                           | BACK UP DATASET INQUIRIES |
                           -----------------------------
$
  ONCE A DATASET HAS BEEN BACKED UP BY THE BATCH RUN,  IT IS POSSIBLE TO
  INQUIRE ABOUT THE STATUS THROUGH THE INQUIRY OPTION&(OPTION BLANK)$.

  AN INQUIRY WITH NOTHING IN THE&NAME$FIELD WILL CAUSE DATASETS BEGINNING WITH
  THE REQUESTOR'S USERID TO BE LISTED.

  YOU MAY ENTER A PARTIAL OR FULL NAME IN THE&NAME$FIELD. UNLIKE NORMAL TSO
  DATASET NAMES,   YOUR  USERID  IS&NOT$APPENDED TO  THE BEGINNING.   ALL
  DATASETS&BEGINNING$WITH THE CHARACTERS SPECIFIED WILL BE LISTED.

  THE&CYCLE$FIELD IS USED TO LIMIT THE INQUIRIES TO DATASETS BACKED UP WITHIN
  THE LAST 'NNN' DAYS.  WHERE 'NNN' IS THE NUMBER ENTERED.

  TYPING A&Y$IN THE&COMMENT$FIELD CAUSES ANY USER COMMENTS ENTERED AT THE TIME
  THE DATASET WAS BACKED UP TO BE DISPLAYED.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$BK  ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$SM    0102-80015-80016-1616-00031-00030-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL -------------- ASM2 SPACE MANAGEMENT UTILITY ---------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                 -------------------------------------------
                  | ASM2 SPACE MANAGEMENT UTILITY FUNCTIONS |
                  -------------------------------------------
$
  THE ASM2 DISK SPACE MANAGEMENT UTILITY ALLOWS USERS MAKE USE OF THE ASM2
  UNIQUE FACILITIES TO MANAGE THEIR OWN DATASETS EFFICIENTLY.  THE USER IS ABLE
  TO EASILY DETERMINE BOTH THE AMOUNT OF SPACE HIS DATASETS OCCUPY,  AND THE
  FREQUENCY WITH WHICH THE DATASET IS USED.  WITH THIS INFORMATION,  ASM2
  PROVIDES FACILITIES TO COMPRESS DATASETS AND/OR TO RELEASE UNUSED SPACE FROM
  OVER-ALLOCATED DATASETS.  OBSOLETE OR INFREQUENTLY USED DATASETS CAN BE
  DELETED OR ARCHIVED TO TAPE.

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &1$- GENERAL SPACE MANAGEMENT CONSIDERATIONS
    &2$- DISPLAYING DISK DATASET USAGE INFORMATION
    &3$- DISPLAYING DISK DATASET SPACE INFORMATION
    &4$- COMPRESSING PARTITIONED DATASETS
    &5$- RELEASING UNUSED SPACE FROM DATASETS
    &6$- RESETTING END-OF-FILE ON SEQUENTIAL DATASETS
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(   1   ,   2   ,   3   ,   4   ,   5   ,   6   )
               RETURN(VT$SM1 ,VT$SM2 ,VT$SM3 ,VT$SM4 ,VT$SM5 ,VT$SM6 );
3 * CHAR(8) INIT('VTASM2 ');
4 * CHAR(8) INIT('VTASM2  ');
5 * CHAR(8) INIT('VT$SM1  ');
<END>
./ ADD NAME=VT$SM1   0102-80015-80105-1514-00027-00027-00000-$CSG05  00
<FIELDS>¬%!&$#@
&TUTORIAL -------------- ASM2 SPACE MANAGEMENT UTILITY ---------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&               ------------------------------------------------
                | ASM2 SPACE MANAGEMENT GENERAL CONSIDERATIONS |
                ------------------------------------------------
$
  THERE ARE TWO ITEMS REQUIRED TO BE ABLE TO MANAGE YOUR DISK DATASETS.  FIRST,
  YOU MUST BE ABLE TO OBTAIN INFORMATION CONCERNING THE USE OF DISK SPACE.
  SECONDLY YOU MUST BE ABLE TO CHANGE THE WAY IN WHICH THE DISK SPACE IS USED.

  THE ASM2 SPACE MANAGEMENT UTILITY SEARCHES THE SYSTEM CATALOGS TO FIND ALL
  THE DATASETS MATCHING THE CRITERIA WHICH YOU SPECIFY.  THE DISK VOLUMES ARE
  THEN SEARCHED TO OBTAIN SPECIFIC INFORMATION ABOUT THE DATASETS. IF YOU SO
  SPECIFY,  THE SPACE ALLOCATIONS CAN BE CHANGED TO MAKE MORE EFFICIENT USE OF
  THE SPACE AVAILABLE.

  VSAM DATASETS ARE NOT CURRENTLY SUPPORTED BY THE SPACE MANAGEMENT
  UTILITY.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$SM  ');
4 * CHAR(8) INIT('VT$SM2  ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$SM2   0101-80016-80016-1622-00028-00028-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL --------------- ASM2 SPACE MANAGEMENT UTILITY   ------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                   ---------------------------------------------
                    | DISPLAYING DISK USAGE DATASET INFORMATION |
                    ---------------------------------------------
$
  TO DISPLAY DISK DATASET USAGE INFORMATION A&U$IS ENTERED IN THE&SELECT OPTION
 $FIELD.

  IF NO OTHER FIELDS ARE ENTERED,  ALL DISK DATASETS BEGINNING WITH THE
  REQUESTOR'S USERID ARE DISPLAYED.

  YOU MAY ALSO SELECT A SPECIFIC DATASET BY ENTERING DATASET NAME IN
  THE&NAME$FIELD. (NORMAL TSO NAMING CONVENTIONS APPLY.  ENCLOSE FULLY
  QUALIFIED DATASET NAMES IN SINGLE QUOTES)

  BY SPECIFYING AN&L$IN THE&TYPE OF NAME$FIELD,  AND ONE OR MORE INDEX LEVELS
  IN THE&NAME$FIELD, YOU CAN DISPLAY INFORMATION FOR ANY DISK DATASETS
  BEGINNING WITH THE SPECIFIED INDEX LEVEL(S).

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$SM  ');
4 * CHAR(8) INIT('VT$SM3  ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$SM3   0104-80015-80016-1618-00028-00015-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL --------------- ASM2 SPACE MANAGEMENT UTILITY   ------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     ---------------------------------------
                      | DISPLAYING DISK DATASET INFORMATION |
                      ---------------------------------------
$
  TO DISPLAY DISK DATASET SPACE INFORMATION A&BLANK$IS ENTERED IN THE&SELECT
  OPTION$FIELD.

  IF NO OTHER FIELDS ARE ENTERED,  ALL DISK DATASETS BEGINNING WITH THE
  REQUESTOR'S USERID ARE DISPLAYED.

  YOU MAY ALSO SELECT A SPECIFIC DATASET BY ENTERING DATASET NAME IN
  THE&NAME$FIELD. (NORMAL TSO NAMING CONVENTIONS APPLY.  ENCLOSE FULLY
  QUALIFIED DATASET NAMES IN SINGLE QUOTES)

  BY SPECIFYING AN&L$IN THE&TYPE OF NAME$FIELD,  AND ONE OR MORE INDEX LEVELS
  IN THE&NAME$FIELD, YOU CAN DISPLAY INFORMATION FOR ANY DISK DATASETS
  BEGINNING WITH THE SPECIFIED INDEX LEVEL(S).

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$SM  ');
4 * CHAR(8) INIT('VT$SM4  ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$SM4   0103-80015-80018-1246-00030-00015-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL --------------- ASM2 SPACE MANAGEMENT UTILITY   ------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     ------------------------------------
                      | COMPRESSING PARTITIONED DATASETS |
                      ------------------------------------
$
  A PARTITIONED DATASET MAY BE COMPRESSED IN TWO WAYS.

  THE COMPRESS OPTION&(C)$,  CAUSES THE NAMED DATASET TO BE COMPRESSED WITHOUT
  RELEASING UNUSED SPACE.  THE RELEASE OPTION&(R)$, CAN ALSO CAUSE P.D.S
  COMPRESSION IF A&Y$IS ENTERED IN THE&COMPRESS$FIELD.  (SEE 'RELEASING UNUSED
  SPACE').

  WHEN A DATASET IS COMPRESSED BY EITHER METHOD,  YOU HAVE THE OPTION OF FIRST
  MAKING A BACK UP COPY OF THE DATASET PRIOR TO THE COMPRESS.  THIS OPTION IS
  SELECTED BY CODING A&Y$IN THE&BACKUP$FIELD.  WHEN THIS IS DONE,  A COPY OF
  THE DATASET MADE UNDER A NEW NAME.  THE NEW NAME IS THE SAME AS THE OLD NAME,
  BUT AN INDEX LEVEL NAMED&BKUP$ IS INSERTED IMMEDIATELY BEFORE THE LAST
  QUALIFIER. FOR EXAMPLE:
          &TBD95XX.EDIT.DATA$ IS BACKED UP IN &TBD95XX.EDIT.BKUP.DATA$
  THE BACK UP DATASET IS DELETED UPON SUCCESSFULL COMPLETION OF THE COMPRESS.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$SM  ');
4 * CHAR(8) INIT('VT$SM5  ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$SM5   0104-80015-80016-1624-00029-00015-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL --------------- ASM2 SPACE MANAGEMENT UTILITY   ------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                             --------------------------
                              | RELEASING UNUSED SPACE |
                              --------------------------
$
  THE RELEASE OPTION&(R)$IS USED TO RELEASE UNUSED SPACE FROM SEQUENTIAL OR
  PARTIONED DATASETS.  YOU MAY ALSO SPECIFY A NUMBER OF TRACKS OF UNUSED SPACE
  TO BE SAVED BY ENTERING THE NUMBER IN THE&SAVE$FIELD.  EVEN IF YOU MAKE A
  MISTAKE IN THE 'SAVE' AMOUNT ASM2 WILL NEVER RELEASE USED SPACE.  IF THE
  DATASET IS ALLOCATED IN CYLINDERS, THE 'SAVE' AMOUNT IS ROUNDED UP TO THE
  NEAREST CYLINDER.

  THE NAME OF THE DATASET FOR WHICH SPACE IS TO BE RELEASED, IS ENTERED IN
  THE&NAME$FIELD.  (NORMAL TSO NAMING CONVENTIONS APPLY.  ENCLOSE FULLY
  QUALIFIED NAMES IN SINGLE QUOTES.)

  IN CONJUNCTION WITH THE RELEASE OPTION,  A P.D.S CAN ALSO
  BE COMPRESSED PRIOR TO SPACE RELEASE.  (SEE 'COMPRESSING
  PARTITIONED DATASETS').

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$SM  ');
4 * CHAR(8) INIT('VT$SM6  ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VT$SM6   0102-80015-80016-1625-00022-00015-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL --------------- ASM2 SPACE MANAGEMENT UTILITY   ------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&               ------------------------------------------------
                | RESETTING END-OF FILE ON SEQUENTIAL DATASETS |
                ------------------------------------------------
$
  OPTION&E$CAN BE USED TO WRITE AN END-OF-FILE AT THE BEGINNING OF A SEQUENTIAL
  DATASET.

  THE DATASET NAME TO BE RESET IS ENTERED IN THE&NAME$FIELD.  (NORMAL TSO
  NAMING CONVENTIONS APPLY.  ENCLOSE FULLY QUALIFIED NAMES IN SINGLE QUOTES.)

  IF A NON-SEQUENTIAL DATASET IS SPECIFIED,  THE RESET REQUEST IS IGNORED.

<ACTION>
1 SELECT CHAR(36) CURSOR;
3 * CHAR(8) INIT('VT$SM  ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTASM2   0103-80015-80015-1058-00033-00030-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------- ASM2 DISK SPACE MANAGEMENT UTILITIES ------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                  ----------------------------------------
                   | ASM2 UTILITIES - GENERAL INFORMATION |
                   ----------------------------------------
$
  THE ASM2 DISK MANAGEMENT SYSTEM FROM THE CAMBRIDGE SYSTEMS GROUP IS INTENDED
  TO SIMPLIFY THE MANAGEMENT OF DISK DATA IN MEDIUM AND LARGE SYSTEMS USING ANY
  OS OPERATING SYSTEM.   UTILITIES ARE PROVIDED TO ALLOW INSTALLATIONS TO MORE
  EASILY UTILIZE ALL THEIR STORAGE MEDIA.   THIS INCLUDES DISK,  TAPE, AND MASS
  STORAGE SYSTEMS.   ASM2  ALLOWS  EFFICIENT  AND  ECONOMICAL  USE  OF THE MOST
  EFFECTIVE MEDIUM. DISK IS USED FOR HIGH USE, QUICK ACCESS TO RELATIVELY SMALL
  AMOUNTS OF DATA.   MASS STORAGE  OR  TAPE  IS  UTILIZED FOR LOW USE AND LARGE
  VOLUME DATASETS.

  SEVERAL OF THE UTILITIES OF ASM2 ARE USER ORIENTED.  THESE ALLOW THE USER TO
  MAINTAIN BETTER CONTROL OF HIS DATA  ,  WHILE  PERMITTING  A  HIGH DEGREE OF
  TOTAL SYSTEM EFFICIENCY.

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &1$- ARCHIVE UTILITY FUNCTIONS
    &2$- BACK UP UTILITY FUNCTIONS
    &3$- SPACE MANAGEMENT UTILITY FUNCTIONS
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(   1   ,   2   ,   3   )
               RETURN(VT$AR  ,VT$BK  ,VT$SM  );
3 * CHAR(8) INIT('       ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('VT$AR   ');
<END>
./ ADD NAME=VTJTIP   0100-79269-79269-1311-00024-00024-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------------- JTIP UTILITY ------------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                    ----------------------------------
                     |         JTIP   UTILITY         |
                     ----------------------------------
$

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &1$- LISTING JOB NAMES/IDS VIA THE JTIP SHOW COMMAND
    &2$- LISTING A JOBS FETCH DATASET INFORMATION
    &3$- DELETING A JOBS OUTPUT
    &4$- REQUEUEING JOB OUTPUT FROM FETCH QUEUE TO SYSOUT QUEUE
    &5$- DISPLAYING JOB OUTPUT AT THE TERMINAL
    &6$- COPYING OUTPUT TO TEMPORARY DATASET AND BROWSE
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(   1   ,   2   ,   3   ,   4   ,   5   ,   6   )
               RETURN(VTJTIP1,VTJTIP2,VTJTIP3,VTJTIP4,VTJTIP5,VTJTIP6);
3 * CHAR(8) INIT('VTJTIP ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('VTJTIP1 ');
<END>
./ ADD NAME=VTJTIPB  0100-79269-79269-1311-00020-00020-00000-TYD9835 00
&TUTORIAL ------------------ JTIP UTILITY - DISPLAY ------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
$  THE&DISPLAY FETCH SYSOUT JOB$FUNCTION CAUSED A LISTING FOR THE SPECIFIED JOB
   TO BE DISPLAYED AT THE TERMINAL.  THE LISTING WAS PRODUCED VIA THE TSO FETCH
   COMMAND.

   THE SPF&BROWSE$FUNCTION WAS AUTOMATICALLY INVOKED TO DISPLAY THE
   JOB LISTING, AND ALL BROWSE OPTIONS MAY BE USED, INCLUDING
  &SCROLLING$AND THE&FIND$COMMAND.  USE THE&END$KEY TO TERMINATE THE
   BROWSE FUNCTION AND RETURN TO THE JTIP UTILITY MENU.

   IF YOU PRESS THE&ENTER$KEY NOW YOU WILL ENTER THE BROWSE TUTORIAL.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('TTUTOR  ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('TUB     ');
<END>
./ ADD NAME=VTJTIP1  0100-79269-79269-1311-00024-00024-00000-TYD9835 00
&TUTORIAL ----------- JTIP UTILITY - SHOW JOB NAMES / ID'S ------------ TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
   THE&SHOW JOBS$FUNCTION ( OPTION&L$) IS USED TO DISPLAY THE STATUS OF
   A JOB OR JOBS.

   FILL IN THE FOLLOWING FIELDS OF THE JTIP UTILITY MENU:
       - ENTER&L$IN THE SELECT OPTION FIELD.

   THE FOLLOWING RULES APPLY FOR THE&JOBNAME/JOBID$PARAMETER WHEN USED
   WITH THE&L$OPTION:

       -&JOBNAME/ID$= BLANK - ALL JOBS THAT HAVE JOB NAMES BEGINNING WITH
                              THE USER'S ID WILL BE DISPLAYED.
       -&JOBNAME$   = USERID + ONE CHARACTER - SAME AS BLANK.
       -&JOBNAME/ID$= ANYTHING ELSE - ONLY THE NAMED JOB WILL BE DISPLAYED.

<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTJTIP  ');
4 * CHAR(8) INIT('VTJTIP2 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTJTIP2  0100-79269-79269-1311-00017-00017-00000-TYD9835 00
&TUTORIAL ------------- JTIP UTILITY - SHOW FETCH INFO --------------  TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
   THE&SHOW FETCH$FUNCTION ( OPTION&S$) IS USED TO DISPLAY THE NUMBER OF
   LINES, COPIES, AND FORM TYPE FOR EACH SYSOUT DATASET OF A JOB IN THE
  &FETCH$QUEUE.

   FILL IN THE FOLLOWING FIELDS OF THE JTIP UTILITY MENU:
      - ENTER&S$IN THE SELECT OPTION FIELD.
      - ENTER A&JOBNAME$OR&JOBID.$ ONE OR THE OTHER MUST BE SPECIFIED.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTJTIP  ');
4 * CHAR(8) INIT('VTJTIP3 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTJTIP3  0100-79269-79269-1311-00016-00016-00000-TYD9835 00
&TUTORIAL ------------ JTIP UTILITY - DELETE JOB OUTPUT -------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
   THE&DELETE$FUNCTION ( OPTION&D$) IS USED TO DELETE THE OUTPUT OF A
   JOB IN THE&FETCH$QUEUE.

   FILL IN THE FOLLOWING FIELDS OF THE JTIP UTILITY MENU:
      - ENTER&D$IN THE SELECT OPTION FIELD.
      - ENTER A&JOBNAME$OR&JOBID.$ ONE OR THE OTHER MUST BE SPECIFIED.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTJTIP  ');
4 * CHAR(8) INIT('VTJTIP4 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTJTIP4  0100-79269-79269-1311-00018-00018-00000-TYD9835 00
&TUTORIAL ------------- JTIP UTILITY - ROUTE JOB OUTPUT -------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
   THE&ROUTE$FUNCTION ( OPTION&R$) IS USED TO ROUTE THE OUTPUT OF A JOB
   IN THE&FETCH$QUEUE TO THE SYSOUT QUEUE FOR NORMAL OUTPUT PROCESSING.
   ALL DATASETS FOR THE JOB WILL BE PRINTED TOGETHER, I.E., BETWEEN TWO
   BANNER PAGES.

   FILL IN THE FOLLOWING FIELDS OF THE JTIP UTILITY MENU:
      - ENTER&R$IN THE SELECT OPTION FIELD.
      - ENTER A&JOBNAME$OR&JOBID.$ ONE OR THE OTHER MUST BE SPECIFIED.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTJTIP  ');
4 * CHAR(8) INIT('VTJTIP5 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTJTIP5  0100-79269-79269-1311-00026-00026-00000-TYD9835 00
&TUTORIAL ------------ JTIP UTILITY - DISPLAY JOB OUTPUT ------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
   THE&DISPLAY$FUNCTION ( OPTION&O$) IS USED TO VIEW THE OUTPUT OF A JOB
   IN THE&FETCH$QUEUE AT THE TERMINAL. COLUMN NUMBERS MAY BE SPECIFIED.

   FILL IN THE FOLLOWING FIELDS OF THE JTIP UTILITY MENU:
      - ENTER&O$IN THE SELECT OPTION FIELD.
      - ENTER A&JOBNAME$OR&JOBID.$ ONE OR THE OTHER MUST BE SPECIFIED.

   THE FOLLOWING RULES APPLY FOR THE&DDNAME/DATASET ID$PARAMETERS WHEN
   USED WITH THE&O$OPTION:

      -&DDNAME$AND&DATASET ID$ARE MUTUALLY EXCLUSIVE. CHOSE ONE OR THE OTHER.

      -&DDNAME$    -  ENTER THE 1 TO 8 CHARACTER DDNAME TO BE DISPLAYED.
      -&DATASET ID$-  ENTER THE 1 TO 4 DIGIT NUMBER OF THE DATASET TO BE
                      DISPLAYED. THIS IS THE NUMBER UNDER THE&PN$HEADING
                      OBTAINED WITH THE&SHOW FETCH$FUNCTION ( OPTION&S$).
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTJTIP  ');
4 * CHAR(8) INIT('VTJTIP6 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTJTIP6  0100-79269-79269-1311-00027-00027-00000-TYD9835 00
&TUTORIAL ------------- JTIP UTILITY - FETCH AND BROWSE -------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
   THE&FETCH AND BROWSE$FUNCTION ( OPTION&BLANK$) IS USED TO VIEW THE OUTPUT
   OF A JOB IN THE&FETCH$QUEUE. JOB OUTPUT IS FETCHED TO A TEMPORARY DATASET
   AND CONTROL IS PASSEDTO SPF BROWSE. ANY OF THE BROWSE OPTIONS CAN BE USED.

   FILL IN THE FOLLOWING FIELDS OF THE JTIP UTILITY MENU:
      - ENTER&BLANK$IN THE SELECT OPTION FIELD.
      - ENTER A&JOBNAME$OR&JOBID.$ ONE OR THE OTHER MUST BE SPECIFIED.

   THE FOLLOWING RULES APPLY FOR THE&DDNAME/DATASET ID$PARAMETERS WHEN
   USED WITH THE&BLANK$OPTION:

      -&DDNAME$AND&DATASET ID$ARE MUTUALLY EXCLUSIVE. CHOSE ONE OR THE OTHER.

      -&DDNAME$    -  ENTER THE 1 TO 8 CHARACTER DDNAME TO BE DISPLAYED.
      -&DATASET ID$-  ENTER THE 1 TO 4 DIGIT NUMBER OF THE DATASET TO BE
                      DISPLAYED. THIS IS THE NUMBER UNDER THE&PN$HEADING
                      OBTAINED WITH THE&SHOW FETCH$FUNCTION ( OPTION&S$).
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTJTIP  ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTPAN    0105-79269-80102-1819-00036-00037-00000-$CSG05  00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                       --------------------------------
&                       |  PANVALET PROCESSING OPTION  |
&                       --------------------------------
&
$   THE PANVALET PROCESSING OPTION ALLOWS A PANVALET FUNCTION TO BE EXECUTED
$   UNDER SPF. THE PANVALET SELECTION MENU, WHICH IS DISPLAYED WHEN OPTION
$   &P$IS ENTERED ON THE PRIMARY OPTION MENU, ALLOWS YOU TO SELECT ONE OF
$   THE TEN PANVALET OPTIONS LISTED BELOW:
&
$THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
   & G$- PAN PROCESSING OPTION GENERAL INFORMATION
   & 0$- PAN EDIT
   & 1$- PAN ADD
   & 2$- PAN CHANGE
   & 3$- PAN COPY
   & 4$- PAN DISPLAY
   & 5$- PAN LISTDS
   & 6$- PAN PRINT
   & 7$- PAN RENAME
   & 8$- PAN RETRIEVE
   & 9$- PAN STORE
<ACTION>
 1 SELECT CHAR(36) INIT(' ')   CURSOR;
 2 SELECT CHAR(8)
          LIST   (G       ,0       ,1       ,2       ,3       ,4       ,
                  5       ,6       ,7       ,8       ,9       )
          RETURN (VTPAN00 ,VTPANE  ,VTPAN01 ,VTPAN02 ,VTPAN03 ,VTPAN04 ,
                  VTPAN05 ,VTPAN06 ,VTPAN07 ,VTPAN08 ,VTPAN09 );
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('TC      ');
 5 *      CHAR(8)  INIT('VTPAN00 ');
<END>
./ ADD NAME=VTPANE   0103-79296-79303-1211-00024-00024-00000-TYD9801 00
&TUTORIAL --------------------- PAN EDIT ------------------------------ TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
                    &----------------------------------&
                    &-            PAN EDIT            -&
                    &----------------------------------$

$PAN EDIT ALLOWS YOU TO MORE EASILY USE SPF EDIT TO MODIFY MEMBERS OF
 PANVALET LIBRARIES.

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &0$- GENERAL INTRODUCTION
    &1$- EDIT PANVALET MEMBER
    &2$- SAVE EDITED MEMBER VIA PAN STORE
    &3$- END PANVALET EDIT STATUS WITHOUT SAVE
    &4$- DISPLAY EDIT STATUS OF PANVALET MEMBER
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(   0   ,   1   ,   2   ,   3   ,   4   )
               RETURN(VTPANE0,VTPANE1,VTPANE2,VTPANE3,VTPANE4);
3 * CHAR(8) INIT('VTPAN   ');
4 * CHAR(8) INIT('VTSUBMT ');
5 * CHAR(8) INIT('VTPANE0 ');
<END>
./ ADD NAME=VTPANEX  0101-79296-79304-1727-00027-00027-00000-TYD9801 00
&TUTORIAL -------------- PAN EDIT - OWNERSHIP ------------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
&                    &-----------------------------------&
&                    &-            PAN EDIT             -&
&                    &-    MODULE OWNERSHIP CONCEPT     -&
&                    &-----------------------------------$
$
$ PAN EDIT USES AN OWNERSHIP CONCEPT TO CONTROL ACCESS TO PANVALET MEMBERS.
$ INITIALLY A PANVALET MEMBER IS 'UNOWNED' AFTER IT IS ADDED TO THE
$ PANVALET LIBRARY.  WHEN A MODULE IS RETRIEVED VIA PAN EDIT OR PAN
$ RETRIEVE, THE MODULE BECOMES 'OWNED' BY THAT TSO USER.  WHEN 'OWNED',
$ A MODULE CAN NOT BE UPDATED BY BATCH PANVALET.  ONLY THE 'OWNER' CAN
$ UPDATE IT VIA PAN EDIT 'SAVE' OR PAN STORE.
$
$ A MODULE RETRIEVED WHICH IS NOT 'TEST,ENABLED, AND ACTIVE' WILL NOT
$ BECOME 'OWNED' SINCE IT CANNOT BE STORED BACK ON THE PANVALET LIBRARY.
$
$ A MODULE IS CHANGED BACK TO 'UNOWNED' AFTER A SUCCESSFULL PAN STORE,
$ PAN EDIT SAVE, OR PAN EDIT END.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTPANE  ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTPANE0  0101-79296-79296-1528-00030-00030-00000-TYD9801 00
&TUTORIAL -------------- PAN EDIT - INTRODUCTION ---------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
                     &-----------------------------------&
                     &-            PAN EDIT             -&
                     &-       GENERAL INTRODUCTION      -&
                     &-----------------------------------$
$
$ PAN EDIT IS DESIGNED TO SIMPLIFY THE INTERFACE BETWEEN SPF EDIT AND
$ PANVALET.  NORMALLY YOU MUST RETRIEVE A MEMBER FROM THE PANVALET
$ LIBRARY INTO AN SPF DATASET,  AND THEN USE SPF EDIT TO MAKE CHANGES.
$ AFTER YOUR CHANGES ARE COMPLETE,  YOU MUST USE PANVALET 'STORE' TO
$ RETURN THE MODIFIED MEMBER TO PANVALET.  THESE OPERATIONS REQUIRE
$ SEVERAL STEPS AND ALSO REQUIRE MANUAL CO-ORDINATION TO PREVENT MORE
$ THAN ONE PERSON FROM WORKING ON THE SAME PANVALET MEMBER IN SEPARATE
$ SPF DATASETS.
$
$ PAN EDIT SIMPLIFIES THE OPERATION BY FURNISHING ADDITIONAL CHECKING
$ AND CONTROLS TO INSURE ONLY ONE PERSON IS EDITING A PANVALET MEMBER AT
$ A TIME.  IT SIMPLIFIES USAGE BY PERFORMING SEVERAL FUNCTIONS WITH
$ FEWER SCREENS.
$
                          $(CONTINUED ON NEXT PAGE)
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTPANE  ');
4 * CHAR(8) INIT('VTPANE1 ');
5 * CHAR(8) INIT('VTPANE01');
<END>
./ ADD NAME=VTPANE01 0104-79296-79304-1731-00028-00025-00000-TYD9801 00
&TUTORIAL -------------- PAN EDIT - INTRODUCTION ---------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
$ HERE ARE HIGHLIGHTS OF PAN EDIT FUNCTIONS:
$   1. FOR EDIT REQUESTS, A CHECK IS MADE TO SEE IF THE MEMBER HAS
$      ALREADY BEEN RETRIEVED BY ANOTHER MEMBER.
$
$   2. FOR EDIT REQUESTS,  A PAN RETRIEVE COMMAND IS EXECUTED AND THE
$      SPF EDIT DRIVER IS CALLED DIRECTLY FROM THE PAN EDIT SCREEN.
$
$   3. FOR EDIT REQUESTS, SPF COMPATABLE SEQUENCE NUMBERS, BANKERS AUDIT
$      TRAIL INFORMATION,  AND AN SPF COMPATABLE DIRECTORY ENTRY ARE
$      GENERATED FOR COBOL AND ASSEMBLER MEMBERS.
$
$   4. FOR SAVE REQUESTS,  THE PAN 'STORE' COMMAND IS EXECUTED, AND
$      THE SPF MEMBER IS DELETED FROM THE SPF LIBRARY.
$
$NOTES: PAN EDIT,  BATCH PANVALET,  AND PAN 'STORE' AND 'RETRIEVE'
$      PROCCESSING ARE COORDINATED.  IE. A BATCH UPDATE OR PAN RETRIEVE
$      IS NOT ALLOWED IF THE MODULE IS 'OWNED'.  A PAN 'STORE' IS NOT
$      ALLOWED UNLESS THE 'STORER' IS ALSO THE 'OWNER'.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTPANE0 ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTPANE1  0103-79296-79304-1732-00028-00030-00000-TYD9801 00
&TUTORIAL -------------- PAN EDIT - EDIT OPTION ----------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
&                    &-----------------------------------&
&                    &-            PAN EDIT             -&
&                    &-        OPTION ' ' - EDIT        -&
&                    &-----------------------------------$
$
$ THE EDIT FUNCTION PERFORMS THE FOLLOWING FUNCTIONS:
$   1. IF PAN MEMBER IS NOT CURRENTLY 'OWNED' BY A TSO USER,  IT IS
$      RETRIEVED INTO THE SPF DATASET SPECIFIED.  IF 'OWNED' BY THE TSO
$      USER ENTERING THE EDIT OPTION,  SPF EDIT IS CALLED WITHOUT A
$      RETRIEVE.  IF THE MEMBER IS OWNED BY ANOTHER TSO USER, THE EDIT
$      REQUEST IS DENIED;  THE MEMBER CANNOT BE RETRIEVED.
$
$   2. IF THE MEMBER IS COBOL OR ASSEMBLER,  AND IT IS NOT 'NOFORMAT',
$      THE SAME 'AUDIT TRAIL' CONSTANTS ARE INSERTED AS IN BATCH
$      PROCCESSING;  THE MODULE IS RESEQUENCED USING STANDARD SPF OR
$      COBOL SEQUENCE NUMBERS.
$
                           (CONTINUED ON NEXT PAGE)
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTPANE  ');
4 * CHAR(8) INIT('VTPANE2 ');
5 * CHAR(8) INIT('VTPANE11');
<END>
./ ADD NAME=VTPANE11 0103-79296-79304-1733-00026-00028-00000-TYD9801 00
&TUTORIAL -------------- PAN EDIT - EDIT OPTION ----------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
                     &-----------------------------------&
                     &-            PAN EDIT             -&
                     &-        OPTION ' ' - EDIT        -&
                     &-----------------------------------$
$
$   3. THE SPF DIRECTORY STATISTICS ARE INITIALIZED.  THE 'CREATION DATE'
$      IS SET TO THE 'DATE LAST MAINTAINED' FROM PANVALET.
$
$   4. IF THE MEMBER IS NOT 'TEST,ACTIVE,ENABLED' THE RETRIEVE IS DONE,
$      BUT THE MEMBER IS NOT 'OWNED';  NO SAVE (STORE) WILL BE ALLOWED.
$
$NOTES: YOU NEED SPECIFY ONLY THE SPF MEMBER OR THE PANVALET MEMBER ON
$      THE PAN EDIT MENU.  IF ONLY THE SPF MEMBER IS SPECIFIED,  THE PAN
$      MEMBER NAME IS DEFAULTED TO THE SAME NAME. IF ONLY THE PAN MEMBER
$      SPECIFIED,  THE SPF NAME IS DEFAULTED TO THE FIRST 8 CHARACTERS
$      OF THE PAN MEMBER NAME.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTPANE1 ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTPANE2  0101-79296-79296-1533-00026-00026-00000-TYD9801 00
&TUTORIAL -------------- PAN EDIT - SAVE OPTION ----------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
                     &-----------------------------------&
                     &-            PAN EDIT             -&
                     &-        OPTION 'S' - SAVE        -&
                     &-----------------------------------$
$
$ THE SAVE FUNCTION PERFORMS THE FOLLOWING FUNCTIONS:
$   1. IF PAN MEMBER IS CURRENTLY 'OWNED' BY THE TSO USER ISSUING THE
$      SAVE REQUEST,  PANVALET 'STORE' IS INVOKED TO STORE THE MEMBER
$      BACK ON THE PANVALET LIBRARY. IF THE MODULE IS NOT OWNED BY THE
$      REQUESTOR,  THE SAVE IS DISSALLOWED.
$
$   2. IF THE 'SAVED' MEMBER IS DELETED FROM THE SPF LIBRARY, AFTER
$      SUCCESSFULL 'STORE'.
$
$   3. THE MODULE IS MARKED AS 'NOT OWNED' SO ANOTHER USER MAY RETRIEVE
$      IT FOR EDIT.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTPANE  ');
4 * CHAR(8) INIT('VTPANE3 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTPANE3  0101-79296-79296-1535-00021-00021-00000-TYD9801 00
&TUTORIAL -------------- PAN EDIT - END OPTION ------------------------ TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
                     &-----------------------------------&
                     &-            PAN EDIT             -&
                     &-        OPTION 'E' - END         -&
                     &-----------------------------------$
$
$ THE END FUNCTION PERFORMS THE FOLLOWING FUNCTIONS:
$   1. IF PAN MEMBER IS CURRENTLY 'OWNED' BY THE TSO USER ISSUING THE
$      END REQUEST,  THE MODULE IS MARKED AS 'NOT OWNED'. IF THE MODULE
$      IS NOT OWNED BY THE REQUESTER,  NO ACTION IS PERFORMED.
$
$   2. THE MODULE IS LEFT ON THE SPF LIBRARY.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTPANE  ');
4 * CHAR(8) INIT('VTPANE4 ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTPANE4  0103-79296-79304-1735-00017-00017-00000-TYD9801 00
&TUTORIAL ------------ PAN EDIT - DISPLAY OPTION ---------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
&
                     &-----------------------------------&
                     &-            PAN EDIT             -&
                     &-      OPTION 'D' - DISPLAY       -&
                     &-----------------------------------$
$
$ THE DISPLAY FUNCTION PERFORMS THE FOLLOWING FUNCTION:
$   1. THE LAST ACTION PERFORMED USING PAN/TSO IS DISPLAYED.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('VTPANE  ');
4 * CHAR(8) INIT('VTPANE  ');
5 * CHAR(8) INIT('VTPAN01 ');
<END>
./ ADD NAME=VTPAN00  0102-79269-79303-1228-00038-00036-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                       ----------------------------------
&                       |  PANVALET GENERAL INFORMATION  |
&                       ----------------------------------
&
$   THE PANVALET PROCESSING OPTION USES THE TSO/PAN COMMAND TO PERFORM THE
$   FOLLOWING FUNCTIONS:
&
$             EDIT, ADD, CHANGE, COPY, DISPLAY,
$             LISTDS, PRINT, RENAME, RETRIEVE, AND STORE.
$
$   DISCUSSIONS OF THE INDIVIDUAL FUNCTIONS MAY BE OBTAINED BY SELECTED NUMBER:
$
   & 0$- PAN EDIT
   & 1$- PAN ADD
   & 2$- PAN CHANGE
   & 3$- PAN COPY
   & 4$- PAN DISPLAY
   & 5$- PAN LISTDS
   & 6$- PAN PRINT
   & 7$- PAN RENAME
   & 8$- PAN RETRIEVE
   & 9$- PAN STORE
&
<ACTION>
 1 SELECT CHAR(36) INIT(' ')   CURSOR;
 2 SELECT CHAR(8)
          LIST   (0       ,1       ,2       ,3       ,4       ,5       ,
                  6       ,7       ,8       ,9       )
          RETURN (VTPANE  ,VTPAN01 ,VTPAN02 ,VTPAN03 ,VTPAN04 ,VTPAN05 ,
                  VTPAN06 ,VTPAN07 ,VTPAN08 ,VTPAN09 );
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('VTPAN   ');
 5 *      CHAR(8)  INIT('VTPANE  ');
<END>
./ ADD NAME=VTPAN01  0101-79269-79303-1214-00029-00029-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                             ---------------------
&                             |  PAN ADD COMMAND  |
&                             ---------------------
&
$   A TSO PDS MEMBER OR SEQUENTIAL DSN MAY BE ADDED TO THE PANVALET LIBRARY.
$
$        SPECIFY: DDNAME   (NAME OF PANVALET LIBRARY  EG. PAN3912)
$                 PANNAME  (NEW PANVALET MEMBER NAME TO BE ADDED)
$                 FORMAT   (ASM, COBOL, DATA, FORT, PL1, OBJ, OTHER, JCL)
$
$                 PROJECT-LIBRARY-TYPE-MEMBER (NORMAL SPF DATASET NAME FORMAT)
$
$                 DSNAME   (NON SPF SEQUENTIAL OR PARTITIONED DATASET)
$
$                 USER     (OPTIONAL USER CODE OF THE PANVALET MEMBER)
$                 CONTROL  (CONTROL CODE OF THE PANVALET LIBRARY)
$                 INT FMT  (INTERNAL FORMAT - TSO, PANVALET, OR NOFORMAT)
$                 DISP     (DISPOSITION OF FROM DATASET, KEEP OR DELETE)
&
<ACTION>
 1 SELECT CHAR(36) INIT(' ')         CURSOR;
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('VTPANE  ');
 5 *      CHAR(8)  INIT('VTPAN02 ');
<END>
./ ADD NAME=VTPAN02  0100-79269-79269-1311-00029-00029-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                           ------------------------
&                           |  PAN CHANGE COMMAND  |
&                           ------------------------
&
$   INDIVIDUAL PANVALET DATASET ATTRIBUTES MAY BE APPLIED, ALTERED OR REMOVED.
$   ONLY ONE ATTRIBUTE MAY BE CHANGED AT A TIME.
$
$        SPECIFY: DDNAME   (NAME OF PANVALET LIBRARY  EG. PAN3912)
$                 PANNAME  (NAME OF PANVALET MEMBER)
$
$                 STATUS   (TEST/PROD ENABLED/DISABLED ACTIVE/INACTIVE)
$                 COMMENT  (50 BYTE COMMENT FIELD. MUST BE IN QUOTES)
$                 USER     (CHANGE USER CODE AND/OR SECURITY LEVEL)
$                 LEVEL    (CHANGE LEVEL OF PANVALET MEMBER)
$
$                 ACCESS   (ACCESS CODE OF THE PANVELET MEMBER)
$                 CONTROL  (CONTROL CODE OF THE PANVALET LIBRARY)
$
&
<ACTION>
 1 SELECT CHAR(36) INIT(' ')         CURSOR;
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('VTPAN01 ');
 5 *      CHAR(8)  INIT('VTPAN03 ');
<END>
./ ADD NAME=VTPAN03  0100-79269-79269-1311-00024-00024-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                            ----------------------
&                            |  PAN COPY COMMAND  |
&                            ----------------------
&
$   THE COPY FUNCTION CREATES A DUPLICATE MEMBER ON THE PANVALET LIBRARY GIVING
$   A NEW NAME AND PLACING THE COPY IN TEST, ENABLE STATUS.
$
$        SPECIFY:   DDNAME   (NAME OF PANVALET LIBRARY EG. PAN3912)
$              FROM PANNAME  (NAME OF PANVALET MEMBER TO BE COPIED)
$                TO NEWNAME  (NEW PANVALET MEMBER TO BE COPIED TO)
$
$                   ACCESS   (ACCESS CODE OF THE PANVALET MEMBER)
$                   CONTROL  (CONTROL CODE OF THE PANVALET LIBRARY)
&
<ACTION>
 1 SELECT CHAR(36) INIT(' ')         CURSOR;
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('VTPAN02 ');
 5 *      CHAR(8)  INIT('VTPAN04 ');
<END>
./ ADD NAME=VTPAN04  0102-79269-79303-1229-00025-00024-00000-TYD9801 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                           -------------------------
&                           |  PAN DISPLAY COMMAND  |
&                           -------------------------
&
$   A PANVALET MEMBER MAY BE DISPLAYED FROM THE PANVALET LIBRARY.
$
$        SPECIFY: DDNAME   (NAME OF PANVALET LIBRARY   EG. PAN3912)
$                 PANNAME  (NAME OF PANVALET MEMBER TO BE DISPLAYED)
$
$                 ACCESS   (ACCESS CODE OF THE PANVALET MEMBER)
$                 EXPAND   (OPTIONAL REQUEST TO EXPAND IMBEDDED ++INCLUDE
$                           STATEMENTS DURING DISPLAY. DEFAULT IS NOEXPAND)
&
<ACTION>
 1 SELECT CHAR(36) INIT(' ')         CURSOR;
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('VTPAN03 ');
 5 *      CHAR(8)  INIT('VTPAN05 ');
<END>
* THE FOLLOWING PARAMETER IS NOT USED BY THE PANDSPLY PROGRAM.
$                 SEQ2     (OPTIONAL ENDING LINE NUMBER TO BE DISPLAYED)
./ ADD NAME=VTPAN05  0100-79269-79269-1311-00024-00024-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                           ------------------------
&                           |  PAN LISTDS COMMAND  |
&                           ------------------------
&
$   THE ATTRIBUTES (DIRECTORY LISTING) OF A PANVALET MEMBER MAY BE DISPLAYED.
$
$        SPECIFY: DDNAME   (NAME OF PANVALET LIBRARY   EG. PAN3912)
$                 PANNAME  (NAME OF PANVALET MAMBER)
$
$                 ACCESS   (ACCESS CODE OF THE PANVALET MEMBER)
$                 CONTROL  (CONTROL CODE OF THE PANVALET LIBRARY)
$                 COMMENT  (COMMENTS ARE LISTED BY DEFAULT. CLEAR
$                           'COMMENT' TO NOT SHOW COMMENTS)
&
<ACTION>
 1 SELECT CHAR(36) INIT(' ')         CURSOR;
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('VTPAN04 ');
 5 *      CHAR(8)  INIT('VTPAN06 ');
<END>
./ ADD NAME=VTPAN06  0100-79269-79269-1311-00027-00027-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                            -----------------------
&                            |  PAN PRINT COMMAND  |
&                            -----------------------
&
$   PRODUCES A SELECTIVE DIRECTORY LIST OF THE PANVALET LIBRARY.  ENTER ONLY
$   ONE SELECTION CRITERION PER EXECUTION
$
$        SPECIFY: DDNAME  (NAME OF PANVALET LIBRARY  EG. PAN3912)
$
$                 NAME    (LIST MEMBERS BEGINNING WITH THIS STRING)
$                 STATUS  (ONLY LIST MEMBERS WITH THIS STATUS)
$                 TYPE    (ASM, COBOL, DATA, FORT, PLI, OBJ, JCL, OTHER)
$                 USER    (ONLY LIST MEMBERS WITH THIS USER CODE)
$
$                 CONTROL (CONTROL CODE OF THE PANVALET LIBRARY)
$                 COMMENT (OPTIONALY DISPLAY USER COMMENTS)
&
<ACTION>
 1 SELECT CHAR(36) INIT(' ')         CURSOR;
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('VTPAN05 ');
 5 *      CHAR(8)  INIT('VTPAN07 ');
<END>
./ ADD NAME=VTPAN07  0100-79269-79269-1311-00023-00023-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                           ------------------------
&                           |  PAN RENAME COMMAND  |
&                           ------------------------
&
$   CHANGE THE NAME OF A PANVALET LIBRARY MEMBER.
$
$        SPECIFY:   DDNAME  (NAME OF PANVALET LIBRARY  EG. PAN3912)
$              FROM PANNAME (OLD NAME OF PANVALET MEMBER)
$                TO NEWNAME (NEW NAME OF PANVALET MEMBER)
$
$                   ACCESS  (ACCESS CODE OF THE PANVALET MEMBER)
$                   CONTROL (CONTROL CODE OF THE PANVALET LIBRARY)
&
<ACTION>
 1 SELECT CHAR(36) INIT(' ')         CURSOR;
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('VTPAN06 ');
 5 *      CHAR(8)  INIT('VTPAN08 ');
<END>
./ ADD NAME=VTPAN08  0100-79269-79269-1311-00031-00031-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                          --------------------------
&                          |  PAN RETRIEVE COMMAND  |
&                          --------------------------
&
$   A PANVALET LIBRARY MEMBER MAY BE RETRIEVED INTO A TSO PDS MEMBER,
$   OR A SEQUENTIAL DATASET.
$
$
$        SPECIFY: DDNAME  (NAME OF PANVALET LIBRARY)
$                 PANNAME (NAME OF PANVALET MEMBER TO BE RETRIEVED)
$                 EXPAND  (OPTIONAL REQUEST TO EXPAND IMBEDDED ++INCLUDE
$                          STATEMENTS DURING RETRIEVE. DEFAULT IS NOEXPAND)
$
$                 PROJECT-LIBRARY-TYPE-MEMBER  (NORMAL SPF DATASET NAME FORMAT)
$
$                 DSNAME  (NON SPF SEQUENTIAL OR PARTITIONED DATASET)
$
$                 ACCESS  (ACCESS CODE OF THE PANVALET MEMBER)
$                 CONTROL (CONTROL CODE OF THE PANVALET LIBRARY)
$                 INT FMT (INTERNAL FORMAT - TSO,PANVALET, OR NOFORMAT)
&
<ACTION>
 1 SELECT CHAR(36) INIT(' ')         CURSOR;
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('VTPAN07 ');
 5 *      CHAR(8)  INIT('VTPAN09 ');
<END>
./ ADD NAME=VTPAN09  0100-79269-79269-1311-00030-00030-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL ---------------  PANVALET PROCESSING OPTION  --------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&                            -----------------------
&                            |  PAN STORE COMMAND  |
&                            -----------------------
&
$   A PANVALET LIBRARY MEMBER MAY BE REPLACED USING A TSO PDS MEMBER,
$   OR A SEQUENTIAL DATASET.
$
$        SPECIFY: DDNAME  (NAME OF PANVALET LIBRARY  EG. PAN3912)
$                 PANNAME (NAME OF PANVALET MEMBER TO BE UPDATED)
$                 LEVEL   (CURRENT LEVEL OF THIS MEMBER)
$
$                 PROJECT-LIBRARY-TYPE-MEMBER  (NORMAL SPF DATASET NAME FORMAT)
$
$                 DSNAME  (NON SPF SEQUENTIAL OR PARTITIONED DATASET)
$
$                 ACCESS  (ACCESS CODE OF THE PANVALET MEMBER)
$                 CONTROL (CONTROL CODE OF THE PANVALET LIBRARY)
$                 INT FMT (INTERNAL FORMAT - TSO, PANVALET, OR NOFORMAT)
$                 DISP    (DISPOSITION OF FROM DATASET, KEEP OR DELETE)
&
<ACTION>
 1 SELECT CHAR(36) INIT(' ')         CURSOR;
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('VTPAN08 ');
 5 *      CHAR(8)  INIT('VTPAN00 ');
<END>
./ ADD NAME=VTSUBMT  0101-79269-79271-1201-00027-00027-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL--------------  SUBMIT PROCESSING OPTION  ------------------   TUTORIAL
&NEXT SELECTION ===>%SELECT                             &(OR PRESS PF1 FOR HELP)
&
&
&
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
&         * * $                                                 & * *
&         * * $                                                 & * *
&         * * $         THE TUTORIAL THAT WAS SELECTED          & * *
&         * * $         IS CURRENTLY IN DEVELOPMENT.            & * *
&         * * $                                                 & * *
&         * * $                                                 & * *
&         * * $      PRESS&(PF3)$TO DISPLAY PRIMARY MENU        & * *
&         * * $                     OR                          & * *
&         * * $    PRESS&(ENTER)$ TO DISPLAY TUTORIAL MENU      & * *
&         * * $                                                 & * *
&         * * $                                                 & * *
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
&         * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
<ACTION>
 1 SELECT CHAR(36) INIT(' ')         CURSOR;
 3 *      CHAR(8)  INIT('TTUTOR  ');
 4 *      CHAR(8)  INIT('TTUTOR  ');
 5 *      CHAR(8)  INIT('TTUTOR  ');
<END>
./ ADD NAME=VTU      0100-79269-79269-1311-00066-00066-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL ------------------------ UTILITIES -------------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     -----------------------------------
&                     |            UTILITIES            |
                      -----------------------------------
$  THE&UTILITY$OPTION ALLOWS YOU TO SELECT ONE OF NINE UTILITIES LISTED BELOW.
   TO SELECT A UTILITY, ENTER A NUMBER FROM 1 TO 9 ON THE UTILITY SELECTION
   MENU, WHICH IS DISPLAYED WHEN OPTION 3 IS ENTERED ON THE PRIMARY OPTION MENU.

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &1$- LIBRARY UTILITIES......PRINT INDEX OR ENTIRE DATA SET; PRINT, RENAME,
                                OR DELETE MEMBER; COMPRESS DATA SET
    &2$- DATA SET UTILITIES.....ALLOCATE, RENAME, DELETE, CATALOG, OR UNCATALOG
                                DATA SET; DISPLAY DATA SET INFORMATION
    &3$- MOVE/COPY UTILITY......MOVE OR COPY MEMBERS OR DATA SETS
    &4$- CATALOG MANAGEMENT.....DISPLAY OR PRINT CATALOG ENTRIES;
                                INITIALIZE OR DELETE PROJECT CATALOG POINTER
    &5$- RESET SPF STATISTICS...RESET SOURCE MEMBER STATISTICS
    &6$- HARDCOPY UTILITY.......INITIATE HARDCOPY OUTPUT
    &7$- VTOC UTILITY...........DISPLAY OR PRINT A DASD VTOC
    &8$- OUTLIST UTILITY........BROWSE, DELETE, OR PRINT HELD JOB OUTPUT
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(1  ,2  ,3   ,4   ,5  ,6  ,7  ,8   ,9)
               RETURN(TUL,TUD,TUMC,TUCM,TUR,TUH,TUV,TUOL,VTNOTSUP);
3 * CHAR(8) INIT('TTUTOR  ');
4 * CHAR(8) INIT('TP      ');
5 * CHAR(8) INIT('TUL     ');
<END>
***
*** ORGINAL STATEMENTS
***
<FIELDS>¬%!&$#@
&TUTORIAL ------------------------ UTILITIES -------------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     -----------------------------------
&                     |            UTILITIES            |
                      -----------------------------------
$  THE&UTILITY$OPTION ALLOWS YOU TO SELECT ONE OF NINE UTILITIES LISTED BELOW.
   TO SELECT A UTILITY, ENTER A NUMBER FROM 1 TO 9 ON THE UTILITY SELECTION
   MENU, WHICH IS DISPLAYED WHEN OPTION 3 IS ENTERED ON THE PRIMARY OPTION MENU.

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &1$- LIBRARY UTILITIES......PRINT INDEX OR ENTIRE DATA SET; PRINT, RENAME,
                                OR DELETE MEMBER; COMPRESS DATA SET
    &2$- DATA SET UTILITIES.....ALLOCATE, RENAME, DELETE, CATALOG, OR UNCATALOG
                                DATA SET; DISPLAY DATA SET INFORMATION
    &3$- MOVE/COPY UTILITY......MOVE OR COPY MEMBERS OR DATA SETS
    &4$- CATALOG MANAGEMENT.....DISPLAY OR PRINT CATALOG ENTRIES;
                                INITIALIZE OR DELETE PROJECT CATALOG POINTER
    &5$- RESET SPF STATISTICS...RESET SOURCE MEMBER STATISTICS
    &6$- HARDCOPY UTILITY.......INITIATE HARDCOPY OUTPUT
    &7$- VTOC UTILITY...........DISPLAY OR PRINT A DASD VTOC
    &8$- OUTLIST UTILITY........BROWSE, DELETE, OR PRINT HELD JOB OUTPUT
    &9$- SCRIPT/VS UTILITY......FORMAT, DISPLAY, AND PRINT SCRIPT TEXT
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(1  ,2  ,3   ,4   ,5  ,6  ,7  ,8   ,9)
               RETURN(TUL,TUD,TUMC,TUCM,TUR,TUH,TUV,TUOL,TUS);
3 * CHAR(8) INIT('TTUTOR  ');
4 * CHAR(8) INIT('TP      ');
5 * CHAR(8) INIT('TUL     ');
<END>
./ ADD NAME=VTUOL    0100-80022-80022-1656-00025-00025-00000-TYD9835 00
<FIELDS>¬%!&$#@
&TUTORIAL --------------------- OUTLIST UTILITY ----------------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
&                     -----------------------------------
                      |            UTILITIES            |
                      |         OUTLIST UTILITY         |
                      -----------------------------------
$
   YOU MAY SELECT THE OUTLIST UTILITY BY:
       - SELECTING OPTION&C$FROM THE&PRIMARY OPTION MENU

 THE FOLLOWING TOPICS ARE PRESENTED IN SEQUENCE, OR MAY BE SELECTED BY NUMBER:
    &1$- LISTING THE STATUS OF JOBS
    &2$- DELETING THE OUTPUT OF A HELD JOB
    &3$- PRINTING THE OUTPUT OF A HELD JOB
    &4$- DISPLAYING THE OUTPUT OF A HELD JOB
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(1       ,2       ,3       ,4       )
               RETURN(VTUOL01L,VTUOL01D,VTUOL01P,VTUOL01B);
3 * CHAR(8) INIT('TU      ');
4 * CHAR(8) INIT('TUS     ');
5 * CHAR(8) INIT('VTUOL01L');
<END>
./ ADD NAME=VTUOLB
&TUTORIAL ----------------- OUTLIST UTILITY - DISPLAY ----------------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
$  THE&DISPLAY HELD SYSOUT JOB$FUNCTION CAUSED A LISTING FOR THE SPECIFIED JOB
   TO BE DISPLAYED AT THE TERMINAL.  THE LISTING WAS PRODUCED VIA THE TSO OUTPUT
   COMMAND.

   THE SPF&BROWSE$FUNCTION WAS AUTOMATICALLY INVOKED TO DISPLAY THE
   JOB LISTING, AND ALL BROWSE OPTIONS MAY BE USED, INCLUDING
  &SCROLLING$AND THE&FIND$COMMAND.  USE THE&END$KEY TO TERMINATE THE
   BROWSE FUNCTION AND RETURN TO THE OUTLIST UTILITY MENU.

   IF YOU PRESS THE&ENTER$KEY NOW YOU WILL ENTER THE BROWSE TUTORIAL.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('TTUTOR  ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('TUB     ');
<END>
./ ADD NAME=VTUOL01B
&TUTORIAL ------------- OUTLIST UTILITY - DISPLAY JOB OUTPUT ---------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
$  THE&DISPLAY JOB OUTPUT$FUNCTION IS USED TO BROWSE OUTPUT FROM A HELD SYSOUT
   QUEUE FOR A PARTICULAR JOB.  FOR MVS, THE DATA IS NOT DELETED FROM THE HELD
   SYSOUT QUEUE.  HOWEVER, FOR SVS, THE DATA IS ALWAYS DELETED.  FOR THIS
   REASON, IN THE SVS CASE, AFTER COMPLETION OF THE BROWSE FUNCTION, THE OUTLIST
   PRINT MENU WILL BE AUTOMATICALLY DISPLAYED.
   (USE THE&LIST JOB$OPTION IF YOU WISH TO OBTAIN THE NAMES AND ID'S (MVS ONLY)
   OF CURRENTLY HELD JOBS)

   FILL IN THE FOLLOWING FIELDS OF THE OUTLIST UTILITY MENU:
       - ENTER&BLANK$IN THE SELECT OPTION FIELD
       - ENTER THE&JOB NAME$IN THE APPROPRIATE FIELD
       - ENTER THE&CLASS$IN THE APPROPRIATE FIELD
       - ENTER THE&JOB ID$IN THE APPROPRIATE FIELD (MVS ONLY)
           (THIS IS REQUIRED ONLY IF DUPLICATE JOBNAMES EXIST IN THE HELD
           SYSOUT CLASS)

   AFTER PRESSING THE&ENTER$KEY, THE DATA WILL BE DISPLAYED AND THE USER
   WILL BE IN BROWSE MODE. ANY OF THE BROWSE OPTIONS CAN BE INVOKED.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('TUOL    ');
4 * CHAR(8) INIT('        ');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTUOL01D 0100-80022-80022-1657-00022-00022-00000-TYD9835 00
&TUTORIAL ------------- OUTLIST UTILITY - DELETE JOB OUTPUT ----------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
   THE&DELETE JOB OUTPUT$FUNCTION IS USED TO DELETE OUTPUT FROM A HELD SYSOUT
   QUEUE FOR A PARTICULAR JOB.
   (USE THE&LIST JOB$OPTION IF YOU WISH TO OBTAIN THE NAMES AND IDS (MVS ONLY)
   OF CURRENTLY HELD JOBS)

   FILL IN THE FOLLOWING FIELDS OF THE OUTLIST UTILITY MENU:
       - ENTER&D$IN THE SELECT OPTION FIELD
       - ENTER THE&JOB NAME$IN THE APPROPRIATE FIELD
       - ENTER THE&CLASS$IN THE APPROPRIATE FIELD
       - ENTER THE&JOB ID$IN THE APPROPRIATE FIELD (MVS ONLY)
           (THIS IS REQUIRED ONLY IF DUPLICATE JOBNAMES EXIST IN THE HELD
           SYSOUT CLASS)
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('TUOL    ');
4 * CHAR(8) INIT('VTUOL01P');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTUOL01L 0100-80022-80022-1658-00030-00030-00000-TYD9835 00
&TUTORIAL --------- OUTLIST UTILITY - LIST JOB NAMES / ID'S ----------- TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
   THE&LIST JOBS$FUNCTION IS USED TO OBTAIN STATUS INFORMATION ON JOBS IN
   YOUR SYSTEM.

   FILL IN THE FOLLOWING FIELDS OF THE OUTLIST UTILITY MENU:
       - ENTER&L$IN THE SELECT OPTION FIELD

   THE&JOBNAME$PARAMETER IS HANDLED AS FOLLOWS:

       -&JOBNAME$= BLANK - STATUS IS LISTED FOR ALL JOBS HAVING JOBNAMES
                           CONSISTING OF YOUR USER ID FOLLOWED BY ONE CHARACTER.

       -&JOBNAME$= USERID + ONE CHARACTER - STATUS IS LISTED FOR ALL JOBS HAVING
                                            JOBNAMES CONSISTING OF YOUR USER ID
                                            FOLLOWED BY ONE CHARACTER.

       -&JOBNAME$= ANYTHING ELSE - STATUS IS LISTED FOR THE JOBNAME SPECIFIED.

   THE JOB NAMES WILL BE DISPLAYED ON THE LOWER PART OF THE MENU. IF THE LIST
   IS TOO LONG TO FIT ON THE SCREEN,&***$WILL BE WRITTEN AS THE LAST LINE.
   BY PRESSING THE&ENTER$KEY THE NEXT PAGE OF DATA WILL BE DISPLAYED.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('TUOL    ');
4 * CHAR(8) INIT('VTUOL01D');
5 * CHAR(8) INIT('        ');
<END>
./ ADD NAME=VTUOL01P 0100-80022-80022-1658-00025-00025-00000-TYD9835 00
&TUTORIAL ------------- OUTLIST UTILITY - PRINT JOB OUTPUT ------------ TUTORIAL
&NEXT SELECTION ===>%SELECT                             &
$
$  THE&PRINT JOB OUTPUT$FUNCTION IS USED TO PRINT OUTPUT FROM A HELD SYSOUT
   QUEUE FOR A PARTICULAR JOB.  THE DATA IS AUTOMATICALLY DELETED FROM THE HELD
   SYSOUT QUEUE WHENEVER THIS FUNCTION IS SELECTED.
   (USE THE&LIST JOB$OPTION IF YOU WISH TO OBTAIN THE NAMES AND IDS (MVS ONLY)
   OF CURRENTLY HELD JOBS)

   FILL IN THE FOLLOWING FIELDS OF THE OUTLIST UTILITY MENU:
       - ENTER&P$IN THE SELECT OPTION FIELD
       - ENTER THE&JOB NAME$IN THE APPROPRIATE FIELD
       - ENTER THE&CLASS$IN THE APPROPRIATE FIELD
       - ENTER THE&JOB ID$IN THE APPROPRIATE FIELD (MVS ONLY)
           (THIS IS REQUIRED ONLY IF DUPLICATE JOBNAMES EXIST IN THE
           HELD SYSOUT CLASS)

                           (CONTINUED ON NEXT PAGE)
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8) LIST(' ') RETURN(' ');
3 * CHAR(8) INIT('TUOL    ');
4 * CHAR(8) INIT('VTUOL01R');
5 * CHAR(8) INIT('TUOL01P1');
<END>
./ ADD NAME=VUAA     0101-79269-80022-1511-00042-00087-00000-TYD9835 00
&------------------------  ALLOCATE NEW DATASET  -------------------------------
$DATASET NAME:#DSN                                         $
$
$   VOLUME SERIAL   &===>%VOL   $     (BLANK FOR AUTHORIZED DEFAULT VOLUME)
$   SPACE UNITS     &===>%SPCU      $ (BLKS, TRKS OR CYLS)
$   PRIMARY QUAN    &===>%PRIQ $      (IN ABOVE UNITS)
$   SECONDARY QUAN  &===>%SECQ $      (IN ABOVE UNITS)
$   DIRECTORY BLOCKS&===>%DIRB $      (ZERO FOR SEQUENTIAL DATASET)
$   RECORD FORMAT   &===>%RECFM $
$   RECORD LENGTH   &===>%LRECL$
$   BLOCK SIZE      &===>%BLKSZ$
<ACTION>
 1 DSN     CHAR(44)  INIT($PARM1) NOCURSOR GENHELP(TUDA);
 2 VOL     CHAR(8)   INIT($PARM2) CURSOR;
 3 SPCU    CHAR(10)  INIT($PARM3) NOCURSOR
           LIST  (CYLS     , TRKS  , BLKS  ,
                  CYLINDERS, TRACKS, BLOCKS,
                  CYLINDER , TRACK , BLOCK ,
                  CYL      , TRK   , BLK   ,
                  C        , T     , B     ,' ',*)
           RETURN(CYLINDER , TRACK , BLOCK ,
                  CYLINDER , TRACK , BLOCK ,
                  CYLINDER , TRACK , BLOCK ,
                  CYLINDER , TRACK , BLOCK ,
                  CYLINDER , TRACK , BLOCK ,' ',' ');
 4 PRIQ    FIXED(31) INIT($PARM4) NOCURSOR
           LIST  (0  ,' ',*)
           RETURN(0  ,0  );
 5 SECQ    FIXED(31) INIT($PARM5) NOCURSOR
           LIST  (0  ,' ',*)
           RETURN(0  ,0  );
 6 DIRB    FIXED(31) INIT($PARM6) NOCURSOR
           LIST  (0  ,' ',*)
           RETURN(0  ,0  );
 7 RECFM   CHAR(6)   INIT($PARM7) NOCURSOR;
 8 LRECL   FIXED(16) INIT($PARM8) NOCURSOR
           LIST  (0  ,' ',*)
           RETURN(0  ,0  );
 9 BLKSZ   FIXED(16) INIT($PARM9) NOCURSOR
           LIST  (0  ,' ',*)
           RETURN(0  ,0  );
<END>
./ ADD NAME=VUDA1    0100-79269-79269-1311-00079-00079-00000-TYD9835 00
&----------------------------  LIBRARY UTILITY  --------------------------------
&SELECT OPTION ===>%CODE                                                       $
&
&   C$- COMPRESS DATASET                   &P$- PRINT MEMBER
&   X$- PRINT INDEX LISTING                &R$- RENAME MEMBER
&   L$- PRINT ENTIRE DATASET               &D$- DELETE MEMBER
&   BLANK$- DISPLAY MEMBER LIST            &B$- BROWSE MEMBER
$
$SPF LIBRARY DATASET:
$   PROJECT&===>%PROJECT $
$   LIBRARY&===>%LIBRARY $
$   TYPE   &===>%TYPE    $
$   MEMBER &===>%MEMBER  $ (IF OPTION "P", "R", "D", OR "B" SELECTED)
$   NEWNAME&===>%NEWNAME $ (IF OPTION "R" SELECTED)
$
$OTHER PARTITIONED OR SEQUENTIAL DATASET:
$   DATASET NAME &===>%DSN                                                     $
$   VOLUME SERIAL&===>%VOL   $  (IF NOT CATALOGED)
$
$DATASET PASSWORD&===>¬PSWD    $(IF PASSWORD PROTECTED)
<ACTION>
 1 CODE    CHAR(1)  INIT($PARM1) CURSOR   GENHELP(TUL)
           LIST  (C,L,X,P,R,D,B,' ',*)
           RETURN(Z,L,X,P,R,D,B,M  ,?);
 2 PROJECT CHAR(8)  INIT($PARM2) NOCURSOR;
 3 LIBRARY CHAR(8)  INIT($PARM3) NOCURSOR;
 4 TYPE    CHAR(8)  INIT($PARM4) NOCURSOR;
 5 DSN     CHAR(56) INIT($PARM5) NOCURSOR;
 6 VOL     CHAR(6)  INIT($PARM6) NOCURSOR;
 7 PSWD    CHAR(8)  INIT($PARM7) NOCURSOR;
 8 MEMBER  CHAR(8)  INIT($PARM8) NOCURSOR;
 9 NEWNAME CHAR(8)  INIT($PARM9) NOCURSOR;
10 *       CHAR(8)  INIT('SPFCOPY '); - COMPRESS PGM NAME IF NOT IEBCOPY
11 *       CHAR(8)  INIT('PPRINTED'); - PRINT MEMBER OPT/RESPONSE
12 *       CHAR(8)  INIT('RRENAMED'); - RENAME MEMBER OPT/RESPONSE
13 *       CHAR(8)  INIT('DDELETED'); - DELETE MEMBER OPT/RESPONSE
14 *       CHAR(8)  INIT('B       '); - BROWSE MEMBER OPT/RESPONSE
<END>
***
*** ORGINAL STATEMENTS
***
&----------------------------  LIBRARY UTILITY  --------------------------------
&SELECT OPTION ===>%CODE                                                       $
&
&   C$- COMPRESS DATASET                   &P$- PRINT MEMBER
&   X$- PRINT INDEX LISTING                &R$- RENAME MEMBER
&   L$- PRINT ENTIRE DATASET               &D$- DELETE MEMBER
&   BLANK$- DISPLAY MEMBER LIST            &B$- BROWSE MEMBER
$
$SPF LIBRARY DATASET:
$   PROJECT&===>%PROJECT $
$   LIBRARY&===>%LIBRARY $
$   TYPE   &===>%TYPE    $
$   MEMBER &===>%MEMBER  $ (IF OPTION "P", "R", "D", OR "B" SELECTED)
$   NEWNAME&===>%NEWNAME $ (IF OPTION "R" SELECTED)
$
$OTHER PARTITIONED OR SEQUENTIAL DATASET:
$   DATASET NAME &===>%DSN                                                     $
$   VOLUME SERIAL&===>%VOL   $  (IF NOT CATALOGED)
$
$DATASET PASSWORD&===>¬PSWD    $(IF PASSWORD PROTECTED)
<ACTION>
 1 CODE    CHAR(1)  INIT($PARM1) CURSOR   GENHELP(TUL)
           LIST  (C,L,X,P,R,D,B,' ',*)
           RETURN(Z,L,X,P,R,D,B,M  ,?);
 2 PROJECT CHAR(8)  INIT($PARM2) NOCURSOR;
 3 LIBRARY CHAR(8)  INIT($PARM3) NOCURSOR;
 4 TYPE    CHAR(8)  INIT($PARM4) NOCURSOR;
 5 DSN     CHAR(56) INIT($PARM5) NOCURSOR;
 6 VOL     CHAR(6)  INIT($PARM6) NOCURSOR;
 7 PSWD    CHAR(8)  INIT($PARM7) NOCURSOR;
 8 MEMBER  CHAR(8)  INIT($PARM8) NOCURSOR;
 9 NEWNAME CHAR(8)  INIT($PARM9) NOCURSOR;
10 *       CHAR(8)  INIT('        '); - COMPRESS PGM NAME IF NOT IEBCOPY
11 *       CHAR(8)  INIT('PPRINTED'); - PRINT MEMBER OPT/RESPONSE
12 *       CHAR(8)  INIT('RRENAMED'); - RENAME MEMBER OPT/RESPONSE
13 *       CHAR(8)  INIT('DDELETED'); - DELETE MEMBER OPT/RESPONSE
14 *       CHAR(8)  INIT('B       '); - BROWSE MEMBER OPT/RESPONSE
<END>
./ ADD NAME=VUOL01   0100-80022-80022-1555-00055-00055-00000-TYD9835 00
&------------------  PRODUCTION CONTROL OUTPUT FUNCTIONS  ----------------------
&SELECT OPTION ===>%TCOD                                                       $
&
&   L$- LIST JOB NAMES/ID'S VIA THE TSO STATUS COMMAND
&   D$- DELETE JOB OUTPUT AND SAVE IN CONTROL PDS
&   P$- PRINT JOB OUTPUT AND SAVE IN CONTROL PDS
&   BLANK$- DISPLAY JOB OUTPUT AND SAVE IN CONTROL PDS
$
$FOR JOB TO BE SELECTED:
$   JOBNAME&===>%TJNM    $
$   CLASS  &===>%TCL1$
$   JOBID  &===>%TJID    $
$
$FOR JOB TO BE PRINTED:
$       OUTPUT CLASS&===>%TCL2$
$
<ACTION>
 1 TCOD    CHAR(1)  NOCURSOR   KEY(SW1)
           LIST  (' ', * )
           RETURN(' ','¬');
 2 TCOD    CHAR(1)  NOCURSOR   KEY(SW2)
           LIST  ( D , * )
           RETURN(' ','¬');
 4 TCOD    CHAR(1)  NOCURSOR   KEY(SW3)
           LIST  ( L , * )
           RETURN(' ','¬');
 5 TCOD    CHAR(1)  NOCURSOR   KEY(SW4)
           LIST  ( L , * )
           RETURN('¬',' ');
 6 TCOD    CHAR(1)  NOCURSOR   KEY(SW5)
           LIST  ( P , * )
           RETURN(' ','¬');
 7 TCOD    CHAR(1)  INIT(' ') CURSOR   GENHELP(VTUOL)
           LIST  (L,D,P,' ',*)
           RETURN(L,D,P, B ,?);
 8 TJNM    CHAR(1)  NOCURSOR   KEY(SW6)
           LIST  (' ', *)
           RETURN('¬',' ');
 9 TJNM    CHAR(1)  NOCURSOR   KEY(SW7)
           LIST  (' ', *)
           RETURN(' ','¬');
10 TJNM    CHAR(8)  INIT($PARM10) NOCURSOR;
11 TCL1    CHAR(1)  NOCURSOR   KEY(SW8)
           LIST  (' ', * )
           RETURN('¬',' ');
12 TCL1    CHAR(1)  INIT($PARM12) NOCURSOR;
13 TJID    CHAR(1)  NOCURSOR   KEY(SW9)
           LIST  (' ', *)
           RETURN('¬',' ');
14 TJID    CHAR(1)  NOCURSOR   KEY(SWA)
           LIST  (' ', *)
           RETURN(' ','¬');
15 TJID    CHAR(8)  INIT($PARM15) NOCURSOR;
16 TCL2    CHAR(1)  INIT($PARM16) NOCURSOR;
<END>
./ ADD NAME=VUTIL    0100-79269-79269-1311-00062-00062-00000-TYD9835 00
&----------------------  UTILITY SELECTION MENU  -------------------------------
&SELECT OPTION ===>%PRI                                                        $
&
&   1 $LIBRARY   - LIBRARY UTILITIES:
$                           PRINT INDEX LISTING OR ENTIRE DATASET
$                           PRINT, RENAME, OR DELETE MEMBERS
$                           COMPRESS DATASET
&   2 $DATASET   - DATASET UTILITIES:
$                           DISPLAY DATASET INFORMATION
$                           ALLOCATE, RENAME, OR DELETE ENTIRE DATASET
$                           CATALOG OR UNCATALOG DATASET
&   3 $MOVE/COPY - MOVE OR COPY MEMBERS OR DATASETS
&   4 $CATALOG   - CATALOG MANAGEMENT:
$                           DISPLAY OR PRINT CATALOG ENTRIES
$                           INITIALIZE OR DELETE PROJECT CATALOG POINTER
&   5 $RESET     - RESET STATISTICS FOR MEMBERS OF SPF LIBRARY DATASET
&   6 $HARDCOPY  - INITIATE HARDCOPY OUTPUT
&   7 $VTOC      - DISPLAY OR PRINT VTOC ENTRIES FOR A DASD VOLUME
&   8 $OUTLIST   - DISPLAY, DELETE, OR PRINT HELD JOB OUTPUT
<ACTION>
1 PRI   CHAR(8) CURSOR    GENHELP(TU)
        LIST   (1       ,2       ,3       ,4       ,5       ,6       ,
                7       ,8       ,9       ,' '     ,*       )
        RETURN (SPFUDA  ,SPFUDA  ,SPFUMC  ,SPFUCA  ,SPFURS  ,SPFUHC  ,
                SPFUVT  ,SPFUOL  ,SPFUTIL ,' '     ,?       );
2 PRI   CHAR(8)
        LIST   (1       ,2       ,8       ,9       ,*       )
        RETURN (UDA1    ,UDA2    ,UOL01   ,VNOTSUP ,' '     );
<END>
***
*** ORGINAL STATEMENTS
***
&----------------------  UTILITY SELECTION MENU  -------------------------------
&SELECT OPTION ===>%PRI                                                        $
&
&   1 $LIBRARY   - LIBRARY UTILITIES:
$                           PRINT INDEX LISTING OR ENTIRE DATASET
$                           PRINT, RENAME, OR DELETE MEMBERS
$                           COMPRESS DATASET
&   2 $DATASET   - DATASET UTILITIES:
$                           DISPLAY DATASET INFORMATION
$                           ALLOCATE, RENAME, OR DELETE ENTIRE DATASET
$                           CATALOG OR UNCATALOG DATASET
&   3 $MOVE/COPY - MOVE OR COPY MEMBERS OR DATASETS
&   4 $CATALOG   - CATALOG MANAGEMENT:
$                           DISPLAY OR PRINT CATALOG ENTRIES
$                           INITIALIZE OR DELETE PROJECT CATALOG POINTER
&   5 $RESET     - RESET STATISTICS FOR MEMBERS OF SPF LIBRARY DATASET
&   6 $HARDCOPY  - INITIATE HARDCOPY OUTPUT
&   7 $VTOC      - DISPLAY OR PRINT VTOC ENTRIES FOR A DASD VOLUME
&   8 $OUTLIST   - DISPLAY, DELETE, OR PRINT HELD JOB OUTPUT
&   9 $SCRIPT/VS - FORMAT, DISPLAY, AND OPTIONALLY PRINT SCRIPT TEXT
<ACTION>
1 PRI   CHAR(8) CURSOR    GENHELP(TU)
        LIST   (1       ,2       ,3       ,4       ,5       ,6       ,
                7       ,8       ,9       ,' '     ,*       )
        RETURN (SPFUDA  ,SPFUDA  ,SPFUMC  ,SPFUCA  ,SPFURS  ,SPFUHC  ,
                SPFUVT  ,SPFUOL  ,SPFUSC  ,' '     ,?       );
2 PRI   CHAR(8)
        LIST   (1       ,2       ,8       ,9       ,*       )
        RETURN (UDA1    ,UDA2    ,UOL01   ,SCRPTA  ,' '     );
<END>
