++USERMOD(NPFKU01)    /*    5752-SC1C4-JBB1326-YS3
//NPFKU01  JOB 5752-64283-0,SC1C4,MSGLEVEL=(1,1),CLASS=A     */  .
++ VER (Z038)
   FMID(JBB1326)
   PRE  (UZ64283) .
++IF FMID(HBB2102) THEN REQ(NPFKX01)
 /*
  PROBLEM DESCRIPTION(S):

        THIS USERMOD MUST BE ACCEPTED IN ORDER TO BE USED IN A
                  SYSGEN OR IOGEN ASSEMBLY.  PLEASE SAVE A COPY
                  OF THE ORIGINAL LEVEL OF THE MACRO SGIEA2D2.
                  THIS CAN BE FOUND IN THE DLIB SYS1.AGENLIB.
                  YOU CAN AVOID ACCEPTING THE USERMOD BY
                  CONCATENATING YOUR MTS AT THE TOP OF THE SYSLIB
                  DDNAME IN THE ASSEMBLY JCL FOR YOUR STAGE 1
                  IOGEN OR SYSGEN.  THE SMP APPLY PROCESS PUTS
                  AN UPDATED COPY OF THE MACRO SGIEA2D2 IN THE MTS.

        NEWSWEEK IS CURRENTLY RUNNING MVS/370 (SP 1.3.5).
                  HOWEVER, A SIMILAR MOD HAS BEEN MADE WHICH FITS
                  ON AN XA SYSTEM (SP2.1.X).  PLEASE NOTE THAT
                  THIS MOD IS A MODEL, OR SUGGESTION, HOW YOU
                  CAN SET UP YOUR DEFAULT PFKEYS ON YOUR OWN SYSTEM.
                  YOU WILL PROBABLY NOT WANT THE SAME PFKEYS THAT
                  WE ARE USING.

        PLEASE NOTE THAT THESE DEFAULT PFKEYS ARE THE SAME FOR ALL
                  CONSOLES.  ALSO PLEASE NOTE THAT WE CAN NOW SET
                  A PFKEY TO BE CONVERSATIONAL, BY DEFAULT, IF WE
                  WANT IT THAT WAY.  IBM DOES NOT ALLOW FOR THIS
                  AT ALL.  THE BYTE BEFORE THE PFKEY TEXT MUST BE
                  X'A0', FOR THE KEY TO BE USED, AND CONVERSATIONAL.
                  X'80' FOR THE KEY TO BE USED AND NON-CONVERSATIONAL.

        CAREFULLY NOTE HOW I CODED THE SEQUENCE NUMBERS IN THE MOD.

        CUSTOMIZATION OF PFKEYS WILL NOW NOT DISAPPEAR UPON
                  PERFORMANCE OF AN IOGEN.  THIS USERMOD WILL
                  UPDATE THE SYSGEN MACRO SGIEA2D2, THAT GENERATES
                  THE ASSEMBLY OF DEFAULT PFKEY SETTINGS DURING
                  IOGEN.  IT IS POSSIBLE ALSO TO CODE WHICH PFKEYS
                  YOU WANT TO BE CONVERSATIONAL.  SEE THE INSERTED
                  LINES FOR A MODEL.

        USERMOD CREATED BY:    SHMUEL GOLOB
                               NEWSWEEK, INC. - LIVINGSTON, N.J.
                               MARCH 23, 1987 - 87.082

  COMPONENT: 5752-SC1C4-JBB1326
  COMMENTS:          SGIEA2D2
 */.
++MACUPD (SGIEA2D2) DISTLIB(AGENLIB).
./ CHANGE NAME=SGIEA2D2
         LCLC &PFKDEF(10),&PFKPARM     , WE WANT 10 PFKEYS, NOT 9.  NWK
&PFKDEF(6) SETC 'K S,DEL=RD,SEG=19,CON=Y,RNUM=19,RTME=001,MFORM=T'  NWK
&PFKDEF(10) SETC 'F CIPDCICS,_'                                     NWK
&PFKDEF#   SETA 10           NUMBER OF PFK DEFINITIONS              NWK
.*******  CODE THE KEYS THAT YOU WANT CONVERSATIONAL, BELOW.        NWK
         AIF   (&J EQ 6).NWKCN1            PFK  6  CONVERSATIONAL   NWK
         AIF   (&J EQ 10).NWKCN1           PFK 10  CONVERSATIONAL   NWK
.*******  CODE THE KEYS THAT YOU WANT CONVERSATIONAL, ABOVE.        NWK
.NWKCN1  PUNCH '         DC    FL1''&J'''                           NWK
         PUNCH '         DC    X''A0''' KEY IS CONVERSATIONAL       NWK
         PUNCH '         DC    CL108''&PFKDEF(&J+&ADJORG)'''        NWK
         AGO   .NEXTKEY                                             NWK
