         EJECT
***********************************************************************
*     THIS DSECT IS FOR AN ELEMENT ON THE CHAIN OF RELATIVE ADDRESSES *
*     OF END OF FILE MARKS IN THE EXTENT.                             *
***********************************************************************
         SPACE 2
EOFELEM$ DSECT
         DS    0F
EOFTTRN DS    0XL4                    RELATIVE DISK ADDRESS OF EOF
EOFTTR  DS    0XL3
EOFTT   DS    XL2
EOFR    DS    X
EOFN    DS    X
EOFNEXT DS    A                       NEXT ITEM ON CHAIN
EOFELEM EQU   EOFELEM$,*-EOFELEM$
