%-------------------------  FIXPDS -- ENTRY PANEL  -----------------------------
%COMMAND ===>_ZCMD
%
%
%   ENTER DATASET NAME ===>_DATASET                                     +
%
%
%
+   PHYSICAL MEMBERS FROM SPECIFIED DATASET WILL BE BROWSED IN
+   REVERSE ORDER (NEWEST MEMBER FIRST)
+
%
%
%
%
%
)INIT
)PROC
  VER (&DATASET,NONBLANK)
  VER (&DATASET,DSNAME)
)END
