* ------------------------------------------------------------------- *
*                                                                     *
* ------------------------------------------------------------------- *
PPD                DS    0C
PPD_KEY            DC    0CL67
PPD_SEQ            DC    XL4'00'
PPD_NAME           DC    CL63' '
PPD_DATA           DC    100X'00'
PPD_L              EQU   *-PPD
