//TPLERCHK  PROC  CBN='?', NAME FOR CODEBOOK OR LIBRARY
//     CBPREFX='SYS2.TPL.V6', INITIALS FOR CODEBOOK OR LIBRARY       <<
//     DATA=NULLFILE, NAME OF DATA FILE TO BE TABULATED
//     SEQ=1,         FILE SEQUENCE NO. ON ITS VOL. FOR DATA FILE
//     LAB=SL,        TYPE OF LABELS ON ITS VOL. FOR DATA FILE
//     DBGDSN='SYS2.TPL.V6.LOADLIB',     NAME FOR DATABASE "DBGEN"   <<
//     DBMS=NONE,     NAME OF DATABASE MANAGEMENT SYSTEM BEING USED  <<
//     LISTING='A',   SYSOUT SPECIFICATION FOR ALL LISTINGS          <<
//     TABLES='A',    SYSOUT SPECIFICATION IF TABLES ARE SEPARATED   <<
//     CORE=500K,     REGION ACTUALLY USED FOR PROGRAMS OF TPL STEP
//     TPLMAX=2000K,  MAXIMUM REGION USED DURING TPL STEP
//     PSRCORE=500K,  REGION SIZE FOR PCLSORT STEP
//     LAYCORE=500K,  REGION ACTUALLY USED FOR PROGRAMS OF LAYOUT STEP
//     LAYMAX=2000K,  MAXIMUM REGION USED DURING LAYOUT STEP
//     WKUN=WORK,    DEVICE TYPE FOR SORT WORKFILES
//     WKSP=1600,     NO. OF BLKS FOR SORT WORKFILES
//     COORSP=1000,   NO. OF BLKS FOR COORDINATES WORKFILE
//     CONSP=400,     NO. OF BLKS FOR TABLE CONSTRUCTIONS WORKFILE
//     CONIN=80,      SECONDARY ALLOCATION SIZE FOR TABLE CONSTRUC.
//     SPC1SP=200,    INITIAL NO. OF BLKS FOR TABLE SPECS WORKFILE
//     SPC2SP=200,    NO. OF BLKS FOR PCL'S NEW TBSPECS WORKFILE
//     TMPSP=125,     NO OF BLKS FOR "TEMP" WORKFILE
//     CL3UN=WORK,   DEVICE TYPE FOR "TBCELLS" WORKFILE
//     CL3SP=4000,    NO OF BLKS FOR "TBCELLS" WORKFILE
//     TSLDSN='SYS2.TPL.V6.TYPE.STYLES', NAME OF TYPE STYLE LIBRARY<<
//     STYLE=NOPH,  WAS=SET1, NAME OF DEFAULT TYPE STYLE        <<
//     DICNAME='BLS.HYPHEN.DICT',  NAME OF DICTIONARY
//     DICPRE='SYS2.TPL.V6', PREFIX FOR DICTIONARY DSNAME            <<
//     PRODSN='SYS2.TPL.V6.DEFAULT.PROFILE', DSNAME OF PROFILE       <<
//     CBKBLK=2976,CBVER=6,
//     COBLK=2976,COLRECL=24,CORECFM=FB,
//     CONBLK=3059,CONLREC=133,CONRECF=FB,
//     CONTROL=IEFBR14,CONMAX=100K,
//     DATFREE=100,
//     DSPDSN='SYS2.TPL.V6.OBJLIB(DSPOBJ)',
//     FREE=100,
//     LAYDSN='SYS2.TPL.V6.OBJLIB(LAYOBJ)',
//     LAYOPT=,
//     MONITOR=TPLMONTR,
//     MONLIB='SYS2.TPL.V6.LOADLIB',
//     PCLDSN='SYS2.TPL.V6.OBJLIB(PCLOBJ)',
//     POTDSN='SYS2.TPL.V6.OBJLIB(POTOBJ)',
//     QUOT='''',
//     RAPDSN='NULLFILE', <<
//     SISDSN='SYS2.TPL.V6.OBJLIB(SISOBJ)',
//     SORTPGM=SORT,                                                 <<
//     TOTDSN='NULLFILE', <<
//     TPLBLK=2976,
//     TPLOPT=,
//     TRNDSN='SYS2.TPL.V6.OBJLIB(TRNOBJ)'
//*********************************************************************
//*                                                                   *
//*      T P L E R C H K - - A PROCEDURE TO CHECK TPL STATEMENTS AND  *
//*           OPTIONAL ASSOCIATED PCL STATEMENTS FOR ERRORS, AND ALSO *
//*           DISPLAY THE RESULTANT TABLE STRUCTURES.                 *
//*                                                                   *
//*      VALUES FOR THE FOLLOWING PARAMETERS MUST BE SUPPLIED:        *
//*        CBN='cccccccc',CBPREFX='CNaaaa.iii'                        *
//*                                                                   *
//*      THE TPL STATEMENTS COMPRISING THE REQUEST MUST BE PLACED     *
//*           AFTER A "//TPL.REQUEST" DD CARD.                        *
//*                                                                   *
//*      ANY PCL STATEMENTS MODIFYING THE REQUEST, IF PRESENT, MUST   *
//*           BE PLACED AFTER A "//TPL.CHANGES" DD CARD, WHICH MUST   *
//*           APPEAR AFTER THE TPL REQUEST.                           *
//*                                                                   *
//*      THIS PROCEDURE EXECUTES VERSION 6 OF THE TPL SYSTEM.         *
//*                                                                   *
//*      IN CASE OF PROBLEMS, CONTACT THE TPL SYSTEM TEAM.            *
//*            TELEPHONE:  357-5999                                   *
//*                                          LAST UPDATED ON 08/21/84 *
//*********************************************************************
//*
//*
//SYSCNTRL  EXEC  PGM=&CONTROL,REGION=&CONMAX
//* *****     ALLOCATE WORKING DATASETS                         *******
//TPLSPEC  DD  DSN=&&TPLSPEC,UNIT=WORK,DISP=(NEW,PASS),
//  SPACE=(&TPLBLK,(&SPC1SP))
//COORD  DD  DSN=&&COORD,UNIT=WORK,DISP=(NEW,PASS),
//  DCB=(RECFM=&CORECFM,LRECL=&COLRECL,BLKSIZE=&COBLK),
//  SPACE=(&TPLBLK,(&COORSP))
//COORD2  DD  DSN=*.COORD,VOL=REF=*.COORD,DISP=(SHR,PASS)
//CONSTR  DD  DSN=&&CONSTR,UNIT=WORK,DISP=(NEW,PASS),
//  DCB=(RECFM=&CONRECF,LRECL=&CONLREC,BLKSIZE=&CONBLK),
//  SPACE=(&CONBLK,(&CONSP,&CONIN))
//TBSPECS  DD  DSN=&&TBSPECS,UNIT=WORK,DISP=(NEW,PASS),
//  SPACE=(&TPLBLK,(&SPC2SP))
//SORTWK01  DD  DSN=&&WORK1,DISP=(NEW,PASS),
//  UNIT=&WKUN,SPACE=(&TPLBLK,(&WKSP),,CONTIG)
//SORTWK02  DD  DSN=&&WORK2,DISP=(NEW,PASS),
//  UNIT=&WKUN,SPACE=(&TPLBLK,(&WKSP),,CONTIG)
//SORTWK03  DD  DSN=&&WORK3,DISP=(NEW,PASS),
//  UNIT=&WKUN,SPACE=(&TPLBLK,(&WKSP),,CONTIG)
//SORTWK04  DD  DSN=&&WORK4,DISP=(NEW,PASS),
//  UNIT=&WKUN,SPACE=(&TPLBLK,(&WKSP),,CONTIG)
//SORTWK05  DD  DSN=&&WORK5,DISP=(NEW,PASS),
//  UNIT=&WKUN,SPACE=(&TPLBLK,(&WKSP),,CONTIG)
//SORTWK06  DD  DSN=&&WORK6,DISP=(NEW,PASS),
//  UNIT=&WKUN,SPACE=(&TPLBLK,(&WKSP),,CONTIG)
//PROFILE  DD  DSN=&PRODSN,DISP=SHR
//*
//*
//TPL  EXEC  PGM=&MONITOR,REGION=&TPLMAX,
//  COND=(0,LT,SYSCNTRL),
//  PARM='FILE=&TPLBLK,FILE2=&CBKBLK,FREE=&DATFREE,MAX=&CORE,&TPLOPT'
//* *****     THE FIRST STEP:  THE TPL TRANSLATION PHASE, THE   *******
//* *****     PCL TRANSLATION PHASE, THE POST-TRANSLATION PHASE,*******
//* *****     AND THE DISPATCHER PHASE.                         *******
//STEPLIB  DD  DSN=&DBGDSN,DISP=SHR
//  DD  DDNAME=&DBMS.LIB
//  DD  DSN=&MONLIB,DISP=(SHR,PASS)
//TOTALLIB  DD  DSN=&TOTDSN,DISP=SHR
//RAPIDLIB  DD  DSN=&RAPDSN,DISP=SHR
//NONELIB  DD  DSN=&MONLIB,DISP=SHR
//PROGRAM  DD  DSN=&TRNDSN,DISP=SHR
//  DD  DSN=&PCLDSN,DISP=SHR
//  DD  DSN=&POTDSN,DISP=SHR
//  DD  DSN=&DSPDSN,DISP=SHR
//SYSPRINT  DD  SYSOUT=&LISTING
//OUTPUT3  DD  DSN=&&CONSTR,DISP=(OLD,PASS),
//  DCB=(RECFM=&CONRECF,LRECL=&CONLREC,BLKSIZE=&CONBLK),
//  SPACE=(&CONBLK,(&CONSP,&CONIN),RLSE)
//FILE1  DD  DSN=&&TPLSPEC,DISP=(OLD,DELETE,KEEP),
//  SPACE=(&TPLBLK,(&SPC1SP),RLSE)
//FILE2  DD  DSN=&QUOT.&CBPREFX..CB.V&CBVER..&CBN.&QUOT,
//  DISP=SHR
//INPUT2  DD  DDNAME=DATA
//DATA  DD  DUMMY,DSN=&QUOT.&DATA.&QUOT,UNIT=WORK,
//  LABEL=(&SEQ,&LAB),DISP=SHR
//*      NOTE:  DATA IS A DUMMY DATASET TO TAKE CARE OF
//*      UNNECESSARY PARAMETERS ON THE "PROC" STATEMENT.
//SYSIN  DD  DDNAME=REQUEST
//REQUEST  DD  DUMMY
//INPUT4  DD  DUMMY
//INPUT3  DD  DSN=&PRODSN,DISP=SHR
//  DD  DDNAME=CHANGES
//CHANGES  DD  DUMMY
//SYSPUNCH  DD  DSN=&&PCLSORT,UNIT=WORK,SPACE=(TRK,(1,1)),
//  DCB=(RECFM=FB,LRECL=80,BLKSIZE=400),DISP=(NEW,PASS)
//FILE3  DD  DSN=&&COORD,DISP=(OLD,PASS,DELETE),
//  SPACE=(&TPLBLK,(&COORSP),RLSE)
//FILE4  DD  DSN=&&TBSPECS,DISP=(OLD,PASS)
//FILE5  DD  DSN=&&TEMP,DISP=(NEW,DELETE,DELETE),UNIT=WORK,
//  SPACE=(&TPLBLK,(&TMPSP),RLSE)
//OUTPUT6  DD  DSN=&&TPLSTR,UNIT=WORK,DISP=(NEW,PASS,DELETE),
//  SPACE=(TRK,(1,1),RLSE),DCB=(RECFM=FB,LRECL=133,BLKSIZE=3059)
//INPUT7  DD  DDNAME=INSWITCH
//INSWITCH  DD  DUMMY
//FILE8  DD  DSN=&DICPRE..&DICNAME..DICOBJ,DISP=SHR
//OUTPUT7  DD  SYSOUT=&LISTING,DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)
//RAPSYSP  DD  SYSOUT=&LISTING
//*
//*
//PCLSORT  EXEC  PGM=&SORTPGM,REGION=&PSRCORE,
//  COND=((0,LT,SYSCNTRL),(16,LE,TPL))
//* *****     THE PCL COORDINATE RECORD SORT STEP               *******
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR                             <<
//SYSIN  DD  DSN=&&PCLSORT,DISP=(OLD,DELETE,DELETE)
//SYSOUT  DD  SYSOUT=&LISTING
//SORTMSGS  DD  SYSOUT=&LISTING
//SORTIN  DD  DSN=&&COORD,DISP=(OLD,PASS),
//  DCB=(RECFM=&CORECFM,LRECL=&COLRECL,BLKSIZE=&COBLK)
//SORTOUT  DD  DSN=&&COORD,DISP=(OLD,PASS),
//  DCB=(RECFM=&CORECFM,LRECL=&COLRECL,BLKSIZE=&COBLK)
//SORTWK01  DD  DSN=&&WORK1,DISP=(OLD,DELETE,DELETE)
//SORTWK02  DD  DSN=&&WORK2,DISP=(OLD,DELETE,DELETE)
//SORTWK03  DD  DSN=&&WORK3,DISP=(OLD,DELETE,DELETE)
//SORTWK04  DD  DSN=&&WORK4,DISP=(OLD,DELETE,DELETE)
//SORTWK05  DD  DSN=&&WORK5,DISP=(OLD,DELETE,DELETE)
//SORTWK06  DD  DSN=&&WORK6,DISP=(OLD,DELETE,DELETE)
//*
//*
//TAYOUT  EXEC  PGM=&MONITOR,REGION=&LAYMAX,
//  PARM='FILE=&TPLBLK,FREE=&FREE,MAX=&LAYCORE,&LAYOPT',
//  COND=((0,LT,SYSCNTRL),(16,LE,TPL),(0,LT,PCLSORT))
//* *****     THE TABLE LAYOUT STEP                             *******
//STEPLIB  DD  DSN=&MONLIB,DISP=SHR
//PROGRAM  DD  DSN=&SISDSN,DISP=SHR
//  DD  DSN=&LAYDSN,DISP=SHR
//SYSPRINT  DD  SYSOUT=&LISTING
//OUTPUT7  DD  SYSOUT=&TABLES,DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)
//OUTPUT4  DD  SYSOUT=&LISTING,DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)
//SYSPUNCH  DD  SYSOUT=&LISTING,DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)
//INPUT5  DD  DSN=&TSLDSN(&STYLE.CON),DISP=(SHR,KEEP)
//FILE3  DD  DSN=&&COORD,DISP=(OLD,DELETE,DELETE)
//FILE4  DD  DSN=&&TBSPECS,DISP=(OLD,PASS,KEEP)
//FILE6  DD  DSN=&&TBCELLS,UNIT=&CL3UN,DISP=(NEW,PASS,KEEP),
//  SPACE=(&TPLBLK,(&CL3SP),RLSE)
//INPUT7  DD  DUMMY
//SYSIN  DD  DUMMY
//COORD  DD  DSN=&&COORD,DISP=(OLD,DELETE,DELETE)
//*      END OF PROCEDURE FOR CHECKING TPL AND PCL STATEMENTS FOR
//*           ERRORS, AND DISPLAYING THE TABLE STRUCTURES.
//*  PEND
