//T11BLKSC JOB ,'BLOCK SIZE SCAN  ',
//             CLASS=F,MSGCLASS=H
//BLKSCAN  EXEC PGM=BLKSCAN
//STEPLIB  DD  DSN=SYS1.TECHSUP.LINKLIB,DISP=SHR
//SYSLIB   DD  DSN=SYS1.PROD.JCL,DISP=SHR
//SYSPRINT DD  SYSOUT=*
