//T11CACHE JOB ,'FLCACHE TEST',
//             CLASS=F,MSGCLASS=H
//CACHE    EXEC PGM=FLCACHE
//STEPLIB  DD  DSN=SYS1.TECHSUP.LINKLIB,DISP=SHR
//SYSIN    DD  UNIT=VIO,SPACE=(TRK,(1,1))
//SYSPRINT DD  UNIT=VIO,SPACE=(TRK,(1,1))
//SYSUDUMP DD  SYSOUT=*
