//CBT839 JOB 527TSO000S0008,ARNIE,CLASS=8,MSGCLASS=5,NOTIFY=TA15500
//STEP01 EXEC BANNER,
// PARM='SYSPRINTCBT839  DISASMBLCBT839  CBT839'
//STEP02 EXEC ASMBLR,SO=5,P=AEV90,LIB='TS15500.CBT839.PDS'
//SYSIN DD DISP=SHR,DSN=TS15500.CBT839.PDS(DISASM)
//STEP03 EXEC TESTLINK,SO=5,LIB='SYS2.MLINKLIB',NAME=CBT839
//STEP04 EXEC ASMBLR,SO=5,P=AEV90,LIB='TS15500.CBT839.PDS'
//SYSIN DD DISP=SHR,DSN=TS15500.CBT839.PDS(DISASM1)
//STEP05 EXEC TESTLINK,SO=5,LIB='SYS2.MLINKLIB',NAME=DISASM1
//STEP06 EXEC ASMBLR,SO=5,P=AEV90,LIB='TS15500.CBT839.PDS'
//SYSIN DD DISP=SHR,DSN=TS15500.CBT839.PDS(DISASM2)
//STEP07 EXEC TESTLINK,SO=5,LIB='SYS2.MLINKLIB',NAME=DISASM2
