//GETDSNS  JOB
//*
//*     DSN=CBT.SOURCE(GETDSNSJ)
//*
//*
/*ROUTE PRINT R7
//*
//*  IF    PARM='ALL' IS SPECIFIED, ALL INFO WILL BE SHOWN
//*  IF    PARM='VOL' IS SPECIFIED, VOLSERS ARE PUT IN POSITION 1
//*                                 AND THE DSNAME IN 37
//*  IF    PARM='DISK' IS SPECIFIED, ONLY DATASETS ON DISK ARE LISTED
//*
//*                    ANY OTHER PARM IS ASSUMED TO BE THE HLI.
//*
//GETDSNS EXEC PGM=GETDSNS,REGION=80K PARM=ALL
//STEPLIB  DD DSN=HALL.LINKLIB,DISP=SHR
//*REPORT   DD SYSOUT=*
//DSNS     DD SYSOUT=*     DSN LIST GOES IN HERE
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
RH87944
HALL.IMS
IMSVS
HALL.INPUT.CNTL
//
