//TAPEDEBE JOB
//*
//*  USE IEBGENER TO CREATE A MULTI-FILE TAPE...
//*
//STEP1 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD *
LINE 1
/*
//SYSUT2 DD DSN=HALL.TESTTAPE,UNIT=TAPE,DISP=(,KEEP),
//   LABEL=(RETPD=0),
//   VOL=(,RETAIN),
//   DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSIN  DD DUMMY
/*
//STEP1 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD *
LINE 1
LINE 2
/*
//SYSUT2 DD DSN=HALL.TESTTPE2,UNIT=TAPE,DISP=(,KEEP),
//   LABEL=(2,SL,RETPD=0),
//   VOL=REF=*.STEP1.SYSUT2,
//   DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSIN  DD DUMMY
//*
//*  COPY THE MULTI-FILE TAPE WITH TAPECOPY
//*
//STEP2 EXEC PGM=TAPECOPY,PARM='DUMP,TEST,HEX,PRINT=ALL'
//STEPLIB DD DSN=HALL.LINKLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSABEND DD SYSOUT=*
//MASTER DD DISP=(OLD,PASS),UNIT=TAPE,
//   DSN=HALL.TESTTAPE,VOL=REF=*.STEP1.SYSUT2
//TAPE1  DD DSN=HALL.TAPE,UNIT=TAPE,DISP=(,KEEP),
//   LABEL=(RETPD=0),
//   VOL=(,RETAIN),
//   DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//*
//STEP3 EXEC PGM=TAPECOPY,PARM='DUMP,TEST,HEX,PRINT=ALL'
//STEPLIB DD DSN=HALL.LINKLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSABEND DD SYSOUT=*
//MASTER DD DISP=(OLD,PASS),UNIT=TAPE,
//   DSN=HALL.TESTTAPE,VOL=REF=*.STEP1.SYSUT2
//TAPE1  DD DSN=HALL.TAPE,UNIT=TAPE,DISP=(,KEEP),
//   LABEL=(3,SL,RETPD=0),
//   VOL=(,RETAIN,REF=*.STEP2.TAPE1),
//   DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//*
//*  DUMP THE MULTI-FILE TAPE WITH TAPECOPY
//*
//STEP4 EXEC PGM=TAPECOP1,PARM='DEBE,TEST,HEX,PRINT=ALL' IGNOREOF'
//STEPLIB DD DSN=HALL.LINKLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSABEND DD SYSOUT=*
//MASTER DD DISP=(OLD,PASS),UNIT=TAPE,
//   DSN=HALL.TESTTAPE,VOL=REF=*.STEP2.TAPE1
//
