//YR2000J  JOB
/*ROUTE  PRINT R7
//*
//OUT1   OUTPUT DEFAULT=NO,COPIES=1,CLASS=A,          LANDSCAPE 67X138
//             PAGEDEF=L1C100,FORMDEF=L1C000
//OUT2   OUTPUT DEFAULT=NO,COPIES=1,CLASS=A,          PORTRAIT 88X96
//             PAGEDEF=P1E100,FORMDEF=P1E000
//OUT3   OUTPUT DEFAULT=NO,COPIES=1,CLASS=A,          PORTRAIT 64X80
//             PAGEDEF=P1B000,FORMDEF=P1B000
//OUT4   OUTPUT FORMDEF=DCF,LINECT=0          FOR LASER/DCF, SYSOUT=1
//*
//*
//*
//*    DSN=CBT.SOURCE(YR2000J)
//*
//*          GET A LIST OF MEMBERS IN //INLIB THAT MAY CONTAIN THE
//*          TIME MACRO, OR THE STCK INSTRUCTION,
//*          OR MAY CALL THE TIME ROUTINE SPECIFIED BY PARM=....
//*
//*          IF PARM IS "OFFSET" EXTRA INFO WILL BE PRINTED SHOWING
//*          THE OFFSET TO INSTRUCTIONS/DATA.
//*
//*          IF PARM IS "DEBUG" EXTRA INFO WILL BE PRINTED
//*
//*          IF PARM IS "DEBUG=MODULENAME" EXTRA INFO WILL BE PRINTED
//*          AND THE PGM WILL ABEND WHEN "MODULENAME" IS LOADED
//*
//*R2000   EXEC PGM=YR2000,REGION=4000K,PARM='DEBUG=IGC0009D'
//*R2000   EXEC PGM=YR2000,REGION=4000K,PARM='DEBUG=ICHRFR00'
//*R2000   EXEC PGM=YR2000,REGION=4000K  ,PARM='DAYDATE'
//*R2000   EXEC PGM=YR2000,REGION=4000K,PARM='DEBUG'
//YR2000   EXEC PGM=YR2000,REGION=4000K,PARM='OFFSET,DEBUG'
//STEPLIB  DD DISP=SHR,DSN=HALL.LINKLIB
//*SYSPRINT DD SYSOUT=*
//SYSPRINT DD SYSOUT=(,),OUTPUT=*.OUT2
//*SYSUT2   DD SYSOUT=1,OUTPUT=*.OUT4         FOR LASER PRINTER
//SYSABEND DD SYSOUT=*
//INLIB    DD DISP=SHR,DSN=HALL.TESTLIB
//SYSIN    DD *
ARCH00CV
DAYDATE
ATT
X'0A04'
/*
//
