//CKRENMEM JOB 000000000,' ',MSGCLASS=X,MSGLEVEL=(1,1)
//**
//**
//**
//**
//CKRENMEM  EXEC PGM=CKRENMEM,PARM='OLD,NEW'
//STEPLIB   DD  DSN=USXXBCR.CBT.LOADLIB,DISP=SHR
//DDSYSIN   DD  DSN=LIBRERIA
//**
//**
//**
//**
