//&EURUSID.T JOB (&EUACCNO),'-- S H A D O W --',
//             MSGLEVEL=(1,1),MSGCLASS=X,REGION=1M,TIME=(,20),
//             NOTIFY=&EURUSID,USER=&EURUSID
/*JOBPARM L=4
//ASS     EXEC PGM=IEV90,PARM='XREF(SHORT),NODECK,OBJECT'
//SYSLIB    DD DSN=SYS1.MACLIB,DISP=SHR
//SYSUT1    DD UNIT=VIO,DSN=&&SYSUT1,SPACE=(CYL,(10,5))
//SYSLIN    DD UNIT=SYSDA,SPACE=(CYL,(1,1)),DSN=&&LOADSET,
//             DCB=(BLKSIZE=800),DISP=(,PASS,DELETE)
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD DSN=&UUDSN.(PAJSHDT),DISP=SHR
)SEL &UU4 = YES
//LNK     EXEC PGM=HEWL,PARM='XREF,LIST',COND=(4,LT)
//SYSLMOD   DD DSN=&UUTLL,DISP=SHR
//SYSUT1    DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD DSN=->.SHADOW.DATA(PAJSHDW),DISP=SHR
//          DD DSN=&&LOADSET,DISP=(OLD,DELETE,DELETE)
//          DD DSN=->.SHADOW.DATA(R050A90),DISP=SHR
//          DD *
  ENTRY   PAJSHDW
  NAME    PAJSHDW(R)
/*
)ENDSEL
