//JOBCARD INFORMATION
//STEPNAME EXEC PGM=CALPRINT
//STEPLIB  DD DSN=NAME.OF.LOADLIB
//         DD DSN=*.*.SCEERUN
//LICENSE  DD DSN=FILE.CONTAINING.LICENSE.RECORD
//CALINP   DD DSN=FILE.CONTAINING.REQUEST.RECORDS
//CALOUT   DD SYSOUT=A (CALENDARS DIRECTED TO PRINT QUEUE)
//VALID    DD DSN=OUTPUT.FILE.CONTAINING.VALID.REQUESTS
//REJECTS  DD DSN=OUTPUT.FILE.CONTAINING.INVALID.REQUESTS
//SYSOUT DD * (JOBSTEP MESSAGES)
//* SCEERUN Libraries should be included in the STEPLIB concatenation.
