//SBGOLOBA  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*-----------------------------------------------------------------*//
//*  JCL TO USE THE CALFILE PROGRAM FROM PHIL POLCHINSKI TO CREATE  *//
//*  A SMALLER-SIZED CALENDAR FILE.  THE FILE PRODUCED BY THIS JOB  *//
//*  WILL COVER YEARS 1900 THRU 2200.                               *//
//*-----------------------------------------------------------------*//
//CREATE  EXEC PGM=CALFILE
//STEPLIB DD DISP=SHR,DSN=SBGOLOB.CALFILE.LOAD
//        DD DISP=SHR,DSN=CEE.SCEERUN
//LICENSE DD DISP=SHR,DSN=SBGOLOB.CBT490.FILE930(KEYEBCDC) (LRECL=80)
//CALINP  DD DISP=SHR,DSN=SBGOLOB.CBT490.FILE930(CALSMALL) (LRECL=80)
//CALOUT  DD DSN=SBGOLOB.CALFILE.SMALLER,DISP=SHR          (LRECL=35)
//SYSOUT  DD DISP=SHR,DSN=SBGOLOB.CALFILE.MSGS             (LRECL=125)
