//AIDINIT  JOB (........),'INSTALL - AIDINIT -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=1M,TIME=1
/*JOBPARM L=4
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* PRE-REQUISITE MODULES INSTALLATION :                              *
//*                AUTHCTL   GFDATE    TXPRINT                        *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASS     EXEC PAJ2AS3,MBR=AIDINIT
//LNK     EXEC PAJILKL
//SYSIN     DD *
  INCLUDE SYSADD(GFDATE,PRINT)
  ENTRY   AIDINIT
  NAME    AIDINIT(R)
/*
