//DEVTGEN  JOB (........),'INSTALL - DEVTGEN -',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=1M,TIME=1
/*JOBPARM L=5
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//* PRE-REQUISITE MODULES INSTALLATION :                              *
//*                DAUNTY    GFDATE    TXPRINT   TXPUNCH   TXREAD     *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//ASS     EXEC PAJ2AS3,MBR=DEVTGEN
//LNK     EXEC PAJILKL
//SYSIN     DD *
  INCLUDE SYSADD(GFDATE,DAUNTY,PRINT,PUNCH,READ)
  ENTRY   DEVTGEN
  NAME    DEVTGEN(R)
/*
