//IEFUSI   JOB (........),'INSTALL  -IEFUSI-',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=2
//ASS     EXEC PAJ2AS3,MBR=IEFUSI,OPT=',RENT'
//LNK     EXEC PAJILKR,OPT=',RENT'
//SYSIN     DD *
  ENTRY   IEFUSI
  NAME    IEFUSI(R)
/*
