//SMFEXITS JOB (........),'INSTALL  SMF-EXITS',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=5
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//*       SMF EXITS : RE-LINK INTO LPALIB.                            *
//* ---------- ADJUSTMENTS MUST BE DONE BEFORE YOU RUN THIS JOB (SCAN *
//*            ALL "->" OCCURENCES AND SET RIGHT DATA-SETS NAMES),    *
//*            AND VOL=SER=...... MUST BE COMPLETE.                   *
//* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
//LNKS    EXEC PGM=HEWLH096,
//             PARM='SIZE=(768K,100K),NCAL,LIST,LET,XREF,AC=1'
//SYSLMOD   DD UNIT=DISK,VOL=SER=......,DSN=SYS1.LPALIB,DISP=SHR
//SYSLIB1   DD DSN=->.CJS.LOAD.LIBRARY,DISP=SHR
//SYSLIB2   DD DSN=->.TARGET.RTNLIB,DISP=SHR
//SYSLIB3   DD UNIT=DISK,VOL=SER=......,DSN=SYS1.LPALIB,DISP=SHR
//AOSB3     DD UNIT=DISK,VOL=SER=......,DSN=SYS1.AOSB3,DISP=SHR
//SYSUT1    DD UNIT=SYSDA,SPACE=(CYL,2)
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
    INCLUDE   SYSLIB1(CJSUJV)
    CHANGE    IEFUJV(USERUJV)
    INCLUDE   SYSLIB2(IEFUJV)
    INCLUDE   SYSLIB2(UJVTABLE)
    ORDER     IEFUJV(P),USERUJV,UJVTABLE
    ENTRY     IEFUJV
 NAME    IEFUJV(R)
    INCLUDE   SYSLIB1(CJSUJI)
    CHANGE    IEFUJI(USERUJI)
    INCLUDE   SYSLIB2(IEFUJI)
    ORDER     IEFUJI(P),USERUJI
    ENTRY     IEFUJI
 NAME    IEFUJI(R)
    INCLUDE   SYSLIB1(CJSACTRT)
    CHANGE    IEFACTRT(USERACT)
    INCLUDE   SYSLIB2(IEFACTRT)
    INCLUDE   AOSB3(IEFTB724)
    ORDER     IEFACTRT(P),USERACT
    ENTRY     IEFACTRT
 NAME    IEFACTRT(R)
    INCLUDE   SYSLIB1(CJSUJP)
    CHANGE    IEFUJP(USERUJP)
    INCLUDE   SYSLIB3(IEFUJP)
    ORDER     IEFUJP(P),USERUJP
    ENTRY     IEFUJP
 NAME    IEFUJP(R)
/*
//LNKL    EXEC PGM=HEWLH096,
//             PARM='RENT,SIZE=(768K,100K),NCAL,LIST,LET,XREF'
//SYSLMOD   DD UNIT=DISK,VOL=SER=......,DSN=SYS1.LPALIB,DISP=SHR
//SYSLIBL   DD DSN=->.TARGET.RTNLIB,DISP=SHR
//SYSUT1    DD UNIT=SYSDA,SPACE=(CYL,2)
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD *
    INCLUDE   SYSLIBL(IEFUSI)
    ENTRY     IEFUSI
 NAME    IEFUSI(R)
    INCLUDE   SYSLIBL(IEFUTL)
    ENTRY     IEFUTL
 NAME    IEFUTL(R)
/*
