//YATIL    JOB (........),'INSTALL  -YATIL-',
//             MSGLEVEL=(1,1),MSGCLASS=A,REGION=800K,TIME=1
/*JOBPARM L=3
//ASS     EXEC PAJ2AS3,OPT=',RENT',MBR=YATIL
//LNK     EXEC PAJILKC,OPT=',RENT'
//SYSIN     DD *
  ENTRY   YATIL
  NAME    YATIL(R)
/*
