//RLSLISTC JOB 10100000,R.SAMPLE,
//             NOTIFY=&SYSUID,
//             MSGCLASS=8,CLASS=S
//*JCLLIB   JCLLIB ORDER=SYS1.IGY.SIGYPROC
//IGYWCL PROC  LNGPRFX='IGY.V6R2M0',
//             LIBPRFX='CEE',
//             PGMLIB='&&GOSET',GOPGM=GO
//*
//*********************************************************************
//*                                                                   *
//*  IBM Enterprise COBOL for z/OS                                    *
//*               Version 6 Release 2 Modification 0                  *
//*                                                                   *
//*  LICENSED MATERIALS - PROPERTY OF IBM.                            *
//*                                                                   *
//*  5655-EC6 COPYRIGHT IBM CORP. 1983, 2017                          *
//*                                                                   *
//*  US GOVERNMENT USERS RESTRICTED RIGHTS - USE,                     *
//*  DUPLICATION OR DISCLOSURE RESTRICTED BY GSA                      *
//*  ADP SCHEDULE CONTRACT WITH IBM CORP.                             *
//*                                                                   *
//*********************************************************************
//*
//*  COMPILE AND LINK EDIT A COBOL PROGRAM
//*
//*  PARAMETER  DEFAULT VALUE    USAGE
//*   LNGPRFX   IGY.V6R2M0       PREFIX FOR LANGUAGE DATA SET NAMES
//*   LIBPRFX   CEE              PREFIX FOR LIBRARY DATA SET NAMES
//*   PGMLIB    &&GOSET          DATA SET NAME FOR LOAD MODULE
//*   GOPGM     GO               MEMBER NAME FOR LOAD MODULE
//*
//*  CALLER MUST SUPPLY //COBOL.SYSIN DD ...
//*
//*  CALLER MUST ALSO SUPPLY //COBOL.SYSLIB DD ... for COPY statements
//*
//*  NOTE:  SYSUT* datasets must be single-volume datasets
//*
//COBOL  EXEC PGM=IGYCRCTL,REGION=0M
//STEPLIB  DD  DSNAME=&LNGPRFX..SIGYCOMP,DISP=SHR
//         DD  DSNAME=&LIBPRFX..SCEERUN,DISP=SHR
//         DD  DSNAME=&LIBPRFX..SCEERUN2,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DSNAME=&&LOADSET,UNIT=SYSALLDA,
//             DISP=(MOD,PASS),SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT2   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT3   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT4   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT5   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT6   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT7   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT8   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT9   DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT10  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT11  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT12  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT13  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT14  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT15  DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSMDECK DD  UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//LKED   EXEC PGM=IEWBLINK,COND=(8,LT,COBOL),REGION=0M
//SYSLIB   DD  DSNAME=&LIBPRFX..SCEELKEX,DISP=SHR
//         DD  DSNAME=&LIBPRFX..SCEELKED,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DSNAME=&&LOADSET,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSNAME=&PGMLIB(&GOPGM),
//             SPACE=(CYL,(1,1,1)),
//             UNIT=SYSALLDA,DISP=(MOD,PASS),DSNTYPE=LIBRARY
//IGYWCL   PEND
//*
//DELFILE  EXEC PGM=IEFBR14
//SYSPRINT DD DISP=(MOD,DELETE),DSN=RLS.CBTTAPE.SYSPRINT,
//         UNIT=SYSDA,SPACE=(CYL,(260,100),RLSE),
//         DSORG=PS,RECFM=FB,LRECL=121,BLKSIZE=0
//STEPA    EXEC IGYWCL,
// LNGPRFX='SYS1.IGY',
// LIBPRFX='SYS1.CEE',
// PARM.COBOL='LIST,NOOFFSET,MAP,ARITH(EXTEND),OPT(0),DATA(31),NOADV'
//COBOL.SYSPRINT DD DISP=(,CATLG),DSN=RLS.CBTTAPE.SYSPRINT,
//         UNIT=SYSDA,SPACE=(CYL,(260,100),RLSE),
//         DSORG=PS,RECFM=FB,LRECL=133,BLKSIZE=0
//COBOL.SYSLIN  DD SPACE=(CYL,(25,25))
//COBOL.SYSUT1  DD SPACE=(CYL,(25,25))
//COBOL.SYSUT2  DD SPACE=(CYL,(25,25))
//COBOL.SYSUT3  DD SPACE=(CYL,(25,25))
//COBOL.SYSUT4  DD SPACE=(CYL,(25,25))
//COBOL.SYSUT5  DD SPACE=(CYL,(25,25))
//COBOL.SYSUT6  DD SPACE=(CYL,(25,25))
//COBOL.SYSUT7  DD SPACE=(CYL,(25,25))
//COBOL.SYSUT8  DD SPACE=(CYL,(25,25))
//COBOL.SYSUT9  DD SPACE=(CYL,(25,25))
//COBOL.SYSUT10 DD SPACE=(CYL,(25,25))
//COBOL.SYSUT11 DD SPACE=(CYL,(25,25))
//COBOL.SYSUT12 DD SPACE=(CYL,(25,25))
//COBOL.SYSUT13 DD SPACE=(CYL,(25,25))
//COBOL.SYSUT14 DD SPACE=(CYL,(25,25))
//COBOL.SYSUT15 DD SPACE=(CYL,(25,25))
//COBOL.SYSIN DD   DISP=SHR,DSN=RLS.CBTTAPE.PDS(READSMF)
//LKED.SYSLMOD DD  DISP=SHR,DSN=RLS.CBTTAPE.LOAD
//LKED.SYSIN  DD   *
  INCLUDE SYSLMOD(CONVETOD)
  ENTRY READSMF
  NAME  READSMF(R)
/*
//
