/* rexx */
/*********************************************************************/
/* This exec invokes IBM's System Automation ADMIN dialog.           */
/*********************************************************************/
address tso "ALTLIB ACT APPL(CLIST) DA('ING.SINGIREX')"
address ispexec "SELECT CMD(%INGDLG SELECT(ADMIN)) SCRNAME(SAADMIN)"
address tso "ALTLIB DEACT APPL(CLIST)"
