/* rexx */
/*********************************************************************/
/* This exec invokes IBM's System Automation IOCONNECT dialog.       */
/*********************************************************************/
address tso "ALTLIB ACT APPL(CLIST) DA('ING.SINGIREX')"
address ispexec "SELECT CMD(%INGDLG SELECT(IOCONNECT)) SCRNAME(SAIOCON)"
address tso "ALTLIB DEACT APPL(CLIST)"
