)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT)   HILITE(USCORE)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   %  TYPE(TEXT)    INTENS(HIGH) SKIP(ON)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - RACF Reports - 2 of 2+)\-\%Tutorial
%Command ===>_ZCMD
+
+Primary Commands
%  Find text        +Find a text string
%  Sort column A/D  +Sort column, ascending/descending, cols are point-and-shoot
%  Locate text      +Locate text in the sorted column
%  Only text        +Only display rows with text string
%  Reset            +Redisplay all rows and sort first column
%  Unload           +Unload the RACF database using IRRDBU00
%  Job              +Define JOB card and parameters (UNIT, SPACE, etc.)
%  SUbmit           +Submit the job
+
+Line Commands
%  S  !Select       +Select report
%  R  !Reset        +Unselect report
+
+
+
+
+
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACRPT1
)END
