)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT)   HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - OMVS SLIST - 1 of 2+)\-\%Tutorial
%Command ===>_ZCMD
%
%SLIST+displays Showmvs's Unix System Services Information
+
%Optional:+Can specify USERS to display active USS users
+
%Operands:!USERS
+
%Notes:   %1)+To use this feature, invoke Settings (Option 0) and turn  on:
+              !Showmvs data ... Y
+         %2)+Operands can be mixed case, for example:!Users+or!uSErs
+
+
+
+
+
+
+
+
+
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACOMS1
  &ZCONT   = #RACOMS2
)END
