)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT)   HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - OMVS ULIST - 2 of 2+)\-\%Tutorial
%Command ===>_ZCMD
%
%Examples:
%  1)+To list all userid
!       ULIST
+
%  2)+To list a specific userid
!       ULIST SAMGOL
+
%  3)+To list userids with a specific UID
!       ULIST UID(10333304)
+
%  4)+To list userids with a specific GID
!       ULIST GID(30344)
+
%  5)+To list all userids with a specific shell name
!       ULIST SHELL(/bin/sh)
+
%  6)+To list all userids with a specific home path
!       ULIST HOME(/u/samgob)
+
+ \ \ (press%ENTER+to continue) \ \
)PROC
  &ZUP     = #RACOMU1
)END
