)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON) JUST(LEFT)   HILITE(USCORE)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(TURQ)
   @  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(RED)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON) COLOR(GREEN)
)BODY EXPAND(\\)
%Tutorial+\-\(%RACFADM - IBM RACF Options+)\-\%Tutorial
%Command ===>_ZCMD
%
+  To display and access the below IBM RACF options from the main menu:
%    10!IBMSys   +RACF system options
%    11!IBMRRSF  +RACF remote services
%    12!IBMCert  +RACF certificates
+
+  Invoke%Settings+(Option 0) and turn on:
!    IBM RACF opt ...... Y
)PROC
  &ZUP     = #RACIBM
)END
