)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON)  JUST(LEFT)   HILITE(USCORE)
   }  TYPE(INPUT)   INTENS(HIGH) CAPS(OFF) JUST(LEFT)   HILITE(USCORE)
   {  TYPE(TEXT)    INTENS(LOW)  SKIP(ON)  COLOR(BLUE)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON)  COLOR(GREEN)
)BODY EXPAND(\\)
+\-\(%RACFADM - User Profiles+)\-\
%Command ===>_ZCMD
%
+Alt RACF%USER+profile: %ALTUSER+command
+
+PROFILE %===>_USER    {
+
{Enter%ALTUSER{operands to%alter{fields/segments from the user profile:
+
+OPERANDS%===>}NOS


                                  +
+
{Or select:
+  _z+NOTSO        _z+NOCICS           _z+NODFP            _z+NOOMVS
+  _z+TSO(NOPROC)  _z+CICS(NOOPCLASS)  _z+DFP(NODATACLAS)  _z+OMVS(NOHOME)
+  _z+TSO(NOACCT)  _z+CICS(NOOPIDENT)  _z+DFP(NOSTORCLAS)  _z+OMVS(NOPROGRAM)
+  _z+TSO(NOSIZE)  _z+CICS(NOOPPRTY)   _z+DFP(NOMGMTCLAS)
+  _z+TSO(NOUNIT)  _z+CICS(NOTIMEOUT)
+
+  _z+NOSPECIAL    _z+NOOPERATIONS     _z+NOGRPACC         _z+NOAUDITOR
+  _z+NOADSP       _z+NOROAUDIT        _z+NORESTRICTED
)INIT
  .CURSOR  = NOS
  .HELP    = #RACMENU
  &NOS     = ''
  &notso   = ''
  &notso1  = ''
  &notso2  = ''
  &notso3  = ''
  &notso4  = ''
  &nocics  = ''
  &nocics1 = ''
  &nocics2 = ''
  &nocics3 = ''
  &nocics4 = ''
  &nodfp   = ''
  &nodfp1  = ''
  &nodfp2  = ''
  &nodfp3  = ''
  &noomvs  = ''
  &noomvs1 = ''
  &noomvs2 = ''
  &nospec  = ''
  &noop    = ''
  &nogrp   = ''
  &noaud   = ''
  &noadsp  = ''
  &noraud  = ''
  &norest  = ''
  .zvars   = '(notso  nocics  nodfp  noomvs  +
               notso1 nocics1 nodfp1 noomvs1 +
               notso2 nocics2 nodfp2 noomvs2 +
               notso3 nocics3 nodfp3  +
               notso4 nocics4  +
               nospec noop nogrp noaud noadsp noraud norest)'
)PROC
  VER (&USER,NB)
  *rexx(*)
      if (notso <> '') then do
         notso = 'NOTSO'
         call addnos notso
      end
      else do
         if (notso1  /= '') then notso  = 'NOPROC'
         if (notso2  /= '') then notso  = notso 'NOACCT'
         if (notso3  /= '') then notso  = notso 'NOSIZE'
         if (notso4  /= '') then notso  = notso 'NOUNIT'
         if (notso   /= '') then do
            notso = 'TSO('strip(notso)')'
            call addnos notso
         end
      end

      if (nocics <> '') then do
         nocics = 'NOCICS'
         call addnos nocics
      end
      else do
         if (nocics1 /= '') then nocics = 'NOOPCLASS'
         if (nocics2 /= '') then nocics = nocics 'NOOPIDENT'
         if (nocics3 /= '') then nocics = nocics 'NOOPPRTY'
         if (nocics4 /= '') then nocics = nocics 'NOTIMEOUT'
         if (nocics  /= '') then do
            nocics = 'CICS('strip(nocics)')'
            call addnos nocics
         end
      end

      if (nodfp <> '') then do
         nodfp = 'NODFP'
         call addnos nodfp
      end
      else do
         if (nodfp1  /= '') then nodfp  = 'NODATACLAS'
         if (nodfp2  /= '') then nodfp  = nodfp 'NOSTORCLAS'
         if (nodfp3  /= '') then nodfp  = nodfp 'NOMGMTCLAS'
         if (nodfp   /= '') then do
            nodfp = 'DFP('strip(nodfp)')'
            call addnos nodfp
         end
      end

      if (noomvs <> '') then do
         noomvs = 'NOOMVS'
         call addnos noomvs
      end
      else do
         if (noomvs1 /= '') then noomvs = 'NOHOME'
         if (noomvs2 /= '') then noomvs = noomvs 'NOPROGRAM'
         if (noomvs  /= '') then do
            noomvs = 'OMVS('strip(noomvs)')'
            call addnos noomvs
         end
      end

      if (nospec  /= '') then call addnos 'NOSPECIAL'
      if (noop    /= '') then call addnos 'NOOPERATIONS'
      if (nogrp   /= '') then call addnos 'NOGRPACC'
      if (noraud  /= '') then call addnos 'NOROAUDIT'
      if (noadsp  /= '') then call addnos 'NOADSP'
      if (noaud   /= '') then call addnos 'NOAUDITOR'
      if (norest  /= '') then call addnos 'NORESTRICTED'
      signal done
    Addnos:
      arg opt
      if (pos(opt,nos) > 0) then return
      nos = nos opt
      return
    done:
  *endrexx

  ver (&nos,nb)
)END
/*--------------------------------------------------------------------*/
/*                             Comments                               */
/*--------------------------------------------------------------------*/
/*                                                                    */
/*  1) To display/use this panel, the user must have the Settings     */
/*     (menu option 0) turned on:                                     */
/*       Administrator ..... Y                                        */
/*       Admin RACF API .... Y                                        */
/*                                                                    */
/*--------------------------------------------------------------------*/
