)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON)  JUST(LEFT)   HILITE(USCORE)
   {  TYPE(TEXT)    INTENS(LOW)  SKIP(ON)  COLOR(BLUE)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON)  COLOR(GREEN)
   !  TYPE(TEXT)    INTENS(LOW)  SKIP(ON)  COLOR(TURQ)
)BODY EXPAND(\\)
+\-\(%RACFADM - Settings+)\-\
%Command ===>_ZCMD
%
{Specify the!panel name{and datasets to!ALTLIB/LIBDEF
+
%Panel
+  Name ......._SETPIBM +
+
%Datasets
+  Messages ..._SETDIBMM                                    +
+  Panels ....._SETDIBMP                                    +
+  Skeltons ..._SETDIBMS                                    +
+  Clist ......_SETDIBMC                                    +
+
%Note
{  - Leave%blank,{if modules exist in allocated TSO/ISPF datasets, else,
{    must supply all four datasets (messages, panels, skeletons and CLIST),
{    single quotes are!not{required
)INIT
  VGET (SETPIBM SETDIBMM SETDIBMP SETDIBMS SETDIBMC) PROFILE
  IF (&SETPIBM = &Z)
     &SETPIBM = ICHP00
  .HELP   = #RACSET1
  .CURSOR = SETPIBM
)PROC
  &RACFSMSG = &Z
  &RACFLMSG = &Z

  VER (&SETPIBM,NB,NAME)
  VER (&SETDIBMM,DSNAME)
  VER (&SETDIBMP,DSNAME)
  VER (&SETDIBMS,DSNAME)
  VER (&SETDIBMC,DSNAME)

  IF (&SETDIBMM NE &Z & &SETDIBMP NE &Z +
   &  &SETDIBMS NE &Z & &SETDIBMC NE &Z)
      &Z = &Z
  ELSE
     IF (&SETDIBMM EQ &Z & &SETDIBMP EQ &Z +
      &  &SETDIBMS EQ &Z & &SETDIBMC EQ &Z)
         &Z = &Z
     ELSE
         &RACFSMSG = 'Empty dataset name'
         &RACFLMSG = 'All datasets must contain a valid dataset +
                      name or all datasets must be empty.'
         VER (&SETDIBMM,NB,DSNAME,MSG=RACF011)
         VER (&SETDIBMP,NB,DSNAME,MSG=RACF011)
         VER (&SETDIBMS,NB,DSNAME,MSG=RACF011)
         VER (&SETDIBMC,NB,DSNAME,MSG=RACF011)

  &BADPANL = N
  &BADDSNM = N
  &BADDSNP = N
  &BADDSNS = N
  &BADDSNC = N
  *REXX (SETPIBM SETDIBMM SETDIBMP SETDIBMS SETDIBMC RACFSMSG RACFLMSG
         BADDSNM BADDSNP BADDSNS BADDSNC BADPANL)
     SETDIBMM = STRIP(SETDIBMM,,"'")
     SETDIBMP = STRIP(SETDIBMP,,"'")
     SETDIBMS = STRIP(SETDIBMS,,"'")
     SETDIBMC = STRIP(SETDIBMC,,"'")
     IF (SETDIBMM <> "") THEN
        IF (SYSDSN("'"SETDIBMM"'") <> "OK") THEN DO
           RACFSMSG = 'DSN does not exist'
           RACFLMSG = 'The dataset does not reside in the catalog',
                      'or on a disk pack, please investigate.'
           BADDSNM  = "Y"
           return
        END
     IF (SETDIBMP <> "") THEN DO
        IF (SYSDSN("'"SETDIBMP"'") <> "OK") THEN DO
           RACFSMSG = 'DSN does not exist'
           RACFLMSG = 'The dataset does not reside in the catalog',
                      'or on a disk pack, please investigate.'
           BADDSNP  = "Y"
           return
        END
        IF (SYSDSN("'"SETDIBMP"("SETPIBM")'") <> "OK") THEN DO
           RACFSMSG = 'Panel does not exist'
           RACFLMSG = 'The panel member does not reside in the',
                      'panel dataset name, please investigate.'
           BADPANL  = "Y"
           return
        END
     END
     IF (SETDIBMS <> "") THEN
        IF (SYSDSN("'"SETDIBMS"'") <> "OK") THEN DO
           RACFSMSG = 'DSN does not exist'
           RACFLMSG = 'The dataset does not reside in the catalog',
                      'or on a disk pack, please investigate.'
           BADDSNS  = "Y"
           return
        END
     IF (SETDIBMC <> "") THEN
        IF (SYSDSN("'"SETDIBMC"'") <> "OK") THEN DO
           RACFSMSG = 'DSN does not exist'
           RACFLMSG = 'The dataset does not reside in the catalog',
                      'or on a disk pack, please investigate.'
           BADDSNC  = "Y"
           return
        END
  *ENDREXX

  IF (&BADPANL = Y)
     .CURSOR = SETPIBM
     .MSG    = RACF011
  IF (&BADDSNM = Y)
     .CURSOR = SETDIBMM
     .MSG    = RACF011
  IF (&BADDSNP = Y)
     .CURSOR = SETDIBMP
     .MSG    = RACF011
  IF (&BADDSNS = Y)
     .CURSOR = SETDIBMS
     .MSG    = RACF011
  IF (&BADDSNC = Y)
     .CURSOR = SETDIBMC
     .MSG    = RACF011

  IF (.MSG = &Z)
     VPUT (SETPIBM SETDIBMM SETDIBMP SETDIBMS SETDIBMC) PROFILE
)END
