)ATTR DEFAULT(%+_)
   _  TYPE(INPUT)   INTENS(HIGH) CAPS(ON)   JUST(LEFT)   HILITE(USCORE)
   {  TYPE(TEXT)    INTENS(LOW)  SKIP(ON)   COLOR(BLUE)
   +  TYPE(TEXT)    INTENS(LOW)  SKIP(ON)   COLOR(GREEN)
)BODY EXPAND(\\)
+\-\(%RACFADM - General Resources+)\-\
%Command ===>_ZCMD                                              +Scroll==>_SAMT+
%
+Add RACF%_RCLASS  +profile: %RDEFINE+command and optionally a%PERMIT+
+
+PROFILE%===>_PROFILE                                         {(Enter%NEW{name)
+TYPE   %===>_TYPE    { (Enter%NEW{type)
+
+OWNER  %===>_OWNER   { (Owner of profile)
+UACC   %===>_UACC    { (Access level, NONE/EXECUTE/READ/UPDATE/ALTER/CONTROL)
+WARNING%===>_Z  {      (Warn or fail access, YES/NO)
+DATA   %===>_DATA
+
+FROM   %===>_FROM                     +%===>_FCLASS   { (Profile and Class)
+
{If%FROM{is set to a generic profile name then the%ACCESS LIST{from this
{profile is added to the new profile with a permit command immediately.
%Blank{the FROM field out, if you do%not{want this%permit{command done.
+
+FAILURE%===>_FAIL    { (Failure level to audit, normally READ)
+SUCCESS%===>_SUCC    { (Success level to audit, normally blank)
+
+\ \Press%ENTER+to process or%END+to exit\ \
)INIT
  .ZVARS  = '(WARN)'
  .CURSOR = PROFILE
  .HELP   = #RACCLSA
  &FCLASS = &RCLASS
  &OLDRCL = &RCLASS
  &OLDPRF = &PROFILE
  &OLDTYP = &TYPE
  &FROM   = &PROFILE
  &FAIL   = TRUNC(&FAIL,')')
  &SUCC   = TRUNC(&SUCC,')')
  IF (&PROFILE = NONE)
      &PROFILE = &RFILTER
      &FROM = ' '
  IF (&UACC = ' ')
      &UACC = NONE
)PROC
  IF (&OLDPRF = &PROFILE)
     IF (&OLDTYP = &TYPE)
        IF (&OLDRCL = &RCLASS)
            &PROFILE = ' '
  VER (&PROFILE,NB)
  VER (&OWNER,NB,NAME)
  VER (&TYPE,LIST,GEN,GENERIC,DISCRETE)
  VER (&UACC,NB,LIST,NONE,EXECUTE,READ,ALTER,CONTROL,UPDATE)
  VER (&FAIL,LIST,EXECUTE,READ,ALTER,CONTROL,UPDATE)
  VER (&SUCC,LIST,EXECUTE,READ,ALTER,CONTROL,UPDATE)
  VER (&WARN,NB,LIST,YES,NO)
)END
