//S562TSOB JOB (0910,T),'SCHORTMAN-3312-006',CLASS=T,MSGCLASS=F,
//  NOTIFY=S562TSO,PERFORM=5,PRTY=15
/*JOBPARM LINECT=96
//STEP01 EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN DD DUMMY
//SYSUT1 DD *


***DJDE  DATA=(1,120),FONTINDEX=0,OVERPRINT=MERGE,;
***DJDE  FORMAT=DRHP02,ASSIGN=(1,1),TOF=1,BOF=100,DUPLEX=YES,;
***DJDE  SHIFT=NO,SIDE=NUFRONT,FORMS=NONE,END;
//SYSUT2 DD SYSOUT=H
//*
//*
//*
//STEP01 EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN DD DUMMY
//SYSUT1 DD DSN=S562TSO.JRP.DATA(JRPDOC),DISP=SHR,DCB=RECFM=FBA
//SYSUT2  DD SYSOUT=H,COPIES=5

//STEP01 EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN DD DUMMY
//SYSUT1 DD *
***DJDE  JDL=DFAULT,JDE=DFLT,END;
//SYSUT2 DD SYSOUT=H
