        TITLE 'JES2 EXIT 15 - SET OUTPUT DJDE FOR 9700 PRINTER'
*
***  COPY HASP GLOBALS
*
         COPY  $HASPGBL            COPY HASP GLOBALS
         EJECT
IBHEXT15 $MODULE NOTICE=NONE,      CREATE MODULE INFO TABLE            X
               $HASPEQU,           GENERATE JES2 EQUATES               X
               RESPA,              NEEDED BY $COMWORK                  X
               $BUFFER,            NEEDED FOR $JCT                     X
               $JCT,               NEEDED BY ALL ROUTINES              X
               $JQE,               NEEDED BY ALL ROUTINES              X
               $DCT,                                                   X
               $JOE,                                                   X
               $JOT,                                                   X
               $MIT,               NEEDED BY ALL ROUTINES              X
               $PCE,               NEEDED BY ALL ROUTINES              X
               $PDDB,                                                  X
               $PPPWORK,           NEEDED TO FIND JOE                  X
               $CAT,               NEEDED BY ALL ROUTINES              X
               $HCT                NEEDED BY ALL ROUTINES
         EJECT
         SPACE 1
X15$XRX $ENTRY BASE=R12,CSECT=YES     DEFINE EXIT ENTRY POINT
         SPACE 1
        $SAVE
         LR    R12,R15                 LOAD BASE REGISTER
         SLR   R15,R15                 PRESET RETURN CODE
         C     R0,=F'4'                IS THIS COPY OF A DATASET
         BNE   RETURN                  NO, FORGET IT
         L     R4,16(R1)               GET DCT ADDRESS
         USING DCTDSECT,R4
         L     R7,4(R1)                GET WORK JOE ADDRESS
         USING JOEDSECT,R7
         SPACE 1
*        SEE IF PRINTER IS SELECTING FORMS AUTOMATICALLY
*
*        SEE IF PRINTER IS SET WITH FIRST CLASS OF "Z"
         CLI   DCTCLASS,C'Z'       IS FIRST CLASS A Z?
         BNE   RETURN              NO, SKIP PROCESSING
         SPACE 1
         CLC   =CL7'PRINTER',DCTDEVN   IS THIS CORRECT ENTRY
         BNE   RETURN              NO
         SPACE 1
*        SEE IF WE ARE PROCESSING AN "AUTOMATIC" CLASS
         TRT   JOECURCL,X97CTBL    IS THIS CLASS IN OUR TABLE?
         BZ    RETURN              NO, SKIP FURTHER PROCESSING
         SPACE 1
***************************************************************
* GET WORK AREA
***************************************************************
GETWORK $GETBUF TYPE=HASP,WAIT=YES    GET WORK AREA
         LR    R3,R1                  SAVE BUFFER ADDR
         USING BUFDSECT,R3
         LA    R9,BUFSTART            BUMP PAST BUFFER PREFIX
         SPACE 1
X97INIT  DS     0H       XEROX 9700 PROCESSING
         SPACE 1
         SLR   R2,R2
         TRT   JOECURCL,X97CTBL    GET CLASS OFFSET VALUE
         SLL   R2,2                MUTIPLY BY 4 TO GET TABLE OFFSET
         SPACE 1
*        BUILD THE DJDE BY SEARCH THRU THE CLASS/FORM TABLE
         L     R5,X97@TBL-4(R2)    POINT TO BEGINNING OF CLASS TABLE
         B     FRMCHK
FRMLOOP  CLI   X97XRTBL(R5),X'00'  AT END OF TABLE?
         BE    PRPUT               GO PLANT THE DEFAULT DJDE
         LA    R5,X97XRTBL(R5)     POINT TO NEXT TABLE ENTRY
FRMCHK   CLC   DCTFORMS,1(R5)      IS THIS THE FORM ?
         BE    PRPUT               YES, GO USE IT THEN
         BNE   FRMLOOP             NO, GO CHECK SOME MORE
         SPACE 1
PRPUT    MVC   0(80,R9),10(R5)     COPY THIS DJDE INTO OUTPUT BUFFER
         LR     R1,R9              POINT TO BUFFER
         LA     R0,85         ***  SET DATA LENGTH
         $PRPUT DATA=(R1),LEN=(R0),COUNT=1,WAIT=YES
         SPACE 1
*        FIND THE VFU ENTRY VIA THE VFU CONTROL BYTE IN THE FORM ENTRY
         SLR   R2,R2
         IC    R2,9(R5)            GET THE VFU ENTRY NUMBER
         SLL   R2,2                MUTIPLY BY 4 TO GET TABLE OFFSET
         L     R5,VFU@TBL-4(R2)    GET THE VFU TABLE ENTRY
VFULOOP  CLI   0(R5),X'00'         IS THIS END OF VFU INFO?
         BE    FREEBUF             YES
         MVC   0(80,R9),0(R5)      COPY THIS VFU INTO OUTPUT BUFFER
         LR    R1,R9               POINT TO BUFFER
         LA    R0,85          ***  SET DATA LENGTH
         $PRPUT DATA=(R1),LEN=(R0),COUNT=1,WAIT=YES
         LA    R5,80(R5)           POINT TO NEXT VFU ENTRY LINE
         B     VFULOOP
         SPACE 1
FREEBUF  DS     0H
         $FREEBUF (R3)
         SLR   R15,R15
         SPACE 1
RETURN   $RETURN RC=(R15)
         LTORG
         DROP  R3,R4,R7
         SPACE 1
VFU@TBL  DS    0F
VFU@EN01 DC    A(VFU@VFU1)
VFU@EN02 DC    A(VFU@VFU2)
         SPACE 1
*    VFU1  DEFAULT LANSCAPE (SIMPLEX OR DUPLEX)
VFU@VFU1 DC    CL80'$$DJDE ASSIGN=(1,5),ASSIGN=(12,65),;'
         DC    CL80'$$DJDE TOF=5,BOF=65,END;'
         DC    X'00'  END OF ENTRY
*    VFU2  DEFAULT 2-UP (SIMPLEX OR DUPLEX)
VFU@VFU2 DC    CL80'$$DJDE ASSIGN=(1,(5,71),TOF=5,BOF=132,;'
         DC    CL80'$$DJDE SIDE=NUFRONT,END;'
         DC    X'00'  END OF ENTRY
         SPACE 1
X97CTBL  DC    256X'00'
         ORG   X97CTBL+C'A'
         DC    AL1(1)
         ORG   X97CTBL+C'C'
         DC    AL1(2)
         ORG   X97CTBL+C'D'
         DC    AL1(3)
         ORG   X97CTBL+C'E'
         DC    AL1(4)
         ORG   X97CTBL+C'F'
         DC    AL1(5)
         ORG   X97CTBL+C'I'
         DC    AL1(6)
         ORG   X97CTBL+C'K'
         DC    AL1(7)
         ORG   X97CTBL+C'L'
         DC    AL1(0)
         ORG   X97CTBL+C'X'
         DC    AL1(9)
         ORG   X97CTBL+C'1'
         DC    AL1(10,11,12,13,14)
         ORG
X97@TBL  DS    0F
X97@EN01 DC    A(CLASS@A)
X97@EN02 DC    A(CLASS@C)
X97@EN03 DC    A(CLASS@D)
X97@EN04 DC    A(CLASS@E)
X97@EN05 DC    A(CLASS@F)
X97@EN06 DC    A(CLASS@I)
X97@EN07 DC    A(CLASS@K)
X97@EN08 DC    A(CLASS@L)
X97@EN09 DC    A(CLASS@X)
X97@EN10 DC    A(CLASS@1)
X97@EN11 DC    A(CLASS@2)
X97@EN12 DC    A(CLASS@3)
X97@EN13 DC    A(CLASS@4)
X97@EN14 DC    A(CLASS@5)
         SPACE 1
CLASS@A  EQU   *     CLASS FORM/DJDE XREF TABLE
* LAST ENTRY FOR A CLASS IS THE DEFAULT, SO ADD NEW ENTRIES
* AT THE FRONT
 DC C'AD1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=1,;'
X97XRTBL EQU   *-CLASS@A    LENGTH OF ONE ENTRY
 DC C'AD1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1RX,COPIES=1,;'
 DC C'AD2R3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2R3,COPIES=1,;'
 DC C'AD2RX    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2RX,COPIES=1,;'
 DC C'AD2W3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=NONE,COPIES=1,;'
 DC C'ASTD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=1,;'
         DC    X'00'  END OF TABLE
CLASS@C  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'CD1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=1,;'
 DC C'CSTD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=1,;'
         DC    X'00'  END OF TABLE
CLASS@D  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'DD1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=2,;'
 DC C'DSTD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=2,;'
         DC    X'00'  END OF TABLE
CLASS@E  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'ED1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=3,;'
 DC C'ESTD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=3,;'
         DC    X'00'  END OF TABLE
CLASS@F  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'FD1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=4,;'
 DC C'FSTD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=4,;'
         DC    X'00'  END OF TABLE
CLASS@I  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'ID1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=1,;'
 DC C'ID1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1WX,COPIES=1,;'
 DC C'IS1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=1,;'
 DC C'ISTD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=1,;'
         DC    X'00'  END OF TABLE
CLASS@K  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'KD1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=1,;'
 DC C'KD1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1RX,COPIES=1,;'
 DC C'KD2R3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2R3,COPIES=1,;'
 DC C'KD2RX    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2RX,COPIES=1,;'
 DC C'KD2W3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=NONE,COPIES=1,;'
 DC C'KSTD     ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2R3,COPIES=1,;'
         DC    X'00'  END OF TABLE
CLASS@L  EQU   *     CLASS FORM/DJDE XREF TABLE
         DC    X'00'  END OF TABLE
CLASS@X  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'XD1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=1,;'
         DC    X'00'  END OF TABLE
CLASS@1  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'1D1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=1,;'
 DC C'1D1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1RX,COPIES=1,;'
 DC C'1D1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1WX,COPIES=1,;'
 DC C'1D1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=1,;'
 DC C'1D2R3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2R3,COPIES=1,;'
 DC C'1D2RX    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2RX,COPIES=1,;'
 DC C'1D2W3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=NONE,COPIES=1,;'
 DC C'1S1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=1,;'
 DC C'1S1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1RX,COPIES=1,;'
 DC C'1S1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1WX,COPIES=1,;'
 DC C'1S1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=1,;'
 DC C'1STD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=1,;'
         DC    X'00'  END OF TABLE
CLASS@2  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'2D1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=2,;'
 DC C'2D1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1RX,COPIES=2,;'
 DC C'2D1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1WX,COPIES=2,;'
 DC C'2D1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=2,;'
 DC C'2D2R3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2R3,COPIES=2,;'
 DC C'2D2RX    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2RX,COPIES=2,;'
 DC C'2D2W3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=NONE,COPIES=2,;'
 DC C'2S1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=2,;'
 DC C'2S1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1RX,COPIES=2,;'
 DC C'2S1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1WX,COPIES=2,;'
 DC C'2S1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=2,;'
 DC C'2STD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=2,;'
         DC    X'00'  END OF TABLE
CLASS@3  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'3D1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=3,;'
 DC C'3D1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1RX,COPIES=3,;'
 DC C'3D1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=3,;'
 DC C'3D1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1WX,COPIES=3,;'
 DC C'3D2R3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2R3,COPIES=3,;'
 DC C'3D2RX    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2RX,COPIES=3,;'
 DC C'3D2W3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=NONE,COPIES=3,;'
 DC C'3S1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=3,;'
 DC C'3S1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1RX,COPIES=3,;'
 DC C'3S1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=3,;'
 DC C'3S1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1WX,COPIES=3,;'
 DC C'3STD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=3,;'
         DC    X'00'  END OF TABLE
CLASS@4  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'4D1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=4,;'
 DC C'4D1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1RX,COPIES=4,;'
 DC C'4D1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=4,;'
 DC C'4D1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1WX,COPIES=4,;'
 DC C'4D2R3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2R3,COPIES=4,;'
 DC C'4D2RX    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2RX,COPIES=4,;'
 DC C'4D2W3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=NONE,COPIES=4,;'
 DC C'4S1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=4,;'
 DC C'4S1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1RX,COPIES=4,;'
 DC C'4S1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=4,;'
 DC C'4S1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1WX,COPIES=4,;'
 DC C'4STD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=4,;'
         DC    X'00'  END OF TABLE
CLASS@5  EQU   *     CLASS FORM/DJDE XREF TABLE
 DC C'5D1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1R3,COPIES=5,;'
 DC C'5D1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1RX,COPIES=5,;'
 DC C'5D1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=5,;'
 DC C'5D1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=D1WX,COPIES=5,;'
 DC C'5D2R3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2R3,COPIES=5,;'
 DC C'5D2RX    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=D2RX,COPIES=5,;'
 DC C'5D2W3    ',AL1(2),CL80'$$DJDE FORMAT=FMT10,FORMS=NONE,COPIES=5,;'
 DC C'5S1R3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=5,;'
 DC C'5S1RX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1RX,COPIES=5,;'
 DC C'5S1W3    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=NONE,COPIES=5,;'
 DC C'5S1WX    ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1WX,COPIES=5,;'
 DC C'5STD     ',AL1(1),CL80'$$DJDE FORMAT=FMT1,FORMS=S1R3,COPIES=5,;'
         DC    X'00'  END OF TABLE
         $MODEND
         END
