//ZATLAS1R JOB (12345678),ZATLAS1,MSGCLASS=H,
//        MSGLEVEL=(1,1),CLASS=A,NOTIFY=&SYSUID
//***************************************************************
//***************JCL CREATED BY ZEEV ATLAS  *********************
//***************************************************************
//*
// SET PARMHLQ=ZATLAS1
// SET PARMMLQ=PCRE2
// SET PARMLLQ=ASM
// SET IFILE=&PARMHLQ..ZOS.ASM
//UPDTE EXEC PGM=IEBUPDTE
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DSNAME=&PARMHLQ..&PARMMLQ..&PARMLLQ,DISP=SHR <== MODIFY
//SYSUT2   DD  DSNAME=&PARMHLQ..&PARMMLQ..&PARMLLQ,DISP=SHR <== MODIFY
//SYSIN    DD  DSN=&IFILE,DISP=SHR
// SET PARMMLQ=C14
// SET PARMLLQ=MACLIB
// SET IFILE=&PARMHLQ..C14.IEB
//UPDTE EXEC PGM=IEBUPDTE
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DSNAME=&PARMHLQ..&PARMMLQ..&PARMLLQ,DISP=SHR <== MODIFY
//SYSUT2   DD  DSNAME=&PARMHLQ..&PARMMLQ..&PARMLLQ,DISP=SHR <== MODIFY
//SYSIN    DD  DSN=&IFILE,DISP=SHR
//
