         MACRO
         VPUTSUB
.*       THIS MACRO IS THE SUBROUTINE CALLED BY THE $VPUT MACRO
.*       THE $VPUT MACRO REPLACES THE NAMED ISPF VARIABLE
.*       WITH THE @ID WHICH IS PART OF THE NAMELIST.
.*
.*       A VDEFINE IS THEN PERFORMED TO INFORM ISPF OF THE VARIABLE
.*       WE WANT TO UPDATE.
.*
.*       A VPUT IS THEN PERFORMED TO UPDATE THE ISPF VARIABLE FROM
.*       OUR WORK AREA.
.*
.*       A VDELETE IS THEN DONE TO FREE THE STORAGE AND DEFINITION
.*
.*
VPUTSUB  DS    0H
         ST    R14,@RETURN
         CALL  ISPLINK,(@VDEF,@SPFNLST,@SPFVAR,@SPFCHAR,@LEN,@OPT),VL
         CALL  ISPLINK,(@VPUT,@SPFNLST),VL
         CALL  ISPLINK,(@VDELETE,@SPFNLST),VL
         MVC   @ID,=CL8' '         RESET @ID FOR NEXT USE
         XC    @SPFVAR,@SPFVAR     RESET DATA FIELD
         L     R14,@RETURN
         BR    R14                      RETURN TO CALLER
@RETURN  DS    F
@VDELETE DC    C'VDELETE'
@VDEF    DC    C'VDEFINE'
@SPFNLST DC    C'('
@ID      DC    CL8' ',C')'
@SPFCHAR DC    C'CHAR'
@LEN     DC    F'80'
@OPT     DC    C'(NOBSCAN)'
@VPUT    DC    C'VPUT'
@SPFVAR  DC    CL80' '
         MEND
