//*                                                                      ASMASAP
//ASMASAP   EXEC  ASMHCL                                                 ASMASAP
//C.SYSLIB  DD  DISP=SHR,DSN=asap.source.dataset                         ASMASAP
//          DD  DISP=SHR,DSN=SYS1.MACLIB                                 ASMASAP
//C.SYSIN   DD  DISP=SHR,DSN=asap.source.dataset(IEBASAP)                ASMASAP
//L.SYSLMOD DD  DISP=SHR,DSN=your.program.load.library                   ASMASAP
//L.SYSIN   DD  *                                                        ASMASAP
  NAME IEBASAP(R)                                                        ASMASAP
/*                                                                       ASMASAP
//                                                                       ASMASAP
