/*REXX***********************************************************rexx*/
/* shows how to obtain upper and lower case input from the user with */
/* a PULL keyword instruction preceded by the PARSE keyword.         */
/*********************************************************************/
say "Enter an animal name in mixed upper and lower case"
pull name
say name 'notice it appears in all upper case'
say 'Now enter the same name again in upper and lower case'
parse pull name
say name 'when PULL is preceded by PARSE input case is retained'
