//REASMLNK PROC
//ASM    EXEC  PGM=ASMA90,REGION=7000K,
//             PARM=(DECK,NOOBJECT,NORLD,RENT,TERM,'XREF(SHORT)')
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(CYL,(10,5))
//SYSUT2   DD  UNIT=SYSALLDA,SPACE=(CYL,(10,5))
//SYSUT3   DD  UNIT=SYSALLDA,SPACE=(CYL,(10,5))
//SYSPUNCH DD  UNIT=SYSALLDA,SPACE=(TRK,(5,5)),DISP=(MOD,PASS),DSN=&&X,
//             DCB=BLKSIZE=3120
//SYSPRINT DD  SYSOUT=*
//SYSTERM  DD  SYSOUT=*
//SYSLIB   DD  DSN=SBGOLOB.R11.MODGEN,DISP=SHR,DCB=BLKSIZE=23440
//         DD  DSN=SBGOLOB.R11.MACLIB,DISP=SHR
//LKED   EXEC  PGM=IEWL,PARM='MAP,RENT,REUS,REFR,LET,NCAL',COND=(0,LT)
//SYSPRINT DD  SYSOUT=*
//SYSLIBX  DD  DSN=&&X,DISP=(OLD,DELETE)
//SYSLMOD  DD  DISP=SHR,DSN=&OUTPUT
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(TRK,(5,5))
//       PEND
