//CMPREXX JOB (ACCTNUM,EXP),'COMP REXX    ',                            KDS08182
//         TIME=1440,                                                   KDS08182
//         NOTIFY=&SYSUID,                                              KDS08182
//         CLASS=A,                                                     KDS08182
//         MSGCLASS=X,                                                  KDS08182
//         MSGLEVEL=(1,1)                                               KDS08182
//PROCLIB JCLLIB ORDER=(ADCD.ZOSV1R3.PROCLIB)
//S1 EXEC REXXCL,STUB=MVS
//REXX.SYSIN   DD DSN=IBMUSER.JCS.LIB(JCSBCKRC),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.PROG.LOAD.KANG(JCSBCKRC),DISP=SHR
