      *================================================================*KDS08257
      * KKKKKKKKKKKKK   DDDDDDDD    SSSSSSSS                           *KDS08257
      * KKKKKKKKKKKKK  DDDDDDDDD   SSSSSSSSS                           *KDS08257
      *      KKKK      DDDD        SSSS                                *KDS08257
      *      KKKK      DDDD        SSSS                                *KDS08257
      *      KKKK      DDDD        SSSS          1111          0000000 *KDS08257
      *      KKKK      DDDDDDDD    SSSSSSSS      1111        0000000000*KDS08257
      *      KKKK        DDDDDDD    SSSSSSSS     1111        0000  0000*KDS08257
      *      KKKK           DDDD        SSSS    1111         0000  0000*KDS08257
      *      KKKK           DDDD        SSSS    1111        0000  0000 *KDS08257
      *      KKKK           DDDD        SSSS    1111        0000  0000 *KDS08257
      * KKK  KKKK           DDDD        SSSS   1111   0000  0000  0000 *KDS08257
      * KKKKKKKK      DDDDDDDDDD   SSSSSSSSS   1111  0000  0000000000  *KDS08257
      * KKKKKKKK      DDDDDDDDD    SSSSSSSS    1111 0000    000000000  *KDS08257
      *================================================================*KDS08257
      ******************************************************************KDS08257
      * Created   By :Kang Dengsong                                   * KDS08257
      * Created Date :SEP 13, 2008                                    * KDS08257
      * Remark       :MAST JOB CTRL FILE(VSAM FIX LENGTH=500)         * KDS08257
      *              :Job scheduler system                            * KDS08257
      ******************************************************************KDS08257
      *01 :JCBMAST:-REC.                                                KDS08257
          10 :JCBMAST:-KEY.                                             KDS08257
             15 :JCBMAST:-AP-SYSID            PIC X(08).                KDS08257
             15 :JCBMAST:-JOB                 PIC X(08).                KDS08257
          10 :JCBMAST:-STS                    PIC X(03).                KDS08257
      * 'ACT' - ACTIVE 'INA' - INACTIVE                                 KDS08257
          10 :JCBMAST:-EXEC-FREQ1             PIC X(05).                KDS08257
             88 :JCBMAST:-EXEC1-ANY           VALUE 'ANY  '.            KDS08257
             88 :JCBMAST:-EXEC1-DAILY         VALUE 'DAILY'.            KDS08257
             88 :JCBMAST:-EXEC1-MONTH         VALUE 'MONTH'.            KDS08257
             88 :JCBMAST:-EXEC1-WEEK          VALUE 'WEEK'.             KDS08257
             88 :JCBMAST:-EXEC1-LOGON         VALUE 'LOGON'.            KDS08257
             88 :JCBMAST:-EXEC1-ONCE          VALUE 'ONCE '.            KDS08257
             88 :JCBMAST:-EXEC1-SPACE         VALUE '     '.            KDS08257
             88 :JCBMAST:-EXEC1-MONTH-ST      VALUE 'MONST'.            KDS08257
             88 :JCBMAST:-EXEC1-MONTH-ED      VALUE 'MONED'.            KDS08257
             88 :JCBMAST:-EXEC1-WEEK-END      VALUE 'WKEND'.            KDS08257
             88 :JCBMAST:-EXEC1-QTR-END       VALUE 'QREND'.            KDS08257
             88 :JCBMAST:-EXEC1-YAR-END       VALUE 'YREND'.            KDS08257
          10 :JCBMAST:-EXEC-FREQ1-SUFFIX      PIC X(03).                KDS08257
      *     'DAILY'  'MONTH' 'WEEK' 'LOGON' 'ONCE'                      KDS08257
          10 :JCBMAST:-EXEC-FREQ2             PIC X(08).                KDS08257
             88 :JCBMAST:-EXEC2-ANY           VALUE 'ANY  '.            KDS08257
             88 :JCBMAST:-EXEC2-DAILY         VALUE 'DAILY'.            KDS08257
             88 :JCBMAST:-EXEC2-MONTH         VALUE 'MONTH'.            KDS08257
             88 :JCBMAST:-EXEC2-WEEK          VALUE 'WEEK '.            KDS08257
             88 :JCBMAST:-EXEC2-LOGON         VALUE 'LOGON'.            KDS08257
             88 :JCBMAST:-EXEC2-ONCE          VALUE 'ONCE '.            KDS08257
             88 :JCBMAST:-EXEC2-SPACE         VALUE '     '.            KDS08257
             88 :JCBMAST:-EXEC2-MONTH-ST      VALUE 'MONST'.            KDS08257
             88 :JCBMAST:-EXEC2-MONTH-ED      VALUE 'MONED'.            KDS08257
             88 :JCBMAST:-EXEC2-WEEK-END      VALUE 'WKEND'.            KDS08257
             88 :JCBMAST:-EXEC2-QTR-END       VALUE 'QREND'.            KDS08257
             88 :JCBMAST:-EXEC2-YAR-END       VALUE 'YREND'.            KDS08257
          10 :JCBMAST:-EXEC-FREQ2-SUFFIX      PIC X(03).                KDS08257
      *     'DAILY'  'MONTH' 'WEEK' 'LOGON' 'ONCE'                      KDS08257
          10 :JCBMAST:-EXEC-FREQ3             PIC X(08).                KDS08257
             88 :JCBMAST:-EXEC3-ANY           VALUE 'ANY  '.            KDS08257
             88 :JCBMAST:-EXEC3-DAILY         VALUE 'DAILY'.            KDS08257
             88 :JCBMAST:-EXEC3-MONTH         VALUE 'MONTH'.            KDS08257
             88 :JCBMAST:-EXEC3-WEEK          VALUE 'WEEK'.             KDS08257
             88 :JCBMAST:-EXEC3-LOGON         VALUE 'LOGON'.            KDS08257
             88 :JCBMAST:-EXEC3-ONCE          VALUE 'ONCE '.            KDS08257
             88 :JCBMAST:-EXEC3-SPACE         VALUE '     '.            KDS08257
             88 :JCBMAST:-EXEC3-MONTH-ST      VALUE 'MONST'.            KDS08257
             88 :JCBMAST:-EXEC3-MONTH-ED      VALUE 'MONED'.            KDS08257
             88 :JCBMAST:-EXEC3-WEEK-END      VALUE 'WKEND'.            KDS08257
             88 :JCBMAST:-EXEC3-QTR-END       VALUE 'QREND'.            KDS08257
             88 :JCBMAST:-EXEC3-YAR-END       VALUE 'YREND'.            KDS08257
          10 :JCBMAST:-EXEC-FREQ3-SUFFIX      PIC X(03).                KDS08257
      *     'DAILY'  'MONTH' 'WEEK' 'LOGON' 'ONCE'                      KDS08257
          10 :JCBMAST:-EXEC-DATE              PIC X(08).                KDS08257
          10 :JCBMAST:-EXEC-TIME.                                       KDS08257
             15 :JCBMAST:-EXEC-HH             PIC 9(02).                KDS08257
             15 :JCBMAST:-EXEC-MM             PIC 9(02).                KDS08257
             15 :JCBMAST:-EXEC-SS             PIC 9(02).                KDS08257
          10 :JCBMAST:-EXEC-ST-DATE           PIC X(08).                KDS08257
          10 :JCBMAST:-EXEC-ST-DATE-9 REDEFINES :JCBMAST:-EXEC-ST-DATE  KDS08257
                                              PIC 9(08).                KDS08257
          10 FILLER REDEFINES :JCBMAST:-EXEC-ST-DATE.                   KDS08257
             15 :JCBMAST:-EXEC-ST-DATE-YYYY   PIC 9(04).                KDS08257
             15 :JCBMAST:-EXEC-ST-DATE-MM     PIC 9(02).                KDS08257
             15 :JCBMAST:-EXEC-ST-DATE-DD     PIC 9(02).                KDS08257
          10 :JCBMAST:-EXEC-ST-TIME           PIC X(08).                KDS08257
          10 FILLER REDEFINES :JCBMAST:-EXEC-ST-TIME.                   KDS08257
             15 :JCBMAST:-EXEC-ST-TIME-HH     PIC 9(02).                KDS08257
             15 :JCBMAST:-EXEC-ST-TIME-MM     PIC 9(02).                KDS08257
             15 :JCBMAST:-EXEC-ST-TIME-SS     PIC 9(02).                KDS08257
             15 :JCBMAST:-EXEC-ST-TIME-MS     PIC 9(02).                KDS08257
          10 :JCBMAST:-EXEC-ST-TIME-9  REDEFINES :JCBMAST:-EXEC-ST-TIME KDS08257
                                              PIC 9(08).                KDS08257
          10 :JCBMAST:-EXEC-ED-DATE           PIC X(08).                KDS08257
          10 :JCBMAST:-EXEC-ED-DATE-9 REDEFINES :JCBMAST:-EXEC-ED-DATE  KDS08257
                                              PIC 9(08).                KDS08257
          10 FILLER REDEFINES :JCBMAST:-EXEC-ED-DATE.                   KDS08257
             15 :JCBMAST:-EXEC-ED-DATE-YYYY   PIC 9(04).                KDS08257
             15 :JCBMAST:-EXEC-ED-DATE-MM     PIC 9(02).                KDS08257
             15 :JCBMAST:-EXEC-ED-DATE-DD     PIC 9(02).                KDS08257
          10 :JCBMAST:-EXEC-ED-TIME           PIC X(08).                KDS08257
          10 FILLER REDEFINES :JCBMAST:-EXEC-ED-TIME.                   KDS08257
             15 :JCBMAST:-EXEC-ED-TIME-HH     PIC 9(02).                KDS08257
             15 :JCBMAST:-EXEC-ED-TIME-MM     PIC 9(02).                KDS08257
             15 :JCBMAST:-EXEC-ED-TIME-SS     PIC 9(02).                KDS08257
             15 :JCBMAST:-EXEC-ED-TIME-MS     PIC 9(02).                KDS08257
          10 :JCBMAST:-EXEC-VAR-TIME          PIC 9(03).                KDS08257
          10 :JCBMAST:-EXEC-RC-LAST           PIC 9(11) COMP-3.         KDS08257
          10 :JCBMAST:-EXEC-RC-LAST-C REDEFINES :JCBMAST:-EXEC-RC-LAST  KDS08257
                                              PIC X(06).                KDS08257
          10 :JCBMAST:-EXEC-MODE              PIC X(01).                KDS08257
             88 :JCBMAST:-EXEC--IPL           VALUE 'I'.                KDS08257
             88 :JCBMAST:-EXEC-CONSOLE        VALUE 'C'.                KDS08257
             88 :JCBMAST:-EXEC-SDSF           VALUE 'J'.                KDS08257
             88 :JCBMAST:-EXEC-CICS           VALUE 'C'.                KDS08257
             88 :JCBMAST:-EXEC-OTHER          VALUE 'O'.                KDS08257
      *      'I' - IPL SYSTEM START                                     KDS08257
      *      'C' - CONSOLE                                              KDS08257
      *      'J' - SDSF                                                 KDS08257
      *      'C' - CICS                                                 KDS08257
      *      'O' - OTHER                                                KDS08257
          10 :JCBMAST:-PREV-JOB-CNT           PIC 9(03).                KDS08257
          10 :JCBMAST:-PREV-JOB-GRP.                                    KDS08257
             15 :JCBMAST:-PREV-JOB            OCCURS 8 TIMES  PIC X(08).KDS08257
             15 :JCBMAST:-PREV-JOB-STS        OCCURS 8 TIMES  PIC X(01).KDS08257
          10 :JCBMAST:-SUCC-JOB-CNT           PIC 9(03).                KDS08257
          10 :JCBMAST:-SUCC-JOB-GRP.                                    KDS08257
             15 :JCBMAST:-SUCC-JOB            OCCURS 8 TIMES  PIC X(08).KDS08257
          10 :JCBMAST:-AUTO-TRIGER            PIC X(01).                KDS08257
      *   'Y' - YES 'N' - NO                                            KDS08257
          10 :JCBMAST:-JOB-STATUS             PIC X(01).                KDS08257
      *   'S' - SUCESSFULLY                                             KDS08257
      *   'F' - FAIL                                                    KDS08257
      *   'A' - ABEND                                                   KDS08257
          10 :JCBMAST:-MAX-ACEPT-RC           PIC X(02).                KDS08257
      *   'Y' - YES 'N' - NO                                            KDS08257
          10 :JCBMAST:-SKIP-IND               PIC X(01).                KDS08257
      *   'Y' - YES 'N' - NO                                            KDS08257
          10 :JCBMAST:-RECOVER-IND            PIC X(01).                KDS08257
      *   'Y' - YES     'N' - NO                                        KDS08257
          10 :JCBMAST:-RECOVER-STS            PIC X(01).                KDS08257
      *   'F' - HAVE ROLLBACK ' ' - NO ROLLBACK 'S' - SUBMIT            KDS08257
          10 :JCBMAST:-COST-TIME              PIC S9(08)V99 COMP-3.     KDS08257
      *   COST TIME UNIT IS SECONDS                                     KDS08257
          10 :JCBMAST:-ERROR-STEP             PIC X(08).                KDS08257
          10 :JCBMAST:-ERROR-CODE             PIC X(04).                KDS08257
          10 :JCBMAST:-ERROR-CODE-9 REDEFINES :JCBMAST:-ERROR-CODE      KDS08257
                                              PIC X(04).                KDS08257
          10 :JCBMAST:-REOVER-PROC            PIC X(08).                KDS08257
      *   RECOVER PROC (NO USER NOW)                                    KDS08257
          10 :JCBMAST:-DEPEND-GRP OCCURS 3  TIMES.                      KDS08257
             15 :JCBMAST:-DEPEND-VALUE0       PIC X(08).                KDS08257
             15 :JCBMAST:-DEPEND-VALUE0-9 REDEFINES                     KDS08257
                :JCBMAST:-DEPEND-VALUE0       PIC 9(08).                KDS08257
             15 :JCBMAST:-DEPEND-RELATE       PIC X(02).                KDS08257
      *   EQ:= NE:<> GT:> GE:>= LT: <  LE: <=                           KDS08257
      *   BI:BETWEEN IN XB:NOT BETWEEN IN                               KDS08257
             15 :JCBMAST:-DEPEND-TYPE         PIC X(01).                KDS08257
      *   N:NUMERIC  X:CHAR                                             KDS08257
             15 :JCBMAST:-DEPEND-VALUE1       PIC X(08).                KDS08257
             15 :JCBMAST:-DEPEND-VALUE1-9 REDEFINES                     KDS08257
                :JCBMAST:-DEPEND-VALUE1       PIC 9(08).                KDS08257
             15 :JCBMAST:-DEPEND-VALUE2       PIC X(08).                KDS08257
             15 :JCBMAST:-DEPEND-VALUE2-9 REDEFINES                     KDS08257
                :JCBMAST:-DEPEND-VALUE2       PIC 9(08).                KDS08257
          10 :JCBMAST:-CAN-RERUN-IND          PIC X(01).                KDS08257
          10 :JCBMAST:-END-JOB-IND            PIC X(01).                KDS08257
          10 FILLER                           PIC X(137).               KDS08257
