//* *==================================================================*KDS08257
//* * KKKKKKKKKKKKK   DDDDDDDD    SSSSSSSS                             *KDS08257
//* * KKKKKKKKKKKKK  DDDDDDDDD   SSSSSSSSS                             *KDS08257
//* *      KKKK      DDDD        SSSS                                  *KDS08257
//* *      KKKK      DDDD        SSSS                                  *KDS08257
//* *      KKKK      DDDD        SSSS          1111          0000000   *KDS08257
//* *      KKKK      DDDDDDDD    SSSSSSSS      1111        0000000000  *KDS08257
//* *      KKKK        DDDDDDD    SSSSSSSS     1111        0000  0000  *KDS08257
//* *      KKKK           DDDD        SSSS    1111         0000  0000  *KDS08257
//* *      KKKK           DDDD        SSSS    1111        0000  0000   *KDS08257
//* *      KKKK           DDDD        SSSS    1111        0000  0000   *KDS08257
//* * KKK  KKKK           DDDD        SSSS   1111   0000  0000  0000   *KDS08257
//* * KKKKKKKK      DDDDDDDDDD   SSSSSSSSS   1111  0000  0000000000    *KDS08257
//* * KKKKKKKK      DDDDDDDDD    SSSSSSSS    1111 0000    000000000    *KDS08257
//* *==================================================================*KDS08257
//* ******************************************************************  KDS08257
//* * CREATED   BY :KANG DENGSONG                                    *  KDS08257
//* * CREATED DATE :SEP 13, 2008                                     *  KDS08257
//* * REMARK       :PROC                                             *  KDS08257
//* *              :JOB SCHEDULER SYSTEM                             *  KDS08257
//* ******************************************************************  KDS08257
//* *================================================================*  KDS08257
//* *   This program is distributed without warranty of any kind,    *  KDS08257
//* * including  (without limitation) warranties of merchantability  *  KDS08257
//* * and of fitness for a particular purpose. it is up to the user  *  KDS08257
//* * to make his own determination of the usefulness of this program*  KDS08257
//* * in his own system.                                             *  KDS08257
//* *================================================================*  KDS08257
//JCSPDELT EXEC PGM=IEFBR14,COND=(EVEN)                                 KDS08257
//DD01     DD DSN=&HLQ1..&HLQ2..&HLQ3..STEP.RC,                         KDS08257
//            DISP=(MOD,DELETE,DELETE),                                 KDS08257
//            SPACE=(CYL,(1,1))                                         KDS08257
//DD02     DD DSN=&HLQ1..&HLQ2..&HLQ3..JCSFDTTM,
//            DISP=(MOD,DELETE,DELETE),
//            SPACE=(CYL,(1,1))
