//* *================================================================*  KDS08257
//* * KKKKKKKKKKKKK   DDDDDDDD    SSSSSSSS                           *  KDS08257
//* * KKKKKKKKKKKKK  DDDDDDDDD   SSSSSSSSS                           *  KDS08257
//* *      KKKK      DDDD        SSSS                                *  KDS08257
//* *      KKKK      DDDD        SSSS                                *  KDS08257
//* *      KKKK      DDDD        SSSS          1111          0000000 *  KDS08257
//* *      KKKK      DDDDDDDD    SSSSSSSS      1111        0000000000*  KDS08257
//* *      KKKK        DDDDDDD    SSSSSSSS     1111        0000  0000*  KDS08257
//* *      KKKK           DDDD        SSSS    1111         0000  0000*  KDS08257
//* *      KKKK           DDDD        SSSS    1111        0000  0000 *  KDS08257
//* *      KKKK           DDDD        SSSS    1111        0000  0000 *  KDS08257
//* * KKK  KKKK           DDDD        SSSS   1111   0000  0000  0000 *  KDS08257
//* * KKKKKKKK      DDDDDDDDDD   SSSSSSSSS   1111  0000  0000000000  *  KDS08257
//* * KKKKKKKK      DDDDDDDDD    SSSSSSSS    1111 0000    000000000  *  KDS08257
//* *================================================================*  KDS08257
//* ******************************************************************  KDS08257
//* * Created   by :Kang dengsong                                    *  KDS08257
//* * Created date :Sep 13, 2008                                     *  KDS08257
//* * Remark       :Proc                                             *  KDS08257
//* *              :Job Scheduler System                             *  KDS08257
//* ******************************************************************  KDS08257
//* *================================================================*  KDS08257
//* *   This program is distributed without warranty of any kind,    *  KDS08257
//* * including  (without limitation) warranties of merchantability  *  KDS08257
//* * and of fitness for a particular purpose. it is up to the user  *  KDS08257
//* * to make his own determination of the usefulness of this program*  KDS08257
//* * in his own system.                                             *  KDS08257
//* *================================================================*  KDS08257
//JCSPWELA  EXEC PGM=JCSBAPNM                                           KDS08257
//STEPLIB   DD DISP=SHR,DSN=&LOAD                                       KDS08257
//JCSFAPSB  DD DISP=SHR,DSN=&HLQ1..&HLQ2..JCSFAPSB                      KDS08257
//DATECNTL  DD DISP=SHR,DSN=&HLQ1..&HLQ2..DATECNTL                      KDS08257
//JCSFSPRC  DD DISP=SHR,DSN=&HLQ1..&HLQ2..&HLQ3..STEP.RC                KDS08257
//JCSFJOBH  DD DISP=SHR,DSN=&HLQ1..&HLQ2..JCSFJOBH                      KDS08257
//JCSFJOB1  DD DISP=SHR,DSN=&HLQ1..&HLQ2..JCSFJOBH                      KDS08257
//JCSFSTEP  DD DISP=SHR,DSN=&HLQ1..&HLQ2..JCSFSTEP                      KDS08257
//JCSFDTTM  DD DISP=SHR,DSN=&HLQ1..&HLQ2..&HLQ3..JCSFDTTM               KDS08257
//JOBSUB    DD SYSOUT=(A,INTRDR)                                        KDS08257
//SYSOUT    DD SYSOUT=*                                                 KDS08257
//SYSABEND  DD SYSOUT=*                                                 KDS08257
//SYSMDUMP  DD SYSOUT=*                                                 KDS08257
//SYSUDUMP  DD SYSOUT=*                                                 KDS08257
//SYSPRINT  DD SYSOUT=*                                                 KDS08257
//SYSIN     DD SYSOUT=*                                                 KDS08257
