*
 DC C'"COPYRIGHT (C) 2002 by Jan (Janek) Jakubek. '
 DC C'ALL RIGHTS  RESERVED EXCEPT:  PARTICULAR LICENSE IS GRANTED TO '
 DC C'DISTRIBUTE THIS PROGRAM FREE OF CHARGE, '
 DC C'BUT IT MUST NOT BE SOLD."'
*
