//$XMIT JOB NOTIFY=&SYSUID
/*ROUTE PRINT U2
//TSO    EXEC  PGM=IKJEFT01
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSTSIN  DD  *
XMIT A.A DSN('JES2.SHARE.NERDC.Q520') -
     OUTDSN('JES2.SHARE.NERDC.Q520XMIT')
