//* This job uses the data set name standard used to prepare the PDS
//* submitted to cbttape.org: userid.HLASM.V2L4.CBT.PDS.  Modify this
//* job to orrespond to the name standard being used, add a JOB
//* statement to correspond to your standard and submit the job.
//*
//* This job assembles the source module in member SOURCE and links
//* the object deck in batch.
//PREPARE EXEC PGM=IEFBR14
//LOAD     DD  DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,0),
//             DSN=&SYSUID..CBT966.LOAD
//ASM     EXEC PGM=ASMA90,PARM='OBJECT,NODECK,NOTEST'
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DSN=SYS1.MODGEN
//         DD  DISP=SHR,DSN=SYS1.MACLIB
//SYSLIN   DD  DISP=(,PASS),UNIT=SYSDA,SPACE=(TRK,(1,1)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//SYSIN    DD  DISP=SHR,DSN=&SYSUID.HLASM.V2L4.CBT.PDS(SOURCE)
//INSTALL EXEC PGM=IEWL,PARM='MAP,XREF,LIST,RENT,REFR,REUS'
//SYSPRINT DD  SYSOUT=*
//SYSLMOD  DD  DISP=(,CATLG),UNIT=SYSDA,SPACE=(TRK,(1,1,1)),
//             DSN=*.PREPARE.LOAD
//SYSLIN   DD  DISP=DISP=OLD,DSN=*.ASM.SYSLIN
//         DD  *
 ENTRY HLASM
 ALIAS HLASM
 NAME HLASM24(R)
