//IGYWCL   JOB  ACCOUNT,'COBOL COMPILE',
//         CLASS=F,
//         MSGCLASS=H,
//         NOTIFY=&SYSUID
//PROCLIB  JCLLIB ORDER=(IGY420.SIGYPROC)
//SCEELKED SET  SCEELKED=CEE.SCEELKED Change as needed.
//TESTCOB2 EXEC IGYWCL,
//         LNGPRFX='IGY420',
//         PARM.LKED=(LET,LIST,XREF,MAP,CALL)
//COBOL.SYSIN DD DISP=SHR,DSN=&SYSUID..SQLITE38.CNTL(TESTCOB2)
//COBOL.SYSLIB DD DISP=SHR,DSN=CEE.SCEESAMP
//             DD DISP=SHR,DSN=&SYSUID..SQLITE38.CNTL
//LKED.SYSLIB DD
//            DD DISP=SHR,DSN=&SYSUID..SQLITE38.LINKLIB
//            DD DISP=SHR,DSN=&SCEELKED
//LKED.SYSLMOD DD DSN=&SYSUID..SQLITE38.LINKLIB,DISP=SHR
//
