++USERMOD (A$$W016)   /*
      THIS USERMOD IS TO INSTALL THE
      SVC MODULE FOR CAEDS (RAY SMITH)

      SVC = 224 - TYPE 3
                                               07/27/88 BRM */ .
++VER (Z038) FMID(A$$SVCS) .
++JCLIN .
//A$$W016 JOB WC07N0323,'W1-5311  CR SINGER'
//LPASVC  EXEC LINKS,
// PARM='NCAL,LIST,XREF,LET,REUS,RENT',
//    UNIT='3380',SER=IPLXXX,N=SYS2,NAME=HSSLPA,P1=' ',
//    MOD=,P2=' ',OBJ=OBJPDS01,CLASS=T
//INCLUDE  DD  DSN=MVS3.INCLUDE,DISP=SHR
//SYSLIN   DD  *
   INCLUDE INCLUDE(WCSVC224)
   NAME WCSVC224(R)
/*
++MOD (WCSVC224) LKLIB(INCLUDE) .
