++USERMOD (A$$W013)   /*
      THIS USERMOD IS TO INSTALL THE
      SVC MODULE FOR MASTERCAT

      SVC = 242 - TYPE 3
                                               07/27/88 BRM */ .
++VER (Z038) FMID(A$$SVCS) .
++JCLIN .
//A$$W013 JOB WC07N0323,'W1-5311  CR SINGER'
//LPASVC  EXEC LINKS,
// PARM='NCAL,LIST,XREF,LET,REUS,RENT',
//    UNIT='3380',SER=IPLXXX,N=SYS2,NAME=HSSLPA,P1=' ',
//    MOD=,P2=' ',OBJ=OBJPDS01,CLASS=T
//INCLUDE  DD  DSN=MVS3.INCLUDE,DISP=SHR
//SYSLIN   DD  *
   INCLUDE INCLUDE(WCSVC242)
   NAME WCSVC242(R)
/*
++MOD (WCSVC242) LKLIB(INCLUDE) .
