         MACRO
&NM      GTEDADAT  &MAP=,&DDNAM=,&DSNAM=,&MEMBR=,&STATS=,              X
               &NDISP=,&CDISP=,                                        X
               &TRK=,&CYL=,&BLKLN=,&PRIME=,&SECND=,&DIR=,&RLSE=,       X
               &SPFRM=,&ROUND=,&VLSER=,&PRIVT=,&VLSEQ=,&VLCNT=,        X
               &VLRDS=,&UNIT=,&UNCNT=,&PARAL=,&SYSOU=,&SPGNM=,&SFMNO=, X
               &OUTLM=,&CLOSE=,&COPYS=,&LABEL=,&DSSEQ=,&PASPR=,        X
               &INOUT=,&EXPDT=,&RETPD=,&DUMMY=,&FCBIM=,&FCBAV=,        X
               &QNAME=,&TERM=,&UCS=,&UFOLD=,&UVRFY=,&DCBDS=,&DCBDD=,   X
               &SUSER=,&SHOLD=,&MSVGP=,&SSNM=,&PROT=,&BFALN=,&BFTEK=,  X
               &BLKSZ=,&BUFIN=,&BUFL=,&BUFMX=,&BUFNO=,&BUFOF=,&BUFOU=, X
               &BUFRQ=,&BUFSZ=,&CODE=,&CPRI=,&DEN=,&DSORG=,&EROPT=,    X
               &GNCP=,&INTVL=,&KYLEN=,&LIMCT=,&LRECL=,&MODE=,&NCP=,    X
               &OPTCD=,&PCIR=,&PCIS=,&PRTSP=,&RECFM=,&RSRVF=,&RSRVS=,  X
               &SOWA=,&STACK=,&THRSH=,&TRTCH=,&IPLTX=,&DIAGN=,&FUNC=,  X
               &FRID=,&PASSW=,&PERMA=,&CNVRT=,                         X
               &RTDDN=,&RTDSN=,&RTORG=,       <== FOR DSN ALLOCATION   X
               &INDDN=,&INDSN=,&INORG=,       <== FOR INFO RETRIEVAL   X
               &RTMEM=,&RTSTA=,&RTNDP=,&RTCDP=,&RTLIM=,&RTATT=,        X
               &RTLST=,&RTTYP=,&RELNO=,                                X
               &RTVOL=,&SSPRM=,&TCBAD=,&REMOV=,&UNALC=
.*
.*          +-----------------------------------------------+
.*          |  See macro GTEDADOC for documentation of the  |
.*          |  use of this and other GTEDAxxx macros.       |
.*          +-----------------------------------------------+
.*
           LCLA  &TUPLEN
&TUPLEN    SETA  0
*
&NM        DS  0D                       ALIGN FOR GETMAIN
*
**********************************************************************
***        TEXT UNITS FOR SVC99                                    ***
**********************************************************************
*
&NM.TU     DS  0F   TEXT UNITS FOR SVC99
.*
.*********************************************************************
.***       DSNAME ALLOCATION TEXT UNITS - VERB CODE 01             ***
.*********************************************************************
.*
.TUDDNAM   AIF ('&DDNAM' EQ '').TUDSNAM
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUDDNA#
           DS  XL6
&NM.DDNAM  DS  CL8                      DDNAME
           AGO .TUDSNAM
.TUDDNA#   ANOP
           DC  X'0001,0001,0008'
&NM.DDNAM  DC  CL8'&DDNAM'              DDNAME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUDSNAM   AIF ('&DSNAM' EQ '').TUMEMBR
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUDSNA#
           DS  XL6
&NM.DSNAM  DS  CL44                     DATASET NAME
           AGO .TUMEMBR
.TUDSNA#   ANOP
           DC  X'0002,0001,002C'        DATASET NAME (NEXT LINE)
&NM.DSNAM  DC  CL44'&DSNAM'
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUMEMBR   AIF ('&MEMBR' EQ '').TUSTATS
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUMEMB#
&NM.MEMKY  DS  XL6
&NM.MEMBR  DS  CL8                      MEMBER NAME
           AGO .TUSTATS
.TUMEMB#   ANOP
&NM.MEMKY  DC  X'0003,0001,0008'
&NM.MEMBR  DC  CL8'&MEMBR'              MEMBER NAME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUSTATS   AIF ('&STATS' EQ '').TUNDISP
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUSTAT#
&NM.STATS  DS  XL7                      STATUS
           AGO .TUNDISP
.TUSTAT#   AIF ('&STATS' NE 'OLD').TUSTAT2
&NM.STATS  DC  X'0004,0001,0001,01'     STATUS=OLD
           AGO .TUNDISP
.TUSTAT2   AIF ('&STATS' NE 'MOD').TUSTAT4
&NM.STATS  DC  X'0004,0001,0001,02'     STATUS=MOD
           AGO .TUNDISP
.TUSTAT4   AIF ('&STATS' NE 'NEW').TUSTAT8
&NM.STATS  DC  X'0004,0001,0001,04'     STATUS=NEW
           AGO .TUNDISP
.TUSTAT8   AIF ('&STATS' NE 'SHR').TUNDISP
&NM.STATS  DC  X'0004,0001,0001,08'     STATUS=SHR
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUNDISP   AIF ('&NDISP' EQ '').TUCDISP
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUNDIS#
&NM.NDISP  DS  XL7                      NORMAL DISP
           AGO .TUCDISP
.TUNDIS#   AIF ('&NDISP' NE 'UNCATLG').TUNDIS2
&NM.NDISP  DC  X'0005,0001,0001,01'     NORMAL DISP=UNCATLG
           AGO .TUCDISP
.TUNDIS2   AIF ('&NDISP' NE 'CATLG').TUNDIS4
&NM.NDISP  DC  X'0005,0001,0001,02'     NORMAL DISP=CATLG
           AGO .TUCDISP
.TUNDIS4   AIF ('&NDISP' NE 'DELETE').TUNDIS8
&NM.NDISP  DC  X'0005,0001,0001,04'     NORMAL DISP=DELETE
           AGO .TUCDISP
.TUNDIS8   AIF ('&NDISP' NE 'KEEP').TUCDISP
&NM.NDISP  DC  X'0005,0001,0001,08'     NORMAL DISP=KEEP
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUCDISP   AIF ('&CDISP' EQ '').TUTRK
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUCDIS#
&NM.CDISP  DS  XL7                      COND DISP
           AGO .TUTRK
.TUCDIS#   AIF ('&CDISP' NE 'UNCATLG').TUCDIS2
&NM.CDISP  DC  X'0006,0001,0001,01'     COND DISP=UNCATLG
           AGO .TUTRK
.TUCDIS2   AIF ('&CDISP' NE 'CATLG').TUCDIS4
&NM.CDISP  DC  X'0006,0001,0001,02'     COND DISP=CATLG
           AGO .TUTRK
.TUCDIS4   AIF ('&CDISP' NE 'DELETE').TUCDIS8
&NM.CDISP  DC  X'0006,0001,0001,04'     COND DISP=DELETE
           AGO .TUTRK
.TUCDIS8   AIF ('&CDISP' NE 'KEEP').TUTRK
&NM.CDISP  DC  X'0006,0001,0001,08'     COND DISP=KEEP
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUTRK     AIF ('&TRK' EQ '').TUCYL
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUTRKA
&NM.TRK    DS  XL4                      TRK
           AGO .TUCYL
.TUTRKA    ANOP
&NM.TRK    DC  X'0007,0000'             TRK
           AGO .TUPRIME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUCYL     AIF ('&CYL' EQ '').TUBLKLN
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUCYLA
&NM.CYL    DS  XL4                      CYL
           AGO .TUBLKLN
.TUCYLA    ANOP
&NM.CYL    DC  X'0008,0000'             CYL
           AGO .TUPRIME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBLKLN   AIF ('&BLKLN' EQ '').TUPRIME
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBLKL#
           DS  XL6
&NM.BLKLN  DS  AL3                      AVERAGE BLOCK LENGTH
           AGO .TUPRIME
.TUBLKL#   ANOP
           DC  X'0009,0001,0003'
&NM.BLKLN  DC  AL3(&BLKLN)              AVERAGE BLOCK LENGTH
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUPRIME   AIF ('&PRIME' EQ '').TUSECND
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUPRIM#
           DS  XL6
&NM.PRIME  DS  AL3                      PRIMARY SPACE QUANTITY
           AGO .TUSECND
.TUPRIM#   ANOP
           DC  X'000A,0001,0003'
&NM.PRIME  DC  AL3(&PRIME)              PRIMARY SPACE QUANTITY
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUSECND   AIF ('&SECND' EQ '').TUDIR
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUSECN#
           DS  XL6
&NM.SECND  DS  AL3                      SECONDARY SPACE QUANTITY
           AGO .TUDIR
.TUSECN#   ANOP
           DC  X'000B,0001,0003'
&NM.SECND  DC  AL3(&SECND)              SECONDARY SPACE QUANTITY
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUDIR     AIF ('&DIR' EQ '').TURLSE
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUDIRA
           DS  XL6
&NM.DIR    DS  AL3                      NUMBER OF DIRECTORY BLOCKS
           AGO .TURLSE
.TUDIRA    ANOP
           DC  X'000C,0001,0003'
&NM.DIR    DC  AL3(&DIR)                NUMBER OF DIRECTORY BLOCKS
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURLSE    AIF ('&RLSE' EQ '').TUSPFRM
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURLSEA
&NM.RLSE   DS  XL4                      RLSE
           AGO .TUSPFRM
.TURLSEA   ANOP
&NM.RLSE   DC  X'000D,0000'             RLSE
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUSPFRM   AIF ('&SPFRM' EQ '').TUROUND
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUSPFR#
&NM.SPFRM  DS  XL7                      SPACE FORMAT
           AGO .TUROUND
.TUSPFR#   AIF ('&SPFRM' NE 'ALX').TUSPFR4
&NM.SPFRM  DC  X'000E,0001,0001,02'     ALX
           AGO .TUROUND
.TUSPFR4   AIF ('&SPFRM' NE 'MXIG').TUSPFR8
&NM.SPFRM  DC  X'000E,0001,0001,04'     MXIG
           AGO .TUROUND
.TUSPFR8   AIF ('&SPFRM' NE 'CONTIG').TUROUND
&NM.SPFRM  DC  X'000E,0001,0001,08'     CONTIG
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUROUND   AIF ('&ROUND' EQ '').TUVLSER
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUROUN#
&NM.ROUND  DS  XL4                      ROUND
           AGO .TUVLSER
.TUROUN#   ANOP
&NM.ROUND  DC  X'000F,0000'             ROUND
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUVLSER   AIF ('&VLSER' EQ '').TUPRIVT
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUVLSE#
           DS  XL6
&NM.VLSER  DS  CL6                      VOLUME SERIAL NUMBER
           AGO .TUPRIVT
.TUVLSE#   ANOP
           DC  X'0010,0001,0006'                                MI04304
&NM.VLSER  DC  CL6'&VLSER'              VOLUME SERIAL NUMBER
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUPRIVT   AIF ('&PRIVT' EQ '').TUVLSEQ
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUPRIV#
&NM.PRIVT  DS  XL4                      PVT
           AGO .TUVLSEQ
.TUPRIV#   ANOP
&NM.PRIVT  DC  X'0011,0000'             PVT
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUVLSEQ   AIF ('&VLSEQ' EQ '').TUVLCNT
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUVLSQ#
           DS  XL6
&NM.VLSEQ  DS  AL2                      VOLUME SEQUENCE NUMBER
           AGO .TUVLCNT
.TUVLSQ#   ANOP
           DC  X'0012,0001,0002'
&NM.VLSEQ  DC  AL2(&VLSEQ)              VOLUME SEQUENCE NUMBER
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUVLCNT   AIF ('&VLCNT' EQ '').TUVLRDS
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUVLCN#
           DS  XL6
&NM.VLCNT  DC  AL1                      VOLUME COUNT
           AGO .TUVLRDS
.TUVLCN#   ANOP
           DC  X'0013,0001,0001'
&NM.VLCNT  DC  AL1(&VLCNT)              VOLUME COUNT
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUVLRDS   AIF ('&VLRDS' EQ '').TUUNIT
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUVLRD#
           DS  XL6
&NM.VLRDS  DS  CL44                     VOLUME REF TO THIS DSN
           AGO .TUUNIT
.TUVLRD#   ANOP
           DC  X'0014,0001,002C'        VOLUME REF TO DSN (BELOW)
&NM.VLRDS  DC  CL44'&VLRDS'
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUUNIT    AIF ('&UNIT' EQ '').TUUNCNT
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUUNITA
           DS  XL6
&NM.UNIT   DS  CL6                      UNIT
           AGO .TUUNCNT
.TUUNITA   ANOP
           DC  X'0015,0001,0006'
&NM.UNIT   DC  CL6'&UNIT'               UNIT
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUUNCNT   AIF ('&UNCNT' EQ '').TUPARAL
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUUNCN#
           DS  XL6
&NM.UNCNT  DS  AL1                      UNIT COUNT
           AGO .TUPARAL
.TUUNCN#   ANOP
           DC  X'0016,0001,0001'
&NM.UNCNT  DC  AL1(&UNCNT)              UNIT COUNT
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUPARAL   AIF ('&PARAL' EQ '').TUSYSOU
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUPARA#
&NM.PARAL  DS  XL4                      PARALLEL MOUNT
           AGO .TUSYSOU
.TUPARA#   ANOP
&NM.PARAL  DC  X'0017,0000'             PARALLEL MOUNT
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUSYSOU   AIF ('&SYSOU' EQ '').TUSPGNM
           AIF ('&SYSOU' NE '*').TUSYSO2
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUSYSO#
&NM.SYSOU  DS  XL4                      SYSOUT=*
           AGO .TUSPGNM
.TUSYSO#   ANOP
&NM.SYSOU  DC  X'0018,0000'             SYSOUT=*
           AGO .TUSPGNM
.TUSYSO2   ANOP
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUSYS##
           DS  XL6
&NM.SYSOU  DS  CL1                      SYSOUT CLASS
           AGO .TUSPGNM
.TUSYS##   ANOP
           DC  X'0018,0001,0001'
&NM.SYSOU  DC  CL1'&SYSOU'              SYSOUT CLASS
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUSPGNM   AIF ('&SPGNM' EQ '').TUSFMNO
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUSPGN#
           DS  XL6
&NM.SPGNM  DS  CL8                      SYSOUT PROGRAM NAME
           AGO .TUSFMNO
.TUSPGN#   ANOP
           DC  X'0019,0001,0008'
&NM.SPGNM  DC  CL8'&SPGNM'              SYSOUT PROGRAM NAME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUSFMNO   AIF ('&SFMNO' EQ '').TUOUTLM
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUSFMN#
           DS  XL6
&NM.SFMNO  DS  CL4                      SYSOUT FORM NAME/NUMBER
           AGO .TUOUTLM
.TUSFMN#   ANOP
           DC  X'001A,0001,0004'
&NM.SFMNO  DC  CL4'&SFMNO'              SYSOUT FORM NAME/NUMBER
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUOUTLM   AIF ('&OUTLM' EQ '').TUCLOSE
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUOUTL#
           DS  XL6
&NM.OUTLM  DS  AL3                      OUTLIM
           AGO .TUCLOSE
.TUOUTL#   ANOP
           DC  X'001B,0001,0003'
&NM.OUTLM  DC  AL3(&OUTLM)              OUTLIM
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUCLOSE   AIF ('&CLOSE' EQ '').TUCOPYS
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUCLOS#
&NM.CLOSE  DS  XL4                      FREE=CLOSE
           AGO .TUCOPYS
.TUCLOS#   ANOP
&NM.CLOSE  DC  X'001C,0000'             FREE=CLOSE
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUCOPYS   AIF ('&COPYS' EQ '').TULABEL
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUCOPY#
           DS  XL6
&NM.COPYS  DS  AL1                      COPIES
           AGO .TULABEL
.TUCOPY#   ANOP
           DC  X'001D,0001,0001'
&NM.COPYS  DC  AL1(&COPYS)              COPIES
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TULABEL   AIF ('&LABEL' EQ '').TUDSSEQ
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TULABE#
&NM.LABEL  DS  XL7                      LABEL
           AGO .TUDSSEQ
.TULABE#   AIF ('&LABEL' NE 'NL').TULABE2
&NM.LABEL  DC  X'001E,0001,0001,01'     LABEL=NL
           AGO .TUDSSEQ
.TULABE2   AIF ('&LABEL' NE 'SL').TULABE3
&NM.LABEL  DC  X'001E,0001,0001,02'     LABEL=SL
           AGO .TUDSSEQ
.TULABE3   AIF ('&LABEL' NE 'NSL').TULABE4
&NM.LABEL  DC  X'001E,0001,0001,04'     LABEL=NSL
           AGO .TUDSSEQ
.TULABE4   AIF ('&LABEL' NE 'SUL').TULABE5
&NM.LABEL  DC  X'001E,0001,0001,0A'     LABEL=SUL
           AGO .TUDSSEQ
.TULABE5   AIF ('&LABEL' NE 'BLP').TULABE6
&NM.LABEL  DC  X'001E,0001,0001,10'     LABEL=BLP
           AGO .TUDSSEQ
.TULABE6   AIF ('&LABEL' NE 'LTM').TULABE7
&NM.LABEL  DC  X'001E,0001,0001,21'     LABEL=LTM
           AGO .TUDSSEQ
.TULABE7   AIF ('&LABEL' NE 'AL').TULABE8
&NM.LABEL  DC  X'001E,0001,0001,40'     LABEL=AL
           AGO .TUDSSEQ
.TULABE8   AIF ('&LABEL' NE 'AUL').TUDSSEQ
&NM.LABEL  DC  X'001E,0001,0001,48'     LABEL=AUL
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUDSSEQ   AIF ('&DSSEQ' EQ '').TUPASPR
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUDSSE#
           DS  XL6
&NM.DSSEQ  DS  AL2                      LABEL= DATASET SEQUENCE NUMBER
           AGO .TUPASPR
.TUDSSE#   ANOP
           DC  X'001F,0001,0002'
&NM.DSSEQ  DC  AL2(&DSSEQ)              LABEL= DATASET SEQUENCE NUMBER
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUPASPR   AIF ('&PASPR' EQ '').TUINOUT
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUINOUT   AIF ('&INOUT' EQ '').TUEXPDT
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUINOU#
&NM.INOUT  DS  XL7                      LABEL=IN OR OUT
           AGO .TUEXPDT
.TUINOU#   AIF ('&INOUT' NE 'IN').TUINOU2
&NM.INOUT  DC  X'0021,0001,0001,40'     LABEL=IN
           AGO .TUEXPDT
.TUINOU2   AIF ('&INOUT' NE 'OUT').TUEXPDT
&NM.INOUT  DC  X'0021,0001,0001,80'     LABEL=OUT
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUEXPDT   AIF ('&EXPDT' EQ '').TURETPD
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUEXPD#
           DS  XL6
&NM.EXPDT  DS  CL5                      EXPDT
           AGO .TURETPD
.TUEXPD#   ANOP
           DC  X'0022,0001,0005'
&NM.EXPDT  DC  CL5'&EXPDT'              EXPDT
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURETPD   AIF ('&RETPD' EQ '').TUDUMMY
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURETP#
           DS  XL6
&NM.RETPD  DS  AL2                      RETPD
           AGO .TUDUMMY
.TURETP#   ANOP
           DC  X'0023,0001,0002'
&NM.RETPD  DC  AL2(&RETPD)              RETPD
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUDUMMY   AIF ('&DUMMY' EQ '').TUFCBIM
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUDUMM#
&NM.DUMMY  DS  XL4                      DD DUMMY / DSN=NULLFILE
           AGO .TUFCBIM
.TUDUMM#   ANOP
&NM.DUMMY  DC  X'0024,0000'             DD DUMMY / DSN=NULLFILE
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUFCBIM   AIF ('&FCBIM' EQ '').TUFCBAV
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUFCBI#
           DS  XL6
&NM.FCBIM  DS  CL4                      FCB
           AGO .TUFCBAV
.TUFCBI#   ANOP
           DC  X'0025,0001,0004'
&NM.FCBIM  DC  CL4'&FCBIM'              FCB
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUFCBAV   AIF ('&FCBAV' EQ '').TUQNAME
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUFCBA#
&NM.FCBAV  DS  XL7                      FCB VERIFY OR ALIGN
           AGO .TUQNAME
.TUFCBA#   AIF ('&FCBAV' NE 'VERIFY').TUFCBA2
&NM.FCBAV  DC  X'0026,0001,0001,04'     FCB VERIFY
           AGO .TUQNAME
.TUFCBA2   AIF ('&FCBAV' NE 'ALIGN').TUQNAME
&NM.FCBAV  DC  X'0026,0001,0001,08'     FCB ALIGN
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUQNAME   AIF ('&QNAME' EQ '').TUTERM
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUTERM    AIF ('&TERM' EQ '').TUUCS
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUTERMA
&NM.TERM   DS  XL4                      TERM=TS / DSN(*)
           AGO .TUUCS
.TUTERMA   ANOP
&NM.TERM   DC  X'0028,0000'             TERM=TS / DSN(*)
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUUCS     AIF ('&UCS' EQ '').TUUFOLD
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUUCSA
           DS  XL6
&NM.UCS    DS  CL4                      UCS CHARACTER SET
           AGO .TUUFOLD
.TUUCSA    ANOP
           DC  X'0029,0001,0004'
&NM.UCS    DC  CL4'&UCS'                UCS CHARACTER SET
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUUFOLD   AIF ('&UFOLD' EQ '').TUUVRFY
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUUFOL#
&NM.UFOLD  DS  XL4                      UCS FOLD
           AGO .TUUVRFY
.TUUFOL#   ANOP
&NM.UFOLD  DC  X'002A,0000'             UCS FOLD
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUUVRFY   AIF ('&UVRFY' EQ '').TUDCBDS
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUUVRF#
&NM.UVRFY  DS  XL4                      UCS VERIFY
           AGO .TUDCBDS
.TUUVRF#   ANOP
&NM.UVRFY  DC  X'002B,0000'             UCS VERIFY
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUDCBDS   AIF ('&DCBDS' EQ '').TUDCBDD
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUDCBS#
           DS  XL6
&NM.DCBDS  DS  CL44                     DCB REFERENCE TO DSN
           AGO .TUDCBDD
.TUDCBS#   ANOP
           DC  X'002C,0001,0003'        DCB REFERENCE TO DSN (BELOW)
&NM.DCBDS  DC  CL44'&DCBDS'
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUDCBDD   AIF ('&DCBDD' EQ '').TUSUSER
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUDCBD#
           DS  XL6
&NM.DCBDD  DS  CL8                      DCB REFERENCE TO DDNAME
           AGO .TUSUSER
.TUDCBD#   ANOP
           DC  X'002D,0001,0008'
&NM.DCBDD  DC  CL8'&DCBDD'              DCB REFERENCE TO DDNAME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUSUSER   AIF ('&SUSER' EQ '').TUSHOLD
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUSUSE#
           DS  XL6
&NM.SUSER  DS  CL8                      SYSOUT DESTINATION
           AGO .TUSHOLD
.TUSUSE#   ANOP
           DC  X'0058,0001,0008'
&NM.SUSER  DC  CL8'&SUSER'              SYSOUT DESTINATION
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUSHOLD   AIF ('&SHOLD' EQ '').TUMSVGP
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUSHOL#
&NM.SHOLD  DS  XL4                      SYSOUT HOLD=YES
           AGO .TUMSVGP
.TUSHOL#   ANOP
&NM.SHOLD  DC  X'0059,0000'             SYSOUT HOLD=YES
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUMSVGP   AIF ('&MSVGP' EQ '').TUSSNM
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUSSNM    AIF ('&SSNM' EQ '').TUSSPRM
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUSSPRM   AIF ('&SSPRM' EQ '').TUPROT
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUPROT    AIF ('&PROT' EQ '').TUBFALN
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.*
.*********************************************************************
.***          DCB ATTRIBUTE TEXT UNITS - VERB CODE 01              ***
.*********************************************************************
.*
.TUBFALN   AIF ('&BFALN' EQ '').TUBFTEK
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBFAL#
&NM.BFALN  DS  XL7                      BFALN
           AGO .TUBFTEK
.TUBFAL#   AIF ('&BFALN' NE 'F').TUBFAL2
&NM.BFALN  DC  X'002E,0001,0001,01'     BFALN=F
           AGO .TUBFTEK
.TUBFAL2   AIF ('&BFALN' NE 'D').TUBFTEK                        MI04303
&NM.BFALN  DC  X'002E,0001,0001,02'     BFALN=D
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBFTEK   AIF ('&BFTEK' EQ '').TUBLKSZ
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBFTE#
&NM.BFTEK  DS  XL7                      BFTEK
           AGO .TUBLKSZ
.TUBFTE#   AIF ('&BFTEK' NE 'D').TUBFTE2
&NM.BFTEK  DC  X'002F,0001,0001,08'     BFTEK=D
           AGO .TUBLKSZ
.TUBFTE2   AIF ('&BFTEK' NE 'E').TUBFTE3
&NM.BFTEK  DC  X'002F,0001,0001,10'     BFTEK=E
           AGO .TUBLKSZ
.TUBFTE3   AIF ('&BFTEK' NE 'R').TUBFTE4
&NM.BFTEK  DC  X'002F,0001,0001,20'     BFTEK=R
           AGO .TUBLKSZ
.TUBFTE4   AIF ('&BFTEK' NE 'S').TUBFTE5
&NM.BFTEK  DC  X'002F,0001,0001,40'     BFTEK=S
           AGO .TUBLKSZ
.TUBFTE5   AIF ('&BFTEK' NE 'A').TUBLKSZ
&NM.BFTEK  DC  X'002F,0001,0001,60'     BFTEK=A
           AGO .TUBLKSZ
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBLKSZ   AIF ('&BLKSZ' EQ '').TUBUFIN
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBLKS#
           DS  XL6
&NM.BLKSZ  DS  AL2                      BLKSIZE
           AGO .TUBUFIN
.TUBLKS#   ANOP
           DC  X'0030,0001,0002'
&NM.BLKSZ  DC  AL2(&BLKSZ)              BLKSIZE
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBUFIN   AIF ('&BUFIN' EQ '').TUBUFL
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBUFI#
           DS  XL6
&NM.BUFIN  DS  AL1                      BUFIN
           AGO .TUBUFL
.TUBUFI#   ANOP
           DC  X'0031,0001,0001'
&NM.BUFIN  DC  AL1(&BUFIN)              BUFIN
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBUFL    AIF ('&BUFL' EQ '').TUBUFMX
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBUFLA
           DS  XL6
&NM.BUFL   DC  AL2                      BUFL
           AGO .TUBUFMX
.TUBUFLA   ANOP
           DC  X'0032,0001,0002'
&NM.BUFL   DC  AL2(&BUFL)               BUFL
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBUFMX   AIF ('&BUFMX' EQ '').TUBUFNO
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBUFM#
           DS  XL6
&NM.BUFMX  DS  AL1                      BUFMAX
           AGO .TUBUFNO
.TUBUFM#   ANOP
           DC  X'0033,0001,0001'
&NM.BUFMX  DC  AL1(&BUFMX)              BUFMAX
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBUFNO   AIF ('&BUFNO' EQ '').TUBUFOF
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBUFN#
           DS  XL6
&NM.BUFNO  DC  AL1                      BUFNO
           AGO .TUBUFOF
.TUBUFN#   ANOP
           DC  X'0034,0001,0001'
&NM.BUFNO  DC  AL1(&BUFNO)              BUFNO
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBUFOF   AIF ('&BUFOF' EQ '').TUBUFOU
&TUPLEN    SETA &TUPLEN+1
           AIF ('&BUFOF' NE 'L').TUBUFO2
           AIF ('&MAP' NE 'ONLY').TUBUFF#
&NM.BUFOF  DS  XL7                      BUFOFF=L
           AGO .TUBUFOU
.TUBUFF#   ANOP
&NM.BUFOF  DC  X'0035,0001,0001,80'     BUFOFF=L
           AGO .TUBUFOU
.TUBUFO2   ANOP
           AIF ('&MAP' NE 'ONLY').TUBUF##
           DS  XL6
&NM.BUFOF  DS  AL1                      BUFOFF
           AGO .TUBUFOU
.TUBUF##   ANOP
           DC  X'0035,0001,0001'
&NM.BUFOF  DC  AL1(&BUFOF)              BUFOFF
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBUFOU   AIF ('&BUFOU' EQ '').TUBUFRQ
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBUFO#
           DS  XL6
&NM.BUFOU  DS  AL1                      BUFOUT
           AGO .TUBUFRQ
.TUBUFO#   ANOP
           DC  X'0036,0001,0001'
&NM.BUFOU  DC  AL1(&BUFOU)              BUFOUT
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBUFRQ   AIF ('&BUFRQ' EQ '').TUBUFSZ
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBUFR#
           DS  XL6
&NM.BUFRQ  DS  AL1                      BUFRQ
           AGO .TUBUFSZ
.TUBUFR#   ANOP
           DC  X'0037,0001,0001'
&NM.BUFRQ  DC  AL1(&BUFRQ)              BUFRQ
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUBUFSZ   AIF ('&BUFSZ' EQ '').TUCODE
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUBUFS#
           DS  XL6
&NM.BUFSZ  DS  AL2                      BUFSIZE
           AGO .TUCODE
.TUBUFS#   ANOP
           DC  X'0038,0001,0002'
&NM.BUFSZ  DC  AL2(&BUFSZ)              BUFSIZE
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUCODE    AIF ('&CODE' EQ '').TUCPRI
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUCPRI    AIF ('&CPRI' EQ '').TUDEN
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUDEN     AIF ('&DEN' EQ '').TUDSORG
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUDENA
&NM.DEN    DS  XL7                      DEN
           AGO .TUDSORG
.TUDENA    AIF ('&DEN' NE '0').TUDE2
&NM.DEN    DC  X'003B,0001,0001,03'     DEN=0  (200 BPI, 7-TRACK)
           AGO .TUDSORG
.TUDE2     AIF ('&DEN' NE '1').TUDE3
&NM.DEN    DC  X'003B,0001,0001,43'     DEN=1  (556 BPI, 7-TRACK)
           AGO .TUDSORG
.TUDE3     AIF ('&DEN' NE '2').TUDE4
&NM.DEN    DC  X'003B,0001,0001,83'     DEN=2  (800 BPI, 7/9-TRACK)
           AGO .TUDSORG
.TUDE4     AIF ('&DEN' NE '3').TUDE5
&NM.DEN    DC  X'003B,0001,0001,C3'     DEN=3  (1600 BPI, 9-TRACK)
           AGO .TUDSORG
.TUDE5     AIF ('&DEN' NE '4').TUDSORG
&NM.DEN    DC  X'003B,0001,0001,D3'     DEN=4  (6250 BPI, 9-TRACK)
           AGO .TUDSORG
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUDSORG   AIF ('&DSORG' EQ '').TUEROPT
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUDSOR#
&NM.DSORG  DS  XL8                      DSORG
           AGO .TUEROPT
.TUDSOR#   AIF ('&DSORG' NE 'VS').TUDSOR2
&NM.DSORG  DC  X'003C,0001,0002,0008'   DSORG=VS
           AGO .TUEROPT
.TUDSOR2   AIF ('&DSORG' NE 'TQ').TUDSOR3
&NM.DSORG  DC  X'003C,0001,0002,0020'   DSORG=TQ
           AGO .TUEROPT
.TUDSOR3   AIF ('&DSORG' NE 'TX').TUDSOR4
&NM.DSORG  DC  X'003C,0001,0002,0040'   DSORG=TX
           AGO .TUEROPT
.TUDSOR4   AIF ('&DSORG' NE 'GS').TUDSOR5
&NM.DSORG  DC  X'003C,0001,0002,0080'   DSORG=GS
           AGO .TUEROPT
.TUDSOR5   AIF ('&DSORG' NE 'PO').TUDSOR6
&NM.DSORG  DC  X'003C,0001,0002,0200'   DSORG=PO
           AGO .TUEROPT
.TUDSOR6   AIF ('&DSORG' NE 'POU').TUDSOR7
&NM.DSORG  DC  X'003C,0001,0002,0300'   DSORG=POU
           AGO .TUEROPT
.TUDSOR7   AIF ('&DSORG' NE 'MQ').TUDSOR8
&NM.DSORG  DC  X'003C,0001,0002,0400'   DSORG=MQ
           AGO .TUEROPT
.TUDSOR8   AIF ('&DSORG' NE 'CQ').TUDSOR9
&NM.DSORG  DC  X'003C,0001,0002,0800'   DSORG=CQ
           AGO .TUEROPT
.TUDSOR9   AIF ('&DSORG' NE 'CX').TUDSORA
&NM.DSORG  DC  X'003C,0001,0002,1000'   DSORG=CX
           AGO .TUEROPT
.TUDSORA   AIF ('&DSORG' NE 'DA').TUDSORB
&NM.DSORG  DC  X'003C,0001,0002,2000'   DSORG=DA
           AGO .TUEROPT
.TUDSORB   AIF ('&DSORG' NE 'DAU').TUDSORC
&NM.DSORG  DC  X'003C,0001,0002,2100'   DSORG=DAU
           AGO .TUEROPT
.TUDSORC   AIF ('&DSORG' NE 'PS').TUDSORD
&NM.DSORG  DC  X'003C,0001,0002,4000'   DSORG=PS
           AGO .TUEROPT
.TUDSORD   AIF ('&DSORG' NE 'PSU').TUEROPT
&NM.DSORG  DC  X'003C,0001,0002,4100'   DSORG=PSU
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUEROPT   AIF ('&EROPT' EQ '').TUGNCP
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUEROP#
&NM.EROPT  DS  XL7                      EROPT
           AGO .TUGNCP
.TUEROP#   AIF ('&EROPT' NE 'T').TUEROP2
&NM.EROPT  DC  X'003D,0001,0001,10'     EROPT=T
           AGO .TUGNCP
.TUEROP2   AIF ('&EROPT' NE 'ABE').TUEROP3
&NM.EROPT  DC  X'003D,0001,0001,20'     EROPT=ABE
           AGO .TUGNCP
.TUEROP3   AIF ('&EROPT' NE 'SKP').TUEROP4
&NM.EROPT  DC  X'003D,0001,0001,40'     EROPT=SKP
           AGO .TUGNCP
.TUEROP4   AIF ('&EROPT' NE 'ACC').TUGNCP
&NM.EROPT  DC  X'003D,0001,0001,80'     EROPT=ACC
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUGNCP    AIF ('&GNCP' EQ '').TUINTVL
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUGNCPA
           DS  XL6
&NM.GNCP   DC  AL1                      GNCP
           AGO .TUINTVL
.TUGNCPA   ANOP
           DC  X'003E,0001,0001'                                MI04303
&NM.GNCP   DC  AL1(&GNCP)               GNCP
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUINTVL   AIF ('&INTVL' EQ '').TUKYLEN
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUKYLEN   AIF ('&KYLEN' EQ '').TULIMCT
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUKYLE#
           DS  XL6
&NM.KYLEN  DS  AL1                      KEYLEN
           AGO .TULIMCT
.TUKYLE#   ANOP
           DC  X'0040,0001,0001'
&NM.KYLEN  DC  AL1(&KYLEN)              KEYLEN
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TULIMCT   AIF ('&LIMCT' EQ '').TULRECL
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TULRECL   AIF ('&LRECL' EQ '').TUMODE
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TULREC#
           DS  XL6
&NM.LRECL  DS  AL2                      LRECL
           AGO .TUMODE
.TULREC#   ANOP
           DC  X'0042,0001,0002'
&NM.LRECL  DC  AL2(&LRECL)              LRECL
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUMODE    AIF ('&MODE' EQ '').TUNCP
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUNCP     AIF ('&NCP' EQ '').TUOPTCD
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUNCPA
           DS  XL6
&NM.NCP    DS  AL1                      NCP
           AGO .TUOPTCD
.TUNCPA    ANOP
           DC  X'0044,0001,0001'
&NM.NCP    DC  AL1(&NCP)                NCP
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUOPTCD   AIF ('&OPTCD' EQ '').TUPCIR
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUOPTC#
&NM.OPTCD  DS  XL7                      OPTCD
           AGO .TUPCIR
.TUOPTC#   AIF ('&OPTCD' NE 'W').TUPCIR
&NM.OPTCD  DC  X'0045,0001,0001,80'     OPTCD=W
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUPCIR    AIF ('&PCIR' EQ '').TUPCIS
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUPCIS    AIF ('&PCIS' EQ '').TUPRTSP
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUPRTSP   AIF ('&PRTSP' EQ '').TURECFM
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUPRTS#
&NM.PRTSP  DS  XL7                      PRTSP
           AGO .TURECFM
.TUPRTS#   AIF ('&PRTSP' NE '0').TUPRTS2
&NM.PRTSP  DC  X'0048,0001,0001,01'     PRTSP=0
           AGO .TURECFM
.TUPRTS2   AIF ('&PRTSP' NE '1').TUPRTS3
&NM.PRTSP  DC  X'0048,0001,0001,09'     PRTSP=1
           AGO .TURECFM
.TUPRTS3   AIF ('&PRTSP' NE '2').TUPRTS4
&NM.PRTSP  DC  X'0048,0001,0001,11'     PRTSP=2
           AGO .TURECFM
.TUPRTS4   AIF ('&PRTSP' NE '3').TURECFM
&NM.PRTSP  DC  X'0048,0001,0001,19'     PRTSP=3
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURECFM   AIF ('&RECFM' EQ '').TURSRVF
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURECF#
&NM.RECFM  DS  XL7                      RECFM=F
           AGO .TURSRVF
.TURECF#   AIF ('&RECFM' NE 'F').TURECF2
&NM.RECFM  DC  X'0049,0001,0001,80'     RECFM=F
           AGO .TURSRVF
.TURECF2   AIF ('&RECFM' NE 'FA').TURECF3
&NM.RECFM  DC  X'0049,0001,0001,84'     RECFM=FA
           AGO .TURSRVF
.TURECF3   AIF ('&RECFM' NE 'FB').TURECF4
&NM.RECFM  DC  X'0049,0001,0001,90'     RECFM=FB
           AGO .TURSRVF
.TURECF4   AIF ('&RECFM' NE 'FBA').TURECF5
&NM.RECFM  DC  X'0049,0001,0001,94'     RECFM=FBA
           AGO .TURSRVF
.TURECF5   AIF ('&RECFM' NE 'V').TURECF6
&NM.RECFM  DC  X'0049,0001,0001,40'     RECFM=V
           AGO .TURSRVF
.TURECF6   AIF ('&RECFM' NE 'VB').TURECF7
&NM.RECFM  DC  X'0049,0001,0001,50'     RECFM=VB
           AGO .TURSRVF
.TURECF7   AIF ('&RECFM' NE 'U').TURSRVF
&NM.RECFM  DC  X'0049,0001,0001,C0'     RECFM=U
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURSRVF   AIF ('&RSRVF' EQ '').TURSRVS
.TURSRVS   AIF ('&RSRVS' EQ '').TUSOWA
.TUSOWA    AIF ('&SOWA' EQ '').TUSTACK
.TUSTACK   AIF ('&STACK' EQ '').TUTHRSH
.TUTHRSH   AIF ('&THRSH' EQ '').TUTRTCH
.TUTRTCH   AIF ('&TRTCH' EQ '').TUIPLTX
.TUIPLTX   AIF ('&IPLTX' EQ '').TUDIAGN
.TUDIAGN   AIF ('&DIAGN' EQ '').TUFUNC
.TUFUNC    AIF ('&FUNC' EQ '').TUFRID
.TUFRID    AIF ('&FRID' EQ '').TUPASSW
.*
.*********************************************************************
.***       NON-JCL DYNAMIC ALLOCATION FUNCTIONS - VERB CODE 01     ***
.*********************************************************************
.*
.TUPASSW   AIF ('&PASSW' EQ '').TUPERMA
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUPERMA   AIF ('&PERMA' EQ '').TUCNVRT
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUPERM#
&NM.PERMA  DS  XL4                      PERMANENT ALLOCATION
           AGO .TUCNVRT
.TUPERM#   ANOP
&NM.PERMA  DC  X'0052,0000'             PERMANENT ALLOCATION
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUCNVRT   AIF ('&CNVRT' EQ '').TURTDDN
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUCNVR#
&NM.CNVRT  DS  XL4                      CONVERTABLE ALLOCATION
           AGO .TURTDDN
.TUCNVR#   ANOP
&NM.CNVRT  DC  X'0053,0000'             CONVERTABLE ALLOCATION
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTDDN   AIF ('&RTDDN' EQ '').TURTDSN
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTDD#
           DS  XL4
           DS  XL2                      LEN OF RETURNED DDNAME
&NM.RTDDN  DS  CL8                      RETURNED DDNAME
           AGO .TURTDSN
.TURTDD#   ANOP
           DC  X'0055,0001'
           DC  XL2'0008'                LEN OF RETURNED DDNAME
&NM.RTDDN  DC  CL8' '                   RETURNED DDNAME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTDSN   AIF ('&RTDSN' EQ '').TURTORG
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTDS#
           DS  XL4
           DS  AL2                      LEN OF RETURNED DSNAME
&NM.RTDSN  DS  CL44                     RETURNED DSNAME
           AGO .TURTORG
.TURTDS#   ANOP
           DC  X'0056,0001'
           DC  AL2(44)                  LEN OF RETURNED DSNAME
&NM.RTDSN  DC  CL44' '                  RETURNED DSNAME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTORG   AIF ('&RTORG' EQ '').TURTVOL
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTOR#
           DS  XL6
&NM.RTORG  DS  XL2                      RETURNED DSORG
           AGO .TURTVOL
.TURTOR#   DC  X'0057,0001,0002'
&NM.RTORG  DC  XL2'0000'                RETURNED DSORG
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTVOL   AIF ('&RTVOL' EQ '').TUREMOV
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTVO#
           DS  XL4
           DS  XL2                      LEN OF RETURNED VOLSER
&NM.RTVOL  DS  CL6                      RETURNED VOLSER
           AGO .TUREMOV
.TURTVO#   ANOP
           DC  X'005D,0001'
           DC  XL2'0006'                LEN OF RETURNED VOLSER
&NM.RTVOL  DC  CL6' '                   RETURNED VOLSER
.*
.*********************************************************************
.***       UNALLOCATE - VERB CODE 02                               ***
.*********************************************************************
.*
.TUREMOV   AIF ('&REMOV' EQ '').TUUNALC
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUREMO#
&NM.REMOV  DS  XL4                      REMOVE INUSE EVEN IF PERMANENT
           AGO .TUUNALC
.TUREMO#   ANOP
&NM.REMOV  DC  X'0008,0000'             REMOVE INUSE EVEN IF PERMANENT
.*
.TUUNALC   AIF ('&UNALC' EQ '').TUTCBAD
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUUNAL#
&NM.UNALC  DS  XL4                      UNALLOCATE EVEN IF PERMANENT
           AGO .TUTCBAD
.TUUNAL#   ANOP
&NM.UNALC  DC  X'0007,0000'             UNALLOCATE EVEN IF PERMANENT
.*
.*********************************************************************
.***       REMOVE IN-USE ATTRIBUTE - VERB CODE 05                  ***
.*********************************************************************
.*
.TUTCBAD   AIF ('&TCBAD' EQ '').TUINDDN
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUTCBA#
           DS  XL6
&NM.TCBAD  DS  XL4                      TCB ADDRESS
           AGO .TUINDDN
.TUTCBA#   ANOP
           DC  X'0001,0001,0004'
&NM.TCBAD  DS  XL4                      TCB ADDRESS
.*
.*********************************************************************
.***       RETURN INFORMATION - VERB CODE 07                       ***
.*********************************************************************
.*
.TUINDDN   AIF ('&INDDN' EQ '').TUINDSN
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUINDD#
           DS  XL4
           DS  XL2                      LEN OF RETURNED DDNAME
&NM.INDDN  DS  CL8                      RETURNED DDNAME
           AGO .TUINDSN
.TUINDD#   ANOP
           DC  X'0004,0001'
           DC  XL2'0008'                LEN OF RETURNED DDNAME
&NM.INDDN  DC  CL8' '                   RETURNED DDNAME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUINDSN   AIF ('&INDSN' EQ '').TUINORG
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUINDS#
           DS  XL4
           DS  AL2                      LEN OF RETURNED DSNAME
&NM.INDSN  DS  CL44                     RETURNED DSNAME
           AGO .TUINORG
.TUINDS#   ANOP
           DC  X'0005,0001'
           DC  AL2(44)                  LEN OF RETURNED DSNAME
&NM.INDSN  DC  CL44' '                  RETURNED DSNAME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUINORG   AIF ('&INORG' EQ '').TURTMEM
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TUINOR#
           DS  XL6
&NM.INORG  DS  XL2                      RETURNED DSORG
           AGO .TURTMEM
.TUINOR#   DC  X'000A,0001,0002'
&NM.INORG  DC  XL2'0000'                RETURNED DSORG
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTMEM   AIF ('&RTMEM' EQ '').TURTSTA
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTME#
           DS  XL6
&NM.RTMEM  DS  CL8                      RETURNED MEMBER NAME
           AGO .TURTSTA
.TURTME#   ANOP
           DC  X'0006,0001,0008'
&NM.RTMEM  DC  CL8' '                   RETURNED MEMBER NAME
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTSTA   AIF ('&RTSTA' EQ '').TURTNDP
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTST#
           DS  XL6
&NM.RTSTA  DS  XL1                      RETURNED DATASET STATUS
           AGO .TURTNDP
.TURTST#   ANOP
           DC  X'0007,0001,0001'
&NM.RTSTA  DS  XL1'00'                  RETURNED DATASET STATUS
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTNDP   AIF ('&RTNDP' EQ '').TURTCDP
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTND#
           DS  XL6
&NM.RTNDP  DS  XL1                      RETURNED NORMAL DISP
           AGO .TURTCDP
.TURTND#   ANOP
           DC  X'0008,0001,0001'
&NM.RTNDP  DS  XL1'00'                  RETURNED NORMAL DISP
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTCDP   AIF ('&RTCDP' EQ '').TURTLIM
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTCD#
           DS  XL6
&NM.RTCDP  DS  XL1                      RETURNED CONDITIONAL DISP
           AGO .TURTLIM
.TURTCD#   ANOP
           DC  X'0009,0001,0001'
&NM.RTCDP  DS  XL1'00'                  RETURNED CONDITIONAL DISP
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTLIM   AIF ('&RTLIM' EQ '').TURTATT
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTLI#
           DS  XL6
&NM.RTLIM  DS  XL2                      RETURNED LIMIT SPECIFICATION
           AGO .TURTATT
.TURTLI#   ANOP
           DC  X'000B,0001,0002'
&NM.RTLIM  DS  XL2'0000'                RETURNED LIMIT SPECIFICATION
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTATT   AIF ('&RTATT' EQ '').TURTLST
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTAT#
           DS  XL6
&NM.RTATT  DS  XL1                      RETURNED D.A. ATTRIBUTE
           AGO .TURTLST
.TURTAT#   ANOP
           DC  X'000C,0001,0001'
&NM.RTATT  DS  XL1'00'                  RETURNED D.A. ATTRIBUTE
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTLST   AIF ('&RTLST' EQ '').TURTTYP
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTLS#
           DS  XL6
&NM.RTLST  DS  XL1                      RETURNED LAST ENTRY SPEC.
           AGO .TURTTYP
.TURTLS#   ANOP
           DC  X'000D,0001,0001'
&NM.RTLST  DS  XL1'00'                  RETURNED LAST ENTRY SPEC.
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURTTYP   AIF ('&RTTYP' EQ '').TURELNO
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURTTY#
           DS  XL6
&NM.RTTYP  DS  XL1                      RETURNED DATASET TYPE
           AGO .TURELNO
.TURTTY#   ANOP
           DC  X'000E,0001,0001'
&NM.RTTYP  DS  XL1'00'                  RETURNED DATASET TYPE
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TURELNO   AIF ('&RELNO' EQ '').TUENDM
&TUPLEN    SETA &TUPLEN+1
           AIF ('&MAP' NE 'ONLY').TURELN#
           DS  XL6
&NM.RELNO  DS  XL2                      RETURNED RELATIVE REQUEST NO.
           AGO .TUENDM
.TURELN#   ANOP
           DC  X'000F,0001,0002'
&NM.RELNO  DS  XL2'0000'                RETURNED RELATIVE REQUEST NO.
.*
.*********************************************************************
.***       MARK END OF LIST OF TEXT UNITS                          ***
.*********************************************************************
.*
.TUENDM    AIF ('&MAP' NE 'ONLY').TUENDU#
           DS  XL1                      END OF LIST MARKER
           AGO .TUEND
.TUENDU#   ANOP
           DC  X'FF'                    END OF LIST MARKER
.* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.TUEND     ANOP
.*
**********************************************************************
***        REQUEST BLOCKS FOR SVC99                                ***
**********************************************************************
*
&NM.RBP    DS  A                        POINTER TO REQUEST BLOCK
&NM.RB     DS  5A                       REQUEST BLOCK
&NM.TUPL   DS  &TUPLEN.A                TEXT UNIT POINTER LIST
*
**********************************************************************
***        DAIRFAIL PARAMETER BLOCK & MISCELLANEOUS STORAGE        ***
**********************************************************************
*
&NM.DFPRM  DS  6F                       PARM BLOCK FOR IKJEFF18
*
&NM.S99RC  DS  F                        STORAGE AREA FOR SVC 99 R/C
           AIF ('&MAP' NE 'ONLY').DF2
&NM.F02EP  DS  F                        STORGE AREA FOR EP OF IKJEFF18
&NM.ID     DS  XL2                      DAIRFAIL SWITCHES & CALLER ID
           AGO .DF3
.DF2       ANOP
&NM.F02EP  DC  F'0'                     STORGE AREA FOR EP OF IKJEFF18
&NM.ID     DC  X'0032'                  DAIRFAIL SWITCHES & CALLER ID
.DF3       ANOP
*
**********************************************************************
***        EQUATE FOR TOTAL LENGTH                                 ***
**********************************************************************
*
           DS  0D                       ALIGN FOR GETMAIN
&NM.LEN    EQU *-&NM                    TOTAL LENGTH
           MEND
