//ASMJCL   JOB .
//PDSGEN   PROC MEMBER=MISSING,
//             INSTLIB='T311LBD.PDSEGEN.ASM',
//             LOADLIB='T311LBD.PDSEGEN.LOAD',
//             ARENT='RENT',LRENT='RENT,REUS'
//ASM      EXEC PGM=ASMA90,REGION=32M,
//             PARM=(NORLD,&ARENT,TERM,'XREF(SHORT),SIZE(MAX,ABOVE)')
//SYSUT1    DD UNIT=VIO,SPACE=(4096,(120,1200),,,ROUND),DCB=BUFNO=1
//SYSLIN    DD UNIT=VIO,SPACE=(TRK,(5,5)),DISP=(NEW,PASS),
//             DCB=BLKSIZE=3120
//SYSPRINT  DD SYSOUT=*
//SYSTERM   DD SYSOUT=*
//SYSIN     DD DISP=SHR,DSN=&INSTLIB.(&MEMBER)
//SYSLIB    DD DSN=SYS1.MODGEN,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=&INSTLIB,DISP=SHR
//LKED     EXEC PGM=IEWL,COND=(4,LT),REGION=32M,
//             PARM='MAP,&LRENT,NCAL'
//SYSPRINT  DD SYSOUT=*
//SYSLIN    DD DSN=*.ASM.SYSLIN,DISP=(OLD,DELETE)
//SYSLMOD   DD DISP=SHR,
//             DSN=&LOADLIB(&MEMBER)
//SYSUT1    DD UNIT=VIO,SPACE=(1024,(120,120),,,ROUND),
//             DCB=BUFNO=1
//         PEND
//*
//PDSEGENI EXEC PDSGEN,MEMBER=PDSEGENI
//PDSEGDEL EXEC PDSGEN,MEMBER=PDSEGDEL
//PDSEGMAT EXEC PDSGEN,MEMBER=PDSEGMAT
//*
