//TST2DP2S JOB ,'TECH.SUPP-SAM.GOLOB',CLASS=M,NOTIFY=TST2SSG,
//        MSGLEVEL=(1,1),MSGCLASS=T TYPRUN=HOLD
//*
//******************************************************************//
//*   COMPRESS IBM SYMLIB - SOURCE TAPES - USING THE CBT973
//*     DATA COMPRESSION PROGRAM, AFTER THE MANNER OF THE
//*     CBT MVS MODS TAPES.  IF THIS PRODUCES ENOUGH SPACE SAVING,
//*     IT WILL BECOME STANDARD IN OUR SHOP FOR ARCHIVAL.
//******************************************************************//
//*
//* CBTSYM1              JOB  DESIGNED TO OUTPUT TO 2400 FT REEL.
//* CBTSYM2 THRU CBTSYM6 JOBS DESIGNED TO OUTPUT TO 3600 FT REEL.
//*
//*
//CONDENSE PROC LI=01,VI=SYM,LO=01,VO=NSY004,TAP=051,SRC=MVSIPO,
//     T01=481,T02=482
//COPYIN  EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//SYSUT1   DD  DSN=SYMLIB.FIL,DISP=(SHR,PASS),UNIT=&T01,
//    LABEL=(&LI,NL,EXPDT=98000),VOL=(,RETAIN,,,SER=&VI&TAP),
//    DCB=(RECFM=FB,LRECL=80,BLKSIZE=12000)
//SYSUT2   DD  DSN=&TMP&LO,DISP=(NEW,KEEP,DELETE),UNIT=3380,
//      VOL=SER=WORK03,DCB=*.SYSUT1,SPACE=(TRK,(90,90),RLSE)
//*
//COMPRES EXEC PGM=CBT973,PARM=COMPRESS
//INPUT   DD  DSN=&TMP&LO,DISP=(OLD,DELETE)
//OUTPUT  DD  DSN=&SRC..&VI&TAP..F&LI,DISP=(NEW,KEEP,DELETE),
//     UNIT=&T02,LABEL=(&LO,SL,EXPDT=98000),
//     VOL=(,RETAIN,SER=&VO),
//     DCB=(DEN=4,RECFM=VB,LRECL=94,BLKSIZE=32716)
//   PEND
//*
//ALLOC1  EXEC PGM=IEFBR14
//DD3     DD  DSN=TST.MAP4.TEMP,DISP=(NEW,KEEP,DELETE),UNIT=3380,
//   VOL=SER=WORK03,DCB=(RECFM=FBA,LRECL=133,BLKSIZE=3059,DSORG=PS),
//   SPACE=(TRK,(30,30))
//*
//MERGE1 EXEC PGM=DSCOPY
//SYSPRINT DD SYSOUT=*
//IN01   DD DISP=SHR,DSN=TST.SYMTAPE.MAPS(SJE331)
//       DD DISP=SHR,DSN=TST.SYMTAPE.MAPS(SJE332)
//       DD DISP=SHR,DSN=TST.SYMTAPE.MAPS(SJE333)
//       DD DISP=SHR,DSN=TST.SYMTAPE.MAPS(SJE334)
//       DD DISP=SHR,DSN=TST.SYMTAPE.MAPS(SJE335)
//       DD DISP=SHR,DSN=TST.SYMTAPE.MAPS(SJE331M)
//       DD DISP=SHR,DSN=TST.SYMTAPE.MAPS(SJE332M)
//       DD DISP=SHR,DSN=TST.SYMTAPE.MAPS(SJE333M)
//       DD DISP=SHR,DSN=TST.SYMTAPE.MAPS(SJE334M)
//       DD DISP=SHR,DSN=TST.SYMTAPE.MAPS(SJE335M)
//OUT01  DD DISP=OLD,DSN=TST.MAP4.TEMP,UNIT=3380,VOL=SER=WORK03
//*
//TAPEC1 EXEC PGM=DSCOPY
//SYSPRINT DD SYSOUT=*
//IN02   DD DISP=OLD,DSN=TST.MAP4.TEMP,UNIT=3380,VOL=SER=WORK03
//OUT02  DD DSN=B.INFO.ABOUT.TAPE,DISP=(NEW,KEEP,DELETE),UNIT=482,
//    DCB=(RECFM=VBA,LRECL=137,BLKSIZE=32747),
//    VOL=(PRIVATE,RETAIN,SER=NSY004),LABEL=(01,SL,EXPDT=98000)
//*
//ALLOC2  EXEC PGM=IEFBR14
//DD3     DD  DSN=TST.MAP4.TEMP,DISP=(OLD,DELETE),UNIT=3380,
//   VOL=SER=WORK03
//*
//*
//C001  EXEC CONDENSE,TAP=331,VO=NSY004,LI=01,LO=002,VI=SJE
//C002  EXEC CONDENSE,TAP=331,VO=NSY004,LI=02,LO=003,VI=SJE
//C003  EXEC CONDENSE,TAP=332,VO=NSY004,LI=01,LO=004,VI=SJE
//C004  EXEC CONDENSE,TAP=332,VO=NSY004,LI=02,LO=005,VI=SJE
//C005  EXEC CONDENSE,TAP=332,VO=NSY004,LI=03,LO=006,VI=SJE
//C006  EXEC CONDENSE,TAP=332,VO=NSY004,LI=04,LO=007,VI=SJE
//C007  EXEC CONDENSE,TAP=332,VO=NSY004,LI=05,LO=008,VI=SJE
//C008  EXEC CONDENSE,TAP=332,VO=NSY004,LI=06,LO=009,VI=SJE
//C009  EXEC CONDENSE,TAP=332,VO=NSY004,LI=07,LO=010,VI=SJE
//C010  EXEC CONDENSE,TAP=332,VO=NSY004,LI=08,LO=011,VI=SJE
//C011  EXEC CONDENSE,TAP=332,VO=NSY004,LI=09,LO=012,VI=SJE
//C012  EXEC CONDENSE,TAP=332,VO=NSY004,LI=10,LO=013,VI=SJE
//C013  EXEC CONDENSE,TAP=332,VO=NSY004,LI=11,LO=014,VI=SJE
//C014  EXEC CONDENSE,TAP=332,VO=NSY004,LI=12,LO=015,VI=SJE
//C015  EXEC CONDENSE,TAP=332,VO=NSY004,LI=13,LO=016,VI=SJE
//C016  EXEC CONDENSE,TAP=332,VO=NSY004,LI=14,LO=017,VI=SJE
//C017  EXEC CONDENSE,TAP=332,VO=NSY004,LI=15,LO=018,VI=SJE
//C018  EXEC CONDENSE,TAP=332,VO=NSY004,LI=16,LO=019,VI=SJE
//C019  EXEC CONDENSE,TAP=332,VO=NSY004,LI=17,LO=020,VI=SJE
//C020  EXEC CONDENSE,TAP=332,VO=NSY004,LI=18,LO=021,VI=SJE
//C021  EXEC CONDENSE,TAP=332,VO=NSY004,LI=19,LO=022,VI=SJE
//C022  EXEC CONDENSE,TAP=332,VO=NSY004,LI=20,LO=023,VI=SJE
//C023  EXEC CONDENSE,TAP=332,VO=NSY004,LI=21,LO=024,VI=SJE
//C024  EXEC CONDENSE,TAP=332,VO=NSY004,LI=22,LO=025,VI=SJE
//C025  EXEC CONDENSE,TAP=332,VO=NSY004,LI=23,LO=026,VI=SJE
//C026  EXEC CONDENSE,TAP=332,VO=NSY004,LI=24,LO=027,VI=SJE
//C027  EXEC CONDENSE,TAP=332,VO=NSY004,LI=25,LO=028,VI=SJE
//C028  EXEC CONDENSE,TAP=333,VO=NSY004,LI=01,LO=029,VI=SJE
//C029  EXEC CONDENSE,TAP=333,VO=NSY004,LI=02,LO=030,VI=SJE
//C030  EXEC CONDENSE,TAP=333,VO=NSY004,LI=03,LO=031,VI=SJE
//C031  EXEC CONDENSE,TAP=333,VO=NSY004,LI=04,LO=032,VI=SJE
//C032  EXEC CONDENSE,TAP=333,VO=NSY004,LI=05,LO=033,VI=SJE
//C033  EXEC CONDENSE,TAP=333,VO=NSY004,LI=06,LO=034,VI=SJE
//C034  EXEC CONDENSE,TAP=333,VO=NSY004,LI=07,LO=035,VI=SJE
//C035  EXEC CONDENSE,TAP=333,VO=NSY004,LI=08,LO=036,VI=SJE
//C036  EXEC CONDENSE,TAP=333,VO=NSY004,LI=09,LO=037,VI=SJE
//C037  EXEC CONDENSE,TAP=333,VO=NSY004,LI=10,LO=038,VI=SJE
//C038  EXEC CONDENSE,TAP=333,VO=NSY004,LI=11,LO=039,VI=SJE
//C039  EXEC CONDENSE,TAP=333,VO=NSY004,LI=12,LO=040,VI=SJE
//C040  EXEC CONDENSE,TAP=333,VO=NSY004,LI=13,LO=041,VI=SJE
//C041  EXEC CONDENSE,TAP=333,VO=NSY004,LI=14,LO=042,VI=SJE
//C042  EXEC CONDENSE,TAP=333,VO=NSY004,LI=15,LO=043,VI=SJE
//C043  EXEC CONDENSE,TAP=333,VO=NSY004,LI=16,LO=044,VI=SJE
//C044  EXEC CONDENSE,TAP=333,VO=NSY004,LI=17,LO=045,VI=SJE
//C045  EXEC CONDENSE,TAP=333,VO=NSY004,LI=18,LO=046,VI=SJE
//C046  EXEC CONDENSE,TAP=333,VO=NSY004,LI=19,LO=047,VI=SJE
//C047  EXEC CONDENSE,TAP=333,VO=NSY004,LI=20,LO=048,VI=SJE
//C048  EXEC CONDENSE,TAP=333,VO=NSY004,LI=21,LO=049,VI=SJE
//C049  EXEC CONDENSE,TAP=333,VO=NSY004,LI=22,LO=050,VI=SJE
//C050  EXEC CONDENSE,TAP=333,VO=NSY004,LI=23,LO=051,VI=SJE
//C051  EXEC CONDENSE,TAP=333,VO=NSY004,LI=24,LO=052,VI=SJE
//C052  EXEC CONDENSE,TAP=333,VO=NSY004,LI=25,LO=053,VI=SJE
//C053  EXEC CONDENSE,TAP=333,VO=NSY004,LI=26,LO=054,VI=SJE
//C054  EXEC CONDENSE,TAP=333,VO=NSY004,LI=27,LO=055,VI=SJE
//C055  EXEC CONDENSE,TAP=333,VO=NSY004,LI=28,LO=056,VI=SJE
//C056  EXEC CONDENSE,TAP=333,VO=NSY004,LI=29,LO=057,VI=SJE
//C057  EXEC CONDENSE,TAP=333,VO=NSY004,LI=30,LO=058,VI=SJE
//C058  EXEC CONDENSE,TAP=333,VO=NSY004,LI=31,LO=059,VI=SJE
//C059  EXEC CONDENSE,TAP=333,VO=NSY004,LI=32,LO=060,VI=SJE
//C060  EXEC CONDENSE,TAP=334,VO=NSY004,LI=01,LO=061,VI=SJE
//C061  EXEC CONDENSE,TAP=334,VO=NSY004,LI=02,LO=062,VI=SJE
//C062  EXEC CONDENSE,TAP=334,VO=NSY004,LI=03,LO=063,VI=SJE
//C063  EXEC CONDENSE,TAP=334,VO=NSY004,LI=04,LO=064,VI=SJE
//C064  EXEC CONDENSE,TAP=334,VO=NSY004,LI=05,LO=065,VI=SJE
//C065  EXEC CONDENSE,TAP=334,VO=NSY004,LI=06,LO=066,VI=SJE
//C066  EXEC CONDENSE,TAP=334,VO=NSY004,LI=07,LO=067,VI=SJE
//C067  EXEC CONDENSE,TAP=334,VO=NSY004,LI=08,LO=068,VI=SJE
//C068  EXEC CONDENSE,TAP=334,VO=NSY004,LI=09,LO=069,VI=SJE
//C069  EXEC CONDENSE,TAP=334,VO=NSY004,LI=10,LO=070,VI=SJE
//C070  EXEC CONDENSE,TAP=334,VO=NSY004,LI=11,LO=071,VI=SJE
//C071  EXEC CONDENSE,TAP=334,VO=NSY004,LI=12,LO=072,VI=SJE
//C072  EXEC CONDENSE,TAP=334,VO=NSY004,LI=13,LO=073,VI=SJE
//C073  EXEC CONDENSE,TAP=334,VO=NSY004,LI=14,LO=074,VI=SJE
//C074  EXEC CONDENSE,TAP=334,VO=NSY004,LI=15,LO=075,VI=SJE
//C075  EXEC CONDENSE,TAP=334,VO=NSY004,LI=16,LO=076,VI=SJE
//C076  EXEC CONDENSE,TAP=334,VO=NSY004,LI=17,LO=077,VI=SJE
//C077  EXEC CONDENSE,TAP=334,VO=NSY004,LI=18,LO=078,VI=SJE
//C078  EXEC CONDENSE,TAP=334,VO=NSY004,LI=19,LO=079,VI=SJE
//C079  EXEC CONDENSE,TAP=334,VO=NSY004,LI=20,LO=080,VI=SJE
//C080  EXEC CONDENSE,TAP=334,VO=NSY004,LI=21,LO=081,VI=SJE
//C081  EXEC CONDENSE,TAP=334,VO=NSY004,LI=22,LO=082,VI=SJE
//C082  EXEC CONDENSE,TAP=334,VO=NSY004,LI=23,LO=083,VI=SJE
//C083  EXEC CONDENSE,TAP=334,VO=NSY004,LI=24,LO=084,VI=SJE
//C084  EXEC CONDENSE,TAP=335,VO=NSY004,LI=01,LO=085,VI=SJE
//C085  EXEC CONDENSE,TAP=335,VO=NSY004,LI=02,LO=086,VI=SJE
//C086  EXEC CONDENSE,TAP=335,VO=NSY004,LI=03,LO=087,VI=SJE
//C087  EXEC CONDENSE,TAP=335,VO=NSY004,LI=04,LO=088,VI=SJE
//C088  EXEC CONDENSE,TAP=335,VO=NSY004,LI=05,LO=089,VI=SJE
//C089  EXEC CONDENSE,TAP=335,VO=NSY004,LI=06,LO=090,VI=SJE
//C090  EXEC CONDENSE,TAP=335,VO=NSY004,LI=07,LO=091,VI=SJE
//C091  EXEC CONDENSE,TAP=335,VO=NSY004,LI=08,LO=092,VI=SJE
//C092  EXEC CONDENSE,TAP=335,VO=NSY004,LI=09,LO=093,VI=SJE
//C093  EXEC CONDENSE,TAP=335,VO=NSY004,LI=10,LO=094,VI=SJE
//C094  EXEC CONDENSE,TAP=335,VO=NSY004,LI=11,LO=095,VI=SJE
//C095  EXEC CONDENSE,TAP=335,VO=NSY004,LI=12,LO=096,VI=SJE
//C096  EXEC CONDENSE,TAP=335,VO=NSY004,LI=13,LO=097,VI=SJE
//C097  EXEC CONDENSE,TAP=335,VO=NSY004,LI=14,LO=098,VI=SJE
//C098  EXEC CONDENSE,TAP=335,VO=NSY004,LI=15,LO=099,VI=SJE
//C099  EXEC CONDENSE,TAP=335,VO=NSY004,LI=16,LO=100,VI=SJE
//C100  EXEC CONDENSE,TAP=335,VO=NSY004,LI=17,LO=101,VI=SJE
//C101  EXEC CONDENSE,TAP=335,VO=NSY004,LI=18,LO=102,VI=SJE
//C102  EXEC CONDENSE,TAP=335,VO=NSY004,LI=19,LO=103,VI=SJE
//C103  EXEC CONDENSE,TAP=335,VO=NSY004,LI=20,LO=104,VI=SJE
//C104  EXEC CONDENSE,TAP=335,VO=NSY004,LI=21,LO=105,VI=SJE
//C105  EXEC CONDENSE,TAP=335,VO=NSY004,LI=22,LO=106,VI=SJE
//C106  EXEC CONDENSE,TAP=335,VO=NSY004,LI=23,LO=107,VI=SJE
//C107  EXEC CONDENSE,TAP=335,VO=NSY004,LI=24,LO=108,VI=SJE
//C108  EXEC CONDENSE,TAP=335,VO=NSY004,LI=25,LO=109,VI=SJE
//C109  EXEC CONDENSE,TAP=335,VO=NSY004,LI=26,LO=110,VI=SJE
//C110  EXEC CONDENSE,TAP=335,VO=NSY004,LI=27,LO=111,VI=SJE
//C111  EXEC CONDENSE,TAP=335,VO=NSY004,LI=28,LO=112,VI=SJE
//C112  EXEC CONDENSE,TAP=335,VO=NSY004,LI=29,LO=113,VI=SJE
//C113  EXEC CONDENSE,TAP=335,VO=NSY004,LI=30,LO=114,VI=SJE
//C114  EXEC CONDENSE,TAP=335,VO=NSY004,LI=31,LO=115,VI=SJE
