//*
/*JOBPARM S=ASYS
//*
//***********************************************************
//*                                                         *
//*      SAMPLE JOB TO GENERATE A TAPE THAT WILL TEST THE   *
//*      CAPABILITIES OF THE TAPEMAP PROGRAM.               *
//*                                                         *
//*      THE OFFLOAD PROGRAM IS AVAILABLE FROM THE CBT TAPE *
//*      IN FILE 225.                                       *
//*                                                         *
//***********************************************************
//*
//IEHMOVE EXEC PGM=IEHMOVE,REGION=1024K
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  UNIT=3350,VOL=SER=WORKA1,DISP=OLD
//DISK     DD  VOL=REF=SYS1.PROCLIB,DISP=OLD
//TAPE     DD  UNIT=TAPE,VOL=SER=TSTTAP,DISP=(,PASS),
//             DSN=PROCLIB,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
 COPY PDS=SYS1.PROCLIB,TO=TAPE=TSTTAP,FROM=3350=ASYS01,TODD=TAPE,      *
               RENAME=PROCLIB
//*
//IEBCOPY EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//I        DD  DSN=SYS1.PROCLIB,DISP=SHR
//O        DD  DSN=PROCLIB,VOL=REF=*.IEHMOVE.TAPE,LABEL=2,
//             DISP=(SHR,PASS)
 C I=I,O=O
//*
//IEBGENER EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//SYSUT1   DD  DSN=SYS1.PROCLIB(JES2),DISP=SHR
//SYSUT2   DD  DSN=JES2PROC,VOL=REF=*.IEHMOVE.TAPE,LABEL=3,
//             DISP=(SHR,PASS)
//*
//FDR     EXEC PGM=FDR,REGION=4096K
//SYSPRINT DD  SYSOUT=*
//DISK1    DD  UNIT=3330-1,VOL=SER=JES2CK,DISP=OLD
//TAPE1    DD  DSN=JES2CK,VOL=REF=*.IEHMOVE.TAPE,LABEL=4,
//             DISP=(SHR,PASS)
//*
//OFDRDSF EXEC PGM=FDRDSF,REGION=4096K
//SYSPRINT DD  SYSOUT=*
//DISK1    DD  UNIT=3330-1,VOL=SER=JES2CK,DISP=OLD
//TAPE1    DD  DSN=JES2CK2,VOL=REF=*.IEHMOVE.TAPE,LABEL=5,
//             DISP=(SHR,PASS)
 D TYPE=DSF,FORMAT=OLD
 D DSN=SYS1.HASPCKPT
 D DSN=SYS3.JES2.LINKLIB1
 D DSN=SYS3.JES2.LINKLIB2
 D DSN=SYS3.JES2.LINKLIB3
//*
//NFDRDSF EXEC PGM=FDRDSF,REGION=4096K
//SYSPRINT DD  SYSOUT=*
//DISK1    DD  UNIT=3330-1,VOL=SER=JES2CK,DISP=OLD
//TAPE1    DD  DSN=JES2CK3,VOL=REF=*.IEHMOVE.TAPE,LABEL=6,
//             DISP=(SHR,PASS)
 D TYPE=DSF
 D DSN=SYS1.HASPCKPT
 D DSN=SYS3.JES2.LINKLIB1
 D DSN=SYS3.JES2.LINKLIB2
 D DSN=SYS3.JES2.LINKLIB3
//*
//IEBUPXXX EXEC PGM=OFFLOAD
//STEPLIB  DD  DSN=DS.J0PDBC.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//I        DD  DSN=SYS1.PROCLIB,DISP=SHR
//O1       DD  DSN=PROCLIB,VOL=REF=*.IEHMOVE.TAPE,LABEL=7,
//             DISP=(SHR,PASS),DCB=BLKSIZE=32720
//O2       DD  DSN=PROCLIB,VOL=REF=*.IEHMOVE.TAPE,LABEL=8,
//             DISP=(SHR,PASS),DCB=BLKSIZE=32720
 O I=I,O=O1,T=UPDTE
 O I=I,O=O2,T=UPDAT
//*
//***********************************************************
//*                                                         *
//*      SAMPLE PROGRAM TO TEST THE TAPEMAP PROGRAM WHEN    *
//*      EXECUTED WITH VARIOUS PARM OPTIONS.                *
//*                                                         *
//***********************************************************
//*
//TESTA   EXEC PGM=TAPEMAP
//STEPLIB  DD  DSN=DS.J0PDBC.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSPRNT2 DD  SYSOUT=*
//SYSUT1   DD  UNIT=TAPE,VOL=REF=*.IEHMOVE.TAPE,
//             DSN=PROCLIB,DISP=SHR
//*
//TESTB   EXEC PGM=TAPEMAP,PARM=INLINE
//STEPLIB  DD  DSN=DS.J0PDBC.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSPRNT2 DD  SYSOUT=*
//SYSUT1   DD  UNIT=TAPE,VOL=REF=*.TESTA.SYSUT1,
//             DSN=PROCLIB,DISP=SHR
//*
//TESTC   EXEC PGM=TAPEMAP,PARM=NOCHECK
//STEPLIB  DD  DSN=DS.J0PDBC.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSPRNT2 DD  SYSOUT=*
//SYSUT1   DD  UNIT=TAPE,VOL=REF=*.TESTA.SYSUT1,
//             DSN=PROCLIB,DISP=SHR
//*
//TESTD   EXEC PGM=TAPEMAP,PARM=(INLINE,NOCHECK)
//STEPLIB  DD  DSN=DS.J0PDBC.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSPRNT2 DD  SYSOUT=*
//SYSUT1   DD  UNIT=TAPE,VOL=REF=*.TESTA.SYSUT1,
//             DSN=PROCLIB,DISP=SHR
