//*------------------------------------------------------------------*
//*        INSTALLATION FOR 'TLPRINT'  SUBROUTINE                    *
//*------------------------------------------------------------------*
//ASMHCL   EXEC ASMHCL,PARM.ASM='BATCH',SYSOUT=H
//SYSIN    DD DSN=ASMI99U.MI110.SUBSRC(TLPRINT),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS2.LINKLIB,DISP=SHR
//SYSIN    DD *
 SETCODE AC(1)
 NAME TLPRINT(R)
/*
