//DYNPROC JOB  (SMPEJOB),
//             'DYNAMIC PROCLIB',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             REGION=8000K
//*********************************************************************
//*
//* NAME: SYS1.DYNAMIC.PROCLIB(DYNPROCS)
//*
//* DESC: INSTALL DYNAMIC PROCLIB SUPPORT
//*
//* YOU MAY ELECT TO INSTALL MANUALLY BY FOLLOWING THE DIRECTIONS
//*WHICH ARE INCLUDED IN THE $$$DOC MEMBER OF THIS PDS
//*
//* IF YOU HAVE ANY QUESTIONS PLEASE CALL:
//*
//* BRIAN WESTERMAN        EMAIL:  BRIAN_WESTERMAN@SYZYGYINC.COM
//* SYZYGY INCORPORATED
//* PHONE: (800) 767-2244  FAX:(800) 366-4082
//*********************************************************************
//*
//*********************************************************************
//*
//* DESC: RECEIVE THE DYNAMIC PROCLIB USERMODS
//*       MAKE SURE YOU CHANGE THE DSN OF THE SMPPTFIN TO MATCH
//*       THE DATASET NAME WHERE THE USERMODS ARE.  (USUUALLY THIS ONE)
//*
//*********************************************************************
//RECEIVE EXEC SMPREC
//*
//*  REJECT THE USERMODS JUST IN CASE THIS IS A RE-RUN
//*  THEN RECEIVE ALL 6 USERMODS
//*
//SMPPTFIN DD  DISP=SHR,DSN=SYS1.DYNAMIC.PROCLIB(#DYP001)
//         DD  DISP=SHR,DSN=SYS1.DYNAMIC.PROCLIB(#DYP002)
//         DD  DISP=SHR,DSN=SYS1.DYNAMIC.PROCLIB(#DYP003)
//         DD  DISP=SHR,DSN=SYS1.DYNAMIC.PROCLIB(#DYP004)
//         DD  DISP=SHR,DSN=SYS1.DYNAMIC.PROCLIB(#DYP005)
//         DD  DISP=SHR,DSN=SYS1.DYNAMIC.PROCLIB(#DYPDMY)
//SMPCNTL  DD  *
 REJECT  SELECT(#DYP001,#DYP002,#DYP003,#DYP004,#DYP005)
 .
 RESETRC
 .
 RECEIVE SELECT(#DYP001,#DYP002,#DYP003,#DYP004,#DYP005,#DYPDMY)
 .
//APPLY   EXEC SMPAPP
//*
//*  APPLY THE SGIEF441 AND IEFVPP UPDATES
//*
//AMODGEN  DD  DISP=SHR,DSN=SYS1.AMODGEN
//AOSB3    DD  DISP=SHR,DSN=SYS1.AOSB3
//AGENLIB  DD  DISP=SHR,DSN=SYS1.AGENLIB
//LPALIB   DD  DISP=SHR,DSN=SYS1.LPALIB
//SMPCNTL  DD  *
 APPLY   SELECT(#DYP001,#DYP002)
         DIS(WRITE)
 .
//APPLY   EXEC SMPAPP
//*
//*  APPLY THE DUMMY UPDATE TO FORCE A LATER RE-LINK OF IEFVH1
//*
//AMODGEN  DD  DISP=SHR,DSN=SYS1.AMODGEN
//AOSB3    DD  DISP=SHR,DSN=SYS1.AOSB3
//AGENLIB  DD  DISP=SHR,DSN=SYS1.AGENLIB
//LPALIB   DD  DISP=SHR,DSN=SYS1.LPALIB
//SMPCNTL  DD  *
 APPLY   SELECT(#DYPDMY)
         DIS(WRITE)
 .
//RESTORE EXEC SMPAPP
//*
//*  RESTORE THE DUMMY UPDATE, THIS FORCES A RE-LINK OF IEFVH1
//*
//AMODGEN  DD  DISP=SHR,DSN=SYS1.AMODGEN
//AOSB3    DD  DISP=SHR,DSN=SYS1.AOSB3
//AGENLIB  DD  DISP=SHR,DSN=SYS1.AGENLIB
//LPALIB   DD  DISP=SHR,DSN=SYS1.LPALIB
//SMPCNTL  DD  *
 RESTORE SELECT(#DYPDMY)
         DIS(WRITE)
 .
//APPLY   EXEC SMPAPP
//*
//*  APPLY THE ZAPS TO IEFVFA, IEFVHE AND IEFVHF
//*
//AMODGEN  DD  DISP=SHR,DSN=SYS1.AMODGEN
//AOSB3    DD  DISP=SHR,DSN=SYS1.AOSB3
//AGENLIB  DD  DISP=SHR,DSN=SYS1.AGENLIB
//LPALIB   DD  DISP=SHR,DSN=SYS1.LPALIB
//SMPCNTL  DD  *
 APPLY   SELECT(#DYP003,#DYP004,#DYP005)
         DIS(WRITE)
 .
