//T0SM0200 JOB  (4030,37),'TST BEF/AFT ',CLASS=A,MSGCLASS=H
//*
//* submit the job in this member -
//*   then immediately submit the jobs in SAMP0021
//*
//*
//*   TESTING /*BEFORE AND /*AFTER
//*
//*
//STEPONE1  EXEC  PGM=MSSWAIT,PARM=00013000   <<== WAIT 90 SECONDS
//*
//*  This job simply goes into a wait state for one minute while
//*   you go and submit the jobs in member SAMP0021.
//*
