//*
//* THIS MEMORY ZAP ALLOWS YOU TO CHANGE THE 70% AND 85 % THRESHOLDS
//* TO MORE AGGRESSIVE VALUES : 90% AND 95 %.
//*
//* IT IS DESTINED TO B&B RESOLVE CUSTOMERS, BUT ANY OTHER MONITOR
//* COULD DO IT.
//*
//* IRA200E AUXILIARY STORAGE SHORTAGE
//* 70% OF ALL AVAILABLE SLOTS IN THE SYSTEM ARE IN USE
//* THE SYSTEM REJECTS LOGON, MOUNT, AND START COMMANDS UNTIL THE
//* SHORTAGE IS RELIEVED
//*
//* IRA201E CRITICAL AUXILIARY STORAGE SHORTAGE
//* 85% OF ALL AVAILABLE SLOTS IN THE SYSTEM ARE IN USE
//*
//* ISRDDN COMMAND TO DISPLAY THE VALUE : B 0.+10?+25C?+C?+68
//*
//RESOLVE  EXEC PGM=RESOLVE,REGION=8M,TIME=1440,PARM=BATCH
//STEPLIB  DD DISP=SHR,DSN=RESOLVE.LINK
//BBHELP   DD DISP=SHR,DSN=RESOLVE.HELP
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
DU,10%+25C?+C?+68,4
ZAP,*,004B0055,005A005F
DU,10%+25C?+C?+68,4
