* DISPLAYING RACF USERIDS WITH WEAK D.E.S. PASSWORD
*
* XEPHON - RACF UPDATE (NOV 1995)
*
* LINK-EDIT WITH AC=1 IN AN APF-AUTHORIZED LIBRARY
* THIS PROGRAMS DISPLAYS ALL USERIDS WITH A WEAK PASSWORD, 3 TYPES :
*   TYPE 1 : PASSWORD=GROUP  (DEFAULT PASSWORD AFTER ADDUSER COMMAND)
*   TYPE 2 : PASSWORD=USERID
*   TYPE 3 : PASSWORD= A WORD FROM A SPECIFIC LIST
* //SYSIN    : LIST OF USERS
* //SYSPRINT : OUTPUT FROM WEAKPASS
WEAKPASS CSECT
R0       EQU 0
R1       EQU 1
R2       EQU 2
R3       EQU 3
R4       EQU 4
R5       EQU 5
R6       EQU 6
R7       EQU 7
R8       EQU 8
R9       EQU 9
R10      EQU 10
R11      EQU 11
R12      EQU 12
R13      EQU 13
R14      EQU 14
R15      EQU 15
         STM   R14,R12,12(R13)      SAVE CALLER'S REGISTERS
         LR    R12,R15              LOAD BASE REGISTER
         USING WEAKPASS,R12         ESTABLISH ADDRESSABILITY
         ST    R13,SAVE+4           BACK CHAIN
         LA    R15,SAVE             NEW SAVE AREA
         ST    R15,8(,R13)          FORWARD CHAIN
         LR    R13,R15              LOAD PROGRAM'S SAVE AREA ADDRESS
         OPEN  (SYSIN,(INPUT))
         OPEN  (SYSPRINT,(OUTPUT))
         PUT   SYSPRINT,TITLE
LOOP     DS    0H
         GET   SYSIN,ZONEIN         READ A RECORD TO OBTAIN AN USERID
* INITIALIZE DATA
         MVC   USERID,ZONEIN
         MVC   GROUP,=CL8'????????' NO GROUP BY DEFAULT
         MVC   PGMR,=CL20'????????????????????'     NO NAME BY DEFAULT
         MVI   FLAG2,X'00'          BY DEFAULT, NOT SPECIAL
         MVI   FLAG3,X'00'          BY DEFAULT, NOT OPERATIONS
         MVI   FLAG4,X'00'          BY DEFAULT, NOT REVOKED
* GET ENCRYPTED PASSWORD
         MODESET MODE=SUP,KEY=ZERO
         RACXTRT TYPE=EXTRACT,ENTITY=USERID,FIELDS=LISTXTRT,RELEASE=1.8
         LTR   R15,R15
         BZ    GOOD1
* ERROR, GET RETURN CODE AND REASON CODE
         ST    R15,WORD
         ST    R0,REG0
         MODESET MODE=PROB,KEY=NZERO
         MVC   OUTMSG,MSG2          ERROR MESSAGE
         LH    R1,WORD+2            LOAD BINARY ZONE
         CVD   R1,DBLEWORD          CONVERT TO DECIMAL
         MVC   WORK6,MASK1          LOAD MASK FOR ED INSTRUCTION
         ED    WORK6,PACKED3        CONVERSION FROM PACKED TO DECIMAL
         MVC   OUTMSG+19(6),WORK6   RETURN CODE
         LH    R1,REG0+2            LOAD BINARY ZONE
         CVD   R1,DBLEWORD          CONVERT TO DECIMAL
         MVC   WORK6,MASK1          LOAD MASK FOR ED INSTRUCTION
         ED    WORK6,PACKED3        CONVERSION FROM PACKED TO DECIMAL
         MVC   OUTMSG+34(6),WORK6   REASON CODE
         B     PRINTALL
* STORE ENCRYPTED PASSWORD AND OTHER RACF INFORMATION
GOOD1    DS    0H
         XR    R3,R3
         ICM   R3,B'0011',4(R1)     OFFSET TO PASSWORD IN BUFFER
         MVC   GROUP,32(R1)
         AR    R1,R3
         LA    R1,4(0,R1)           SKIP LENGTH FIELD
         MVC   PASSW,0(R1)          PASSWORD
         LA    R1,12(0,R1)          SKIP PASSWORD + LENGTH FIELD
         MVC   PGMR,0(R1)           PROGRAMMER'S NAME
         LA    R1,24(0,R1)          SKIP PROG NAME + LENGTH FIELD
         MVC   FLAG2,0(R1)          SPECIAL FLAG
         LA    R1,5(0,R1)           SKIP FLAG + LENGTH FIELD
         MVC   FLAG3,0(R1)          OPERATIONS FLAG
         LA    R1,5(0,R1)           SKIP FLAG + LENGTH FIELD
         MVC   FLAG4,0(R1)          REVOKE FLAG
         MODESET MODE=PROB,KEY=NZERO
* IS PASSWORD EQUAL TO USERID ?
         MVC   PASS3,USERID         USERID
         MVI   TYPE,C'2'            USERID
         BAL   R10,TRIAL
         CLC   RC,=F'0'             WEAK PASSWORD ?
         BNE   ITSWEAK              YES
* IS PASSWORD EQUAL TO GROUP ?
         MVC   PASS3,GROUP          GROUP
         MVI   TYPE,C'1'            GROUP
         BAL   R10,TRIAL
         CLC   RC,=F'0'             WEAK PASSWORD ?
         BNE   ITSWEAK              YES
* IS PASSWORD EQUAL TO AN ITEM FROM OUR LIST ?
         LA    R8,LIST
         MVI   TYPE,C'3'            LIST
LOOPLIST CLI   0(R8),X'FF'          END OF LIST ?
         BE    LISTEND
         MVC   PASS3,0(R8)          TRIAL PASSWORD
         BAL   R10,TRIAL
         CLC   RC,=F'0'             WEAK PASSWORD ?
         BNE   ITSWEAK              YES
         LA    R8,8(0,R8)           NEXT ITEM
         B     LOOPLIST
LISTEND  DS    0H
* NO ERROR FOR THIS USER
         MVI   OUTMSG,C' '          BLANK ERROR MESSAGE
         MVC   OUTMSG+1(L'OUTMSG-1),OUTMSG
         B     PRINTALL
* WEAK PASSWORD
ITSWEAK  DS    0H
         MVC   OUTMSG,MSG1          ERROR MESSAGE
         MVC   OUTMSG+31(1),TYPE    TYPE OF WEAK PASSWORD
* PRINT ALL INFORMATION
PRINTALL MVC   OUTUSER,USERID       USERID
         MVC   OUTGROUP,GROUP       GROUP
         MVC   OUTPGMR,PGMR         PROGRAMMER'S NAME
         MVI   OUTFLAG2,C' '        DEFAULT FLAG
         MVI   OUTFLAG3,C' '        DEFAULT FLAG
         MVI   OUTFLAG4,C' '        DEFAULT FLAG
         CLI   FLAG2,X'00'          SPECIAL FLAG
         BE    NOTSPEC              NOT SPECIAL
         MVI   OUTFLAG2,C'S'        SPECIAL FLAG
NOTSPEC  CLI   FLAG3,X'00'          OPER FLAG
         BE    NOTOPER              NOT OPERATIONS
         MVI   OUTFLAG3,C'O'        OPER FLAG
NOTOPER  CLI   FLAG4,X'00'          REVOKE FLAG
         BE    NOTREVOK             NOT REVOKED
         MVI   OUTFLAG4,C'R'        REVOKED FLAG
NOTREVOK DS    0H
         PUT   SYSPRINT,ZONEOUT
         B     LOOP
ENDREAD  CLOSE (SYSIN)
         CLOSE (SYSPRINT)
         L     R13,4(R13)
         RETURN  (14,12),T,RC=0
* SUBROUTINE FOR ENCRYPTING TRIAL PASSWORD ; RETURNS RC=0 IF NO MATCH
TRIAL    DS    0H
         XC    RC,RC                BY DEFAULT, NO PROBLEM
         MVI   ZONE,X'08'           8 BYTES TO ENCRYPT
         MODESET MODE=SUP,KEY=ZERO
         RACXTRT TYPE=ENCRYPT,ENTITY=USERID,ENCRYPT=(ZONE,DES)
         LTR   R15,R15
         BZ    GOOD2
* ERROR, GET RETURN CODE
         ST    R15,WORD
         MODESET MODE=PROB,KEY=NZERO
         MVC   OUTMSG,MSG3          ERROR MESSAGE
         LH    R1,WORD+2            LOAD BINARY ZONE
         CVD   R1,DBLEWORD          CONVERT TO DECIMAL
         MVC   WORK6,MASK1          LOAD MASK FOR ED INSTRUCTION
         ED    WORK6,PACKED3        CONVERSION FROM PACKED TO DECIMAL
         MVC   OUTMSG+19(6),WORK6   RETURN CODE
         B     PRINTALL
GOOD2    MODESET MODE=PROB,KEY=NZERO
* VERIFYING ENCRYPTED PASSWORDS : IF IDENTICAL, IT IS A WEAK PASSWORD
         CLC   PASS3,PASSW
         BNE   ENDTRIAL
         MVC   RC,=F'8'             ** WEAK PASSWORD **
ENDTRIAL BR    R10
* HARD-CODED LIST OF WEAK PASSWORDS
LIST     DS    0H
         DC    CL8'SYSTEME'
         DC    CL8'BANQUE'
         DC    CL8'CREDIT'
         DC    CL8'BLH'
         DC    X'FF'                END OF LIST FLAG
SAVE     DS    18F
MASK1    DC    X'402020202121'      MASK FOR PACKED LENGTH 3
SYSIN    DCB   DDNAME=SYSIN,MACRF=GM,EODAD=ENDREAD,DSORG=PS
SYSPRINT DCB   DDNAME=SYSPRINT,MACRF=PM,DSORG=PS,LRECL=133,RECFM=F
ZONEIN   DS    CL80
TITLE    DC    CL133' -USERID- -GROUP-- -PROGRAMMER''S NAME-- SOR -----*
               ------------ E R R O R    M E S S A G E ---------------'
ZONEOUT  DS   0CL133
         DC    C' '
OUTUSER  DS    CL8
         DC    C' '
OUTGROUP DS    CL8
         DC    C' '
OUTPGMR  DS    CL20
         DC    C' '
OUTFLAG2 DS    CL1
OUTFLAG3 DS    CL1
OUTFLAG4 DS    CL1
         DC    C' '
OUTMSG   DS    CL60
         DC    CL(ZONEOUT+L'ZONEOUT-*)' '
MSG1     DC    CL60' ** WEAK D.E.S. PASSWORD (TYPE X) **'
MSG2     DC    CL60' EXTRACT ERROR, RC=NNNNNN, REASON=NNNNNN (DEC)'
MSG3     DC    CL60' ENCRYPT ERROR, RC=NNNNNN (DEC)'
TYPE     DC    C' '
*
GROUP    DC    CL8' '               RACF GROUP
USERID   DC    CL8' '
REG0     DC    F'0'
PGMR     DC    CL20' '              PROGRAMMER'S NAME
PASSW    DC    CL8' '               ENCRYPTED USER'S PASSWORD
FLAG2    DS    CL1                  SPECIAL FLAG
FLAG3    DS    CL1                  OPERATIONS FLAG
FLAG4    DS    CL1                  REVOKE FLAG
WORD     DC    F'0'
* FIELD LIST FOR RACXTRT EXTRACT
LISTXTRT DC    F'5'                 5 FIELDS :
         DC    CL8'PASSWORD'        ENCRYPTED PASSWORD
         DC    CL8'PGMRNAME'        PROGRAMMER'S NAME
         DC    CL8'FLAG2'           "SPECIAL" FLAG
         DC    CL8'FLAG3'           "OPERATIONS" FLAG
         DC    CL8'FLAG4'           "REVOKE" FLAG
ZONE     DS    0CL9
         DC    CL1' '
PASS3    DC    CL8' '
RC       DS    F
* WORK ZONES
DBLEWORD DS    D                    DOUBLE WORD FOR INSTRUCTION CVD
         ORG   DBLEWORD+5
PACKED3  DS    PL3
         ORG   DBLEWORD+3
PACKED5  DS    PL5
WORK6    DS    CL6
         LTORG
         END
