        MACRO
        XTOD   &TOD,&TIME
.*              CL4   CL5
.* TRANSFORMER UN TOD CONTENANT DES 100EMES DE SECONDES EN HEURE
.* EN ENTREE  &TOD  (CL4)
.* EN SORTIE ON DONNE &TIME (CL5) SOUS FORME HH:MN
.*
         AIF (L'&TOD LT 4).ERR1
         AIF (L'&TIME LT 5).ERR2
         B  XTO4&SYSNDX
XTO3&SYSNDX DC CL6' '
XTO1&SYSNDX DC H'0'
XTO2&SYSNDX DC H'0'
XTO4&SYSNDX DS 0H
         XR  0,0
         ICM 1,15,&TOD
         D   0,=F'360000'  (R0,R1)/100/3600
         STH 1,XTO1&SYSNDX HEURE EN BINAIRE
*
         XR  0,0
         ICM 1,15,&TOD
         D   0,=F'6000'  R1 = &TOD EN MINUTES
         STH 1,XTO2&SYSNDX
*
         LH  1,XTO1&SYSNDX
         XR  0,0
         M   0,=F'60'    HEURE * 60 = MINUTES
         LH  0,XTO2&SYSNDX
         SR  R0,R1        -> MINUTES
         STH R0,XTO2&SYSNDX
.*
         EXTEND XTO2&SYSNDX,XTO3&SYSNDX
         MVC &TIME+3(2),XTO3&SYSNDX+4
.*
         EXTEND XTO1&SYSNDX,XTO3&SYSNDX
         MVC &TIME.(2),XTO3&SYSNDX+4
         MVI &TIME+2,C':'    HH:MN
         MEXIT
.ERR1    MNOTE 8,'** &TOD MUST BE AT LEAST 4 BYTES LONG **'
         MEXIT
.ERR2    MNOTE 8,'** &TIME MUST BE AT LEAST 5 BYTES LONG **'
         MEXIT
         MEND
