/* REXX - Sample for testing */
"altlib activate application(exec) dataset('SLBD1.CAVXTRT.NEW.exec')"
address ispexec
"libdef ispplib dataset id('SLBD1.CAVXTRT.NEW.panels') stack"
'select cmd(%cavxtrt) newappl(isr) passlib'
address tso
'altlib deactivate application(exec)'
address ispexec
'libdef ispplib'
