//C838704B JOB TPCICS001,'BATCHTSO',
//             CLASS=B,COND=(4,LT),
//             MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//*   EX 'TPCICS.C838704.$(BATCHISP)'
//*
//ISPFBTCH EXEC PGM=IKJEFT01,DYNAMNBR=65,REGION=4096K
//SYSTSPRT DD SYSOUT=X
//SYSOUT   DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSTSIN  DD *
 DELETE 'TPCICS.C838704.$$(X1)'
 RENAME 'TPCICS.C838704.$$(X0)' -
        'TPCICS.C838704.$$(X1)'
/*
