//C838704D JOB (TPCICS001),'Distribute CSGCH*',MSGLEVEL=1,
//        MSGCLASS=X,CLASS=A,NOTIFY=&SYSUID TYPRUN=SCAN
//*
//VARS SET SOURCE=TPCICS.C838704.$$
//     SET DATASET=TPCICS.LOGON.ALLINONE
//*
//*-------------------------------------------------------------------*
//* Watch the copying of member CSGCH$ accross systems as the TELSTA  *
//* prototype may cream carefully sculped member on remote systems.   *
//*-------------------------------------------------------------------*
//*
//RERUN    EXEC PGM=IEFBR14
//OUT1     DD  DSN=&DATASET,
//             DISP=(MOD,DELETE),
//             SPACE=(TRK,(0,0)),UNIT=SYSALLDA
//*
//COPY1    EXEC PGM=IEBCOPY,PARM='SIZE=200K'
//IN1      DD  DISP=SHR,DSN=&SOURCE
//OUT1     DD  DSN=&DATASET,
//             DISP=(NEW,CATLG),
//             SPACE=(TRK,(30,15,10),RLSE),UNIT=SYSALLDA,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0,DSORG=PO)
//*
//SYSUT3   DD  UNIT=VIO,SPACE=(80,(6000,2000))
//SYSUT4   DD  UNIT=VIO,SPACE=(80,(6000,2000))
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 COPY INDD=((IN1,R)),OUTDD=OUT1
  SELECT MEMBER=$WHOAMI
  SELECT MEMBER=BR
  SELECT MEMBER=CSGCH
  SELECT MEMBER=((CSGCH$,CSGCH$$))
  SELECT MEMBER=((CSGCH$A1,ANY1))
  SELECT MEMBER=((CSGCH$IX,$$$INDEX))
  SELECT MEMBER=((CSGCH$RM,$$README))
  SELECT MEMBER=CSGCH$VF
  SELECT MEMBER=CSGCHELP
  SELECT MEMBER=CSGCHJ
  SELECT MEMBER=CSGCHJ1
  SELECT MEMBER=CSGCHSLV
  SELECT MEMBER=CSGCHSRC
  SELECT MEMBER=CSGCHXCU
  SELECT MEMBER=CSGCHXJC
  SELECT MEMBER=CSGCHXOC
  SELECT MEMBER=CSGCHXTP
  SELECT MEMBER=CSGCHXWO
  SELECT MEMBER=$CSTRING
  SELECT MEMBER=$DATEMAN
  SELECT MEMBER=HELPDRVR
  SELECT MEMBER=HELPTN
  SELECT MEMBER=REAL
  SELECT MEMBER=WORDAT

  SELECT MEMBER=CSGCHP
  SELECT MEMBER=CSGCHPCO
  SELECT MEMBER=CSGCHPDY
  SELECT MEMBER=CSGCHPH
  SELECT MEMBER=CSGCHPLG
  SELECT MEMBER=CSGCHPOP
  SELECT MEMBER=CSGCHPR
  SELECT MEMBER=HELPDRVP
  SELECT MEMBER=HELPTBD1

  SELECT MEMBER=HELPDRVS

  SELECT MEMBER=GC00

  SELECT MEMBER=CSGCHTRG
  SELECT MEMBER=CSGCHTRP
/*
//
