//&USERID.&ID  JOB (&ACCT),
//    'RELINK - &MEMBER',REGION=512K,
//    MSGCLASS=&OUTCL,NOTIFY=&&SYSUID
//*
//LKED     EXEC PGM=IEWL,REGION=512K,
//  PARM=(&LINKPARM)
//LOAD     DD   DISP=SHR,DSN=&UDSNAME
//SYSLMOD  DD   DISP=SHR,DSN=&UOUTFILE
//SYSUT1   DD   DSN=&&SYSUT1,UNIT=(SYSALLDA,SEP=(SYSLIN,SYSLMOD)),
//             SPACE=(1024,(50,20))
//SYSPRINT DD   SYSOUT=*
//SYSLIN   DD   *
    INCLUDE LOAD(&MEMBER)
    NAME &NMEMBER(R)
//* SETCODE AC(1)
