)ATTR
 _ TYPE(INPUT) INTENS(HIGH) CAPS(ON)
 ` TYPE(INPUT) INTENS(HIGH) CAPS(ON) HILITE(USCORE)
 @ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
 ¬ TYPE(TEXT) INTENS(HIGH) COLOR(BLUE) HILITE(USCORE)
 ? TYPE(OUTPUT) SKIP(ON) INTENS(LOW) CAPS(ON)
 $ TYPE(OUTPUT) SKIP(ON) INTENS(HIGH) COLOR(YELLOW)
 ~ TYPE(OUTPUT) SKIP(ON) INTENS(HIGH) COLOR(GREEN)
)BODY EXPAND(\\)
@HoldData&S# -&HOLDDSN-\-\-
@&SID%===>_ZCMD                    +&XXX                      %Scroll ===>_AMT +
  ¬PTF     ¬B¬Reason(s)        ¬Causer
)MODEL
`Z?MEMBER  ~Z$REASON           ?CAUSER
)INIT
  &SID=&ZSYSID
  .ZVARS = '(SEL BROWSED)'
  .HELP  = 'HOLDDAP1'
  &XAMT = TRANS(TRUNC(&AMT,1) H,HALF P,PAGE C,CSR D,DATA *,*)
  IF (&XAMT = HALF,PAGE,CSR,DATA) &AMT = &XAMT
  IF (&SELCTDAT ¬= INPUT)
     &SELCTDAT = OUTPUT
  IF (&HOLDDSN ¬= &Z) &@HOLDDSN = ' &HOLDDSN '
  &XXHFO = '''&H?F'''
)PROC
  &XAMT = TRANS(TRUNC(&AMT,1) H,HALF P,PAGE C,CSR D,DATA *,*)
  IF (&XAMT = HALF,PAGE,CSR,DATA) &AMT = &XAMT
  &CSRF = .CURSOR
  &CSRP = .CSRPOS
)END
