)ATTR
 _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) HILITE(USCORE)
 [ TYPE(&DSNT) INTENS(HIGH) COLOR(GREEN) CAPS(ON) HILITE(USCORE)
 ] TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW)
 @ TYPE(OUTPUT) INTENS(HIGH) COLOR(GREEN)
 { TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
 } TYPE(TEXT)   SKIP(ON) COLOR(TURQ) HILITE(USCORE)
 ? TYPE(TEXT)   SKIP(ON) COLOR(&CHCOL1) HILITE(USCORE)
 ~ TYPE(TEXT)   SKIP(ON) COLOR(&CHCOL2) HILITE(USCORE)
 # TYPE(OUTPUT) SKIP(ON) INTENS(LOW) CAPS(ON)
 ¬ TYPE(OUTPUT) SKIP(ON) INTENS(LOW) CAPS(ON) JUST(RIGHT)
)BODY EXPAND(\\)
{&ZTIME - Member Manager (&MMCHPERM) -\-\-
%&SID%===>_ZCMD                                               %Scroll ===>_AMT +
+Dsn:1[DSN1                              +:2[DSN2                              +
}}}}  Name  ?Changed-&V1   }    Exist  }}}~Changed-&V2   }    Exist  } Userid +
)MODEL ROWS(&DISP)
_Z @MEMBER  ¬Z       #Z      ¬Z        ]Z ¬Z       #Z    ¬Z          #Z
)INIT
  IF (&MMCHPERM=0)
     &CHCOL1='RED'
     &CHCOL2='RED'
  IF (&MMCHPERM=*)
     &CHCOL1='TURQ'
     &CHCOL2='TURQ'
  IF (&MMCHPERM=1)
     &CHCOL1='TURQ'
     &CHCOL2='RED'
  IF (&MMCHPERM=2)
     &CHCOL1='RED'
     &CHCOL2='TURQ'
  IF (&LOCK=1) &DSNT='OUTPUT'
  ELSE &DSNT='INPUT'
  &SID   = &ZSYSID
  .ZVARS = '(SEL DMDATE1 LMTIME1 EXIST1 LATESTD DMDATE2 LMTIME2 EXIST2 LUSER)'
  &XAMT = TRANS(TRUNC(&AMT,1) H,HALF P,PAGE C,CSR D,DATA *,*)
  IF (&XAMT = HALF,PAGE,CSR,DATA) &AMT = &XAMT
  IF (&SELCTDAT ¬= INPUT)
     &SELCTDAT = OUTPUT
)PROC
  &XAMT = TRANS(TRUNC(&AMT,1) H,HALF P,PAGE C,CSR D,DATA *,*)
  IF (&XAMT = HALF,PAGE,CSR,DATA) &AMT = &XAMT
)END
