)ATTR DEFAULT(%+_)
  @ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
  ~ TYPE(INPUT) INTENS(LOW) COLOR(RED) HILITE(USCORE)
  ` TYPE(INPUT) INTENS(LOW) COLOR(BLUE) HILITE(USCORE)
  # TYPE(TEXT) HILITE(REVERSE) ATTN(OFF)  SKIP(ON) COLOR(GREEN)
  | AREA(DYNAMIC) SCROLL(ON)
)BODY EXPAND(\\)
@&HEADLINE
@&SID%===>_ZCMD                                                                @
#Alias    No  Dataset name                                                   &C2
~XEA121  @121`XED121
~XEA122  @122`XED122
~XEA123  @123`XED123
~XEA124  @124`XED124
~XEA125  @125`XED125
~XEA126  @126`XED126
~XEA127  @127`XED127
~XEA128  @128`XED128
~XEA129  @129`XED129
~XEA130  @130`XED130
~XEA131  @131`XED131
~XEA132  @132`XED132
~XEA133  @133`XED133
~XEA134  @134`XED134
~XEA135  @135`XED135
~XEA136  @136`XED136
~XEA137  @137`XED137
~XEA138  @138`XED138
~XEA139  @139`XED139
~XEA140  @140`XED140
~XEA141  @141`XED141
~XEA142  @142`XED142
~XEA143  @143`XED143
~XEA144  @144`XED144
~XEA145  @145`XED145
~XEA146  @146`XED146
~XEA147  @147`XED147
~XEA148  @148`XED148
~XEA149  @149`XED149
~XEA150  @150`XED150
#For longer names:   |DYN |              &XED0
~XEA181  @181`XED181
~XEA182  @182`XED182
~XEA183  @183`XED183
~XEA184  @184`XED184
@
)INIT
/* If (&TIME = &Z) &TIME = &ZTIME                                     */
 IF (&XEA125 ¬= &Z) &C03 = '<'
 IF (&XEA1  ¬= &Z)
   IF (&C3 ¬= &Z) &C03 = '&C03.>'
   ELSE           &C03 = '>'
 &C3 = &C03
 &SID  = &ZSYSID
)REINIT
/* &TIME = &ZTIME                                                     */
)PROC
  &#ZCMD# = &ZCMD
  REFRESH(ZCMD)
  &FLDCSR = .CURSOR
)END
