//PETERTJJ JOB (12345678),PETERT,MSGCLASS=H,
//        MSGLEVEL=(1,1),CLASS=A,NOTIFY=&SYSUID
//*
//*
//TEST0J   EXEC PGM=HCMTCL,REGION=0M,
//         PARM='9010'
//STEPLIB  DD DSN=PETERT.HC.LOADLIB,DISP=SHR
//MSGFILE  DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSABEND DD  SYSOUT=*
