//REP00150 JOB (2100,56-D),'DZEIG 0684 T',CLASS=C,TYPRUN=HOLD
//*
//*R THIS JOB IS TO BACKUP THE VSAM MASTER CATALOGS FOR S23 AND F06
/*SETUP      REP00150,2100-56-D,C800K,01
/*MESSAGE ZEIGLER DE,3-0684,00.10,PD,WDPSC
/*MESSAGE H.IDCAMS,BACKUP.SYS1.G29MCAT -      -T-O-4-LIB
/*MESSAGE H.IDCAMS,BACKUP.SYS1.K15MCAT -      -T-O-4-LIB
/*MESSAGE
/*MESSAGE  REP00150 AND REQ00150 CAN RUN AT THE SAME
/*MESSAGE  TIME.
//*
//* JOB IS FROM RESOLVE.LIB(REP00150)
//A EXEC PGM=REPROENQ,REGION=1000K
//STEPLIB DD DSN=WDPSC.PROGLIB,DISP=SHR
//STEPCAT DD DSN=SYS1.G29MCAT,DISP=SHR
//SYSPRINT DD SYSOUT=A
//SYSUDUMP DD SYSOUT=A
//ABNLDUMP  DD DUMMY
//CATIN DD DSN=SYS1.G29MCAT,DISP=SHR,AMP='BUFND=54,BUFNI=2'
//CATOUT DD  DSN=BACKUP.SYS1.G29MCAT,LABEL=RETPD=5,DISP=(,KEEP),
// UNIT=TAPE16,DCB=(BUFNO=40,RECFM=VB,LRECL=516,BLKSIZE=15480)
   REPRO    INFILE(CATIN/PLENARY)    OUTFILE(CATOUT)
//B EXEC PGM=REPROENQ,REGION=1000K
//STEPLIB DD DSN=WDPSC.PROGLIB,DISP=SHR
//STEPCAT DD DSN=SYS1.K15MCAT,DISP=SHR
//SYSPRINT DD SYSOUT=A
//SYSUDUMP DD SYSOUT=A
//ABNLDUMP  DD DUMMY
//CATIN DD DSN=SYS1.K15MCAT,DISP=SHR,AMP='BUFND=54,BUFNI=2'
//CATOUT DD  DSN=BACKUP.SYS1.K15MCAT,LABEL=(2,RETPD=5),DISP=(,KEEP),
// UNIT=TAPE16,DCB=(BUFNO=40,RECFM=VB,LRECL=516,BLKSIZE=15480),
// VOL=(,RETAIN,REF=*.A.CATOUT)
   REPRO   INFILE(CATIN/WENGEN)  OUTFILE(CATOUT)
//*
