000010 ID DIVISION.                                                     04/14/76
000020 PROGRAM-ID. SERLCONV.                                            23528SER
000030 AUTHOR.     CHARLES J. WILSON.                                   L  LV002
000040 INSTALLATION.  LABOR AND INDUSTRIES.
000050 DATE-WRITTEN.   JUNE 9, 1975.
000060 DATE-COMPILED.
000070 REMARKS.
000080*****************************************************************
000090*  THIS PROGRAM IS A CALLED MODULE THAT PERFORMS TWO FUNCTIONS: *
000100*                                                               *
000110*    1.  EDITS FOR THE VALIDITY OF THE 5 DIGIT SERIAL DATE THAT
000120*        IS BEING PASSED TO THIS MODULE AND MOVES 'NO' TO
000130*        VALID-INPUT OF SERLCONV-I-O-AREA IF THE DATE BEING
000140*        PASSED CANNOT BE CONVERTED TO STANDARD (MMDDYY) FORMAT.
000150*        OTHERWISE 'YES' IS MOVED TO VALID-INPUT OF
000160*        SERLCONV-I-O-AREA.
000170*
000180*    2.  THE INPUT SERIAL-DATE IS CONVERTED BY TABLE LOOK-UP
000190*        TO JULIAN (YYDDD) FORMAT. THIS MODULE THEN CALLS
000200*        'JTOSDATE' AND AFTER REFORMATTING THE RESULT MOVES IT TO
000210*        STANDARD-DATE OF SERLCONV-I-O-AREA SO THAT IT IS
000220*        AVAILABLE TO THE CALLING MODULE.
000230*
000240*                                                               *
000250*****************************************************************
000260     EJECT
000270 ENVIRONMENT DIVISION.
000280 CONFIGURATION SECTION.
000290 SOURCE-COMPUTER. IBM-370-158.
000300 OBJECT-COMPUTER. IBM-370-158.
000310     EJECT
000320 DATA DIVISION.
000330
000340 WORKING-STORAGE SECTION.
000350
000360 77  WORK-STOR  VALUE 'WORKING  STORAGE'     PIC X(16).
000370
000380 01  INTERMEDIATE-WORK-DATE.
000390     05  MONTH                               PIC 99.
000400     05  DAYY                                PIC 99.
000410     05  YEAR                                PIC 99.
000420
000430 01  STANDARD-DATE-WORK.
000440     05  YEAR                                PIC 99.
000450     05  MONTH                               PIC 99.
000460     05  DAYY                                PIC 99.
000470
000480
000490 01  CALCULATE-RESULTS.
000500     05  QUOTEN.
000510         10  QUOTENTS                        PIC S99V9.
000520     05  QUOTEN-BREAK REDEFINES QUOTEN.
000530         10  QUOT-NUM                        PIC S99V.
000540         10  QUOT-REMAIN                     PIC SV9.
000550
000560 01  JULIAN-DATE-WORK                        PIC 9(05).
000570     SKIP2
       01  SERIAL-DATE-CONVERSION-TABLE.
           05  DATE-TABLE.
               10  DATE-TABLE-VALUES.
                   15  YEAR-00     VALUE '00'      PIC X(2).
                   15  S-V-00      VALUE 00365     PIC 9(5).
                   15  YEAR-01     VALUE '01'      PIC X(2).
                   15  S-V-01      VALUE 00730     PIC 9(5).
                   15  YEAR-02     VALUE '02'      PIC X(2).
                   15  S-V-02      VALUE 01095     PIC 9(5).
                   15  YEAR-03     VALUE '03'      PIC X(2).
                   15  S-V-03      VALUE 01460     PIC 9(5).
                   15  YEAR-04     VALUE '04'      PIC X(2).
                   15  S-V-04      VALUE 01826     PIC 9(5).
                   15  YEAR-05     VALUE '05'      PIC X(2).
                   15  S-V-05      VALUE 02191     PIC 9(5).
                   15  YEAR-06     VALUE '06'      PIC X(2).
                   15  S-V-06      VALUE 02556     PIC 9(5).
                   15  YEAR-07     VALUE '07'      PIC X(2).
                   15  S-V-07      VALUE 02921     PIC 9(5).
                   15  YEAR-08     VALUE '08'      PIC X(2).
                   15  S-V-08      VALUE 03287     PIC 9(5).
                   15  YEAR-09     VALUE '09'      PIC X(2).
                   15  S-V-09      VALUE 03652     PIC 9(5).
                   15  YEAR-10     VALUE '10'      PIC X(2).
                   15  S-V-10      VALUE 04017     PIC 9(5).
                   15  YEAR-11     VALUE '11'      PIC X(2).
                   15  S-V-11      VALUE 04382     PIC 9(5).
                   15  YEAR-12     VALUE '12'      PIC X(2).
                   15  S-V-12      VALUE 04748     PIC 9(5).
                   15  YEAR-13     VALUE '13'      PIC X(2).
                   15  S-V-13      VALUE 05113     PIC 9(5).
                   15  YEAR-14     VALUE '14'      PIC X(2).
                   15  S-V-14      VALUE 05478     PIC 9(5).
                   15  YEAR-15     VALUE '15'      PIC X(2).
                   15  S-V-15      VALUE 05843     PIC 9(5).
                   15  YEAR-16     VALUE '16'      PIC X(2).
                   15  S-V-16      VALUE 06209     PIC 9(5).
                   15  YEAR-17     VALUE '17'      PIC X(2).
                   15  S-V-17      VALUE 06574     PIC 9(5).
                   15  YEAR-18     VALUE '18'      PIC X(2).
                   15  S-V-18      VALUE 06939     PIC 9(5).
                   15  YEAR-19     VALUE '19'      PIC X(2).
                   15  S-V-19      VALUE 07304     PIC 9(5).
                   15  YEAR-20     VALUE '20'      PIC X(2).
                   15  S-V-20      VALUE 07670     PIC 9(5).
                   15  YEAR-21     VALUE '21'      PIC X(2).
                   15  S-V-21      VALUE 08035     PIC 9(5).
                   15  YEAR-22     VALUE '22'      PIC X(2).
                   15  S-V-22      VALUE 08400     PIC 9(5).
                   15  YEAR-23     VALUE '23'      PIC X(2).
                   15  S-V-23      VALUE 08765     PIC 9(5).
                   15  YEAR-24     VALUE '24'      PIC X(2).
                   15  S-V-24      VALUE 09131     PIC 9(5).
                   15  YEAR-25     VALUE '25'      PIC X(2).
                   15  S-V-25      VALUE 09496     PIC 9(5).
                   15  YEAR-26     VALUE '26'      PIC X(2).
                   15  S-V-26      VALUE 09861     PIC 9(5).
                   15  YEAR-27     VALUE '27'      PIC X(2).
                   15  S-V-27      VALUE 10226     PIC 9(5).
                   15  YEAR-28     VALUE '28'      PIC X(2).
                   15  S-V-28      VALUE 10592     PIC 9(5).
                   15  YEAR-29     VALUE '29'      PIC X(2).
                   15  S-V-29      VALUE 10957     PIC 9(5).
                   15  YEAR-30     VALUE '30'      PIC X(2).
                   15  S-V-30      VALUE 11322     PIC 9(5).
                   15  YEAR-31     VALUE '31'      PIC X(2).
                   15  S-V-31      VALUE 11687     PIC 9(5).
                   15  YEAR-32     VALUE '32'      PIC X(2).
                   15  S-V-32      VALUE 12053     PIC 9(5).
                   15  YEAR-33     VALUE '33'      PIC X(2).
                   15  S-V-33      VALUE 12418     PIC 9(5).
                   15  YEAR-34     VALUE '34'      PIC X(2).
                   15  S-V-34      VALUE 12783     PIC 9(5).
                   15  YEAR-35     VALUE '35'      PIC X(2).
                   15  S-V-35      VALUE 13148     PIC 9(5).
                   15  YEAR-36     VALUE '36'      PIC X(2).
                   15  S-V-36      VALUE 13514     PIC 9(5).
                   15  YEAR-37     VALUE '37'      PIC X(2).
                   15  S-V-37      VALUE 13879     PIC 9(5).
                   15  YEAR-38     VALUE '38'      PIC X(2).
                   15  S-V-38      VALUE 14244     PIC 9(5).
                   15  YEAR-39     VALUE '39'      PIC X(2).
                   15  S-V-39      VALUE 14609     PIC 9(5).
                   15  YEAR-40     VALUE '40'      PIC X(2).
                   15  S-V-40      VALUE 14975     PIC 9(5).
                   15  YEAR-41     VALUE '41'      PIC X(2).
                   15  S-V-41      VALUE 15340     PIC 9(5).
                   15  YEAR-42     VALUE '42'      PIC X(2).
                   15  S-V-42      VALUE 15705     PIC 9(5).
                   15  YEAR-43     VALUE '43'      PIC X(2).
                   15  S-V-43      VALUE 16070     PIC 9(5).
                   15  YEAR-44     VALUE '44'      PIC X(2).
                   15  S-V-44      VALUE 16436     PIC 9(5).
                   15  YEAR-45     VALUE '45'      PIC X(2).
                   15  S-V-45      VALUE 16801     PIC 9(5).
                   15  YEAR-46     VALUE '46'      PIC X(2).
                   15  S-V-46      VALUE 17166     PIC 9(5).
                   15  YEAR-47     VALUE '47'      PIC X(2).
                   15  S-V-47      VALUE 17531     PIC 9(5).
                   15  YEAR-48     VALUE '48'      PIC X(2).
                   15  S-V-48      VALUE 17897     PIC 9(5).
                   15  YEAR-49     VALUE '49'      PIC X(2).
                   15  S-V-49      VALUE 18262     PIC 9(5).
                   15  YEAR-50     VALUE '50'      PIC X(2).
                   15  S-V-50      VALUE 18627     PIC 9(5).
                   15  YEAR-51     VALUE '51'      PIC X(2).
                   15  S-V-51      VALUE 18992     PIC 9(5).
                   15  YEAR-52     VALUE '52'      PIC X(2).
                   15  S-V-52      VALUE 19358     PIC 9(5).
                   15  YEAR-53     VALUE '53'      PIC X(2).
                   15  S-V-53      VALUE 19723     PIC 9(5).
                   15  YEAR-54     VALUE '54'      PIC X(2).
                   15  S-V-54      VALUE 20088     PIC 9(5).
                   15  YEAR-55     VALUE '55'      PIC X(2).
                   15  S-V-55      VALUE 20453     PIC 9(5).
                   15  YEAR-56     VALUE '56'      PIC X(2).
                   15  S-V-56      VALUE 20819     PIC 9(5).
                   15  YEAR-57     VALUE '57'      PIC X(2).
                   15  S-V-57      VALUE 21184     PIC 9(5).
                   15  YEAR-58     VALUE '58'      PIC X(2).
                   15  S-V-58      VALUE 21549     PIC 9(5).
                   15  YEAR-59     VALUE '59'      PIC X(2).
                   15  S-V-59      VALUE 21914     PIC 9(5).
                   15  YEAR-60     VALUE '60'      PIC X(2).
                   15  S-V-60      VALUE 22280     PIC 9(5).
                   15  YEAR-61     VALUE '61'      PIC X(2).
                   15  S-V-61      VALUE 22645     PIC 9(5).
                   15  YEAR-62     VALUE '62'      PIC X(2).
                   15  S-V-62      VALUE 23010     PIC 9(5).
                   15  YEAR-63     VALUE '63'      PIC X(2).
                   15  S-V-63      VALUE 23375     PIC 9(5).
                   15  YEAR-64     VALUE '64'      PIC X(2).
                   15  S-V-64      VALUE 23741     PIC 9(5).
                   15  YEAR-65     VALUE '65'      PIC X(2).
                   15  S-V-65      VALUE 24106     PIC 9(5).
                   15  YEAR-66     VALUE '66'      PIC X(2).
                   15  S-V-66      VALUE 24471     PIC 9(5).
                   15  YEAR-67     VALUE '67'      PIC X(2).
                   15  S-V-67      VALUE 24836     PIC 9(5).
                   15  YEAR-68     VALUE '68'      PIC X(2).
                   15  S-V-68      VALUE 25202     PIC 9(5).
                   15  YEAR-69     VALUE '69'      PIC X(2).
                   15  S-V-69      VALUE 25567     PIC 9(5).
                   15  YEAR-70     VALUE '70'      PIC X(2).
                   15  S-V-70      VALUE 25932     PIC 9(5).
                   15  YEAR-71     VALUE '71'      PIC X(2).
                   15  S-V-71      VALUE 26297     PIC 9(5).
                   15  YEAR-72     VALUE '72'      PIC X(2).
                   15  S-V-72      VALUE 26663     PIC 9(5).
                   15  YEAR-73     VALUE '73'      PIC X(2).
                   15  S-V-73      VALUE 27029     PIC 9(5).
                   15  YEAR-74     VALUE '74'      PIC X(2).
                   15  S-V-74      VALUE 27393     PIC 9(5).
                   15  YEAR-75     VALUE '75'      PIC X(2).
                   15  S-V-75      VALUE 27758     PIC 9(5).
                   15  YEAR-76     VALUE '76'      PIC X(2).
                   15  S-V-76      VALUE 28124     PIC 9(5).
                   15  YEAR-77     VALUE '77'      PIC X(2).
                   15  S-V-77      VALUE 28489     PIC 9(5).
                   15  YEAR-78     VALUE '78'      PIC X(2).
                   15  S-V-78      VALUE 28854     PIC 9(5).
                   15  YEAR-79     VALUE '79'      PIC X(2).
                   15  S-V-79      VALUE 29219     PIC 9(5).
                   15  YEAR-80     VALUE '80'      PIC X(2).
                   15  S-V-80      VALUE 29585     PIC 9(5).
                   15  YEAR-81     VALUE '81'      PIC X(2).
                   15  S-V-81      VALUE 29950     PIC 9(5).
                   15  YEAR-82     VALUE '82'      PIC X(2).
                   15  S-V-82      VALUE 30315     PIC 9(5).
                   15  YEAR-83     VALUE '83'      PIC X(2).
                   15  S-V-83      VALUE 30680     PIC 9(5).
                   15  YEAR-84     VALUE '84'      PIC X(2).
                   15  S-V-84      VALUE 31046     PIC 9(5).
                   15  YEAR-85     VALUE '85'      PIC X(2).
                   15  S-V-85      VALUE 31411     PIC 9(5).
                   15  YEAR-86     VALUE '86'      PIC X(2).
                   15  S-V-86      VALUE 31776     PIC 9(5).
                   15  YEAR-87     VALUE '87'      PIC X(2).
                   15  S-V-87      VALUE 32141     PIC 9(5).
                   15  YEAR-88     VALUE '88'      PIC X(2).
                   15  S-V-88      VALUE 32507     PIC 9(5).
                   15  YEAR-89     VALUE '89'      PIC X(2).
                   15  S-V-89      VALUE 32872     PIC 9(5).
                   15  YEAR-90     VALUE '90'      PIC X(2).
                   15  S-V-90      VALUE 33237     PIC 9(5).
                   15  YEAR-91     VALUE '91'      PIC X(2).
                   15  S-V-91      VALUE 33602     PIC 9(5).
                   15  YEAR-92     VALUE '92'      PIC X(2).
                   15  S-V-92      VALUE 33968     PIC 9(5).
                   15  YEAR-93     VALUE '93'      PIC X(2).
                   15  S-V-93      VALUE 34333     PIC 9(5).
                   15  YEAR-94     VALUE '94'      PIC X(2).
                   15  S-V-94      VALUE 34698     PIC 9(5).
                   15  YEAR-95     VALUE '95'      PIC X(2).
                   15  S-V-95      VALUE 35063     PIC 9(5).
                   15  YEAR-96     VALUE '96'      PIC X(2).
                   15  S-V-96      VALUE 35429     PIC 9(5).
                   15  YEAR-97     VALUE '97'      PIC X(2).
                   15  S-V-97      VALUE 35794     PIC 9(5).
                   15  YEAR-98     VALUE '98'      PIC X(2).
                   15  S-V-98      VALUE 36159     PIC 9(5).
                   15  YEAR-99     VALUE '99'      PIC X(2).
                   15  S-V-99      VALUE 36524     PIC 9(5).
           05  CONVERSION-TABLE REDEFINES DATE-TABLE.
               10  CONVERSION-VALUES OCCURS 100 TIMES.
                   15  CONV-YEAR                   PIC X(2).
                   15  CONV-FACTOR                 PIC 9(5).
       01  SERIAL-YEAR-X                           PIC X(2).
       01  SERIAL-YEAR-9 REDEFINES SERIAL-YEAR-X   PIC 9(2).
       01  BINARY-YEAR     COMPUTATIONAL           PIC S9(4).
       01  SERIALIZED-DATE                         PIC 9(5).
       01  YEAR-QUOT       COMPUTATIONAL-3         PIC S9(3).
       01  YEAR-REM        COMPUTATIONAL-3         PIC S9(3).
       01  JULIAN-BREAKDOWN.
           05  JULIAN-YEAR                         PIC 9(2).
           05  JULIAN-DAY                          PIC 9(3).
       01  SAVE-SERIAL-DATE                        PIC 9(5).
       01  SERIAL-DATE-X                           PIC X(5).
       01  SERIAL-DATE-9 REDEFINES SERIAL-DATE-X   PIC 9(5).
002790     EJECT
002800 LINKAGE SECTION.
002810
       01  SERLCONV-I-O-AREA.
           05  MODULE-NAME                         PIC X(8).
           05  SERIAL-DATE                         PIC X(5).
           05  STANDARD-DATE                       PIC X(6).
           05  VALID-INPUT                         PIC X(3).


002910     EJECT
002920 PROCEDURE DIVISION USING SERLCONV-I-O-AREA.
002930
002940 0100.
002950     MOVE 'SERLCONV' TO MODULE-NAME OF SERLCONV-I-O-AREA.
002960     MOVE SERIAL-DATE OF SERLCONV-I-O-AREA TO SERIAL-DATE-X.
002970     SKIP2
002980     IF SERIAL-DATE-X IS NOT NUMERIC
002990         MOVE 'NO' TO VALID-INPUT OF SERLCONV-I-O-AREA
003000         GO TO 99900-GOBACK.
003010     SKIP2
003020     IF SERIAL-DATE-9 IS LESS THAN 00001
003030         MOVE 'NO' TO VALID-INPUT OF SERLCONV-I-O-AREA
003040         GO TO 99900-GOBACK.
003050     SKIP2
003060     IF SERIAL-DATE-9 IS GREATER THAN 36524
003070         MOVE 'NO' TO VALID-INPUT OF SERLCONV-I-O-AREA
003080         GO TO 99900-GOBACK.
003090     SKIP2
003100     MOVE 'YES' TO VALID-INPUT OF SERLCONV-I-O-AREA.
003110     MOVE SERIAL-DATE-9 TO SAVE-SERIAL-DATE.
003120     SKIP2
003130     IF SERIAL-DATE-9 IS GREATER THAN 00059
003140         ADD 1 TO SAVE-SERIAL-DATE.
003150     SKIP2
003160     DIVIDE SERIAL-DATE-9 BY 365.25 GIVING YEAR-QUOT.
003170     IF YEAR-QUOT IS EQUAL TO ZERO
003180         MOVE SAVE-SERIAL-DATE TO JULIAN-DATE-WORK
003190         GO TO 10000-CALL-JTOSDATE.
003200     MOVE YEAR-QUOT TO BINARY-YEAR.
003210     SUBTRACT CONV-FACTOR (BINARY-YEAR) FROM SERIAL-DATE-9
003220         GIVING SERIALIZED-DATE.
003230     MOVE SERIALIZED-DATE TO JULIAN-BREAKDOWN.
003240     MOVE YEAR-QUOT TO JULIAN-YEAR OF JULIAN-BREAKDOWN.
003250     MOVE JULIAN-BREAKDOWN TO JULIAN-DATE-WORK
003260     GO TO 10000-CALL-JTOSDATE.
003270     SKIP2
003280 10000-CALL-JTOSDATE.
003290     CALL 'JTOSDATE' USING JULIAN-DATE-WORK STANDARD-DATE-WORK.
003300     MOVE CORR STANDARD-DATE-WORK TO INTERMEDIATE-WORK-DATE.
003310     MOVE INTERMEDIATE-WORK-DATE TO STANDARD-DATE OF
003320         SERLCONV-I-O-AREA.
003330     GO TO 99900-GOBACK.
003340     SKIP2
003350 99900-GOBACK.
003360     SKIP2
003370     GOBACK.
