./ ADD NAME=DOCPDR90 0100-86188-86188-1747-00023-00023-00000-KX00150
//&PJN JOB  (&PACCT),'&PPROG',CLASS=&PJOBC,MSGCLASS=X
/*JOBPARM  LINECT=102,L=100
//*
//S1   EXEC PGM=LISTPDS,PARM='DECK,NOLIST'
//*
//SYSPRINT DD SYSOUT=*
//SYSLIST  DD SYSOUT=*
//SYSLIB DD DISP=SHR,DSN=&PDOCN
//SYSPUNCH DD DISP=(NEW,PASS),DSN=&&TDOC,
// UNIT=SYSSQ,SPACE=(CYL,(1,1),RLSE)
//SYSIN DD DUMMY
//*
//M EXEC ROTATE90,
//       INLRECL=91,
//       LENGTH=90,
//       LINES=60,
//       OUTLREC=121,
//       CHARS=&PCHSET,
//       FCB=&PFCB,
//       COPIES=&PCOPIES,
//       TRNB=D,
//       TRNA=&PTRNA
//INPUT  DD DISP=SHR,DSN=&&TDOC
./ ADD NAME=DOCR90   0108-86043-86189-1147-00014-00013-00000-KK00150
//&PJN JOB  (&PACCT),'&PPROG',CLASS=&PJOBC,MSGCLASS=X
/*JOBPARM  LINECT=102,L=100
//M EXEC ROTATE90,
//       INLRECL=86,             WAS 91
//       LENGTH=85,              WAS 90
//       LEFTMRG=&PLMRG,         WAS 0
//       LINES=60,
//       OUTLREC=121,
//       CHARS=&PCHSET,
//       FCB=&PFCB,
//       COPIES=&PCOPIES,
//       TRNB=D,
//       TRNA=&PTRNA
//INPUT  DD DISP=SHR,DSN=&PDOCN
./ ADD NAME=FULLUT1  0104-80058-80120-1531-00013-00007-00000-LL02150
COMMAND  FULLUT1
 &*FSOPT
 &SCREEN
 &FORLIB
 &ASMSRC
 &ASMLOD
  CTL1('&ATTR1')
  CTL2('&ATTR2')
  CTL3('&ATTR3')
  CTL4('&ATTR4')
  CTL5('&ATTR5')
  CTL6('&ATTR6')
END
./ ADD NAME=FULLUT2  0113-79307-80149-1132-00008-00007-00000-KK00150
COMMAND  FULLUT2
  &SCREEN
  &ASMLOD
  SCRUFLG(&*A)
  IOBUFLG(&*B)
  SCRNFLG(&*C)
  DEST(&FU2DEST)
END
