//         JOB
//       MSGLEVEL=(1,1),CLASS=H,NOTIFY=HG00150
//*
//*
//*      THIS JOB EXTRACTS SMF TYPE 64 FROM AN SMF FILE
//*
//*
//JOBCAT  DD  DISP=SHR,DSN=SYS1.USERCAT1     (VSAMSMF)
/*ROUTE PRINT LOCAL
//*
//DOITTOIT EXEC VSAMSMF,AGY=954CICW
//*
//*  *  *  *  *  *  *  *  *  BUILD SMF64 FILE   *  *  *
//*
//XTRACT64 EXEC PGM=SMF64EXT
//STEPLIB DD DSN=WDPSC.SHARED.LOAD,DISP=SHR
//FILEIN  DD DSN=XXXXXXXX.VSAMDATA,DISP=SHR,
//           DCB=(RECFM=VBS,LRECL=32760)
//FILEOUT DD DSN=EXCHANGE.SMF64.VSAMSTAT,DISP=(,CATLG,DELETE),
//        DCB=(BLKSIZE=11408,RECFM=FB),UNIT=SYSDA,
//        SPACE=(CYL,(3,1))
//PRINTOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//*
//*  *  *  *  *  *  *  *  *
//*  *  *  *  *  *  *  *  *
//*  *  *  *  *  *  *  *  *
//*
//*
//*
//*
//*
//*
//         JOB
//       MSGLEVEL=(1,1),CLASS=H
//*
//*
//*      THIS JOB GIVES A REPORT BY VOLUME OF ALL VSAM DATASETS
//*      THAT HAD 500 OR MORE EXCPS BY ANY ONE PROCESS.
//*
//*
//JOBCAT  DD  DISP=SHR,DSN=SYS1.USERCAT1
/*ROUTE PRINT LOCAL
//STEP1  EXEC DYL280,RGN=512
//FILEIN DD DSN=EXCHANGE.SMF64.VSAMSTAT,DISP=SHR
 FILE FILEIN FB 124
  SMF64TME     4 CH        (END'TIME)
  FILLER       1
  SMF64DTE     3 PD
  SMF64JBN     8           (JOB NAME)
  SMF64RST     4 CH        (START'TIME)
  SMF64RSD     4 PD
  SMF64DNM     44          (VSAM DSN)
  SMF64NLR     4 BI Z      (RECORD'TOTAL)
  SMF64NFS     4 BI
  FILLER       2
  SMF64NCS     2 BI Z      (TOT CI'SPLITS)
  FILLER       2
  SMF64NAS     2 BI Z      (TOT CA'SPLITS)
  SMF64DDE     4 BI Z      (REC'DEL)
  SMF64DIN     4 BI Z      (REC'INS)
  SMF64DUP     4 BI Z      (REC'UPD)
  SMF64DRE     4 BI Z      (REC'READ)
  SMF64DFS     4 BI
  FILLER       2
  SMF64DCS     2 BI Z      (JOB CI'SPLITS)
  FILLER       2
  SMF64DAS     2 BI Z      (JOB CA'SPLITS)
  SMF64DEP     4 BI Z      (JOB'EXCPS)
  FILLER       1 BI
  SMF64XTN     1 BI Z      (FILE'XTNS)
  SMF64VSR     6           (VOLSER)
WORKAREA
   NONREAD      3  BI  Z  (UPDTS'INSRTS'DELS)
  IF SMF64DEP GT 499 GOTO SORTEM ELSE REJECT ENDIF   <------------
SORTEM:
  SORT FILEIN USING SMF64VSR SMF64DNM SMF64JBN       <------------
   NONREAD = SMF64DDE + SMF64DIN + SMF64DUP
  REPORT 150 WIDE
  CONTROL SMF64VSR                                   <------------
  LIST SUPPRESS SMF64VSR SUPPRESS SMF64DTE
   SMF64DNM
   SMF64JBN
   SMF64DEP
   SMF64NLR
   SMF64DRE
   NONREAD
   SMF64NCS
   SMF64NAS
   SMF64XTN
   SMF64RST
   SMF64TME
                        WITH 1 BEFORE AND 1 AFTER
  ON CHANGE SMF64VSR
  LIST '-TOTALS-' AT SMF64VSR SUM SMF64DEP
                              SUM SMF64DRE
                              SUM NONREAD
                              WITH 2 BEFORE AND WITH 2 AFTER
 T1 'VSAM ACTIVITY BY VOLUME DURING PRIME SHIFT'
 T1+5 DYLDATE
 T1+125 DYLPAGE
 T2 ' '
//*
//*  *  *  *  *  *  *  *  *
//*  *  *  *  *  *  *  *  *
//*  *  *  *  *  *  *  *  *
//*
//*
//*
//*
//*
//*
//         JOB
//       MSGLEVEL=(1,1),CLASS=H
//*
//*
//*      THIS JOB GIVES A REPORT VSAM DATASETS THAT HAD
//*      200 OR MORE EXCPS BY A CICS REGION CALLED CICS0150
//*
//*
//JOBCAT  DD  DISP=SHR,DSN=SYS1.USERCAT1                 SMF BY VOLSER
/*ROUTE PRINT LOCAL
//STEP1  EXEC DYL280,RGN=512
//FILEIN DD DSN=EXCHANGE.SMF64.VSAMSTAT,DISP=SHR
 FILE FILEIN FB 124
  SMF64TME     4 CH        (END'TIME)
  FILLER       1
  SMF64DTE     3 PD
  SMF64JBN     8           (JOB NAME)
  SMF64RST     4 CH        (START'TIME)
  SMF64RSD     4 PD
  SMF64DNM     44          (VSAM DSN)
  SMF64NLR     4 BI Z      (RECORD'TOTAL)
  SMF64NFS     4 BI
  FILLER       2
  SMF64NCS     2 BI Z      (TOT CI'SPLITS)
  FILLER       2
  SMF64NAS     2 BI Z      (TOT CA'SPLITS)
  FILLER       3
  SMF64DDE     1 BI Z      (REC'DEL)
  FILLER       3
  SMF64DIN     1 BI Z      (REC'INS)
  FILLER       3
  SMF64DUP     1 BI Z      (REC'UPD)
  SMF64DRE     4 BI Z      (REC'READ)
  SMF64DFS     4 BI
  FILLER       2
  SMF64DCS     2 BI Z      (JOB CI'SPLITS)
  FILLER       2
  SMF64DAS     2 BI Z      (JOB CA'SPLITS)
  SMF64DEP     4 BI Z      (JOB'EXCPS)
  FILLER       1 BI
  SMF64XTN     1 BI Z      (FILE'XTNS)
  SMF64VSR     6 CH        (VOLSER)
WORKAREA
   NONREAD      3  BI  Z  (UPDTS'INSRTS'DELS)
  IF SMF64DEP LT 100 REJECT ENDIF
  IF SMF64JBN EQ 'CICS0150' GOTO SORTEM ELSE REJECT ENDIF <---------
SORTEM:
  SORT FILEIN USING SMF64DNM SMF64JBN
   NONREAD = SMF64DDE + SMF64DIN + SMF64DUP
  REPORT 150 WIDE
  LIST SUPPRESS SMF64JBN SUPPRESS SMF64DTE
   SMF64VSR
   SMF64DNM
   SMF64DEP
   SMF64NLR
   SMF64DRE
   SMF64DDE
   SMF64DIN
   SMF64DUP
   SMF64NCS
   SMF64NAS
   SMF64XTN
   SMF64RST
   SMF64TME
                        WITH 1 BEFORE AND 1 AFTER
  ON FINAL
  LIST '-TOTALS-' AT SMF64DNM SUM SMF64DEP
                              SUM SMF64DRE
                              SUM NONREAD
                              WITH 2 BEFORE AND WITH 2 AFTER
 T1 'VSAM ACTIVITY BY A SINGLE JOB'
 T1+5 DYLDATE
 T1+125 DYLPAGE
 T2 ' '
