//SCOTTA JOB 'PUNCH',CLASS=A,MSGCLASS=X,NOTIFY=SCOTT,
//          MSGLEVEL=(1,1),REGION=1024K
//S1    EXEC  PGM=IEBGENER
//SYSPRINT  DD  SYSOUT=*
//SYSIN     DD  DUMMY
//SYSUT1    DD  DSN=SYS2.USERMODS(TSV0006),DISP=SHR
//SYSUT2    DD  SYSOUT=B
/*
