         MACRO
         OACTSOPL &DUMMY,&PL=,&PRINT=
         COPY  OACGBLS
         LCLA  &N,&I
         OACPRTPM PRINT=&PRINT
&N       SETA  N'&PL
&I       SETA  1
.LOOP    ANOP
         AIF   ('&PL(&I)' NE 'ACB').L0
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR0
***********************************************************************
*  THE ACCESS METHOD CONTROLE BLOCK IS USED TO PROVIDE VSAM           *
*  DCB INFO                                                           *
***********************************************************************
         SPACE 1
.PR0     ANOP
ACB      DS    0D                              ACCESS METHOD CONTROL
*                                              BLOCK
ACBID    DS    XL1                             ACB IDENTIFIER
ACBIDVAL EQU   X'A0'                           IDENTIFIER VALUE - X'A0'
ACBSTYP  DS    XL1                             ACB SUBTYPE
ACBSVSAM EQU   X'10'                           VSAM SUBTYPE     X04SVHS
ACBSVRP  EQU   X'11'                           VRP SUBTYPE      X04SVHS
ACBSVTAM EQU   X'20'                           VTAM SUBTYPE     X04SVHS
ACBS3540 EQU   X'40'                           3540 SUBTYPE     X04SVHS
ACBLENG  DS    0H                              ACB LENGTH IN BYTES
ACBLEN2  DS    0H                              ALTERNATE NAME FOR
*                                              ACBLENG           X03004
ACBLENG2 DS    H                               ALTERNATE NAME FOR
*                                              ACBLENG           X03004
ACBAMBL  DS    0A                              AMB LIST ADDRESS(VSAM)
ACBJWA   DS    0A                              JES WORK AREA ADDRESS
ACBIBCT  DS    0A                              INTERFACE BUFFER CONTROL
*                                              TABLE (RTAM)    @G29ASRL
ACBAMWAP DS    A                               ACCESS METHOD WORKAREA
*                                              POINTER         @G29ASRL
ACBINRTN DS    A                               DATA MANAGEMENT
*                                              INTERFACE ROUTINE
*                                              ADDRESS; VTAM REQUEST
*                                              PROCESSOR ADDRESS X03004
ACBMACRF DS    0BL2                            MACRF PROCESSING OPTIONS
ACBMACR1 DS    BL1                             MACRF FIRST BYTE
ACBKEY   EQU   X'80'                           KEYED PROCESSING VIA
*                                              INDEX
ACBADR   EQU   X'40'                           ADDRESSED PROCESSING
*                                              WITHOUT INDEX
ACBADD   EQU   X'40'                           ALTERNATE NAME FOR
*                                              ACBADR
ACBCNV   EQU   X'20'                           PROCESSING BY
*                                              CONTROL INTERVAL
ACBBLK   EQU   X'20'                           ALTERNATE NAME FOR
*                                              ACBCNV
ACBSEQ   EQU   X'10'                           SEQUENTIAL PROCESSING
ACBDIR   EQU   X'08'                           DIRECT PROCESSING
ACBIN    EQU   X'04'                           INPUT PROCESSING USING
*                                              GET OR READ
ACBOUT   EQU   X'02'                           OUTPUT PROCESSING USING
*                                              PUT OR WRITE
ACBUBF   EQU   X'01'                           USER CONTROLS BUFFERS -
*                                              VALID ONLY WITH CONTROL
*                                              INTERVAL PROCESSING
ACBMACR2 DS    BL1                             MACRF SECOND BYTE
ACBSKP   EQU   X'10'                           SKIP SEQUENTIAL
*                                              PROCESSING
ACBLOGON EQU   X'08'                           LOGON REQUESTS TO AN
*                                              APPLICATION WILL BE
*                                              REJECTED(VTAM)    X03004
ACBRST   EQU   X'04'                           SET DATA SET TO  X04SVHS
*                                              EMPTY STATE      X04SVHS
ACBDSN   EQU   X'02'                           BASIC SUBTASK SHARED
*                                              CONTROL BLOCK CONNECTION
*                                              ON COMMON DSNAMES
*                                                               X04SVHS
ACBAIX   EQU   X'01'                           ENTITY TO BE PROCESSED
*                                              IS AIX PATH SPECIFIED IN
*                                              IN THE GIVEN DDNAME
*                                                               X04SVHS
ACBBSTNO DS    FL1                             NUMBER OF CONCURRENT
*                                              STRINGS FOR AIX  X04SVHS
*                                              PATH             X04SVHS
ACBSTRNO DS    FL1                             NUMBER OF CONCURRENT
*                                              REQUEST STRINGS  X04SVHS
ACBBUFND DS    H                               NUMBER OF DATA RECORD
*                                              BUFFERS
ACBBUFNI DS    H                               NUMBER OF INDEX RECORD
*                                              BUFFERS
ACBBUFPL DS    0A                              JES BUFFER POOL
ACBLFB   DS    0A                              RESERVED NAME
ACBMACR3 DS    XL1                             MACRF THIRD BYTE X04SVHS
ACBLSR   EQU   X'40'                           LOCAL SHARED RESOURCE
*                                                               X04SVHS
ACBGSR   EQU   X'20'                           GLOBAL SHARED RESOURCE
*                                                               X04SVHS
ACBICI   EQU   X'10'                           IMPROVED CONTROL
*                                              INTERVAL PROCESSING
*                                                               X04SVHS
ACBDFR   EQU   X'08'                           DEFER WRITES     X04SVHS
ACBSIS   EQU   X'04'                           SEQUENTIAL INSERT
*                                              STRATEGY         X04SVHS
ACBNCFX  EQU   X'02'                           NFX=0/CFX=1      X04SVHS
ACBMACR4 DS    XL1                             RESERVED         X04SVHS
ACBJBUF  DS    H                               NUMBER OF JOURNAL
*                                              BUFFERS(VSAM)
ACBRECFM DS    BL1                             RECORD FORMAT
ACBRECAF EQU   X'80'                           JES FORMAT
ACBCCTYP DS    BL1                             CONTROL CHARACTER TYPE
ACBTRCID EQU   X'C0'                           3800 TRANSLATE TABLE+8
*                                                               Z40SVHS
ACBCCASA EQU   X'04'                           ASA CONTROL CHARACTERS
ACBCCMCH EQU   X'02'                           MACHINE CONTROL
*                                              CHARACTERS
ACBOPT   DS    0BL2                            NON-USER OPTIONS
ACBDSORG DS    0BL2                            MATCH ACBDORGA WITH
*                                              DCBDSORG
ACBDSOR1 DS    BL1                             DSORG FIRST BYTE
*        CHECKPOINT/RESTART OPTIONS
ACBCRNCK EQU   X'80'                           NO CHECK BY RESTART
*                                              FOR MODIFICATIONS SINCE
*                                              LAST CHECKPOINT
ACBCRNRE EQU   X'40'                           DATA ADDED SINCE
*                                              LAST CHECKPOINT NOT
*                                              ERASED BY RESTART AND
*                                              NO REPOSITION TO LAST
*                                              CHECKPOINT TAKES PLACE
ACBDVIND EQU   X'20'                           DEVICE INDICATR @ZA26638
ACBOPTJ  EQU   X'20'                           3800 CONTROL    @ZA26638
*                                              CHAR PRESENT    @ZA26638
ACBDSOR2 DS    BL1                             DSORG SECOND BYTE
ACBDORGA EQU   X'08'                           ACB INDICATOR
ACBMSGAR DS    A                               MSG AREA PTR     X04SVHS
ACBPASSW DS    A                               PASSWORD ADDRESS
ACBEXLST DS    0A                              USER EXIT LIST ADDRESS
ACBUEL   DS    A                               ALTERNATE NAME FOR
*                                              ACBEXLST
*              BEFORE ACB IS OPENED
*              (FOR VTAM, ACBDDNM IS INITIALIZED TO
*              X'FF00000000000000')                              X03004
ACBDDNM  DS    CL8                             DDNAME - MUST BE THE
*                                              SAME AS THE NAME FIELD
*                                              ON THE DD STATEMENT
*                                              DEFINING THE DATA SET
*                                              ASSOCIATED WITH THIS ACB
*              AFTER ACB IS OPENED
         ORG   ACBDDNM
ACBTIOT  DS    H                               OFFSET FROM TIOT ORIGIN
*                                              TO THE TIOELNGH FIELD IN
*                                              THE TIOT ENTRY FOR THE
*                                              DD STATEMENT FOR THIS
*                                              ACB
ACBINFL  DS    BL1                             CONTENTS AND MEANING
*                                              ARE THE SAME AS
*                                              ACBINFLG (BEFORE OPEN)
ACBAM    DS    0B                              ALTERNATE NAME FOR
*                                              ACBAMETH          X03004
ACBAMETH DS    BL1                             ACCESS METHOD TYPE
ACBVTAM  EQU   X'60'                           VTAM              X03004
ACBSUBS  EQU   X'41'                           SUBSYSTEMS
ACBTCAM  EQU   X'31'                           TCAM
ACBRCI   EQU   X'23'                           JES/RCI
ACBRTAM  EQU   X'22'                           JES/RTAM
ACBJAM   EQU   X'21'                           JES/JAM
ACBVSAM  EQU   X'11'                           VSAM
ACBERFL  DS    BL1                             FOR JES, CONTENTS AND
*                                              MEANING ARE THE SAME
*                                              AS ACBERFLG (BEFORE
*                                              OPEN) - NOT USED BY
*                                              VSAM/VTAM
ACBDEB   DS    AL3                             DEB ADDRESS
*              NOT MOVED BY OPEN
ACBOFLGS DS    BL1                             OPEN / CLOSE FLAGS
ACBEOV   EQU   X'20'                           EOV CONCATENATION
ACBOPEN  EQU   X'10'                           THE ACB IS OPEN
ACBDSERR EQU   X'08'                           NO FURTHER REQUESTS ARE
*                                              POSSIBLE AGAINST THIS
*                                              ACB
ACBEXFG  EQU   X'02'                           USER EXIT FLAG - SET TO
*                                              0 BY AN I/O SUPPORT
*                                              WHEN A USER EXIT TAKEN;
*                                              SET TO 1 ON RETURN
ACBLOCK  EQU   X'02'                           ALTERNATE NAME FOR
*                                              ACBEXFG          X03004
ACBIOSFG EQU   X'01'                           OPEN/CLOSE IN CONTROL -
*                                              THE ACB IS BEING
*                                              PROCESSED BY AN I/O
*                                              SUPPORT FUNCTION
ACBBUSY  EQU   X'01'                           ALTERNATE NAME FOR
*                                              ACBIOSFG         X03004
*              BEFORE ACB IS OPENED
ACBERFLG DS    BL1                             ERROR FLAGS - FOR
*                                              VSAM/VTAM THIS FIELD IS
*                                              NOT MOVED BY OPEN AND
*                                              ERROR FLAGS ARE
*                                              RETURNED HERE; FOR JES
*                                              THIS FIELD IS MOVED TO
*                                              ACBERFL BY OPEN
*              THE FOLLOWING CODES ARE COMMON TO ALL ACCESS      X03004
*              METHODS.                                          X03004
ACBOALR  EQU   X'04'                           THE ACB IS ALREADY OPEN
ACBCALR  EQU   X'04'                           THE ACB IS NOT OPEN
*                                                              @ZM30033
ACBINFLG DS    0BL2                            INDICATOR FLAGS @ZA16012
ACBINFL1 DS    BL1                             FIRST IND FLAGS @ZA16012
.*             BIT 0 - X'80' MATCHES WITH BIT 0 OF THE DCBMACR FIELD,
.*             INDICATING AN EXCP DCB.  THIS BIT IS USED TO
.*             DIFFERENTIATE BETWEEN AN ACB AND A DCB AND MUST NEVER
.*             BE ASSIGNED IN THE ACB.
ACBJEPS  EQU   X'40'                           JEPS IS USING THIS ACB
ACBIJRQE EQU   X'20'                           AN RQE IS HELD BY JAM
ACBCAT   EQU   X'10'                           ACB FOR VSAM CATALOG
ACBSCRA  EQU   X'08'                           CATALOG CONTROL BLOCK
*                                              SYSTEM AREA      X04SVHS
ACBUCRA  EQU   X'04'                           CATALOG CONTROL BLOCK
*                                              USER AREA        X04SVHS
ACBVVIC  EQU   X'02'                           DATA SET BEING OPENED
*                                              IS SYS1.VVIC     X04SVHS
ACBSDS   EQU   X'02'                           OPEN AS SYSTEM DATA SET
*                                                              @Z40SVUC
ACBBYPSS EQU   X'01'                           BYPASS SECURITY ON OPEN
*                                              IF CALLER AUTH  @Z40RSUC
ACBINFL2 DS    BL1                             2ND IND FLAGS   @ZA16012
ACBCBIC  EQU   X'20'                           OPEN WITH CONTROL BLOCKS
*                                              IN COMMON STORAGE AREA
*                                                              @ZA16012
*              NOT MOVED BY OPEN
ACBUJFCB DS    0A                              USER JFCB ADDRESS
ACBOPTN  DS    XL1                             JAM UCS INDICATORX04SVHS
         DS    XL3                             RESERVED         X04SVHS
ACBBUFSP DS    F                               VIRTUAL CORE AVAILABLE
*                                              FOR BUFFERS
ACBBLKSZ DS    0H                              BLOCKSIZE
ACBMSGLN DS    H                               LNG OF MSG AREA  X04SVHS
ACBLRECL DS    H                               LOGICAL RECORD LENGTH
ACBUAPTR DS    A                               USER WORKAREA ADDRESS;
*                                              CAXWA ADDRESS FOR
*                                              CATALOG OPEN
ACBCBMWA DS    A                               CONTROL BLOCK
*                                              MANIPULATION WORKAREA
*                                              ADDRESS
ACBAPID  DS    0A                              APPLICATION ID @G29ASRL
ACBAMAX  DS    A                               ACCESS METHOD ACB
*                                              EXTENSION      @G29ASRL
         AGO   .L99
.L0      AIF   ('&PL(&I)' NE 'ATRCB').L1
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR1
***********************************************************************
*  THE ATTRIBUTE CONTROL BLOCK IS USED TO PROVIDE DCB PARAMETERS      *
*  TO THE DYNAMIC ALLOCATION ROUTINE.                                 *
***********************************************************************
         SPACE 1
.PR1     ANOP
ATRCB    DS    0D
ATRFORWD DS    AL4       ADDRESS OF NEXT ATRCB
ATRBCKWD DS    AL4       ADDRESS OF PREVIOUS ATRCB
         DS    CL4       RESERVED
ATRNAME  DS    CL8       ATTR-LIST-NAME
ATRLNGH  DS    CL2       LENGTH OF ATRCB
ATRMASK  DS    CL8       INOUT-OUTIN OPTION
ATRLABEL EQU   ATRMASK+6 SPECIFY OUTIN OR INOUT                  YM1841
ATRINOUT EQU   X'80'     INOUT
ATROUTIN EQU   X'40'     OUTIN
         DS    CL3       RESERVED
ATREXPDT DS    CL3       DATA SET EXPIRATION DATE
         DS    CL2       RESERVED
ATRBUFNO DS    CL1       NO. OF BUFFERS REQUIRED
ATRBFTEK DS    CL1       BFTEK BFALN
ATRBFALN EQU   ATRBFTEK
ATRSIMPL EQU   X'40'     SIMPLE BUFFERING              "S"
ATRAUTO  EQU   X'60'     AUTOMATIC RECORD AREA CONS'T  "A"
ATRECRD  EQU   X'20'     RECORD BUFFERING              "R"
ATREXC   EQU   X'10'     EXCHANGE BUFFERING            "E"
ATRDOUBL EQU   X'02'     DOUBLE WORD BOUNDARY          "D"
ATRFULL  EQU   X'01'     FULL WORD BOUNDARY            "F"
ATRBUFL  DS    CL2       BUFFER LENGTH
ATREROPT DS    CL1       ERROR OPTION
ATRACEPT EQU   X'80'     ACCEPT
ATRSKIP  EQU   X'40'     SKIP
ATRABNOR EQU   X'20'     ABNORMAL END OF TASK
ATRKEYLE DS    CL1       KEY LENGTH
         DS    CL6       RESERVED
ATRECFM  DS    CL1       RECORD FORMAT
ATRFIXED EQU   X'80'     FIXED                         "F"
ATRVARIB EQU   X'40'     VARIABLE                      "V"
ATRUNDEF EQU   X'C0'     UNDEFINED                     "U"
ATRTRKOV EQU   X'20'     TRACK OVERFLOW                "T"
ATRBLOCK EQU   X'10'     BLOCKED                       "B"
ATRSTAND EQU   X'08'     STANDARD BLOCKS               "S"
ATRASA   EQU   X'04'     ASA PRINTER CHARS.            "A"
ATRMACH  EQU   X'02'     MACH,CNTRL.CHAR               "M"
ATROPTCD DS    CL1       OPTION CODES
ATRWRTCK EQU   X'80'     WRITE VALIDITY CHECK          "W"
ATRSCHED EQU   X'20'     CHAINED SCHEDULING            "C"
ATRANSI  EQU   X'08'     ANSI TRANSLATE                "Q"
ATRUSERT EQU   X'02'     USER TOTALING                 "T"
ATRBLKSI DS    CL2       MAXIMUM BLOCK SIZE
ATRLRECL DS    CL2       LOGICAL RECORD LENGTH
ATRNCP   DS    CL1       MAX # OF READ/WRITE MACROS BEFORE CHECK
         DS    CL4       RESERVED
         AGO   .L99
.L1      AIF   ('&PL(&I)' NE 'CPPL').L2
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR2
***********************************************************************
*    THE COMMAND PROCESSOR PARAMETER LIST (CPPL) IS A LIST OF         *
*    ADDRESSES PASSED FROM THE TMP TO THE CP VIA REGISTER 1           *
***********************************************************************
         SPACE 1
.PR2     ANOP
CPPL     DS    0D
CPPLCBUF DS    A        PTR TO COMMAND BUFFER
CPPLUPT  DS    A        PTR TO UPT
CPPLPSCB DS    A        PTR TO PSCB
CPPLECT  DS    A        PTR TO ECT
         AGO   .L99
.L2      AIF   ('&PL(&I)' NE 'CSOA').L3
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR3
***********************************************************************
*    THE COMMAND SCAN OUTPUT AREA (CSOA) IS AN AREA POINTED TO        *
*    BY THE CSPL.  IT IS USED BY COMMAND SCAN TO INDICATE ITS         *
*    FINDINGS.  IT IS OBTAINED AND FREED BY THE INVOKER               *
***********************************************************************
         SPACE 1
.PR3     ANOP
CSOA     DS    0D
CSOACNM  DS    A        PTR TO COMMAND NAME-IF 0 INVALID CMD NAME
CSOALNM  DS    H        LENGTH OF CMD NAME
CSOAFLG  DS    X        FLAGS
CSOAVWP  EQU   X'80'    VALID WITH PARAMETERS
CSOAVNP  EQU   X'40'    VALID NO   PARAMS
CSOAQM   EQU   X'20'    QUESTION MARK
CSOANOC  EQU   X'10'    NO COMMAND
CSOABAD  EQU   X'08'    BAD CMD NAME
CSOAEXEC EQU   X'04'    IMPLICIT EXEC COMMAND NAME              Y30PQJN
         DS    CL1      RESERVED
         AGO   .L99
.L3      AIF   ('&PL(&I)' NE 'CSPL').L4
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR4
***********************************************************************
*    THE COMMAND SCAN PARAMETER LIST (CSPL) IS A LIST OF ADDRESSES    *
*    PASSED FROM THE INVOKER TO COMMAND SCAN VIA REGISTER 1           *
***********************************************************************
         SPACE 1
.PR4     ANOP
CSPL     DS    0D
CSPLUPT  DS    A        PTR TO  UPT
CSPLECT  DS    A        PTR TO  ECT
CSPLECB  DS    A        PTR TO  CP'S ECB
CSPLFLG  DS    A        PTR TO  FLAG WORD WHICH IS OBTAINED & FREED
*                       BY CALLER. BIT 0 SET TO 0= SYNTAX CHECKING OF
*                       COMMAND NAME.
CSPLOA   DS    A        PTR TO OUTPUT AREA (CSOA DSECT)
CSPLCBUF DS    A        PTR TO COMMAND BUFFER
         AGO   .L99
.L4      AIF   ('&PL(&I)' NE 'DAIRFAIL').L4A
         IKJEFFDF ,     DAIRFAIL PARM LISTS
         AGO   .L99
.L4A     AIF   ('&PL(&I)' NE 'DAIRACB').L5
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR5
***********************************************************************
* THE DAIRACB IS USED TO PROVIDE DCB PARAMETERS TO THE DYNAMIC        *
* ALLOCATION INTERFACE ROUTINE. THE ATTRIBUTES ARE PLACED INTO        *
* AN ATRCB AND RETAINED ON A CHAIN UNTIL REFERED TO ON AN ALLOCATE CMD
***********************************************************************
         SPACE 1
.PR5     ANOP
DAIRACB  DS    0D
         DS    CL8       RESERVED
DAIMASK  DS    CL8       INOUT-OUTIN OPTION
DAILABEL EQU   DAIMASK+6 SPECIFY OUTIN OR INOUT                  YM1841
DAIINOUT EQU   X'80'     INOUT
DAIOUTIN EQU   X'40'     OUTIN
         DS    CL3       RESERVED
DAIEXPDT DS    CL3       DATA SET EXPIRATION DATE
         DS    CL2       RESERVED
DAIBUFNO DS    CL1       NO. OF BUFFERS REQUIRED
DAIBFTEK DS    CL1       BFTEK/BFALN
DAIBFALN EQU   DAIBFTEK
DAISIMPL EQU   X'40'     SIMPLE BUFFERING              "S"
DAIAUTO  EQU   X'60'     AUTOMATIC RECORD AREA CONS'T  "A"
DAIRECRD EQU   X'20'     RECORD BUFFERING              "R"
DAIEXC   EQU   X'10'     EXCHANGE BUFFERING            "E"
DAIDOUBL EQU   X'02'     DOUBLE WORD BOUNDARY          "D"
DAIFULL  EQU   X'01'     FULL WORD BOUNDARY            "F"
DAIBUFL  DS    CL2       BUFFER LENGTH
DAIEROPT DS    CL1       ERROR OPTION
DAIACEPT EQU   X'80'     ACCEPT
DAISKIP  EQU   X'40'     SKIP
DAIABNOR EQU   X'20'     ABNORMAL END OF TASK
DAIKEYLE DS    CL1       KEY LENGTH
         DS    CL6       RESERVED
DAIRECFM DS    CL1       RECORD FORMAT
DAIFIXED EQU   X'80'     FIXED                         "F"
DAIVARIB EQU   X'40'     VARIABLE                      "V"
DAIUNDEF EQU   X'C0'     UNDEFINED                     "U"
DAITRKOV EQU   X'20'     TRACK OVERFLOW                "T"
DAIBLOCK EQU   X'10'     BLOCKED                       "B"
DAISTAND EQU   X'08'     STANDARD BLOCKS               "S"
DAIASA   EQU   X'04'     ASA PRINTER CHARS.            "A"
DAIMACH  EQU   X'02'     MACH.CNTRL.CHAR.              "M"
DAIOPTCD DS    CL1       OPTION CODES
DAIWRTCK EQU   X'80'     WRITE VALIDITY CHECK          "W"
DAISCHED EQU   X'20'     CHAINED SCHEDULING            "C"
DAIANSI  EQU   X'08'     ANSI TRANSLATE                "Q"
DAIUSERT EQU   X'02'     USER TOTALING                 "T"
DAIBLKSI DS    CL2       MAXIMUM BLOCK SIZE
DAILRECL DS    CL2       LOGICAL RECORD LENGTH
DAINCP   DS    CL1       MAX # OF READ/WRITE MACROS BEFORE CHECK
         DS    CL4       RESERVED
         AGO   .L99
.L5      AIF   ('&PL(&I)' NE 'DAPL').L6
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR6
***********************************************************************
*    THE DYNAMIC ALLOCATION INTERFACE ROUTINE (DAIR) PARAMETER LIST   *
*    (DAPL) IS A LIST OF ADDRESSES PASSED FROM THE INVOKER TO DAIR    *
*    VIA REGISTER 1
***********************************************************************
         SPACE 1
.PR6     ANOP
DAPL     DS    0D
DAPLUPT  DS    A        PTR TO UPT
DAPLECT  DS    A        PTR TO ECT
DAPLECB  DS    A        PTR TO CP'S ECB
DAPLPSCB DS    A        PTR TO PSCB
DAPLDAPB DS    A        PTR TO DAIR PARAMETER BLOCK
         AGO   .L99
.L6      AIF   ('&PL(&I)' NE      'DAPB0C').L7
         SPACE 1
DAPB0C   DS    0D
DA0CCD   DS    CL2      DAIR ENTRY CODE
DA0CFLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0
         DS    X
DA0CDARC DS    H        DYN ALLOC RETURN CODE
         DS    CL2      RESERVED
DA0CNUMB DS    H        NUMBER OF 8 BYTE FIELDS THAT FOLLOW THIS
*                       DSECT
         DS    CL2      RESERVED
         AGO   .L99
.L7      AIF   ('&PL(&I)' NE      'DAPB04').L8
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR7
***********************************************************************
* THIS OPERATION CODE CAUSES A SEARCH OF THE DSE TO BE MADE FOR THE   *
* SPECIFIED DSNAME. IF IT IS NOT FOUND IN THE DSE THE SYSTEM CATALOG  *
* IS ALSO SEARCHED                                                    *
***********************************************************************
         SPACE 1
.PR7     ANOP
DAPB04   DS    0D
DA04CD   DS    CL2      DAIR ENTRY CODE
DA04CAT  EQU   X'04'    DSNAME FOUND IN  CATLG
DA04FLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0
DA04DSE  EQU   X'02'    DSNAME FOUND IN  DSE
         DS    X
         DS    CL2      RESERVED
DA04CTRC DS    H                  CATALOG RETURN CODE AREA
DA04PDSN DS    A        POINTER TO DSNAME TO BE SEARCHED IN DSE
DA04CTL  DS    X        CONTROL FLGS FOR SPECIAL PROCESSING
DA04UID  EQU   X'20'    USER ID IS TO BE PREFIXED TO DSNAME
         DS    CL2      RESERVED
DA04DSO  DS    CL1      INDICATES DSORG
         AGO   .L99
.L8      AIF   ('&PL(&I)' NE      'DAPB00').L9
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR8
***********************************************************************
* THIS OPERATION  CODE CAUSES A SEARCH OF THE DSE TO BE MADE FOR THE  *
* SPECIFIED DSNAME AND SET THE DA00FLG FIELD ACCORDINGLY. IF DDNAME   *
* IS REQUESTED INFORMATION IS RETURNED IN DA00FLG INDICATING WHETHER  *
* OR NOT THE DDNAME IS ALLOCATED TO THE TERMINAL                      *
***********************************************************************
         SPACE 1
.PR8     ANOP
DAPB00   DS    0D
DA00CD   DS    CL2
DA00FLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0
DA00PERM EQU   X'08'    DSE PERMANENTLY ALLOCATED              M0766
DA00DYNM EQU   X'04'    DD IS A DYNAM                          M0766
DA00DSE  EQU   X'02'    DSNAME FOUND IN DSE
DA00TERM EQU   X'01'    DDNAME ALLOCATED TO A TERMINAL
         DS    X
DA00PDSN DS    A        POINTER TO DSNAME TO BE SEARCHED FOR IN DSE
DA00DDN  DS    CL8      DDNAME TO BE SEARCHED FOR IN DSE
DA00CTL  DS    X        CONTROL FLAGS FOR SPEC PROCESSING
DA00UID  EQU   X'20'    USER ID IS TO BE PREFIXED TO DSNAME
         DS    CL2      RESERVED
DA00DSO  DS    CL1      INDICATES DSORG
         AGO   .L99
.L9      AIF   ('&PL(&I)' NE      'DAPB08').L10
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR9
***********************************************************************
* THIS OPERATION CODE CAUSES ALLOCATION OF A DATA SET. IT CAN ALLOC.  *
* EITHER A NEW OR OLD SET.                                            *
***********************************************************************
         SPACE 1
.PR9     ANOP
DAPB08   DS    0D
DA08CD   DS    CL2      DAIR ENTRY CODE
DA08FLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0
DA08FPE  EQU   X'80'    FUNCT PERFORMED BUT ERROR INDICATED BY RETCD
         DS    X
DA08DARC DS    H        DYN ALLOC RETURN CODE
DA08CTRC DS    H        CATALOG RETURN CODE
DA08PDSN DS    A        POINTER TO DSNAME TO BE SEARCHED IN DSE
DA08DDN  DS    CL8      DDNAME TO BE SEARCHED IN DSE
DA08UNIT DS    CL8      UNITNAME REQUESTED
DA08SER  DS    CL8      VOLUME SERIAL NUMBER-PADDED W/BLANKS
DA08BLK  DS    CL4      DATA SET  AVERAGE RECORD LENGTH
DA08PQTY DS    CL4      PRIMARY SPACE QUANTITY
DA08SQTY DS    CL4      SECONDARY SPACE QUANTITY
DA08DQTY DS    CL4      DIRECTORY BLOCK QUANTITY
DA08MNM  DS    CL8      MEMBER NAME
DA08PSWD DS    CL8      PASSWORD
DA08DSP1 DS    X        DATA SET STATUS FLGS(IF=0 OLD ASSUMED)
DA08SHR  EQU   X'08'    DATA SET IS SHR
DA08NEW  EQU   X'04'    DATA SET IS NEW
DA08MOD  EQU   X'02'    DATA SET IS MOD
DA08OLD  EQU   X'01'    DATA SET IS OLD
DA08DPS2 DS    X        DATA SET DISPOSITION(IF=0 KEEP ASSUMED)
DA08KEEP EQU   X'08'    DS DISP IS KEEP
DA08DEL  EQU   X'04'    DS DISP IS DELETE
DA08CAT  EQU   X'02'    DS DISP IS CATLG
DA08UCAT EQU   X'01'    DS DISP IS UNCATALOG
DA08DPS3 DS    X        DATA SET CONDITIONAL DISPOSITION
DA08KEP  EQU   X'08'
DA08DELE EQU   X'04'
DA08CATL EQU   X'02'    DS DISP OF CATLG DESIRED
DA08UNCT EQU   X'01'    DS DISP OF UNCATLG DESIRED
DA08CTL  DS    X        FLAGS TO CONTROL ACTIONS TAKEN BY DAIR
DA08TRKS EQU   X'80'    UNITS ARE TRKS
DA08ABKL EQU   X'40'
DA08CYLS EQU   X'C0'    UNITS ARE CYLS
DA08UID  EQU   X'20'    USER ID IS TO BE PREFIXED
DA08RLSE EQU   X'10'    RELEASE (RLSE) REQUESTED
DA08PERM EQU   X'08'    DATA SET MUST BE SPECIFICALLY UNALLOCATED
DA08DMMY EQU   X'04'
DA08ATRL EQU   X'02'    ATTRIBUTE LIST SUPPLIED                  C99236
         DS    CL3      RESERVED
DA08DSO  DS    CL1      DSORG
DA08ALN  DS    CL8      ATTR-LIST-NAME                           C99236
         AGO   .L99
.L10     AIF   ('&PL(&I)' NE      'DAPB1C').L11
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR10
***********************************************************************
* THIS OPERATION CODE REQUESTS ALLOCATION TO THE TERMINAL.            *
***********************************************************************
         SPACE 1
.PR10    ANOP
DAPB1C   DS    0D
DA1CCD   DS    CL2      DAIR ENTRY CODE
DA1CFLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0
         DS    X
DA1CDARC DS    H        DYN ALLOC RETURN CODE
         DS    CL1      RESERVED
DA1CCTL  DS    CL1      CONTROL FIELD
DA1CPERM EQU   X'08'    PERMANENTLY ALLOCATE BIT
DA1CATRL EQU   X'02'    ATTRIBUTE LIST SUPPLIED                  C99236
DA1CDDN  DS    CL8      DDNAME TO BE SEARCHED IN DSE
DA1CALN  DS    CL8      ATTR-LIST-NAME                           C99236
         AGO   .L99
.L11     AIF   ('&PL(&I)' NE      'DAPB10').L12
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR11
***********************************************************************
* THIS OPERATION CODE CAUSES THE PREVIOUSLY CONCATENATED DDNAME  TO   *
* BE DECONCATENATED                                                   *
***********************************************************************
         SPACE 1
.PR11    ANOP
DAPB10   DS    0D
DA10CD   DS    CL2      DAIR ENTRY CODE
DA10FLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0
         DS    X
DA10DARC DS    H        DYN ALLOC RETURN CODE
         DS    CL2      RESERVED
DA10DDN  DS    CL8      DDNAME TO BE SEARCHED IN DSE
         AGO   .L99
.L12     AIF   ('&PL(&I)' NE      'DAPB14').L13
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR12
***********************************************************************
* THIS OPERATION CODE RETURNS QUALIFIERS IN THE RETURN AREA FOR THE   *
* GIVEN INDEX NAME                                                    *
***********************************************************************
         SPACE 1
.PR12    ANOP
DAPB14   DS    0D
DA14CD   DS    CL2      DAIR ENTRY CODE
DA14FLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0
         DS    X
DA14PDSN DS    A        POINTER TO DSNAME TO BE SEARCHED IN DSE
DA14PRET DS    A        POINTER TO RETURN AREA
DA14CTL  DS    X        CONTROL FLAGS FOR SPECIAL PROCESSING
DA14UID  EQU   X'20'    USER ID IS TO BE PREFIXED TO DSNAME
         DS    CL3      RESERVED
         AGO   .L99
.L13     AIF   ('&PL(&I)' NE      'DAPB18').L14
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR13
***********************************************************************
* THIS OPERATION CAUSES THE REQUESTED DATA SET OR DDNAME TO BE        *
* UNALLOCATED. DISPOSITION CAN BE SPECIFIED TO OVERRIDE ANY PREVIOUS  *
* DISPOSITION. LIKEWISE SYSOUT CLASS MAY BE SPECIFIED TO OVERRIDE ANY *
* PREVIOUS CLASS.                                                     *
***********************************************************************
         SPACE 1
.PR13    ANOP
DAPB18   DS    0D
DA18CD   DS    CL2      DAIR ENTRY CODE
DA18FLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0
DA18FPE  EQU   X'80'    FUNCT PERFORMED BUT ERROR INDICATED BY RETCD
         DS    X
DA18DARC DS    H        DYNAMIC ALLOCATION RETURN CODE
DA18CTRC DS    H        CATALOG RETURN CODE AREA
DA18PDSN DS    A        POINTER TO DSNAME TO BE SEARCHED IN DSE
DA18DDN  DS    CL8      DDNAME TO BE SEARCHED IN DSE
DA18MNM  DS    CL8      MEMBER NAME
DA18SCLS DS    CL2      SYSOUT CLASS DESIRED WHEN UNALLOCATING  A
*                       SYSOUT DATA SET
DA18DPS2 DS    X        DATA SET DISPOSITION
DA18KEEP EQU   X'08'    CHANGE DISP TO KEEP
DA18DEL  EQU   X'04'    CHANGE DISP TO DELETE
DA18CAT  EQU   X'02'    CHANGE DISP TO CATALOG
DA18UCAT EQU   X'01'    CHANGE DISP TO UNCATLOG
DA18CTL  DS    X        FLAGS FOR SPECIAL DAIR PROCESSING
DA18UID  EQU   X'20'    USER ID IS TO BE PREFIXED TO DSNAME
DA18PERM EQU   X'10'    UNALLOCATE PERM. ALLOCATED DSE'S      M0765
DA18JBNM DS    CL8      IGNORED AS OF OS VS/2 RELEASE 2       Y02670
         AGO   .L99
.L14     AIF   ('&PL(&I)' NE      'DAPB2C').L15
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR14
***********************************************************************
* THIS OPERATION CODE ALLOWS FOR RE-USE  OF TIOT ENTRIES              *
* IT IS USED BY THE TMP BEFORE DETACHING A TASK, AND BY ANY  TASK     *
* WHICH ATTACHES SUB-TASKS                                            *
***********************************************************************
         SPACE 1
.PR14    ANOP
DAPB2C   DS    0D
DA2CCD   DS    CL2      DAIR ENTRY CODE
DA2CFLG  DS    H        FLAG FIELD
DA2CTCB  DS    A        TCB ADDR OF DSE ENTRIES MARKED NOT IN USE
DA2CDDN  DS    CL8        DDNAME
         AGO   .L99
.L15     AIF   ('&PL(&I)' NE      'DAPB24').L16
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR15
***********************************************************************
* THIS OPERATION CODE ALLOWS ALLOCATION OF A SPECIFIC DDNAME TO AN    *
* ALREADY ALLOCATED DATA SET OR TO THE SPECIFIED DATA SET  IF THE     *
* REQUESTED DDNAME IS NOT FOUND OR IS DYNAM                           *
***********************************************************************
         SPACE 1
.PR15    ANOP
DAPB24   DS    0D
DA24CD   DS    CL2      DAIR ENTRY CODE
DA24FLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0
DA24FPE  EQU   X'80'    FUNCT PERFORMED BUT ERROR INDICATED BY RETCD
DA24DMY  EQU   X'08'    DDNAME REQUESTED IS A DUMMY
         DS    X
DA24DARC DS    H                  CATALDYNAMIC ALLOCATION RTRN CODE
DA24CTRC DS    H                  CATALOG RETURN CODE AREA
DA24PDSN DS    A        POINTER TO DSNAME TO BE SEARCHED IN DSE
DA24DDN  DS    CL8      DDNAME TO BE SEARCHED IN DSE
DA24UNIT DS    CL8      UNITNAME REQUESTED
DA24SER  DS    CL8      VOLUME SERIAL NUMBER-PADDED W/BLANKS
DA24BLK  DS    CL4      AVERAGE RECORD LENGTH
DA24PQTY DS    CL4      PRIMARY SPACE QUANTITY
DA24SQTY DS    CL4      SECONDARY SPACE QUANTITY
DA24DQTY DS    CL4      DIRECTORY BLOCK QUANTITY
DA24MNM  DS    CL8      MEMBER NAME
DA24PSWD DS    CL8      PASSWORD
DA24DSP1 DS    X        DATA SET STATUS FLGS(IF=0 OLD ASSUMED)
DA24SHR  EQU   X'08'    DATA SET IS SHR
DA24NEW  EQU   X'04'    DATA SET IS NEW
DA24MOD  EQU   X'02'    DATA SET IS MOD
DA24OLD  EQU   X'01'    DATA SET IS OLD
DA24DPS2 DS    X        DATA SET DISPOSITION(IF=0 KEEP ASSUMED)
DA24KEEP EQU   X'08'    DS DISP IS KEEP
DA24DEL  EQU   X'04'    DS DISP IS DELETE
DA24CAT  EQU   X'02'    DS DISP IS CATLG
DA24UCAT EQU   X'01'    DS DISP IS UNCATALOG
DA24DPS3 DS    X        DATA SET CONDITIONAL DISPOSITION
DA24KEP  EQU   X'08'
DA24DELE EQU   X'04'
DA24CATL EQU   X'02'    DS DISP OF CATLG DESIRED
DA24UNCT EQU   X'01'    DS DISP OF UNCATLG DESIRED
DA24CTL  DS    X        FLAGS TO CONTROL ACTIONS TAKEN BY DAIR
DA24TRKS EQU   X'80'
DA24ABKL EQU   X'40'
DA24UID  EQU   X'20'    USER ID IS TO BE PREFIXED
DA24RLSE EQU   X'10'    RELEASE (RLSE) REQUESTED
DA24PERM EQU   X'08'    DATA SET MUST BE SPECIFICALLY UNALLOCATED
DA24DMMY EQU   X'04'    DUMMY                                    C99236
DA24ATRL EQU   X'02'    ATTRIBUTE LIST SUPPLIED                  C99236
         DS    CL3      RESERVED
DA24DSO  DS    CL1      DSORG
DA24ALN  DS    CL8      ATTR-LIST-NAME                           C99236
         AGO   .L99
.L16     AIF   ('&PL(&I)' NE      'DAPB28').L17
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR16
***********************************************************************
* THIS OPERATION CODE ALLOWS A LIST OF OPERATIONS TO BE PERFORMED     *
* IF ANY OPERATION FAILS, PROCESSING STOPS AND THE ADDRESS OF THE     *
* FAILED OPERATION IS RETURNED IN PFOP                                *
***********************************************************************
         SPACE 1
.PR16    ANOP
DAPB28   DS    0D
DA28CD   DS    CL2      DAIR ENTRY CODE
DA28NOP  DS    H        NUMB OF OPERATION PTR FIELDS WHICH FOLLOW
DA28PFOP DS    A        POINTER TO FAILED OPERATION
*                       OPERATION POINTERS ARE PLACED HERE
         AGO   .L99
.L17     AIF   ('&PL(&I)' NE      'DAPB30').L18
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR17
***********************************************************************
* THIS OPERATION CODE ALLOWS FOR ALLOCATION OF A SYSOUT DATA SET.     *
***********************************************************************
         SPACE 1
.PR17    ANOP
DAPB30   DS    0D
DA30CD   DS    CL2      DAIR ENTRY CODE
DA30FLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0
DA30FPE  EQU   X'80'    FUNCT PERFORMED BUT ERROR INDICATED BY RETCD
         DS    X
DA30DARC DS    H
         DS    CL2      RESERVED
DA30PDSN DS    A        POINTER TO DSNAME TO BE SEARCHED IN DSE
DA30DDN  DS    CL8      DDNAME TO BE SEARCHED IN DSE
DA30UNIT DS    CL8      UNITNAME REQUESTED
DA30SER  DS    CL8      VOLUME SERIAL NUMBER-PADDED W/BLANKS
DA30BLK  DS    CL4      AVERAGE RECORD LENGTH
DA30PQTY DS    CL4      PRIMARY SPACE QUANTITY
DA30SQTY DS    CL4      SECONDARY SPACE QUANTITY
DA30PGNM DS    CL8      PROGRAM NAME -IF OMITTED MUST BE SET TO BLANKS
DA30FORM DS    CL4      FORM NUMBER  -IF OMITTED MUST BE SET TO BLANKS
DA30OCLS DS    CL2      OUTPUT CLASS - IGNORED AS OF OS VS/2 RELEASE 2
*                                                               Y02670
         DS    CL1      RESERVED
DA30CTL  DS    X        FLAGS TO CONTROL ACTIONS TAKEN BY DAIR
DA30TRKS EQU   X'80'
DA30ABKL EQU   X'40'
DA30UID  EQU   X'20'    USER ID IS TO BE PREFIXED
DA30RLSE EQU   X'10'    RELEASE (RLSE) REQUESTED
DA30PERM EQU   X'08'    DATA SET MUST BE SPECIFICALLY UNALLOCATED
DA30DMMY EQU   X'04'
DA30ATRL EQU   X'02'    ATTRIBUTE LIST SUPPLIED                  C99236
DA30ALN  DS    CL8      ATTR-LIST-NAME                           C99236
         AGO   .L99
.L18     AIF   ('&PL(&I)' NE      'DAPB34').L19
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR18
***********************************************************************
* THIS DAIR PARAMETER BLOCK IS USED TO CAUSE :                        *
*        1) A SEARCH  OF THE ATRCB CHAIN FOR A GIVEN NAME             *
*        2) AN ATRCB TO BE PLACED ON THE ATRCB CHAIN                  *
*        3) AN ATRCB TO BE REMOVED FROM THE ATRCB CHAIN               *
***********************************************************************
         SPACE 1
.PR18    ANOP
DAPB34   DS    0D
DA34CD   DS    CL2       DAIR ENTRY CODE
DA34FLG  DS    CL2       FLAG FIELD
DA34FIND EQU   X'80'     ZERO IF ATTR-LIST-NAME NOT FOUND ONE IF FOUND
DA34DARC DS    CL2       DYNAMIC ALLOCATION RETURN CODE
DA34CTRL DS    CL1       CONTROL BYTES
DA34SRCH EQU   X'80'     SEARCH ATTR.CHAIN FOR NAME
DA34CHN  EQU   X'40'     CHAIN NEW ATTR.LIST
DA34UNCH EQU   X'20'     REMOVE ATTR.LIST FROM CHAIN
         DS    CL1       RESERVED
DA34NAME DS    CL8       ATTRIBUTE-LIST-NAME
DA34ADDR DS    CL4       ADDR OF DAIRACB
         AGO   .L99
.L19     AIF   ('&PL(&I)' NE      'DFPB').L20
         SPACE 1
DFPB     DS    0D
DFPBCODE DS    0AL1      DEFAULT ENTRY CODE
DFPBDSN  DS    A         PTR TO DSLENGTH AND DSNAME
DFPB0C   EQU   X'0C'     ENTRY CODE '0C'
DFPB08   EQU   X'08'     ENTRY CODE '08'
DFPB04   EQU   X'04'     ENTRY CODE '04'
DFPB00   EQU   X'00'     ENTRY CODE '00'
DFPB8C   EQU   X'8C'     ENTRY CODE '8C'                       @YL026YB
DFPB88   EQU   X'88'     ENTRY CODE '88'                       @YL026YB
DFPB84   EQU   X'84'     ENTRY CODE '84'                       @YL026YB
DFPB80   EQU   X'80'     ENTRY CODE '80'                       @YL026YB
DFPBCNTL DS    0AL1      DEFAULT CONTROL
DFPBPSCB DS    A         PTR TO PSCB
DFPBUID  EQU   X'20'     USERID IS TO BE PREFIXED TO DSNAME
DFPBRET  EQU   X'04'     RETURN ADDED QUALIFIER
DFPBADD  EQU   X'02'     ADD SPECIFIED QUALIFIER
DFPBMSG  EQU   X'01'     ISSUE MESSAGE
DFPBLORC DS    0AL1      LOCATE RETURN CODE
DFPBQUAL DS    A         PTR TO DEFAULT QUALIFIER
DFPBCAT  DS    A         PTR TO USER CATALOG                   @YL026YB
DFPBPSWD DS    A         PTR TO PASSWORD                       @YL026YB
         AGO   .L99
.L20     AIF   ('&PL(&I)' NE      'DFPL').L21
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR19
***********************************************************************
*    THE DEFAULT SERVICE ROUTINE PARAMETER LIST (DFPL) IS A LIST OF   *
*    ADDRESSES PASSED FROM THE INVOKER TO DEFAULT VIA REGISTER 1      *
***********************************************************************
         SPACE 1
.PR19    ANOP
DFPL     DS    0D
DFPLUPT  DS    A    PTR TO UPT
DFPLECT  DS    A    PTR TO ECT
DFPLECB  DS    A    PTR TO CP'S ECB
DFPLDFPB DS    A    PTR TO DEFAULT PARAMETER BLOCK
         AGO   .L99
.L21     AIF   ('&PL(&I)' NE      'DSE').L22
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR20
***********************************************************************
*
*
*DSE IS USED TO MAINTAIN DATA SET INFORMATION, SUCH AS THE DDNAME--
*DSNAME RELATIONSHIP. IT IS A SERIES OF CHAINED ELEMENTS EACH ONE
*VARIABLE IN SIZE DEPENDENT ON THE INFORMATION PRESENT.
*
*
***********************************************************************
         SPACE 1
.PR20    ANOP
DSE      DS    0D
DSEFORWD DS    A        ADDRESS OF NEXT DSE BLK(ZERO IN LAST DSE)
DSEBCKWD DS    A        ADDRESS OF PREV. DSE BLK (ZERO IN FIRST DSE)
DSEBLKSZ DS    1H       TOTAL NO. OF BYTES IN THIS DSE BLK INCLUDES
*                       THIS FIELD AND TWO PRIOR FIELDS
DSESTAT  DS    X        THE ALLOCATED STATUS OF THE DATA SET
*        EQU   X'80'    RESERVED
*        EQU   X'40'    RESERVED
*        EQU   X'20'    RESERVED
*        EQU   X'10'    RESERVED
DSESHR   EQU   X'08'    SHR
DSENEW   EQU   X'04'    NEW
DSEMOD   EQU   X'02'    MOD
DSEOLD   EQU   X'01'    OLD
DSECNTRL DS    X        STATUS OF DATA SETS WHEN BITS ARE ON AS FOLLOWS
DSEDYN   EQU   X'80'    DATA SET ALLOCATED DYNAMICALLY
DSENUSED EQU   X'40'    DATA SET NOT IN USE
DSEMEM   EQU   X'20'    MEMBER FIELD IS PRESENT IN THIS DSE
DSEDTIOT EQU   X'10'    TIOT ENTRY IS DYNAM
DSECON   EQU   X'08'    DATA SET CONCATENATED DYNAMICALLY
*        EQU   X'04'    RESERVED
DSEPERM  EQU   X'02'    DATA SET IS PERMAMENTLY ALLOCATED
*        EQU   X'01'    RESERVED
DSEDDNAM DS    CL8      DDNAME AS IT APPEARS IN TIOT
DSETCBAD DS    A        ADD. OF TCB FOR CP WHICH SECURED DYNAMIC ALLOC.
DSETTRPW DS    1F       RELATIVE TTR OF PASSWD FOR THIS FIELD IS ZERO.
DSENDISP DS    X        NORMAL DISPOSITION IND. BY BIT SETTINGS:
*        EQU   X'80'    RESERVED
*        EQU   X'40'    RESERVED
*        EQU   X'20'    RESERVED
*        EQU   X'10'    RESERVED
DSEKEP   EQU   X'08'    KEEP
DSEDEL   EQU   X'04'    DELETE
DSECAT   EQU   X'02'    CATLG
DSEUCAT  EQU   X'01'    UNCATLG
DSEADISP DS    CL1      ABNORMAL DISPOSITION IS IND. BY SETTING BITS
*                       IN THIS FIELD THE SAME AS IN DSENDISP
DSEAKEP  EQU   X'08'    KEEP
DSEADEL  EQU   X'04'    DELETE
DSEACAT  EQU   X'02'    CATALOG
DSEAUCAT EQU   X'01'    UNCATALOG
DSEDSORG DS    X        ORGANIZATION IND. BY FOLLOWING BITS:
DSEIS    EQU   X'80'    INDEXED SEQUENTIAL
DSEPS    EQU   X'40'    PHYSICAL SEQUENTIAL
DSEDA    EQU   X'20'    DIRECT ORGANIZATION
*        EQU   X'10'    RESERVED
*        EQU   X'08'    RESERVED
*        EQU   X'04'    RESERVED
DSEPO    EQU   X'02'    PARTITIONED ORGANIZATION
DSEU     EQU   X'01'    UNMOVABLE
DSEDSLNG DS    CL1      LENGTH OF DATA SET NAME IN BYTES (1-44)
DSEDSNAM DS    CL44     DATA SET NAME DSE DESCRIBES
         AGO   .L99
.L22     AIF   ('&PL(&I)' NE      'ECT').L23
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR21
***********************************************************************
*    THE ENVIRONMENT CONTROL TABLE (ECT) IS BUILT BY THE TMP AND      *
*    STORED IN A NON-SHARED SUBPOOL. ITS FIELDS CAN BE MODIFIED       *
*    BY A CP OR SERVICE RTN BUT NOT FREED.                            *
***********************************************************************
         SPACE 1
.PR21    ANOP
ECT      DS    0D
ECTRCDF  DS    X        HIGH ORDER BIT INDICATES CP ABENDED
ECTRTCD  DS    CL3      RETURN CODE FROM LAST CP
*                         (ABEND CODE IF ECTRCDF IS SET)
ECTIOWA  DS    A        ADDR OF I/O SERVICE ROUTINES WORK AREA
ECTMSGF  DS    X        HIGH ORDER BIT SET MEANS DELETE SECOND LEVEL
*                         MESSAGE
ECTSMSG  DS    AL3      ADDR OF SECOND LEVEL MSG CHAIN
ECTPCMD  DS    CL8      PRIMARY COMMAND NAME
ECTSCMD  DS    CL8      SUBCOMMAND NAME
ECTSWS   DS    X        1 BYTE OF SWITCHES
ECTNOPD  EQU   X'80'    0 BIT ON= NO OPERANDS EXIST IN CMD BUFFER
*        EQU   X'40'    RESERVED
ECTATRM  EQU   X'20'    CP TERMINATED BY TMP DETACH W/ STAE
ECTLOGF  EQU   X'10'    LOGON/OFF REQUESTED TMP TO LOGOFF USER
ECTNMAL  EQU   X'08'    NO USER MSGS TO RECVED AT LOGON
ECTNNOT  EQU   X'04'    NO BRDCST NOTICES TO BE RECVED AT LOGON
ECTBKGRD EQU   X'02'    BACKGROUND MODE
ECTATTN  EQU   X'01'    ATTENTION MODE FOR CLIST                Z30NQKM
ECTDDNUM DS    AL3      COUNTER FOR GENERATING TEMP DDNAMES
ECTUSER  DS    A        WORD RESERVED FOR INSTALLATION  USE
ECTBKPB  DS    A        ADDR OF BACKGROUND PARAMETER BLOCK
ECTSWS2  DS    X        EXTENDED FLAG FIELD
ECTDEFCS EQU   X'80'    DEFAULT DELETE CHARACTERS USED
ECTTABND EQU   X'40'    TEST SUBTASK ABENDED
*        EQU   X'20'    RESERVED
*        EQU   X'10'    RESERVED
*        EQU   X'08'    RESERVED
*        EQU   X'04'    RESERVED
*        EQU   X'02'    RESERVED
*        EQU   X'01'    RESERVED
         DS    CL(3)    RESERVED
         DS    A        RESERVED
         DS    A        RESERVED
         DS    A        RESERVED
         AGO   .L99
.L23     AIF   ('&PL(&I)' NE 'GENERFAIL').L23A
         IKJEFFGF ,               GENERAL FAIL AREA
         AGO   .L99
.L23A    AIF   ('&PL(&I)' NE      'GTPB').L24
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR22
***********************************************************************
*    THE GETLINE PARAMETER BLOCK (GTPB) IS POINTED TO BY THE          *
*    PARAMETER LIST PASSED FROM THE INVOKER TO GETLINE.  GETLINE      *
*    USES IT FOR CONTROL AS WELL AS RETURNING INFORMATION             *
***********************************************************************
.PR22    ANOP
         SPACE 1
GTPB     DS    0D
         DS    CL4      INTERNAL GETLINE USAGE
GTPBIBUF DS    A        ADDR OF OBTAINED INPUT LINE
         AGO   .L99
.L24     AIF   ('&PL(&I)' NE      'IOPL').L25
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR23
***********************************************************************
*    THE I/O SERVICE ROUTINE PARAMETER LIST (IOPL) IS A LIST OF       *
*    FULLWORD ADDRESSES PASSED BY THE INVOKER OF ANY I/O SERVICE      *
*    ROUTINE TO THE APPROPRIATE SERVICE ROUTINE VIA REGISTER ONE.     *
***********************************************************************
.PR23    ANOP
         SPACE 1
IOPL     DS    0D
IOPLUPT  DS    A        PTR TO UPT
IOPLECT  DS    A        PTR TO ECT
IOPLECB  DS    A        PTR TO USER'S ECB
IOPLIOPB DS    A        PTR TO THE I/O SERVICE RTN PARM BLOCK
         AGO   .L99
.L25     AIF   ('&PL(&I)' NE      'LSD').L26
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR24
***********************************************************************
*    THE (STORAGE) LIST SOURCE DESCRIPTOR (LSD) IS POINTED TO BY THE  *
*    STPB.  IT IS SET UP BY THE INVOKER OF STACK TO DESCRIBE THE      *
*    IN STORAGE LIST. IT WILL BE FREED BY STACK WHEN THE LIST HAS     *
*   BEEN PROCESSED OR WHEN A 'DELETE' FUNCTION HAS BEEN REQUESTED     *
***********************************************************************
         SPACE 1
.PR24    ANOP
LSD      DS    0D
LSDADATA DS    A        PTR TO IN STORAGE LIST
LSDRCLEN DS    H        REC LENGTH -0 IF VARIABLE LEN RECFM
LSDTOTLN DS    H        TOTAL LEN OF IN STOR LIST(AMT OF CORE TO FREE)
LSDANEXT DS    A        PTR TO NEXT REC O BE PROCESSED-INITIALIZED TO
*                       FIRST REC BY INVOKER-UPDATED BY GETLINE/PUTGET
LSDEXEC  DS    CL4      ADDRESS OF THE EXEC COMMAND DATA BLOCK
         AGO   .L99
.L26     AIF   ('&PL(&I)' NE      'PGPB').L27
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR25
***********************************************************************
*    THE PUTGET PARAMETER BLOCK (PGPB) IS POINTED TO BY THE LIST      *
*    PASSED TO PUTGET.  PUTGET USES IT FOR CONTROL AS WELL AS         *
*    RETURNING INFORMATION.                                           *
***********************************************************************
         SPACE 1
.PR25    ANOP
PGPB     DS    0D
         DS    CL12     INTERNAL TO GETLINE/PUTLINE
PGPBIBUF DS    A        PTR TO OBTAINED INPUT LINE
         AGO   .L99
.L27     AIF   ('&PL(&I)' NE      'PPL').L28
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR26
***********************************************************************
*    THE PARSE PARAMETER LIST (PPL) IS A LIST OF ADDRESSES PASSED     *
*    FROM THE INVOKER TO PARSE VIA REGISTER 1                         *
***********************************************************************
         SPACE 1
.PR26    ANOP
PPL      DS    0D
PPLUPT   DS    A        PTR TO UPT
PPLECT   DS    A        PTR TO ECT
PPLECB   DS    A        PTR TO CP'S ECB
PPLPCL   DS    A        PTR TO PCL
PPLANS   DS    A        PTR TO ANS PLACE
PPLCBUF  DS    A        PTR TO CMD BUFFER
PPLUWA   DS    A        PTR TO USER WORK AREA (FOR VALIDITY CK RTNS)
         AGO   .L99
.L28     AIF   ('&PL(&I)' NE      'PSCB').L29
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR27
***********************************************************************
*    THE PROTECTED STEP CONTROL BLOCK IS CONSTRUCTED BY LOGON AND
*    FILLED IN FROM THE UADS .  A FIXED LENGTH TABLE WITH ATTRIBUTE
*    AND ACCOUNTING FIELDS, THE PSCB IS USED TO MAINTAIN USER ATTRI-
*    BUTES AND ACCOUNTING DATA ON A USERID BASIS.  THE ADDRESS OF PSCB
*    IS PASSED TO THE TMP.  HENCE IT IS AN EXTERNAL INTERFACE
***********************************************************************
         SPACE 1
.PR27    ANOP
PSCB     DS    0F
PSCBUSER DS    CL7      USERID PADDED RIGHT WITH BLANKS
PSCBUSRL DS    CL1      LENGTH OF USERID
PSCBGPNM DS    CL8      ESOTERIC GROUP NAME INIT BY LOGON FROM UADS
*                       USED BY DYN ALLOC WHEN UNITNAME NOT SPECIFIED
*                       BUT IS REQUIRED
PSCBATR1 DS    X        A 15 BIT STRING OF USER ATTRIBUTES
PSCBCTRL EQU   X'80'    OPERATOR COMMAND USER
PSCBACCT EQU   X'40'    ACCOUNT  COMMAND USER
PSCBJCL  EQU   X'20'    SUBMIT   COMMAND USER
PSCBVMNT EQU   X'10'    CNTL VOL MOUNT AUTH                      Y02669
PSCBATTN EQU   X'08'    LINE DELETE CHAR IS ATTENTION            Y02669
PSCBRCVR EQU   X'04'    EDIT RECOVER/NORECOVER              @Z40DQKV
* BITS 6 - 15           RESERVED FOR IBM USE
         DS    X        RESERVED
PSCBATR2 DS    X        A 15 BIT STRING RESERVED FOR INSTALLATION USE
         DS    X
PSCBLTIM DS    F        DOUBLEWORD FOR LOGON TIME               Y02669
PSCBLTI2 DS    F        IN STORE CLOCK UNITS                    Y02669
PSCBSUBH DS    CL1      SUBMIT HOLD CLASS                      @DZ04005
PSCBSUBC DS    CL1      SUBMIT CLASS                           @DZ04005
PSCBSUBM DS    CL1      SUBMIT MSGCLASS                        @DZ04005
PSCBSOUT DS    CL1      SYSOUT CLASS                           @DZ04005
         DS    2F       RESERVED
PSCBDEST DS    CL8      DEST FOR SYSOUT DATA SETS               Y02669
PSCBRLGB DS    A        PTR TO RELOGON BUFFER
PSCBUPT  DS    A        PTR TO USER PROFILE TABLE
PSCBUPTL DS    H        LENGTH OF UPT
PSCBCHAR DS    CL1      USER'S CHARACTER DELETE CHARACTER       Y02669
PSCBLINE DS    CL1      USER'S LINE DELETE CHARACTER            Y02669
PSCBRSZ  DS    A        REGION SIZE REQUESTED IN 2K UNITS
PSCBU    DS    CL8      RESERVED FOR INSTALLATION USE
         AGO   .L99
.L29     AIF   ('&PL(&I)' NE      'PTPB').L30
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR28
***********************************************************************
*    THE PUTLINE PARAMETER BLOCK (PTPB) IS POINTED TO BY THE PARAM.   *
*    LIST PASSED TO PUTLINE.  IT IS USED TO RETURN PERTINENT INFO.    *
*    AS WELL AS CONTROL PUTLINE FUNCTIONS                             *
***********************************************************************
         SPACE 1
.PR28    ANOP
PTPB     DS    0F
         DS    CL4      INTERNAL PUTLINE USAGE
PTPBOPUT DS    A        ADDRESS OF OUTPUT LINE DESCRIPTOR OR DATA LINE
PTPBFLN  DS    A        PTR TO FORMATTED LINE RETURNED WHEN OUTPUT=
*                       ADDR,FORMAT) IS SPECIFIED
         AGO   .L99
.L30     AIF   ('&PL(&I)' NE      'RLGB').L30A
         IKJRLGB ,DSECT=NO
         AGO   .L99
.L30A    AIF   ('&PL(&I)' NE      'RPL').L30B
RPL      DS    0D
RPLIDWD  EQU   *                               RPL IDENTIFICATION WORD
RPLID    DS    XL1                             RPL IDENTIFIER
RPLIDD   EQU   X'00'                           IDENTIFIER VALUE - X'00'
RPLSTYP  DS    XL1                             RPL SUBTYPE - SET TO
*                                              X'00' FOR DATA
*                                              MANAGEMENT AND X'0D'
*                                              FOR JECS
RPLSVSAM EQU   X'10'                           VSAM SUBTYPE     X04SVHS
RPLSVRP  EQU   X'11'                           VRP SUBTYPE      X04SVHS
RPLSVTAM EQU   X'20'                           VTAM SUBTYPE     X04SVHS
RPLS3540 EQU   X'40'                           3540 SUBTYPE     X04SVHS
RPLCRID  EQU   X'FF'                           CRPL ID (VTAM)    X03004
RPLREQ   DS    XL1                             RPL REQUEST TYPE
RPLGET   EQU   X'00'                           GET
RPLPUT   EQU   X'01'                           PUT
RPLPOINT EQU   X'03'                           POINT
RPLERASE EQU   X'05'                           ERASE
RPLJSFMT EQU   X'07'                           JES FORMAT REQUEST
*        THE FOLLOWING CODES ARE NOT STORED IN RPLREQ, BUT ARE
*        AVAILABLE IN REGISTER 0 WHEN THE FUNCTION IS ENTERED
*        AND STORED IN RPLREQ DURING PROCESSING OF THE FUNCTION.
RPLCHECK EQU   X'02'                           CHECK
RPLENDRE EQU   X'04'                           ENDREQ
RPLVERIF EQU   X'06'                           VERIFY
RPLIMPRT EQU   X'07'                           IMPORT
RPLPFMTD EQU   X'08'                           DATA PREFORMAT
RPLPFMTI EQU   X'09'                           INDEX PREFORMAT
RPLFRCIO EQU   X'0A'                           FORCE I/O
RPLWRITE EQU   X'11'                           WRITE(VTAM)       X03004
RPLRESET EQU   X'12'                           RESET(VTAM)       X03004
RPLTERM  EQU   X'13'                           TERMRPL         @ZA32757
RPLDO    EQU   X'13'                           DO(VTAM)          X03004
RPLQUISE EQU   X'15'                           SETLOGON(VTAM)    X03004
RPLSMLGO EQU   X'16'                           SIMLOGON(VTAM)    X03004
RPLOPNDS EQU   X'17'                           OPNDST(VTAM)      X03004
RPLCHNG  EQU   X'19'                           CHANGE(VTAM)      X03004
RPLINQIR EQU   X'1A'                           INQUIRE(VTAM)     X03004
RPLINTPT EQU   X'1B'                           INTRPRET(VTAM)    X03004
RPLREAD  EQU   X'1D'                           READ(VTAM)        X03004
RPLSLICT EQU   X'1E'                           SOLICIT(VTAM)     X03004
RPLCLOSE EQU   X'1F'                           CLSDST(VTAM)      X03004
RPLCLACB EQU   X'21'                           CLOSEACB(VTAM)    X03004
RPLSNDCD EQU   X'22'                           SEND(VTAM)       X3004BS
RPLRCVCD EQU   X'23'                           RECEIVE(VTAM)    X3004BS
RPLRSRCD EQU   X'24'                           RESETSR(VTAM)    X3004BS
RPLSSCCD EQU   X'25'                           SESSIONC(VTAM)   X3004BS
RPLSDCMD EQU   X'27'                           SENDCMD(VTAM)   @Z40BHUC
RPLRVCMD EQU   X'28'                           RCVCMD(VTAM)    @Z40BHUC
RPLTREQS EQU   X'29'                           REQSESS(VTAM)   @G40AKCM
RPLTOPNS EQU   X'2A'                           OPNSEC(VTAM)    @G40AKCM
RPLTCLSS EQU   X'2B'                           CLSSEC(VTAM)    @G40AKCM
RPLTRMS  EQU   X'2C'                           TRMSESS(VTAM)   @G40AKCM
RPLLEN   DS    0XL1                            LENGTH OF THIS RPL
RPLLEN2  DS    XL1                             ALTERNATE NAME FOR
*                                              RPLLEN            X03004
RPLPLHPT DS    A                               POINTER TO PLACEHOLDER
RPLECB   DS    A                               INTERNAL ECB OR
*                                              POINTER TO EXTERNAL ECB
*        ECB FLAGS
RPLWAIT  EQU   X'80'                           A REQUEST HAS BEEN
*                                              ISSUED
RPLPOST  EQU   X'40'                           THE REQUEST HAS
*                                              COMPLETED
RPLFDBWD DS    0XL4                            FEEDBACK WORD    X04SVHS
RPLSTAT  DS    XL1                             CURRENT RPL STATUS
RPLFDBK  DS    0XL3                            ERROR FEEDBACK
RPLRTNCD DS    0XL1                            RPL RETURN CODE
RPLNOERR EQU   X'00'                           NORMAL RETURN
RPLBLKER EQU   X'04'                           INVALID CONTROL BLOCK
RPLCBLKE EQU   X'04'                           ALTERNATE NAME FOR
*                                              RPLBLKER          X03004
RPLLOGER EQU   X'08'                           ILLOGICAL REQUEST
RPLLOGIC EQU   X'08'                           ALTERNATE NAME FOR
*                                              RPLLOGER          X03004
RPLPHYER EQU   X'0C'                           PHYSICAL I/O ERROR
RPLPHYSC EQU   X'0C'                           ALTERNATE NAME FOR
*                                              RPLPHYER          X03004
RPLNGRCC EQU   X'10'                           A CONDITIONAL COMMAND
*                                              WAS ISSUED BUT THE
*                                              CONDITION WAS NOT
*                                              MET(VTAM)         X03004
RPLSPECC EQU   X'14'                           A TEMPORARY OUT-OF-CORE
*                                              SITUATION EXISTS(VTAM)
*                                                                X03004
RPLCMDRT EQU   X'18'                           THE REQUEST WAS
*                                              CANCELLED BY THE RESET
*                                              COMMAND(VTAM)     X03004
RPLPURGE EQU   X'1C'                           THE COMMAND WAS
*                                              PURGED(VTAM)      X03004
RPLVTMNA EQU   X'20'                           VTAM IS NOT ACTIVE(VTAM)
*                                                                X03004
RPLSYERR EQU   X'24'                           SYSTEM ERROR(VTAM)X03004
RPLDEVDC EQU   X'28'                           DIAL LINE IS
*                                              DISCONNECTED(VTAM)X03004
RPLLIMEX EQU   X'2C'                           RESPONSE LIMIT
*                                              EXCEEDED(VTAM)   X3004BS
RPLEXRQ  EQU   X'30'                           EXCEPTION REQUEST
*                                              RECEIVED(VTAM)   X3004BS
RPLEXRS  EQU   X'34'                           EXCEPTION RESPONSE
*                                              RECEIVED(VTAM)   X3004BS
RPLNOIN  EQU   X'38'                           NO INPUT
*                                              AVAILABLE(VTAM)  X3004BS
RPLVABND EQU   X'3C'                           VTAM ENCOUNTERED ABEND
*                                              CONDITION       @XM08790
RPLERREG DS    XL1                             ALTERNATE NAME FOR
*                                              RPLRTNCD
RPLCNDCD DS    0XL2                            RPL CONDITION CODE
RPLCMPON DS    0XL1                            COMPONENT ISSUING
*                                              CODE(VSAM)
RPLFDB2  DS    XL1                             REASON CODE(VTAM) X03004
RPLERLK  EQU   X'80'                           ERROR LOCK SET    X03004
RPLRVID  EQU   X'40'                           RVI RECEIVED      X03004
RPLATND  EQU   X'20'                           ATTN RECEIVED     X03004
RPLDVUNS EQU   X'10'                           DEVICE UNUSABLE   X03004
RPLIOERR EQU   X'08'                           I/O ERROR TYPE- 0=INPUT/
*                                              1=OUTPUT          X03004
RPLDLGFL EQU   X'04'                           DIALOG INIT FAILED
*                                                                X03004
RPLCUERR EQU   X'02'                           CONTROL UNIT FAILURE
*                                                                X03004
RPLSTSAV EQU   X'01'                           SENSE BYTES PRESENT
*                                                                X03004
RPLERRCD DS    0XL1                            ERROR CODE(VSAM)
RPLFDB3  DS    XL1                             DATA FLAGS(VTAM)  X03004
RPLUINPT EQU   X'80'                           UNSOLICITED INPUT X03004
RPLSV32  EQU   X'40'                           RESERVED          X03004
RPLREOB  EQU   X'20'                           END OF BLOCK      X03004
RPLREOM  EQU   X'10'                           END OF MESSAGE    X03004
RPLREOT  EQU   X'08'                           END OF TRANSMISSION
*                                                                X03004
RPLLGFRC EQU   X'04'                           LOGOFF DETECTED   X03004
RPLRLG   EQU   X'02'                           LEADING GRAPHICS
*                                              RECEIVED          X03004
RPLRDSOH EQU   X'01'                           START OF HEADER (SOH)
*                                              RECEIVED          X03004
RPLKEYLE DS    0H                              KEY LENGTH (PROC=GEN)
RPLKEYL  DS    H                               ALTERNATE NAME FOR
*                                              RPLKEYLE
RPLSTRID DS    H                               CCW STRING IDENTIFIER
RPLCCHAR DS    A                               POINTER TO CONTROL
*                                              CHARACTER FOR UNIT
*                                              RECORD DEVICES
RPLDACB  DS    A                               POINTER TO DATA ACB
RPLTCBPT DS    A                               POINTER TO TCB
RPLAREA  DS    A                               POINTER TO AREA
*                                              CONTAINING DATA RECORD
RPLARG   DS    0A                              POINTER TO SEARCH
*                                              ARGUMENT; POINTER TO
*                                              RELATIVE ADDRESS FOR
*                                              POINT OPERATION; POINTER
*                                              TO SETPRT PARMLIST
RPLSAF   DS    XL2                             SOURCE ADDRESS
*                                              FIELD(VTAM)       X03004
RPLDAF   DS    XL2                             DESTINATION ADDRESS
*                                              FIELD(VTAM)       X03004
RPLOPTCD DS    0BL4                            OPTION CODES
RPLOPT1  DS    BL1                             OPTION BYTE 1
RPLLOC   EQU   X'80'                           LOCATE MODE; MOVE MODE
*                                              IF 0
RPLDIR   EQU   X'40'                           DIRECT ACCESS
RPLSEQ   EQU   X'20'                           SEQUENTIAL ACCESS
RPLSKP   EQU   X'10'                           SKIP SEQUENTIAL ACCESS
RPLASY   EQU   X'08'                           ASYNCHRONOUS PROCESSING
RPLKGE   EQU   X'04'                           SEARCH KEY GT/EQ
RPLGEN   EQU   X'02'                           GENERIC KEY REQUEST
RPLECBSW EQU   X'01'                           EXTERNAL ECB
RPLECBIN EQU   X'01'                           ALTERNATE NAME FOR
*                                              RPLECBSW          X03004
RPLOPT2  DS    BL1                             OPTION BYTE 2
RPLKEY   EQU   X'80'                           KEYED ACCESS
RPLADR   EQU   X'40'                           ADDRESSED ACCESS
RPLADD   EQU   X'40'                           ALTERNATE NAME FOR
*                                              RPLADR
RPLCNV   EQU   X'20'                           CONTROL INTERVAL ACCESS
RPLBWD   EQU   X'10'                           FWD=0/BWD=1      X04SVHS
RPLLRD   EQU   X'08'                           ARD=0/LRD=1      X04SVHS
RPLWAITX EQU   X'04'                           AYNCH PROC WAIT @ZA07549
RPLUPD   EQU   X'02'                           UPDATE
RPLNSP   EQU   X'01'                           NOTE STRING POSITION
RPLOPT3  DS    BL1                             OPTION BYTE 3
RPLEODS  EQU   X'80'                           END OF USER SYSOUT
RPLSFORM EQU   X'40'                           SPECIAL FORM ON REMOTE
*                                              PRINTER
RPLBLK   EQU   X'20'                           BLOCKED UCS DATA CHECKS
*                                              FIXED BLOCK PROCESSING
RPLVFY   EQU   X'10'                           VERIFY UCS/FCB
*                                              INFORMATION
RPLFLD   EQU   X'08'                           LOAD UCS BUFFER IN
*                                              FOLD MODE
RPLFMT   EQU   X'02'                           FCB LOAD
RPLFRMT  EQU   X'06'                           UCS LOAD IF 00
RPLALIGN EQU   X'01'                           ALIGN FCB BUFFER LOADING
RPLOPT4  DS    BL1                             OPTCD BYTE 4
RPLENDTR EQU   X'80'                           3800 END OF TRANSMISSION
*                                                              @Z40SVHS
RPLMKFRM EQU   X'40'                           3800 MARK FORM  @Z40SVHS
RPLNXTRP DS    0A                              POINTER TO NEXT RPL
RPLCHAIN DS    A                               ALTERNATE NAME FOR
*                                              RPLNXTRP
RPLRLEN  DS    A                               LENGTH OF RECORD
RPLBUFL  DS    A                               USER BUFFER LENGTH
RPLOPTC2 DS    0XL4                            VTAM OPTIONS      X03004
RPLOPT5  DS    XL1                             OPTION BYTE 5     X03004
RPLDLGIN EQU   X'80'                           CONTINUE READING IN
*                                              SPECIFIC TERMINAL MODE;
*                                              IF 0, CONTINUE READING
*                                              IN ANY TERMINAL MODE
*                                                                X03004
RPLSSNIN EQU   X'40'                           CONTINUE DIALOG WITH THE
*                                              SAME TERMINAL; IF 0, END
*                                              DIALOG WITH THAT
*                                              TERMINAL          X03004
RPLPSOPT EQU   X'20'                           PASS TERMINAL TO
*                                              REQUESTING APPLICATION;
*                                              IF 0, MAKE TERMINAL
*                                              AVAILABLE TO ANY
*                                              APPLICATION       X03004
RPLNERAS EQU   X'10'                           WRITE TO 3270 BUT DO NOT
*                                              ERASE WHAT IS CURRENTLY
*                                              DISPLAYED         X03004
RPLEAU   EQU   X'08'                           WRITE TO 3270 AND ERASE
*                                              UNPROTECTED FIELDSX03004
RPLERACE EQU   X'04'                           WRITE TO 3270 AND ERASE
*                                              CURRENT DISPLAY   X03004
RPLNODE  EQU   X'02'                           READ FROM ANY TERMINAL;
*                                              IF 0, READ FROM A
*                                              SPECIFIC TERMINAL X03004
RPLWROPT EQU   X'01'                           CONVERSATIONAL MODE;
*                                              IF 0, NON-CONVERSATIONAL
*                                              MODE              X03004
RPLOPT6  DS    XL1                             OPTION BYTE 6     X03004
RPLEOB   EQU   X'80'                           WRITE A BLOCK OF DATA
*                                                                X03004
RPLEOM   EQU   X'40'                           WRITE THE LAST BLOCK
*                                              OF A MESSAGE      X03004
RPLEOT   EQU   X'20'                           WRITE THE LAST BLOCK
*                                              OF THE TRANSMISSION
*                                                                X03004
RPLCOND  EQU   X'10'                           DO NOT STOP OPERATION
*                                              IF STARTED (USED WITH
*                                              RESET REQUEST)    X03004
RPLNCOND EQU   X'08'                           STOP OPERATION
*                                              IMMEDIATELY (USED WITH
*                                              RESET REQUEST)    X03004
RPLLOCK  EQU   X'04'                           RESET ERROR LOCK TO
*                                              UNLOCKED STATUS   X03004
RPLRSV67 EQU   X'02'                           RESERVED          X03004
RPLRSV68 EQU   X'01'                           RESERVED          X03004
RPLOPT7  DS    XL1                             OPTION BYTE 7     X03004
RPLCNALL EQU   X'80'                           ALL TERMINALS IN OPNDST
*                                              LIST MUST BE AVAILABLE
*                                              BEFORE ANY ARE CONNECTED
*                                                                X03004
RPLCNANY EQU   X'40'                           CONNECT ANY ONE TERMINAL
*                                              IN OPNDST LIST    X03004
RPLCNIMM EQU   X'20'                           RESERVED          X03004
RPLQOPT  EQU   X'10'                           QUEUE THE OPNDST REQUEST
*                                              IF IT CANNOT BE
*                                              SATISFIED IMMEDIATELY;
*                                              IF 0, REJECT THE OPNDST
*                                              REQUEST IF IT CANNOT BE
*                                              SATISFIED IMMEDIATELY
*                                                                X03004
RPLTPOST EQU   X'08'                           RPL ALREADY UNDER PSS
*                                                              @XM08790
RPLRLSOP EQU   X'04'                           SCHEDULE THE RELREQ EXIT
*                                              OF THE REQUIRED TERMINAL
*                                              IMMEDIATELY; IF 0,
*                                              EITHER WAIT FOR THE
*                                              TERMINAL TO BECOME
*                                              AVAILABLE OR REJECT THE
*                                              REQUEST IF THE TERMINAL
*                                              IS BUSY(DEPENDS ON THE
*                                              SETTING OF RPLQOPT)
*                                                                X03004
RPLTCRNO EQU   X'02'                           CLOSE IN PROCESS FOR PO
*                                              INTERFACE       @Z40BHUC
RPLRSV78 EQU   X'01'                           RESERVED          X03004
RPLOPT8  DS    XL1                             OPTION BYTE 8     X03004
RPLODACQ EQU   X'80'                           THE APPLICATION REQUIRES
*                                              A SPECIFIC TERMINAL
*                                                                X03004
RPLODACP EQU   X'40'                           THE APPLICATION WILL
*                                              ACCEPT ANY TERMINAL
*                                              DESIRING LOGON    X03004
RPLODPRM EQU   X'20'                           A SPECIFIC TERMINAL IS
*                                              TO BE PREEMPTED EVEN
*                                              THOUGH ANOTHER
*                                              APPLICATION IS HOLDING
*                                              IT (TOLTEP ONLY)  X03004
RPLPEND  EQU   X'10'                           PREEMPT THE TERMINAL
*                                              AFTER ALL PENDING
*                                              OPERATIONS ARE COMPLETED
*                                              (TOLTEP ONLY)     X03004
RPLSESS  EQU   X'08'                           PREEMPT THE TERMINAL
*                                              AFTER COMPLETION OF THE
*                                              CURRENT DIALOG SESSION
*                                              (TOLTEP ONLY)     X03004
RPLACTV  EQU   X'04'                           PREEMPT THE TERMINAL IF
*                                              CONNECTED BUT NOT BUSY
*                                              (TOLTEP ONLY)     X03004
RPLUNCON EQU   X'02'                           PREEMPT THE TERMINAL
*                                              IMMEDIATELY
*                                              (TOLTEP ONLY)     X03004
RPLRSV88 EQU   X'01'                           RESERVED          X03004
RPLRBAR  DS    0CL8                            RBA RETURN LOCATION
RPLAIXPC DS    CL2                             AIX POINTER COUNTX04SVHS
RPLAIXID DS    XL1                             AIX POINTER TYPE X04SVHS
RPLAXPKP EQU   X'80'                           RBA=1/PRIME=0
         DS    XL1                             RESERVED         X04SVHS
RPLDDDD  DS    CL4                             RETURN AREA FOR
*                                              RELATIVE BYTE ADDRESS
RPLEXTDS DS    0XL1                            EXIT DEFINITIONS@Z9999DT
RPLEXTD1 DS    XL1                             ALTERNATE NAME FOR
*                                              RPLEXTDS          X03004
RPLEXSCH EQU   X'80'                           AN EXIT HAS BEEN
*                                              SCHEDULED         X03004
RPLNEXIT EQU   X'40'                           NO EXIT WAS SPECIFIED
*                                                                X03004
RPLEXIT  EQU   X'20'                           ASYNCH EXIT     @XM01127
RPLTCRYP EQU   X'08'                           IF ON, ENCRYPTION
*                                              FEATURE REQ     @G40AKSL
RPLNIB   EQU   X'04'                           THE RPLARG FIELD
*                                              CONTAINS A POINTER
*                                              TO THE NIB        X03004
RPLBRANC EQU   X'02'                           USE A BRANCH ENTRY
*                                              TO THE MACRO      X03004
RPLACTIV DS    XL1                             ACTIVE INDICATOR -
*                                              X'FF' INDICATES ACTIVE;
*                                              X'00' INDICATES INACTIVE
*                                                                X03004
RPLEMLEN DS    H                               LENGTH OF THE ERROR
*                                              MESSAGE AREA
RPLERMSA DS    A                               POINTER TO THE ERROR
*                                              MESSAGE AREA
         AGO   .L99
.L30B    AIF   ('&PL(&I)' NE 'SVC99' AND '&PL(&I)' NE 'SVC99BLK').L31
***********************************************************************
*                SVC 99 INPUT REQUEST BLOCK
***********************************************************************
S99RBP   DS     0F
S99RBPTR DS     F                      REQUEST BLOCK POINTER
S99RBPND EQU    X'80'                  LAST POINTER INDICATOR
S99RB    DS     0F                     REQUEST BLOCK
S99RBLN  DS     CL1                    LENGTH OF REQUEST BLOCK
S99VERB  DS     CL1                    VERB CODE
S99VRBAL EQU    X'01'                  ALLOCATION
S99VRBUN EQU    X'02'                  UNALLOCATION
S99VRBCC EQU    X'03'                  CONCATENATION
S99VRBDC EQU    X'04'                  DECONCATENATION
S99VRBRI EQU    X'05'                  REMOVE IN-USE
S99VRBDN EQU    X'06'                  DDNAME ALLOCATION
S99VRBIN EQU    X'07'                  INFORMATION RETRIEVAL
S99FLAG1 DS     0CL2                   FLAGS
S99FLG11 DS     CL1                    FIRST FLAGS BYTE
S99ONCNV EQU    X'80'                  ALLOC FUNCTION-DO NOT USE AN
*                                      EXISTING ALLOCATION THAT DOES
*                                      NOT HAVE THE CONVERTIBLE
*                                      ATTRIBUTE TO SATISFY A REQUEST
S99NOCNV EQU    X'40'                  ALLOC FUNCTION-DO NOT USE AN
*                                      EXISTING ALLOCATION TO SATISFY
*                                      THE REQUEST
S99NOMNT EQU    X'20'                  ALLOC FUNCTION-DO NOT MOUNT
*                                      VOLUMES OR CONSIDER OFFLINE
*                                      UNITS (THIS FLAG OVERRIDES
*                                      S99MOUNT AND S99OFFLN BELOW)
S99JBSYS EQU    X'10'                  ALLOC FUNC-JOB RELATED SYSOUT
S99CNENQ EQU    X'08'                  ALL FUNCTIONS-ISSUE A   @ZA32641
*                                      CONDITIONAL ENQ ON TIOT @ZA32641
*                                      RESOURCE. IF NOT        @ZA32641
*                                      AVAILABLE, RETURN AN    @ZA32641
*                                      ERROR CODE TO USER.     @ZA32641
S99FLG12 DS     CL1                    SECOND BYTE OF FLAGS
S99RSC   DS     0CL4                   REASON CODE FIELDS
S99ERROR DS     XL2                    ERROR REASON CODE
S99INFO  DS     XL2                    INFORMATION REASON CODE
S99TXTPP DS     F                      ADDR OF LIST OF TEXT UNIT PTRS
S99RSV01 DS     F                      RESERVED
S99FLAG2 DS     0CL4                   FLAGS FOR AUTHORIZED FUNCTIONS
S99FLG21 DS     CL1                    FIRST BYTE OF FLAGS
S99WTVOL EQU    X'80'                  ALLOC FUNCTION-WAIT FOR
*                                      VOLUMES
S99WTDSN EQU    X'40'                  ALLOC FUNCTION-WAIT FOR DSNAME
S99NORES EQU    X'20'                  ALLOC FUNCTION-DO NOT DO
*                                      DATA SET RESERVATION
S99WTUNT EQU    X'10'                  ALLOC FUNCTION-WAIT FOR UNITS
S99OFFLN EQU    X'08'                  ALLOC FUNCTION-CONSIDER OFFLINE
*                                      UNITS
S99TIONQ EQU    X'04'                  ALL FUNCTIONS-TIOT ENQ ALREADY
*                                      DONE
S99CATLG EQU    X'02'                  ALLOC FUNCTION-SET SPECIAL
*                                      CATALOG DATA SET INDICATORS
S99MOUNT EQU    X'01'                  ALLOC FUNCTION-MAY MOUNT VOLUME
S99FLG22 DS     CL1                    SECOND BYTE OF FLAGS
S99UDEVT EQU    X'80'                  ALLOCATION FUNCTION-UNIT NAME
*                                      PARM IS A DEVICE TYPE
S99PCINT EQU    X'40'                  ALLOC FUNCTION-ALLOC    @Y30QPPB
*                                      PRIVATE CATALOG TO      @Y30QPPB
*                                      INITIATOR               @Y30QPPB
S99FLG23 DS     CL1                    THIRD BYTE OF FLAGS
S99FLG24 DS     CL1                    FOURTH BYTE OF FLAGS
S99RBEND EQU    *                      END MARKER
***********************************************************************
* SVC 99 TEXT UNIT POINTER LIST
***********************************************************************
S99TUPL  DS     0F                     TEXT UNIT POINTER LIST
S99TUPTR DS     F                      TEXT UNIT POINTER
S99TUPLN EQU    X'80'                  LAST TEXT UNIT POINTER IN LIST
***********************************************************************
* SVC 99 TEXT UNIT
***********************************************************************
S99TUNIT DS     0X                     TEXT UNIT
S99TUKEY DS     XL2                    KEY
S99TUNUM DS     XL2                    N0. OF LENGTH+PARAMETER ENTRIES
S99TUENT DS     0C                     ENTRY OF LENGTH+PARAMETER
S99TULNG DS     XL2                    LENGH OF 1ST (OR ONLY) PARAMETER
S99TUPAR DS     C                      1ST (OR ONLY) PARAMETER
* THE FOLLOWING DSECT IS PROVIDED FOR USE WITH MULTIPLE
* LENGTH/PARAMETER ENTRIES TO ALLOW ZERO DISPLACEMENT TO THE
* LENGTH FIELD
S99TUFLD DS     0X
S99TULEN DS     XL2                    LENGTH OF PARAMETER
S99TUPRM DS     C                      PARAMETER
         AIF   ('&PL(&I)' EQ 'SVC99BLK').L99
.L31     AIF   ('&PL(&I)' NE 'SVC99' AND '&PL(&I)' NE 'SVC99EQU').L31A
***********************************************************************
*
* KEYS FOR ALLOCATION FUNCTION
*
***********************************************************************
DALDDNAM EQU   X'0001'                 DDNAME
DALDSNAM EQU   X'0002'                 DSNAME
DALMEMBR EQU   X'0003'                 MEMBER NAME
DALSTATS EQU   X'0004'                 DATA SET STATUS
DALNDISP EQU   X'0005'                 DATA SET NORMAL DISPOSITION
DALCDISP EQU   X'0006'                 DATA SET CONDITIONAL DISP
DALTRK   EQU   X'0007'                 TRACK SPACE TYPE
DALCYL   EQU   X'0008'                 CYLINDER SPACE TYPE
DALBLKLN EQU   X'0009'                 AVERAGE DATA BLOCK LENGTH
DALPRIME EQU   X'000A'                 PRIMARY SPACE QUANTITY
DALSECND EQU   X'000B'                 SECONDARY SPACE QUANTITY
DALDIR   EQU   X'000C'                 DIRECTORY SPACE QUANTITY
DALRLSE  EQU   X'000D'                 UNUSED SPACE RELEASE
DALSPFRM EQU   X'000E'                 CONTIG,MXIG,ALX SPACE FORMAT
DALROUND EQU   X'000F'                 WHOLE CYLINDER (ROUND) SPACE
DALVLSER EQU   X'0010'                 VOLUME SERIAL
DALPRIVT EQU   X'0011'                 PRIVATE VOLUME
DALVLSEQ EQU   X'0012'                 VOL SEQUENCE NUMBER
DALVLCNT EQU   X'0013'                 VOLUME COUNT
DALVLRDS EQU   X'0014'                 VOLUME REFERENCE TO DSNAME
DALUNIT  EQU   X'0015'                 UNIT DESCRIPTION
DALUNCNT EQU   X'0016'                 UNIT COUNT
DALPARAL EQU   X'0017'                 PARALLEL MOUNT
DALSYSOU EQU   X'0018'                 SYSOUT
DALSPGNM EQU   X'0019'                 SYSOUT PROGRAM NAME
DALSFMNO EQU   X'001A'                 SYSOUT FORM NUMBER
DALOUTLM EQU   X'001B'                 OUTPUT LIMIT
DALCLOSE EQU   X'001C'                 UNALLOCATE AT CLOSE
DALCOPYS EQU   X'001D'                 SYSOUT COPIES
DALLABEL EQU   X'001E'                 LABEL TYPE
DALDSSEQ EQU   X'001F'                 DATA SET SEQUENCE NUMBER
DALPASPR EQU   X'0020'                 PASSWORD PROTECTION
DALINOUT EQU   X'0021'                 INPUT ONLY OR OUTPUT ONLY
DALEXPDT EQU   X'0022'                 EXPIRATION DATE
DALRETPD EQU   X'0023'                 RETENTION PERIOD
DALDUMMY EQU   X'0024'                 DUMMY ALLOCATION
DALFCBIM EQU   X'0025'                 FCB IMAGE-ID
DALFCBAV EQU   X'0026'                 FCB FORM ALIGNMENT,IMAGE VERIFY
DALQNAME EQU   X'0027'                 QNAME ALLOCATION
DALTERM  EQU   X'0028'                 TERMINAL ALLOCATION
DALUCS   EQU   X'0029'                 UNIVERSAL CHARACTER SET
DALUFOLD EQU   X'002A'                 UCS FOLD MODE
DALUVRFY EQU   X'002B'                 UCS VERIFY CHARACTER SET
DALDCBDS EQU   X'002C'                 DCB DSNAME REFERENCE
DALDCBDD EQU   X'002D'                 DCB DDNAME REFERENCE
DALBFALN EQU   X'002E'                 BUFFER ALIGNMENT
DALBFTEK EQU   X'002F'                 BUFFERING TECHNIQUE
DALBLKSZ EQU   X'0030'                 BLOCKSIZE
DALBUFIN EQU   X'0031'                 NUMBER OF INPUT BUFFERS
DALBUFL  EQU   X'0032'                 BUFFER LENGTH
DALBUFMX EQU   X'0033'                 MAXIMUM NUMBER OF BUFFERS
DALBUFNO EQU   X'0034'                 NUMBER OF DCB BUFFERS
DALBUFOF EQU   X'0035'                 BUFFER OFFSET
DALBUFOU EQU   X'0036'                 NUMBER OF OUTPUT BUFFERS
DALBUFRQ EQU   X'0037'                 NUMBER OF GET MACRO BUFFERS
DALBUFSZ EQU   X'0038'                 LINE BUFFER SIZE
DALCODE  EQU   X'0039'                 PAPER TAPE CODE
DALCPRI  EQU   X'003A'                 SEND/RECEIVE PRIORITY
DALDEN   EQU   X'003B'                 TAPE DENSITY
DALDSORG EQU   X'003C'                 DATA SET ORGANIZATION
DALEROPT EQU   X'003D'                 ERROR OPTIONS
DALGNCP  EQU   X'003E'                 NO. OF GAM I/O BEFORE WAIT
DALINTVL EQU   X'003F'                 POLLING INTERVAL
DALKYLEN EQU   X'0040'                 DATA SET KEYS LENGTH
DALLIMCT EQU   X'0041'                 SEARCH LIMIT
DALLRECL EQU   X'0042'                 LOGICAL RECORD  LENGTH
DALMODE  EQU   X'0043'                 CARD READER/PUNCH MODE
DALNCP   EQU   X'0044'                 NO. READ/WRITE BEFORE CHECK
DALOPTCD EQU   X'0045'                 OPTIONAL SERVICES
DALPCIR  EQU   X'0046'                 RECEIVING PCI
DALPCIS  EQU   X'0047'                 SENDING PCI
DALPRTSP EQU   X'0048'                 PRINTER LINE SPACING
DALRECFM EQU   X'0049'                 RECORD FORMAT
DALRSRVF EQU   X'004A'                 FIRST BUFFER RESERVE
DALRSRVS EQU   X'004B'                 SECONDARY BUFFER RESERVE
DALSOWA  EQU   X'004C'                 TCAM USER WORK AREA SIZE
DALSTACK EQU   X'004D'                 STACKER BIN
DALTHRSH EQU   X'004E'                 MESSAGE QUEUE PERCENTAGE
DALTRTCH EQU   X'004F'                 7-TRACK RECORDING TECHNIQUE
DALPASSW EQU   X'0050'                 PASSWORD
DALIPLTX EQU   X'0051'                 IPL TEXT ID
DALPERMA EQU   X'0052'                 PERMANENTLY ALLOCATED ATTRIB
DALCNVRT EQU   X'0053'                 CONVERTIBLE ATTRIBUTE
DALDIAGN EQU   X'0054'                 OPEN/CLOSE/EOV DIAGNOSTIC TRACE
DALRTDDN EQU   X'0055'                 RETURN DDNAME
DALRTDSN EQU   X'0056'                 RETURN DSNAME
DALRTORG EQU   X'0057'                 RETURN D.S. ORGANIZATION
DALSUSER EQU   X'0058'                 SYSOUT REMOTE USER
DALSHOLD EQU   X'0059'                 SYSOUT HOLD QUEUE
DALFUNC  EQU   X'005A'                 D.S. TYPE FOR 3525 CARD DEVICE
DALFRID  EQU   X'005B'                 IMAGELIB MEMBER FOR SHARK
DALSSREQ EQU   X'005C'                 SUBSYSTEM REQUEST
DALRTVOL EQU   X'005D'                 RETURN VOLUME SERIAL
DALMSVGP EQU   X'005E'                 MSVGP FOR 3330V        @Y30LPPD
DALSSNM  EQU   X'005F'                 SUBSYSTEM NAME REQUEST @G29AN2F
DALSSPRM EQU   X'0060'                 SUBSYSTEM PARAMETERS   @G29AN2F
DALPROT  EQU   X'0061'                 RACF PROTECT FEATURE   @G32HPPJ
DALSSATT EQU   X'0062'                 SUBSYSTEM ATTRIBUTE    @ZA25778
**********************************************************************
*
* KEYS FOR CONCATENATION FUNCTION
*
**********************************************************************
DCCDDNAM EQU   X'0001'                 DDNAMES
DCCPERMC EQU   X'0004'                 PERMANENTLY CONCATENATED
**********************************************************************
*
* KEYS FOR DECONCATENATION FUNCTION
*
***********************************************************************
DDCDDNAM EQU   X'0001'                 DDNAME
***********************************************************************
*
* KEYS FOR INFORMATION RETRIEVAL FUNCTION
*
***********************************************************************
DINDDNAM EQU   X'0001'                 DDNAME
DINDSNAM EQU   X'0002'                 DSNAME
DINRTDDN EQU   X'0004'                 RETURN DDNAME
DINRTDSN EQU   X'0005'                 RETURN DSNAME
DINRTMEM EQU   X'0006'                 RETURN MEMBER NAME
DINRTSTA EQU   X'0007'                 RETURN DATA SET STATUS
DINRTNDP EQU   X'0008'                 RETURN NORMAL DISPOSITION
DINRTCDP EQU   X'0009'                 RETURN CONDITIONAL DISP
DINRTORG EQU   X'000A'                 RETURN D.S. ORGANIZATION
DINRTLIM EQU   X'000B'                 RETURN # TO NOT-IN-USE LIMIT
DINRTATT EQU   X'000C'                 RETURN DYN. ALLOC ATTRIBUTES
DINRTLST EQU   X'000D'                 RETURN LAST ENTRY INDICATION
DINRTTYP EQU   X'000E'                 RETURN D.S. TYPE INDICATION
DINRELNO EQU   X'000F'                 RELATIVE REQUEST NUMBER
**********************************************************************
*
* KEYS FOR REMOVE IN-USE FUNCTION
*
**********************************************************************
DRITCBAD EQU   X'0001'                 TCB ADDRESS
DRICURNT EQU   X'0002'                 CURRENT TASK OPTION
**********************************************************************
*
* KEYS FOR DDNAME ALLOCATION FUNCTION
*
**********************************************************************
DDNDDNAM EQU   X'0001'                 DDNAME
DDNRTDUM EQU   X'0002'                 RETURN DUMMY D.S. INDICATION
**********************************************************************
*
* KEYS FOR UNALLOCATION FUNCTION
*
**********************************************************************
DUNDDNAM EQU   X'0001'                 DDNAME
DUNDSNAM EQU   X'0002'                 DSNAME
DUNMEMBR EQU   X'0003'                 MEMBER NAME
DUNOVDSP EQU   X'0005'                 OVERRIDING DISPOSITION
DUNUNALC EQU   X'0007'                 UNALLOC OPTION
DUNREMOV EQU   X'0008'                 REMOVE OPTION
DUNOVSNH EQU   X'000A'                 OVERRIDING SYSOUT NOHOLD
DUNOVCLS EQU   X'0018'                 OVERRIDING SYSOUT CLASS
DUNOVSUS EQU   X'0058'                 OVERRIDING SYSOUT REMOTE USER
DUNOVSHQ EQU   X'0059'                 OVERRIDING SYSOUT HOLD QUEUE
         AGO   .L99
.L31A    AIF   ('&PL(&I)' NE      'STPB').L32
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR29
***********************************************************************
*    THE STACK PARAMETER BLOCK (STPB) IS A BLOCK POINTED TO BY THE    *
*    STPL.  STACK USES IT TO STORE THE ADDRESS OF THE (STORAGE) LIST  *
*    THE STACK PARAMETER BLOCK (STPB) IS A BLOCK POINTED TO BY THE    *
*    STPL.  STACK USES IT TO STORE THE ADDRESS OF THE (STORAGE) LIST  *
*    SOURCE DESCRIPTOR (LSD), INPUT AND OUTPUT DDNAMES, AS WELL AS    *
*    FOR CONTROL.                                                     *
***********************************************************************
         SPACE 1
.PR29    ANOP
STPB     DS    0D
         DS    CL4      INTERNAL TO STACK
STPBALSD DS    A        ADDR OF (STORAGE) LIST SOURCE DESCRIPTOR
STPBINDD DS    A        ADDR OF INPUT DDNAME
STPBOTDD DS    A        ADDR OF OUTPUT DDNAME
STPBMBRN DS    A        ADDR OF MEMBER NAME
         AGO   .L99
.L32     AIF   ('&PL(&I)' NE      'STPL').L33
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR30
***********************************************************************
*    THE STACK PARAMETER LIST (STPL) IS A LIST OF ADDRESSES PASSED    *
*    FROM THE INVOKER TO STACK VIA REGISTER 1                         *
***********************************************************************
         SPACE 1
.PR30    ANOP
STPL     DS    0D
STPLUPT  DS    A        PTR TO UPT
STPLECT  DS    A        PTR TO ECT
STPLECB  DS    A        PTR TO CP'S ECB
STPLSTPB DS    A        PTR TO STACK PARM BLOCK
         AGO   .L99
.L33     AIF   ('&PL(&I)' NE      'TAIE').L34
         SPACE 1
TAIE     DS    0D
TAIEMSGL DS    CL2 .    MESSAGE LENGTH
TAIETGET DS    CL1 .    RET CODE FROM TGET ISSUED BY ATTN PROL LOG
*                       TO BE CHECKED BY USER ATTN RTN
TAIEATTN DS    CL1 .    TO BE USED BY THE TMP                  @ZA08099
TAIEIAD  DS    1F .     RIGHT HALF OF INTERRUPT PSW
TAIERSAV DS    CL64 .   REGS. STORED HERE WHEN AN INTERRUPT
*                       TO MAINLINE OR ATTEN. EXIT OCCURS
TAIELNGT EQU   *-TAIE   LENGTH OF TAIE
         AGO   .L99
.L34     AIF   ('&PL(&I)' NE      'UPT').L35
         SPACE 1
         AIF   ('&OACPRT' EQ 'SHORT').PR31
***********************************************************************
*    THE USER PROFILE TABLE (UPT) IS BUILT BY THE LOGON/LOGOFF        *
*    SCHEDULER FROM INFORMATION STORED IN THE UADS AND FROM THE       *
*    LOGON COMMAND.  IT IS IN CORE SHARED BY THE TMP AND THE          *
*    LOGON/LOGOFF SCHEDULER.  CP'S AND SERVICE ROUTINES CAN MODIFY    *
*    THE UPT, BUT THEY CANNOT FREE IT.                                *
***********************************************************************
         SPACE 1
.PR31    ANOP
UPT      DS     0D
         DS    CL2      RESERVED
UPTUSER  DS    CL10     RESERVED FOR INSTALLATION USE
UPTSWS   DS    X        USERS ENVIRONMENT SWITCHES
UPTRCVR  EQU   X'80'    EDIT RECOVER OPTION IS REQUESTED DEFLT @Z40NQKG
UPTNPRM  EQU   X'40'    NO PROMPTING IS TO BE DONE
UPTMID   EQU   X'20'    PRINT MESSAGE IDENTIFIERS
UPTNCOM  EQU   X'10'    NO USER COMMUNICATION ALLOWED VIA SEND COMMAND
UPTPAUS  EQU   X'08'    PAUSE FOR '?' WHEN IN NON-INTERACTIVE MODE
UPTALD   EQU   X'04'    ATTN HAS BEEN SPECIFIED AS LINE DELETE CHAR
UPTMODE  EQU   X'02'    MODE MESSAGES DESIRED                    Y01676
UPTWTP   EQU   X'01'    WRITE TO PROGRAMMER MESSAGES DESIRED     Y02669
UPTCDEL  DS    CL1      CHAR DELETE CHARACTER
UPTLDEL  DS    CL1      LINE DELETE CHARACTER
         DS    CL1      RESERVED
UPTPREFX DS    CL7      DSNAME PREFIX                            Y02669
UPTPREFL DS    BL1      LENGTH OF DSNAME PREFIX                  Y02669
         AGO   .L99
.L35     ANOP
         MNOTE 12,'UNRECOGNIZED PL ''&PL(&I)'''
.L99     ANOP
&I       SETA  &I+1
         AIF   (&I LE &N).LOOP
         POP   PRINT
         MEND
