//HPZ$TPOS JOB ,ZBIEGIEN,MSGCLASS=W,CLASS=3
/*JOBPARM ROOM=3426
//TIMEHIST EXEC PGM=TIMEHIST
//STEPLIB  DD   DSN=PRODLIB,
//             DISP=SHR
//SYSUDUMP DD   SYSOUT=W
//PRINTER  DD   SYSOUT=W,
//             DCB=(LRECL=133,RECFM=FB,BLKSIZE=1729)
//TIMEDATA DD   DSN=&&PGRMR,
//             DISP=(OLD,DELETE,DELETE)
//*   ADD  SYSIN DD *  CARD WITH MULTIPLE DATA CARDS AFTER IT
//*  FIRST 6 COLUMNS OF DATA CARD IS THE HEX ADDRESS OR BLANK OF THE
//*        FIRST ENTRY IN THE TABLE
//*  NEXT 4 COLUMNS IS THE INTERVAL OF EACH SIZE IN THE TABLE
      0002
