)ATTR
  ! TYPE(OUTPUT)  INTENS(HIGH) SKIP(ON)
  + TYPE(TEXT)    INTENS(LOW) SKIP(ON)
  % TYPE(TEXT)    INTENS(HIGH) SKIP(ON)
  _ TYPE(INPUT)   INTENS(HIGH) CAPS(ON)
)BODY
%---------  BUILDING DEPOSIT LIB/CCF TURNOVER BACKOUT SERVICES ----------------
%COMMAND ===>_ZCMD                                                     +
+
+
% ACCOUTING CODE    ===>_ACCTCDE         +
+
% WORK ORDER NUMBER ===>_WORKORDR+   (WO......)
+
+
% BACKOUT OPTION    ===>_Z+          ( 1 = ALL | 2 = MEMBER SELECTION )
)INIT
 .ZVARS = '(BKOPT)'
 IF (&ZERRMSG ¬= ' ') .MSG = &ZERRMSG
)PROC
  VER (&ACCTCDE,NONBLANK)
  VER (&WORKORDR,NONBLANK)
  VER (&BKOPT,NONBLANK)
  VER (&BKOPT,RANGE,1,2)
)END
