)ATTR
  ! TYPE(OUTPUT)  INTENS(HIGH) SKIP(ON)
  + TYPE(TEXT)    INTENS(LOW) SKIP(ON)
  % TYPE(TEXT)    INTENS(HIGH) SKIP(ON)
  _ TYPE(INPUT)   INTENS(HIGH) CAPS(ON)
)BODY
%------- BUILDING DEPOSIT LIB/CCF CICS COBOL COMPILE SERVICES -----------------
%COMMAND ===>_ZCMD                                                     +
+
% LIBRARIAN MASTER DATASET:
+     PROJECT ===>_LIBPRJ  +
+     GROUP   ===>_LIBGRP  +
+     TYPE    ===>_LIBTYP  +
+     MEMBER  ===>_MEMBER  +         ACCOUNT CODE:_ACCTCDE         +
+
% SELECT COMPILE TYPE ===>_Z+ (1 THRU 4)
%     1.+  COMPILE/LINKEDT CICS COBOL PROGRAM
%     2.+  COMPILE/LINKEDT CICS COBOL PROGRAM WITH INTERTEST
%     3.+  COMPILE ONLY - CICS COBOL PROGRAM
%     4.+  COMPILE/TRANSLATE CICS COBOL COPYBOOK
+
+     LOADLIB ===>_CCFLOAD                                     +|
+
%  Enter Compile type, Member Name, Option if required (Y/N).
%  ENTER KEY = SUBMIT - PF3|PF15 = END/CANCEL - PF1|PF13 = MESSAGE HELP.
)INIT
  .ZVARS = '(COMPTYP)'
  .HELP = $CCFHASM
 IF (&ZERRMSG ¬= ' ') .MSG = &ZERRMSG
  IF (&CURSOR = ' ')
    &CURSOR = MEMBER
    IF (&LIBTYP = ' ')
      &CURSOR = LIBTYP
    IF (&LIBGRP = ' ')
      &CURSOR = LIBGRP
    IF (&LIBPRJ = ' ')
      &CURSOR = LIBPRJ
    .CURSOR = &CURSOR
    &COMPTYP = ' '
)PROC
  VER (&LIBPRJ,DSNAME)
  VER (&LIBGRP,DSNAME)
  VER (&LIBTYP,DSNAME)
  VER (&MEMBER,NAME)
  VER (&ACCTCDE,NONBLANK,PICT,NNNNNNNNNNNNNNNN)
  VER (&COMPTYP,NONBLANK)
  VER (&COMPTYP,RANGE,1,4)
  VER (&CCFLOAD,NONBLANK)
  VPUT (LIBPRJ,LIBGRP,LIBTYP) PROFILE
)END
