)ATTR
  ! TYPE(OUTPUT)  INTENS(HIGH) SKIP(ON)
  + TYPE(TEXT)    INTENS(LOW) SKIP(ON)
  % TYPE(TEXT)    INTENS(HIGH) SKIP(ON)
  _ TYPE(INPUT)   INTENS(HIGH) CAPS(ON)
)BODY
%---------- BUILDING DEPOSIT NETWARE SYSTEMS LAN SERVER BACKUP SERVICES --------
%COMMAND ===>_ZCMD                                                     +
+
% SELECT LAN SERVER FOR BACKUP RESTART ===>_Z + (1 THRU 11)
% 1.+  CS-SERVER1    ( CS1 - PTTS12D/W )
% 2.+  CS-SERVER2    ( CS2 - PTTS13D/W )
% 3.+  FINANCE-LAN   ( FIN - PTTS14D/W )
% 4.+  MIS-TEST-LAN  ( MIS - PTTS15D/W )
% 5.+  CS1-REALITY   ( REA - PTTS41D/W )
% 6.+  CS-SERVER4A   ( CS4 - PTTS46D/W )
% 7.+  CS-SERVER4B   ( CS4 - PTTS47D/W )
% 8.+  CS-SERVER5    ( CS5 - PTTS48D/W )
% 9.+  CS-SERVER5A   ( CS5 - PTTS49D   )
% 10.+ FIN-APPL      ( FIN - PTTS52D   )
% 11.+ COMM-SERVER   ( COM - PTTS20M   )
+
+
+ ( ENTER KEY = SELECT/CONTINUE   ***   PF3 | PF15 = QUIT/CANCEL )
)INIT
  .ZVARS = '(LAN)'
 IF (&ZERRMSG ¬= ' ') .MSG = &ZERRMSG
)PROC
  VER (&LAN,NONBLANK)
  VER (&LAN,RANGE,1,11)
)END
