)IM job
// SET LOAD='CENTER.LINKLIB'
// SET CLIST='CENTER.CLIST'
//TSO      EXEC PGM=IKJEFT01
//STEPLIB  DD  DSN=&LOAD,DISP=SHR
//SYSPROC  DD  DSN=&CLIST,DISP=SHR
//SYSUDUMP DD  SYSOUT=*
//SYSTSPRT DD  SYSOUT=*
//SYSTSIN  DD  *
  %RUNAUTH HOSTCMD sh echo Congratulations
//
