)ATTR
? TYPE(TEXT) COLOR(WHITE) INTENS(HIGH)
| TYPE(TEXT) COLOR(YELLOW) INTENS(HIGH)
% TYPE(OUTPUT) COLOR(YELLOW) INTENS(HIGH)
" TYPE(OUTPUT) COLOR(YELLOW) INTENS(HIGH) JUST(RIGHT)
)BODY WINDOW(42,4)
?FOR A FILE  OF %NUMREG  ?REGISTERS  OF
   ? LENGTH   %LREC    ?  YOU NEED
      "NUMTRK     ? TRACKS    OR
      "NUMCYL     ? CYLINDERS
)END
